{"organizations": [], "uuid": "6c4de690cf81ea5f7322df5ea064cd15c49a0741", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-stephen-m-cutler-former-general-counsel-of-jpmorgan-chase-co-and-sec-director-of-enforcement-to-join-simpson-thacher-as-a.html", "country": "US", "domain_rank": 767, "title": "Stephen M. Cutler, Former General Counsel of JPMorgan Chase & Co. and SEC Director of Enforcement, to Join Simpson Thacher as a Partner", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:30:00.000+02:00", "replies_count": 0, "uuid": "6c4de690cf81ea5f7322df5ea064cd15c49a0741"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-stephen-m-cutler-former-general-counsel-of-jpmorgan-chase-co-and-sec-director-of-enforcement-to-join-simpson-thacher-as-a.html", "ord_in_thread": 0, "title": "Stephen M. Cutler, Former General Counsel of JPMorgan Chase & Co. and SEC Director of Enforcement, to Join Simpson Thacher as a Partner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Simpson Thacher & Bartlett LLP announced today that Stephen M. Cutler, former General Counsel and current Vice Chairman of JPMorgan Chase & Co., will join the Firm as a Litigation Partner in April. Prior to his tenure at JPMorgan, Steve served as Director of Enforcement at the Securities and Exchange Commission. At Simpson Thacher, he will advise companies, boards and senior executives on government and internal investigations, corporate governance and regulatory matters, and high-stakes litigation.\n“We are thrilled to welcome Steve to Simpson Thacher,” said Bill Dougherty, Chairman of Simpson Thacher’s Executive Committee. “He is one of the leading lawyers of his generation, highly respected for his leadership and distinguished service in both the public and private sectors. Our clients will benefit from his unparalleled experience and insight as they navigate their most complex and challenging issues.”\n“I am delighted to return to private practice at Simpson Thacher,” said Steve. “It is an outstanding firm with which I have worked closely for many years. I look forward to partnering with wonderful colleagues and advising clients on some of their most important matters.”\nSteve joined JPMorgan in 2007 and served as General Counsel and head of the company’s Legal and Compliance activities worldwide throughout the global financial crisis. As General Counsel, he was also on JPMorgan’s Operating Committee and reported directly to the Chairman and CEO Jamie Dimon. In January 2016, he became a Vice Chairman of the firm.\nPaul Curnin, Co-Head of the Firm’s Litigation Department, said, “Steve’s experience is exceptional. I don’t know of any other lawyer who helped lead one of the country’s preeminent institutions through the financial crisis and also served as the SEC’s Director of Enforcement during a period of some of the agency’s most historic cases, including WorldCom and Enron.” Jon Youngwood, Co-Head of the Firm’s Litigation Department, added, “Steve will join a Department with a long roster of experienced former government attorneys and tested trial lawyers. We all look forward to working with him to address and solve the critical legal challenges that our clients face.”\nSteve served as Director of the SEC’s Division of Enforcement from 2001 to 2005 (and the Deputy Director from 1999 to 2001). While at the SEC, he oversaw 1,100 employees and led the agency’s investigations of numerous high-profile financial reporting, broker-dealer and investment advisor matters. Both before and immediately following his tenure at the SEC, Steve was a partner at the law firm WilmerHale in Washington, D.C., where his practice focused on government and internal investigations and market regulation.\nSteve earned a J.D. from Yale Law School, where he served as an editor of the Yale Law Journal, and a B.A., summa cum laude, from Yale University.\nSimpson Thacher’s Global Litigation Department represents a wide range of sophisticated clients, including financial institutions, corporations, boards, audit and special committees, and senior executives, in their most significant matters. The Firm offers a substantial bench of talent to effectively handle litigations, government and internal investigations, arbitrations and cross-border disputes in North and South America, Asia and Europe.\nABOUT SIMPSON THACHER & BARTLETT LLP\nSimpson Thacher & Bartlett LLP ( www.simpsonthacher.com ) is one of the world’s leading international law firms. The Firm was established in 1884 and has more than 900 lawyers. Headquartered in New York with offices in Beijing, Hong Kong, Houston, London, Los Angeles, Palo Alto, São Paulo, Seoul, Tokyo and Washington, D.C., the Firm provides coordinated legal advice and transactional capability to clients around the globe.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005930/en/\nSimpson Thacher & Bartlett LLP\nDanzey Burnham, 212-455-3509\ndburnham@stblaw.com\nSource: Simpson Thacher & Bartlett LLP", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.simpsonthacher.com&esheet=51751677&newsitemid=20180131005930&lan=en-US&anchor=www.simpsonthacher.com&index=1&md5=77267423aa09d75644d454dd0105c6ef", "http://www.businesswire.com/news/home/20180131005930/en/"], "published": "2018-01-31T19:30:00.000+02:00", "crawled": "2018-01-31T20:32:32.005+02:00", "highlightTitle": ""}