{"organizations": [], "uuid": "13ee2f25d78957b527736ecbae5a8dec8bc48f2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-fitch-group-a-nyc-company-spanning-three-centuries-acquired-by-technology-entrepreneur.html", "country": "US", "domain_rank": 767, "title": "Fitch Group, a NYC company spanning three centuries, acquired by technology entrepreneur", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.271, "site_type": "news", "published": "2018-01-25T16:04:00.000+02:00", "replies_count": 0, "uuid": "13ee2f25d78957b527736ecbae5a8dec8bc48f2c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-fitch-group-a-nyc-company-spanning-three-centuries-acquired-by-technology-entrepreneur.html", "ord_in_thread": 0, "title": "Fitch Group, a NYC company spanning three centuries, acquired by technology entrepreneur", "locations": [], "entities": {"persons": [{"name": "william contessa", "sentiment": "none"}, {"name": "contessa", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "naples", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "fitch group", "sentiment": "negative"}, {"name": "francis emory fitch company", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "topside advisors", "sentiment": "none"}, {"name": "marine corp", "sentiment": "none"}, {"name": "veterans capital", "sentiment": "none"}, {"name": "contessa", "sentiment": "none"}, {"name": "nyc", "sentiment": "none"}, {"name": "digital print", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, The legendary Francis Emory Fitch Company, d/b/a Fitch Group, a Digital Print and graphic Communications company, has been acquired by Topside Advisors, an acquisition vehicle owned by NYC businessman and digital entrepreneur, William Contessa. Contessa, a Marine Corp Veteran, received support from Veterans Capital, a Naples, FL-based alternative investment fund whose charter is biased toward helping veteran entrepreneurs. In this case, both the Managing Director of Veterans Capital and Contessa are Vietnam era veterans. Recently, Contessa had his eye on acquiring Fitch Group, a one hundred and thirty-year-old graphic communications company located in Manhattan. Veterans Capital has committed to supply the capital necessary for the purchase of capital equipment to be used in the planned expansion of the business and to act as the Company's financial advisor.\n\"There's a compelling story here\", says Contessa, \"a real New York story.\"\n\"Fitch Group has long served the Wall Street community and was located downtown on Liberty Street. Fitch specializes in high value, high impact, time-sensitive, and digitally printed communications. On 9/11, it, along with many of its customers, was blown away. And it would have stayed that way had it not been for the incredible loyalty of those long-time customers, loans and payments from NYC and FEMA and sheer grit! This money allowed Fitch to stay in business and reemerge at its new location at 229 West 28th street.\"\n\"Smaller than pre 9/11, for sure, but with the help of partners like Veterans Capital, as both a lender and financial advisor, we are going to fix that and grow Fitch to a multi-channel customer communications company larger than ever and we will do it in Manhattan. And there will be a Fitch on the team, John Fitch IV, great, great grandson of the founder, continuing this 130-year-old legacy well into the 21 Century.\"\nAbout Fitch Group\nAt Fitch Group, we are in the business of helping our customers in meeting their outbound communications needs, traditionally, their time-sensitive print and print design needs, soon, to expand to a multi-channel customer communications service provider. Our commitment to pairing the highest quality products with consistent and genuine customer service has benefited our company and our customers for generations. We continue to honor this commitment by implementing a staunch Quality Control system, which allows nothing to leave our facilities that does not meet or exceed our standard of excellence. ( www.fitchgroup.com )\nAbout Veterans Capital\nVeterans Capital Corp﻿ is a specialty finance company providing quality financial and leasing services to all types of business clients. We are committed to providing a sound financial alternative to traditional bank financing with competitive cost effective leasing and commercial loan solutions. Veterans Capital and its investment partners nationwide understand the value of long term relationships, building loyalty and making a commitment to its valued customers. ( www.vetcapcorp.com )\nFor press inquiries or general information, please contact:\nDarryl Dobin at darryl@drdassociates.com , Phone ( 973 ) 627-1204\nView original content: http://www.prnewswire.com/news-releases/fitch-group-a-nyc-company-spanning-three-centuries-acquired-by-technology-entrepreneur-300587844.html\nSOURCE Fitch Group", "external_links": ["http://www.prnewswire.com/news-releases/fitch-group-a-nyc-company-spanning-three-centuries-acquired-by-technology-entrepreneur-300587844.html", "http://www.vetcapcorp.com/", "http://www.fitchgroup.com/"], "published": "2018-01-25T16:04:00.000+02:00", "crawled": "2018-01-25T17:38:11.000+02:00", "highlightTitle": ""}