{"organizations": [], "uuid": "78b8546365afd6cf80bca8020d3146799d8d7957", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 20, "shares": 20, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968215-Bae5.1910x1000.jpeg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/this-is-how-salt-bae-became-the-most-famous-butcher-on-instagram-in-the-world.html", "country": "US", "domain_rank": 767, "title": "How Nusret Gokce became Salt Bae and opened Nusr-Et in New York City", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.228, "site_type": "news", "published": "2018-01-27T17:31:00.000+02:00", "replies_count": 0, "uuid": "78b8546365afd6cf80bca8020d3146799d8d7957"}, "author": "Nate Skid", "url": "https://www.cnbc.com/2018/01/26/this-is-how-salt-bae-became-the-most-famous-butcher-on-instagram-in-the-world.html", "ord_in_thread": 0, "title": "How Nusret Gokce became Salt Bae and opened Nusr-Et in New York City", "locations": [], "entities": {"persons": [{"name": "nusret gokce", "sentiment": "negative"}, {"name": "fat j", "sentiment": "neutral"}, {"name": "mel yu salt bae", "sentiment": "none"}, {"name": "gokce", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "6 Hours Ago | 01:03 \nIt was the second night of Nusr-Et's grand opening in Manhattan. The rapper Fat Joe, who was dining at the restaurant, leaned back in his chair to catch a better view as chef and owner Nusret Gokce — better known as Salt Bae — began his routine. Mel Yu Salt Bae admiring an Ottoman steak. \nWearing a fitted white t-shirt, dark trousers and gold-rimmed sunglasses at 6:30 in the evening, Salt Bae, the \" internet's sexiest butcher ,\" strutted to a table. With his left hand he grabbed a $130 ribeye by its bone, and with his right, sliced off the medium-rare meat in a single swipe. He cut the steak into strips, his hips moving in rhythm with his knife. \nThen, the moment everyone had been waiting for — he sent a flourish of salt cascading from the palm of his hand, down the length of his arm and onto the perfectly seared steak. (And the guests laps.) \n\"All of my feelings are coming from inside of the meat down to when I put the salt onto the meat,\" Gokce once explained to NBC News . \nGokce turned on his heel and, without saying a word, moved on to the next table. \nThe whole thing lasted about 45 seconds; the perfect length for an Instagram video. Nate Skid Salt Bae with CNBC senior producer Nate Skid and friends \nIt didn't matter that Gokce repeated the exact same Salt Bae number for everyone who ordered the pricey tomahawk chop. No one appeared disappointed. In fact, the shtick seemed to be the draw. \nIt's clear what attracts the masses, people willing to spend half a month's rent on dinner, and it's not the food. As Joshua David Stein put it in GQ : \"Is the steak transcendent? No, the steak is mundane, somewhat tough and rather bland. The hamburger is overcooked. The tartare is over-chopped.... Does that matter? It does not matter. One does not visit Salt Bae for steak alone any more than one goes to Mass for the wafers.\" \nSo who is the man who has charmed even the likes of Leonardo Di Carpio , who sat captivated by Gokce's routine at the Nusr-Et Dubai in 2017? \nNusret Gokce's rise to Salt Bae stardom began on January 7, 2017, the day he posted a 36-second video to Instagram titled, \"Ottoman Steak.\" In the clip, Gokce performs his signature moves, slicing a bone-in steak and ending with his patented sprinkling of salt. According to Bustle , within moments, the Twitter universe discovered the video and ran with it. The next day, Bruno Mars tweeted a picture of Salt Bae with the caption \"Annndddd I'm out,\" and a meme was born. Within 48 hours, the post had 2.4 million views. To date, the post has 16,154,893 views. \nThat is Salt Bae. As for the man behind the meme, Gokce was born just outside of Istanbul in 1983. His education ended a few years later — when he was 5 years old, according to the Wall Street Journal . \nGokce grew up the son of a miner with four siblings. At 13, he began working long hours as an apprentice to a local butcher. He spent the next decade working at Turkish steakhouses, NBC News reports. \nThen in 2009, Gokce headed to Buenos Aires — a city of carnivores — on a mission to learn more about the meat industry. He worked at a restaurant there, but his heart was set on bringing his love of meat to America. Nate Skid The Ottoman steak is a mustard-marinated bone-in ribeye for $130. \n\"I was always wishing and wishing to open up a restaurant,\" Gokce told NBC News. \nBy 2010, Gokce, then 27, had done just that. He opened his first Nusr-Et steakhouse in the Etiler neighborhood of Istanbul. It had eight tables and 10 employees. One day a Turkish businessman named Ferit Sahenk ate at the restaurant. Sahenk was so impressed, he invested in the nascent business, reports the Journal. \nWith his financing secure, Gokce was able to open more locations around the Middle East including in Ankara, Doha and Dubai. \nThen internet fame struck. Barely a year after that day in January, Gokce now has 13 restaurants around the world, from Abu Dhabi to Miami, and over 600 employees. The names of those who have eaten at his restaurants read like a who's who of pop culture: from Drake and DJ Khaled to Odell Beckham Jr. and P Diddy. He has been featured in dozens of articles, fawned over on late night television, and in Melbourne, Australia, there is even a mural of him — Gokce is pictured, frozen mid-salt, in his cobra-style pose. \nTo others, Gokce's life might seem a far cry from being a butcher's apprentice, but not for him: \"My life hasn't changed now,\" he told NBC News. \"I still keep going to work from the morning until midnight.\"", "external_links": [], "published": "2018-01-27T17:31:00.000+02:00", "crawled": "2018-01-27T17:31:20.031+02:00", "highlightTitle": ""}