{"organizations": [], "uuid": "cff9f9e387aee515acfaa465df564017b015db65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/us-health-addiction-safe-facility/drug-users-find-safety-community-in-underground-injection-facility-idINKBN1F12JI", "country": "US", "domain_rank": 408, "title": "Drug users find safety, community in underground injection facility", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T22:08:00.000+02:00", "replies_count": 0, "uuid": "cff9f9e387aee515acfaa465df564017b015db65"}, "author": "", "url": "https://in.reuters.com/article/us-health-addiction-safe-facility/drug-users-find-safety-community-in-underground-injection-facility-idINKBN1F12JI", "ord_in_thread": 0, "title": "Drug users find safety, community in underground injection facility", "locations": [], "entities": {"persons": [{"name": "ronnie co", "sentiment": "negative"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - - Intravenous drug users who inject in a secret U.S. facility where staff provide clean needles and guard against overdoses say they appreciate the site for letting them in off the streets and for its history-shaping role.\n“It’s history in the making,” one of the users of the underground supervised-injection facility told a researcher in a new International Journal of Drug Policy report. “It’s the first of its kind.”\nThe clandestine site, operating in an undisclosed urban area hard hit by the opioid epidemic, is the first known safe-injection site in the U.S.\nMore than 100 sanctioned sites openly operate in 66 cities throughout the world. Cities across the U.S., from New York and Boston to San Francisco and Seattle, have considered permitting similar facilities in response to a quadrupling of national overdose deaths during the past 15 years. But so far no American municipality has created a legal path for one.\nUnwilling to continue to stand by and watch drug users overdose and die, a nonprofit community organization in September 2014 opened an unlicensed five-booth facility where select visitors bring heroin and other drugs obtained elsewhere and shoot up under the watchful eyes of trained staff.\n“This very much came out of the sheer number of users who died,” said lead author Peter Davidson, a medical sociologist and professor at the University of California, San Diego.\nNo one has ever overdosed in a supervised-injection facility, where staff are equipped with the antidote naloxone to reverse overdoses, he said in a phone interview.\nFor his new study, Davidson interviewed a staff member and 22 users of the underground site. It performs as well as can be expected given the limitations of having to remain hidden, he said. He urged policymakers to bless an aboveground site “so we can really evaluate whether this works in the United States.”\nUsers of the site have been involved in setting the rules, Davidson said. They even voted on whether to allow him to evaluate the site.\n“They very much felt like it was their organization, their space, their facility,” he said. “Some of that came out of the fact that it was underground, and they felt a strong need to protect it, and they valued it so much in terms of the positive effects it had on their lives.”\nSenior author Alex Kral, who directs the behavioral and urban health program at RTI International, a nonprofit research institute with headquarters in Research Triangle Park, North Carolina, bemoaned missed opportunities for more funding, longer hours and direct links to drug treatment and other social services as a result of the need to keep the site a secret.\nAn estimated 100 men and women used the underground site in its first two years, according to a prior study. The vast majority were homeless white men injecting heroin.\nOne drug user described the site in the new study as “too good to be true.”\n“It’s the difference between sitting on a curb next to feces, and you got people walking by you, and cops driving by constantly,” he told Davidson. “It’s really crazy and dirty out there.”\nIf not for the unsanctioned injection facility, most of the site’s visitors told researchers they would have shot up in a park, public restroom, street or between two cars.\n“Instead of a place kicking me out, it’s a place asking me to come in,” one said.\nUsers credited the facility with reducing their chances of overdosing, contracting infections and injecting themselves in plain view of children. They described a sense of trust and community among users of the facility.\n“When I come in here now, I feel peace,” one said.\nCritics object to enabling addicts to flout laws about illicit drugs and say injection facilities could thwart efforts to treat and prevent drug use. Advocates contend that the sites save lives, prevent needle-sharing diseases like HIV, and steer drug users into treatment.\nDr. Scott Steiger has been advocating for a safe-injection site in San Francisco, where he is deputy medical director of the Opiate Treatment Outpatient Program and a professor of medicine at the University of California, San Francisco.\n“The evidence is people stay alive longer and have less risky behaviors and access treatment more frequently when there are supervised-injection facilities,” said Steiger, who was not involved with the study.\nHis goal, he said in a phone interview, is to keep people alive for long enough for them to be ready for a teachable moment and treatment.\nSOURCE: bit.ly/2DVgL7T International Journal of Drug Policy, online December 27, 2017.\n ", "external_links": [], "published": "2018-01-12T22:08:00.000+02:00", "crawled": "2018-01-12T22:45:34.004+02:00", "highlightTitle": ""}