{"organizations": [], "uuid": "3d7a74a85cbaf522641ebb3140d4d7f7f90324a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222365636&w=1200&r=LYNXMPEE0F0I9", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-jd-com-logistics-fundraising-breaking/alibaba-rivals-switch-in-logistics-stacks-up-idUSKBN1F50T9", "country": "US", "domain_rank": 408, "title": "Alibaba rival’s switch in logistics stacks up", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:44:00.000+02:00", "replies_count": 0, "uuid": "3d7a74a85cbaf522641ebb3140d4d7f7f90324a3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-jd-com-logistics-fundraising-breaking/alibaba-rivals-switch-in-logistics-stacks-up-idUSKBN1F50T9", "ord_in_thread": 0, "title": "Alibaba rival’s switch in logistics stacks up", "locations": [], "entities": {"persons": [{"name": "richard liu", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "alibaba", "sentiment": "neutral"}, {"name": "hillhouse capital and sequoia capital china", "sentiment": "none"}, {"name": "procter & gamble", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG JD.com’s switch in logistics stacks up. The Chinese online retailer is raising $2 billion to fund its warehousing and delivery unit, Reuters reported on Monday. This sensible burden-sharing brings JD and rival Alibaba’s business models closer together.\nThe $66 billion e-commerce group led by Richard Liu is turning to private equity outfits Hillhouse Capital and Sequoia Capital China to lead a funding round for JD Logistics at a $10 billion valuation, people familiar with the matter told Reuters. The subsidiary offers services from warehousing to packaging and last-mile delivery, both to JD and more recently to third parties such as Procter & Gamble and Nestlé.\nThis is a notable shift for JD, which has long relied on an “asset-heavy” model of holding inventory and operating its own logistics network, similar to Amazon. An early lead in delivery helped the group fend off the much-larger Alibaba, which has traditionally turned to others to do the hard work of holding and transporting goods.\nBut that has been costly for JD: analysts polled by Thomson Reuters expect capital expenditure more than doubled in 2017 to more than 9 billion yuan ($1.4 billion) according to a so-called SmartEstimate, which weights forecasts by how new they are, and by the track record of the analysts making them. Getting investors to help pay for building new warehouses and so on should free up some cash for the company.\nAt the same time, Jack Ma’s Alibaba is investing billions to build up its own delivery network. In September, the $481 billion e-commerce behemoth took control of Cainiao, its logistics unit, and pledged to spend 100 billion yuan over five years in things such as research and development and computerised “smart” warehouses. This pits Alibaba directly against JD in fast-growing areas such as online groceries, where same-day delivery is critical.\nThe trade-off is diluting JD’s existing shareholders in a promising venture. With the boundaries rapidly blurring between brick-and-mortar retail and online commerce in China, logistics is becoming an attractive business by itself.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-16T16:44:00.000+02:00", "crawled": "2018-01-16T23:07:19.000+02:00", "highlightTitle": ""}