{"organizations": [], "uuid": "4b0523d78d2260bfdc4a2703648b58d19b40886d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-cameroon-separatists-nigeria/cameroon-separatist-leader-taken-into-custody-in-nigeria-sources-idUKKBN1EW00V", "country": "US", "domain_rank": 408, "title": "Cameroon separatist leader taken into custody in Nigeria - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T02:54:00.000+02:00", "replies_count": 0, "uuid": "4b0523d78d2260bfdc4a2703648b58d19b40886d"}, "author": "", "url": "https://uk.reuters.com/article/uk-cameroon-separatists-nigeria/cameroon-separatist-leader-taken-into-custody-in-nigeria-sources-idUKKBN1EW00V", "ord_in_thread": 0, "title": "Cameroon separatist leader taken into custody in Nigeria - sources", "locations": [], "entities": {"persons": [{"name": "edward mcallister", "sentiment": "none"}, {"name": "carsten", "sentiment": "none"}, {"name": "paul biya", "sentiment": "none"}, {"name": "julius ayuk tabe", "sentiment": "none"}], "locations": [{"name": "cameroon", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "abuja", "sentiment": "none"}], "organizations": [{"name": "governing council of ambazonia", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 12:56 AM / Updated 25 minutes ago Cameroon separatist leader taken into custody in Nigeria - sources Paul Carsten , Edward McAllister 3 Min Read \nABUJA/DAKAR (Reuters) - A leading member of a separatist movement in Cameroon has been taken into custody in the capital of neighbouring Nigeria with his aides, sources and secessionists said on Saturday. \nThe once-fringe Anglophone movement in majority Francophone Cameroon has gathered pace in the last few months following a military crackdown on protests. It represents the gravest challenge yet to the 35-year rule of President Paul Biya who will seek re-election this year. \nJulius Ayuk Tabe, the Nigeria-based chairman of the Governing Council of Ambazonia separatist movement, was taken into custody alongside six others at a hotel in Abuja on Friday, said an official in the west African country and a member of the separatist group in Cameroon. \nBilateral relations have been strained by a separatist movement in Cameroon that has clashed with the Cameroonian army and forced thousands to flee violence by travelling across the border to Nigeria. \nCameroonian troops last month crossed into Nigeria in pursuit of rebels without seeking Nigerian authorization, causing diplomatic wrangling behind the scenes. \nSeparatists, including armed radical elements, seek an independent state for the nation’s Anglophone regions they call Ambazonia. \nA Nigerian official said Tabe and six of his supporters were placed in custody at around 7 p.m. (1800 GMT) on Friday. “They were having a meeting at Nera Hotels in Abuja,” the official said on condition of anonymity. \nThe official did not know who rounded up the separatists. \nA member of the separatist group based in Cameroon, who wanted to remain anonymous, said the people were taken into custody. \nThe separatist group later issued a statement saying that Tabe and six others were taken from Nera Hotels by Cameroonian gunmen in an “illegal abduction.” Reuters was unable to independently verify the allegation. \nThe unrest in Cameroon began in November, when English-speaking teachers and lawyers in the Northwest and Southwest regions of Cameroon, frustrated with having to work in French, took to the streets calling for reforms and greater autonomy. \nFrench is the official language for most of Cameroon but English is spoken in two regions that border Nigeria. \nProtests by separatists prompted a violent crackdown by Cameroon’s military last year in which troops opened fire on demonstrators. Writing by Alexis Akwagyiram; Editing by Richard Chang", "external_links": [], "published": "2018-01-07T02:54:00.000+02:00", "crawled": "2018-01-07T03:22:34.028+02:00", "highlightTitle": ""}