{"organizations": [], "uuid": "39f11e755bc3ca40dae9d28d2589c87d78d96b34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-usa-radiation-treatments/north-korea-threats-spur-u-s-search-for-new-radiation-therapies-idUSKBN1FK2V4", "country": "US", "domain_rank": 408, "title": "North Korea threats spur U.S. search for new radiation therapies", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T21:13:00.000+02:00", "replies_count": 0, "uuid": "39f11e755bc3ca40dae9d28d2589c87d78d96b34"}, "author": "", "url": "https://www.reuters.com/article/us-usa-radiation-treatments/north-korea-threats-spur-u-s-search-for-new-radiation-therapies-idUSKBN1FK2V4", "ord_in_thread": 0, "title": "North Korea threats spur U.S. search for new radiation therapies", "locations": [], "entities": {"persons": [{"name": "divya grover", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "department of defense", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The escalating threat of a potential nuclear war between North Korea and the United States has led the Department of Defense to join hands with a clutch of companies in developing more effective medical treatments for acute radiation syndrome.\nThe hostility between the two nations reached a new height last November after Pyongyang fired an intercontinental ballistic missile capable of reaching the U.S. mainland.\nHealth officials in Washington say they have adequate stocks in the event of a nuclear attack and subsequent mass radiation poisonings.\nBut statements by a handful of drug developers and partnerships the government have announced suggest the DoD is stepping up efforts to develop stronger treatments that could protect the military and civilians ahead of a nuclear attack.\nThe DoD’s budget allocated $3.9 million of its total funding to develop such medical countermeasures in 2018, an increase of $600,000 from a year ago.\nHowever, the numbers available on a handful of contracts issued to firms including Cleveland BioLabs Inc and privately held Humanetics Corp show funding of at least $13 million, suggesting that other departments of the military agency are investing in the area.\nThe reward for a successful drug developer is high: in 2013, the government spent $157 million to stockpile Amgen Inc’s nearly three decades old drug, Neupogen, but it and other stockpile drugs are limited as they only treat certain after-effects of radiation exposure.\nMedical experts say that the increased $700 billion military budget signed into law by President Donald Trump last month could put more emphasis on programs to counter the North Korean threat and may allow a large outlay for new treatments.\nThe new drugs in development for radiation exposure are designed to recover the loss of all three blood lineages - white and red blood cells, and platelets - without the need for multiple blood tests or prescreening.\nIsrael-based Pluristem Therapeutics Inc, Cleveland BioLabs and privately held Neumedicines Inc are all in the final stages of developing their treatments, while Humanetics is yet to initiate an early-stage trial for its oral drug.\nPluristem has been developing an injectable drug, which could prevent or reduce the severity of radiation poisoning if taken before exposure.\n“Additional funding for the U.S. military may support more rapid development of medical countermeasures,” Pluristem’s North America division’s vice president Karine Kleinhaus said.\n“Leukine, Neulasta, Neupogen each only targets recovery of a sub-population of white blood cells, with no effect on the other two lineages. Pre-determination of amount of radiation exposure and serial blood tests are ... not required for PLX-R18 administration, making PLX-R18 more suitable in a mass casualty situation,” Kleinhaus said of the company’s experimental drug.\nThe National Aeronautics and Space Administration (NASA) also entered into a partnership last August with the government’s Biomedical Advanced Research and Development Authority (BARDA) to develop drugs, focusing on the radiation issues experienced by astronauts.\nNASA’s radiology scientist Dr. Honglu Wu told Reuters there would certainly be interest in medicines that could be taken prior to the exposure of radiation.\nNeumedicines Chief Executive Lena Basile, whose developmental drug HemaMax is a post-exposure therapy, said the pre-exposure treatments would be undermined because they are limited to military personnel or first responders.\n“You cannot give pre-exposure drugs to the civilian population,” she said.\nPluristem is also planning to expand its treatment for the use in cancer patients, the company’s co-Chief Executive Yaky Yanay said, adding that the drug has a $1 billion market potential in revenue.\n“If we are (going) to get to the chemotherapy market, we are looking at a much larger market.”\nReporting by Divya Grover in Bengaluru; editing by Patrick Graham and Bernard Orr\n ", "external_links": [], "published": "2018-01-31T21:13:00.000+02:00", "crawled": "2018-01-31T21:24:27.035+02:00", "highlightTitle": ""}