{"organizations": [], "uuid": "e382a1b06bccc1e3ad64651e9668e5aed16371ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223401500&w=1200&r=LYNXMPEE0I1DU", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/us-markets-bitcoin-india-taxes/india-sends-tax-notices-to-cryptocurrency-investors-as-trading-hits-3-5-billion-idINKBN1F8190", "country": "US", "domain_rank": 408, "title": "India sends tax notices to cryptocurrency investors as trading hits $3.5 billion", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T13:46:00.000+02:00", "replies_count": 0, "uuid": "e382a1b06bccc1e3ad64651e9668e5aed16371ce"}, "author": "", "url": "https://in.reuters.com/article/us-markets-bitcoin-india-taxes/india-sends-tax-notices-to-cryptocurrency-investors-as-trading-hits-3-5-billion-idINKBN1F8190", "ord_in_thread": 0, "title": "India sends tax notices to cryptocurrency investors as trading hits $3.5 billion", "locations": [], "entities": {"persons": [{"name": "rupam jain", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "delhi", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "pune", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}], "organizations": [{"name": "manoj kumar", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI (Reuters) - India has sent tax notices to tens of thousands of people dealing in cryptocurrency after a nationwide survey showed more than $3.5 billion worth of transactions have been conducted over a 17-month period, the income tax department said.\nTech-savvy young investors, real estate players and jewelers are among those invested in bitcoin and other virtual currencies, tax officials told Reuters after gathering data from nine exchanges in Mumbai, Delhi, Bengaluru and Pune.\nGovernments around the world are grappling with how to regulate cryptocurrency trading, and policymakers are expected to discuss the matter at a G20 summit in Argentina in March.\nThe Indian government has issued repeated warnings against digital currency investments, saying these were like “Ponzi schemes” that offer unusually high returns to early investors.\nBut it has not so far imposed curbs on an industry estimated to be adding 200,000 users in India every month.\nB.R. Balakrishnan, a director general of investigations at the income tax department in the southern state of Karnataka, said notices were sent following the survey to assess the penetration and patterns of virtual currency trade.\n“We cannot turn a blind eye. It would have been disastrous to wait until the final verdict was out on its legality,” he told Reuters.\nThe tax department has asked people dealing in bitcoin and other virtual currencies such as ethereum and ripple to pay tax on capital gains. They have also asked for details about their total holdings and the source of funds in the tax notice seen by Reuters.\n“We found that investors were not reflecting it on their tax returns and in many cases, the investment was not accounted for,” Balakrishnan said.\nBitcoin, the world’s biggest cryptocurrency, soared more than 1,700 percent last year, hitting a record high just shy of $20,000 as institutional and retail investors around the world snapped up the virtual currency.\nIts huge gains have attracted the attention of global regulators tasked with protecting investors from fraud.\nIn recent weeks, Japan and China have made noises about a regulatory crackdown, while South Korean policymakers said they were considering shutting down domestic virtual currency exchanges.\nREGULATION An Indian finance ministry official said a federal committee was looking into the possibility of imposing restrictions on virtual currencies and that eventually parliament would have to legislate a regulatory regime.\nOfficials at Zebpay, India’s leading bitcoin exchange, said the industry was adding near 200,000 users every month with an estimated trade volume of about 20 billion Indian rupees ($315 million).\n“Many of our customers are treating digital currency like gold,” said Zebpay co-founder Saurabh Agarwal.\nAman Kalra, marketing head of Coinsecure, a bitcoin exchange in New Delhi, said more than 150 bitcoins were changing hands every week through its platform. The company has 100,000 registered users and is now launching a platform to sell ethereum and other digital currencies.\n“I don’t think anyone in the government should label our business as a ‘Ponzi scheme’, we are not doing anything illegal,” said Kalra.\nTax inspectors said they sought help from experts in blockchain, the technology that underpins bitcoin, to conduct the survey.\nIn some cases, tax officials themselves participated in the trade to identify loopholes after they found investors had poured in billions of dollars through unregulated exchanges.\nThe biggest worry for New Delhi, the finance ministry official said, was how to protect investors trading on offshore exchanges.\nAlready hundreds of investors have gone to the police and courts with complaints of transactions in virtual currencies that turned out to be fraudulent, said Pavan Duggal, a Supreme Court lawyer specializing in cybercrimes.\n“Considering cryptocurrencies are here to stay, the government must consider granting limited legality while ensuring that these are not used for crypto crimes,” he said.\n($1 = 63.7625 Indian rupees)\nAdditional reporting by Jatindra Dash in BHUBANESWAR, Vishal Sridhar in BENGALURU; Editing by Sanjeev Miglani and Alex Richardson\n ", "external_links": [], "published": "2018-01-19T13:46:00.000+02:00", "crawled": "2018-01-19T22:26:47.053+02:00", "highlightTitle": ""}