{"organizations": [], "uuid": "a008e670d527b4c16137933abf69ab8ba7ac0de7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-apogee-announces-architectural-glass-restructuring.html", "country": "US", "domain_rank": 767, "title": "Apogee Announces Architectural Glass Restructuring", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T17:20:00.000+02:00", "replies_count": 0, "uuid": "a008e670d527b4c16137933abf69ab8ba7ac0de7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-apogee-announces-architectural-glass-restructuring.html", "ord_in_thread": 0, "title": "Apogee Announces Architectural Glass Restructuring", "locations": [], "entities": {"persons": [{"name": "joseph f. puishys", "sentiment": "none"}], "locations": [{"name": "utah", "sentiment": "none"}, {"name": "viracon", "sentiment": "none"}, {"name": "st. george", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "ut", "sentiment": "none"}], "organizations": [{"name": "apogee announces architectural glass restructuring investments", "sentiment": "negative"}, {"name": "apogee enterprises, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Investments, productivity improvements enable Utah plant closure Restructuring charges reflected in previous fiscal 2018 outlook\nMINNEAPOLIS--(BUSINESS WIRE)-- Apogee Enterprises, Inc. (Nasdaq:APOG), which provides distinctive solutions for enclosing commercial buildings and framing art, today announced details of the planned restructuring referenced in its December 21, 2017, third-quarter earnings release.\n“As part of our initiatives to diversify and strengthen our business for more stable performance in any economic cycle, Apogee is making significant investments in our Viracon architectural glass business for new capabilities, automation and improved productivity that are yielding increased capacity. It is now apparent that we no longer require the capacity from our smallest domestic architectural glass plant in St. George, UT, and we will be closing that facility in March,” said Joseph F. Puishys, Apogee chief executive officer. “With the capacity gains we’ve made through capability and productivity investments over the past five years, we will continue to have adequate glass capacity to meet peak commercial construction market demand in upcoming years.”\nIn the fiscal 2018 fourth quarter, Apogee is taking a restructuring charge of approximately $4.5 million, or $0.11 per share, primarily related to the plant closure. This charge was reflected in Apogee’s current fiscal 2018 outlook provided in December 2017. The payback is expected to be approximately one year.\n“Our architectural glass business will benefit from reduced costs in fiscal 2019 and beyond, as it continues to deliver very high levels of customer service with 6-8 week lead times,” said Puishys.\n“This decision is not a reflection on the performance of the Viracon-St. George facility and its employees,” said Viracon President Kelly Schuller. “Our human resources team will be working closely with our employees to help them find new opportunities.” Apogee’s Viracon architectural glass business employs about 200 people in St. George, with the remainder of its 2,300 employees at its Owatonna, MN, Statesboro, GA and Nazaré Paulista, Brazil facilities, which are continuing to operate.\nABOUT APOGEE ENTERPRISES\nApogee Enterprises, Inc., headquartered in Minneapolis, is a leader in the design and development of value-added glass and metal products and services for enclosing commercial buildings, and value-added glass and acrylic for picture framing and displays. The company is organized in four segments, with three of the segments serving the commercial construction market:\nArchitectural Framing Systems segment businesses design, engineer, fabricate and finish the aluminum frames for window, curtainwall and storefront systems that comprise the outside skin of buildings. Businesses in this segment are: Wausau, a manufacturer of custom aluminum window systems and curtainwall; Sotawall, a manufacturer of unitized curtainwall systems; EFCO, a manufacturer of aluminum window, curtainwall, storefront and entrance systems; Tubelite, a manufacturer of aluminum storefront, entrance and curtainwall products; Alumicor, a manufacturer of aluminum storefront, entrance, curtainwall and window products for Canadian markets; and Linetec, a paint and anodizing finisher of window frames and PVC shutters. Architectural Glass segment consists of Viracon, a leading fabricator of coated, high-performance architectural glass for global markets. Architectural Services segment consists of Harmon, one of the largest U.S. full-service building glass installation companies. Large-Scale Optical segment consists of Tru Vue, a value-added glass and acrylic manufacturer primarily for framing and display applications.\nFORWARD-LOOKING STATEMENTS\nThe discussion above contains “ ” within the meaning of the Private Securities Litigation Reform Act of 1995. These statements reflect Apogee management’s expectations or beliefs as of the date of this release. The company undertakes no obligation to publicly update or revise any , whether as a result of new information, future events or otherwise. All are qualified by factors that may affect the operating results of the company, including the following: (A) global economic conditions and the cyclical nature of the North American and Latin American commercial construction industries, which impact our three architectural segments, and consumer confidence and the conditions of the U.S. economy, which impact our large-scale optical segment; (B) fluctuations in foreign currency exchange rates; (C) actions of new and existing competitors; (D) ability to effectively utilize and increase production capacity; (E) product performance, reliability and quality issues; (F) project management and installation issues that could result in losses on individual contracts; (G) changes in consumer and customer preference, or architectural trends and building codes; (H) dependence on a relatively small number of customers in certain business segments; (I) revenue and operating results that could differ from market expectations; (J) self-insurance risk related to a material product liability or other event for which the company is liable; (K) dependence on information technology systems and information security threats; (L) cost of compliance with and changes in environmental regulations; (M) interruptions in glass supply; (N) loss of key personnel and inability to source sufficient labor; and (O) integration of recent acquisitions. The company cautions investors that actual future results could those described in the , and that other factors may in the future prove to be important in affecting the company’s results of operations. New factors emerge from time to time and it is not possible for management to predict all such factors, nor can it assess the impact of each factor on the business or the extent to which any factor, or a combination of factors, may cause actual results to those contained in any . For a more detailed explanation of the foregoing and other risks and uncertainties, see Item 1A of the company’s Annual Report on Form 10-K for the fiscal year ended March 4, 2017.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005398/en/\nApogee Enterprises, Inc.\nMary Ann Jackson, 952-487-7538\nInvestor Relations\nmjackson@apog.com\nSource: Apogee Enterprises, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180105005398/en/"], "published": "2018-01-05T17:20:00.000+02:00", "crawled": "2018-01-05T17:53:52.044+02:00", "highlightTitle": ""}