{"organizations": [], "uuid": "891309a69e2e5b3df29cebd2c4b199e9272745e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/22/104914185-RTX3WHWE.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/bitcoin-price-slips-to-its-lowest-level-in-six-weeks.html", "country": "US", "domain_rank": 767, "title": "Bitcoin price slips to its lowest level in six weeks", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.259, "site_type": "news", "published": "2018-01-16T10:58:00.000+02:00", "replies_count": 0, "uuid": "891309a69e2e5b3df29cebd2c4b199e9272745e1"}, "author": "Ryan Browne", "url": "https://www.cnbc.com/2018/01/16/bitcoin-price-slips-to-its-lowest-level-in-six-weeks.html", "ord_in_thread": 0, "title": "Bitcoin price slips to its lowest level in six weeks", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "coinbase", "sentiment": "none"}], "organizations": [{"name": "reuters  bitcoin", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Let friends in your social network know what you are reading about Facebook Bitcoin plunges below $12,000 to six-week low over crackdown fears The price of bitcoin fell below $12,000 for the first time since December 5, according to CoinDesk data. Post to Facebook A link has been posted to your Facebook feed. 1 To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Bitcoin plunges below $12,000 to six-week low over crackdown fears Ryan Browne and Evelyn Cheng, CNBC Published 8:02 a.m. ET Jan. 16, 2018 | Updated 1:29 p.m. ET Jan. 16, 2018 CLOSE A bitcoin conference is no longer allowing customers to buy tickets with Bitcoin, because the transactions are too much of a burden, according to NYMag. Veuer's Sam Berman has the full story. Buzz60 A physical gold bitcoin up close. (Photo: Getty Images) CONNECT 1 COMMENT EMAIL MORE Bitcoin plunged to a six-week low Tuesday after comments from South Korea's finance minister renewed worries about a crackdown in one of the largest markets for digital currency trading. South Korea Finance Minister Kim Dong-yeon said in a radio program interview that \"the shutdown of virtual currency exchanges is still one of the options\" the government has, according to an English-language report Tuesday from South Korea's Yonhap News. Last week, it emerged that South Korea was reportedly moving to rein in speculative cryptocurrency trading with a potential bill to ban cryptocurrency trading. The country's government has since toned down its stance, and on Monday said it would only make a decision on how to move forward after \"sufficient consultation and coordination of opinions.\" Bitcoin dropped more than 17% to a low of $11,182.71 on Tuesday, falling below $12,000 for the first time since Dec. 5, according to CoinDesk. CoinDesk's bitcoin price index tracks prices from cryptocurrency exchanges Bitstamp, Coinbase, itBit and Bitfinex. As of 12:13 p.m. ET, bitcoin was trading more than 13% lower at $11,759.73 a coin, according to CoinDesk. Trading in South Korean won accounted for about 4% of bitcoin trading volume, according to CryptoCompare. U.S. dollar-bitcoin trading had the largest share at 40%, the website showed. Other major digital currencies including ethereum and ripple also fell significantly. According to CoinMarketCap data, ethereum was trading at $1,051.83, down more than 20% in the last 24 hours, before lifting slightly to $1,117.72. Ripple fell almost 27% to $1.33 a token before recovering slightly to $1.36. More: Stock forecast: Bull bets on Millennials, blockchain Investors also monitored reports of an escalated crackdown on the cryptocurrency market in China. On Monday, Bloomberg reported that authorities in China were planning to block domestic access to Chinese and offshore cryptocurrency platforms that allow centralized trading. Regulators will also target people and companies that provide market-making, settlement and clearing services for centralized trading, the publication said, citing unnamed sources. And on Tuesday, a Chinese central bank official reportedly said that authorities should ban the centralized trading of digital currencies, adding weight to concerns of further suppression of the country's cryptocurrency market. 'Dip is not wholly unexpected' Iqbal Gandham, U.K. managing director at eToro, said in an emailed comment: \"The market is correcting off the back of news that China is moving to crack down on cryptocurrency trading. Chinese investors are likely spooked having heard the news and the market is on edge as a result.\" \"But we don't expect to see a major sell-off. Bitcoin in particular has gone through this cycle before ... Moreover, it you look at the last three years, January is typically the low point for cryptocurrencies. So this dip is not wholly unexpected,\" he added. Bitcoin rose slightly higher later on Monday morning to around $11,674.96 at 11:54 a.m. ET. The digital asset soared to a record high of $19,343 last month, but has since been on a gradual decline. Futures contracts for bitcoin were introduced for the first time last month, with huge derivatives operators CME and the Cboe letting investors bet on price movements in the volatile asset for the first time. Cboe's bitcoin futures for January 2018 were trading at $11,760 Tuesday at 12:16 p.m. ET, down 12% for the session, while CME's contracts were trading at $11,935, down more than 14%. \"The pullback seems to be coming from a lack of buyers in Asia,\" Mati Greenspan, senior market analyst at eToro, told CNBC in an email. \"Japan and South Korea usually dominate this market but over the last few days, the volumes have been dropping steadily. This morning the combined volumes from these two countries dropped below 30%.\" He added: \"The Koreans and Japanese are used to paying a premium of 20% or more per coin. It seems they're getting wise and waiting for the market to even out before buying in again.\" CLOSE The South Korean government says it plans to ban cryptocurrency trading, sending bitcoin prices plummeting and throwing the virtual coin market into turmoil. Newslook 'Tired of paying the premium' CoinMarketCap recently removed South Korean exchanges from its price calculations due the \"extreme divergence\" in prices compared to the rest of the world. Reports of South Korea preparing a bill to ban cryptocurrency trading via exchanges last week sent the price of bitcoin and a number of other major digital currencies down dramatically. \"The reports are certainly not helping but in my assessment, the Asian market is simply tired of paying the premium,\" eToro's Greenspan said. Charles Hayter, CEO of Crypto Compare, said that investors were likely profit-taking as they prepared for risks ahead. \"It seems like it is uncertainty spooking the markets to a degree with regulations unclear. Korea and Asia in general has been a strong support for the cryptocurrency markets adding users and demand with prices often trading at a premium,\" he said. © CNBC is a USA TODAY content partner offering financial news and commentary. Its content is produced independently of USA TODAY. CONNECT 1 COMMENT EMAIL MORE", "external_links": [], "published": "2018-01-16T10:58:00.000+02:00", "crawled": "2018-01-16T10:58:58.061+02:00", "highlightTitle": ""}