{"organizations": [], "uuid": "170acbbcb52bd1e177ab5b762b5a1faaca8e318b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-safanad-u-s-student-housing-investment-platform-now-at-800-million-and-11000-beds-following-the-acquisition-of-910-bed-student.html", "country": "US", "domain_rank": 767, "title": "Safanad U.S. Student Housing Investment Platform Now At $800 Million And 11,000 Beds Following The Acquisition Of 910-Bed Student Community In Maryland", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:34:00.000+02:00", "replies_count": 0, "uuid": "170acbbcb52bd1e177ab5b762b5a1faaca8e318b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-safanad-u-s-student-housing-investment-platform-now-at-800-million-and-11000-beds-following-the-acquisition-of-910-bed-student.html", "ord_in_thread": 0, "title": "Safanad U.S. Student Housing Investment Platform Now At $800 Million And 11,000 Beds Following The Acquisition Of 910-Bed Student Community In Maryland", "locations": [], "entities": {"persons": [{"name": "chris aiken", "sentiment": "none"}, {"name": "safanad", "sentiment": "none"}], "locations": [{"name": "maryland new york", "sentiment": "none"}, {"name": "university town center", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "safanad", "sentiment": "none"}], "organizations": [{"name": "safanad limited", "sentiment": "neutral"}, {"name": "safanad u.s. student housing investment platform", "sentiment": "neutral"}, {"name": "vie holdings", "sentiment": "none"}, {"name": "gcc", "sentiment": "none"}, {"name": "real estate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 30, 2018 /PRNewswire/ -- Safanad Limited (\"Safanad\"), the global principal investment firm, and Vie Holdings, a US-based real estate investment company specializing in student and multifamily housing, today confirmed the acquisition of The Towers at University Town Center, Maryland.\nSafanad led the $69.5 million transaction, its second with Vie Holdings, primarily deploying capital from its own balance sheet to bring forward an attractive opportunity for US, GCC and Asian private and institutional investment partners.\nThe firm's strategy is to identify and actively manage stable value-creation opportunities in sectors that are underpinned by long-term trends and market displacements to grow its strong and diversified baseline portfolio.\nA $5 million renovation program will commence immediately to enhance the living experience with new rooftop finishes, expanded services, upgraded units and potentially additional facilities.\nChris Aiken, Senior Director of Real Estate at Safanad, said: \"We are seeing a consistent increase in demand for purpose-built and well-managed student housing as US and international students expect high quality and lifestyle-led accommodation. Demand is compounded in locations where there is undersupply of on-campus housing and growing student populations.\nAiken added: \"In the case of The Towers, we already have great housing that is well connected and surrounded by entertainment options. Our priority is to support the management and initiate an upgrade program to further improve the living experience and create greater value for our investors.\"\nThe Towers student housing community consists of two 16- & 17-story buildings of two, three and four-bedroom homes. Located just minutes' walk from two metro lines and 7 miles from the center of Washington, D.C., it meets demand from students attending nearby Howard University and the University of Maryland and other universities and colleges in the Washington, D.C. metropolitan area.\nIt is surrounded by popular restaurants and nightlife and has extensive amenities including a fitness center, rooftop pool, spa, dining services and a large study lounge to provide convenient and sociable student living.\nA principal global investment firm, Safanad deploys its own capital as a lead investor with the support of its investment partners and private and institutional clients.\nThe firm's priority sectors to date include healthcare, education, student housing, suburban offices, automotive technology, data centers and retail operations. Inclusive of this transaction, Safanad currently owns or controls over $9 billion in real estate and private equity assets worldwide.\nAbout Safanad\nSafanad is a global principal investment firm that targets opportunities in economic sectors underpinned by long-term trends and market displacements.\nAs a principal investor, Safanad utilizes its capital, expertise and exceptional management partners to preserve and grow wealth for the firm and its Asian, GCC and US private and institutional clients.\nPriority sectors across Safanad's real estate and private equity divisions include healthcare, education, student housing, suburban offices, automotive technology, data centers and retail operations.\nSafanad has offices in New York, Washington, D.C., Dubai and London. For more information, visit www.safanad.com\nAbout Vie\nVie is a lifestyle brand focused on Creating Inspired Lifestyles for residents in student and multifamily housing.\nHeadquartered in Miami, FL, Vie owns and manages properties located in or around some of the top universities, largest military bases and emerging markets in the country. For more information, visit http://www.viemgmt.com/", "external_links": ["http://www.safanad.com/", "http://www.viemgmt.com/"], "published": "2018-01-31T00:34:00.000+02:00", "crawled": "2018-01-31T02:12:31.000+02:00", "highlightTitle": ""}