{"organizations": [], "uuid": "5ec6f6e837d5b41bc7c59c90e149effba34883ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226621112&w=1200&r=LYNXMPEE0T101", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-bosch-results/spooked-by-monkeys-bosch-looks-to-oysters-and-cattle-for-profit-idUSKBN1FJ1ZB", "country": "US", "domain_rank": 408, "title": "Spooked by monkeys, Bosch looks to oysters and cattle for profit", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T22:20:00.000+02:00", "replies_count": 0, "uuid": "5ec6f6e837d5b41bc7c59c90e149effba34883ff"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-bosch-results/spooked-by-monkeys-bosch-looks-to-oysters-and-cattle-for-profit-idUSKBN1FJ1ZB", "ord_in_thread": 0, "title": "Spooked by monkeys, Bosch looks to oysters and cattle for profit", "locations": [], "entities": {"persons": [{"name": "robert bosch", "sentiment": "negative"}, {"name": "bosch", "sentiment": "negative"}], "locations": [{"name": "ludwigsburg", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LUDWIGSBURG, Germany (Reuters) - Germany’s Robert Bosch, the world’s biggest automotive supplier, is betting on farming technology to boost profit this year as disclosures about experiments by carmakers on monkeys jeopardize diesel-related jobs.\nThe Stuttgart-based company said it introduced new smart farming solutions last year, including sensor-based technologies to help farmers cultivate asparagus and strawberries, manage cattle or even to farm oysters.\n“The digital agriculture market is expected to grow more than 70 percent by 2020,” Bosch said on Tuesday.\nBosch builds sensors to help farmers measure growth and calibrate fertilizer and pesticide use. It has products to allow ranchers to monitor weight gain in cattle which have significant potential in Brazil and the United States, it added.\nIn 2017, Bosch posted a 6.7 percent rise in annual revenues to 78 billion euros ($97 billion).\nIndustrial Technology accounted for 6.7 billion euros of the total, while automotive-related business generated 47.4 billion, with the rest coming from consumer goods and energy and building technology.\nAdjusted earnings before interest and tax (EBIT) rose 23 percent to 5.3 billion euros, helping to improve the EBIT margin to 6.8 percent from 5.8 percent a year earlier, Bosch said.\nBosch expects to further increase sales and earnings this year, even amid increased geopolitical risks including Brexit negotiations and “unpredictable” U.S. foreign policy.\nHowever, Bosch warned that demand for diesel cars had fallen in Europe, a trend likely to be exacerbated by revelations that a research group conducted experiments that exposed monkeys and humans to toxic diesel fumes.\nRevenue in the automotive business saw a 7.8 percent rise thanks to sales of driver assistance and infotainment systems and diesel injection systems for commercial vehicles, Bosch said.\nBosch said it expects automotive revenues to outpace weaker growth in global automotive production, thanks to sales of vehicle electrification components, including a 48-volt battery for hybrid vehicles and an electric axle.\nBut CEO Denner struck a skeptical tone about the possibility of Bosch producing its own electric car battery cells, saying the company would need to spend 20 billion euros to enter the market.\n“Many unknowns as well as technological and especially market developments can only be predicted with difficulty or high degree of uncertainty,” Denner said, adding that established players are strong.\n“Since materials costs, including raw materials, are responsible for three quarters of the value created, there only remains a narrow scope for creating and exploiting competitive advantages,” Denner said.\nWhether Bosch enters the battery cell manufacturing business is part of a broader effort by the company to continually review its portfolio of assets, it said.\n($1 = 0.8074 euros)\nReporting by Edward Taylor; Editing by Keith Weir\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T22:20:00.000+02:00", "crawled": "2018-01-30T16:28:14.002+02:00", "highlightTitle": ""}