{"organizations": [], "uuid": "bab1925c70522651de7a0a0c2d1c5c29a488e81a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 63, "shares": 63, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://images.wsj.net/im-1641/social", "site_section": "http://online.wsj.com/xml/rss/3_7087.xml", "section_title": "WSJ.com: Politics And Policy", "url": "https://www.wsj.com/articles/california-senate-passes-tax-workaround-bill-1517358225", "country": "US", "domain_rank": 387, "title": "California Senate Passes Tax Workaround Bill", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T02:23:00.000+02:00", "replies_count": 0, "uuid": "bab1925c70522651de7a0a0c2d1c5c29a488e81a"}, "author": "Alejandro Lazo", "url": "https://www.wsj.com/articles/california-senate-passes-tax-workaround-bill-1517358225", "ord_in_thread": 0, "title": "California Senate Passes Tax Workaround Bill", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "california senate passes tax workaround bill california", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "tax foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "327 COMMENTS California’s attempt at circumventing a key piece of President Donald Trump’s tax plan cleared its first major hurdle Tuesday, when the state Senate approved legislation allowing residents to pay taxes through a federally deductible, state-run charity.\nSimilar measures are under consideration in New York and New Jersey, but California is the first to advance such a measure, according to the Washington, D.C.-based Tax Foundation.\nThe bill, which passed with a vote of 27-7, now moves to the Democratic-controlled state Assembly. If it passes there, it will then head to the desk of Gov. Jerry Brown, a Democrat.\nA companion bill in the Assembly creating the charity must also pass. That bill has yet to be taken up.\nMr. Brown has said publicly he is open to the workaround idea, but he has questioned whether such a plan could be voided by the Internal Revenue Service.\n“I am certainly open to it, it looks interesting,” Mr. Brown said this month. “But two questions: Can it work, and if it does work, can the Internal Revenue Service issue a regulation, and completely subvert it?”\nLawmakers in high-tax states have been weighing various proposals that would help some of their residents get around bigger tax bills under the recently passed federal tax overhaul. The law caps deductions for state and local taxes at $10,000.\nChristmas may be over but WSJ’s Richard Rubin keeps the holiday spirit alive by explaining who’s getting presents and who’s getting coal with the GOP tax bill. A New Jersey congressman has been pushing local governments to adopt a strategy of establishing charitable funds , which homeowners could contribute to in exchange for tax credits applied toward their property-tax bills.\nNew York Gov. Andrew Cuomo , a Democrat, has said he is considering various legislative ideas, including one that would allow employers to deduct some costs by converting some of the state income tax on individuals into employer payroll taxes.\nLast week, the U.S. Treasury Department’s tax legislative counsel, Thomas West, issued a warning to local lawmakers considering encouraging such donations with new state tax breaks.\n“We are skeptical that some of these [ideas] would work,” Mr. West said, adding that Mr. Trump’s administration could challenge the maneuvers as impermissible.\nIf the IRS wants to set guidelines for these programs, it would want to act quickly, said Dennis Ventry, a tax law professor at the University of California, Davis.\n“The IRS would want to get ahead of it so it could stave off that avalanche of taxpayers” who potentially would need auditing, said Mr. Ventry, who serves as chairman of an IRS advisory board.\n“It’s going to be very hard to devise a rule that doesn’t also knock out the existing programs” in other states, Mr. Ventry said.\nSome states have similar credits in place, including many conservative states that allow tax breaks for programs, such as vouchers for private school.\nThe biggest benefits of the California bill would go to high-income people. The California bill would allow an 85% credit, meaning that if an individual donates $10,000 to the fund, they could save $8,500 from their state taxes and get a federal charitable deduction.\nThe author of the California bill, state Sen. Kevin de León, the Democratic leader, referenced these instances Tuesday when arguing for the passage of his bill.\n“The administration will find itself in somewhat of a conundrum because you can’t take a meat cleaver if you want to oppose this,” Mr. de León said. “You have other red states that have similar models.”\n— Richard Rubin contributed to this article.\nWrite to Alejandro Lazo at alejandro.lazo@wsj.com", "external_links": [], "published": "2018-01-31T02:23:00.000+02:00", "crawled": "2018-01-31T08:47:15.005+02:00", "highlightTitle": ""}