{"organizations": [], "uuid": "089c70019de4e6685622a63582f5dbdb5be0baed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220123364&w=1200&r=LYNXMPEE07000", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-economy/uk-consumer-spending-falls-in-2017-for-first-time-in-five-years-visa-idUKKBN1EX00D", "country": "US", "domain_rank": 408, "title": "Consumer spending falls in 2017 for first time in five years - Visa", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T02:14:00.000+02:00", "replies_count": 0, "uuid": "089c70019de4e6685622a63582f5dbdb5be0baed"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-economy/uk-consumer-spending-falls-in-2017-for-first-time-in-five-years-visa-idUKKBN1EX00D", "ord_in_thread": 0, "title": "Consumer spending falls in 2017 for first time in five years - Visa", "locations": [], "entities": {"persons": [{"name": "david milliken", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "oxford circus", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 12:13 AM / Updated 4 hours ago Consumer spending falls in 2017 for first time in five years - Visa David Milliken 3 Min Read \nLONDON (Reuters) - British shoppers tightened their belts over Christmas, leading to the first year-on-year fall in spending since 2012, and leading businesses aim to do the same over 2018, two major surveys showed on Monday. People shop for last-minute purchases before Christmas at Oxford Circus in London, Britain December 23, 2017. REUTERS/Mary Turner \nEvidence of a consumer slowdown in Britain has mounted since official data showed the weakest household spending growth in five years earlier in 2017 against a backdrop of high inflation and worries about Brexit that weigh on business investment. \nVisa, whose debit and credit cards are used for a third of payments in Britain, said British consumer spending fell by 0.3 percent last year, after taking into account the effect of higher inflation, the first fall since 2012. \n“This result has bucked the trend of the previous four years which saw annual consumer spending rise by an average of 1.7 percent,” Visa’s chief commercial officer, Mark Antipof, said. \nSpending in December alone was 1.0 percent lower than in 2016, also the first fall in five years, and reflected a squeeze on household incomes from the highest inflation in nearly six years, Visa said. \nSome inflation pressure caused by the pound’s fall after June 2016’s Brexit vote was likely to ease this year, but broader problems of weak wage growth and Brexit uncertainty meant a full recovery was unlikely, the company said. \nEconomists polled by Reuters expect growth this year will slow slightly to 1.3 percent - well below its longer-run average of just over 2 percent. \nBrexit remained at the top of the list of worries of more than 100 of Britain’s largest companies surveyed by accountants Deloitte, and the companies’ concerns intensified slightly. \nThe businesses also reported the biggest focus on cost control in eight years, despite a robust global economy. \n“In a world of accelerating growth and buoyant equity markets, domestic risks remain large. Reining in costs can help chief financial officers mitigate these,” Deloitte’s chief economist, Ian Stewart, said. \nRisk appetite - a proxy for big companies’ willingness to invest - was a shade weaker than three months ago and well below pre-referendum levels, though not as low as just after June 2016’s Brexit decision. \nBritain is due to leave the EU in March 2019. Slow progress on exit arrangements got some impetus last month when Prime Minister Theresa May gained permission from the EU to move talks on to transitional arrangements and a long-term trade deal. \nWithout a deal, British businesses will face significant extra barriers selling goods and services to the EU next year. \nDeloitte surveyed 112 chief financial officers between Dec. 3 and Dec. 15. The CFOs’ companies represent about a fifth of Britain’s publicly traded corporate sector by value. \nVisa’s data is based on card spending, adjusted for inflation, the number of cards in circulation and a long-term fall in the use of cash. Reporting by David Milliken, editing by Andy Bruce", "external_links": [], "published": "2018-01-08T02:14:00.000+02:00", "crawled": "2018-01-08T02:46:22.001+02:00", "highlightTitle": ""}