{"organizations": [], "uuid": "c8ebadcb560dda648d6193ae6cf87661e24b27f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-imd-companies-inc-in-negotiation-to-acquire-domestic-gold-mines-to-complement-krsna-minerals.html", "country": "US", "domain_rank": 767, "title": "iMD Companies, Inc., in Negotiation to Acquire Domestic Gold Mines to Complement KRSNA Minerals", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.996, "site_type": "news", "published": "2018-01-31T16:00:00.000+02:00", "replies_count": 0, "uuid": "c8ebadcb560dda648d6193ae6cf87661e24b27f2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-imd-companies-inc-in-negotiation-to-acquire-domestic-gold-mines-to-complement-krsna-minerals.html", "ord_in_thread": 0, "title": "iMD Companies, Inc., in Negotiation to Acquire Domestic Gold Mines to Complement KRSNA Minerals", "locations": [], "entities": {"persons": [], "locations": [{"name": "placerville", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "iron ore", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "imd companies, inc.", "sentiment": "neutral"}, {"name": "chrome powder", "sentiment": "none"}, {"name": "krsna minerals", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PLACERVILLE, CA, Jan. 31, 2018 /PRNewswire/ - iMD Companies, Inc. (OTC: ICBU) Board of Directors announced today that the company is in negotiations to acquire gold producing mines in the California, Nevada, and Arizona regions. The company is looking to add revenues and assets by acquiring several new mines that have already produced millions of dollars in mining gold and have the potential to expand their operations. The company feels that with the addition of revenue producing gold mines, this would be the perfect complement to KRSNA Minerals, which is mining Chrome Powder and Iron Ore.\nKRSNA Minerals continues to mine Iron Ore and Chrome Powder and has expanded its operations to continue to fulfill purchase orders from their Hong Kong based customer for 5,000 metric tons of Magnesia Chrome Powder and 40,000 metric tons of Iron Ore. Because of the additional orders the contract had to be extended to two years for delivery. The company is looking to ship its next order of 10,000 metric tons of Chrome Powder and expects to have an update on shipments and quarterly revenue soon. Mining operations are moving forward on all orders and the company will continue to update its shareholders as new orders are fulfilled. The company will announce the details to all new acquisitions once completed.\nAbout iMD Companies, Inc.\nIMD Companies, Inc., (OTC: ICBU) is a Florida corporation, engaged in the manufacturing, extraction and distribution in mining, and asset accumulations of revenue producing companies. The company is positioned to be a holding company for acquisitions in the mining industries. The company and the principals of the management team have extensive backgrounds in finance, manufacturing, marketing and distribution. ICBU's goal is to create and increase shareholder value by tactically growing our core business while strategically seeking to acquire new business alliances, which generate increased revenues and earnings.\nSafe Harbor Statement:\nCertain statements made in this press release constitute forward-looking statements that are based on management's expectations, estimates, projections and assumptions. Words such as \"expects,\" \"anticipates,\" \"plans,\" \"scheduled,\" \"estimates\" and variations of these words and similar expressions are intended to identify forward-looking statements. Forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended. These statements are not guarantees of future performance and involve certain risks and uncertainties, which are difficult to predict. Therefore, actual future results and trends may differ materially from what is forecast in forward-looking statements due to a variety of factors. All forward-looking statements speak only as of the date of this press release and the company does not undertake any obligation to update or publicly release any revisions to forward-looking statements.\nSOURCE IMD Companies, Inc.", "external_links": [], "published": "2018-01-31T16:00:00.000+02:00", "crawled": "2018-01-31T15:53:39.036+02:00", "highlightTitle": ""}