{"organizations": [], "uuid": "16add2458f3f66ff0d2da9abf4e818725fbc4bd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-FK021_travel_ZG_20170407122438.jpg", "site_section": "http://feeds.marketwatch.com/marketwatch/topstories", "section_title": "MarketWatch.com - Top Stories", "url": "https://www.wsj.com/articles/the-trouble-with-keeping-commercial-flights-clean-1410993651", "country": "US", "domain_rank": 387, "title": "It’s not your imagination, all those work trips are making you sick", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:09:00.000+02:00", "replies_count": 0, "uuid": "16add2458f3f66ff0d2da9abf4e818725fbc4bd5"}, "author": "", "url": "https://www.wsj.com/articles/the-trouble-with-keeping-commercial-flights-clean-1410993651", "ord_in_thread": 0, "title": "It’s not your imagination, all those work trips are making you sick", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "columbia university’s mailman school of public health and city university of new york", "sentiment": "none"}, {"name": "environmental medicine", "sentiment": "none"}, {"name": "getty images new", "sentiment": "none"}, {"name": "quentin fottrell personal finance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  1:09 p.m. ET Share \nA new study outlines a list of serious ailments reported by people who travel a lot Getty Images New research finds that Americans who travel for business two weeks or more a month report more symptoms of anxiety and depression and are more likely to smoke, take less exercise and report trouble sleeping. \nBy Quentin Fottrell Personal Finance Editor \nSick and tired of all those planes, trains and presentations in anonymous office buildings all over the country? \nYou’re not alone. \nAmericans who travel for business two weeks or more a month report more symptoms of anxiety and depression and are more likely to smoke, take less exercise and report trouble sleeping than people who only travel 1 to 6 nights a month, according to a new study conducted by researchers at Columbia University’s Mailman School of Public Health and City University of New York, and published online in the Journal of Occupational and Environmental Medicine. \nSide-effects of being constantly on the road could impact millions of people. Workers took almost 503 million business trips in 2016 in the U.S., up from 488 million the year before, according to the Global Business Travel Association Foundation. “There is a growing literature showing that extensive business travel is associated with risk of chronic diseases associated with lifestyle factors,” said Andrew Rundle, associate professor of epidemiology at the Mailman School of Public Health. \nThe results of the latest study were based on anonymous health records of 18,328 employees who underwent a health assessment in 2015 through their corporate wellness work benefits program. “At the individual-level, employees who travel extensively need to take responsibility for the decisions they make around diet, exercise, alcohol consumption, and sleep,” Rundle said. He also recommended more workplace training around these issues. \nDon’t miss: Why some people are more likely to die at work than others \nEmployees are now available 27/7 and check their work emails even when they’re not traveling to work. Exhausted workers who travel for business, therefore, have less time to recuperate. Employers are cutting back on perks they provide workers, such as summer Fridays and flexible schedules. What’s more, 55% of Americans don’t use all of their vacation days, according to a study by the U.S. Travel Association’s Project Time Off, one of numerous studies suggesting Americans are afraid to take all their personal days and vacation days. \nFrequent fliers, however, can take precautions to stay healthy. According to one flight attendant on a recent Reddit thread : “Don’t get ice in your drink, don’t drink coffee, tea, or hot water on the plane and don’t touch anything in the lavatory with your bare skin. The ice is put in a tray with a scoop and the trays don’t get cleaned very often. Every surface on the plane is touched by hundreds of people daily and not often disinfected.” Standards for disinfecting planes vary according to time and class and several studies have confirmed bacteria in water served on airplanes. \nThere are other demographic factors at play, which may make it more onerous to be constantly on the road for more senior workers. By 2020, about one-fourth of American workers will be 55 or older, up from 19% in 2010, according to the Associated Press-NORC Center for Public Affairs, a research organization affiliated with the University of Chicago. “There is a boomer bubble in the workforce,” says Steve Langerud, workplace consultant and principal of Steve Langerud & Associates in Grinnell, Iowa. Older adults, studies show , are more susceptible to infection. MarketWatch Partner Center", "external_links": [], "published": "2018-01-09T20:09:00.000+02:00", "crawled": "2018-01-09T20:13:20.009+02:00", "highlightTitle": ""}