{"organizations": [], "uuid": "2665b8130018db0e8d99d72493d432be16d25796", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen/highlights-tennis-australian-open-day-three-idUKL3N1PC03T", "country": "US", "domain_rank": 408, "title": "HIGHLIGHTS-Tennis-Australian Open day three", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T02:29:00.000+02:00", "replies_count": 0, "uuid": "2665b8130018db0e8d99d72493d432be16d25796"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen/highlights-tennis-australian-open-day-three-idUKL3N1PC03T", "ord_in_thread": 0, "title": "HIGHLIGHTS-Tennis-Australian Open day three", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}, {"name": "melbourne  djokovic", "sentiment": "none"}, {"name": "aggressive konta", "sentiment": "none"}, {"name": "nadal", "sentiment": "none"}, {"name": "djokovic", "sentiment": "none"}, {"name": "zverev  halep", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "destanee", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne  wawrinka", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}, {"name": "melbourne park  sharapova", "sentiment": "none"}], "organizations": [{"name": "viktor troicki", "sentiment": "none"}, {"name": "donald young", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kyrgios", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:32 AM / Updated 30 minutes ago WRAPUP 1-HIGHLIGHTS-Tennis-Australian Open day three Reuters Staff 7 Min Read \nMELBOURNE, Jan 17 (Reuters) - World number one Rafa Nadal eased to a second round victory at the Australian Open on Wednesday while third seed Grigor Dimitrov was made to work hard to reach the third round in a five-set thriller against American Mackenzie McDonald. \nTop seed Nadal beat Argentine Leonardo Mayer 6-3 6-4 7-6(4) and will face Bosnia’s Damir Dzumhur in the next round while Bulgarian Dimitrov had to dig deep to carve out a 4-6 6-2 6-4 0-6 8-6 victory over unseeded qualifier McDonald. \nCaroline Wozniacki staged an impressive comeback from the brink of defeat to earn a victory over Croatia’s Jana Fett and progress to the last 32 of the women’s draw and will be joined by Ukrainian Elina Svitolina and Jelena Ostapenko. \nFrance’s Alize Cornet handed 12th-seed Julia Goerges a surprise defeat to snap the German’s 15-game winning streak and set up a third round clash with Belgian Elise Mertens, who beat 23rd-seed Daria Gavrilova. \nSeed slayers Belinda Bencic and Zhang Shuai, who ousted Venus Williams and Sloane Stephens in the opening round, were knocked out by Thai qualifier Luksika Kumkhum and Czech Republic’s Denisa Allertova respectively. \nHome favourite Nick Kyrgios, sixth-seeded Marin Cilic and Britain’s Kyle Edmund also sealed progression to the third round of men’s draw. READ MORE \nDimitrov survives scare against McDonald to reach third round \nNadal says lower-ranked players need more money \nKyrgios keeps calm and carries on into third round \nNadal mows down Mayer to reach third round \nKarlovic becomes oldest man in third round for 40 years \nTsonga edges Shapovalov to strike blow for old guard \nSecond seed Wozniacki fights back from the brink \nSeed slayers Bencic, Zhang tumble back to earth \nDream grand slam debut continues for 15-year-old Kostyuk \nSvitolina struggling with injury after second round win \nOrder of play on Thursday \nSharapova gets patience test with Melbourne set to sizzle \nHighlights of Wednesday’s third day of the Australian Open, the first grand slam tournament of the year: 1450 MERTENS OUSTS GAVRILOVA \nBelgian Elise Mertens knocked out 23rd-seeded Australian Daria Gavrilova with a 7-5 6-3 win to reach the next stage, where she will face France’s Alize Cornet. 1240 DIMITROV DIGS DEEP TO SURVIVE MCDONALD BATTLE \nWorld number three Grigor Dimitrov held his nerve in a fiercely-contested five-set thriller against American 186th-ranked qualifier Mackenzie McDonald to win 4-6 6-2 6-4 0-6 8-6 and set up a third round clash against Russian Andrey Rublev. 1225 DOLGOPOLOV INTO THIRD ROUND \nUkrainian Alexandr Dolgopolov knocked out Australian Matthew Ebden with a 7-6(0) 6-3 6-4 win to progress to the third round for the first time since 2012. 1115 RUBLEV DOWNS BAGHDATIS \nRussian youngster Andrey Rublev earned a tough 6-4 6-7(7) 6-4 6-2 win over Marcos Baghdatis of Cyprus to reach the third round at Melbourne Park for the first time. 1020 KYRGIOS POWERS PAST TROICKI \nHome favourite Nick Kyrgios, seeded 17th, fired 17 aces to see off Serbian Viktor Troicki 7-5 6-4 7-6(2) in the second round. He will next face 15th seed Jo-Wilfried Tsonga. \n1000 CORNET SNAPS GOERGES’ WINNING STREAK \nFrance’s Alize Cornet overcame a 0-5 head-to-head record to beat 12th seed Julia Goerges 6-4 6-3, ending the German’s 15-match winning streak. 0820 NADAL CRUISES INTO ROUND THREE \nWorld number one Rafa Nadal claimed a comfortable 6-3 6-4 7-6(4) victory over Leonardo Mayer of Argentina to reach the third round in Melbourne for the 12th time. 0750 OSTAPENKO ADVANCES \nFrench Open champion Jelena Ostapenko fired 35 winners past China’s Duan Yingying, to claim a 6-3 3-6 6-4 victory in the second round. 0700 WOZNIACKI COMPLETES STUNNING COMEBACK \nWorld number two Caroline Wozniacki roared back from 5-1 down in the final set, saving two match points, to beat Croatian Jana Fett 3-6 6-2 7-5. \n“I‘m very proud of the way I came back. I just tried to mentally stay focused. It was very hard, and she was playing well,” Wozniacki said after the match. \n”All of a sudden seeing myself down, almost out of the tournament, I started playing better and started playing the tennis that I wanted to play. 0630 CILIC EASES INTO ROUND THREE \nSixth seed Marin Cilic hit 40 winners, including 20 aces, on his way to a 6-1 7-5 6-2 second-round victory over Portugal’s Joao Sousa. \nCilic will next face American Ryan Harrison, who beat Uruguay’s 31st seed Pablo Cuevas 6-4 7-6(5) 6-4. 0540 TSONGA BATTLES PAST SHAPOVALOV IN MARATHON \nFormer Australian Open finalist Jo-Wilfried Tsonga came back from 5-2 down in the final set to beat Canadian teenager Denis Shapovalov 3-6 6-3 1-6 7-6(4) 7-5 after three hours and 37 minutes of play. 0410 EDMUND EASES PAST ISTOMIN \nBriton Kyle Edmund, who overcame last year’s U.S. Open finalist Kevin Anderson two days ago, beat Denis Istomin 6-2 6-2 6-4 to reach the third round. 0345 SVITOLINA SURVIVES SINIAKOVA SCARE \nFourth seed Elina Svitolina came from a set down to beat Czech Katerina Siniakova 4-6 6-2 6-1 and book a spot in the third round. \nUkrainian Svitolina will next face 15-year-old compatriot Marta Kostyuk, who beat Australian wildcard Olivia Rogowska 6-3 7-5. She is the youngest player to reach a grand slam third round since Mirjana Lucic-Baroni at the 1997 U.S. Open. \n“I remember being at that age. No pressure. Second round, creating history and all that,” the 26-year-old Rogowska said. “She (Kostyuk) came out firing so credit to her. She’s going to be a really good player.” 0310 BENCIC BOWS OUT \nTwo days after beating Venus Williams in the first round, Swiss Belinda Bencic started flat and never recovered in a 6-1 6-3 defeat by Thai qualifier Luksika Kumkhum. 0150 CARRENO BUSTA INTO ROUND THREE \nPablo Carreno Busta, a U.S. Open semi-finalist last year, is the first player from the men’s field through to the third round after the 10th seed’s opponent, Gilles Simon, retires hurt while trailing 6-2 3-0. 0128 PAVLYUCHENKOVA UPSET BY BONDARENKO \nAnastasia Pavlyuchenkova, the Russian 15th seed, has been knocked out by Ukraine’s Kateryna Bondarenko in a 6-2 6-3 second round upset on Hisense Arena. \n“I am really happy, I don’t really like playing first match but I guess it worked okay today,” said the world number 94. 0030 PLAY UNDERWAY ON DAY THREE \nPlay got underway on schedule at 11 a.m. local time (0000 GMT) at Melbourne Park, where the temperature was 24 degrees Celsius and forecast to peak at 29. Read our preview of the day’s action here: (Compiled by Nick Mulvenney, Hardik Vyas and Aditi Prakash; Editing by Peter Rutherford/Amlan Chakraborty/Christian Radnedge)", "external_links": [], "published": "2018-01-17T02:29:00.000+02:00", "crawled": "2018-01-17T03:02:20.004+02:00", "highlightTitle": ""}