{"organizations": [], "uuid": "f3fedcc8dd504feb150123b255fbefc9dcfd9c02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-reeds-inc-announces-new-board-appointment.html", "country": "US", "domain_rank": 767, "title": "Reed's, Inc. Announces New Board Appointment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:30:00.000+02:00", "replies_count": 0, "uuid": "f3fedcc8dd504feb150123b255fbefc9dcfd9c02"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-reeds-inc-announces-new-board-appointment.html", "ord_in_thread": 0, "title": "Reed's, Inc. Announces New Board Appointment", "locations": [], "entities": {"persons": [{"name": "cargile", "sentiment": "none"}, {"name": "reed", "sentiment": "none"}, {"name": "doherty", "sentiment": "none"}, {"name": "virgil", "sentiment": "none"}, {"name": "dan doherty", "sentiment": "none"}, {"name": "charles cargile", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "new board appointment", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "reed’s inc.", "sentiment": "neutral"}, {"name": "reed's, inc", "sentiment": "neutral"}, {"name": "reed", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 11, 2018 (GLOBE NEWSWIRE) -- Reed’s Inc. (NYSE American:REED) (“Reed’s” or the “Company”), owner of one of the nation’s leading portfolios of handcrafted, natural beverages, today announced the appointment of Dan Doherty, Principle of Raptor/Harbor Reeds SPV LLC. to the Reed’s Board of Directors effective January 10, 2018.\nMr. Doherty commented, “As one of the lead investors in Reed’s, I am happy to accept the invitation to join the Board of Directors and help support the strategic growth of the Reed’s and Virgil’s brands. Reed’s is well capitalized and has a strong leadership team, an excellent network of operating and retail partners and great tasting and refreshing natural beverages that have been embraced by our loyal customers for more than 25 years. There are many new and exciting developments in store, and we see great things ahead for Reed’s in 2018 and beyond.”\nThe Company also announced today that Charles Cargile resigned from the Board of Directors effective January 6, 2018. Mr. Cargile commented, “I am confident that Reed’s is well positioned for success and has made great progress in the last year. I am also confident that Dan Doherty will provide a great contribution. After joining the Reed’s board of directors, I became the Chief Executive Officer of Sunworks (NASDAQ:SUNW), I now need to devote more of my time to Sunworks. I will continue to be a huge supporter and shareholder of Reed’s.”\nAbout Reed’s, Inc.\nEstablished in 1989, Reed’s has sold over 500 million bottles of its category leading natural, handcrafted beverages. Reed’s is America’s #1 selling Ginger Beer brand and has been the leader and innovator in the ginger beer category for decades. Virgil’s is America’s #1 selling independent, natural craft soda brand. The Reed’s Inc. portfolio is sold in over 20,000 retail doors across the natural, specialty, grocery, drug, club and mass channels nationwide. Reed’s Ginger Beers are unique to the category because of the proprietary process of hand brewing its award-winning products using fresh organic ginger combined with natural spices and fruit juices. Reed’s Ginger Beers come in three levels of increasing ginger intensity that deliver a delicious and powerful ginger bite and burn that can only come from fresh ginger root. The Company uses this same handcrafted approach and dedication to the highest quality ingredients in its award-winning Virgil’s line of great tasting, bold flavored craft sodas.\nFor more information about Reed’s, please visit the Company’s website at: http://www.reedsinc.com or call 800-99-REEDS.\nFollow Reed’s on Twitter at http://twitter.com/reedsgingerbrew\nReed’s Facebook Fan Page at https://www.facebook.com/reedsgingerbrew\nSAFE HARBOR STATEMENT\nSome portions of this press release, particularly those describing Reed’s goals and strategies, contain “forward-looking statements.” These forward-looking statements can generally be identified as such because the context of the statement will include words, such as “expects,” “should,” “believes,” “anticipates” or words of similar import. Similarly, statements that describe future plans, objectives or goals are also forward-looking statements. While Reed’s is working to achieve those goals and strategies, actual results could differ materially from those projected in the forward-looking statements as a result of a number of risks and uncertainties. These risks and uncertainties include difficulty in marketing its products and services, maintaining and protecting brand recognition, the need for significant capital, dependence on third party distributors, dependence on third party brewers, increasing costs of fuel and freight, protection of intellectual property, competition and other factors, any of which could have an adverse effect on the business plans of Reed’s, its reputation in the industry or its expected financial return from operations and results of operations. In light of significant risks and uncertainties inherent in forward-looking statements included herein, the inclusion of such statements should not be regarded as a representation by Reed’s that they will achieve such forward-looking statements. For further details and a discussion of these and other risks and uncertainties, please see our most recent reports on Form 10-K, Form 10-Q and Form S-1, as filed with the Securities and Exchange Commission, as they may be amended from time to time. Reed’s undertakes no obligation to publicly update any forward-looking statement, whether as a result of new information, future events, or otherwise.\nCONTACT:\nReed's, Inc.\nInvestor Relations\n(310) 217-9400 Ext 6\nEmail: ir@reedsinc.com\nwww.reedsinc.com\nSource:Reed's Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=msx2tX2ZHh-OdQz_V36HDktEpBmG--wKHNifrC_h4kdq-r_FLcIGtIdKyBhVI8oPhsnPFjvnVuDY8oEAR2bYHMP4lXc_E11P_LC4PpgKQN4=", "https://www.globenewswire.com/Tracker?data=msx2tX2ZHh-OdQz_V36HDoNCXVc3R8OESioWiWH4VSrnUB6xmSg4gEMqf3kXoP5iK8TJVSV5uzGZnyzKn24ijs3ITpbYtX8-aMkq0GaGSs8uqh5316uuNubyKl8Jywq1", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f554887a-e34e-4632-870b-18e4b1be7001", "https://www.facebook.com/reedsgingerbrew", "https://www.globenewswire.com/Tracker?data=rP7vuTGzD3IjYsL0oKbcHjJsILYFoZeT-xmCsCH8vbxpUGDPPRnbkAc4gefaUeO50_MU8fWLbVrJHUFwf3qBE23vTdQdXObiwGCB84N8VMJB_bMq8bI30QH3_YkhmXANH5FKtBncY7oavKTXF8tS2w==", "http://twitter.com/reedsgingerbrew"], "published": "2018-01-11T16:30:00.000+02:00", "crawled": "2018-01-11T18:49:36.002+02:00", "highlightTitle": ""}