{"organizations": [], "uuid": "8873bedeb17ef6b451f989c90c6d2d0bb99a5224", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219618947&w=1200&r=LYNXMPEE040VV", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-canada-weather/much-of-eastern-canada-pummeled-by-deep-cold-heavy-winds-idUSKBN1EU1GA", "country": "US", "domain_rank": 408, "title": "Much of eastern Canada pummeled by deep cold, heavy winds", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:44:00.000+02:00", "replies_count": 0, "uuid": "8873bedeb17ef6b451f989c90c6d2d0bb99a5224"}, "author": "", "url": "https://www.reuters.com/article/us-canada-weather/much-of-eastern-canada-pummeled-by-deep-cold-heavy-winds-idUSKBN1EU1GA", "ord_in_thread": 0, "title": "Much of eastern Canada pummeled by deep cold, heavy winds", "locations": [], "entities": {"persons": [], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}, {"name": "nova scotia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "pearson international airport", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO/MONTREAL (Reuters) - Canada’s largest city, Toronto, scrambled to find emergency shelter for the homeless as temperatures dropped to record lows after a “weather bomb” knocked out power to tens of thousands in eastern provinces and destroyed coastal roads.\nFrom Halifax to Ottawa, workers struggled to clear snow and restore power lines downed by winds gusting up to hurricane strengths of 105 miles per hour (169 km per hour) in some areas of Nova Scotia, driving huge storm surges, according to Environment Canada.\nInland, the temperature hit -23 degrees Celsius (minus 9 degrees Fahrenheit) at Toronto’s international airport on Friday morning, marking the coldest Jan. 5 on record, Environment Canada meteorologist Geoff Coulson said by phone, adding that the previous record was set in 1959.\nCanada’s federal government announced it would open Toronto armories to the homeless 24 hours a day for the next two weeks after municipal shelters neared capacity. Toronto Mayor John Tory came under fire for not making the request sooner and voting against the measure in December.\nAs temperatures continued to drop, nurse and housing advocate Cathy Crowe said she was worried people would freeze to death on the streets.\n“It’s worse than anything I’ve seen in 30 years as a street nurse,” said Crowe.\nA man films storm surge from the Atlantic Ocean during Storm Grayson in Halifax, Nova Scotia, Canada January 5, 2018. REUTERS/Darren Calabrese The icy spell was expected to continue through Sunday morning.\nEnvironment Canada has issued an extreme cold warning for Toronto where the winds made the temperature feel like minus 31C (minus 24F) on Friday.\nSlideshow (9 Images) The cold contributed to the death of an elderly couple in Bluewater, a town on the shore of Lake Huron that is some 200 km (120 miles) west of Toronto.\nGrant Triebner, 90, was found dead inside a barn on the couple’s property. His wife Ada, 83, died outside the barn while checking on her husband, CBC reported.\nTemperatures also plunged in Montreal and Ottawa. Eastern parts of Quebec province were hit with up to 50 cm (20 inches) of snow, according to Environment Canada.\nAround 26,000 utility customers in Nova Scotia were still without power as of 4:20 p.m. EST (2120 GMT) on Friday, down from 85,000 earlier in the day, after workers restored power to 243,000 customers, Nova Scotia Power reported.\nThousands remained without power in the neighboring provinces of New Brunswick and Quebec, utility companies said.\nReporting By Anna Mehler Paperny in Toronto and Allison Lampert in Montreal. Additional reporting by Darren Calabrese in Halifax and Scott Disavino in New York; Writing by Andrew Hay; Editing by Dave Gregorio and Jonathan Oatis\n ", "external_links": [], "published": "2018-01-05T16:44:00.000+02:00", "crawled": "2018-01-05T16:53:47.029+02:00", "highlightTitle": ""}