{"organizations": [], "uuid": "843edec0c6f6622a651128129a3a6de887c453b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WX788_39wLW_TOP_20180110065659.jpg", "site_section": "https://www.wsj.com/news/markets", "section_title": "Stock Market &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/euro-yen-tell-two-different-tales-of-negative-rates-1516539601", "country": "US", "domain_rank": 387, "title": "Euro, Yen Tell Two Different Tales of Negative Rates", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.793, "site_type": "news", "published": "2018-01-21T16:00:00.000+02:00", "replies_count": 0, "uuid": "843edec0c6f6622a651128129a3a6de887c453b3"}, "author": "Mike Bird", "url": "https://www.wsj.com/articles/euro-yen-tell-two-different-tales-of-negative-rates-1516539601", "ord_in_thread": 0, "title": "Euro, Yen Tell Two Different Tales of Negative Rates", "locations": [], "entities": {"persons": [], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS\nJapan and the eurozone share negative interest rates and stronger economic growth, but their currencies are heading in different directions.\nThat’s as markets project interest rates will rise quicker in the eurozone than Japan, a factor that is likely to continue pushing their currencies apart, analysts say.\nIn the past year, the euro has rallied by 14% against the dollar, while the yen is up by less than 2%. Against a basket of trade-weighted international currencies the yen has actually declined over the same period.\nA stronger currency feeds through to broader markets and the economy, often crimping exports, dragging on equity markets and reducing inflationary pressure. European shares, for instance, have underperformed those in Japan and the U.S., in part due to concern of the effect of a stronger euro on local exporters.\nThis week, both the European Central Bank and the Bank of Japan have policy meetings that will likely provide hints on interest-rate policy that will move their currencies.\n“What we clearly have is that the expectation for normalization is giving the euro a boost, and that’s part of what’s moving the currency,” said Andreas Koenig, head of global foreign exchange at Amundi, Europe’s largest asset manager.\nThe Bank of Japan is “happy to be at the very end of the list of central banks that normalize,” he said.\nBoth the ECB and BOJ have already reduced the size of their monthly bond purchases, but neither has yet raised their interest rates from negative territory.\nInvestors think that will happen first in the eurozone.\nThe interest rate on three-year euro overnight index swaps—a derivative used as a measure of interest-rate expectations—has risen by 0.23 of a percentage point since the beginning of 2017. That indicates that investors expect roughly one additional rate increase during the next three years than they previously did.\nIn comparison, the same derivative has risen by just 0.06 of a percentage point in Japan. That shows that most analysts believe the BOJ will still hold fire, despite stronger economic growth.\nThat’s down to inflation expectations. Though growth is robust, inflation in Japan, at 0.7%, is well below its target of 2%.\nJapanese “inflation is rising gradually but domestic economic conditions are not strong enough to accelerate this inflation,” said Katsunori Kitakura, lead strategist at SuMi Trust, Japan’s largest asset manager.\nTo help boost inflation, the Bank of Japan aims to keep yields on 10-year government bonds at around 0%. Even if that target was raised in the coming months, if Japanese yields follow those in the rest of the world higher, it would still leave Japanese monetary policy comparatively easy, according to Mr. Kitakura.\nSuch stimulus aims to increase inflation by driving down the yields of government bonds, pushing investors into assets like stocks and corporate bonds, and so encouraging business activity and, eventually, price rises.\nThe eurozone has also repeatedly missed its close-to-2% inflation target. The central bank’s forecasts suggest that core inflation—which strips out volatile items like oil and food prices—will only rise to 1.8% by 2020. It is currently at 1.1%.\nBut the current strength of the euro should reduce those ECB projections by 0.1 to 0.2 percentage point, according to Aline Schuiling, senior economist at ABN Amro. A rising euro causes the price of imports denominated in other currencies to decline, squeezing inflation.\nThe stronger euro has hurt local stocks. The Euro Stoxx index is up 14% in the past year, compared with a rise of 26% for Japan’s Nikkei 225 and 24% for the S&P 500.\nEach 10% rise in the trade-weighted euro reduces the earnings of European listed companies by around 6%, according to analysis by UBS .\nExports from the eurozone have yet to suffer much from the stronger euro, rising by nearly 5% in the year to November 2017. But Japan’s export growth has been considerably stronger, a surge of around 11%.\nSpeculators expect the euro and yen to drift even further apart, according to data from the U.S. Commodity Futures Commission.\nThe net long position in euro foreign-exchange futures—a measure of bullish bets on the currency’s value—is near record levels, according to CFTC data, with 139,490 more long than short contracts on the single currency.\nIn contrast, speculators are heavily positioned for a fall in the yen, with 119,350 more short than long contracts on the Japanese currency.\nAnalysts at Japanese bank Nomura expect the dollar to rise against the yen, hitting ¥120 by the end of this year. In contrast, they expect the euro to continue to rally to as high as $1.30 in 2018.\nWrite to Mike Bird at Mike.Bird@wsj.com", "external_links": ["https://djcs-olympics.s3.amazonaws.com/custom-data-charts/custom-data-chart-wsj-0.8.29.min.js"], "published": "2018-01-21T16:00:00.000+02:00", "crawled": "2018-01-21T20:10:11.035+02:00", "highlightTitle": ""}