{"organizations": [], "uuid": "3894cc1a7d9dcbe92cc237acb9fb57a351833157", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226470020&w=1200&r=LYNXMPEE0T04G", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-china-tawian-flights/china-eastern-says-cancels-flights-amid-routes-row-with-tawian-idUKKBN1FJ09P", "country": "US", "domain_rank": 408, "title": "China Eastern says cancels flights amid routes row with Taiwan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T04:47:00.000+02:00", "replies_count": 0, "uuid": "3894cc1a7d9dcbe92cc237acb9fb57a351833157"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-tawian-flights/china-eastern-says-cancels-flights-amid-routes-row-with-tawian-idUKKBN1FJ09P", "ord_in_thread": 0, "title": "China Eastern says cancels flights amid routes row with Taiwan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 2:49 AM / Updated 26 minutes ago China Eastern, Xiamen Airlines cancel Taiwan flights amid routes row John Ruwitch , Jess Macy Yu 4 Min Read \nSHANGHAI/TAIPEI (Reuters) - China Eastern Airlines and Xiamen Airlines said on Tuesday they had cancelled 176 round-trip flights to Taiwan that had been added to their schedules to meet demand over the Lunar New Year, amid a row between Beijing and Taiwan over flight routes. \nThe airlines said in separate statements they had no choice but to cancel the trips after what they said was a refusal by Taiwanese authorities to approve the flights. \nThis month China opened several new air routes, including a northbound route up the Taiwan Strait that divides China from the island. Taiwan says it was done without its agreement, contravening what the democratic government in Taipei has said was a 2015 deal to first discuss such flight paths. \nIn response, self-governed Taiwan has withheld approval of routine applications from China Eastern and Xiamen Airlines, majority owned by China Southern Airlines, to add Lunar New Year flights because the airlines had used the disputed air routes. \nTaiwan has expressed concern the new routes are too close to existing routes that link it to airports on two groups of Taiwan-controlled islands lying close to China, and are a threat to flight safety. China says there is no safety threat. \nChina considers Taiwan a wayward province, and relations have cooled since Tsai Ing-wen of the independence-leaning Democratic Progressive Party took office as Taiwan’s president in 2016. \n“We express our strong dissatisfaction and condemnation of the Taiwan authorities, who disregard public opinion and cling obstinately to their course,” China Eastern said. \nThe airline apologised to customers and said it was providing free refunds and rebooking for anyone booked on the now-cancelled flights. CHOICE \nXiamen Airlines urged “relevant Taiwan authorities to proceed from the stand point of the well-being of people on both sides of the Strait, comply with popular wishes, meet the urgent needs of the people, and not artificially obstruct the return home of Taiwan compatriots.” \nIn a scathing statement on Tuesday, China’s civil aviation administration said Taiwan bore sole responsibility for any consequences arising from the cancelled flights. It said it had called on other airlines to help travellers make the journey. \nBut at a news conference on Tuesday in Taipei, Taiwan’s transportation minister, Ho Chen Tan, said the island’s government had not forced the airlines to cancel their flights. \n“We never said that we wouldn’t approve of the added flights by China Eastern or Xiamen Airlines. All along we said we hope that the situation can meet the needs of travellers and that we can all discuss an appropriate arrangement for the added flights,” Ho said. \n“At this time, they said themselves they don’t want to apply. It’s not at all that we said we didn’t agree for them to apply,” Ho added. \nWith air fares rising before the Lunar New Year, Taiwan’s transportation ministry said it would try its best to help Taiwanese return home over the holiday. \nIn addition to direct flights, Taiwanese in China can transit home through places like Hong Kong or Macau, or take ferries from Fujian province to the Taiwan-controlled islands of Kinmen and Matsu and then domestic flights back to Taiwan. \nThe reduction in the number of flights would be an irritant but most likely wouldn’t cause havoc. \n“There will be an impact, but this kind of impact is spread out because we have a few ways to go back, we can go via Hong Kong,” said a man surnamed Yang who works at a Taiwanese business association in the coastal city of Quanzhou on the Chinese side of the Taiwan Strait. \n“If someone wants to go home, they can come up with a way.” Reporting by John Ruwitch and Brenda Goh in SHANGHAI and Jess Macy Yu in TAIPEI; Editing by Edwina Gibbs and Neil Fullick", "external_links": [], "published": "2018-01-30T04:47:00.000+02:00", "crawled": "2018-01-30T05:13:23.030+02:00", "highlightTitle": ""}