{"organizations": [], "uuid": "7c42c51056b559c1f30d9a7efd9b21f916d04905", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-scottish-re-group-limited-announces-a-sale-and-restructuring-plan-and-the-commencement-of-chapter-11-proceedings-by-certain.html", "country": "US", "domain_rank": 767, "title": "Scottish Re Group Limited Announces a Sale and Restructuring Plan and the Commencement of Chapter 11 Proceedings by Certain of its Subsidiaries", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.027, "site_type": "news", "published": "2018-01-29T08:09:00.000+02:00", "replies_count": 0, "uuid": "7c42c51056b559c1f30d9a7efd9b21f916d04905"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-scottish-re-group-limited-announces-a-sale-and-restructuring-plan-and-the-commencement-of-chapter-11-proceedings-by-certain.html", "ord_in_thread": 0, "title": "Scottish Re Group Limited Announces a Sale and Restructuring Plan and the Commencement of Chapter 11 Proceedings by Certain of its Subsidiaries", "locations": [], "entities": {"persons": [], "locations": [{"name": "bermuda", "sentiment": "none"}, {"name": "cayman islands", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "re group limited", "sentiment": "neutral"}, {"name": "hudson structured capital management ltd.", "sentiment": "none"}, {"name": "cayman) ltd.", "sentiment": "none"}, {"name": "spa", "sentiment": "none"}, {"name": "scottish annuity & life insurance company", "sentiment": "none"}, {"name": "salic", "sentiment": "none"}, {"name": "hudson structured", "sentiment": "none"}, {"name": "scottish holdings, inc.", "sentiment": "none"}, {"name": "united states bankruptcy court of delaware", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HAMILTON, Bermuda--(BUSINESS WIRE)-- Scottish Re Group Limited (“Scottish Re”) announced today that it has commenced implementation of a sale and restructuring plan for its Cayman Islands subsidiary, Scottish Annuity & Life Insurance Company (Cayman) Ltd. (“SALIC”), and SALIC’s U.S. subsidiary, Scottish Holdings, Inc. (“SHI”), on January 28, 2018.\nThe sale and restructuring plan is being implemented through the commencement by SALIC and SHI of U.S. Chapter 11 proceedings in the United States Bankruptcy Court of Delaware on January 28, 2018 (the “SALIC/SHI Chapter 11”).\nIn connection with the SALIC/SHI Chapter 11, Scottish Re announced that a stock purchase agreement (the “SPA”) has been executed between SALIC and SHI, on the one hand, and an investment fund advised by Hudson Structured Capital Management Ltd. (“Hudson Structured” or the “Buyer”), on the other. Upon closing of the SPA, Hudson Structured will own 100% of the stock of the reorganized SALIC. Hudson Structured executed certain documents associated with the SALIC/SHI Chapter 11 in order to act as plan sponsor of the SALIC/SHI Chapter 11.\nThe SALIC/SHI Chapter 11 is a critical step in Scottish Re’s sale and restructuring plan, which in addition to the sale of SALIC and SHI, also includes the sale to Hudson Structured of certain of SALIC’s subsidiaries, including Scottish Re (U.S.), Inc. (“SRUS”) and Scottish Re (Dublin) dac (“SRD”) (the “Sale and Restructuring”). The restructuring process, which has culminated in the execution of the SPA, was announced in the Scottish Re press release of May 23, 2017, at the time Scottish Re commenced voluntary provisional winding up proceedings in Bermuda with ancillary proceedings in the Cayman Islands.\nCertain Scottish Re subsidiaries, such as SRUS, SRD, and Scottish Re Life (Bermuda) Limited (“SRLB” and together with SRUS and SRD, the “Non-Debtors”), are not debtors in the SALIC/SHI Chapter 11 and as such, contracts and relationships between the Non-Debtors and their reinsurance and other counterparties, vendors, and employees are largely unaffected by the SALIC/SHI Chapter 11 filing.\nSALIC faces acute liquidity issues in the first quarter of 2018 as a result of the historically adverse performance of Scottish Re’s legacy book of yearly renewable term (“YRT”) reinsurance business, and the growing strain created by the upcoming payments due on 20 quarters of accrued and deferred interest on trust preferred securities guaranteed by SALIC.\nTwo of SALIC’s wholly-owned subsidiaries, SHI and Scottish Financial (Luxembourg) S.á.r.l. (“SFL”), entered into a series of capital markets transactions from 2002 to 2004 in which those entities sold bonds to various trusts. Those trusts in turn issued trust preferred securities to the market (the “TRUPS”). SALIC guaranteed the payment and other obligations of SHI and SFL in connection with the TRUPS transactions. Currently, $86 million of aggregate principal amount of TRUPS obligations (net of an additional $43 million of TRUPS owned by SALIC’s parent, Scottish Re) remain outstanding. As permitted under the terms of the TRUPS, SHI and SFL began deferring interest payments on the TRUPS commencing in the first quarter of 2013. Interest may only be deferred on the TRUPS for a maximum of twenty (20) consecutive quarters, and, as a result, accrued and deferred interest in an amount of approximately $20 million (net of an additional approximately $11 million of deferred interest amounts owing to Scottish Re in respect of the TRUPS held by Scottish Re) must be paid in the first quarter of 2018. SHI and SFL lack the resources to make this payment, and SALIC is unable to pay the TRUPS deferred interest and still meet its other obligations, including reinsurance obligations to third-party ceding companies, as well as to SRUS, in 2018.\nSALIC devised and executed a restructuring plan to try and resolve its liquidity issue in a timely fashion and to maximize value to its stakeholders. Among the steps taken by SALIC were the engagement of Keefe, Bruyette & Woods, Inc. a Stifel Company, to identify a buyer, and retention of legal counsel in New York, Delaware, Bermuda and the Cayman Islands who are very familiar with Scottish Re and insurance restructuring options.\nWith the impending liquidity constraint facing SALIC, the SALIC/SHI Chapter 11 process is designed to:\nPermit SALIC to continue as a going concern during the reorganization process, and to continue to provide uninterrupted performance of its obligations to its third-party and affiliated reinsurance counterparties and business partners; Permit the SALIC businesses, post-reorganization and under new ownership, to continue to actively participate in the U.S. life reinsurance and annuity industries; Provide SALIC and (as a result of SRGL’s ownership of certain of the SHI/SFL TRUPS) SRGL, with the opportunity to maximize value for their stakeholders; Permit SALIC to address legacy liabilities in a manner that is fair to creditors; and Preserve the existing jobs of the employees of SALIC and its subsidiaries.\nThe Board of Directors of Scottish Re voted on January 24, 2018 to authorize and direct SALIC to file the SALIC/SHI Chapter 11 and generally to implement the Sale and Restructuring. In addition, following the Bermuda Court appointment in May 2017 of John McKenna of Finance & Risk Services Ltd., of Bermuda and Eleanor Fisher of Kalo (Cayman) Limited of the Cayman Islands as Joint Provisional Liquidators of Scottish Re (the “JPLs”), the JPLs have worked with Scottish Re to effectuate the Sale and Restructuring.\nThe SPA is subject to certain closing conditions related to the SALIC/SHI Chapter 11, as well as the receipt by Hudson Structured of regulatory approvals necessary to effectuate a change of control of SALIC, SRUS, SRD and SRLB. In addition, it is anticipated that the bankruptcy court will conduct an auction process to solicit alternative transactions that meet criteria to be established by the court. In the absence of an unmatched superior bid during the auction, Hudson Structured should be confirmed as the winning bidder and is expected to close the Sale and Restructuring. Scottish Re is hopeful that the Sale and Restructuring will be approved by the third quarter of 2018, including receiving the aforementioned regulatory approvals, as well as having the SALIC/SHI restructuring plan confirmed by the US Bankruptcy Court.\nIn conjunction with today’s announcement, SALIC will file a number of first day motions that are intended to allow it to operate in the ordinary course of business during the restructuring process. It is anticipated that SFL will in the near future petition the Luxembourg District Court for liquidation under Luxembourg’s Commercial Code.\nAbout Scottish Re:\nScottish Re is a global life reinsurance specialist with operating businesses in the United States of America, Ireland, Bermuda, and the Cayman Islands. Its primary subsidiaries include Scottish Re (U.S.), Inc., Scottish Re (Dublin) dac, and Scottish Annuity & Life Insurance Company (Cayman) Ltd. Additional information about Scottish Re can be obtained from its web site at www.scottishre.com .\nAbout Hudson Structured Capital Management Ltd.:\nHudson Structured Capital Management Ltd., founded in 2015, invests in reinsurance and insurance-linked assets across all lines of businesses through an array of innovative structures that allow risk transference, including from the life and property/casualty sectors, to the capital markets. Its focus is on core economic sectors that are likely to outgrow global GDP, offer low correlations with broader markets and are experiencing a shift from balance sheet to market financing.\nwww.hscm.com\nForward Looking Information\nThis press release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact are, or may be deemed to be, forward-looking statements. Forward-looking statements include, without limitation, any statement that may project, indicate or imply future results, events, performance or achievements, and may contain or be identified by the words “believe”, “expect”, “expected to be”, “anticipate”, “plan”, “intend”, foresee”, “forecast”, “continue”, “can”, “will”, “will continue”, “may”, “should”, “would”, “could” or other similar expressions that are intended to identify forward-looking statements. In addition, any statement concerning future financial performance, ongoing business strategies or prospects are also forward-looking statements as so defined. Statements in this press release that contain forward-looking statements may include, but are not limited to, statements regarding future operations and performance of Scottish Re’s operating subsidiaries, future liquidity and capital resources, results of the restructuring process and future financial positions, competitive position and growth opportunities.\nThese forward-looking statements are based on our current expectations and beliefs concerning future developments and their potential effect on us. While management believes that these forward-looking statements are reasonable as and when made, there can be no assurance that future developments affecting us will be those that we anticipate. All comments concerning our expectations for future financial position are based on our forecasts for our existing operations. Our forward-looking statements involve significant risks and uncertainties (many of which are beyond our control) and assumptions that could cause actual results to differ materially from our historical experience and our present expectations or projections. These significant risks and uncertainties include, but are not limited to, the sale and restructuring plan, such as: the ability of SALIC to obtain approval with respect to motions filed in the SALIC/SHI Chapter 11 , the Court’s rulings in the SALIC/SHI Chapter 11 and the outcome of the SALIC/SHI Chapter 11 in general; the length of time SALIC will operate under Chapter 11; risks associated with third-party motions in the SALIC/SHI Chapter 11, which may interfere with the Company’s ability to develop and consummate the restructuring plan; the effects of disruption from the restructuring making it more difficult to maintain business, financing, and operational relationships, to retain key executives and employees and to maintain various licenses and approvals necessary for SALIC to conduct its business; increased legal and advisor costs related to the SALIC/SHI Chapter 11 and other litigation and the inherent risks involved in a bankruptcy process; and the ability for SALIC to continue as a going concern. Given these risks and uncertainties, investors should not place undue reliance on forward-looking statements. These forward-looking statements should not be regarded as representations that are projected or anticipated outcomes can or will be achieved. These forward-looking statements speak only as of the date hereof. We expressly disclaim any obligation or undertaking to publicly update or revise any forward-looking statements after the date they are made, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180128005081/en/\nScottish Re Group Limited\nScottish Re Media and Investor Contact:\nGregg Klingenberg, 441-298-4375\nChief Executive Officer\nSource: Scottish Re Group Limited", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hscm.com%2F&esheet=51749942&newsitemid=20180128005081&lan=en-US&anchor=www.hscm.com&index=2&md5=32bf58be508762fa0fdc3b00b91b55fe", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.scottishre.com&esheet=51749942&newsitemid=20180128005081&lan=en-US&anchor=www.scottishre.com&index=1&md5=90a62e2cdba372cea0a9effcae4e5893", "http://www.businesswire.com/news/home/20180128005081/en/"], "published": "2018-01-29T08:09:00.000+02:00", "crawled": "2018-01-29T10:28:03.010+02:00", "highlightTitle": ""}