{"organizations": [], "uuid": "53230a458df71ab2b55834e4d2a63e4456697194", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/20/104177799-GettyImages-110262931.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/italys-election-is-a-threat-to-stability.html", "country": "US", "domain_rank": 767, "title": "Italy's election is a 'threat' to stability", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.879, "site_type": "news", "published": "2018-01-30T08:28:00.000+02:00", "replies_count": 0, "uuid": "53230a458df71ab2b55834e4d2a63e4456697194"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/30/italys-election-is-a-threat-to-stability.html", "ord_in_thread": 0, "title": "Italy's election is a 'threat' to stability", "locations": [], "entities": {"persons": [{"name": "carlo calenda", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "european union italy", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "March's general election in Italy poses a threat to stability at a time when the economy is performing well, according to the country's economic development minister.\nCarlo Calenda told CNBC on Monday that the prospect of a hung parliament following the March 4 election, when it is expected that no one party will gain an absolute majority allowing it to govern alone, was a risk.\n\"It's a threat and it's clear that once we have a system that is based on three pillars (political parties) that this is very difficult to find a majority,\" he said. \"Although, I have to say that there is a government today that is in place, that has the trust of the Italian citizen, and I think that this is a positive backstop.\"\nCalenda is an independent politician who first took the economic development ministry job in 2016, under the previous Matteo Renzi government. He stayed on in the role until December 2016, when Paolo Gentiloni took office after Renzi's resignation following a failed referendum over constitutional reforms.\nCalenda has been tipped as a future finance minister and even a future prime minister of Italy, although he ruled himself out of the running for the top job when speaking to CNBC.\nFranco Origlia | Getty Images News | Getty Images A boy waves the Italian flag in front of the Ancient Colusseum \"No, I think Gentiloni is much better and more skilled than me in doing this job. I'm more technical in working in the area of the economy and economic development… It is not something that is going to happen,\" Calenda said.\nHe expressed more interest in the finance ministry should current Finance Minister Pier Carlo Padoan leave the role.\n\"If I share the program of the next government — because I'm free to go back to the private sector where I belong and this has been a fantastic experience (being in politics) — but what is very important for me is to remain free and independent,\" he said.\nCalenda said he would prioritize boosting investment and reducing the deficit if he did become finance minister.\nShould the March election produce a hung parliament, there are concerns that any delays in forming a government could lead to political uncertainty and economic instability for the euro zone's third-largest economy.\nCalenda said the Italian economy was performing well, but challenges surrounding productivity, labor markets and the banking system — including Italy's banks large amount of non-performing loans — remained.\n\"Finally, we are out of the crisis,\" he said. \"Last year, we had gross domestic product (GDP) growth of around 1.5 percent but even more importantly our export growth was around 8 percent — more than Germany and much more than France. Also private investment in the manufacturing sector is very, very high — up 11 percent.\"\n\"So there is a part of Italy (that) is performing very well and is now into the global value chain… Now what we need to do is (make) more companies to follow the same kind of path and this is our crucial task,\" he said, adding that dealing with Italy's non-performing loans was also the country's \"most important challenge.\"", "external_links": [], "published": "2018-01-30T08:28:00.000+02:00", "crawled": "2018-01-30T08:28:32.019+02:00", "highlightTitle": ""}