{"organizations": [], "uuid": "947a74d8887d0371d96c726a9a3881a5be1327d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104973546-GettyImages-536235410.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/thomas-cook-launches-sunbed-pre-booking-scheme.html", "country": "US", "domain_rank": 767, "title": "Thomas Cook launches sunbed pre-booking scheme", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.221, "site_type": "news", "published": "2018-01-29T12:51:00.000+02:00", "replies_count": 0, "uuid": "947a74d8887d0371d96c726a9a3881a5be1327d0"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/29/thomas-cook-launches-sunbed-pre-booking-scheme.html", "ord_in_thread": 0, "title": "Thomas Cook launches sunbed pre-booking scheme", "locations": [], "entities": {"persons": [{"name": "thomas cook", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "european union", "sentiment": "negative"}, {"name": "reuters wladimir", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "That moment when you're on vacation and go down to the hotel pool to find towels placed on every sunbed could soon become a thing of the past with a the launch of a pre-booking scheme for sun loungers.\nBritish travel giant Thomas Cook announced Monday that it was launching a service that allows customers to choose their sunbed before they leave home.\nWith \"Choose Your Favourite Sunbed,\" the travel agent said it was trialling the scheme in three Thomas Cook own-brand hotels from the end of February and it will be available in 30 own-brand hotels for summer 2018.\n\"Sunbed wars\" have become an almost legendary part of the European summer holiday experience with stereotypes abounding about which nation's holidaymakers are the worst culprits — the British, Irish and Germans are often accused of being the worst sun lounger hoggers.\nThere are numerous videos on YouTube showing holidaymakers scrambling and sprinting to the pool areas of various hotels , sometimes at the break of dawn, to put their towels on sunbeds in a bid to reserve them.\nThomas Cook, a giant of the traditional package holiday popular with families, said that the pre-booking scheme it has announced \"allows families and couples to pre-book sunbeds in their preferred location, helping them stay together, spend more time on their favorite activities, then returning to the pool when it suits them, safe in the knowledge their beds will be waiting.\"\nChris Mottershead, Thomas Cook's U.K. managing director, said: \"Traditional package holidays are a thing of the past. Holidaymakers today want to personalize their package, mixing and matching the elements that best fit their needs and lifestyle.\"\nThe service will cost 25 euros ($31) per sunbed per stay. A proportion (10-20 percent) of a hotel's sunbeds will be bookable to ensure there are still enough sunbeds for those who don't wish to take up the service.", "external_links": [], "published": "2018-01-29T12:51:00.000+02:00", "crawled": "2018-01-29T12:51:53.012+02:00", "highlightTitle": ""}