{"organizations": [], "uuid": "1e23d774107d3f58cc50106a31d85760423b2b85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-north-carolina-crime/north-carolina-mother-kills-two-children-jumps-off-bridge-idUSKBN1F42OX", "country": "US", "domain_rank": 408, "title": "North Carolina mother kills two children, jumps off bridge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T00:21:00.000+02:00", "replies_count": 0, "uuid": "1e23d774107d3f58cc50106a31d85760423b2b85"}, "author": "", "url": "https://www.reuters.com/article/us-north-carolina-crime/north-carolina-mother-kills-two-children-jumps-off-bridge-idUSKBN1F42OX", "ord_in_thread": 0, "title": "North Carolina mother kills two children, jumps off bridge", "locations": [], "entities": {"persons": [{"name": "isaiah miller", "sentiment": "none"}, {"name": "tina lateena", "sentiment": "none"}, {"name": "cyndi lauper", "sentiment": "none"}, {"name": "rihanna", "sentiment": "none"}, {"name": "christina treadway", "sentiment": "none"}, {"name": "john legend", "sentiment": "none"}, {"name": "isaiah", "sentiment": "none"}, {"name": "iliyah miller", "sentiment": "none"}, {"name": "iliyah", "sentiment": "none"}], "locations": [{"name": "north carolina", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "charlotte-mecklenburg police department", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - A North Carolina woman who liked to post videos of her children performing on YouTube fatally injured her son and daughter and then killed herself by jumping off a bridge, police said.\nAfter 34-year-old Christina Treadway’s suicide on Saturday, police found Isaiah Miller, 7, and Iliyah Miller, 3, with life-threatening injuries at their home, the Charlotte-Mecklenburg Police Department and Charlotte media said. They later died at a hospital, police said.\nThe mother posted numerous cute and loving videos of her children online, including one in which Iliyah sings a song she wrote called, “Mommy, I love you.”\n“I always trust you,” the little girl sings in one post under the mother’s handle, Tina Lateena.\nIn others, the children cover hits with Iliyah singing Cyndi Lauper’s “True Colors” and Isaiah taking on “All of Me” by John Legend. Iliyah also dances to Rihanna’s “Love on the Brain.”\nIn another video, the two siblings, then aged 6 and 2, identified each other as best friends and said they wanted to be police officers when they grew up.\nInterviewed by an unidentified woman off camera, the children are asked what they would do with $1 million. Isaiah says he would buy a mansion and car. Iliyah says she wants a squirt gun.\n“I‘m going to show you this when you’re like 30,” the woman says.\nTheir father, Antoine Miller, created a page on the Go Fund Me website, and as of Monday had raised $6,000 of his $10,000 goal to “send my babies to their resting place.”\n“My heart is broken, my world came crumbling down,” Miller wrote on the site. “My children’s mother decided to end her life. And end my two beautiful kids’ lives. I am beyond hurt and sad.”\nThe children’s paternal grandfather, speaking to WBTV television, described Isaiah as the “smartest kid I ever met” and Iliyah as a singer who could “carry a note like a 20-year-old.”\n“It’s something that’s going to take a long time to get over, if we ever get over it,” the grandfather, Gregory Moore, told WBTV.\nMoore also told Fox 46 television his son was out watching a football game when he received a text from Treadway.\n“She texted him saying that she loved them, she’s sorry, and she’s going to end it all, and the kids,” Moore said. “I‘m not a crier but I cried every five minutes. I’d just break down and cry.”\nReporting by Daniel Trotta; Editing by Lisa Shumaker\n ", "external_links": [], "published": "2018-01-16T00:21:00.000+02:00", "crawled": "2018-01-16T00:32:15.000+02:00", "highlightTitle": ""}