{"organizations": [], "uuid": "bce46aeec6c6325e82bdcca8bed604e2fa74f537", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-david-tilton-joins-avison-young-in-denver.html", "country": "US", "domain_rank": 767, "title": "David Tilton joins Avison Young in Denver", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.586, "site_type": "news", "published": "2018-01-05T18:00:00.000+02:00", "replies_count": 0, "uuid": "bce46aeec6c6325e82bdcca8bed604e2fa74f537"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-david-tilton-joins-avison-young-in-denver.html", "ord_in_thread": 0, "title": "David Tilton joins Avison Young in Denver", "locations": [], "entities": {"persons": [{"name": "david tilton", "sentiment": "negative"}, {"name": "wynne", "sentiment": "none"}, {"name": "rick egitto", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "alec wynne", "sentiment": "none"}, {"name": "tilton", "sentiment": "none"}, {"name": "avison young", "sentiment": "none"}], "locations": [{"name": "denver", "sentiment": "none"}, {"name": "co", "sentiment": "none"}], "organizations": [{"name": "avison young", "sentiment": "negative"}, {"name": "avison young principal", "sentiment": "none"}, {"name": "newmark knight frank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Highly regarded industry veteran becomes Principal, will help grow local investment sales practice\nDENVER, CO, Jan. 5, 2018 /PRNewswire/ - Alec Wynne , Avison Young Principal and Managing Director of the firm's Denver office, announced today the strategic hiring of highly regarded commercial real estate industry veteran David Tilton .\nEffective immediately, Tilton becomes a Principal of Avison Young and will continue to focus on his capital markets specialty. Working closely with Wynne and Principal Rick Egitto, Tilton will also help grow the Denver office's investment sales practice and capital markets group while serving new and existing clients. He brings 36 years of commercial real estate industry experience to Avison Young, most recently as executive managing director with Newmark Knight Frank in Denver.\n\"We are thrilled to have David join Avison Young,\" comments Wynne. \"He is a consummate professional who will deepen our collective bench strength in the capital markets service line. With more than three decades of industry experience, he brings key relationships that will quickly ramp up our institutional presence in Colorado and beyond. The addition of David to our capital markets team is significant; due to his extensive institutional-investment-transaction experience, he will provide a tremendous amount of value and elevate our brand within the capital markets space.\"\nWynne adds: \"We fully expect that our capital markets group will now be competing on the big stage of institutional buying and selling of major properties across the front range in Colorado. Lastly, David is a perfect fit culturally. He stands for many of the principles that we embody – including integrity, collaboration and hard work. With David on board, 2018 will prove to be an exciting year for Avison Young in Denver.\"\nPrior to joining Newmark Knight Frank in 2010, Tilton spent 28 years with the Frederick Ross Company, where he spearheaded the firm's investment sales practice while rising to the position of executive managing director and partner.\nDuring his career, Tilton has negotiated investment acquisitions and dispositions valued in excess of $2 billion and covering more than 70 million square feet, primarily in the office asset class. In 2017 alone, he brokered four office investment sales transactions involving assets with a combined value of $94.55 million. His notable transactions in recent years include the sale of 1800 Larimer, a 22-story, class AAA office highrise for $430 per square foot (psf) – the highest price on record for a Denver office building at the time; Mountain View Corporate Center, a class AA, four-building office complex, which sold for more than $200 psf, establishing a new price benchmark for the suburban northwest; and the three-building CH2M campus located in the Meridian International Business Park for $122 million ($330 psf).\nHe has completed investment sales and provided strategic advisory services for many of the Denver region's most well-known institutional and private-equity players, including: Hines, Miller Global, Legacy Partners, Columbia Property Trust and Avaya.\n\"I am pleased to be continuing my career at Avison Young, which will provide me with the opportunity to expand my business by growing the investment sales practice in Denver and employing different investment strategies,\" says Tilton. \"I was also excited by the opportunity to become a Principal of an international firm, while working with different clients and participating in the company's numerous community projects. I look forward to recruiting and mentoring up-and-coming capital markets professionals in Denver, collaborating with my new colleagues across the company, and contributing to Avison Young's ongoing aggressive global expansion program.\"\nTilton, a consistent top producer throughout his career, has earned a number of industry accolades, including Top 10 Producer with Frederick Ross Company/Newmark Knight Frank (2008 to 2014), CoStar Power Broker (2011), Denver Metro Commercial Association of Realtors (DMCAR) Heavy Hitter (1997, 1998 and 2001), and NAIOP Investment Broker of the Year (2001). He is active in the industry as a member of the Urban Land Institute, the Transit-Oriented Development Council, NAIOP and the Capital Markets Forum. Tilton holds a Bachelor of Arts degree in physical science from the University of Northern Colorado.\nOver the past nine years, Avison Young has grown from 11 to 82 offices and from 300 to more than 2,600 real estate professionals in Canada, the U.S., Mexico and Europe.\nAvison Young is the world's fastest-growing commercial real estate services firm. Headquartered in Toronto, Canada, Avison Young is a collaborative, global firm owned and operated by its principals. Founded in 1978, the company comprises 2,600 real estate professionals in 82 offices, providing value-added, client-centric investment sales, leasing, advisory, management, financing and mortgage placement services to owners and occupiers of office, retail, industrial, multi-family and hospitality properties.\nFor further information/comment/photos:\nSherry Quan , Principal, Global Director of Communications & Media Relations, Avison Young: 604.647.5098; cell: 604.726.0959 Alec Wynne , Principal and Managing Director, Denver, Avison Young: 720.508.8112 David Tilton , Principal, Avison Young: 303.390.0962 Earl Webb , President, U.S. Operations, Avison Young: 312.957.7610 Mark Rose, Chair and CEO, Avison Young: 416.673.4028\nwww.avisonyoung.com\nAvison Young was a winner of Canada's Best Managed Companies program in 2011 and requalified in 2017 to maintain its status as a Best Managed Gold Standard company.\nFollow Avison Young on Twitter:\nFor industry news, press releases and market reports: www.twitter.com/avisonyoung\nFor Avison Young listings and deals: www.twitter.com/AYListingsDeals\nFollow Avison Young Bloggers : http://blog.avisonyoung.com\nFollow Avison Young on LinkedIn : www.linkedin.com/company/avison-young-commercial-real-estate\nFollow Avison Young on YouTube : www.youtube.com/user/AvisonYoungRE\nFollow Avison Young on Instagram: www.instagram.com/avison_young_global\n• Editors/Reporters:\nPlease click on link to view and download photo of Dave Tilton:\nhttp://www.avisonyoung.com/documents/20342/2631393/David_Tilton.jpg\nSOURCE Avison Young Commercial Real Estate (BC)", "external_links": ["http://blog.avisonyoung.com/", "http://www.twitter.com/avisonyoung", "http://www.linkedin.com/company/avison-young-commercial-real-estate", "http://www.avisonyoung.com/", "http://www.youtube.com/user/AvisonYoungRE", "http://www.twitter.com/AYListingsDeals", "http://www.instagram.com/avison_young_global"], "published": "2018-01-05T18:00:00.000+02:00", "crawled": "2018-01-05T20:24:23.006+02:00", "highlightTitle": ""}