{"organizations": [], "uuid": "de3c3a764b877f1b326af3885c8ca1912f599803", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222316893&w=1200&r=LYNXMPEE0F083", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-sharapova/sharapova-enjoys-winning-return-to-melbourne-idUSKBN1F50AF", "country": "US", "domain_rank": 408, "title": "Sharapova enjoys winning return to Melbourne", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T06:18:00.000+02:00", "replies_count": 0, "uuid": "de3c3a764b877f1b326af3885c8ca1912f599803"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-sharapova/sharapova-enjoys-winning-return-to-melbourne-idUSKBN1F50AF", "ord_in_thread": 0, "title": "Sharapova enjoys winning return to Melbourne", "locations": [], "entities": {"persons": [{"name": "sharapova", "sentiment": "negative"}, {"name": "serena williams", "sentiment": "none"}, {"name": "maria sharapova", "sentiment": "none"}, {"name": "margaret court arena", "sentiment": "none"}, {"name": "maria", "sentiment": "none"}, {"name": "tatjana maria", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "melbourne reuters", "sentiment": "negative"}, {"name": "melbourne", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - Maria Sharapova’s previous match at the Australian Open sent her career spiraling to the darkest of depths but she returned in bright sunshine on Tuesday with a performance that went some way to banishing those demons.\nThe 30-year-old former champion, whose positive doping test after a quarter-final defeat by Serena Williams in 2016 resulted in a 15-month ban from the sport, was in dominant mood as she beat Germany’s Tatjana Maria 6-1 6-4 on Margaret Court Arena.\nThere will be tougher tests to come for the five-times grand slam champion but the relish with which she pummeled 22 winners suggests that in her second grand slam event since returning from exile, she could do damage, despite not being seeded.\nSharapova, who fell foul of the anti-doping regulations after failing to realize that heart drug meldonium had been added to the WADA prohibited list, attracted more unwanted headlines last week when she was selected for the draw ceremony.\nThat decision by tournament director Craig Tiley raised a few disapproving eyebrows, but there was plenty of support for the 2008 champion on Tuesday with regular shouts of “C‘mon Masha, we’ve missed you”.\nAfter ending fellow 30-year-old Maria’s dogged second-set resistance with an ace, Sharapova admitted she had “shivers” walking on to court.\nLater, when addressing the media, it was very much business as usual with Sharapova reluctant to talk about the past.\nAsked if her return to Melbourne had produced flashbacks to that fateful day two years ago, she said: “No. It’s not the way I look at things moving forward.”\nTennis - Australian Open - Margaret Court Arena, Melbourne, Australia, January 16, 2018. Maria Sharapova of Russia shakes hands with Tatjana Maria of Germany after Sharapova won their match. REUTERS/Issei Kato SEVASTOVA NEXT Sharapova struck the ball with venom in the first set in which the only blemish was dropping serve to give Maria a game.\nThe second set threatened to get a little tricky as Sharapova was broken to love to trail 1-3 but a forehand winner gave her break point in the next game and she converted it when Maria went wide.\nSlideshow (2 Images) Sharapova broke again at 3-3 as her opponent, actually ranked a place higher at 47, double-faulted and Sharapova moved into a 5-3 lead as Maria began to feel the strain.\nThe German managed to prolong the contest for another game but Sharapova finished off the match in style, belting a forehand winner at 30-30 and then aiming a searing first serve bang on the line.\nNext up is tricky Latvian 14th seed Anastasija Sevastova, who beat Sharapova at last year’s U.S. Open -- her first major since returning from the ban.\nShould she win, her path will appear to get even tougher with 2016 Australian Open champion Angelique Kerber and last year’s Wimbledon winner Garbine Muguruza also in her section of the draw.\n“You know, personally these are the players that I want to be playing. I want to be playing someone that has challenged me,” Sharapova said.\n“I want to be playing someone that’s on a hot streak and playing well. These are the players I should be playing and beating, as well. I expect that from myself.”\nReporting by Martyn Herman; Editing by John O'Brien\n ", "external_links": [], "published": "2018-01-16T06:18:00.000+02:00", "crawled": "2018-01-16T06:35:35.008+02:00", "highlightTitle": ""}