{"organizations": [], "uuid": "ec4928ef9465e562176f29fa4e5fc47659dfed45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-ecb-meets-as-euro-hits-three-year-high-idUSL8N1PK2HG", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Red hot euro, time to meet ECB's Mr cool", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-25T18:06:00.000+02:00", "replies_count": 0, "uuid": "ec4928ef9465e562176f29fa4e5fc47659dfed45"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-ecb-meets-as-euro-hits-three-year-high-idUSL8N1PK2HG", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Red hot euro, time to meet ECB's Mr cool", "locations": [], "entities": {"persons": [{"name": "marc jones", "sentiment": "none"}, {"name": "ross", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro hits three-year high vs dollar as ECB meets\n* Sterling at highest in 6 months vs euro\n* U.S. administration’s Ross hints at action against China\n* European shares flat after Tokyo’s Nikkei drops over 1 percent\n* Brent oil tops $71 a barrel for first time since 2014\n* Dollar on course for biggest ever monthly fall vs yuan\nBy Marc Jones\nLONDON, Jan 25 (Reuters) - The euro steadied at a three-year high on Thursday and shares inched back as traders waited to see if the European Central Bank would try to cool the currency’s hottest run in nearly four years.\nConcerns about U.S. protectionism kept the dollar weak after its worst day in six months, but it was the signals from the ECB’s first meeting of 2018 after it again kept rates at record lows that were attracting attention.\nA boom in the euro zone economy means some of the bank’s top policymakers want an increasingly swift end to its 2.6 trillion euro stimulus programme, but they know it comes with plenty of challenges.\nNumber one is how to address the euro’s surge - it was at a three-year high of over $1.24 ahead of a 1330 GMT ECB news conference - as this could dampen inflation and endanger the work done by years of unprecedented stimulus.\nEuro zone bonds were again reducing the premium offered by former debt crisis countries such as Greece, Portugal and Spain compared with ultra-safe German debt, but it will be a delicate balancing act for ECB chief Mario Draghi.\nOil prices, which are a major driver of inflation, hit $71 per barrel in Asian trading for the first time since 2014.\n“The rate of change (in the euro) might make the ECB a little uncomfortable,” said State Street’s head of EMEA macro strategy, Tim Graf.\n“They can’t push back too much on the fruits of their success, but you may well get comments around excessive currency volatility.”\nThe uncertainty about the ECB made for a quiet pre-amble for share markets.\nWall Street futures were pointing fractionally higher amid a flurry of earnings from heavyweight companies 3M Co, digger maker Caterpillar, which saw its sales surge 35 percent, and computer chip giant Intel.\nThe pan-European STOXX 600 was getting going too. It had barely budged early on as Germany’s exporter-heavy DAX index fell, but it was last sitting 0.2 percent higher as Frankfurt recovered to add to small gains on London’s FTSE and France’s CAC 40.\nAs well as the euro’s $1.24 milestone, sterling hit a new post Brexit vote high against the dollar of $1.4250 and also climbed to its highest in six months against the euro despite the euro zone currency’s broad advance.\nTRADE WAR GAMES? Asian trading had been a mixed bag, with many of the moves driven by the weakening of the dollar.\nMSCI’s broadest index of Asia-Pacific shares outside Japan touched an all-time peak for the ninth session in a row, but Japan’s Nikkei fell 1.1 percent, hit by the yen’s latest jump against the greenback.\nMSCI ACWI, the index provider’s broadest gauge of the world’s stock markets, consolidated its more than 6.5 percent gains for the month\nA Reuters poll of over 500 economists showed the global economy is expected to grow at the fastest pace since 2010.\nThe upbeat mood, however, has come up against renewed fears of protectionism by the United States after President Donald Trump’s decision to impose steep import tariffs on washing machines and solar panels earlier in the week.\nU.S. Commerce Secretary Wilbur Ross, hinted at other measures against China too on Wednesday, saying at the annual Davos meeting that Washington was investigating whether there was a case for taking action over China’s infringements of intellectual property.\nTrump is scheduled to speak in Davos on Thursday.\nAlso in the Swiss Alpine town, U.S. Treasury Secretary Steven Mnuchin made a major departure from traditional U.S. currency policy on Wednesday, saying “obviously a weaker dollar is good for us as it relates to trade and opportunities”.\nAnalysts say they cannot remember any U.S. Treasury Secretary openly embracing a cheaper dollar, at least in the last two decades or so.\n“I was speculating the Trump administration may role out something with fanfare given its big delegation to Davos,” said Masayuki Kichikawa, chief macro strategist at Sumitomo Mitsui Asset Management.\n“I’d think the real aim of Mnuchin’s comments on the dollar is not so much engineering a weaker dollar per se as putting pressure on trading partners to do some trade deals with the administration,” he added.\nThe dollar’s index against a basket of six major currencies tumbled to a three-year low of 88.816 before steadying in European trading. It has fallen 1.9 percent so far this week.\nThe dollar had also slipped to as far as 108.74 yen, its lowest since mid-September, and to its weakest against the Chinese yuan since November 2015. It is on course for its biggest monthly fall against the yuan.\n“They (the U.S. administration) can either have tariffs with the rest of the world or do it organically through a nice depreciation of the dollar,” said JP Morgan Asset Management’s chief European markets strategist Karen Ward.\nReporting by Marc Jones; Editing by Alison Williams\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T18:06:00.000+02:00", "crawled": "2018-01-26T21:33:35.014+02:00", "highlightTitle": ""}