{"organizations": [], "uuid": "0e2e6e910db16d549b260e69f4479368d998a47d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-takeda-announces-intention-to-acquire-tigenix.html", "country": "US", "domain_rank": 767, "title": "Takeda Announces Intention to Acquire TiGenix", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.284, "site_type": "news", "published": "2018-01-05T09:22:00.000+02:00", "replies_count": 0, "uuid": "0e2e6e910db16d549b260e69f4479368d998a47d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-takeda-announces-intention-to-acquire-tigenix.html", "ord_in_thread": 0, "title": "Takeda Announces Intention to Acquire TiGenix", "locations": [], "entities": {"persons": [{"name": "crohn", "sentiment": "none"}, {"name": "takeda", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "osaka", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "takeda", "sentiment": "negative"}, {"name": "committee for medicinal products", "sentiment": "none"}, {"name": "ibd", "sentiment": "none"}, {"name": "acquisition", "sentiment": "none"}, {"name": "european medicines agency", "sentiment": "none"}, {"name": "takeda pharmaceutical company limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OSAKA, Japan, January 5,\nExpands Takeda's Late Stage Pipeline and Leadership in Gastroenterology\nAcquisition Highlights\nDeal reinforces Takeda's commitment to patients living with Inflammatory Bowel Disease (IBD), an area of high unmet medical need Acquisition extends existing collaboration between Takeda and TiGenix to develop and commercialize Cx601 (darvadstrocel) On December 15, 2017, the Committee for Medicinal Products for Human Use (CHMP) of the European Medicines Agency (EMA) adopted a positive opinion recommending marketing authorization for Cx601 for the treatment of complex perianal fistulas in Crohn's disease, one of the most disabling manifestations of the disease A global, pivotal Phase III trial for U.S. registration has been initiated with investigational medicine Cx601 for the treatment of complex perianal fistulas in patients with non-active/mildly active luminal Crohn's disease Acquisition would expand Takeda's late stage gastroenterology pipeline and strengthen presence in the U.S. specialty care market\nTakeda Pharmaceutical Company Limited (TSE: 4502) (\"Takeda\") today announced its intention to acquire TiGenix NV (Euronext Brussels and NASDAQ: TIG) (\"TiGenix\"), an advanced biopharmaceutical company developing novel stem cell therapies for serious medical conditions, and as a result has entered into an offer and support agreement with TiGenix which provides for a recommended potential voluntary public takeover bid for TiGenix. The Takeda agreement has the unanimous support of the TiGenix board of directors (including its CEO). The acquisition is a natural extension of an existing partnership agreement between Takeda and TiGenix, which aims to bring new treatment options to patients with gastrointestinal disorders.\n\"As a leader in gastroenterology, Takeda recognizes the complex physical, emotional and social barriers that people living with fistulizing Crohn's disease experience,\" said Andrew Plump, Chief Medical and Scientific Officer, Takeda. \"Limited treatment options exist today and I believe we can be most effective in serving this population by working in collaboration with partners whose unique skill sets allow us to more efficiently explore innovative approaches, including stem cell therapies. I have had the opportunity to work alongside the TiGenix team throughout our collaboration and know that we have shared goals and varied, but complementary expertise. I am thrilled at the prospect of welcoming them as part of our organization.\"\nIn July 2016, Takeda and TiGenix entered into an exclusive ex-U.S. license, development and commercialization agreement for Cx601, the leading investigational therapy in TiGenix's pipeline. Cx601 is a suspension of allogeneic expanded adipose-derived stem cells (eASC) locally administered for the treatment of complex perianal fistulas in patients with non-active/mildly active luminal Crohn's disease, who have had an inadequate response to at least one conventional or biologic therapy. In December 2017, the CHMP of the EMA adopted a positive opinion recommending a marketing authorization for Cx601 in this indication, the first allogeneic stem cell therapy to achieve this. A decision from the EMA on the marketing authorization for Cx601 is expected in the first half of 2018.\nComplex perianal fistulas are considered one of the most disabling manifestations of Crohn's disease and can cause intense pain, infection and incontinence. [2 ] , Despite modern and surgical advancements, they currently remain challenging for clinicians to treat and can have a severe impact on the lives of those affected. [ 3 ]\nA global, pivotal Phase III trial investigating Cx601 for the treatment of complex perianal fistulas in patients with non-active/mildly active luminal Crohn's disease has been initiated for U.S. registration. In the U.S., Takeda intends to work with the U.S. FDA to facilitate the development and potential approval of Cx601. Takeda is also exploring the steps required for regulatory filing of Cx601 for patients in Japan, Canada and emerging markets.\nThrough the potential voluntary public takeover bid, Takeda intends to acquire 100% of the securities with voting rights or giving access to voting rights of TiGenix not already owned by Takeda or its affiliates at an acquisition price of EUR 1.78 per share in cash and an equivalent price per American Depositary Share, warrant and convertible bond, representing a transaction value of approximately EUR 520 million on a fully diluted basis. The bid will be subject to certain conditions precedent as further described below.\nSubject to its fiduciary duties and review of the final bid prospectus, the bid is unanimously supported by TiGenix's board of directors (including its CEO). Takeda and TiGenix entered into an offer and support agreement confirming TiGenix's support and the terms and conditions of the bid set forth in this press release. Gri-Cel S.A., holding 32,238,178 TiGenix shares, and its affiliate Grifols Worldwide Operations Ltd., holding 7,189,800 TiGenix shares in the form of American Depositary Shares, have irrevocably confirmed that they will tender their shares and American Depositary Shares into the potential public takeover bid.\nTransaction terms\nThe acquisition is structured as an all cash voluntary public takeover bid by Takeda with respect to 100% of the securities with voting rights or giving access to voting rights of TiGenix that are not already owned by Takeda or its affiliates. The transaction is subject to the following conditions precedent: (i) the tender into the offer, in aggregate, of a number of securities that, together with all securities owned by Takeda and its affiliates, represents or gives access to 85% or more of the voting rights represented or given access to by all of the outstanding securities on a fully diluted basis as of the end of the first acceptance period, (ii) the absence of a material adverse effect occurring at any time after the date of this announcement, (iii) Cx601 obtaining marketing authorization in the E.U. from the European Medicines Agency (EMA) and (iv) the expiration, lapse or termination as appropriate of any applicable waiting periods (including any extensions thereof) under the Hart-Scott-Rodino Antitrust Improvements Act of 1976 in respect of the offer.\nFollowing closing of the potential voluntary public takeover bid, Takeda intends to launch a squeeze-out if the applicable conditions for such squeeze-out are met to delist the shares of TiGenix from Euronext Brussels and NASDAQ. After the squeeze-out, TiGenix would become a wholly-owned subsidiary of Takeda.\nThis communication does not constitute a formal notification of a voluntary public takeover bid. In case Takeda would decide to formally launch the voluntary public takeover bid, full details of such public takeover bid will be covered by the prospectus to be filed with the Belgian Financial Services and Markets Authority and the offer documents which will be available at http://www.sec.gov . In the event that Takeda would decide not to proceed with the potential voluntary public takeover bid, then Takeda and TiGenix will is", "external_links": ["https://www.takeda.com/investors/", "http://dx.doi.org/10.1053/j.gastro.2017.12.020", "https://www.takeda.com/newsroom/"], "published": "2018-01-05T09:22:00.000+02:00", "crawled": "2018-01-05T09:47:22.014+02:00", "highlightTitle": ""}