{"organizations": [], "uuid": "0dee1012e981e56455bc891486278f91e4374ea9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 167, "shares": 167, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220367428&w=1200&r=LYNXMPEE071GX", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-canada-wages-ontario/minimum-wage-hike-has-rocky-start-in-canadas-ontario-province-idUSKBN1EX2CN", "country": "US", "domain_rank": 408, "title": "Minimum wage hike has rocky start in Canada's Ontario province", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T23:53:00.000+02:00", "replies_count": 0, "uuid": "0dee1012e981e56455bc891486278f91e4374ea9"}, "author": "", "url": "https://www.reuters.com/article/us-canada-wages-ontario/minimum-wage-hike-has-rocky-start-in-canadas-ontario-province-idUSKBN1EX2CN", "ord_in_thread": 0, "title": "Minimum wage hike has rocky start in Canada's Ontario province", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO (Reuters) - A steep minimum wage increase that went into effect on Jan. 1 in Ontario, Canada’s most populous province, has had a rocky start as some employers cut workers’ hours and benefits to reduce its impact on the bottom line.\nOntario raised the minimum wage 21 percent to C$14 ($11.26), making it the highest in Canada.\nThe provincial government, controlled by the Ontario Liberal Party, positioned it as a measure to improve the livelihood of workers in Ontario, home to the nation’s largest city, Toronto, and its capital, Ottawa.\nYet some employers responded by implementing hiring freezes, cutting hours of existing workers, eliminating paid breaks and boosting benefits costs.\nThose companies include franchisees operating Tim Hortons restaurants, an iconic Canadian fast-food chain that sells low-priced coffee, donuts and sandwiches and is owned by Restaurant Brands International Inc ( QSR.TO ).\nSome economists said such measures will reduce the impact of the increase.\nThe Conference Board of Canada, a nonpartisan economic research institute, had initially estimated that the change would shift about C$5 billion into the pockets of workers and away from business profits.\nNow it believes countermeasures implemented by businesses could result in the loss of 42,000 jobs by the end of next year, said Michael Burt, director of the industrial trends group at the Conference Board.\nOntario Premier Kathleen Wynne last week accused the children of Tim Hortons’ founders of bullying their workers after they eliminated paid breaks and other employee benefits at two of the chain’s restaurants that they own. She called them “not decent” and “not fair.”\nBusinesses and franchisee groups responded that the wage increase was onerous for businesses, saying it was implemented to score political points for Ontario’s ruling Liberals, who face provincial elections in June. They want the province to go back to increases tied to the inflation rate.\nThe provincial government has not commented on the allegations or responded to businesses’ concerns about the extent of the increase.\nSome consumers have lashed out at Tim Horton’s on social media, pledging a boycott, though it is unclear that the effort will hurt sales at the chain, which is affectionately known in Canada as “Tim‘s.”\n(Corrects third paragraph to show that provincial government is controlled by the Ontario Liberal Party, not the Liberal Party of Canada)\n($1 = 1.2417 Canadian dollars)\nReporting by Nichola Saminather; Editing by Jim Finkle\n ", "external_links": [], "published": "2018-01-08T23:53:00.000+02:00", "crawled": "2018-01-09T09:35:57.428+02:00", "highlightTitle": ""}