{"organizations": [], "uuid": "1ed27d6ea3a0c2ccfabc3e1c76bb218149eb2a02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226319894&w=1200&r=LYNXMPEE0S12Y", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews\r", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/us-wanda-m-a/chinas-wanda-commercial-gains-boost-from-tencent-led-investors-idINKBN1FI1SO", "country": "US", "domain_rank": 408, "title": "China's Wanda Commercial gets $5.4 billion from Tencent-led investors", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T03:23:00.000+02:00", "replies_count": 0, "uuid": "1ed27d6ea3a0c2ccfabc3e1c76bb218149eb2a02"}, "author": "", "url": "https://in.reuters.com/article/us-wanda-m-a/chinas-wanda-commercial-gains-boost-from-tencent-led-investors-idINKBN1FI1SO", "ord_in_thread": 0, "title": "China's Wanda Commercial gets $5.4 billion from Tencent-led investors", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "sunac china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "wanda commercial", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "tencent holdings", "sentiment": "none"}, {"name": "dalian wanda group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "jd.com inc", "sentiment": "none"}, {"name": "suning commerce group", "sentiment": "none"}, {"name": "wanda group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG (Reuters) - Chinese conglomerate Dalian Wanda Group’s debt-laden commercial property arm will receive a boost from a group of investors, led by technology giant Tencent Holdings, that is set to buy a 14 percent stake in the company for $5.4 billion.\nThe group, including Suning Commerce Group, JD.com Inc and Sunac China, will buy the stake for 34 billion yuan from investors who purchased the interest when the company was delisted from the Hong Kong bourse in 2016.\nThe deal will help Wanda Commercial ease imminent capital pressures and repay old investors in the buyout fund created for the delisting. Those investors had been promised up to 12 percent annual interest if Wanda Commercial failed to relist in Shanghai within two years.\nThe company was delisted when Wanda Group took it private with a $4.4 billion fund, with a view to relist in Shanghai to achieve better share price performance.\nWanda Commercial needs to make a $510 million payment on a syndicated loan by the end of March. It has a further $1 billion to repay by the end of May and has $600 million in offshore notes due in November, ratings agencies have said.\nWanda Group said on Monday that it would receive HK$10.32 billion ($1.3 billion) from the disposal of London, Sydney and Gold Coast developments.\nIn a statement later on Monday evening, Wanda Group said that, after the introduction of the new strategic investors, Wanda Commercial would be renamed Wanda Commercial Management Group and would aim to complete previously earmarked asset sales in the next one to two years.\n“Going forward, it will stop engaging in property development and will transform into a company solely focused on commercial management,” Wanda Group said.\nThe group’s sprawling investments in leisure, financial businesses and entertainment drew the attention of Chinese regulators last year, who ordered lenders to assess their exposure to overseas deals by Wanda and HNA Group, among others.\nRelated Coverage Wanda Hotel shares set to open up 48 percent on Australian projects sale Later in 2017, Wanda sold a portfolio of domestic hotels and tourism assets, including 13 theme parks, for $9 billion to Sunac and Guangzhou R&F Properties. Wanda Commercial operated 235 Wanda Plazas in China as of the end of last year.\nIn a separate statement, retailer Suning said it would contribute 9.5 billion yuan for a 3.91 percent stake in Wanda Commercial. On Tuesday, property developer Sunac said it also planned to utilize 9.5 billion yuan for a 3.91 percent stake.\nReporting by Clare Jim adn Donny Kwok; Editing by David Goodman and Himani Sarkar\n ", "external_links": [], "published": "2018-01-30T03:23:00.000+02:00", "crawled": "2018-01-30T04:00:32.000+02:00", "highlightTitle": ""}