{"organizations": [], "uuid": "77515b500c2129e803363c55481ea6e582a5e657", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-protected-areas-humans/from-hunting-to-hiking-biggest-threats-to-protected-areas-identified-idUSKBN1FB0VG", "country": "US", "domain_rank": 408, "title": "From hunting to hiking: biggest threats to protected areas identified", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-22T16:42:00.000+02:00", "replies_count": 0, "uuid": "77515b500c2129e803363c55481ea6e582a5e657"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-protected-areas-humans/from-hunting-to-hiking-biggest-threats-to-protected-areas-identified-idUSKBN1FB0VG", "ord_in_thread": 0, "title": "From hunting to hiking: biggest threats to protected areas identified", "locations": [], "entities": {"persons": [{"name": "lauren coad", "sentiment": "none"}], "locations": [], "organizations": [{"name": "thomson reuters foundation", "sentiment": "neutral"}, {"name": "kuala lumpur", "sentiment": "neutral"}, {"name": "centre for international forestry research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Thomson Reuters Foundation) - Hunting wild animals for food and recreational sports like hiking and mountain biking pose the two biggest threats to the world’s protected areas, a new study shows.\nTen researchers studied data collected over the last decade by managers at about 2,000 protected areas, including untouched forests and national parks or reserves.\nThey found that hunting posed the biggest threat in developing countries, while recreational activities were most damaging to protected areas in more affluent nations.\nThe hunting of “wild meat”, such as birds, insects, monkeys and snakes occurred in 61 percent of all areas, the new study showed. The animals are often sold to meet demands for food or medicine in urban areas.\n“Recently, the amount of wild animals that are being hunted has increased,” said Lauren Coad, a co-author of the paper and a research associate at the Indonesia-based Centre for International Forestry Research.\n“It’s partly because of an increase in urban demand - big cities and towns are growing and the demand for wildlife to eat is growing,” she told the Thomson Reuters Foundation.\nAnother factor is that road networks are expanding into forest areas, making them more accessible, she added.\nThe findings of the two-year study will be made available to managers at protected areas so they can develop better ways to protect and maintain them.\nCovering about 52 million hectares, 27 percent of the protected areas studied were in Europe, 26 percent in Africa, 25 percent in the Americas and 15 percent in Asia.\nThe threat from over-hunting and commercial hunting was most prevalent in developing countries, where communities in or around protected areas still depend on the forest for their livelihoods, the study showed.\nPotential solutions include regulating hunting and working with local communities to manage and protect their resources from outsiders. Promoting sustainable sources of food, such as poultry, could also reducing demand for wild meat.\nLargely in developed countries, threats from recreational activities occurred in 55 percent of the protected areas, the report also showed. They included quad biking, cross-country skiing, mountain biking, hiking and even dog-walking.\n“These reserves are often victims of their own success - those reserves are so popular that it becomes a problem for the reasons that they were established,” said Neil Burgess, a co-author.\nSolutions include better management of the numbers of people visiting protected areas and their activities, said Burgess, who is chief scientist of the U.N. Environment World Conservation Monitoring Centre.\nReporting by Michael Taylor, Editing by Jared Ferrie; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T16:42:00.000+02:00", "crawled": "2018-01-23T18:14:35.000+02:00", "highlightTitle": ""}