{"organizations": [], "uuid": "dfd6577fbec865820f0a20e66c9898ff1c69de52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-isg-joins-forces-with-iowa-based-struxture-architects.html", "country": "US", "domain_rank": 767, "title": "ISG Joins Forces with Iowa-based StruXture Architects", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-05T01:18:00.000+02:00", "replies_count": 0, "uuid": "dfd6577fbec865820f0a20e66c9898ff1c69de52"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-isg-joins-forces-with-iowa-based-struxture-architects.html", "ord_in_thread": 0, "title": "ISG Joins Forces with Iowa-based StruXture Architects", "locations": [], "entities": {"persons": [{"name": "craig", "sentiment": "none"}, {"name": "craig schwerdtfeger", "sentiment": "none"}], "locations": [{"name": "iowa", "sentiment": "none"}, {"name": "waterloo", "sentiment": "none"}], "organizations": [{"name": "isg", "sentiment": "negative"}, {"name": "struxture architects", "sentiment": "none"}, {"name": "aia", "sentiment": "none"}, {"name": "struxture", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DES MOINES, Iowa, Jan. 4, As of January 2, 2018, ISG has joined forces with the reputable architecture and interior design firm, StruXture Architects (StruXture). Based in Waterloo, Iowa, StruXture's extensive portfolio in the education, government, healthcare, and civic + culture markets will now be complemented and integrated into ISG's multi-disciplinary team that will soon span four states, with clients nationwide.\n\"StruXture's 80+ year legacy has positively evolved over the years with one item remaining a constant – our commitment and focus on clients,\" states Craig Schwerdtfeger, AIA, StruXture Architect + Principal. \"While planning the next chapter in our evolution, we wanted the opportunity to provide greater depth, increased professional opportunities and stability, and the continuation of a synergistic set of values; ISG has proven to be a solid partner to do just that,\" notes Craig.\nThrough the ISG led acquisition, StruXture will offer current clients additional in-house services backed by the same solid architecture, planning, and interior design expertise that will be complemented by design, engineering, environmental, and planning resources under the ISG umbrella. ISG will in turn expand market expertise, adding to the likes of major Midwest and national clients.\n\"As a multi-disciplinary firm with 12 unique markets, we've always admired StruXture's intimate understanding of the markets they serve,\" states Chad Surprenant, PE, ISG President | CEO. \"StruXture is a highly respected firm and this opportunity will not only allow their clients to have expanded services offerings under one roof, but provide ISG additional expertise that that will build upon our soon to be 45 years of industry experience. It really comes down to sustainability and providing our combined clients more horsepower and expertise,\" Chad affirms.\nStruXture will continue to provide custom solutions with the noted adding backing brought forth by ISG. Formal ribbon cutting and cobranded efforts will occur over the next several months, in addition to immediately adding talent in both the Waterloo and neighboring ISG Des Moines office, as well as the ISG office in Storm Lake, Iowa.\n\"Our emphasis is really on our people and clients,\" notes Jane Miller, IIDA, LEED AP ID+C, StruXture Principal + Interior Designer. \"The progression of this partnership has been so positive and natural as we both share the same core values and focal points. We are really excited to expand our support opportunities. Great things are in store for 2018 and beyond,\" notes Jane.\nAbout ISG\nISG, a 100% ESOP firm, has a rich history, which extends over 40 years, of building trusting relationships with clients, stakeholders, and the community. As a full service architecture, engineering, environmental, and planning firm with 260+ professionals in offices throughout Iowa, Minnesota, Wisconsin, and soon to be South Dakota, ISG provides exceptional services, strategies, and guidance to a wide range of markets nationwide. ISG fosters strong collaboration between all firm disciplines providing clients a diverse knowledge base, high level of creativity, and broad perspective. ISG was named among the 100 fastest growing firms and best places to work for in the United States by Zweig Group, recognized as a Top 500 Design Firm by Engineering News-Record (ENR) magazine, and named to the coveted PSMJ 2017 Circle of Excellence. To learn more about ISG, visit www.is-grp.com .\nISG Media Contact:\nTiffany Olson\nDirector of Marketing\nP: 952.426.0699\nE: tiffany.olson@is-grp.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/isg-joins-forces-with-iowa-based-struxture-architects-300577951.html\nSOURCE ISG", "external_links": ["https://www.is-grp.com/", "http://www.prnewswire.com/news-releases/isg-joins-forces-with-iowa-based-struxture-architects-300577951.html", "http://www.struxture.com/", "http://www.is-grp.com/"], "published": "2018-01-05T01:18:00.000+02:00", "crawled": "2018-01-05T01:22:57.013+02:00", "highlightTitle": ""}