{"organizations": [], "uuid": "a4a70dbfab6c7f19989ae37df33816f690bec840", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-liingo-eyewear-acquired-by-1-800-contacts.html", "country": "US", "domain_rank": 767, "title": "Liingo Eyewear Acquired by 1-800 Contacts", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-30T23:30:00.000+02:00", "replies_count": 0, "uuid": "a4a70dbfab6c7f19989ae37df33816f690bec840"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-liingo-eyewear-acquired-by-1-800-contacts.html", "ord_in_thread": 0, "title": "Liingo Eyewear Acquired by 1-800 Contacts", "locations": [], "entities": {"persons": [{"name": "draper", "sentiment": "negative"}, {"name": "liingo", "sentiment": "none"}, {"name": "john graham", "sentiment": "none"}, {"name": "harris", "sentiment": "none"}, {"name": "douglas harris", "sentiment": "none"}], "locations": [{"name": "utah", "sentiment": "none"}], "organizations": [{"name": "liingo eyewear", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DRAPER, Utah, Jan. 30, 2018 /PRNewswire/ -- Liingo Eyewear is changing the conversation in the outdated eyewear market and getting recognized by industry players, most recently 1-800 Contacts. Liingo's promising start inspired the acquisition by 1-800 Contacts at the end of 2017. This addition will mean an increase in customers for both brands.\n1-800 Contacts can now provide consumers with another simple and convenient way to fulfill their vision needs. Liingo is an online eyewear brand that offers a free in-home try on program and free prescription lenses with every pair. John Graham, CEO of 1-800 Contacts, said, \"Liingo's unique offering makes it a natural fit for our company. This partnership will only make both brands stronger in our quest to make purchasing eyewear simple and affordable.\"\n\"We are excited to take this next step with 1-800 Contacts,\" said Douglas Harris, CEO of Liingo Eyewear. Harris is no stranger to the eyewear business, with over 16 years in the industry. \"We couldn't think of a better business to be a part of than 1-800 Contacts as we drive our mission to enable people to express themselves through eyewear.\"\nWith 96 percent of eyewear being sold via brick and mortar stores, Liingo makes it easier than ever to buy online. With their one-of-a-kind in-home try on, Liingo allows customers to try glasses with prescription lenses for free. This program eliminates the risk from the buying process and gives customers ample time to determine which styles work best for them. Liingo offers distinctive, fashionable glasses made of premium, high-quality materials and free prescription lenses rather than costly licensed brands. Glasses range from $79 to $129, making it more affordable for customers to buy multiple pairs to match their every mood and occasion.\nLearn more about Liingo Eyewear and browse their selection of styles at www.liingoeyewear.com .\nABOUT LIINGO EYEWEAR\nLiingo Eyewear was founded in October of 2016, in Draper, Utah. Liingo believes that eyewear is a form of self-expression, and that everyone should own more than a single pair. This belief drives their affordable prices, trendy styles, and free prescription lenses included with every pair.\nABOUT 1-800 CONTACTS\n1-800 Contacts , Inc. is the largest retailer of contact lenses in the United States, and is dedicated to making it easier for consumers to purchase contact lenses. 1-800 Contacts offers all of the most popular brands of contact lenses at competitive prices while delivering exceptional customer service. The company has served more than 12 million customers, stocks more than 15 million contact lenses, and delivers more than 200,000 contact lenses every day directly to customers. Through its award-winning website, www.1800contacts.com , its industry leading mobile applications and its easy-to-remember, toll-free telephone number \"1-800 Contacts\" (1-800-266-8228), the company ships an industry leading 98 percent of its orders within one business day of receipt and verification of prescriptions.\nContact:\nEmily O'Brien\n1-646-8633937\neobrien@michelemariepr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/liingo-eyewear-acquired-by-1-800-contacts-300590527.html\nSOURCE Liingo Eyewear", "external_links": ["http://www.liingoeyewear.com/", "http://www.prnewswire.com/news-releases/liingo-eyewear-acquired-by-1-800-contacts-300590527.html", "http://www.1800contacts.com/"], "published": "2018-01-30T23:30:00.000+02:00", "crawled": "2018-01-31T00:39:34.031+02:00", "highlightTitle": ""}