{"organizations": [], "uuid": "793fc726b2a21f70c51e0e080866b6a23966ff0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/05/29/101714262-167750511.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/05/benchmark-is-selling-900-million-of-its-holdings-in-uber.html", "country": "US", "domain_rank": 767, "title": "Benchmark is selling $900 million of its holdings in Uber", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T20:34:00.000+02:00", "replies_count": 0, "uuid": "793fc726b2a21f70c51e0e080866b6a23966ff0c"}, "author": "Theodore Schleifer", "url": "https://www.cnbc.com/2018/01/05/benchmark-is-selling-900-million-of-its-holdings-in-uber.html", "ord_in_thread": 0, "title": "Benchmark is selling $900 million of its holdings in Uber", "locations": [], "entities": {"persons": [{"name": "spotify", "sentiment": "none"}, {"name": "travis kalanick", "sentiment": "none"}], "locations": [], "organizations": [{"name": "uber benchmark capital", "sentiment": "negative"}, {"name": "softbank", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Benchmark Capital will end up selling about $900 million of its Uber stock to SoftBank and other buyers, or about 14.5% of the venture capital firm's holdings in the company.\nBenchmark, which said last year that Uber could soon be worth more than $100 billion, tried to sell about 25 percent of its shares in the company last month at a price that was less than half that.\nBut because so many shareholders wanted to sell their position in Uber, Benchmark was able to sell only 58 percent of what it sought to tender — or about 14.5 percent of its holdings, according to people familiar with the transaction.\nMore from Recode:\nSpotify's chief content officer is leaving ahead of its IPO\nShould I rent a hotel room by the minute? (And for what?)\nTravis Kalanick is now a real-life billionaire\nUber stock was being sold at a significant discount that valued the company at $48 billion. At that pricing, Benchmark would receive about $900 million in cash in return for their 14.5 percent sale. Benchmark owned about 13 percent of the company.\nBenchmark led the company's Series A financing round in 2011 and the company has made the firm a tremendous amount of money — even though relations have soured between Benchmark and the company's first CEO, Travis Kalanick. Benchmark's decision to sell some of their earnings will weaken its power in company decision-making, but also locks in some of their winnings ahead of an uncertain IPO in 2019.\nBut it also could look foolish if Uber's growth keeps exploding and Benchmark left money on the table. The venture capital firm said in August that its analysis \"shows Uber could comfortably be worth over $100B in just two years.\"\nKalanick himself also tucked away some of his earnings. The Uber founder sold about $1.4 billion in the tender offer, despite previously signaling that he wouldn't sell any of his stock.\nOther large sellers to the SoftBank-led group include Kalanick's co-founder Garrett Camp and Menlo Ventures, which led Uber's Series B round.\nBenchmark declined to comment.\n— By Theodore Schleifer, Recode.net .\nCNBC's parent NBCUniversal is an investor in Recode's parent Vox, and the companies have a content-sharing arrangement.", "external_links": [], "published": "2018-01-05T20:34:00.000+02:00", "crawled": "2018-01-05T20:51:46.010+02:00", "highlightTitle": ""}