{"organizations": [], "uuid": "a65175c5d1c81cfb5f490a46949aa6240ae1a385", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/environment/", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-china-environment-forest/china-to-create-new-forests-covering-area-size-of-ireland-china-daily-idUSKBN1EU02L", "country": "US", "domain_rank": 408, "title": "China to create new forests covering area size of Ireland - China Daily", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T02:39:00.000+02:00", "replies_count": 0, "uuid": "a65175c5d1c81cfb5f490a46949aa6240ae1a385"}, "author": "", "url": "https://www.reuters.com/article/us-china-environment-forest/china-to-create-new-forests-covering-area-size-of-ireland-china-daily-idUSKBN1EU02L", "ord_in_thread": 0, "title": "China to create new forests covering area size of Ireland - China Daily", "locations": [], "entities": {"persons": [{"name": "zhang jianlong", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}], "organizations": [{"name": "state forestry administration", "sentiment": "none"}, {"name": "china daily reuters staff", "sentiment": "none"}, {"name": "china daily", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 12:44 AM / in 5 hours China to create new forests covering area size of Ireland: China Daily Reuters Staff 2 Min Read \nSHANGHAI (Reuters) - China will plant new forests covering an area roughly the size of Ireland this year as it aims to increase forest coverage to 23 percent of its total landmass by the end of the decade, China Daily reported on Friday. \nPlanting trees has become a key part of China’s efforts to improve its environment and tackle climate change, and the government has pledged to raise total coverage from 21.7 percent to 23 percent over the 2016-2020 period, said the China Daily, citing the country’s top forestry official. \nZhang Jianlong, head of the State Forestry Administration, said at a meeting on Thursday that China would aim to grow at least 6.66 million hectares of new forest this year. \nHe said 33.8 million hectares of forest had been planted nationwide over the last five years, with a total investment of more than 538 billion yuan ($82.88 billion), bringing the country’s total forest area to 208 million hectares. \nThree new state forests with a total area of 483,000 hectares would also be built in the new Xiongan development zone in Hebei province, he said. \nThe heavily polluted Hebei, which surrounds the capital Beijing, has also pledged to raise total forest coverage to 35 percent by the end of 2020. \nChina, which has to feed a quarter of the global population using just 7 percent of the world’s arable land, has long struggled to strike a balance between industrial growth, maximizing food production and protecting its environment. \nThe government is currently promoting an “ecological red line” program which will force provinces and regions to restrict “irrational development” and curb construction near rivers, forests and national parks. \nThe environment ministry said last month that 15 provinces had already drawn up plans, with the remaining 16 aiming to do so this year, but it is not yet clear what impact the policy will have on the country’s farmland. \n($1 = 6.4915 yuan)", "external_links": [], "published": "2018-01-05T02:39:00.000+02:00", "crawled": "2018-01-05T02:59:46.017+02:00", "highlightTitle": ""}