{"organizations": [], "uuid": "dc90c66aa0c38ddecc21681f309aa1db3afad951", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-agency-executive-shaun-urban-joins-inception-companies-as-president.html", "country": "US", "domain_rank": 767, "title": "Agency Executive Shaun Urban Joins Inception Companies as President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T18:00:00.000+02:00", "replies_count": 0, "uuid": "dc90c66aa0c38ddecc21681f309aa1db3afad951"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-agency-executive-shaun-urban-joins-inception-companies-as-president.html", "ord_in_thread": 0, "title": "Agency Executive Shaun Urban Joins Inception Companies as President", "locations": [], "entities": {"persons": [{"name": "shaun urban", "sentiment": "negative"}, {"name": "shaun", "sentiment": "none"}, {"name": "matt giegerich", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "fairfield", "sentiment": "none"}], "organizations": [{"name": "agency executive shaun urban joins inception companies", "sentiment": "negative"}, {"name": "ogilvy commonhealth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FAIRFIELD, N.J., Jan. 31, 2018 /PRNewswire/ -- The Inception Companies announce that Shaun Urban, former Managing Partner of Ogilvy CommonHealth, has joined the organization as President. Reporting to CEO Matt Giegerich, Shaun will be leading new business development as well as the supporting infrastructure which includes client services, project management, production services, and operations. As a senior member of the executive leadership team, Shaun will also be intrinsically involved in new product development and evolving the organization's operating model to prepare for expansive growth.\nBeginning his career at large pharmaceutical companies, Shaun transitioned to the agency side thirteen years ago. He started the payer marketing capability within Ogilvy CommonHealth and grew it into one of the most sophisticated market access agencies in the industry through investment in innovation, diversification of services, and targeted acquisitions. Promoted five years ago to Managing Partner, Shaun assumed leadership of the medical education/medical affairs business and spearheaded unparalleled growth of over 80%, earning the distinction as the fastest growing area of Ogilvy CommonHealth. He also built the agency's new business capability, improving the new business pitch conversion rate by 72% and delivering an average of $31M in annual revenue.\n\"Shaun's vision and passion, combined with his incomparable commitment to excellence, helped catapult the growth of the agency divisions he led,\" commented Inception Companies CEO Matt Giegerich. \"It is Shaun's unique understanding of his clients' present and future challenges that have enabled him to implement winning strategies to address them. He has an extensive network of agency and pharma relationships built on shared trust and partnership and has earned the respect of the employees he managed. We are excited to have him join the Inception Companies team.\"\n\"I have always been intrigued by innovation and finding new, better ways to meet the needs of clients. And I have been impressed for years by the unparalleled quality of Inception's virtual meeting solutions and live broadcasts, as well as the unique storytelling capabilities of their video productions,\" Shaun added. \"However, what really captured my interest was their vision for the future of global communication. We have a new product in development that will truly change the way organizations engage virtually with both customers and employees alike, allowing them to save millions of dollars previously spent on live meetings and events, market research and training. This new product will also address some of the challenges our pharmaceutical clients have with accessing hard-to-reach Key Opinion Leaders. I am looking forward to the future and continuing to bring new products to market that will make it easier and more efficient to work together, no matter where we live in the world.\"\nAbout Inception Companies\nInception is a leading provider of video production, interactive visual solutions, broadcast and webcast platforms for virtual meetings, and audio/visual support. Comprised of Inception Digital, Kampfire, and Inception Visual, the company delivers state-of-the-art TV-style technology to clients in the healthcare, financial services and technology sectors. Independently held, Inception Companies are headquartered in Fairfield NJ, with additional offices in New York NY, Blue Bell PA and San Francisco CA.\nFor more information, visit www.inceptioncompanies.com\nMatt Giegerich\nCEO Inception Companies\nSculptaHealth/Ellynn Szoke\n973-840-1800\neszoke@sculptahealth.com\nThis release was issued through WebWire®. For more information, visit http://www.webwire.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/agency-executive-shaun-urban-joins-inception-companies-as-president-300590981.html\nSOURCE Inception Companies", "external_links": ["http://www.inceptioncompanies.com/", "http://www.prnewswire.com/news-releases/agency-executive-shaun-urban-joins-inception-companies-as-president-300590981.html", "http://www.webwire.com/"], "published": "2018-01-31T18:00:00.000+02:00", "crawled": "2018-01-31T18:37:31.001+02:00", "highlightTitle": ""}