{"organizations": [], "uuid": "e8cf55f0d36d1636d4aa4d144448f74789d3c4d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218783340&w=1200&r=LYNXMPEE010CZ", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-pharmaceuticals-approvals/new-drug-approvals-hit-21-year-high-in-2017-idUKKBN1ER0PI", "country": "US", "domain_rank": 408, "title": "New drug approvals hit 21-year high in 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T12:52:00.000+02:00", "replies_count": 0, "uuid": "e8cf55f0d36d1636d4aa4d144448f74789d3c4d5"}, "author": "", "url": "https://uk.reuters.com/article/uk-pharmaceuticals-approvals/new-drug-approvals-hit-21-year-high-in-2017-idUKKBN1ER0PI", "ord_in_thread": 0, "title": "New drug approvals hit 21-year high in 2017", "locations": [], "entities": {"persons": [{"name": "ben h", "sentiment": "negative"}, {"name": "scott gottlieb", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 10:45 AM / Updated 31 minutes ago New drug approvals hit 21-year high in 2017 Ben Hirschler 4 Min Read \nLONDON (Reuters) - U.S. drug approvals hit a 21-year high in 2017, with 46 novel medicines winning a green light -- more than double the previous year -- while the figure also rose in the European Union. \nThe EU recommended 92 new drugs including generics, up from 81, and China laid out plans to speed up approvals in what is now the world’s second biggest market behind the United States. \nYet the world’s biggest drugmakers saw average returns on their research and development spending fall, reflecting more competitive pressures and the growing share of new products now coming from younger biotech companies. \nConsultancy Deloitte said last month that projected returns at 12 of the world’s top drugmakers were at an eight-year low of only 3.2 percent. \nMany of the drugs receiving a green light in 2017 were for rare diseases and sub-types of cancer, which often target very small populations, although they can cost hundreds of thousands of dollars. ( tmsnrt.rs/2hGom21 ) \nSignificantly, the U.S. drug tally of 46 does not include the first of a new wave of cell and gene therapies from Novartis ( NOVN.S ), Gilead Sciences ( GILD.O ) and Spark Therapeutics ( ONCE.O ) that were approved in 2017 under a separate category. \nU.S. Food and Drug Administration (FDA) Commissioner Scott Gottlieb has hailed these products as “a whole new scientific paradigm for the treatment of serious diseases”. However, there is debate as to how cash-strapped healthcare systems will pay for them. Slideshow (3 Images) \nUnder Gottlieb, the FDA has taken advantage of policy changes implemented in recent years to accelerate the drug approval process. \nProcedures such as the agency’s “breakthrough therapy” designation have cut review times and helped to stimulate competition by adding multiple new drugs that often work in a similar way. \nA wide choice of medicines with the same mechanism of action can be a double-edged sword for manufacturers, since it gives insurers and governments ammunition to drive down prices. \nPfizer ( PFE.N ) and Merck’s ( MRK.N ) new diabetes drug Steglatro, for example, was the fourth product of its kind to win a green light in the United States, while Novo Nordisk’s ( NOVOb.CO ) Ozempic was the sixth of its type. Both were approved in December. \nIn cancer, AstraZeneca’s ( AZN.L ) Imfinzi was the fifth medicine to target a key protein found on the body’s immune cells when it won approval last May. \nFor the current year, companies have more new products waiting in the wings, although the pace of FDA approvals may be tempered by the fact that several drugs that had been expected to be cleared in the first quarter of 2018 were actually approved in 2017. \nIn Europe, meanwhile, the focus will be on any disruption or delays to the approval process as the European Medicines Agency prepares to relocate from London to Amsterdam as a result of Britain’s decision to leave the European Union. Reporting by Ben Hirschler; Editing by Keith Weir", "external_links": [], "published": "2018-01-02T12:52:00.000+02:00", "crawled": "2018-01-02T13:10:22.001+02:00", "highlightTitle": ""}