{"organizations": [], "uuid": "8972f42314bb2417e7c90653c3d5e0389129e5aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-ecb-policy-euro/ecbs-draghi-on-back-foot-as-euro-makes-new-highs-idUSKBN1FE2FY", "country": "US", "domain_rank": 408, "title": "ECB's Draghi on back foot as euro makes new highs", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-26T00:41:00.000+02:00", "replies_count": 0, "uuid": "8972f42314bb2417e7c90653c3d5e0389129e5aa"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-ecb-policy-euro/ecbs-draghi-on-back-foot-as-euro-makes-new-highs-idUSKBN1FE2FY", "ord_in_thread": 0, "title": "ECB's Draghi on back foot as euro makes new highs", "locations": [], "entities": {"persons": [{"name": "draghi", "sentiment": "negative"}, {"name": "mario draghi", "sentiment": "none"}, {"name": "steve mnuchin", "sentiment": "none"}, {"name": "ranko berich", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT (Reuters) - Once famed for his ability to steer financial markets, European Central Bank’s President Mario Draghi failed on Thursday to tame a sharp rally in the euro that threatens to blunt the impact of years of monetary stimulus.\nThe single currency rallied to a fresh three-year high of $1.2536 as Draghi delivered an upbeat assessment of the euro zone economy and refrained from retaliating against comments by top U.S. government officials welcoming a weaker dollar.\nBy making imports cheaper and exports dearer, a stronger euro jeopardizes a timid recovery in euro zone inflation just as the ECB prepares to phase out its 2.55 trillion euro money-printing program later in the year.\nWithout mentioning him, Draghi took a swipe at U.S. Treasury Secretary Steve Mnuchin for comments that he said contradicted an international agreement against currency wars. But the ECB chief failed to convince traders that he would fight back.\n“The ‘Draghi Effect’ now appears to be well and truly a thing of the past, and ... perhaps the ‘Mnuchin Effect’ is more relevant,” Ranko Berich, an analyst at foreign exchange company Monex Europe, said.\nDraghi has been credited with single-handedly ending rampant market speculation about a break-up of the euro zone in July 2012 by pledging to do “whatever it takes” to save the euro. Investors took this as a statement of the ECB’s willingness to buy the sovereign debt of countries that had come under market pressure to lower their borrowing costs.\nLast year, comments by Draghi at an ECB seminar in Sintra, Portugal, triggered a rally in the single currency, forcing rate-setters into a heavy rearguard action in the following days, both publicly and behind the scenes.\nKnown since then to monitor every move in the euro at key junctures, Draghi appeared to step up his rhetoric half-way through the news conference following Thursday’s policy meeting, as the single currency broke above $1.25.\n“If all this were to lead to an unwanted tightening of our monetary policy which is not warranted then we will have to just think about our monetary policy strategy,” Draghi said.\nHe also effectively ruled out a rate hike this year.\nThat has been the subject of heavy market speculation since minutes of the ECB’s last meeting unexpectedly showed rate-setters were considering taking early steps towards the end of stimulus, which led some investors to bring forward their expectations for the first rate increase to December 2018.\nDraghi defended the ECB from suggestions it sent different messages at the December press conference and in the accounts of that same meeting, saying he and his colleagues had simply agreed to start discussing changes in the policy message early this year.\nBut his verbal gymnastics failed to rein in the euro for very long, leaving it trading at 2.488 at 1606 GMT.\n“The ECB must have had the intention to dampen the recent euro appreciation,” Carsten Brzeski, an economist at ING, said. “Judging from the imminent market reaction, the ECB will not be satisfied.”\nReporting by Francesco Canepa; Editing by Catherine Evans\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T00:41:00.000+02:00", "crawled": "2018-01-26T21:39:17.003+02:00", "highlightTitle": ""}