{"organizations": [], "uuid": "e302ed8cdb7120901705141076ec77cfe6a5429f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-investment-management-veteran-joins-northern-trust-asset-management-to-lead-funds-and-managed-accounts.html", "country": "US", "domain_rank": 767, "title": "Investment Management Veteran Joins Northern Trust Asset Management to Lead Funds and Managed Accounts", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.061, "site_type": "news", "published": "2018-01-19T21:21:00.000+02:00", "replies_count": 0, "uuid": "e302ed8cdb7120901705141076ec77cfe6a5429f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-investment-management-veteran-joins-northern-trust-asset-management-to-lead-funds-and-managed-accounts.html", "ord_in_thread": 0, "title": "Investment Management Veteran Joins Northern Trust Asset Management to Lead Funds and Managed Accounts", "locations": [], "entities": {"persons": [{"name": "darek wojnar", "sentiment": "negative"}, {"name": "thomas", "sentiment": "none"}, {"name": "darek", "sentiment": "none"}, {"name": "shundrawn thomas", "sentiment": "none"}, {"name": "wojnar", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "northern trust asset management", "sentiment": "negative"}, {"name": "investment management veteran joins northern trust asset management", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO--(BUSINESS WIRE)-- Northern Trust Asset Management has named Darek Wojnar, CFA, a 23-year investment industry veteran, as head of funds and managed accounts.\nWojnar will oversee the development, distribution and management of the firm’s Northern mutual funds, FlexShares exchange-traded funds (ETFs), and managed accounts. He will be based in Chicago, reporting to Shundrawn Thomas, president of Northern Trust Asset Management, whom he succeeds in this role.\nNorthern Trust Asset Management has $192.3 billion in assets under management across its funds and managed accounts business in single-, multi-asset and outcome-based strategies, as of September 30, 2017. Its $15 billion FlexShares ETF family is one of the fastest growing sponsors in the ETF industry.\n“Darek is a perfect fit for us, as he has demonstrated strong leadership throughout his career at highly respected fund leaders,” said Thomas. “He’s established a formidable track record of building and strengthening products for investors. And he’s done so while employing an analytical, principled approach to portfolio construction and product innovation. We look forward to working with him to ensure the Northern Trust Asset Management brand remains synonymous with innovativeness, thus keeping us well-positioned to meet professional and individual investors’ evolving needs.”\nWojnar most recently served as the head of ETFs at Hartford Funds. Previously, he was the managing director and head of single asset strategies at Lattice Strategies LLC, which was acquired by Hartford Funds. Prior to joining Lattice Strategies in 2014, Wojnar held various senior positions in the ETF industry, including head of the U.S. iShares product roster at BlackRock and head of ETF product development at UBS Global Asset Management.\n“The pace of change in our industry is accelerating and requires asset management firms to have sound direction and vision from the top,” Thomas added. “Northern Trust Asset Management is recognized for being a pioneer, as evidenced by its 20-plus year history in factor investing. We are equally respected for understanding what will resonate with advisors and investors. This is evident in our current offerings, such as our FlexShares roster of 25 ETFs, all of which are focused on meeting investment goals, rather than filling investment style boxes.”\n“I am delighted to join Northern Trust Asset Management at such an exciting time in the industry,” Wojnar said. “Investors, and the professionals who advise them, are more selective than ever. They’re looking for firms that are truly committed to and have a reputation for putting the interests of clients first. And they’re absolutely focused on achieving better outcomes as they demand a thoughtful, nuanced investment approach. This is exactly the reputation that Northern Trust Asset Management has earned in serving the world’s most sophisticated institutional and individual investors for decades.”\nAbout Northern Trust Asset Management\nNorthern Trust Asset Management is a leading global asset management firm serving institutional and individual investors in 29 countries. Our robust investment capabilities span all markets and asset classes, from passive and risk-factor to fundamental active, multi-asset class and multi-manager strategies, delivered in multiple vehicles. As of September 30, 2017, Northern Trust has $1.1 trillion in total assets under management. For more information, please visit our website or follow us on Twitter @NTInvest .\nNorthern Trust Asset Management comprises Northern Trust Investments, Inc., Northern Trust Global Investments Limited, Northern Trust Global Investments Japan, K.K., NT Global Advisors, Inc. and investment personnel of The Northern Trust Company of Hong Kong Limited and The Northern Trust Company.\nAbout Northern Trust\nNorthern Trust Corporation (Nasdaq: NTRS) is a leading provider of wealth management, asset servicing, asset management and banking to corporations, institutions, affluent families and individuals. Founded in Chicago in 1889, Northern Trust has offices in the United States in 19 states and Washington, D.C., and 23 international locations in Canada, Europe, the Middle East and the Asia-Pacific region. As of September 30, 2017, Northern Trust had assets under custody/administration of US$9.7 trillion, and assets under management of US$1.1 trillion. For more than 125 years, Northern Trust has earned distinction as an industry leader for exceptional service, financial expertise, integrity and innovation. Visit northerntrust.com or follow us on Twitter @NorthernTrust .\nNorthern Trust Corporation, Head Office: 50 South La Salle Street, Chicago, Illinois 60603 U.S.A., incorporated with limited liability in the U.S. Global legal and regulatory information can be found at https://www.northerntrust.com/disclosures .\nBefore investing, carefully consider the FlexShares investment objectives, risks, charges and expenses. This and other information is in the prospectus and a summary prospectus, copies of which may be obtained by visiting www.flexshares.com . Read the prospectus carefully before you invest. Foreside Fund Services, LLC, distributor.\nAll investments involve risk, including possible loss of principal.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005621/en/\nNorthern Trust Corporation\nMedia Contact:\nTom Pinto\n212-339-7288\nTom_Pinto@ntrs.com\nhttp://www.northerntrust.com\nSource: Northern Trust Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.northerntrust.com%2Fdisclosures&esheet=51746133&newsitemid=20180119005621&lan=en-US&anchor=https%3A%2F%2Fwww.northerntrust.com%2Fdisclosures&index=6&md5=2fdb1550ad9ec1e974545037359c7171", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.northerntrust.com%2Fasset-management%2Funited-states&esheet=51746133&newsitemid=20180119005621&lan=en-US&anchor=website&index=2&md5=60e738f1aaf632d57bfbd9c42eb126bc", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.flexshares.com&esheet=51746133&newsitemid=20180119005621&lan=en-US&anchor=www.flexshares.com&index=7&md5=2a11747c74bbbac193cec9e7ab016b76", "https://www.northerntrust.com/disclosures", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.northerntrust.com&esheet=51746133&lan=en-US&anchor=http%3A%2F%2Fwww.northerntrust.com&index=8&md5=f60ca812ab406e8594082d4ac97dc221", "http://www.businesswire.com/news/home/20180119005621/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FNorthernTrust&esheet=51746133&newsitemid=20180119005621&lan=en-US&anchor=%40NorthernTrust&index=5&md5=72fb69086fd7ca71369ee1dc94a9a394", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fntinvest&esheet=51746133&newsitemid=20180119005621&lan=en-US&anchor=%40NTInvest&index=3&md5=b2bf962a6d2dc837b4386741c047002d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.northerntrust.com%2F&esheet=51746133&newsitemid=20180119005621&lan=en-US&anchor=northerntrust.com&index=4&md5=805bd3197d39c79b1f9f2a1d4da2c4d8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.northerntrust.com%2Fasset-management%2Funited-states%2Fservices%2Frankings-highlights%3Fcmpid%3DPress%2520Release-pressrelease-DC_01252016_EE-amus&esheet=51746133&newsitemid=20180119005621&lan=en-US&anchor=global&index=1&md5=933ba627573cd6d5de51abb9d04ea7eb"], "published": "2018-01-19T21:21:00.000+02:00", "crawled": "2018-01-19T22:40:36.023+02:00", "highlightTitle": ""}