{"organizations": [], "uuid": "906869e67a68e10533fd752cd5b538e770184349", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226634719&w=1200&r=LYNXMPEE0T12E", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-markets-trade-analysis/world-markets-can-absorb-some-trade-turbulence-as-trump-digs-in-idUKKBN1FJ22O", "country": "US", "domain_rank": 408, "title": "World markets can absorb some trade turbulence as Trump digs in", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:06:00.000+02:00", "replies_count": 0, "uuid": "906869e67a68e10533fd752cd5b538e770184349"}, "author": "", "url": "https://uk.reuters.com/article/us-markets-trade-analysis/world-markets-can-absorb-some-trade-turbulence-as-trump-digs-in-idUKKBN1FJ22O", "ord_in_thread": 0, "title": "World markets can absorb some trade turbulence as Trump digs in", "locations": [], "entities": {"persons": [{"name": "rao", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "tom miles", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "suja", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "min read  london/geneva", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 3:05 PM / Updated 19 minutes ago World markets can absorb some trade turbulence as Trump digs in Sujata Rao , Tom Miles 7 Min Read \nLONDON/GENEVA (Reuters) - Booming global trade and economic growth have cushioned world markets against the political turbulence of Donald Trump’s first year in the White House, but that resilience will be tested if the U.S. president wants protectionism to define 2018. \nWith stocks on one of their longest bull runs in history, they are particularly vulnerable to upsets, although the global economy’s strength means they could probably absorb greater trade conflict - provided governments keep it all within limits. \nEmboldened after finally pushing his signature tax cut reforms through Congress, Trump seems likely to train his sights on trade - another pillar of his election pledge to “Make America Great Again” - by fixing its deficit and punishing countries deemed to be profiting at U.S. expense. \nHis administration is beating the trade drum ever louder. This month it has announced steep U.S. tariffs on imported washing machines and solar cells, Commerce Secretary Wilbur Ross has warned China over intellectual property practices and Treasury Secretary Steve Mnuchin has endorsed a weaker dollar to help American exports. \nDiscussing trade wars at the World Economic Forum in Davos, Ross said: “U.S. troops are now coming to the ramparts.” \nThat warning provoked only a short-lived wobble in world stocks, with investors reluctant to bail out of a market still clocking record highs at an accelerating pace even after adding $9 trillion in value last year. \nMuch of that bullishness is down to a sustained rebound in trade in recent years, with volumes growing at a faster pace than world gross domestic product. \nDespite Trump’s protectionist rhetoric of the past year and actions such as pulling the United States out of the TPP trade pact for Pacific rim countries, indicators show no let up. \nGlobal trade is expanding at annualized rates of more than 4 percent, the strongest performance since 2011, according to the Netherlands Bureau of Economic Policy Analysis. Freight volumes are surging at the fastest pace this decade. \n(To view a graphic on freight volumes, click tmsnrt.rs/2DB9aLY ) \nMerchandise trade is likely to have expanded 3.6 percent in 2017 in volume terms, rebounding from the post-crisis low of 1.3 percent growth in 2016, the World Trade Organization reckons. Overall, the IMF forecasts global GDP will expand 3.9 percent this year. \nBut investors fear a shift from rhetoric to action may still hurt markets even if the robust growth acts as a shock absorber. \n“Protectionism means lower growth and higher inflation. That’s the worst possible combination you can have when markets are at record highs,” said Luca Paolini, chief strategist at Pictet Asset Management. \nHowever, the world economy’s strength and double-digit company earnings allow markets to “absorb a lot”, Paolini said. \nHe cited short-lived reactions to Britain’s impending exit from the European Union, political upsets elsewhere on the continent such as Catalonia’s failed referendum on independence from Spain and North Korea’s nuclear weapons program as examples of how much flak the market was able to take. \nProtectionism is neither new nor a U.S. monopoly. Since 2008, the 60 top world economies have adopted over 7,000 protectionist trade measures in net terms, international law firm Gowling WLG reported last November. And yet these have failed to scupper the bull market in equities. \nAmong the upcoming flashpoints are talks with Mexico and Canada on Trump’s demand that the North American Free Trade Agreement (NAFTA) be renegotiated. FILE PHOTO: U.S. President Donald Trump, flanked by U.S. Trade Representative Robert Lighthizer, holds up a directive to impose tariffs on imported washing machines after signing it in the Oval Office at the White House in Washington, U.S. January 23, 2018. REUTERS/Jonathan Ernst/File Photo \nHis State of the Union speech later on Tuesday could also detail steps against China’s tech sector. A U.S. Treasury report on trade partners’ currency practices, plus decisions on steel and aluminum import restrictions, are due in April. \n“(A trade shock) is something you have to keep in mind, given how stretched markets are but there has to be a credible decision, not just a threat,” Paolini said. \n(To view a graphic on U.S. trade deficits, click reut.rs/2ErkMTf ) \nWHAT‘S THE DAMAGE? \nMost expect forthcoming curbs, and the fallout, to be limited. Trade wars have had little direct impact on equity markets in the past, JPMorgan analysts wrote, citing a dispute between Washington and Tokyo in 1993-95 over Japanese car exports to the United States as an example. \nTrump could double or triple the number of trade penalties “without harming risky markets more than intra-week”, they said, adding that they had made no portfolio changes to account for additional trade risks. \nEven 100 percent tariffs on steel and aluminum would dent Chinese exports by just 0.3 percentage points, while semi-conductor and telecommunications import curbs may lower exports by 0.8 percentage points, Morgan Stanley said. \nGiven multinational firms’ reliance on complex cross-border supply chains, Wall Street would undoubtedly suffer but other markets may be hurt more. \nThe United States, relying on trade for 28 percent of its economic output, has less to lose than Mexico, with a trade-to-GDP ratio of 78 percent or Germany with 84 percent. China’s ratio is 34 percent, World Bank data shows. \nAs a result, any U.S. pullout from NAFTA would cut 2019 GDP by half a percent in the United States, while reducing Mexico’s by almost 1 percent, Oxford Economics predicts, adding that Mexico’s economy could be 2 percent smaller by 2022. \nHowever, it is Asia that accounts for three-quarters of the U.S. goods trade deficit - led by China, South Korea and Japan -and over a third of global exports. The annual deficit with China at $370 billion is the biggest, implying that this is where Trump and Ross have set their sights. \nSome analysts argue that the United States would also lose if trade partners retaliated by cutting purchases of American goods or halting supplies of components to U.S. firms, perhaps along the lines of the China’s decision in 2010 to ban exports of rare earth metals to Japanese electronics makers. \nAnother threat lies in the quest for a weaker dollar, should that spur inflation by pushing up the cost of imports in the United States. This could prompt faster and bigger rises in interest rates which feed through to equity markets. But Trump may be wary of disrupting the equity boom which he has cited as evidence of his administration’s successful policies. \n“At today’s (share price) valuations, a trade war would be material,” said Andrew Milligan, head of global strategy at Aberdeen Standard Investments. “I‘m sure he’s received a lot of advice that a trade war would damage the Dow.” \n(To view a graphic on global trade and GDP growth, click reut.rs/2DFt88j ) Reporting by Sujata Rao and Tom Miles; additional reporting by Claire Milhench, Karin Strohecker and Ritvik Carvalho; editing by David Stamp", "external_links": [], "published": "2018-01-30T17:06:00.000+02:00", "crawled": "2018-01-30T17:45:15.008+02:00", "highlightTitle": ""}