{"organizations": [], "uuid": "dec9f6b01a78a1a2ff801349ad4bf71af8290f9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/19/reuters-america-update-14-u-s-government-shutdown-looms-as-senate-short-of-votes-for-spending-bill.html", "country": "US", "domain_rank": 767, "title": "UPDATE 14-U.S. government shutdown looms as Senate short of votes for spending bill", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T06:52:00.000+02:00", "replies_count": 0, "uuid": "dec9f6b01a78a1a2ff801349ad4bf71af8290f9b"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/reuters-america-update-14-u-s-government-shutdown-looms-as-senate-short-of-votes-for-spending-bill.html", "ord_in_thread": 0, "title": "UPDATE 14-U.S. government shutdown looms as Senate short of votes for spending bill", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "mcconnell", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "house of representatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "spending bill@ (Updates with negotiations continuing)\nWASHINGTON, Jan 19 (Reuters) - The U.S. Senate was short of the votes needed to approve a bill to keep the federal government running as a midnight deadline loomed on Friday night, although high-level negotiations continued.\nIn a dramatic late-night session, Senate majority leader Mitch McConnell left voting open despite appearing to fall well short of the 60 votes needed to keep alive a stopgap bill that would fund the government through Feb. 16.\nAs the clock ticked toward midnight, McConnell and   huddled in negotiations in a room just off the Senate floor.\nWithout some type of funding bill, the U.S. government technically will run out of money right after midnight, on the first anniversary of President Donald Trump's inauguration. That would leave scores of federal agencies across the country unable to continue operating, and   \"non-essential\" federal workers would be put on temporary unpaid leave.\nThe Republican-controlled House of Representatives passed a stopgap funding measure on Thursday. But Republicans then needed the support of at least 10 Democrats to pass the bill in the Senate.\nDemocratic leaders demanded that the measure include protections for   young undocumented immigrants known as \"Dreamers\" who arrived in the United States as children with their parents. Republicans refused and neither side has been willing to back down.\nTrump last week rejected a bipartisan proposal, saying he wanted to include any deal for Dreamers in a bigger legislative package that also boosts funding for a border wall and tighter security at the U.S. border with Mexico.\nIn a shutdown, \"essential\" employees who deal with public safety and national security would keep working. That includes more than 1.3 million people on active duty in the military who would be required to work and would not be paid until funding is renewed.\nAlthough past government shutdowns have done little lasting damage to the U.S. economy, they can rattle financial markets.\nA new shutdown now would trigger a political battle between Democrats and Republicans over who is to blame.\nThis week's showdown follows a months-long struggle in Congress to agree on government funding levels and the immigration issue.\nDemocrats have demanded the bill include protections from deportation for about 700,000 Dreamers, who are predominantly from Mexico and Central America and were given temporary legal status under the Deferred Action for Childhood Arrivals program started by former President Barack Obama.\nIn September, Trump announced he was ending the program and giving Congress until March 5 to come up with a legislative replacement.\nTrump pointed the finger at his political rivals earlier on Friday.\n\"Democrats are needed if it is to pass in the Senate - but they want illegal immigration and weak borders. Shutdown coming?\" he said.\nDemocrats say the search for a deal has been hurt by Trump sending contradictory messages about what kind of bipartisan immigration proposal he would accept. (Additional reporting by Roberta Rampton and Jim Oliphant; Editing by Kieran Murray and Leslie Adler)", "external_links": [], "published": "2018-01-20T06:52:00.000+02:00", "crawled": "2018-01-20T07:40:33.006+02:00", "highlightTitle": ""}