{"organizations": [], "uuid": "85fb24a44b653bd7ed69490b7e486f8a18c903d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-33across-expands-executive-ranks-with-appointments-and-promotions.html", "country": "US", "domain_rank": 767, "title": "33Across Expands Executive Ranks with Appointments and Promotions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.036, "site_type": "news", "published": "2018-01-04T17:00:00.000+02:00", "replies_count": 0, "uuid": "85fb24a44b653bd7ed69490b7e486f8a18c903d9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-33across-expands-executive-ranks-with-appointments-and-promotions.html", "ord_in_thread": 0, "title": "33Across Expands Executive Ranks with Appointments and Promotions", "locations": [], "entities": {"persons": [{"name": "miles dennison", "sentiment": "negative"}, {"name": "dennison", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "cro paul bell", "sentiment": "negative"}, {"name": "global data solutions", "sentiment": "none"}, {"name": "tremor media", "sentiment": "none"}, {"name": "cnet", "sentiment": "none"}, {"name": "idg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Appoints adtech veteran Miles Dennison to Chief Revenue Officer; Promotes former CRO Paul Bell to General Manager\nNEW YORK--(BUSINESS WIRE)-- 33Across , a global publisher monetization platform, today announced the appointment of Miles Dennison to the position of chief revenue officer (CRO) and the promotion of former CRO Paul Bell to general manager, Global Data Solutions. The expansion of the company’s executive team is a result of the strong demand among publishers and advertisers for the company’s programmatic platform, which has resulted in three consecutive years of 100 percent year-over-year growth.\nDennison will lead 33Across’ global agency and client relationships including direct and programmatic sales. He joins 33Across with more than 15 years of experience as an entrepreneur, sales executive, investor, and advisor to adtech and emerging media companies. Previous positions include senior sales roles at publishers IDG and CNet and vice president of sales for digital video startup Tremor Media. As senior vice president of sales for DoubleVerify, Dennison helped establish the online media verification company DoubleVerify as a worldwide market leader. As CRO of BLiNQ Media, he helped grow the company and was instrumental in its sale to Gannett, Inc. As an entrepreneur, Dennison co-founded TriVu Media which was acquired by AdKnowledge/ AdParlor where he was Global CRO.\n“The digital advertising industry is at a critical point in its evolution where quality ad formats and time-in-view remain elusive for far too many. As 33Across has built a global platform to address these challenges, we have attracted and retained some of the industry’s best talent,” said Eric Wheeler, CEO, 33Across. “Bringing on Miles and recognizing Paul’s significant contributions to our company’s growth reflects both the positive industry reception to our platform and enables us to seize global market opportunities.”\nAs General Manager of Global Data Solutions, Bell is focused on the market strategy and growth of 33Across' global data platform that empowers marketers to make more impactful, strategic decisions. Bell joined 33Across as CRO in 2015 with more than 15 years of experience as a digital media and data executive. Previously, Bell was vice president, head of digital sales and channel management at IXI, a division of Equifax where he drove triple digit revenue growth. Prior to IXI, Bell held sales leadership roles at Bankrate.com , Credit Suisse and Bear Stearns.\nAbout 33Across\n33Across is a publisher technology platform that powers quality publishers to earn revenue, optimize yield, and gain actionable insights. Through our advanced technology and insight into how people view, consume and share content across devices, we enable more than one million publishers to increase quality revenue and traffic. The 33Across monetization and traffic building tools allow publishers to do what they do best—create great content.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005061/en/\n33Across\nLisa Mollura, 646-606-2165\nlisa.mollura@33across.com\nor\nFastStartPR for 33Across\nKathy Keating, 617-460-2702\nkkeating@faststartpr.com\nSource: 33Across", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.33across.com%2F&esheet=51737167&newsitemid=20180104005061&lan=en-US&anchor=33Across&index=1&md5=ca34b97ba464775e5b8aefa2556decbe", "http://www.businesswire.com/news/home/20180104005061/en/"], "published": "2018-01-04T17:00:00.000+02:00", "crawled": "2018-01-04T16:44:03.026+02:00", "highlightTitle": ""}