{"organizations": [], "uuid": "a4f2779d254b595c11b086e441a870a75bb1812f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-correcting-and-replacing--riverview-bancorp-announces-ceo-succession-plan.html", "country": "US", "domain_rank": 767, "title": "CORRECTING and REPLACING -- Riverview Bancorp Announces CEO Succession Plan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T20:45:00.000+02:00", "replies_count": 0, "uuid": "a4f2779d254b595c11b086e441a870a75bb1812f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-correcting-and-replacing--riverview-bancorp-announces-ceo-succession-plan.html", "ord_in_thread": 0, "title": "CORRECTING and REPLACING -- Riverview Bancorp Announces CEO Succession Plan", "locations": [], "entities": {"persons": [{"name": "patrick sheaffer", "sentiment": "none"}, {"name": "kevin lycklama", "sentiment": "none"}, {"name": "sheaffer", "sentiment": "none"}, {"name": "lycklama", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "wash.", "sentiment": "none"}, {"name": "wash", "sentiment": "none"}, {"name": "riverview", "sentiment": "none"}], "organizations": [{"name": "riverview bancorp", "sentiment": "negative"}, {"name": "riverview bancorp, inc.", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "riverview community bank", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, Wash., Jan. 12, 2018 (GLOBE NEWSWIRE) -- In a release issued under the same headline earlier today by Riverview Bancorp, Inc. (Nasdaq:RVSB), please note that the dateline city of the release has been corrected to VANCOUVER, Wash. The complete corrected release follows:\nRiverview Bancorp, Inc. (Nasdaq:RVSB) (the “Company”), the holding company for Riverview Community Bank (the “Bank” and collectively “Riverview”), today announced that, effective April 2, 2018, Patrick Sheaffer will be retiring as President and Chief Executive Officer of the Company and the Bank. Mr. Sheaffer will continue to serve as Chairman of the Board of both the Company and the Bank. Kevin Lycklama, currently Executive Vice President and Chief Operating Officer, will succeed him as President and Chief Executive Officer of the Company and the Bank. With the transition, Mr. Lycklama will join the Board of Directors.\nPatrick Sheaffer joined the Bank in 1963 and became its Chief Executive Officer in 1976, a director in 1979 and Chairman of the Board in 1993. Mr. Sheaffer served as Chairman of the Board, President and Chief Executive Officer of the Company since its inception in 1997.\n“Pat’s leadership and dedication are evident in the success Riverview has experienced during his tenure. He is responsible for taking the Company public in 1997, guiding us through multiple recessions and contributing to the growth of Riverview from seven employees and $6.5 million in assets at December 31, 1963 to $1.1 billion in assets and over 250 employees at September 30, 2017,” stated Mr. Lycklama. “I look forward to continuing Pat’s efforts in the successful operation of the Company and moving forward with our established strategic plan.”\n“It has been an honor to have served Riverview for almost 55 years,” said Sheaffer. “Throughout my career, I have been fortunate to work with an outstanding group of banking professionals, and I am extremely proud of what we have accomplished together. Riverview has always maintained a strong commitment to serve our customers, communities, shareholders and employees.”\n“As CEO, Pat has been an inspirational leader, built a terrific executive management team and guided the Company successfully through the worst economic crisis in recent history,” said Gerald L. Nies, Vice-Chairman of the Board. “On behalf of the Board of Directors, I want to express our sincere appreciation to Pat for the leadership and guidance that he has provided. We will continue to look for his expertise as Chairman of the Board.”\n“As we look to the future, the Board’s focus has been to identify the right leader to build on Riverview’s strong foundation, and Kevin is clearly that person,” said Sheaffer. “Kevin has been a driving force of our executive management team for the past decade and has been instrumental in the Company's growth and success. His commitment to our customers, employees and the community are totally aligned with our values and approach to doing business. I am confident that Kevin’s talent, energy, and banking experience, along with the strong management team we have built, will lead Riverview to new levels of success. I’m excited to provide my support from the Board Room and watch Kevin continue his strong leadership of our organization.”\nKevin Lycklama, age 40, joined the Bank in 2006 and served as Executive Vice President and Chief Financial Officer of the Company from February 2008 to July 2017 and Chief Operating Officer since July 2017. Prior to joining Riverview, Kevin was an audit manager for an Oregon CPA firm. Mr. Lycklama has been a key part of our investor relations team, led the recent transaction with MBank and assisted in the Company’s secondary public offering. He holds a Bachelor degree from Washington State University, is a graduate of the Pacific Coast Banking School and is a certified public accountant.\nAbout Riverview\nRiverview Bancorp, Inc. ( www.riverviewbank.com ) is headquartered in Vancouver, Washington – just north of Portland, Oregon on the I-5 corridor. With assets of $1.15 billion at September 30, 2017, it is the parent company of the 94 year-old Riverview Community Bank, as well as Riverview Trust Company. The Bank offers true community banking services, focusing on providing the highest quality service and financial products to commercial and retail customers. There are 19 branches, including 14 in the Portland-Vancouver area and three lending centers.\nThis press release contains statements that the Company believes are “forward-looking statements.” These statements relate to the Company’s financial condition, results of operations, plans, objectives, future performance or business. You should not place undue reliance on these statements, as they are subject to risks and uncertainties. When considering these forward-looking statements, you should keep in mind these risks and uncertainties, as well as any cautionary statements the Company may make. Moreover, you should treat these statements as speaking only as of the date they are made and based only on information then actually known to the Company.\nContacts:\nPat Sheaffer or Kevin Lycklama\nRiverview Bancorp, Inc. 360-693-6650\nSource:Riverview Bancorp Inc", "external_links": ["https://www.globenewswire.com/Tracker?data=rcjdBqx8pKZ7zQ-IO-faxgvqj0bPjltZbitj5WhnDqVum233APGse3eisacOkjVFglmBy7enE4yKbd84AGGd8heBsNDgts7bni1pzqO9ywk=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/8781d6f6-5a94-4655-9dc7-bd7648171371"], "published": "2018-01-12T20:45:00.000+02:00", "crawled": "2018-01-12T20:43:39.001+02:00", "highlightTitle": ""}