{"organizations": [], "uuid": "b5393eeecaf94f83bfa12361f6809188fbe1103a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/20/reuters-america-trumps-dealmaker-image-tarnished-by-u-s-government-shutdown.html", "country": "US", "domain_rank": 767, "title": "Trump's dealmaker image tarnished by U.S. government shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T08:41:00.000+02:00", "replies_count": 0, "uuid": "b5393eeecaf94f83bfa12361f6809188fbe1103a"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/20/reuters-america-trumps-dealmaker-image-tarnished-by-u-s-government-shutdown.html", "ord_in_thread": 0, "title": "Trump's dealmaker image tarnished by U.S. government shutdown", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "mar-a-lago", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "u.s. congress", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Note language in paragraph 21)\nWASHINGTON, Jan 20 (Reuters) - For President Donald Trump, this weekend was supposed to be a celebration.\nOn the first anniversary of his presidency on Saturday, with the stock market roaring and his poll ratings finally rising, he had planned to rest at his Mar-a-Lago estate in Florida, feted by friends and admirers.\nInstead, Trump stayed in Washington, bogged down in yet another crisis in his short presidency after he was unable to avert a government shutdown.\nHis failure to win passage by the U.S. Congress of a stopgap bill to keep funds flowing to the federal government further damaged his self-crafted image as a dealmaker who would repair the broken culture in Washington.\nEven as the White House began pointing the finger at Democrats on Friday in a steady messaging effort, blame for the shutdown also was directed at the Republican president.\n\"It's almost like you were rooting for a shutdown,\" said Senate Democratic leader Chuck Schumer of Trump after the Senate refused to approve a shutdown-averting funding bill.\nTrump, who in July 2016 said, \"Nobody knows the system better than me, which is why I alone can fix it,\" also said past government shutdowns were the fault of the person in the White House.\nIn a \"Fox & Friends\" interview after a 2013 shutdown, he said then-President Barack Obama was ultimately responsible.\nThe problems start from the top and have to get solved from the top, Trump said. The president is the leader, and hes got to get everybody in a room and hes got to lead.\nAs this new shutdown, the first since 2013, started looking increasingly likely on Friday, Trump made a last-ditch effort to behave as the kind of problem-solver he long claimed to be.\nFirst, he postponed a long-planned weekend trip to his winter home Mar-a-Lago, where a lavish $100,000-a-couple fundraiser on Saturday would extol his first year in office.\nHe had little choice. Critics would have hammered him for attending such a glittery event while government workers were being put on leave and many government services curtailed.\nThen, Trump invited Schumer to a meeting at the White House on Friday afternoon. It was intimate, just the president, Schumer, and top aides. Republican leaders were excluded. The idea was to find some common ground. And it lasted 90 minutes.\nBoth Trump and Schumer afterward spoke of progress, but the president quickly reverted to the same stance he and other White House officials had taken earlier in the day: If a resolution were to be reached, it would have to involve the Senate passing a four-week funding extension passed on Thursday by the House.\nSchumer had pressed for a short-term bill, of a week or less, and he said he even put on the table funding for Trump's long-desired wall along the U.S.-Mexico border.\nTrump had repeatedly linked wall funding to Democrats' goal of a comprehensive deal to preserve legal protections, under the Deferred Action for Childhood Arrivals program (DACA), for hundreds of thousands of undocumented immigrants that came to the United States as children with their parents.\nNON-STARTER\nBy early evening, despite Schumer's offer to discuss the wall, White House aides reiterated that the New York senator's proposal was a non-starter, leaving both sides as far apart as ever. \"He did not press his party to accept it,\" said Schumer.\nThe day seemed part of a familiar pattern that has driven Democrats to distraction. Trump first courts their support and suggests flexibility, only to pivot and side with more conservative lawmakers.\nIt happened in September, after he cut a short-term government funding deal with Schumer and House Democratic leader Nancy Pelosi. Weeks later, when Schumer and Pelosi thought they had reached an agreement to preserve DACA, Trump reportedly walked away.\nThat stand-off on DACA lasted until earlier this month. That was when Republican Senator Lindsey Graham and Democratic Senator Dick Durbin reached an accord on DACA and other immigration issues.\nThey believed Trump had signaled he would support it. But in a heated Oval Office meeting, Trump savaged the deal and made his now-infamous comment about immigrants from shithole countries, poisoning the negotiation process.\nBoth sides felt betrayed, and Trumps flip-flops left Republican Senate leader Mitch McConnell mystified to the point where he said earlier this week that he couldnt figure out Trumps position on the issue.\nTrust was further undermined when Trump appeared to criticize on Twitter a House stopgap funding bill that the White House hours earlier said he supported.\nMembers of each party blamed the other for the shutdown, but some of the blame landed, as Trump had said it should four years ago, on the president.\nDonald Trump is not capable of carrying out this kind of an intricate conversation about issues,\" John Yarmuth, the senior Democrat on the House Budget Committee, told reporters Friday night before the vote.\n\"He doesn't have the attention span to do it. He doesn't have the interest to do it. All he wants to do is show he's engaged in the process. (Reporting by James Oliphant and Richard Cowan; Editing by Damon Darlin, Kevin Drawbaugh and Michael Perry)", "external_links": [], "published": "2018-01-20T08:41:00.000+02:00", "crawled": "2018-01-20T09:06:50.047+02:00", "highlightTitle": ""}