{"organizations": [], "uuid": "f9d253eef6193f41f12404c6b53e5099236fa05b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-emerson-completes-acquisition-of-prosys-inc.html", "country": "US", "domain_rank": 767, "title": "Emerson Completes Acquisition of ProSys, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:05:00.000+02:00", "replies_count": 0, "uuid": "f9d253eef6193f41f12404c6b53e5099236fa05b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-emerson-completes-acquisition-of-prosys-inc.html", "ord_in_thread": 0, "title": "Emerson Completes Acquisition of ProSys, Inc.", "locations": [], "entities": {"persons": [{"name": "emer", "sentiment": "negative"}, {"name": "mike train", "sentiment": "none"}, {"name": "emerson", "sentiment": "none"}], "locations": [{"name": "st. louis", "sentiment": "none"}], "organizations": [{"name": "emerson completes acquisition of prosys, inc", "sentiment": "neutral"}, {"name": "emerson automation solutions", "sentiment": "none"}, {"name": "prosys inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Deal adds new software capabilities to improve plant performance and brings new technologies to Emerson’s Operational Certainty initiative\nST. LOUIS--(BUSINESS WIRE)-- Emerson (NYSE: EMR) today announced it has acquired ProSys Inc., a global supplier of software and services that increase production and safety for the chemical, oil and gas, pulp and paper, and refining industries. By building intuitive processes for plant operators, these solutions make everything from everyday operations to responding during abnormal situations easier.\n“Adding ProSys’ differentiated technologies and expertise allows us to help our customers improve plant performance, safety and profitability by optimizing their human and automation resources,” said Mike Train, executive president, Emerson Automation Solutions. “With ProSys, we can provide innovative control and operator performance capabilities to make control room operators far more effective.”\nProSys’ portfolio includes solutions that help operators manage alarms critical to plant production and safety, and efficiently handle changing plant states. In addition, ProSys provides modern, high performance and intuitive graphics for better operator communications.\nProSys complements Emerson’s May 2017 acquisition of MYNAH Technologies, which provides dynamic simulation and operator training software. Together, these technologies embed expertise to help operators navigate plant systems safely and efficiently, and prepare customers to accommodate the changing state and age of the industrial workforce.\n“Our specialization in software and services that increase operator performance builds on Emerson’s market leadership in automation control systems,” said Dustin Beebe, president and CEO at ProSys. “By working together as one, we can provide even more operational and financial value to customers.” Beebe will join Emerson Automation Solutions as vice president, control and operator performance.\nThe ProSys software portfolio supports Emerson’s Operational Certainty™ program designed to help industrial companies achieve Top Quartile performance in areas of safety, reliability, and production.\nTerms of the acquisition were not disclosed. For more information about ProSys Inc., visit https://www.prosys.com/ .\nAbout Emerson\nEmerson (NYSE: EMR), headquartered in St. Louis, Missouri (USA), is a global technology and engineering company providing innovative solutions for customers in industrial, commercial, and residential markets. Our Emerson Automation Solutions business helps process, hybrid, and discrete manufacturers maximize production, protect personnel and the environment while optimizing their energy and operating costs. Our Emerson Commercial & Residential Solutions business helps ensure human comfort and health, protect food quality and safety, advance energy efficiency, and create sustainable infrastructure. For more information visit Emerson.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117006316/en/\nFor Emerson\nPatrick Kane, 314-982-8726\nPatrick.kane@fleishman.com\nSource: Emerson", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.prosys.com%2F&esheet=51744642&newsitemid=20180117006316&lan=en-US&anchor=https%3A%2F%2Fwww.prosys.com%2F&index=1&md5=65dc89c7ddbe74b39f87c1749a507523", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.emerson.com%2F&esheet=51744642&newsitemid=20180117006316&lan=en-US&anchor=Emerson.com&index=2&md5=f011e4ef5f501ac6750a09eca38b1482", "https://www.prosys.com/", "http://www.businesswire.com/news/home/20180117006316/en/"], "published": "2018-01-18T00:05:00.000+02:00", "crawled": "2018-01-18T00:27:02.006+02:00", "highlightTitle": ""}