{"organizations": [], "uuid": "1af4c2d20b73f18dda55e7bd118e1b960f870b90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-sgsco-strengthens-global-position-in-package-design-and-pre-media-industry-with-acquisition-of-diadeis.html", "country": "US", "domain_rank": 767, "title": "Sgsco strengthens global position in package design and pre-media industry with acquisition of Diadeis", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.694, "site_type": "news", "published": "2018-01-11T21:42:00.000+02:00", "replies_count": 0, "uuid": "1af4c2d20b73f18dda55e7bd118e1b960f870b90"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-sgsco-strengthens-global-position-in-package-design-and-pre-media-industry-with-acquisition-of-diadeis.html", "ord_in_thread": 0, "title": "Sgsco strengthens global position in package design and pre-media industry with acquisition of Diadeis", "locations": [], "entities": {"persons": [{"name": "sgsco", "sentiment": "negative"}, {"name": "aidan tracey", "sentiment": "none"}], "locations": [{"name": "diadeis louisville", "sentiment": "none"}, {"name": "ky.", "sentiment": "none"}, {"name": "central america", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "southern graphics inc.", "sentiment": "negative"}, {"name": "diadeis group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOUISVILLE, Ky., Jan. 11, 2018 /PRNewswire/ -- Southern Graphics Inc. (together with its global affiliates, \" sgs co\") announced today that it has signed an agreement to acquire the Diadeis Group (\"Diadeis\"), a leading global package design and pre-media company. The acquisition is subject to regulatory approval and other customary closing conditions and is expected to close in the first quarter of 2018. The financial terms of the transaction were not disclosed.\nSgs co and Diadeis, as established leaders in end-to-end design-to-print services, will together become a world leader in package design, digital art file and image carrier services. Their complementary combined geographic footprint and talent base represents nearly 80 offices and more than 4,500 employees across Europe, North America, South and Central America, Africa and Asia .\n\"By integrating our operational breadth and depth, and increasing our global scale we can provide unparalleled quality and service to our valued customers,\" said Aidan Tracey, CEO of sgs co. \"We share a vision that the digital art files that were historically used only for physical packaging are now also central to winning in an omnichannel retail environment. Ensuring that key brand visual assets are synchronized across the physical and digital shelf is critical to where the industry is headed, and we intend to lead the way.\"\nWith over 70 years of pre-media experience, sgs co has made significant recent investments in global innovation, image carriers, pre-media, 3D CGI, design, and e-commerce. Diadeis' additional footprint and capacity presents an opportunity to expand the company's overall pre-media and digital services to better meet global demand.\n\"This is a true win-win-win for everyone involved – our clients, employees, and company,\" said Jean-Charles Morisseau, Chairman of Diadeis. \"There is a mutual respect for what each organization has accomplished over the years and I am confident this will ensure many more years of future success.\"\nDiadeis' management team will all be joining sgs co, and Jean-Charles Morisseau and Guillaume Postel, CEO of Diadeis, will both assume executive roles at sgs co to assure the successful integration of the two firms, while also helping to drive results for clients.\nAbout sgs co\nSgs co is a global digital enterprise built to help brands win at the Moment of Sale™. With more than 70 years of expertise in end-to-end design-to-print graphics services, sgs co is a world leader in package design, digital art file creation, and image carrier production. As a global collective of companies and talent, sgs co provides tailored, innovative packaging solutions, production, printing and leading-edge technology for many of the world's top consumer packaged goods, pharma and retail brands. With 3,900 professionals worldwide, sgs co is well positioned to help clients navigate the increasingly fragmented sales and marketing environments for their brands. To learn more, visit www.sgsco.com .\nAbout Diadeis\nDiadeis is a global design and production agency specializing in expanding and evolving a brand's identity. As one of the world's leading production agencies, Diadeis offers a full suite of services, ranging from creative services, packaging artwork and prepress, print management, POS / POP, creative retouching, e-commerce as well as digital workflow solutions. Diadeis has many global partnerships with iconic global brands. Diadeis' global footprint helps them manage brand equity across all regions and cultures. Diadeis currently has offices located in North America, Europe, Latin America, Asia, Africa and the Middle East and provides services to clients all over the world. Diadeis' culture is driven by innovation, and continues to drive innovative thinking in the packaging design industry, as well as its clients. For more information please visit www.diadeis.com\nMedia Contact:\nBlueSky Communications\nJulie McCarthy, jmccarthy@blueskycommunications.com , 416-788-8515\nFederica Maraboli fmaraboli@blueskycommunications.com , 647-228-3844\nByrne PR\nPatrick Barry, Patrick@ByrnePR.net , 314-540-3865\nView original content with multimedia: http://www.prnewswire.com/news-releases/sgsco-strengthens-global-position-in-package-design-and-pre-media-industry-with-acquisition-of-diadeis-300581587.html\nSOURCE sgsco", "external_links": ["http://www.sgsco.com/", "http://www.prnewswire.com/news-releases/sgsco-strengthens-global-position-in-package-design-and-pre-media-industry-with-acquisition-of-diadeis-300581587.html", "https://urldefense.proofpoint.com/v2/url?u=http-3A__www.diadeis.com&d=DwMFaQ&c=9mghv0deYPYDGP-W745IEdQLV1kHpn4XJRvR6xMRXtA&r=FbgI576xnd1p0vkcP-BznZV9S-r7IPX1fdEvUQOxjIg&m=UoppX57jMt3IZvWicSbYWoNMuc-DayHyEDR9cbfcwWw&s=ppxfOYUj87OTTrsgmMLBoESknqiUlZQ1lh7_pb26WYo&e="], "published": "2018-01-11T21:42:00.000+02:00", "crawled": "2018-01-11T23:46:09.038+02:00", "highlightTitle": ""}