{"organizations": [], "uuid": "474be92c5852336239e922dd13c861e8091acc6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220793933&w=1200&r=LYNXMPEE090K7", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia/pro-independence-parties-to-back-former-catalan-leader-as-regional-head-idUKKBN1EZ11Y", "country": "US", "domain_rank": 408, "title": "Pro-independence parties to back former Catalan leader as regional head", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T12:50:00.000+02:00", "replies_count": 0, "uuid": "474be92c5852336239e922dd13c861e8091acc6d"}, "author": "", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia/pro-independence-parties-to-back-former-catalan-leader-as-regional-head-idUKKBN1EZ11Y", "ord_in_thread": 0, "title": "Pro-independence parties to back former Catalan leader as regional head", "locations": [], "entities": {"persons": [{"name": "carles puigdemont", "sentiment": "none"}, {"name": "puigdemont", "sentiment": "none"}, {"name": "inmaculada sanz", "sentiment": "none"}, {"name": "xucla", "sentiment": "none"}, {"name": "jordi xucla", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "am / updated 16", "sentiment": "negative"}, {"name": "esquerra republicana de catalunya", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 10:52 AM / Updated 5 minutes ago Catalan parties propose self-exiled former leader as president Inmaculada Sanz , Sonya Dowsett 4 Min Read \nMADRID (Reuters) - The two main pro-independence parties in Catalonia have agreed to back former leader Carles Puigdemont as their candidate to head the region, raising the likelihood of a renewed push this year for a split from Spain. FILE PHOTO - Former Catalan president Carles Puigdemont attends an interview with Reuters in Brussels, Belgium, December 23, 2017. REUTERS/Eric Vidal \nHowever, the anti-independence party that won most votes in a Dec. 21 regional election poured scorn on the plan as Puigdemont remains in self-imposed exile in Brussels and it said he would be a “hologram president”. \nSpanish Prime Minister Mariano Rajoy called the election in Catalonia last month to try to resolve Spain’s worst political crisis in decades after Catalan leaders declared independence in October following a banned referendum on secession. \nPro-independence parties secured a slim majority of seats but failed to win more than 50 percent of the popular vote, meaning there is still no end in sight to the months-long, and increasingly bitter, impasse. \nThe political instability in Catalonia, which accounts for a fifth of Spain’s economy, has deterred tourists and prompted more than 3,000 companies, including the region’s two biggest banks, to move their legal headquarters elsewhere in Spain. \nThe new Catalan parliament will hold its first session on Jan. 17, the first step in reinstating the local government after Madrid fired the old regional administration, led by Puigdemont, for illegally declaring independence. MAJORITY MANDATE \nThe pro-independence parties Junts per Catalunya (Together for Catalonia) and Esquerra Republicana de Catalunya (ERC)(Republican Left of Catalonia) said on Wednesday they would support Puigdemont’s return to the top job. \n“The Dec. 21 result gave us the mandate to reflect the majority. The presidential candidate will evidently be Puigdemont,” Junts pel Catalunya representative Jordi Xucla told Spanish national radio. \nHowever, if Puigdemont is elected leader it is uncertain how he would govern from Brussels. He is likely to be arrested if he returns to Spain, where he faces charges of sedition, rebellion and misuse of public funds. \nInes Arrimadas, the leader of Ciudadanos (Citizens), which wants Catalonia to remain part of Spain, said a fugitive from justice could not be lead the region. \n“You can’t have a hologram president in Catalonia,” she said in a television interview on Tuesday. “You can’t be president of Catalonia from Brussels by Skype,” said Arrimadas, whose party won most votes in December but not enough to form a government. \nOnce the Catalan parliament is formed, potential leaders of the regional government will put themselves forward for a vote of confidence. However, it could take months for a new government to emerge. \nMany of the Catalan political leaders were arrested on charges of sedition and rebellion after the independence declaration. Three are still behind bars pending a trial, while Puigdemont, with four of his cabinet members, fled to Brussels. \nThe other main potential candidate to represent the pro-independence parties would be ERC leader Oriol Junqueras, who is serving a custodial sentence in a Madrid jail. \nJunqueras has asked for release from jail to attend the first meeting of the new Catalan parliament. \nIn an editorial published on the Politico news website on Wednesday, Puigdemont reiterated his call for talks with Madrid, which Rajoy has tentatively agreed to but on condition that the region drop its push for independence. \n“Madrid must be made to understand that what is needed is dialogue, negotiation and agreement on the future relationship we Catalans want to have with Spain - one based on respect, recognition, cooperation and equality,” Puigdemont wrote. Editing by Alison Williams and Gareth Jones", "external_links": [], "published": "2018-01-10T12:50:00.000+02:00", "crawled": "2018-01-10T13:12:57.004+02:00", "highlightTitle": ""}