{"organizations": [], "uuid": "14c209305dc53eacf4509e7f80765df3fa69fd65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-rite-aid-adopts-tax-benefits-preservation-plan-to-protect-valuable-tax-assets.html", "country": "US", "domain_rank": 767, "title": "Rite Aid Adopts Tax Benefits Preservation Plan to Protect Valuable Tax Assets", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:23:00.000+02:00", "replies_count": 0, "uuid": "14c209305dc53eacf4509e7f80765df3fa69fd65"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-rite-aid-adopts-tax-benefits-preservation-plan-to-protect-valuable-tax-assets.html", "ord_in_thread": 0, "title": "Rite Aid Adopts Tax Benefits Preservation Plan to Protect Valuable Tax Assets", "locations": [], "entities": {"persons": [], "locations": [{"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "rite aid corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMP HILL, Pa.--(BUSINESS WIRE)-- Rite Aid Corporation (NYSE: RAD) today announced that its Board of Directors has adopted a tax benefits preservation plan (the “Plan”) designed to preserve Rite Aid’s ability to utilize its net operating loss carryforwards and other tax attributes (collectively, “Tax Benefits”). The Plan is similar to plans adopted by other public companies with significant Tax Benefits.\nRite Aid has federal net operating loss carryforwards totaling approximately $2.7 billion as of Dec. 2, 2017. The purpose of the Plan is to preserve Rite Aid’s ability to use its Tax Benefits which would be substantially limited if Rite Aid experienced an “ownership change” as defined under Section 382 of the Internal Revenue Code. In general, an ownership change would occur if Rite Aid’s shareholders who are treated as owning 5 percent or more of the outstanding shares of Rite Aid for purposes of Section 382 (\"5-percent shareholders\") collectively increase their aggregate ownership in Rite Aid's overall shares outstanding by more than 50 percentage points. Whether this change has occurred would be measured by comparing each 5-percent shareholder's current ownership as of the measurement date to such shareholders' lowest ownership percentage during the three year period preceding the measurement date. As previously disclosed, Rite Aid is in the process of consummating its sale of 1,932 stores to Walgreens Boots Alliance, Inc. for $4.375 billion on a cash-free, debt-free basis. The adoption of the Plan is intended to ensure that Rite Aid will be able to utilize Tax Benefits in connection with this sale.\nUnder the Plan, Rite Aid is issuing one Right for each share of its common stock outstanding at the close of business on Jan. 16, 2018. The distribution of the Rights is not taxable to shareholders. Shareholders are not required to take any action to receive the Rights. The rights will trade with Rite Aid’s common shares and will expire on Jan. 3, 2019 unless the plan is extended by the Board for up to two additional years with prior shareholder approval. The rights also will expire if: (i) the rights are redeemed or exchanged as provided in the Plan; (ii) the Board determines that the Plan is no longer necessary or desirable for the preservation of the Tax Benefits; or (iii) on the close of business on the first day of a taxable year of Rite Aid to which the Board determines that no Tax Benefits, once realized, as applicable, may be carried forward.\nPursuant to the Plan, if a shareholder (or group) becomes a 5-percent shareholder after adoption of the Plan without meeting certain customary exceptions, the Rights would become exercisable and entitle shareholders (other than the 5-percent shareholder or group causing the rights to become exercisable) to purchase additional shares of Rite Aid at a significant discount, resulting in significant dilution in the economic interest and voting power of the 5-percent shareholder or group causing the Rights to become exercisable. Shareholders owning 5% or more of Rite Aid’s outstanding shares at the time of adoption of the Plan are grandfathered and will only cause the Rights to become exercisable if they acquire an additional 1% or more of Rite Aid’s outstanding shares. Under the Plan, the Board has the ability to determine in its sole discretion that any person shall not be deemed an acquiring person and therefore that the Rights shall not become exercisable if such person becomes a 5-percent shareholder.\nAdditional details of the Plan will be communicated in a current report on Form 8-K to be filed with the U.S. Securities and Exchange Commission.\nRite Aid Corporation is one of the nation's leading drugstore chains with fiscal 2017 annual revenues of $32.8 billion. Information about Rite Aid, including corporate background and press releases, is available through the company's website at www.riteaid.com .\nCautionary Statement Regarding Forward Looking Statements\nStatements in this release that are not historical, are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Words such as \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"predict,\" \"project,\" \"should,\" and \"will\" and variations of such words and similar expressions are intended to identify such forward-looking statements. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, including, but not limited to, our high level of indebtedness and our ability to make interest and principal payments on our debt and satisfy the other covenants contained in our debt agreements; general economic, industry, market, competitive, regulatory and political conditions; our ability to improve the operating performance of our stores in accordance with our long term strategy; the impact of private and public third-party payers continued reduction in prescription drug reimbursements and efforts to encourage mail order; our ability to manage expenses and our investments in working capital; outcomes of legal and regulatory matters; changes in legislation or regulations, including healthcare reform; our ability to achieve the benefits of our efforts to reduce the costs of our generic and other drugs; risks related to the proposed asset sale transactions with Walgreens Boots Alliance, including the possibility that the remaining transactions may not close, the risk that there may be a material adverse change of Rite Aid, or the business of Rite Aid may suffer as a result of uncertainty surrounding the proposed transactions; risks related to the ability to realize the anticipated benefits of the proposed transactions; risks associated with the financing of the proposed transaction; disruption from the proposed transaction making it more difficult to maintain business and operational relationships; the effect of the pending sale on Rite Aid's business relationships (including, without limitation, customers and suppliers), operating results and business generally; risks related to diverting management's or employees' attention from ongoing business operations; the risk that Rite Aid's stock price may decline significantly if the remaining proposed transactions are not completed; significant transaction costs; unknown liabilities; the risk of litigation and/or regulatory actions related to the proposed transactions; potential changes to our strategy in the event the remaining proposed transactions do not close, which may include delaying or reducing capital or other expenditures, selling assets or other operations, attempting to restructure or refinance our debt, or seeking additional capital, and other business effects. These and other risks, assumptions and uncertainties are more fully described in Item 1A (Risk Factors) of our most recent Annual Report on Form 10-K, and in other documents that we file or furnish with the Securities and Exchange Commission, which you are encouraged to read. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those indicated or anticipated by such forward-looking statements. Accordingly, you are cautioned not to place undue reliance on these forward- looking statements, which ", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.riteaid.com&esheet=51737563&newsitemid=20180103006236&lan=en-US&anchor=www.riteaid.com&index=1&md5=cb9d7bfd83585917ab084f4080e4b205", "http://www.businesswire.com/news/home/20180103006236/en/"], "published": "2018-01-04T00:23:00.000+02:00", "crawled": "2018-01-04T00:38:33.012+02:00", "highlightTitle": ""}