{"organizations": [], "uuid": "72818f902aad42611b21a58f2e4ca0b028910543", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104925882-fortis122916_0.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/rapidly-intensifying-bomb-cyclone-is-heading-up-the-east-coast.html", "country": "US", "domain_rank": 767, "title": "Rapidly intensifying 'bomb cyclone' is heading up the East Coast", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-03T17:21:00.000+02:00", "replies_count": 0, "uuid": "72818f902aad42611b21a58f2e4ca0b028910543"}, "author": "Robert Ferris", "url": "https://www.cnbc.com/2018/01/03/rapidly-intensifying-bomb-cyclone-is-heading-up-the-east-coast.html", "ord_in_thread": 0, "title": "Rapidly intensifying 'bomb cyclone' is heading up the East Coast", "locations": [], "entities": {"persons": [{"name": "maue", "sentiment": "none"}], "locations": [{"name": "east coast", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "east coast rapidly", "sentiment": "negative"}, {"name": "the weather channel file", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Maue \nThey will be watching a phenomenon known as \"bombogenesis,\" which is when a mid-latitude cyclone rapidly intensifies due to a sudden drop in pressure in the center of the storm. \nIn general, a cyclone is a storm that rotates or spins around a low-pressure center. That can refer to a variety of storms, but is perhaps most commonly associated with tropical cyclones, which are so named because they originate in tropical ocean waters. These include hurricanes in the Atlantic, typhoons in the Pacific, and the cyclones in the South Pacific and Indian Ocean. show chapters 5 Hours Ago | 02:06 \nCyclones are basically formed and fueled by a mix of warm moist air rising from warm ocean water and cooler air above, which forms the rising warm air into clouds. \nAs the warm air rises, it leaves something of a vacuum, which other, colder air rushes into. A phenomenon called the Coriolis effect causes the winds to swirl . \nA \"bomb cyclone\" is one such rotating storm, but one where the pressure at the center of the storm drops very rapidly. \nThe term sounds menacing, but it actually refers to the rapid drop in pressure, not the effects of the storm. \n\"Bombing is simply the rapid decrease or drop in surface barometric pressure of at least 24 millibars in 24 hours and [signifies] intensification or strengthening of the storm system,\" said meteorologist Ryan Maue of Weather.us in a blog post. A millibar is simply a unit of pressure. The typical atmospheric pressure at sea level is 1023.45 millibars, according to the American Meteorological Society. \nThese phenomena are not particularly rare, Maue told CNBC on Wednesday. Based on his research, the Northern Hemisphere sees about 40 to 50 of these cyclones each year, primarily from March to September. That is when the conditions are best for them: the jet stream is strong enough and the contrasts between the colder temperature in the air and the warmer ocean temperatures, which help fuel the growth of the storm, are especially pronounced \n\"Thus, this bomb cyclone with this intensity isn't 'unusual' but just toward the stronger, faster developing tail of the distribution,\" Maue said. \"We can expect a few of these each Fall and Winter along the U.S. East coast but many harmlessly go out to sea or impact Canada. Of course, the ones that do slam into the coast have major impacts!\" \nThe National Weather Service said Wednesday morning that a rapidly deepening area of low pressure off the east coast of Florida will move up the Atlantic coast Thursday and Friday. Winter storm watches and warnings are in effect from north central Florida northward all the way through eastern New England. \nBlizzard conditions are possible across portions of eastern New England late Thursday. The weather service issued a coastal flood warning for the eastern coast of Massachusetts.", "external_links": [], "published": "2018-01-03T17:21:00.000+02:00", "crawled": "2018-01-03T17:21:39.012+02:00", "highlightTitle": ""}