{"organizations": [], "uuid": "602744636ebb2114948a85e23cc1abab872388dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/08/gettyimages-631916822.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/venezuela-inflation-imf-estimate/", "country": "US", "domain_rank": 1196, "title": "Venezuela Will Experience 13,000% Inflation This Year, IMF Says | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.941, "site_type": "news", "published": "2018-01-25T13:28:00.000+02:00", "replies_count": 0, "uuid": "602744636ebb2114948a85e23cc1abab872388dc"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/25/venezuela-inflation-imf-estimate/", "ord_in_thread": 0, "title": "Venezuela Will Experience 13,000% Inflation This Year, IMF Says | Fortune", "locations": [], "entities": {"persons": [{"name": "boliv", "sentiment": "negative"}, {"name": "carlos becerra", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}, {"name": "alejandro werner", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "caracas", "sentiment": "none"}, {"name": "western hemisphere", "sentiment": "none"}], "organizations": [{"name": "imf", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This Country Will Experience 13,000% Inflation This Year, IMF Says A customer displays new 500 Bolivar banknotes in Caracas, Venezuela, Jan. 17, 2017. Carlos Becerra—Bloomberg/Getty Images By Bloomberg 11:28 AM EST \nThe International Monetary Fund sees Venezuelan inflation spiraling to 13,000 percent this year, as the crisis-torn nation prints money to tackle fiscal deficits and confidence in its currency evaporates. \nThat’s more than five times the inflation previously projected by the IMF, and way above the median forecast from economists surveyed by Bloomberg. The fund estimates price increases surpassed 2,400 percent last year, according to a report published Thursday by Alejandro Werner, head of the IMF’s Western Hemisphere department. That was the fastest in the world. \nVenezuela has succumbed to hyperinflation combined with a prolonged recession stemming from years of mismanagement as well as faltering oil exports. In an attempt to rein in inflation, the government of President Nicolas Maduro has refused to loosen foreign-exchange controls and price caps that have exacerbated the short supply of all sorts of products, from food to medicine. \nThe IMF expects the Venezuelan economy to contract 15 percent this year, leading to a cumulative GDP decline of nearly 50 percent since 2013. That’s holding back the rebound of the entire region; Latin America is expected to grow 1.9 percent this year, or 2.5 percent without Venezuela. While Venezuela suppresses the regional average, at this point the impact on its neighbors’ output is “very limited,” Werner said in a press conference following the report’s release. \nMexico, Central America and parts of the Caribbean will benefit from stronger US growth, while South America’s prospects have improved due to the end of recessions in Brazil and Argentina, as well as higher prices for the raw materials the region exports, according to the report. \nClick here to read more about IMF’s improved growth forecasts for Mexico and Brazil \n“Recent trends in the world economy and financial markets are good news for Latin America,” Werner wrote. “Global growth and trade are on an upswing, and we expect the momentum to continue in 2018. Stronger commodity prices have also helped the region rebound.” \nPrior 2018 Estimate New 2018 Estimate Prior 2019 Estimate New 2019 Estimate Argentina 2.5 2.5 2.7 2.8 Chile 2.5 3 2.7 3.2 Colombia 2.8 3 3.6 3.6 Ecuador 0.6 2.2 1 1.7 Peru 3.8 4 4 4 Venezuela -6 -15 -2 -6 \nEcuador also came out of its recession at a faster-than-expected pace, due to higher oil prices and greater access to financial markets, Werner said. The IMF significantly boosted its 2018 GDP outlook for the nation to 2.2 percent, from 0.6 percent previously. The multilateral also gave a boost to its Chile growth estimates, citing faster momentum carrying over into 2018 amid higher copper prices and improving business sentiment. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T13:28:00.000+02:00", "crawled": "2018-01-25T20:46:57.002+02:00", "highlightTitle": ""}