{"organizations": [], "uuid": "0c98a0838c2dcb5f9c32025a544bcaa208421608", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-montecito-medical-acquires-on-campus-medical-office-building-in-indiana.html", "country": "US", "domain_rank": 767, "title": "Montecito Medical Acquires On-Campus Medical Office Building in Indiana", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T19:18:00.000+02:00", "replies_count": 0, "uuid": "0c98a0838c2dcb5f9c32025a544bcaa208421608"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-montecito-medical-acquires-on-campus-medical-office-building-in-indiana.html", "ord_in_thread": 0, "title": "Montecito Medical Acquires On-Campus Medical Office Building in Indiana", "locations": [], "entities": {"persons": [{"name": "dyer", "sentiment": "none"}, {"name": "mike o’connor", "sentiment": "none"}], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "indiana nashville", "sentiment": "none"}, {"name": "dyer", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "northwest indiana", "sentiment": "none"}, {"name": "ind.", "sentiment": "none"}], "organizations": [{"name": "montecito medical real estate", "sentiment": "negative"}, {"name": "montecito medical acquires on-campus medical office building", "sentiment": "negative"}, {"name": "medical pavilion south", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "franciscan health", "sentiment": "none"}, {"name": "franciscan health dyer hospital", "sentiment": "none"}, {"name": "holladay properties", "sentiment": "none"}, {"name": "montecito medical", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NASHVILLE, Tenn.--(BUSINESS WIRE)-- Montecito Medical Real Estate, one of the fastest growing, privately held firms in the country devoted exclusively to medical real estate, has acquired Medical Pavilion South, a 63,486 square-foot medical office building in Dyer, Indiana on the campus of Franciscan Health Dyer Hospital. Founded in 1898, Franciscan Health is one of the largest acute-care hospitals in Northwest Indiana, operating 14 hospitals with more than 18,000 employees.\nBuilt in 2008, Medical Pavilion South is a four-story medical office building that is connected to the hospital via a covered walkway. The multi-tenant facility is 92 percent leased and located Dyer, Ind., a bedroom community 33 miles south of Chicago. Both Money Magazine and CNN have listed Dyer as one of the nation’s “Best Places to Live.”\n\"Holladay Properties is pleased with the opportunity to work with Montecito Medical on the sale of this important asset,\" said Mike O’Connor, Vice President of Development and Leasing for Holladay Properties, the owner of the building and one of the largest medical office management firms in the country. “We are confident the valued building tenants and Franciscan Health system will benefit from the Montecito professional ownership culture and we look forward to continuing our working relationship with the Montecito team by way of our ongoing management and leasing services.”\n“This was a rare, on-campus opportunity, anchored by and attached to one of the largest acute care hospitals in the Northwest Indiana region,” said Chip Conk, CEO of Montecito Medical. “Our company enjoyed a banner year in 2017, we are proud to open the new year with this exceptional medical office building acquisition.”\nThe Franciscan Alliance, Inc., anchors the building, occupying four suites totaling 44 percent of the rentable area. More than half of Franciscan Alliance occupied space is dedicated to their Senior Health and Wellness program which provides comprehensive, coordinated healthcare that helps aging adults retain their freedom, remain independent and continue living at home. Additional specialties provided by Franciscan Alliance include Pediatrics, Primary Care and OB-GYN. Franciscan also operates six acute care hospitals within a 15-mile radius of Medical Pavilion South.\nOther major tenants include Nephrology Associates of Northern Illinois (NANI) which occupies 18 percent of the building and provides dialysis services. NANI is the largest nephrology practice in the Midwest with more than 75 physicians. Cardio Specialists Group leases 19 percent of the building and consists of 17 providers serving Chicago Southland and Northwest Indiana.\nAbout Montecito Medical\nMontecito Medical is one of the nation’s largest privately-held companies specializing in healthcare-related real estate acquisitions and funding the development of medical real estate. Montecito is a leading resource for both real-estate owners and healthcare providers seeking to monetize or expand their holdings. Montecito has offices in Nashville, Tenn., Austin, Tex. and Orange County, Calif. Since 2005, it has acquired more than $1.7 billion in medical real estate totaling over five million square feet in 25 states. To date, Montecito has more than $1 billion in capital available to expand holdings in its medical office portfolio throughout the United States. Its current portfolio and healthcare system relationships include UCLA, Cleveland Clinic, Johns Hopkins, Holston Medical Group, Carolinas Health System, Bon Secours, Maine General, EmergeOrtho and State of Franklin Healthcare Associates.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117006028/en/\nMontecito Medical\nJoellyn Shannon, 615-921-3849\nVP Marketing & Strategic Initiatives\nJshannon@MontecitoMac.com\nSource: Montecito Medical", "external_links": ["http://www.businesswire.com/news/home/20180117006028/en/"], "published": "2018-01-17T19:18:00.000+02:00", "crawled": "2018-01-17T19:03:18.006+02:00", "highlightTitle": ""}