{"organizations": [], "uuid": "d30c7bd30d0ec049ecd0465a0a9d034233374941", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-12-retech-corporation-provides-update-to-shareholders-at-the-start-of-fy2018.html", "country": "US", "domain_rank": 767, "title": "12 ReTech Corporation Provides Update to Shareholders at the Start of FY2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:15:00.000+02:00", "replies_count": 0, "uuid": "d30c7bd30d0ec049ecd0465a0a9d034233374941"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-12-retech-corporation-provides-update-to-shareholders-at-the-start-of-fy2018.html", "ord_in_thread": 0, "title": "12 ReTech Corporation Provides Update to Shareholders at the Start of FY2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "carson city", "sentiment": "none"}, {"name": "javits center", "sentiment": "none"}], "organizations": [{"name": "retech corporation", "sentiment": "negative"}, {"name": "j. peterman company", "sentiment": "none"}, {"name": "nrf", "sentiment": "none"}, {"name": "active fashion group", "sentiment": "none"}, {"name": "national retail federation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Carson City, NV & Hong Kong, Jan. 08, 2018 (GLOBE NEWSWIRE) -- 12 ReTech Corporation (OTC: RETC) released an update to its shareholders about the latest Company activities.\nDear Shareholders,\nAfter a busy and productive 2017, I want to provide a synopsis of our ongoing projects and discuss what the future holds for our Company in 2018.\nFirst, regarding the Letters of Intent signed with Active Fashion Group and The J. Peterman Company, our team has been working hard to close these transactions. We believed that we would have these transactions completed by year end 2017, however the holiday season got in the way and we were unable to get all the parties together until after the holidays were over. We are looking forward to an announcement in the near future on both of these important acquisition projects.\nSecond, we will be attending the upcoming National Retail Federation’s Big Show at the Javits Center in NYC from January 14 to 16, 2018. We are hosting a dinner with the NRF on Monday evening (January 15) where we will be in front of many of the most important global retailers. In addition, we will be present in the show with our friends from Zivelo, Inc. on the exhibition floor. Most importantly, we will be showing our technology in a hospitality suite at the Cachet Boutique Hotel near Javits Center where we will be able to demonstrate our technology to American and international retail management teams during the duration of the show.\nThird, we have signed another LOI and we are also close to acquiring NYC based Krazy Larry, Inc. d/b/a Krazy Larry Pants® from its owners, Larry Palnick and Jacob Golob. The transaction was structured as a stock for stock exchange for 100% of the equity interests of the two owners for 12 Retech common equity.\nKrazy Larry Pants is a rapidly growing branded apparel company offering pants, skirts, jackets and blouses to the female shopper primarily within the borders of the United States. They sell their products wholesale to boutiques and in 2017 reached $7.4 million in sales with approximately $1.6 million in EBITDA. Sales growth has been robust over the past five years and averages 20% compounded. All Krazy Larry management team will be retained and incentivized to further grow their operations.\nOn the Unified Commerce, omni-channel technology side of our business, we have announced projects with several prominent retailers.\nTwo pilot projects to deploy appropriate pieces of our 12 Technology Suite with the Hudson Group from the US and Manor AG from Switzerland are slated to begin in the first quarter of 2018.\nWe have also entered the last phase of development of the 12 Sconti mobile application for Swiss shoppers, which will feature Wüst Bäckerei & Konditorei A.G., a Swiss bakery group with 12 locations, and Fresh A.G. a grocery produce wholesaler who has thousands of grocery stores as clients. Meanwhile, we are busy recruiting additional merchants in the same geography to make our 12 Sconti application valuable to shoppers in Switzerland.\nOver the past six months, we have been getting warm receptions from the retailers that we have been in front of so far. In 2018, we will be accelerating the pace of introducing and deploying our 12 Technology Suite offerings with prominent retailers in Asia, Europe and North America.\nAlso, we are seeing a lot of interest from the micro-brand community. We are also expecting to accelerate the pace at which we find synergistic micro-brand acquisition opportunities as the word spreads to others from what we have accomplished so far.\nOn a different front, we want you to know that 12 ReTech Corporation has applied to the OTC Markets Group for up listing to the OTCQB market. As of this date, the application is pending approval.\nOur company has accomplished a lot in the 6 months of being public since June 2017. We have ambitious goals for 2018 and look forward to a bright future. Thank you for being a shareholder and rest assured that all of us will continue to be work hard to enhance the value of your holdings in the upcoming year and beyond.\nSincerely,\nAngelo Ponzetta\nChief Executive Officer\n12 ReTech Corporation (OTC: RETC)\nAbout 12 ReTech Corporation:\n12 ReTech Corporation (OTC : RETC) Leading the Profitable Convergence of Traditional and Online Retail C ommerce Through Technology — The Omni-Channel Solution.\nWe are a publicly listed holding company whose operating subsidiaries develop, improve, acquire and/or license technologies designed to bridge the convergence between real world \"Brick and Mortar\" stores with effective Online retailing, creating a new, fun and exciting way of transacting Commerce. For Retailers, our products bring more Consumers into physical and/or online stores, encouraging them to purchase more by improving their overall shopping experiences while lowering both the Retailer's costs of customer acquisition and the costs of employee training. This is what we call Empowered Shopping. We enhance shareholder value by acquiring Micro-Brands that can greatly increase revenue and earnings by applying and using our proprietary technologies. The access these Micro-Brands give to sell our technologies to Major Retailers around the globe is the reason why we say, \" We are the Omni-Channel Solution\". Throughout history 12 is a “symbolic number \" and ReTech stands for \"Retail Technology \". Our subsidiaries 12 Japan Limited and 12 Europe, A.G. operate under the guidance of our main technology subsidiary 12 Hong Kong Limited. Our Micro-Brands operate under the leadership of our U.S. based subsidiary 12 Retail Corporation. For more information about our products, technologies and/or Micro-Brands visit our website at: www.12ReTech.com .\n12 ReTech Corporation is publicly listed in the United States on the OTC Markets under the symbol: RETC.\nSafe Harbor: This document contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended, which are intended to be covered by the safe harbors created thereby. Investors are cautioned that all forward-looking statements involve risks and uncertainty, including without limitation, the ability of the Company to successfully implement its turnaround strategy, changes in costs of raw materials, labor, and employee benefits, as well as general market conditions, competition and pricing. Although the Company believes that the assumptions underlying the forward-looking statements contained herein are reasonable, any of the assumptions could be inaccurate, and therefore, there can be no assurance that the forward-looking statements included in this letter will prove to be accurate. In light of the significant uncertainties inherent in the forward-looking statements included herein, the inclusion of such information should not be regarded as representation by the Company or any other person that the objectives and plans of the Company will be achieved. In assessing forward-looking ", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/aab7d00f-7013-493f-bb91-166efa071f9d", "https://www.globenewswire.com/Tracker?data=u0ScA7SCK_lCBTJuK7kzxpbH-wJ7qHUipV542cMWg9Y_wVAuh_XQBM3ulEQaLFcmJqo3oicQJNqHkdxOCk8IoQ=="], "published": "2018-01-08T17:15:00.000+02:00", "crawled": "2018-01-08T19:06:03.019+02:00", "highlightTitle": ""}