{"organizations": [], "uuid": "60ad56d127c4adf17698afc0230e0feb9520d46c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-time-to-re-engage-with-defensives-idUSL8N1PL2AO", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Time to re-engage with defensives?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T12:31:00.000+02:00", "replies_count": 0, "uuid": "60ad56d127c4adf17698afc0230e0feb9520d46c"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-time-to-re-engage-with-defensives-idUSL8N1PL2AO", "ord_in_thread": 0, "title": "LIVE MARKETS-Time to re-engage with defensives?", "locations": [], "entities": {"persons": [{"name": "danilo masoni", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "vonovia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "deutsche wohnen", "sentiment": "none"}, {"name": "heineken", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "imperial brands", "sentiment": "none"}, {"name": "bnp parib", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 32 AM / in 21 minutes LIVE MARKETS-Time to re-engage with defensives? Reuters Staff 5 Min Read * European shares edge up * STOXX hit 1-week low in previous session * Trump says wants a strong dollar Jan 26 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Danilo Masoni. Reach him on Messenger to share your thoughts on market moves: danilo.masoni.thomsonreuters.com@reuters.net TIME TO RE-ENGAGE WITH DEFENSIVES? (1030 GMT) According to Deutsche Bank strategists, it is. In their latest update they affirm their overweight stance on defensives versus cyclicals and upgrade utilities from benchmark to overweight: \"Defensives have sold off by more than would have been suggested by the rise in bond yields\". That being said they point to property firms Vonovia and Deutsche Wohnen, tobacco group Imperial Brands and beer company Heineken as buy-rating stocks that are beneficiaries of a renewed fall in bond yields. For those who instead believe yields should continue to rise, they highlight BNP Paribas , Credit Suisse, Saint Gobain and AXA. (Danilo Masoni) OPENING SNAPSHOT: EUROPE BOUNCES BACK (0835) European shares have opened higher this morning, bouncing back from a one-week low hit in the previous session, as the euro pulled back from a 3-year high. In corporate news, a well-received update from LVMH a dividend increase at Telia and upbeat broker notes for Michelin and Thales are helping the STOXX 600 index rise 0.3 percent. Here's your opening snapshot: (Danilo Masoni) WHAT YOU NEED TO KNOW BEFORE EUROPE OPENS (0744 GMT) European shares are expected to bounce back on Friday with main stock index futures pointing to gains of around 0.3 percent. Such gains however would not be enough to prevent the STOXX 600 from scoring its first weekly loss this year. Luxury goods makers will be in focus after LVMH said it had made a favourable start to 2018 after a revival in Chinese demand boosted sales last year and spurred on some of its major brands like Louis Vuitton. Its Q4 like-for-like sales were higher than forecast. There were strong results and a bullish forecast from Intel, which could help ease market jitters about semiconductor demand, while Commerzbank could be supported after Handelsblatt reported that Goldman, Barclays and SocGen are interested in buying its EMC division. Eyes also on Zalando and Ocado after big price target increases by RBC. Other stock movers: Telecom Italia deputy chairman gives up operational powers - sources Nestle to cut 400 jobs in France CFM says LEAP engine output 4-5 weeks behind schedule Telia Q4 core profit matches forecasts SSAB Q4 operating profit lags forecast, proposes first dividend since 2012 Givaudan confirms targets after double-digit profit rise BRIEF-Autoliv announces goodwill impairment in Autoliv Nissin Brake (Danilo Masoni and Tom Pfeiffer) EUROPE STOCK FUTURES EDGE UP (0715 GMT) The euro is rising again this morning but remains below the fresh three-year peak of $1.25 hit yesterday, with the dollar recovering following U.S. President Donald Trump's Davos forex \"coup de theatre\". Just one day after his Treasury Secretary Steve Mnuchin sent the dollar plunging, Trump surprised markets by saying in a CNBC interview he \"ultimately\" wanted a strong dollar. You can watch the interview here: goo.gl/iyNhLt The euro pull-back is set to help European shares this morning, with futures on main regional benchmarks all rising around 0.3 percent. (Danilo Masoni) LUXURY GOODS MAKERS IN FOCUS AS LVMH SOUNDS UPBEAT (0643 GMT) Luxury goods makers could be among the stocks to watch today after LVMH said it had made a favourable start to 2018 after a revival in Chinese demand boosted sales last year and spurred on some of its major brands like Louis Vuitton. Here in bullets the key highlights from results at the world's biggest luxury goods maker. * Operating profit up 18 pct in 2017, as expected * Q4 like-for-like sales higher than forecast * Chinese demand continues to boost luxury goods market (Danilo Masoni)", "external_links": [], "published": "2018-01-26T12:31:00.000+02:00", "crawled": "2018-01-26T12:58:33.000+02:00", "highlightTitle": ""}