{"organizations": [], "uuid": "25c6386f518aafa0f22695aea7e57cc2e3420745", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-rexel-usa-announces-plans-for-a-new-organizational-structure-and-regional-alignment.html", "country": "US", "domain_rank": 767, "title": "Rexel USA Announces Plans for a New Organizational Structure and Regional Alignment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-09T18:00:00.000+02:00", "replies_count": 0, "uuid": "25c6386f518aafa0f22695aea7e57cc2e3420745"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-rexel-usa-announces-plans-for-a-new-organizational-structure-and-regional-alignment.html", "ord_in_thread": 0, "title": "Rexel USA Announces Plans for a New Organizational Structure and Regional Alignment", "locations": [], "entities": {"persons": [{"name": "edgar aponte northeas", "sentiment": "none"}, {"name": "scott mclendon", "sentiment": "none"}, {"name": "platt", "sentiment": "none"}, {"name": "jeff baker", "sentiment": "none"}, {"name": "brian mcnally", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "northwest", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "gexpro", "sentiment": "none"}, {"name": "east", "sentiment": "none"}], "organizations": [{"name": "rexel usa", "sentiment": "negative"}, {"name": "rexel usa announces plans", "sentiment": "negative"}, {"name": "rexel north america", "sentiment": "none"}, {"name": "rexel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 9, 2018 /PRNewswire/ -- Rexel USA announced a new regional alignment that supports the strong presence of Platt, Rexel C+I and Gexpro in 9 regions across the USA. The new alignment better serves customers by promoting collaboration and increasing the speed of decision-making close to the customer. The new nine region alignment sharpens focus on the top priorities of driving growth in active customers, increasing the number of SKUs sold, and boosting digital presence and connected customers.\nEffective January 1, 2018, nine regions within the U.S. will be aligned under the leadership of Jeff Baker in the West and Scott McLendon in the East, both reporting to Brian McNally, Executive Vice President and CEO of Rexel North America.\nEach Region President will have responsibility for the branches of all three banners (Gexpro, Rexel C+I and Platt) within their region while each local branch will continue to operate under their current brand. The new Regions and Region President appointments are as follows:\nWEST – Jeff Baker\nEAST – Scott McLendon\nNorthwest – Edgar Aponte\nNortheast – Pat Davis\nNorth California – Dave Mahoney\nSoutheast – Shawn Mumma\nSouth California – Mike Hanna\nFlorida – Jackie Faulk\nMountain Plains – Eric Packer\nGulf Central – Bill Boykin\nMidwest – Matt Holt\nRexel Automation will remain under the leadership of Mark Daniel and will contribute to each region's sales efficiency. The Automation APRs will continue to support the industrial and OEM customers with automation solutions, services and support and fit into the new regions for improved collaboration.\n\"The adoption of our new regions is an important milestone for Rexel USA,\" says McNally. \"This is a growth story that builds on the significant investment we made in 2017. This will allow our team to be nimbler to assure fast execution of customer needs across residential, commercial, and industrial customers with the combined proximity model, project support and specialty businesses. This agile approach will not only increase the speed of decision-making, but also get us closer to our customers while allowing our local teams to more effectively deploy resources to support customers. I am confident that our Region Presidents will lead their respective regions in exceeding goals, while collaborating together to better serve customers. They will develop a consistent offer plan that will improve inventory availability and customer service, allowing our customers to receive the highest level of support.\"\nPatrick Berard, CEO of the Rexel Group states: \"This evolution in our sales and marketing approach will allow us to develop faster and more efficiently our proximity model, our project capabilities and our specialist approach. This new organization will see the alignment and deployment of our digital strategy. This evolution is more than simply a legal merger of entities; it removes past obstacles to growth and creates an opportunity to transform every customer into a multi-banner account and to optimize our network capabilities.\"\nABOUT REXEL USA:\nRexel USA is an expert in the multichannel professional distribution of products and services for the energy world. It addresses three main markets - residential, commercial and industrial. Rexel USA supports its residential, commercial and industrial customers by providing a tailored and scalable range of products and services in energy management for construction, renovation, production and maintenance.\nIn addition to the online store, Rexel USA has a distribution network of over 180 warehouse storefront locations throughout the U.S. where you can find what you need for your specific electrical projects as well as product expertise from our staff. Its unique range of electrical supplies and decades-long, proven service track record have led professionals like you nationwide to choose us as their go-to electrical supply partner. Learn more at www.rexel.com .\nContact:\nEd Wyzykowski\nRexel USA 905-568-5011\ned.wyzykowski@rexel.ca\nwww.rexel.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/rexel-usa-announces-plans-for-a-new-organizational-structure-and-regional-alignment-300579275.html\nSOURCE Rexel USA", "external_links": ["http://www.rexel.com/", "http://www.prnewswire.com/news-releases/rexel-usa-announces-plans-for-a-new-organizational-structure-and-regional-alignment-300579275.html"], "published": "2018-01-09T18:00:00.000+02:00", "crawled": "2018-01-09T18:54:51.021+02:00", "highlightTitle": ""}