{"organizations": [], "uuid": "3c729505490b93346b90eb2dce70fc77becca835", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-nairobi-climatechange-temperature/as-slums-face-heat-extremes-i-feel-really-scared-residents-say-idUSKBN1F127B", "country": "US", "domain_rank": 408, "title": "As slums face heat extremes, 'I feel really scared,' residents say", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T01:29:00.000+02:00", "replies_count": 0, "uuid": "3c729505490b93346b90eb2dce70fc77becca835"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-nairobi-climatechange-temperature/as-slums-face-heat-extremes-i-feel-really-scared-residents-say-idUSKBN1F127B", "ord_in_thread": 0, "title": "As slums face heat extremes, 'I feel really scared,' residents say", "locations": [], "entities": {"persons": [{"name": "anna scott", "sentiment": "none"}], "locations": [{"name": "nairobi", "sentiment": "none"}, {"name": "mathare", "sentiment": "none"}, {"name": "mathari hospital", "sentiment": "none"}, {"name": "kibera", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "nairobi", "sentiment": "negative"}, {"name": "johns hopkins university", "sentiment": "none"}, {"name": "john hopkins university", "sentiment": "none"}, {"name": "kenya meteorological department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NAIROBI (Thomson Reuters Foundation) - At Mathari Hospital, flanking Nairobi’s Mathare slum, a grandmother waits in line to see a doctor, struggling to calm the crying baby in her arms.\n“It’s the heat rashes,” she tells a nurse, rolling off a linen cloth covering the baby’s inflamed skin, before she’s ushered in to see a doctor.\nAs climate change brings more heat extremes around the world, cities are facing particular problems – and slums are particularly strongly affected in many places, scientists say.\nIn Nairobi, for instance, summer temperatures in Kibera, Mathare and Mukuru slums are often higher than in other parts of the city, a study by scientists at Johns Hopkins University found.\nPeak summer temperatures in all three slums were more than 4 degrees Fahrenheit higher than those recorded at the Kenya Meteorological Department offices, in a wooded area about a half mile from Kibera, the city’s largest slum, the scientists said.\n“The slums are hotter because of lack of trees and vegetation,” said Anna Scott, a climate scientist from John Hopkins University and a lead author of the study, in an email interview.\nPoor construction materials and, in some cases. lower elevation, also contribute to the warming in the slums, she said.\n“Our study suggests that this problem (temperature rise) is not likely to get better in the future unless changes in building and urban design standards are applied,” she said.\nResidents of Nairobi’s slums say the rising temperatures are an increasingly noticeable problem.\nSteve Ochieng’, who works with a waste management group in Kibera, told the Thomson Reuters Foundation that he believes thin roofing materials - such as tin - and overcrowding are adding to heat problems in homes there.\nWhen temperatures last February peaked at 32 degrees Celsius – well above normal Nairobi highs - at his tin-roofed home, “I got really scared because I was feeling like the sun was just above our heads,” he said.\n“I started thinking the biblical end days had come where sinners would be destroyed with fire,” he said.\nOLD AND YOUNG AT RISK Hotter temperatures particularly hurt some of the slum’s most vulnerable people, who may be confined to poorly ventilated homes, said George Ndung’u Kamau, an officer with Helpage International, an international charity that assists older people.\n“People who are not able to move about like the elderly and children are adversely affected by heat related stress,” Ndung’u Kamau said.\nThat burden is particularly a problem in slums, the social protection officer said, because a larger number of households there are headed by older people, who may be watching grandchildren as parents work elsewhere.\nDrinking lots of water can help cut the risks from extreme heat, experts say. But tainted water supplies in some slums also can mean more people fall ill when the heat rises and families look for drinking water where they can, Ochieng’ said.\nHot summer weather can be be good news for some people, such as Solomon Miundo, an artist in Kibera who sells T-shirts, post cards and other products.\n“I sell more artifacts during summer because this is the time tourists like to visit slums,” said the artist, who also goes by the trade name Solo Seven.\nBut after a particularly hot 2017, “I have been asking myself why there is too much sun and less rain,” he said.\nSlum residents say one way to deal with the worsening heat would be to plant more trees.\n“People should plant a lot of trees because it enables air circulation, attracts rains and brings shade,” said Mohamed Abdullahi, a Kibera resident. Waste sites in slums, in particular, could be planted to trees, he said.\nKenneth Okoth, a Member of Parliament for the Kibera constituency, said he fears rising heat may boost other threats in Nairobi’s slums as well.\n“When it is too hot in the house, the youth move out to open spaces where it is cooler,” Okoth said. In some cases, that might lead to increases in crime, he said.\nHowever, he said, his office is working with local and international non-governmental organizations to build more modern homes in slums that can better withstand rising temperatures.\nReporting by Kagondu Njagi; editing by Laurie Goering :; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/climate\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://news.trust.org/climate"], "published": "2018-01-13T01:29:00.000+02:00", "crawled": "2018-01-13T14:43:25.000+02:00", "highlightTitle": ""}