{"organizations": [], "uuid": "8b434c60bd374e8a8528bd92b1ba287617007f68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-win-promotes-two-industry-veterans-to-new-leadership-roles.html", "country": "US", "domain_rank": 767, "title": "WIN Promotes Two Industry Veterans to New Leadership Roles", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-17T18:30:00.000+02:00", "replies_count": 0, "uuid": "8b434c60bd374e8a8528bd92b1ba287617007f68"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-win-promotes-two-industry-veterans-to-new-leadership-roles.html", "ord_in_thread": 0, "title": "WIN Promotes Two Industry Veterans to New Leadership Roles", "locations": [], "entities": {"persons": [{"name": "andrew maier", "sentiment": "none"}, {"name": "brian hough", "sentiment": "none"}, {"name": "hough", "sentiment": "none"}, {"name": "maier", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "new leadership roles burr ridge", "sentiment": "none"}], "organizations": [{"name": "rf industries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BURR RIDGE, Ill., Jan. 17, 2018 /PRNewswire/ -- Wireless Information Networks (WIN), a leading distributed antenna systems (DAS) and smart building integrator, announced two promotions today: Andrew Maier to president and Brian Hough to vice president of sales. The two will provide strategic guidance as WIN continues to evolve the enterprise market and engage new verticals.\nMaier began his career at WIN as a radio frequency technician 17 years ago. After a strong start, a move into operations started him on the path to the leadership role he now holds. As president, Maier will run the day-to-day operations of the organization and focus on business growth, particularly directing the creation of multiple design and funding options for prospects.\nLike Maier, Hough has been in the industry for 17 years, but came on board at WIN in 2017. Previously, he was senior VP of sales and marketing for RF Industries, focusing on demand creation and new product development for emerging markets. As WIN's vice president of sales, Hough will focus on leading the expansion into new verticals and structuring the company for scalability.\n\"Maier and Hough represent what we're most proud of as an organization: deep expertise in the industry and a flexible, forward-looking perspective,\" said CEO Thomas Crotty. \"My new role, with Andrew at the helm as president, will be to grow WIN inorganically via mergers, acquisitions and joint ventures. Both Maier and Hough have already contributed greatly to our company's growth and evolution, especially recently, and I look forward to watching the company continue to progress under their leadership.\"\nFor more information about WIN and its DAS solutions, visit winconnectivity.com or call 630.325.6254.\nAbout Wireless Information Networks\nWIN is the nation's leading provider of indoor distributed antenna system (DAS) solutions for high-rises. For nearly 20 years, WIN has solved connectivity challenges for major mobile network carriers and enterprises up to 20,000 employees. They are experts at helping clients overcome radio frequency (RF) obstructions and customizing DAS solutions for enhanced cellular technologies. They are the only provider who offers a 100% guarantee of ubiquitous coverage in the segments they are hired to address. Learn more at winconnectivity.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/win-promotes-two-industry-veterans-to-new-leadership-roles-300583624.html\nSOURCE Wireless Information Networks", "external_links": ["http://www.prnewswire.com/news-releases/win-promotes-two-industry-veterans-to-new-leadership-roles-300583624.html", "http://www.winconnectivity.com/"], "published": "2018-01-17T18:30:00.000+02:00", "crawled": "2018-01-17T19:03:18.041+02:00", "highlightTitle": ""}