{"organizations": [], "uuid": "fbad05867ee221742933193471bdd6eef3323594", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-argentina-humantrafficking/denial-then-defiance-former-sex-slave-in-argentina-fights-for-justice-idUSKBN1FB2BO", "country": "US", "domain_rank": 408, "title": "Denial then defiance: Former sex slave in Argentina fights for justice", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.995, "site_type": "news", "published": "2018-01-23T00:57:00.000+02:00", "replies_count": 0, "uuid": "fbad05867ee221742933193471bdd6eef3323594"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-argentina-humantrafficking/denial-then-defiance-former-sex-slave-in-argentina-fights-for-justice-idUSKBN1FB2BO", "ord_in_thread": 0, "title": "Denial then defiance: Former sex slave in Argentina fights for justice", "locations": [], "entities": {"persons": [{"name": "alika kinan", "sentiment": "none"}, {"name": "kinan", "sentiment": "none"}], "locations": [{"name": "argentina", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}, {"name": "ushuaia", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOGOTA (Thomson Reuters Foundation) - Enslaved and trapped in a brothel for six years in the southern Argentine port city of Ushuaia, Alika Kinan was beaten and forced to have sex with up to 30 clients a night.\nBut when police raided the ‘Sheik’ street brothel in the center of the resort city in a rescue operation in 2012, Kinan’s immediate reaction was one of denial and dismay.\nShe didn’t recognize herself as a victim. Instead she tried to defend her pimps and her work.\n“It was a short-lived Stockholm syndrome,” Kinan, now 41, said. “I never thought I was a victim of human trafficking. I thought I was working,” she told the Thomson Reuters Foundation.\nIt was only after her rescue when speaking to state prosecutors about her ordeal did Kinan realize she had fallen prey to a sex trafficking ring.\n“At first, I denied seeing myself as a victim. I denied any help. But when I heard myself speaking out loud I realized it wasn’t okay,” Kinan said.\n“To recognize one is a victim is to recognize pain, to recognize the abuse suffered during childhood. No one wants to admit one is a victim.”\nMore than five years on, Kinan has turned anger and denial into a quest for justice. She became the first trafficking victim in Argentina to take her pimps and authorities to court, filing a simultaneous civil and criminal lawsuit against them.\nENTRAPMENT When she was a teenager, Kinan said her mother abandoned her leaving her to take sole care of her younger sister.\nDesperate and hungry, Kinan said a friend knew of a woman who was offering a waitress job in a bar and who would pay for her flight to get there, about 2,000 miles (3,200 km) away from her hometown in Cordoba province.\n“Like thousands of women in Argentina, I was pushed into this because of hunger. You don’t have a choice when you don’t have any options,” Kinan said.\nBut when Kinan arrived aged 19 to the ‘Sheik’ brothel, disguised as a dance club surrounded by barbed wire, Kinan was told she had ran up a debt and her documents were taken away.\n“The brothel owners wanted 25 women there at all times. Thousands were trafficked there over the years, including under-age girls,” Kinan said.\nJUSTICE? The most common form of human trafficking in Argentina is women and girls forced into the sex trade, according to the government’s anti-trafficking agency, PROTEX.\nThis includes vulnerable migrant women from the poorer neighboring countries of Paraguay and Bolivia and the Dominican Republic, lured by traffickers with false promises of work and then trapped into sex slavery.\nFew victims get justice.\nAbout 11,000 victims have been rescued by authorities since Argentina’s 2008 anti-trafficking law was enacted, but only 220 convictions for human trafficking were handed down between 2009 to 2014, according to latest PROTEX figures.\nMore than four in every five convictions involved women being sexual exploited mostly in bars, cabaret and night clubs across Argentina.\nKinan pursued her case, and in 2016 her three alleged traffickers - the brothel manger, owner and his wife - were convicted of human trafficking and given between 3 to 7-year prison sentences and fined.\nHowever, they appealed the conviction with a decision from the court expected this year, Kinan said.\nUndeterred, Kinan brought additional charges against three more people who she says recruited women to work at the ‘Sheik’ brothel in a case that is still ongoing.\nAs part of the civil lawsuit, a court in 2016 ordered the municipality of Ushuaia and traffickers to pay Kinan about $50,000 in damages - the first time the government has been ordered to pay compensation to a victim of human trafficking in Argentina, according to local media and PROTEX.\nBut Kinan, a mother of six children, says she has yet to receive any compensation.\n“I’ll keep fighting, not just for me and my children but for other women. It’s about vindicating your rights,” she said.\nReporting by Anastasia Moloney @anastasiabogota, Editing by Ros Russell.; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T00:57:00.000+02:00", "crawled": "2018-01-23T17:56:54.005+02:00", "highlightTitle": ""}