{"organizations": [], "uuid": "7eaee7eb567550bb7b1e13170c6b18abe0c07b29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/dermapharm-ipo/update-1-drugmaker-dermapharm-gears-up-for-likely-first-german-ipo-of-2018-idUSL8N1PA3J0", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Drugmaker Dermapharm gears up for likely first German IPO of 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:24:00.000+02:00", "replies_count": 0, "uuid": "7eaee7eb567550bb7b1e13170c6b18abe0c07b29"}, "author": "", "url": "https://www.reuters.com/article/dermapharm-ipo/update-1-drugmaker-dermapharm-gears-up-for-likely-first-german-ipo-of-2018-idUSL8N1PA3J0", "ord_in_thread": 0, "title": "UPDATE 1-Drugmaker Dermapharm gears up for likely first German IPO of 2018", "locations": [], "entities": {"persons": [{"name": "oddo", "sentiment": "none"}, {"name": "berenberg", "sentiment": "none"}, {"name": "dermapharm", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "siemens", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "healthineers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 2:24 PM / Updated 25 minutes ago UPDATE 2-Drugmaker Dermapharm gears up for likely first German IPO of 2018 Reuters Staff \n* To raise about 100 mln euros in fresh capital \n* Owner to sell some shares \n* Targets free float of 25 pct \n* To be valued at 1.5-1.75 bln euros after IPO (Adds details on full IPO pipeline expected this year) \nFRANKFURT, Jan 15 (Reuters) - German drugmaker Dermapharm is preparing for an initial public offering (IPO), probably stealing a march on much larger Siemens’ healthcare unit Healthineers as the first stock market flotation in Germany this year. \nDermapharm, which makes generic drugs, cosmetics, dietary products and medical devices, said on Monday it aimed to raise about 100 million euros ($122 million) in fresh capital to fund growth during an IPO in the first half of 2018. \nThe family owners will also sell shares, and after the IPO 25 percent of the company will be in the hands of public investors, Dermapharm said. \nAccording to estimates from analysts of the banks organising the IPO - Berenberg and Oddo - the company could be valued at 1.5 billion to 1.75 billion euros after the deal has been completed. \nPrivately held Dermapharm is targeting earnings before interest, tax, depreciation and amortization of 139 million euros sales on sales of 562 million euros this year, according to the analysts. \nGeneric drugmakers such as Stada, Hikma, Richter Gedeon and Almirall trade at 8 to 14 times their expected core earnings. \nPeople familiar with the matter told Reuters last week that Dermapharm was planning to list before the Easter holidays. \nThat will likely make it Germany’s first stock market listing of 2018, which is expected to become a blockbuster year for IPOs, the people added. \nSiemens’s Healthineers unit is expected to float in March, with brake systems maker Knorr-Bremse and Deutsche Bank’s asset management arm DWS following on its heels. \nPublisher SpringerNature, home shopping TV network HSE24 as well as residential property developer Instone and caravan maker Knaus Tabbert may also list on the stock exchange this year. \nDermapharm founder Wilhelm Beier cancelled a sale of the company to a private equity group in 2016. At the time, BC Partners and Nordic Capital had vied to take control of the group. \nDermapharm makes treatments against skin diseases, insect bites and hair loss, as well as allergy drugs and Tiroler Nussoel-branded sun tan lotion. $1 = 0.8185 euros Reporting by Ludwig Burger and Hans Seidenstücker; Editing by Douglas Busvine, Gareth Jones and David Evans", "external_links": [], "published": "2018-01-15T16:24:00.000+02:00", "crawled": "2018-01-15T16:53:54.001+02:00", "highlightTitle": ""}