{"organizations": [], "uuid": "c7be967695e8cc2ce6e592ca8f9efdcfb5bbfa56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225074367&w=1200&r=LYNXMPEE0O0DJ", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-davos-meeting-qatar/qatar-says-world-cup-on-track-despite-boycott-as-supply-lines-fixed-idUSKBN1FE0TH", "country": "US", "domain_rank": 408, "title": "Qatar says World Cup on track despite boycott as supply lines fixed", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T10:28:00.000+02:00", "replies_count": 0, "uuid": "c7be967695e8cc2ce6e592ca8f9efdcfb5bbfa56"}, "author": "", "url": "https://www.reuters.com/article/us-davos-meeting-qatar/qatar-says-world-cup-on-track-despite-boycott-as-supply-lines-fixed-idUSKBN1FE0TH", "ord_in_thread": 0, "title": "Qatar says World Cup on track despite boycott as supply lines fixed", "locations": [], "entities": {"persons": [{"name": "yara bayoumy", "sentiment": "none"}, {"name": "mohammed bin abdulrahman al thani", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "dmitry zhdannikov editing", "sentiment": "none"}, {"name": "jeremy gaunt", "sentiment": "none"}, {"name": "dmitry zhdannikov", "sentiment": "none"}], "locations": [{"name": "qatar", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 8:29 AM / Updated 28 minutes ago Qatar says World Cup on track despite boycott as supply lines fixed Dmitry Zhdannikov , Yara Bayoumy 5 Min Read \nDAVOS, Switzerland (Reuters) - Qatar’s preparations for the 2022 soccer World Cup are fully on track after a boycott by its Gulf neighbors briefly disrupted fixed supply lines last year, its foreign minister told Reuters. \nSheikh Mohammed bin Abdulrahman Al Thani, who is also deputy prime minister, said Qatar’s economy was now growing much faster than anticipated and the huge gas exporter was well prepared to withstand the crisis in relations with its neighbors. \nHe also said Qatar was still counting on strong support from U.S. President Donald Trump to help solve the crisis and had filed legal complaints with Western regulators against what it sees as currency and market manipulations by its neighbors. \n“We are confident we will host the best World Cup in the Arab world. It will represent the whole Arab region,” Sheikh Mohammed said in an interview during the World Economic Forum in Davos. \n“The government has already overcome the disruptions which happened to supplies at the beginning of the crisis and we have introduced alternative routes. There is no disruption at the moment,” he said, adding he had heard no signals from FIFA that it was planning to change the venue of the World Cup. \nThe diplomatic crisis, in which Saudi Arabia, Bahrain, the United Arab Emirates and Egypt have boycotted Qatar, erupted last summer when the four countries cut diplomatic, transport and trade ties with Qatar, accusing it of financing terrorism. \nRiyadh also accuses Qatar of cosying up to the kingdom’s arch-rival Iran. Qatar rejects the charges and says it is being punished for straying from its neighbors’ backing for authoritarian rulers. SECURITY UNDERMINED \nSheikh Mohammed said the crisis was negatively affecting security coordination across the entire Gulf region. \n“This undermines our collective effort in combating terrorism. Our officers are not allowed to go to the (U.S.) Fifth Fleet, their (Saudi and UAE) officers’ seats are vacant in Doha while their flags are there,” he said, referring to the U.S. Navy in the Gulf and the U.S. base near Doha. \nQatar and Saudi Arabia have both been among the closest allies of the United States but all attempts by Washington to help solve the crisis have so far failed. Qatar's Foreign Minister Sheikh Mohammed bin Abdulrahman Al Thani in Doha, Qatar October 22, 2017. REUTERS/Alex Brandon/Pool \n“When President (Donald Trump) spoke to the Emir (of Qatar Sheikh Tamim bin Hamad Al Thani) last week he stressed this point and he said that he wants to help in solving the crisis”. \n“But when one of the parties is unwilling to engage... then it will be difficult... We don’t see yet a willingness from their side as we are seeing the escalation and the provocation from time to time is ongoing,” said Sheikh Mohammed. \nQatar filed a complaint to the United Nations about an alleged violation of its airspace in December by an Emirati military aircraft. \nSheikh Mohammed said Qatar’s central bank had also filed legal complaints with Western regulators regarding alleged manipulations of its currency. \n“The information we had that there is something wrong being committed within our financial markets and these complaints are taking their due process and there are legal steps Qatar is taking,” he said. \nSheikh Mohammed said one of his main worries was a direct conflict between Saudi Arabia and Iran. \n“Qatar is just a sandwich between them. And this means that any direct conflict between Iran and Saudi will have a spill over not only on Qatar but on the entire region”. \nQatar’s economy has been growing faster than expected despite the boycott and Sheikh Mohammed said Qatar’s sovereign wealth fund, one of the world’s largest, was expanding investments abroad despite expectations it would shrink and divest. \n“We have built strong resilience, we are opening up new trade lines, we have built a new port,” he said. “Our investment fund is seeking new investment opportunities... and tapping new continents. We have plans for Africa, which we will launch soon, and next year we have plans for the Central Asian region.” \nIf the dialogue with its neighbors resumes, the countries should work out a new strategy for co-existence as part of the so-called Gulf Cooperation Council (GCC), he said. \n“We need to come up with new principles for the GCC countries that respect each other’s sovereignty, that stop interfering in each other’s affairs and identify the areas where we can collaborate”. Editing by Jeremy Gaunt and Gareth Jones", "external_links": [], "published": "2018-01-25T10:28:00.000+02:00", "crawled": "2018-01-25T10:47:09.027+02:00", "highlightTitle": ""}