{"organizations": [], "uuid": "24d3e2d8637ce4a418f980627c240ff9e9bcbde7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-barnes-roberts-joins-the-focal-point-llc.html", "country": "US", "domain_rank": 767, "title": "Barnes & Roberts Joins The Focal Point LLC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-09T21:03:00.000+02:00", "replies_count": 0, "uuid": "24d3e2d8637ce4a418f980627c240ff9e9bcbde7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-barnes-roberts-joins-the-focal-point-llc.html", "ord_in_thread": 0, "title": "Barnes & Roberts Joins The Focal Point LLC", "locations": [], "entities": {"persons": [{"name": "scott hilton", "sentiment": "none"}, {"name": "corey golde", "sentiment": "none"}, {"name": "andrew spingler", "sentiment": "none"}, {"name": "chris ritter", "sentiment": "none"}, {"name": "jason barnes", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "focal point llc oakland", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "focal point llc", "sentiment": "negative"}, {"name": "barnes & roberts", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OAKLAND, Calif., Jan. 9, 2018 /PRNewswire/ -- Barnes & Roberts and The Focal Point LLC announced this week their decision to join forces. Jason Barnes will be a key member of the senior management team, joining the partnership, which includes Andrew Spingler, Scott Hilton, Chris Ritter, and Corey Golde. The combined company will do business as The Focal Point LLC.\nBoth companies are leaders in the field of trial consulting. Their reputations were built on their abilities to develop powerful case themes and courtroom strategies. Barnes & Roberts is renowned for its state-of-the-art courtroom visual displays. The Focal Point, likewise known for innovative courtroom demonstratives, is at the forefront of the jury consulting arena.\nThe merger enables the companies to provide clients with even more talent, more courtroom strategies and, ultimately, more powerful case presentations. It empowers both companies to increase their national presence and better staff cases.\nBarnes & Roberts was established in 1998 in Dallas, Texas. Its founder, Jason Barnes, is widely known as a pioneer in the electronic trial graphics revolution. Through the years, the firm has stayed ahead and, indeed, driven new courtroom technologies. This merger represents the next milestone in this company's quest to provide even stronger service to its clients.\n\"The Focal Point is a team of all-stars; we couldn't be happier to join the roster,\" said Jason Barnes, former partner of Barnes & Roberts. \"We became friends based on our shared values and experiences. We became partners based on our shared, unwavering commitment to client success.\"\n\"Barnes & Roberts is the perfect match with The Focal Point to enable us to expand and refine services for our clients,\" said Chris Ritter, partner at The Focal Point. \"When you are faced with large litigation, you put together the best team of lawyers. We have put together the best team of consultants. Why not bring these teams together?\"\nThe firms have worked on large, high-profile litigation, including complex commercial disputes, securities, intellectual property, white collar defense, criminal, environmental, and employment matters. Notable cases: SEC v. Mark Cuban, ContentGuard v. Google, DataTreasury v. Wells Fargo, Bank of America, et al., Alcatel-Lucent v. Microsoft, Texas ex rel Allen Jones v. Janssen, Johnson & Johnson, et al., Multimedia Patent Trust v. Apple, AT&T v. TiVo, United States v. FedEx Corporation, Microsoft v. Google, the Chevron-Ecuador International Arbitration Matters, Oracle v. Google, In re Deepwater Horizon Litigation, Colorado v. Kobe Bean Bryant, and Personal Audio v. CBS, NBC, and FOX.\nAbout The Focal Point\nEstablished almost 30 years ago, The Focal Point is the premier provider of litigation consulting and visual strategies to the legal community nationwide. It utilizes perpetual innovation, strategic thinking, and cutting-edge technology to create a courtroom environment in which arguments are focused and communication is enhanced. The Focal Point develops winning presentations designed for maximum impact on the decision makers in a court case. Its offices are located in Chicago, Dallas, New York, and Oakland, CA.\nFor questions or to learn more, please visit our website at www.thefocalpoint.com or follow us on LinkedIn .\nView original content: http://www.prnewswire.com/news-releases/barnes--roberts-joins-the-focal-point-llc-300579916.html\nSOURCE The Focal Point, LLC", "external_links": ["https://www.linkedin.com/company/85719/", "http://www.thefocalpoint.com/", "http://www.prnewswire.com/news-releases/barnes--roberts-joins-the-focal-point-llc-300579916.html", "http://www.brtrial.com/"], "published": "2018-01-09T21:03:00.000+02:00", "crawled": "2018-01-09T23:51:11.005+02:00", "highlightTitle": ""}