{"organizations": [], "uuid": "8a2a580d68338c420fdd0baa4cc5b5fae1d1fbd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-preit-schedules-fourth-quarter-2017-earnings-release-and-conference-call.html", "country": "US", "domain_rank": 767, "title": "PREIT Schedules Fourth Release and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-19T00:30:00.000+02:00", "replies_count": 0, "uuid": "8a2a580d68338c420fdd0baa4cc5b5fae1d1fbd1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-preit-schedules-fourth-quarter-2017-earnings-release-and-conference-call.html", "ord_in_thread": 0, "title": "PREIT Schedules Fourth Release and Conference Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "pennsylvania real estate investment trust", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Pennsylvania Real Estate Investment Trust (PREIT/NYSE: PEI) intends to release its financial results for the quarter ending December 31, 2017 after market trading closes on Wednesday, February 14, 2018.\nManagement has scheduled a conference call for 11:00 a.m. Eastern Time on Thursday,\nFebruary 15, 2018, to review the Company's results and future outlook. To listen to the call, please dial 1-866-393-4306 (domestic toll free), or 1-734-385-2616 (international), and request to join the PREIT call, Conference ID 1081847, at least five minutes before the scheduled start time. Investors can also access the call in a \"listen only\" mode via the internet at the Company's website, preit.com . Please allow extra time prior to the call to visit the site and download the necessary software to listen to the Internet broadcast. Financial and statistical information expected to be discussed on the call will also be available on the Company's website. For best results when listening to the webcast, the Company recommends using Flash Player.\nFor interested individuals unable to join the conference call, the online archive of the webcast will also be available for one year following the call.\nAbout PREIT\nPREIT (NYSE:PEI) is a publicly traded real estate investment trust that owns and manages quality properties in compelling markets. PREIT's robust portfolio of carefully curated retail and lifestyle offerings mixed with destination dining and entertainment experiences are located primarily in the densely-populated eastern U.S. with concentrations in the mid-Atlantic's top MSAs. Since 2012, the Company has driven a transformation guided by an emphasis on portfolio quality and balance sheet strength driven by disciplined capital expenditures. Additional information is available at www.preit.com or on Twitter or LinkedIn .\nForward-Looking Statements\nThis press release, together with other statements and information publicly disseminated by us, contain certain \"forward-looking statements\" within the meaning of the federal securities laws. Forward-looking statements relate to expectations, beliefs, projections, future plans, strategies, anticipated events, trends and other matters that are not historical facts. When used, the words \"anticipate,\" \"believe,\" \"estimate,\" \"target,\" \"goal,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"result,\" \"should,\" \"will,\" and similar expressions, which do not relate solely to historical matters, are intended to identify forward looking statements. We caution investors that any forward looking statements presented in this presentation and the documents that we may incorporate by reference into this document are based on management's beliefs and assumptions made by, and currently available to management. These forward-looking statements reflect our current views about future events, achievements or results and are subject to risks, uncertainties and changes in circumstances that might cause future events, achievements or results to differ materially from those expressed or implied by the forward-looking statements. In particular, our business might be materially and adversely affected by uncertainties affecting real estate businesses generally as well as the following, among other factors: changes in the retail and real estate industries, including consolidation and store closings, particularly among anchor tenants; our ability to maintain and increase property occupancy, sales and rental rates, in light of the relatively high number of leases that have expired or are expiring in the next two years; increases in operating costs that cannot be passed on to tenants; current economic conditions and the state of employment growth and consumer confidence and spending, and the corresponding effects on tenant business performance, prospects, solvency and leasing decisions and on our cash flows, and the value and potential impairment of our properties; the effects of online shopping and other uses of technology on our retail tenants; risks related to our development and redevelopment activities; acts of violence at malls, including our properties, or at other similar spaces, and the potential effect on traffic and sales; our ability to identify and execute on suitable acquisition opportunities and to integrate acquired properties into our portfolio; our partnerships and joint ventures with third parties to acquire or develop properties; concentration of our properties in the Mid-Atlantic region; changes in local market conditions, such as the supply of or demand for retail space, or other competitive factors; changes to our corporate management team and any resulting modifications to our business strategies; our ability to sell properties that we seek to dispose of or our ability to obtain prices we seek; potential losses on impairment of certain long-lived assets, such as real estate, or of intangible assets, such as goodwill, including such losses that we might be required to record in connection with any dispositions of assets; our substantial debt and liquidation preference of our preferred shares and our high leverage ratio; constraining leverage, unencumbered debt yield, interest and tangible net worth covenants under our principal credit agreements; our ability to refinance our existing indebtedness when it matures, on favorable terms or at all; our ability to raise capital, including through joint ventures or other partnerships, through sales of properties or interests in properties, through the issuance of equity or equity-related securities if market conditions are favorable, or through other actions; our short- and long-term liquidity position; potential dilution from any capital raising transactions or other equity issuances; and general economic, financial and political conditions, including credit and capital market conditions, changes in interest rates or unemployment.\nAdditional factors that might cause future events, achievements or results to differ materially from those expressed or implied by our forward-looking statements include those discussed herein and in our Annual Report on Form 10-K for the year ended December 31, 2016 in the section entitled \"Item 1A. Risk Factors.\" We do not intend to update or revise any forward-looking statements to reflect new information, future events or otherwise.\nCONTACT: AT THE COMPANY\nHeather Crowell\nSVP, Corporate Communications and Investor Relations\n(215) 454-1241\nHeather.crowell@preit.com\n with multimedia: releases/preit-schedules-fourth-quarter-2017-earnings-release-and-conference-call-300584887.html\nSOURCE PREIT", "external_links": ["http://www.linkedin.com/company/32781?trk=tyah", "https://twitter.com/preit", "http://www.preit.com/", "http://www.prnewswire.com/news-releases/preit-schedules-fourth-quarter-2017-earnings-release-and-conference-call-300584887.html"], "published": "2018-01-19T00:30:00.000+02:00", "crawled": "2018-01-19T00:20:57.015+02:00", "highlightTitle": ""}