{"organizations": [], "uuid": "a24e065f0e74c66c3a795d9f0b27b29c07d72b3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-bsh-hausgerate-gmbh-acquires-majority-stake-in-kitchen-stories-global-food-platform.html", "country": "US", "domain_rank": 767, "title": "BSH Hausgeräte GmbH Acquires Majority Stake in Kitchen Stories Global Food Platform", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-08T17:15:00.000+02:00", "replies_count": 0, "uuid": "a24e065f0e74c66c3a795d9f0b27b29c07d72b3e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-bsh-hausgerate-gmbh-acquires-majority-stake-in-kitchen-stories-global-food-platform.html", "ord_in_thread": 0, "title": "BSH Hausgeräte GmbH Acquires Majority Stake in Kitchen Stories Global Food Platform", "locations": [], "entities": {"persons": [], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "bsh hausgeräte gmbh acquires majority stake", "sentiment": "negative"}, {"name": "bsh hausgeräte gmbh", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "With this strategic investment in digital services, BSH is on track to become an integrated hardware, software and service provider.\nBSH Hausgeräte GmbH has acquired approximately 65 percent of the global food platform Kitchen Stories Gradual integration of the food platform into the digital Home Connect ecosystem will bring new added value for Home Connect consumers and Kitchen Stories users in 150 countries, including the United States The two companies will develop their digital offerings related to recipes and cooking\nIRVINE, Calif., Jan. 08, 2018 (GLOBE NEWSWIRE) -- As part of its heightened focus on becoming the leading provider of connected hardware and digital services in the home appliance industry, BSH Hausgeräte GmbH has acquired approximately 65 percent of the global food platform Kitchen Stories . Kitchen Stories offers high-quality videos and photo guides that provide step-by-step help with recipes for spare-time cooks and ambitious amateur chefs, and the app has been downloaded some 15 million times worldwide. The BSH acquisition of a majority stake in Kitchen Stories will expand the company’s worldwide products and services related to recipes and smart cooking, especially within the Home Connect digital ecosystem. The investment highlights BSH’s ambition to become the leading provider of connected hardware and digital services in the home appliance industry.\nDigitalization and connectivity are blurring the lines more and more between hardware, software and digital services for consumers. “We’re seeing a big change in the home appliance industry. Our consumers want integrated, connected, fun-to-use solutions that make their everyday routine easier and more rewarding,” said Karsten Ottenberg, Chairman of the BSH Management Board. “As a global leader in the home appliance industry, we are increasingly advancing innovations ourselves, as well as looking for fresh ideas from outside to enhance our offerings. To this end, we are seeking out suitable partners and business models to offer consumers and users new experiences that live up to the quality promise of our successful brands also in the connected kitchen.”\nBerlin startup Kitchen Stories was founded in 2013 by Mengting Gao and Verena Hubertz. Their vision was to apply innovative technologies and high-quality video content to enable any user of Kitchen Stories to follow recipes and prepare meals at home. Kitchen Stories deliberately takes a global approach, so that the platform can combine a diversity of international cuisines with an ongoing dialogue on the subject of cooking.\nWith this acquisition, Kitchen Stories will operate as an independent brand within the BSH Group. Investments will go primarily to further technical development of the platform. “We have a clear goal in mind – to make Kitchen Stories the world’s leading platform in digital cooking experiences. BSH is just the right partner for that,” Gao explains. Hubertz adds: “With its intelligent Home Connect platform, BSH is the leading home appliance manufacturer in the connected kitchen segment. It’s great that Kitchen Stories is becoming a part of this ecosystem. And besides that, the investments will enable us to tap the connected kitchen market, and to help continue designing the cooking of the future.”\nKitchen Stories will soon integrate into the growing Home Connect ecosystem and will gradually expand with new applications. Home Connect, a subsidiary of BSH Hausgeräte GmbH, is a dynamic, open-platform ecosystem that was created to connect home appliances to the Internet of Things.\nAt the launch of the cooperative arrangement, Kitchen Stories recipes will be available on the Home Connect app. Consumers will also be able to use the Kitchen Stories app for tasks like sending the temperature setting from a recipe directly to their connected oven. Kitchen Stories will gradually expand with new applications, such as intuitive guidance while the user is cooking, a smart recipe search, as well as suggestions and variations for recipes.\nAbout BSH Hausgeräte GmbH\nWith annual sales of around €13.1 billion in 2016 and more than 58,000 employees, BSH Hausgeräte GmbH is one of the global leaders in the home appliance sector. BSH manufactures at around 40 factories, operates over 80 companies and has a presence in around 50 countries. BSH is a company of the Bosch Group. For more information, visit www.bsh-group.com .\nAbout Kitchen Stories\nKitchen Stories was founded in 2013 by Mengting Gao and Verena Hubertz in Berlin. The startup is active in more than 150 countries. Its core markets are China, Germany and the US. The app has generated more than 15 million downloads and was awarded by Apple and Google numerous times (most recently with the Apple Design Award in 2017). Kitchen Stories employs a team of 30 in Berlin.\nContact:\nDebbie Ehrman\nFinn Partners\n310-882-4016\ndeborah@finnpartners.com\nSource: BSH Home Appliances", "external_links": ["http://www.home-connect.com/us/en/", "https://www.bsh-group.com/", "https://kitchenstories.io/en", "https://www.globenewswire.com/NewsRoom/AttachmentNg/cf8376a4-bb41-487a-aa25-cb22650b60c7"], "published": "2018-01-08T17:15:00.000+02:00", "crawled": "2018-01-08T19:06:14.005+02:00", "highlightTitle": ""}