{"organizations": [], "uuid": "e263bb0a3b762f0fb91f1ecb85dda875f6368c36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-quest-resource-adds-a-chain-of-collision-repair-centers-to-its-portfolio-of-customers.html", "country": "US", "domain_rank": 767, "title": "Quest Resource Adds a Chain of Collision Repair Centers to Its Portfolio of Customers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-16T15:00:00.000+02:00", "replies_count": 0, "uuid": "e263bb0a3b762f0fb91f1ecb85dda875f6368c36"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-quest-resource-adds-a-chain-of-collision-repair-centers-to-its-portfolio-of-customers.html", "ord_in_thread": 0, "title": "Quest Resource Adds a Chain of Collision Repair Centers to Its Portfolio of Customers", "locations": [], "entities": {"persons": [{"name": "ray hatch", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "colony", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "quest resource holding corporation", "sentiment": "negative"}, {"name": "chain of collision repair centers", "sentiment": "negative"}, {"name": "quest resource holding co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "THE COLONY, Texas, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Quest Resource Holding Corporation (Nasdaq:QRHC) (“Quest”), a leader in corporate sustainability, recycling and environmental resource management, announced today that it added one of the fastest growing providers of automotive collision repair services in the United States to its portfolio of customers.\nUnder the multi-year agreement, Quest will manage a comprehensive recycling program that includes recycling waste motor oil, antifreeze, hazardous waste, tires and oily water. Quest will also provide emergency response protection to all 330 collision repair centers located throughout the United States.\n“The addition of another national chain to our portfolio of customers is a strong testament to the value that our services provide in helping fast growing companies achieve their environmental goals,” said Ray Hatch, Quest’s Chief Executive Officer. “We provide our customers a ‘one-stop’ solution for all of their recycling, sustainability and waste disposal needs from coast to coast.”\nFor more information on Quest Resource Holding Corporation, visit www.QRHC.com .\nAbout Quest Resource Holding Corporation\nQuest provides businesses with a nationwide, single-source solution for the reuse, recycling and disposal of a wide variety of waste streams and recyclables generated by their businesses. Quest's comprehensive reuse, recycling and disposal services include customer-specific programs for the management, collection, processing and accounting for waste streams and recyclables. Quest operates environmentally focused online platforms that contain information and data that tracks and reports the environmental results of our services and provides actionable data to improve business operations.\nFor more information, visit www.QRHC.com .\nSafe Harbor Statement\nThe statements contained in this press release that are not purely historical are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements other than statements of historical facts contained in this press release, including statements that the addition of another national chain to its portfolio of customers is a strong testament to the value that our services provide in helping fast growing companies achieve their environmental goals, and that Quest customers appreciate a “one-stop” solution for all of their recycling, sustainability, and waste disposal needs, from coast to coast are forward-looking statements. Specific forward-looking statements in this press release include all forward-looking statements included herein are based on information available to us as of the date hereof and speak only as of such date. Except as required by law, we undertake no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements. The forward-looking statements contained in or incorporated by reference into this press release reflect our views as of the date of this press release about future events and are subject to risks, uncertainties, assumptions, and changes in circumstances that may cause our actual results, performance, or achievements to differ significantly from those expressed or implied in any forward-looking statement. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future events, results, performance, or achievements. A number of factors could cause actual results to differ materially from those indicated by the forward-looking statements, including competition in the environmental services industry, the impact of the current economic environment, and other factors detailed from time to time in our reports filed with the Securities and Exchange Commission, including our Annual Report on Form 10-K for the fiscal year ended December 31, 2016.\nInvestor Relations Contact:\nThree Part Advisors, LLC\nJeff Elliott\n972.423.7070\nJoe Noyons\n817.778.8424\nSource:Quest Resource Holding Corporation", "external_links": ["http://www.qrhc.com/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/fbc3c6d9-6cf1-436e-bd27-bdef66f4b6f8", "http://ctt.marketwire.com/?release=11G122048-001&id=10256821&type=0&url=http%3a%2f%2fwww.QRHC.com", "http://www.questrmg.com/"], "published": "2018-01-16T15:00:00.000+02:00", "crawled": "2018-01-16T16:53:21.001+02:00", "highlightTitle": ""}