{"organizations": [], "uuid": "eed3cb6e2f5d878976aa4ce650a7fc6f18006eb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223825194&w=1200&r=LYNXMPEE0K086", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-edmund/tennis-edmund-ousts-seppi-to-reach-first-grand-slam-quarter-final-idUSKBN1FA09L", "country": "US", "domain_rank": 408, "title": "Tennis: Edmund ousts Seppi to reach first grand slam quarter-final", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T10:54:00.000+02:00", "replies_count": 0, "uuid": "eed3cb6e2f5d878976aa4ce650a7fc6f18006eb4"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-edmund/tennis-edmund-ousts-seppi-to-reach-first-grand-slam-quarter-final-idUSKBN1FA09L", "ord_in_thread": 0, "title": "Tennis: Edmund ousts Seppi to reach first grand slam quarter-final", "locations": [], "entities": {"persons": [{"name": "edmund", "sentiment": "negative"}, {"name": "seppi", "sentiment": "negative"}, {"name": "kyle edmund", "sentiment": "none"}, {"name": "andy murray", "sentiment": "none"}, {"name": "nick kyrgios", "sentiment": "none"}, {"name": "grigor dimitrov", "sentiment": "none"}, {"name": "kevin anderson", "sentiment": "none"}, {"name": "andreas seppi", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - Britain’s Kyle Edmund reached the quarter-finals of a grand slam for the first time after coming from a set down to oust Italian Andreas Seppi 6-7(4) 7-5 6-2 6-3 in the fourth round of the Australian Open on Sunday.\nThe 23-year-old, the only Briton in the men’s draw in the absence of the injured Andy Murray, smashed 63 winners to progress to a last eight meeting with Grigor Dimitrov or Nick Kyrgios when Seppi netted after just under three hours on court.\nEdmund also fired down 25 aces to tame the neat Italian but it was the thumping winners, particularly off his forehand, that proved decisive after he had reduced the error count that marred his display in the first set.\nThe first Briton other than Murray to reach the last eight at Melbourne Park since John Lloyd in 1985, Edmund politely shook hands with his opponent at the net before leaping off the ground with punch in the air.\n“He plays very well here, he has reached the fourth round a few times and is playing very well but so was I,” the unassuming Yorkshireman said on court.\n“Through to my first quarter-final. I am very happy.”\nThe world number 49 might have been forgiven a slow start after going five sets with 11th seed Kevin Anderson in round one and again in brutal heat with Georgian Nikoloz Basilashvili in round three.\nTennis - Australian Open - Hisense Arena, Melbourne, Australia, January 21, 2018. Andreas Seppi of Italy leaves after losing his match against Kyle Edmund of Britain. REUTERS/Issei Kato Edmund duly delivered with 23 unforced errors as Seppi, a decade older and a veteran of three previous trips to the fourth round of the Australian Open, held serve with ease and mustered up five break points.\nA medical timeout and a shoulder massage from the trainer did not help Edmund much initially and Seppi raced away with the tiebreak to clinch the first set in 56 minutes.\nSlideshow (3 Images) Things did not look much better at the start of the second with an early break going the Italian’s way but Edmund stormed back to put the set back on serve with a crunching forehand and leveled up the match on another break from a second set point.\nA leaping backhand service return gave Edmund the early break in the third set and the Briton never looked back as he raced away to take a 2-1 lead after little more than half an hour.\nIt was Seppi’s turn to take a medical timeout for a shoulder problem at the start of the fourth set but by now Edmund was earning break points on the Italian’s every service game and only required the one to clinch the victory.\n“It was a close first set and I didn’t feel I got the best start,” he said.\n“He was hitting the ball very clean. In the second set I tried to shift the momentum and once I broke him in the last game of the second set I took control of the match.”\nReporting by Nick Mulvenney in Sydney; Editing by John O'Brien and Sudipto Ganguly\n ", "external_links": [], "published": "2018-01-21T10:54:00.000+02:00", "crawled": "2018-01-21T11:22:06.004+02:00", "highlightTitle": ""}