{"organizations": [], "uuid": "6270c5aedcfce29d8a334e997e6200a382200dff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-colleen-bell-promoted-to-senior-vice-president-of-fiduciary-services-and-chief-fiduciary-service-officer.html", "country": "US", "domain_rank": 767, "title": "Colleen Bell Promoted to Senior Vice President of Fiduciary Services and Chief Fiduciary Service Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:14:00.000+02:00", "replies_count": 0, "uuid": "6270c5aedcfce29d8a334e997e6200a382200dff"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-colleen-bell-promoted-to-senior-vice-president-of-fiduciary-services-and-chief-fiduciary-service-officer.html", "ord_in_thread": 0, "title": "Colleen Bell Promoted to Senior Vice President of Fiduciary Services and Chief Fiduciary Service Officer", "locations": [], "entities": {"persons": [{"name": "colleen bell", "sentiment": "negative"}, {"name": "colleen", "sentiment": "none"}, {"name": "amy webber", "sentiment": "none"}], "locations": [{"name": "iowa", "sentiment": "none"}, {"name": "fairfield", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "fiduciary services", "sentiment": "negative"}, {"name": "bell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FAIRFIELD, Iowa--(BUSINESS WIRE)-- Cambridge is pleased to announce Colleen Bell has been promoted to Senior Vice President of Fiduciary Services and Chief Fiduciary Service Officer. In this role, Bell will provide executive oversight for the service, solutions, and support delivered by Cambridge’s Operations team while overseeing the Fiduciary Services department. Her responsibilities also include creating strategies for fee-based programs, retirement plan platforms, and advisory compliance.\n“Colleen has been instrumental in the collaborative leadership and development of Cambridge’s innovative solutions,” said President and Chief Executive Officer Amy Webber. “At Cambridge, we are focused on the financial professional with an independent mindset and dedication to best serving the needs of their investing clients, and Colleen will continue to play a key role in supporting Cambridge’s independent financial advisors in an ever-changing advice industry.”\nBell joined Cambridge in 2006 and has played a key role in leading Cambridge’s Fiduciary Services department – an important step by Cambridge regarding ongoing and anticipated regulatory change. She leads a group of subject matter experts who are familiar with the concept of being held to a formal fiduciary definition. Bell works collaboratively with leadership for Cambridge’s comprehensive managed account experience, WealthPort®, as well as Cambridge’s Retirement Center initiatives and services. She has also been instrumental in the ongoing collaborative development of Cambridge’s Investor Center.\nBell earned a Bachelor of Science degree in management information systems from the University of Illinois College of Business. She holds the FINRA Series 7, 24, and 66 licenses, along with the Accredited Investment Fiduciary® (AIF®) designation. In 2016, she was honored as one of the top 25 leaders influencing the independent advice space as a part of Investment Advisor’s 2016 IA 25 list.\nAbout Cambridge\nCambridge Investment Group, Inc. is a privately-controlled financial solutions firm focused on serving independent financial advisors and their investing clients. Cambridge offers a broad range of choices regarding advisor-focused financial solutions: advice solutions, technology solutions, platform choice and business structure solutions, consulting solutions, and outsourcing solutions. Cambridge’s national reach includes: Cambridge Investment Research Advisors, Inc. – a large corporate RIA; and Cambridge Investment Research, Inc. – an independent broker-dealer, member FINRA/SIPC, that is among the largest privately-controlled independent broker-dealers in the country.\nSecurities offered through Cambridge Investment Research, Inc., a broker-dealer, member FINRA/SIPC, and investment advisory services offered through Cambridge Investment Research Advisors, Inc., a Registered Investment Adviser. Both are wholly-owned subsidiaries of Cambridge Investment Group, Inc.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110005955/en/\nCambridge Investment Group, Inc.\nCindy Schaus, 641-470-1225\nFirst Vice President, Public Relations and Creative Marketing\ncindy.schaus@cir2.com\nor\nSteven Cherry, 641-209-8444\nSenior Account Executive, Public Relations and Creative Marketing\nsteven.cherry@cir2.com\nor\nNick Mitchell, 800-777-6080 x1677\nAccount Executive, Public Relations and Creative Marketing\nnick.mitchell@cir2.com\nSource: Cambridge Investment Group, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180110005955/en/"], "published": "2018-01-10T20:14:00.000+02:00", "crawled": "2018-01-10T20:07:04.013+02:00", "highlightTitle": ""}