{"organizations": [], "uuid": "5380c2d9dd9c02ea49756cd2049985ea7072c9e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-cheniere-energy-trafigura/cheniere-signs-15-year-lng-supply-pact-with-trader-trafigura-idUSKBN1F51TR", "country": "US", "domain_rank": 408, "title": "Cheniere signs 15-year LNG supply pact with trader Trafigura", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:46:00.000+02:00", "replies_count": 0, "uuid": "5380c2d9dd9c02ea49756cd2049985ea7072c9e0"}, "author": "", "url": "https://www.reuters.com/article/us-cheniere-energy-trafigura/cheniere-signs-15-year-lng-supply-pact-with-trader-trafigura-idUSKBN1F51TR", "ord_in_thread": 0, "title": "Cheniere signs 15-year LNG supply pact with trader Trafigura", "locations": [], "entities": {"persons": [{"name": "arun koyyur", "sentiment": "none"}, {"name": "karan nagarkatti", "sentiment": "none"}, {"name": "henry hub", "sentiment": "none"}, {"name": "jack fusco", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "cheniere", "sentiment": "negative"}, {"name": "trafigura", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "cheniere energy inc", "sentiment": "none"}, {"name": "trafigura reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "trafigura pte ltd", "sentiment": "none"}, {"name": "cheniere marketing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - U.S. liquefied natural gas (LNG) exporter Cheniere Energy Inc has inked a 15-year, 1 million tonne per annum (mtpa) sales deal with Swiss commodity trader Trafigura, a sign of how the sector’s middlemen are expanding their market share.\nLNG deliveries to Trafigura, one of the biggest independent traders of the fuel, will begin in 2019, Cheniere said in a statement on Tuesday.\nSwiss trade houses grabbed a $10 billion share of the rapidly growing LNG business last year, handling roughly 8.5 percent of all supply.\nThey have benefited from the emergence of new LNG importing countries such as Egypt and Pakistan with rapidly growing energy needs and high credit risks, acting as a buffer for risk-averse suppliers and producers unwilling to take direct exposure.\nTrafigura, Vitol, Gunvor and Glencore are all used to dealing with politically complex markets. As many countries are hungry for gas as a cleaner alternative to oil and coal for generating power, traders are expected to keep growing their market share.\nSome are moving beyond trading, seeking stakes in LNG production and leasing capacity in facilities such as floating import terminals, which are cheaper than those on dry land.\nGunvor was the first independent trader to gain access to long-term LNG supply in a deal with Russia’s new Yamal plant in the Arctic.\nLast year it also agreed to buy all the output from Africa’s first deepwater floating LNG plant in Equatorial Guinea.\nGlencore in September said it agreed a long-term deal for LNG supply from Angola.\nTrafigura’s agreement with Cheniere Marketing would help the Houston-based company to fund its expansion plans, Chief Executive Jack Fusco said.\nIn addition to the four operating 0.7-billion cubic feet per day (bcfd), or 4.5-mtpa, liquefaction trains at its Sabine Pass facility in Louisiana, Cheniere has three 0.7-bcfd units under construction at its Corpus Christie export facility in Texas and Sabine Pass.\nIn addition, the company has other units that are fully permitted at Corpus Christie and Sabine Pass that it plans to build once it gets enough financial commitments.\nOne bcfd can fuel about five million U.S. homes.\nThe company has been expanding its presence in Asia to benefit from the rising demand for LNG from the region.\nAccording to the sale-purchase agreement, the purchase price for LNG is indexed to the monthly Henry Hub benchmark price, plus a fee.\nReporting by Karan Nagarkatti in Bengaluru, Oleg Vukmanovic in London and Scott DiSavino in New York; Editing by David Evans and Meredith Mazzilli\n ", "external_links": [], "published": "2018-01-16T16:46:00.000+02:00", "crawled": "2018-01-16T17:12:26.014+02:00", "highlightTitle": ""}