{"organizations": [], "uuid": "f81c179e5c2bfd354dedb32805c873d99d1c6394", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-freeze-tag-news-ceo-update-on-the-companyas-growth-prospects.html", "country": "US", "domain_rank": 767, "title": "Freeze Tag News: CEO Update on the Company’s Growth Prospects", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:30:00.000+02:00", "replies_count": 0, "uuid": "f81c179e5c2bfd354dedb32805c873d99d1c6394"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-freeze-tag-news-ceo-update-on-the-companyas-growth-prospects.html", "ord_in_thread": 0, "title": "Freeze Tag News: CEO Update on the Company’s Growth Prospects", "locations": [], "entities": {"persons": [{"name": "craig holland", "sentiment": "none"}, {"name": "munzee", "sentiment": "none"}], "locations": [{"name": "tustin", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TUSTIN, Calif., Jan. 11, 2018 (GLOBE NEWSWIRE) -- via OTC PR WIRE-- Freeze Tag (OTC:FRZT), a leading creator of location-based mobile social games, today announced an update from the CEO.\n“Our prospects for accelerated growth and profitability have never been better,” said Craig Holland, CEO of Freeze Tag. “This week we informed our investor community that our newly merged company has a significant revenue base which we can use as a launch pad for the future.”\nThe CEO of Freeze Tag indicated that important financial information has been released.\nHistorical revenue for Munzee prior to the merge with Freeze Tag is now available. In the 8K/A filed January 8, 2018, we released audited financial statements of Munzee for the years ended December 31, 2016 and 2015, the unaudited financial statements for Munzee for the periods ended September 30, 2017 and 2016.\nPresently, the company is not carrying any convertible promissory notes from non-affiliate, third parties on its balance sheet. As reported in the 8K dated October 11, 2017, all convertible promissory notes held by third party accredited investors were exchanged for convertible preferred stock.\nThe company also reported progress in the areas of corporate partnerships and product development:\nCorporate partnerships – The company is negotiating with several organizations to promote Freeze Tag products such as Munzee®, Garfield Go and ZeeTours™ for health and fitness. Announcements about specific partner organizations will be announced in Q1 2018. ZeeTours – Initial sales of ZeeTours products have been very encouraging. Additional ZeeTours in cities across the USA are being developed and will be launched through promotional partner Groupon in the near future. Products like ZeeTours typically become very popular in the spring and summer as more people enjoy outside activities. Munzee (the global scavenger hunt game) - The product development process for a “new and improved” Munzee app is underway. The company will be providing more details on the Munzee product roll out process in the coming months.\n“Although we’ve provided periodic updates and new features over the last two years, we’re excited to begin moving forward on a massive app overhaul,” said Rob Vardeman, President of Freeze Tag. “In celebration of our 2018 theme, ‘The Time Is Now’, we will re-design and optimize the Munzee app for new and old players alike.”\nTo learn more about Munzee (the global scavenger hunt game), go to https://www.munzeeblog.com/ which is updated frequently.\nFor more information about Freeze Tag, go to www.freezetag.com .\nCheck out all of our games at: https://www.zeetoursapp.com/moregames.html .\nAbout Freeze Tag, Inc.\nFreeze Tag, Inc. is a leading creator of mobile location-based games for consumers and businesses. Our portfolio includes hits such as Munzee, a social platform with over 7 million locations worldwide and hundreds of thousands of players that blends gamification and geolocation into an experience that rewards players for going places in the physical world, Garfield Go, a Pokemon Go style augmented reality game based on the iconic cat Garfield, WallaBee, an addictive collecting game with over 2,000 beautifully drawn digital cards, as well as many social mobile games that provide endless hours of family-friendly fun. We also offer our technology and services to businesses that want to leverage mobile gaming in their marketing and branding programs. For example, our Eventzee solution allows businesses to create private scavenger hunts in physical places such as malls, tradeshows, company events or campuses to create immersive brand experiences.\nForward Looking Statements\nThis press release contains forward-looking statements that involve substantial uncertainties and risks. These forward-looking statements are based upon our current expectations, estimates and projections and reflect our beliefs and assumptions based upon information available to us at the date of this release. We caution readers that forward-looking statements are predictions based on our current expectations about future events. These forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties and assumptions that are difficult to predict. Our actual results, performance or achievements could differ materially from those expressed or implied by the forward-looking statements as a result of a number of factors, including but not limited to, our ability to market our games, and our ability to implement new changes and release them. We undertake no obligation to revise or update any forward-looking statement for any reason.\nContact:\ninfo@freezetag.com\n714-210-3850 x26\nSource:Freeze Tag, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=_YSTJrI8z810U8wVO9Cc0NsQ4nMk0rVtAaDkTli-wgGmy_cnfkRV1yQVx55u7xjgiRWYM0KzI7X29ftpr7VgNgV7tz0PYmMt_PrDFGLSft4=", "https://www.globenewswire.com/Tracker?data=pxl04Y6IPAFNvasu1OxmkzXizy0CeO02JSkFQZ1-t_qSoUX71HYiR2tcZZs1yr8InSbhGZ2v_ljCTbrmIAi48BMsG77fMmkr0ccWwPWktS4nHd0Ll7aL9u-wtVYiPbu0_sgwqiHJRr2L6PIsXsVqDA==", "https://www.munzeeblog.com/", "https://www.globenewswire.com/Tracker?data=pxl04Y6IPAFNvasu1Oxmk6gURhNabiZnIFQkr9_4Mp5llZ-Pp-c0BuypAyCRFt1fNnbJ3y30qjP3yIn1e8S03XWwPGAuOpKMfwTD0o-_NDE=", "https://www.zeetoursapp.com/moregames.html", "https://www.globenewswire.com/NewsRoom/AttachmentNg/c53b156e-4bab-452c-bb4d-e68190301a9b"], "published": "2018-01-11T16:30:00.000+02:00", "crawled": "2018-01-11T18:50:20.034+02:00", "highlightTitle": ""}