{"organizations": [], "uuid": "5e6a1a268babd476d69e20f113037c1e20f02b04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/steinhoff-accounts/update-2-steinhoff-creditors-join-forces-ahead-of-meeting-sources-idUSL8N1PI3DW", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Steinhoff creditors join forces ahead of meeting-sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:51:00.000+02:00", "replies_count": 0, "uuid": "5e6a1a268babd476d69e20f113037c1e20f02b04"}, "author": "", "url": "https://www.reuters.com/article/steinhoff-accounts/update-2-steinhoff-creditors-join-forces-ahead-of-meeting-sources-idUSL8N1PI3DW", "ord_in_thread": 0, "title": "UPDATE 2-Steinhoff creditors join forces ahead of meeting-sources", "locations": [], "entities": {"persons": [{"name": "alexander hübner", "sentiment": "none"}, {"name": "arno schuetze", "sentiment": "none"}, {"name": "steinhoff", "sentiment": "none"}], "locations": [{"name": "poundland", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "psg group", "sentiment": "none"}, {"name": "latham & watkins", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 52 PM / in 27 minutes UPDATE 2-Steinhoff creditors join forces ahead of meeting-sources Reuters Staff \n* Some holders of European unit’s bond hire advisers \n* Steinhoff to update creditors at meeting on Friday \n* Retailer raises $584 mln from sale of stake in PSG Group \n* Revelation of ‘accounting irregularites’ wipe 85 pct off shares (Adds background, details) \nBy Arno Schuetze and Alexander Hübner \nFRANKFURT, Jan 23 (Reuters) - More creditor groups of Steinhoff are joining forces to position themselves for a potential debt restructuring at the furniture retailer, people close to the matter said before the company meets creditors on Friday. \nSteinhoff, owner of more than 40 retail brands including Poundland in Britain, admitted “accounting irregularities” last month, triggering an 85 percent share slide. \nSome holders of an 800 million euro ($983 million) bond of a European Steinhoff unit have mandated restructuring adviser PJT as well as law firm Latham & Watkins to represent them in any debt restructuring talks, the sources said. \nEarlier, convertible bond holders had hired Houlihan Lokey and law firm Kirkland & Ellis to help them deal with the matter, while senior debt holders mandated FTI and Allen & Overy. \nRoughly 2 billion euros of Steinhoff’s 10.7 billion euros in debts mature this year. \nThe company has called a meeting with some of its European-based creditors in London on Friday. \nAs part of efforts to stabilise the company, Steinhoff on Monday sold a stake in investment firm PSG Group for 7.1 billion rand ($584 million). Last week it secured 60 million euros from South African lenders. \nIt remained unclear whether Steinhoff will use the money from the PSG sale to plug funding needs at the European operating level, especially at Austria’s Kika-Leiner. Steinhoff’s management is currently in talks with European subsidiaries about funding needs, one source said. \nIt also remained unclear if the group is still in talks on raising 140 million euros from South African banks following the PSG sale. Steinhoff viewed terms offered by international lenders as unattractive, another person said. \nWhile the creditors hope for an update at Friday’s meeting on how Steinhoff hopes to resolve its debt situation, any negotiations about a credit valuation adjustment can only begin once Steinhoff has restated its figures and it becomes clear what future earnings the group will have. \n“We expect that to be the case in April,” one of the sources said. \nSteinhoff has rushed to fill a liquidity gap to avoid a small unit like Austria’s Kika-Leiner - which needs about 80 million euros of fresh money - from pulling down the entire group. \nWhile the PSG stake sale helped to avoid the collapse of the Steinhoff group, it also lowers available collateral securities that could help repay other creditors. \nPJT and Latham declined to comment, while Steinhoff was not immediately available for comment. ($1 = 12.1461 rand) ($1 = 0.8139 euros) (Additional reporting by Sandrine Bradley and Tiisetso Motsoeneng; Editing by Douglas Busvine and Adrian Croft)", "external_links": [], "published": "2018-01-23T17:51:00.000+02:00", "crawled": "2018-01-23T18:29:38.005+02:00", "highlightTitle": ""}