{"organizations": [], "uuid": "eac8c93c7ed13e7490cdc7ce9169ba9a442ff2f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223632076&w=1200&r=LYNXMPEE0J0HE", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-trump-women/power-to-the-polls-womens-march-2-0-aims-to-harness-trump-opposition-idINKBN1F90MZ", "country": "US", "domain_rank": 408, "title": "Power to the Polls: Women's March 2.0 aims to harness Trump opposition", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T16:17:00.000+02:00", "replies_count": 0, "uuid": "eac8c93c7ed13e7490cdc7ce9169ba9a442ff2f4"}, "author": "", "url": "https://in.reuters.com/article/usa-trump-women/power-to-the-polls-womens-march-2-0-aims-to-harness-trump-opposition-idINKBN1F90MZ", "ord_in_thread": 0, "title": "Power to the Polls: Women's March 2.0 aims to harness Trump opposition", "locations": [], "entities": {"persons": [{"name": "ian simpson", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mallory", "sentiment": "none"}, {"name": "tamika mallory", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "power", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Tens of thousands of protesters were expected to take to the streets of New York, Los Angeles and Washington on Saturday for the second Women’s March, a multi-city mass rally hailed as the start of a new era of female political activism.\nThis year’s demonstration is being held in coordination with rallies planned for the weekend in some 250 other cities across the United States and overseas and marks the first anniversary of President Donald Trump’s inauguration.\n“People were pretty damn mad last year and they’re pretty damn mad this year,” said Tamika Mallory, co-president of the Women’s March board.\nLike last year, thousands of marchers are expected to don pink knit “pussy hats”, which were created as a joking reference to a comment made by Trump about female genitalia and quickly became a symbol of women’s empowerment and opposition to the new president in the early days of his administration.\nMallory said the rallies may take on a light-hearted or even celebratory tone at times, but added: “We also know that serious business has to happen.”\nThe biggest marches are expected on Saturday in Washington and New York, with 10,000 and 37,000 people signed up on their respective Facebook pages. But the number of participants is likely to fall well short of the estimated 5 million who marched on Jan. 21. 2017 and made that one of the largest mass protests in U.S. history.\nMORE MODEST EXPECTATIONS Despite the more modest expectations this year, organizers hope to build on the raw energy felt by Trump opponents immediately after his surprise election victory and channel it into gains for progressive candidates in November’s midterm elections, using the theme “Power to the Polls.”\nSixteen-year-old Emma Humphries holds a \"Trump\" towel over the Women's March on Washington, following the inauguration of President Donald Trump, in Washington, January 21, 2017. REUTERS/Brian Snyder/Files Specifically, organizers want to register a million new voters and get more strong advocates for women’s rights into office.\nActivists say Trump’s policies rolling back birth control and equal pay protections have propelled many women into activism for the first time.\nA White House spokesman did not respond to a request for comment on the marches.\nThe rallies also come during what has been seen as a pivotal year for women’s rights with the #MeToo and #TimesUp social media effort against sexual harassment and abuse that was born out of a string of scandals in Hollywood, Washington and elsewhere.\nSome critics said this year’s march lacked a focus. Targeting an issue such as immigration would have greater impact, said Shikha Dalmia, a senior analyst at the Reason Foundation, a libertarian think tank.\n“Beating the feminist drum just seems to me beside the point. Maybe they are trying to cast as wide a net as possible,” Dalmia said by telephone.\nThe marches will be followed by more events on Sunday, including in Las Vegas, which was chosen by organizers to honor the city where the deadliest mass shooting in modern U.S. history took place last August. Nevada is also a key battleground state in the 2018 midterm elections.\nThe voter registration campaign will target swing states held by Republicans, such as Nevada, and in districts considered a toss-up ahead of November’s midterm elections.\nAdditional reporting by Dan Whitcomb in Los Angeles; Editing by Frank McGurty and Daniel Wallis\n ", "external_links": [], "published": "2018-01-20T16:17:00.000+02:00", "crawled": "2018-01-20T16:54:25.007+02:00", "highlightTitle": ""}