{"organizations": [], "uuid": "824fa2436c0ca8e667d38600ed5a862f8e1d50f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220788890&w=1200&r=LYNXMPEE090IQ", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/us-california-mudslides/death-toll-in-california-mudslides-expected-to-rise-idINKBN1EZ0YS", "country": "US", "domain_rank": 408, "title": "Death toll in California mudslides expected to rise", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T12:14:00.000+02:00", "replies_count": 0, "uuid": "824fa2436c0ca8e667d38600ed5a862f8e1d50f1"}, "author": "", "url": "https://in.reuters.com/article/us-california-mudslides/death-toll-in-california-mudslides-expected-to-rise-idINKBN1EZ0YS", "ord_in_thread": 0, "title": "Death toll in California mudslides expected to rise", "locations": [], "entities": {"persons": [{"name": "alex dobuzinskis", "sentiment": "none"}, {"name": "barbara sheriff bill brown", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "santa barbara county", "sentiment": "none"}, {"name": "montecito", "sentiment": "none"}], "organizations": [{"name": "ventura county sheriff's office/via reuters  rescue", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ventura county sheriff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (Reuters) - Rescue crews with dogs and thermal-imaging equipment searched the hills around wealthy Santa Barbara, California, on Wednesday for up to two dozen people missing after rain-driven mudslides swept through the coastal community, killing at least 15.\nMudslides damaged historic hotels and the homes of celebrities including Oprah Winfrey, who relish the area sandwiched between the ocean and the sprawling Los Padres National Forest, for its natural beauty and proximity to sprawling Los Angeles.\nBut the wooded hillsides that once gave their estates a sense of seclusion were largely denuded by last year’s historic wildfires, setting the stage for the massive slides that slammed into homes, turned highways into raging rivers and shredded cars into nearly unrecognizable tangles of metal after heavy Tuesday rains.\nBetween 12 and 24 people who were believed to in the area at the time of the slides remained unaccounted for, said Chris Elms, a spokesman for state firefighters. About 500 law enforcement officers and firefighters were combing mud-covered neighborhoods, using dogs, helicopters and thermal imaging equipment to locate missing people.\n“We are still very much in active search and rescue mode,” Elms said in a phone interview. The current death toll of 15 confirmed fatalities could rise, he warned.\n”That’s a fear, Elms said. “We are still very hopeful that we will locate people alive.”\nOfficials have ordered residents in a large swath of Montecito to stay in their homes so that rescuers can better go about their work.\nAbout 300 people were stranded in a canyon. Local rescue crews, using borrowed helicopters from the U.S. Coast Guard, worked to airlift them out, officials said.\nThe county initially ordered 7,000 residents to evacuate and urged another 23,000 to do so voluntarily, but only 10 to 15 percent complied with mandatory orders, said Amber Anderson, a spokeswoman for the Santa Barbara County Fire Department.\nThe slides closed several historic hotels, including The Four Seasons Biltmore, which had just reopened on Monday after repairing damage from the wildfires. The courtyard of the 90-year-old Montecito Inn, built by silent movie actor Charlie Chaplin, was filled with a thick crust of debris driven by the slides.\nFILE PHOTO: An aerial view from a Ventura County Sheriff helicopter shows a site damaged by mudslide in Montecito, California, U.S. January 9, 2018. Ventura County Sheriff's Office/via REUTERS Some undamaged businesses closed as they lacked water, gas and other supplies to operate.\n“There are no customers,” said Pierre Henry, owner of the Bree‘osh Bakery Cafe Montecito, several blocks from the spot where a large mudslide crossed Coast Village Road as it moved toward the ocean.\n“We have a lot of friends of ours, and they are in the other part of Montecito, and they don’t have electricity, they don’t have gas, water and they don’t have internet,” Henry added. “We are quite lucky.”\nSlideshow (10 Images) The mudslides followed a violent rainstorm that dropped as much as 6 inches (15 cm) of precipitation in pockets northwest of Los Angeles, soaking ground that was left vulnerable after much of its vegetation burned in the state’s largest wildfire last month.\nWinfrey posted a video on Instagram showing her wading through nearly knee-deep mud on her Montecito property.\n“The house in back is gone,” she could be heard saying as she inspected the damage.\nA 14-year-old girl was found alive on Tuesday after firefighters using rescue dogs heard cries for help from what was left of her Montecito home, the Los Angeles Times reported.\n“I thought I was dead there for a minute,” the teenager Lauren Cantin, covered in mud, told NBC News after workers spent six hours rescuing her.\nThe number of fatalities surpassed the death toll from a California mudslide on Jan. 10, 2005, when 10 people were killed as a hillside gave way in the town of La Conchita, less than 20 miles (30 km) south of the latest disaster.\nLast month’s wildfires, including the Thomas Fire, which became the largest in California history, left the area vulnerable to mudslides. The fires burned away grass and shrubs that held the soil in place and also baked a waxy layer into the earth that prevents water from sinking deeply into the ground.\nAdditional reporting by Peter Szekely in New York, Rich McKay in Atlanta and Brendan O'Brien in Milwaukee; Writing by Scott Malone; Editing by Jonathan Oatis and Chris Reese\n ", "external_links": [], "published": "2018-01-10T12:14:00.000+02:00", "crawled": "2018-01-10T12:46:09.022+02:00", "highlightTitle": ""}