{"organizations": [], "uuid": "de2412164c55c091277f5c3df18fdfaaead78b45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-lrada-corporation-acquires-location-based-mass-messaging-solutions-provider-genasys-holding-s-l.html", "country": "US", "domain_rank": 767, "title": "LRAD® Corporation Acquires Location-Based Mass Messaging Solutions Provider, Genasys Holding S.L.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:00:00.000+02:00", "replies_count": 0, "uuid": "de2412164c55c091277f5c3df18fdfaaead78b45"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-lrada-corporation-acquires-location-based-mass-messaging-solutions-provider-genasys-holding-s-l.html", "ord_in_thread": 0, "title": "LRAD® Corporation Acquires Location-Based Mass Messaging Solutions Provider, Genasys Holding S.L.", "locations": [], "entities": {"persons": [{"name": "ric", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "lrad corporation", "sentiment": "negative"}, {"name": "lrad", "sentiment": "none"}, {"name": "genasys holding s.l.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Calif., Jan. 19, 2018 (GLOBE NEWSWIRE) -- LRAD Corporation (NASDAQ: LRAD) , the world’s leading provider of acoustic hailing devices and advanced mass notification systems, today announced the acquisition of Genasys Holding S.L. (“Genasys”), a leading software provider of advanced location-based mass messaging solutions for emergency warning systems and workforce management.\nGenasys, headquartered in Madrid, Spain, has an experienced group of developers with over 200 man years of software development and a strong, international technical sales, service, and support team. Genasys currently has two main product offerings: news - a reliable solution for sending SMS-based warnings of public safety hazards to affected populations with industry-leading speed; and, haz – a low cost, easy-to-use solution for remotely monitoring employees, planning tasks, and managing workplace incidents.\n“The acquisition of Genasys enables LRAD to significantly enhance its advanced mass notification capabilities and pursue broader geolocation based mass messaging projects and services,” stated Richard S. Danforth, Chief Executive Officer of LRAD Corporation. “Many of the mass notification opportunities we target, including universities, cities, and countries, require an integrated location-based mass messaging service. With this acquisition, LRAD expects to generate revenue on initial installations and recurring revenue from long-term support contracts for updating and maintaining the messaging service over the life of the installations.”\n“I am eager to leverage LRAD’s worldwide sales channels to seek accelerated growth of the Genasys mass notification software solutions,” remarked Pablo Colom, Genasys' Chief Executive Officer. “Genasys has a solid track record of location-based mass messaging integrations and deployments, which include solutions for small workgroups to fully integrated country-wide systems. The synergies of Genasys’ push notification products and LRAD’s award-winning mass notification systems will provide state-of-the-art solutions to communicate potentially lifesaving information to those affected by severe weather, man-made and natural disasters and other emergencies.”\nRevenues for Genasys in calendar 2017 (unaudited) were €1.9 million. Total consideration for the acquisition is €3.1 million, which includes a €1.9 million purchase price and the assumption of €1.2 million of debt.\nManagement will host a conference call to discuss the Genasys acquisition on Monday, January 22, 2018, at 12:00 pm U.S. EST. To access the conference call, dial toll-free 888.567.1602 from the U.S., or international at +1.404.267.0373. A webcast will also be available at the following link: https://www.webcaster4.com/Webcast/Page/1375/24207 . A replay of the call will be available approximately four hours after the call concludes, and remain available for 90 days at the aforementioned webcast link. Questions to management may be submitted before or during the call by emailing them to investor@lrad.com .\nAbout LRAD Corporation\nUsing advanced technology and superior voice intelligibility, LRAD Corporation’s proprietary Long Range Acoustic Devices ® and revolutionary ONE VOICE ® mass notification systems are designed to enable users to safely hail and warn, inform and direct, prevent misunderstandings, determine intent, establish large safety zones, resolve uncertain situations, and save lives. LRAD systems are in service in more than 70 countries around the world in diverse applications including mass notification and public address, fixed and mobile defense deployments, homeland, border, critical infrastructure, maritime, oil & gas, and port security, public safety, law enforcement and emergency responder communications, asset protection, and wildlife control and preservation. For more information, please visit www.LRAD.com .\nAbout Genasys Holding S.L.\nGenasys Holding S.L. is backed by Adara Ventures and Caixa Capital Risc, and is a leading software provider of advanced location-based mass messaging solutions for Emergency Warning Systems and Workforce Management. For more information, please visit www.LRAD.com/genasys .\nForward Looking Statements\nExcept for historical information contained herein, the matters discussed are forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934. You should not place undue reliance on these statements. We base these statements on particular assumptions that we have made in light of our industry experience, the stage of product and market development as well as our perception of historical trends, current market conditions, current economic data, expected future developments and other factors that we believe are appropriate under the circumstances. These statements involve risks and uncertainties that could cause actual results to differ materially from those suggested in the forward-looking statements. These risks and uncertainties include those associated with the integration of Genasys into the Company’s business, that the anticipated benefits and synergies of the transaction may not materialize as expected, that customer demand for the integrated product offerings may not meet expectations, and other risks and uncertainties identified and discussed in our filings with the Securities and Exchange Commission. These forward-looking statements are based on information and management’s expectations as of the date hereof. Future results may differ materially from our current expectations. For more information regarding other potential risks and uncertainties, see the “Risk Factors” section of the Company’s Form 10-K for the fiscal year ended September 30, 2017. LRAD Corporation disclaims any intent or obligation to update those forward-looking statements, except as otherwise specifically stated.\nCompany Contact E. Brian Harvey Director, Investor Relations and Capital Markets 858.753.8974 ebharvey@lrad.com\nSource:LRAD Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=40otJKgF3Y97EyoHhCH4TR7yrcw_CpFr_gNZJv8fwDWmlaFttTyQWptGdM1Cfj04er30GpIKSoMg9dqxEm_wgg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/92b0f39f-fc1b-481e-8afa-9abb82c31bea", "https://www.globenewswire.com/Tracker?data=vQ4E0Slk4XsvrtxPmCEbNEEFHfAgzs4knrNutAp9vXr0Mcp88cBeEeo4mREadsNqVay5zOmtLO2imG-X1g8guaPtxCaiXJO7fdBgBo_odl4=", "https://www.globenewswire.com/Tracker?data=mpI1y8bo5_SzHoY7wOGqhJsK4ekaPILrGE3uIdVAd2OQWpN1nGHejve48E4-XJsj5fwT6550_7siFUStowU4bw==", "https://www.globenewswire.com/Tracker?data=KZebYOFEd7y6jqc9mySClKP0HihpQbfySSHpHNUiqpMkvARWsLwm7i0I6xvToWEhwNCRZEDGDkLPRG7BcYLqaxhXfg4o9SrWFIJYIT7oTvn5BrJpMig1UiT31Os4-uEjxqudmrRa-MlabSEHGumvdebWUYGAKuC7iK55IYCUsyQ=", "https://www.globenewswire.com/Tracker?data=mpI1y8bo5_SzHoY7wOGqhOuXyZl7S5zjkEU_Yawd8JFyR6U4IwKmHTfrVdqFTpJUanhoumoBxwQPi3Kjdz-8in409RxeW4qaUlPfxX_9wyU=", "https://www.webcaster4.com/Webcast/Page/1375/24207", "https://www.globenewswire.com/Tracker?data=ORUINaEG8jn4HQ3w4TugmuygTgAtXJCiIpmycC0OVlYSx3jrpIxKW2WqIAe4scGNrK79ZY23Q5k1Ctkk19MOykSX95rwjJCaGPSlySB3DrI="], "published": "2018-01-19T17:00:00.000+02:00", "crawled": "2018-01-19T21:06:06.003+02:00", "highlightTitle": ""}