{"organizations": [], "uuid": "91673988f2f972bc513a3f5d68c2d1c3643f1f5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-digital-realty-appoints-erich-sanchack-executive-vice-president-operations.html", "country": "US", "domain_rank": 767, "title": "Digital Realty Appoints Erich Sanchack Executive Vice President, Operations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-18T00:30:00.000+02:00", "replies_count": 0, "uuid": "91673988f2f972bc513a3f5d68c2d1c3643f1f5f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-digital-realty-appoints-erich-sanchack-executive-vice-president-operations.html", "ord_in_thread": 0, "title": "Digital Realty Appoints Erich Sanchack Executive Vice President, Operations", "locations": [], "entities": {"persons": [{"name": "erich sanchack", "sentiment": "negative"}, {"name": "erich", "sentiment": "none"}, {"name": "a. william stein", "sentiment": "none"}, {"name": "sanchack", "sentiment": "none"}, {"name": "andy power", "sentiment": "none"}, {"name": "stein", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "digital realty", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "operations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 17, 2018 /PRNewswire/ -- Digital Realty (NYSE: DLR), a leading global provider of data center, colocation and interconnection solutions, announced today that Erich Sanchack has been named Executive Vice President, Operations. Mr. Sanchack will report directly to Chief Executive Officer A. William Stein and will be responsible for overseeing global portfolio operations, global construction, colocation and interconnection service implementation as well as supply chain operations.\n\"I am pleased to welcome Erich to the Digital Realty team and look forward to working closely with him to optimize our growing global operations,\" said Mr. Stein. \"Erich's diverse background consisting of deep operational, financial, and business development experience makes him uniquely qualified for this role where he will be responsible for ensuring we deliver the most efficient and effective solutions to our customers around the world. On behalf of the entire company, I would also like to extend a big thank you to Andy Power for leading the Operations division while we searched for the best candidate to lead the team.\"\nMr. Sanchack has extensive experience in operational and business development roles in the technology and telecommunications industries, including building and operating data centers. He most recently served as Senior Vice President, IT Solutions and New Market Development at CenturyLink where he was responsible for global commercial managed services and IT service offerings. At CenturyLink, he also held the title of Senior Vice President and General Manager, Federal, where he was responsible for the company's government sector portfolio encompassing network operations, cybersecurity and security operations, managed hosting with cloud and data management services, and a wide array of communications and IT services.\nPrior to CenturyLink, Mr. Sanchack served as an executive at Lockheed Martin for 12 years, where he held various Vice President roles. As Vice President, Competitive Enhancements, he identified and led cost-saving and corporate consolidation initiatives. While Vice President, Corporate Internal Audit, he reported directly to the board of directors and oversaw the company's risk management and internal control processes governing global operations. He also served as Vice President, Information Technology Services, where he managed large, complex global operations and contracts.\n\"Digital Realty is renowned in the industry for providing top-tier, innovative data center solutions and I am honored to join the company,\" said Mr. Sanchack. \"I look forward to working with Bill and the entire executive team to ensure our corporate strategy and operations are fully aligned to deliver our customers the customized data center solutions they need to grow their businesses.\"\nIn addition to his professional activities, Mr. Sanchack is an engaged community leader and veteran. He is a member of the board of directors for the American Heart Association for the Greater Washington Region, and sits on the Advisory Council for Johns Hopkins Community Physicians and the Armed Services Council for the Union League of Philadelphia. Mr. Sanchack is a former Captain in the United States Marine Corps, where he served in Finance and Operations and completed multiple overseas deployments. He received a B.S. in electrical engineering from Pennsylvania State University.\nAbout Digital Realty\nDigital Realty supports the data center, colocation and interconnection strategies of more than 2,300 firms across its secure, network-rich portfolio of data centers located throughout North America, Europe, Asia and Australia. Digital Realty's clients include domestic and international companies of all sizes, ranging from financial services, cloud and information technology services, to manufacturing, energy, gaming, life sciences and consumer products. www.digitalrealty.com\nFor Additional Information\nAndrew P. Power\nChief Financial Officer\nDigital Realty\n(415) 738-6500\nMedia Inquiries\nJohn Christiansen / Lindsay Andrews\nSard Verbinnen & Co.\n(415) 618-8750\nInvestor Relations\nJohn J. Stewart / Maria S. Lukens\nDigital Realty Trust, Inc.\n(415) 738-6500\ninvestorrelations@digitalrealty.com\nSafe Harbor Statement\nThis press release contains forward-looking statements which are based on current expectations, forecasts and assumptions that involve risks and uncertainties that could cause actual outcomes and results to differ materially, including statements related to our plans and organization. These risks and uncertainties include, among others, the following: the impact of current global economic, credit and market conditions; current local economic conditions in the metropolitan areas in which we operate; decreases in information technology spending, including as a result of economic slowdowns or recession; adverse economic or real estate developments in our industry or the industry sectors that we sell to (including risks relating to decreasing real estate valuations and impairment charges); our dependence upon significant tenants; bankruptcy or insolvency of a major tenant or a significant number of smaller tenants; defaults on or non-renewal of leases by tenants; our failure to obtain necessary debt and equity financing; risks associated with using debt to fund our business activities, including re-financing and interest rate risks, our failure to repay debt when due, adverse changes in our credit ratings or our breach of covenants or other terms contained in our loan facilities and agreements; financial market fluctuations; changes in foreign currency exchange rates; our inability to manage our growth effectively; difficulty acquiring or operating properties in foreign jurisdictions; our failure to successfully integrate and operate acquired or developed properties or businesses; the suitability of our properties and data center infrastructure, delays or disruptions in connectivity, failure of our physical and information security infrastructure or services or availability of power; risks related to joint venture investments, including as a result of our lack of control of such investments; delays or unexpected costs in development of properties; decreased rental rates, increased operating costs or increased vacancy rates; increased competition or available supply of data center space; our inability to successfully develop and lease new properties and development space; difficulties in identifying properties to acquire and completing acquisitions; our inability to acquire off-market properties; the impact of the United Kingdom's referendum on withdrawal from the European Union on global financial markets and our business; our inability to comply with the rules and regulations applicable to reporting companies; our failure to maintain our status as a REIT; possible adverse changes to tax laws; restrictions on our ability to engage in certain business activities; environmental uncertainties and risks related to natural disasters; losses in excess of our in", "external_links": ["http://www.prnewswire.com/news-releases/digital-realty-appoints-erich-sanchack-executive-vice-president-operations-300584131.html", "http://www.digitalrealty.com/"], "published": "2018-01-18T00:30:00.000+02:00", "crawled": "2018-01-18T00:28:21.006+02:00", "highlightTitle": ""}