{"organizations": [], "uuid": "8b2cb0f377e3dc1772058c83f55c894093619cad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-turkey-security-journalists/top-turkish-court-overstepped-limits-with-ruling-to-release-journalists-deputy-pm-idUSKBN1F10F0", "country": "US", "domain_rank": 408, "title": "Top Turkish court overstepped limits with ruling to release journalists: deputy PM", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T07:31:00.000+02:00", "replies_count": 0, "uuid": "8b2cb0f377e3dc1772058c83f55c894093619cad"}, "author": "", "url": "https://www.reuters.com/article/us-turkey-security-journalists/top-turkish-court-overstepped-limits-with-ruling-to-release-journalists-deputy-pm-idUSKBN1F10F0", "ord_in_thread": 0, "title": "Top Turkish court overstepped limits with ruling to release journalists: deputy PM", "locations": [], "entities": {"persons": [{"name": "bekir bozdag", "sentiment": "none"}, {"name": "daren butler", "sentiment": "none"}, {"name": "birsen altayli", "sentiment": "none"}], "locations": [{"name": "istanbul", "sentiment": "none"}], "organizations": [{"name": "constitutional court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISTANBUL/ANKARA (Reuters) - Turkey said on Friday the case of two journalists held for more than a year over alleged ties to a failed coup would be decided by a local court, after the Constitutional Court ruled they be freed, a turnaround likely to deepen concerns for press freedom.\nThe Constitutional Court, Turkey’s highest, ruled on Thursday in favor of freeing the two journalists, Mehmet Altan and Sahin Alpay, on the grounds that their rights had been violated while in custody. Hours later, penal courts decided to keep them in detention.\nThe reversal by the lower courts may stir further worries about media freedom and judicial independence in Turkey in the aftermath of a widespread crackdown. Authorities have shut about 130 media outlets since the failed coup in July 2016. The Turkish Journalists’ Association says about 160 journalists are in jail, most held since the putsch.\n“Whether we like the Constitutional Court’s ruling or not, the authority that will make the right call is the first instance court,” Prime Minister Binali Yildirim said, referring to the local court.\n“Whichever court it is that is making the decision, our expectation from them is to not make decisions that will hinder the battle against FETO,” he said, referring to the network of Muslim cleric Fethullah Gulen, accused by Ankara of plotting the coup. U.S.-based Gulen denies involvement in the coup.\nEarlier on Friday Deputy Prime Minister Bekir Bozdag said the top court had overstepped its limit.\n“When ruling on individual applications, the Constitutional Court... cannot act like a super appeals court and cannot make rulings like such courts,” Bozdag wrote on Twitter.\n“The Constitutional Court has overstepped the limit set out in the constitution and the laws,” he said.\nAltan and Alpay were accused of links to terrorist groups and attempting to overthrow the government and were among more than 50,000 people remanded in custody after the failed putsch. They deny the charges.\nSECURITY THREAT “This is a typical situation that shows that not a trace of justice remains in Turkey,” said Turgut Kazan, the former head of the Istanbul bar.\nTurkey says its sweeping measures are necessary, given the extent of the security threats it faces. Its Western allies, particularly in Europe, have voiced concern that President Tayyip Erdogan is using the coup as a pretext to stifle dissent.\nEuropean Commission President Jean-Claude Juncker on Friday said the EU and Turkey would see no progress in their relations as long as Ankara keeps journalists in prison.\nErdogan has previously criticized similar rulings by the Constitutional Court. In 2016 he said a ruling that led to the release of prominent editor Can Dundar and another detainee hurt Turkey and warned that a repeat of such actions could bring the court’s very existence into question.\nSeparately, Turkey reinstated more than 1,800 civil servants purged after the failed coup, determining they had no links to Gulen’s network, state-run Anadolu news agency said on Friday.\nLast year, prosecutors said they would review legal cases against more than 11,000 people accused of using the ByLock messaging app, finding that some suspects had unintentionally used it after being linked to it from another app.\nTurkey outlawed ByLock after the attempted putsch, saying followers of Gulen used it to communicate on the night of July 15, 2016, when rogue soldiers commandeered tanks and warplanes to attack parliament, killing more than 240 people.\nAdditional reporting by Gulsen Solaker in Ankara and Ali Kucukgocmen in Istanbul; Writing by David Dolan; Editing by William Maclean and Gareth Jones\n ", "external_links": [], "published": "2018-01-12T07:31:00.000+02:00", "crawled": "2018-01-12T07:51:16.003+02:00", "highlightTitle": ""}