{"organizations": [], "uuid": "2b5af2606b99ba21c772e86fa9b2c182fda1255f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-649468160.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/chocolate-going-extinct-2050-cacao-cocoa-climate-change/", "country": "US", "domain_rank": 1196, "title": "Commentary: How We Can Save Chocolate From Going Extinct | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.124, "site_type": "news", "published": "2018-01-24T02:00:00.000+02:00", "replies_count": 0, "uuid": "2b5af2606b99ba21c772e86fa9b2c182fda1255f"}, "author": "David Guest", "url": "http://fortune.com/2018/01/24/chocolate-going-extinct-2050-cacao-cocoa-climate-change/", "ord_in_thread": 0, "title": "Commentary: How We Can Save Chocolate From Going Extinct | Fortune", "locations": [], "entities": {"persons": [{"name": "david", "sentiment": "negative"}], "locations": [{"name": "west africa", "sentiment": "none"}, {"name": "ghana", "sentiment": "none"}, {"name": "sahara", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By David Guest January 24, 2018 \nStories of a cacao shortage—or extinction—are guaranteed to strike fear into the hearts of chocolate makers and consumers alike. The most recent media coverage suggests we will run out of chocolate by 2050 because of climate change in West Africa. Is this serious, or is the prediction just a story for a slow news day? \nAbout 70% of the world’s cacao beans come from West Africa, primarily Côte d’Ivoire and Ghana, where equatorial warm, wet climates favor the growth of the cacao tree. Changes in the weather there, such as the notorious hot, dry Sahel winds from the Sahara at flowering time or heavy rains during harvest, lead to crop failure, and consequently dramatic rises in global cacao prices. Climate change is predicted to cause both long dry spells and erratic, intense weather events, both of which are bad for cacao and will have a similar effect on markets. So there is some truth to this story. \nYet the real picture is more complex. Researchers have developed technologies to manage the impacts of climate change and triple global yield averages, and millions have been spent to train farmers to use this technology. These technologies have the potential to keep cacao farming alive despite the ravages of climate change. \nDespite these technological advances, farmers have not adopted them. Why? One factor is the lack of a financial incentive. Any crop management intervention takes about six months to have an effect, and prices can change significantly during that time period due to the notoriously volatile weather in West Africa. For instance, farmers choosing to invest in cacao farming in mid-August 2016, when prices approached $3,200 a ton, would find prices at around $2,000 a ton in mid-February 2017, when their efforts materialized— a drop of nearly 40% . \nA second factor is the lack of capacity of farmers to implement the training they have been given. Partly this is because training is usually designed without understanding the socioeconomic context of cacao farming. Adoption of new technologies is but one component of livelihood choices made by families. Few farmers have formal access to finance. Rural families suffer poor health and malnutrition—our recent studies of cacao farming families in Indonesia and Papua New Guinea show rates of childhood stunting of 50% and 80%, respectively. A third of farmers report blurry vision, and another quarter report backaches and arthritis. Women are neglected in support and training programs. Young people leave for more secure employment in towns and cities. \nGrowing cacao is simply not profitable for most smallholder farmers who are trapped in cycles of low income, low investment, aging, and poor health. Consequently, many have switched to more profitable crops like corn or palm oil to feed their families. The real threat to cacao production isn’t climate change, it is the inability of smallholder cacao farmers to enjoy healthy and rewarding livelihoods. \nSatisfying our demand for chocolate in 2050 will require significant changes to the industry. One change is to increase and stabilize the price of cacao beans to make farming more competitive, for example by decommoditizing the cacao bean market to reward higher quality. Combining market incentives with holistic approaches to improving farmer livelihoods by diversifying incomes, raising financial literacy, and improving health and education will secure the futures of smallholder cacao farming. \nSecond, just as modern horticulture in developed economies has become industrialized, similar technologies can be applied to cacao farming. In parallel, these approaches promise to meet demands for commodity and specialty markets. Chocolate will not disappear, but it will and should become more expensive. \nDavid Guest is a professor of plant pathology and the leader of development agriculture at the Sydney Institute of Agriculture in the School of Life and Environmental Sciences at the University of Sydney. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-24T02:00:00.000+02:00", "crawled": "2018-01-25T14:57:42.027+02:00", "highlightTitle": ""}