{"organizations": [], "uuid": "a856fc162f919debc0a28597b10d8ab6d1b64fa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-xponential-fitness-acquires-nyc-based-row-house.html", "country": "US", "domain_rank": 767, "title": "Xponential Fitness Acquires NYC-Based Row House", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-10T18:40:00.000+02:00", "replies_count": 0, "uuid": "a856fc162f919debc0a28597b10d8ab6d1b64fa9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-xponential-fitness-acquires-nyc-based-row-house.html", "ord_in_thread": 0, "title": "Xponential Fitness Acquires NYC-Based Row House", "locations": [], "entities": {"persons": [{"name": "eric", "sentiment": "none"}, {"name": "debra von frohlich", "sentiment": "none"}], "locations": [{"name": "costa mesa", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "row house", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "xponential fitness", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COSTA MESA, Calif., Jan. 10, 2018 /PRNewswire/ -- Just weeks after its creation, Xponential Fitness , the holding entity that curates the best brands in every vertical of the boutique fitness space, has added yet another brand to its growing portfolio. The latest acquisition for Xponential Fitness is New York City-based rowing concept, Row House . With industry experts including The Associated Press predicting that indoor rowing will quickly become the new boutique fitness go-to in 2018, the timing was right for Xponential's acquisition of the successful brand.\nCreated by Eric and Debra Von Frohlich, fitness industry veterans, Row House is a boutique rowing concept that strives to give people of all different fitness levels an efficient, high-cardio, full-body workout in less than one hour. It distinguishes itself from other group fitness concepts built on insecurity and competition by creating an environment that raises everyone up so they come together, rowing on the same rhythm, with the same flow and energy. Rowing has long been recognized by serious athletes as one of the most effective forms of full-body exercise and Row House's workout stays true to form. Targeting the upper body, lower body, and core all at once, the brand's fitness program offers an energetic, endorphin-boosting workout in a safe, inspiring, and inclusive environment. Currently there are three Row House locations open and operating in Manhattan; Columbus Circle, Chelsea and Upper East Side.\n\"In addition to the broad range of offerings that currently exist under Xponential Fitness, we are thrilled to add Row House to our family,\" said Anthony Geisler, CEO of Xponential Fitness. \"The concept is unlike any other and only further solidifies us as the largest provider of fitness brands in the country.\"\nEstablished to bring the best of boutique fitness brands together under one umbrella, Xponential Fitness is the first step in Geisler's long-term plan to house the best brands in every vertical of the boutique fitness industry and cement continued growth both domestically and internationally for each concept. Currently, Xponential Fitness' portfolio of brands includes Club Pilates, the nation's largest and fastest growing Pilates franchise, CycleBar, the first and only premier indoor cycling franchise and L.A.-based StretchLab, a concept offering one-on-one personalized stretching services. Row House marks the fourth brand in Xponential's portfolio.\nAbout Xponential Fitness:\nFounded in 2017, Xponential Fitness is the curator of the best brands across every vertical in the boutique fitness space – including Pilates, cycle, stretch and rowing. Currently, Xponential Fitness' portfolio of brands includes Club Pilates, the nation's largest and fastest growing Pilates franchise, CycleBar, the first and only premier indoor cycling franchise, L.A.-based StretchLab, a concept offering one-on-one personalized stretching services and most recently, Row House.\nMedia Contact: Julianne Stevenson, Fishman Public Relations, jstevenson@fishmanpr.com or 847-945-1300 x239\nView original content with multimedia: http://www.prnewswire.com/news-releases/xponential-fitness-acquires-nyc-based-row-house-300580775.html\nSOURCE Xponential Fitness", "external_links": ["https://www.apnews.com/e03110dc886a4f54ba3b3241805b4094/Rowing,-rebounders,-boxing-among-2018%27s-top-fitness-trends", "http://www.rowhousenyc.com/", "http://xponential.com/", "http://www.prnewswire.com/news-releases/xponential-fitness-acquires-nyc-based-row-house-300580775.html"], "published": "2018-01-10T18:40:00.000+02:00", "crawled": "2018-01-10T20:18:01.006+02:00", "highlightTitle": ""}