{"organizations": [], "uuid": "6643ad8b5f84a103afbe1ff825d41e04bf5fcd23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223395449&w=1200&r=LYNXMPEE0I1AY", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/us-people-michael-douglas/actor-michael-douglas-accused-of-sexual-misconduct-in-1980s-idUKKBN1F826F", "country": "US", "domain_rank": 408, "title": "Actor Michael Douglas accused of sexual misconduct in 1980s", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T19:09:00.000+02:00", "replies_count": 0, "uuid": "6643ad8b5f84a103afbe1ff825d41e04bf5fcd23"}, "author": "", "url": "https://uk.reuters.com/article/us-people-michael-douglas/actor-michael-douglas-accused-of-sexual-misconduct-in-1980s-idUKKBN1F826F", "ord_in_thread": 0, "title": "Actor Michael Douglas accused of sexual misconduct in 1980s", "locations": [], "entities": {"persons": [{"name": "michael douglas", "sentiment": "negative"}, {"name": "bra", "sentiment": "none"}, {"name": "harvey weinstein", "sentiment": "none"}, {"name": "louis c.k.", "sentiment": "none"}, {"name": "douglas", "sentiment": "none"}, {"name": "allen burry", "sentiment": "none"}, {"name": "kevin spacey", "sentiment": "none"}, {"name": "susan braudy", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 5:26 PM   Actor Michael Douglas accused of sexual misconduct in 1980s Reuters Staff 3 Min Read \nNEW YORK (Reuters) - A woman on Friday publicly accused Oscar-winning actor and producer Michael Douglas of sexual misconduct, saying he had repeatedly harassed her verbally and fondled himself in front of her when she worked for him in the 1980s. \n“He thought he was the king of the world, and that he could humiliate me without any repercussions,” journalist and author Susan Braudy said on NBC News’“Today” show. \nDouglas, 73, issued pre-emptive denials of the story in articles published over the last two weeks, including one in which he called it a fabrication. His publicist, Allen Burry, said on Friday there would be no further comment. \nThe allegations against Douglas were the latest in a lengthy series of accusations by women and men who say they were victimized by high-powered men in the entertainment industry. Movie producer Harvey Weinstein, actor Kevin Spacey and comedian Louis C.K. are among the most prominent men to have been accused. \nBraudy, a former executive at Warner Bros. studios, worked for Douglas’ production company for three years. \nShe said Douglas repeatedly used sexual language in conversations and that his behavior escalated during a work meeting at his New York apartment in 1989 where he groped his crotch in front of her. FILE PHOTO: Actor Michael Douglas arrives for the Chaplin Awards at the Film Society of Lincoln Center in the Manhattan borough of New York, U.S., May 8, 2017. REUTERS/Carlo Allegri/File Photo \n“He slid down to the floor, unbuckled his belt and put his hands inside his trousers,” Braudy told NBC News. “And I could see what he was doing and then he began to fondle himself and I was very scared.” \nShe said she then panicked and ran for the door. \nShe said in the interview that she had told several friends about the incident soon afterwards but was “terrified” to speak out publicly at the time. \nDouglas, in an item published by the Hollywood Reporter on Thursday, called Braudy’s account of an incident at his apartment “an unfortunate and complete fabrication.” He acknowledged inappropriate discussions, but challenged Braudy’s claims of a hostile workplace, the publication said. \nLast week, in an interview with the entertainment industry website Deadline, Douglas denied masturbating in front of a woman who worked for him about 30 years ago, without further identifying her. \n“I felt the need to get ahead of this,” he told Deadline. He said he learned in December that multiple publications were investigating the claim. \nDouglas, who won an Academy Award for best actor in 1988 and for best picture in 1976, said he supported the #MeToo movement by those breaking their silence over past sexual harassment or misconduct, and that he had the support of his wife, actress Catherine Zeta-Jones, and his children. Reporting by Gina Cherelus; Editing by Jonathan Oatis", "external_links": [], "published": "2018-01-19T19:09:00.000+02:00", "crawled": "2018-01-19T20:07:53.001+02:00", "highlightTitle": ""}