{"organizations": [], "uuid": "bcc7daf38576a35ad82a66712ef560ba741926fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220804716&w=1200&r=LYNXMPEE090MN", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-turkey-construction-toki-interview/turkey-to-complete-wall-on-iranian-border-by-spring-2019-idUKKBN1EZ179", "country": "US", "domain_rank": 408, "title": "Turkey to complete wall on Iranian border by spring 2019", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T13:40:00.000+02:00", "replies_count": 0, "uuid": "bcc7daf38576a35ad82a66712ef560ba741926fa"}, "author": "", "url": "https://uk.reuters.com/article/uk-turkey-construction-toki-interview/turkey-to-complete-wall-on-iranian-border-by-spring-2019-idUKKBN1EZ179", "ord_in_thread": 0, "title": "Turkey to complete wall on Iranian border by spring 2019", "locations": [], "entities": {"persons": [{"name": "tuvan gumrukcu", "sentiment": "none"}, {"name": "orhan coskun", "sentiment": "none"}, {"name": "toki", "sentiment": "none"}, {"name": "mehmet ergun turan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "bektas  state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 11:42 AM / Updated 12 minutes ago Turkey to complete wall on Iranian border by spring 2019 Orhan Coskun , Tuvan Gumrukcu 3 Min Read \nANKARA (Reuters) - Turkey has completed more than half of a 144 km (90 mile) wall on its border with Iran and will finish it next spring, the firm building the barrier said, as Ankara secures its frontiers from smuggling, illegal immigration and militant infiltration. Mehmet Ergun Turan, head of Turkey's state housing developer TOKI, speaks during an interview with Reuters in Ankara, Turkey, January 9, 2018. Picture taken January 9, 2018. REUTERS/Umit Bektas \nState housing developer TOKI, better known for low-cost, high-rise apartment blocks in Turkey’s major cities, has also been building a wall on the border with northern Syria where Kurdish fighters and hardline Sunni jihadis hold territory. \n“We started this (Iran wall) in the summer, but the season is very short here. Currently, 80 km of this 144 km has been completed, and when seasonal weather conditions permit, God willing, we will have finished by next spring,” TOKI President Ergun Turan told Reuters. \nPresident Tayyip Erdogan said last year Turkey would build walls along its border with Iraq and part of the border with Iran similar to the nearly completed one on its longest border, with Syria. \nThe wall with Iran, which will stretch along the northern third of Turkey’s Iranian frontier, aims to prevent smuggling and infiltration by Kurdistan Workers Party (PKK) militants, Turkish officials have said. \nSince the construction of the wall along the Syrian border, militants from Islamic State and other groups have also tried to use smuggling routes through Iran into Turkey, they said. \nIn an interview late on Tuesday, Turan said all but a small portion of the wall along the 911 km border with Syria had been finished, despite falling behind schedule because of the weather and security concerns. \n“All but 25-30 km have been completed, including the road... We can say it is at 98 percent,” Turan said, referring to the security roads TOKI is building alongside the walls. \nThe agency is also playing a leading role in government efforts to rebuild parts of southeastern Turkey, which has been damaged by the heavy fighting between the military and Kurdish militants since the collapse of a ceasefire in 2015. \nErgun said TOKI were building 25,000 housing units in the region’s worst-hit areas, and added the agency aimed to deliver 20,000 of those homes by the end of the year. \nTOKI will also construct “industry sites” in three provinces, Ergun said. He said tenders would be held for the three projects, in Aksaray, Bolu and Diyarbakir, by the end of January, totalling up to 1 billion lira (£194.1 million). \nOverall, Ergun said he expected TOKI to build between 60,000 and 65,000 housing units in Turkey this year, after having built 65,000 and 60,000 in 2016 and 2017 respectively, and around 820,000 since 2003. \nHe said TOKI would invest around 16 billion lira in projects this year, adding that half of the projects be in housing while the other half in government projects including stadiums, hospitals and schools. Writing by Tuvan Gumrukcu; Editing by Dominic Evans", "external_links": [], "published": "2018-01-10T13:40:00.000+02:00", "crawled": "2018-01-10T13:59:06.008+02:00", "highlightTitle": ""}