{"organizations": [], "uuid": "2cbec8cb57a1db8bb0dd942747e120ba80de01a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/russia", "section_title": "Russia", "url": "https://www.reuters.com/article/us-russia-markets/russian-stocks-shrug-off-u-s-oligarchs-list-idUSKBN1FJ16T", "country": "US", "domain_rank": 408, "title": "Russian stocks, rouble shrug off U.S. oligarchs' list", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:51:00.000+02:00", "replies_count": 0, "uuid": "2cbec8cb57a1db8bb0dd942747e120ba80de01a4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-russia-markets/russian-stocks-shrug-off-u-s-oligarchs-list-idUSKBN1FJ16T", "ord_in_thread": 0, "title": "Russian stocks, rouble shrug off U.S. oligarchs' list", "locations": [], "entities": {"persons": [{"name": "vladimir putin", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "rts", "sentiment": "none"}, {"name": "moscow stock exchange", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - Russian assets showed little reaction to Tuesday’s release of a U.S. report naming major Russian businessmen among a list of people close to President Vladimir Putin, with stocks and the rouble both firmer by afternoon trade.\nPublication of the U.S. Treasury department’s “oligarchs’ list” had threatened to prompt a sell-off in Russian assets but its impact was blunted by the United States saying on Monday that it would not immediately impose new sanctions on Russia.\nThe list of 210 people nevertheless casts a shadow of potential sanctions risk over some of Russia’s biggest firms. Putin labeled the list an “unfriendly act” that would further complicate relations between Moscow and Washington.\nStocks had dipped in early trade, led by shares in major banks and companies whose bosses were named on the U.S. list, but soon recovered.\nThe Moscow Stock Exchange’s dollar-denominated RTS index was up 1.15 percent at 1,290.21 points as of 1217 GMT after briefly touching its lowest since Jan. 19 at 1,266.48.\nThe rouble-based MOEX Russian index, previously known as MICEX, was 0.3 percent higher at 2,290.19 points, inching toward an all-time high of 2,328.48 it hit last week.\n“Really, a ‘black swan’ has not occurred, but the message of a worsening of bilateral relations is quite clear,” said Danske Bank analyst Vladimir Miklashevsky.\nHe said investors would be reassured that Russian central bank governor Elvira Nabiullina was not named on the list.\nThe central bank declined to comment on any possible market impact of the U.S. report.\nThe Russian rouble strengthened, shrugging off a 0.6 percent decline in Brent crude futures to $69.06 per barrel.\nAgainst the dollar, the rouble gained 0.6 percent to 55.98, heading toward its strongest level since early July 2015 it hit last Thursday.\nVersus the euro, the rouble was 0.3 percent stronger at 69.51.\nWESTERN RESPONSE Shares in Sberbank, Russia’s no.1 lender, whose chairman German Gref was named on the list, rallied to an all-time high of 258.96 rubles ($4.63) after nodding lower at the market opening.\nAnother U.S. report outlining potential restrictions on investment by foreigners in Russian government debt was not published on Tuesday as many had expected.\nThat helped push yields on Russia’s 10-year OFZ bonds lower, to 7.33 percent from around 7.43 percent.\n“Non-residents have started buying OFZ bonds but rather cautiously,” said Alexei Pogorelov, an economist with Credit Suisse in London.\nING chief economist Dmitry Polevoy said the response from Western business partners would determine the list’s impact.\n“It will be important how Western, European businesses react since they do, in one way or another, work with the companies whose owners are now on this list,” Polevoy said.\n“Whether or not there’s some real effect from this list depends on their reaction.”\nFor rouble poll data see reuters://realtime/verb=Open/url=cpurl://apps.cp./Apps/fx-polls?RIC=RUB=\nFor Russian equities guide see <RU/EQUITY>\nFor Russian treasury bonds see <0#RUTSY=MM>\nRussia in graphics: link.reuters.com/dun63s\n($1 = 55.9447 rubles)\nAdditional reporting by Elena Fabrichnaya; Writing by Polina Ivanova and Andrey Ostroukh; Editing by Catherine Evans\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T17:51:00.000+02:00", "crawled": "2018-01-30T16:43:43.000+02:00", "highlightTitle": ""}