{"organizations": [], "uuid": "14c7fc81f022db7bd53e7c43a98c8aa77846f31d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/14/104841919-Capra.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/bulls-are-betting-this-market-will-be-the-g-o-a-t-greatest-of-all-time.html", "country": "US", "domain_rank": 767, "title": "Bulls are betting this market will be the G.O.A.T. (greatest of all time)", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.173, "site_type": "news", "published": "2018-01-08T13:58:00.000+02:00", "replies_count": 0, "uuid": "14c7fc81f022db7bd53e7c43a98c8aa77846f31d"}, "author": "Michael Santoli", "url": "https://www.cnbc.com/2018/01/08/bulls-are-betting-this-market-will-be-the-g-o-a-t-greatest-of-all-time.html", "ord_in_thread": 0, "title": "Bulls are betting this market will be the G.O.A.T. (greatest of all time)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "venture capital bulls", "sentiment": "positive"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "5 Hours Ago | 01:19 \nTo be aggressively optimistic on this stock market now is to bet that it can challenge the greatest bull market of all-time — the 13-year run that ended in early 2000 . \nIn terms of its cumulative gains, persistence, valuation and the public's exposure to stocks, only the final years of the 1990s advance sit at higher elevations. \nThis might sound scary, given how singular that bubbly period now seems — and given the brutal wealth destruction that followed. And it should be sobering, in terms of what it means for longer-term expected equity returns. \nBut here's the good news, for now. First, this market is hinting that it's accelerating in that direction. There's also a good deal of room overhead in terms of price gains between where we are and the late-'90s extremes. And, finally, in the areas where today's backdrop differs from the 1987-2000 version, the current one looks better in terms of corporate fundamentals and capital-markets behavior. \nIn two months, the climb from the depths of the financial crisis market low is set to reach nine years. The overall S&P 500 gain is now 306 percent, not including dividends. That's better than any other except the 1987-2000 glory run — which was a stunning 582 percent. \nThe annualized gain since March 2009 is nearly 16 percent. That's well above the long-term average, but then again, when major bull markets have ended, the trailing 10-year annualized gain has often topped 20 percent. \n(There is no absolute definition of bull markets. Some quibble that the recovery from the 2009 low didn't turn into a wholly new bull market until it hit a fresh record high in early 2013. Others say the 1990 setback or the tumble in late-2015 into early 2016 was effectively a mini-bear market that reset the clock. Fair enough — that's what makes market debates.) \nValuation — whether based on the past year's reported earnings, forecast earnings for the coming year or the fun-spoiling Shiller-CAPE measure using 10 years of average profits — all show U.S. stocks more richly valued than any period except the late-'90s. \nThe trailing 12-month price/earnings multiple for the S&P 500 is now approaching 23. Once again, the tech bubble was so extreme that there remains plenty of room between here and that peak. \nAs Bespoke Investment Group says, the P/E \"didn't once get above this level during the 2002-2007 bull market, but it was consistently above 23 during the final three years of the bull market that ended in early 2000. From 1998 to 2000, the S&P's P/E expanded from 23 up to 30+.\" \nSource: Bespoke Investment Group \nLeuthold Group notes that last week's strong start to the year took the S&P's price-to-sales ratio above where it was at the year-2000 market peak. This speaks to today's high profit margins — boosted in part by madly profitable winner-take-most tech giants. \nHigh hopes are also implicit in investors' elevated equity holdings. There remains a stubborn narrative that the little guy has boycotted this bull market , but it likely relies too much on traditional mutual-fund flow stats and doesn't recognize that individuals have let stock allocations stretch higher with share prices. \nThe monthly asset-allocation survey of American Association of Individual Investors shows stocks at 72 percent of member portfolios, highest since 2000, when they peaked at 77 percent. The Fed's measure of household equity holdings shows a similar trend. And cash reserves in Charles Schwab client accounts recently hit an all-time low. \nSource: J. Lyons Funds Management \nMichael Hartnett, strategist at Bank of America Merrill Lynch, has been calling for a crescendo of investor confidence for some time and believes this \"Icarus trade\" is still rising but isn't yet high enough to melt the market's wings. He's waiting for stock holdings of BAML retail clients to exceed 63 percent (now 60.8) and institutional-client cash levels to drop below 4 percent (now 4.7). \nThis has become a popular stance: Conceding the market is expensive and the mood is getting giddy but expecting an even more intense public-participation phase to carry equities higher before there's any reckoning. Value investor Jeremy Grantham of GMO last week effectively called for a manic \"bubble phase\" soon for stocks. \nIt's all pretty neat and tidy, with the added virtue of being plausible — and supported by the market's behavior itself. Market breadth is healthy. Only three of Citigroup's 18 indicators of a coming bear market are flashing red. Last week's 2.6-percent S&P 500 gain in four days would have made it the best week of 2017, a sign of expanding risk-taking appetites and more eagerness among buyers. \nFor sure, in the very short term, tactical sentiment signals are flashing a yellow light. The Daily Sentiment Index of professional traders for stocks hit 95 percent bulls late last week. Citi's Panic-Euphoria Index edged into \"euphoria\" in recent days for only the second time during this bull market. \nAnd we're pushing 400-straight trading days without even a 5 percent market dip, rivaling the longest ever streak. The way the three prior ones eventually ended? With a decline of \"more than 7 percent over 30-40 days,\" says Jason Goepfert of SentimenTrader.com — but none marked the end of a bull market. \nIf this market run is ultimately to end in overconfidence and silly economic distortions, we're not there yet. Stock-sector weightings remain right in line with their earnings contribution, unlike in 2000. There's no rush of wild initial public offerings — or even many at all, which keeps alive the idea of lots of cash chasing scarce assets. \nWe've scaled the wall of worry, and everyone likes the view. Tech giants coining money in a deflationary innovation boom are thriving alongside cyclical \"reflation\" sectors feeding a global production surge. \nGobs of \"house money\" winnings have accrued in investment accounts, boosting risk appetites and likely buffering the downside on the first gut check. The corporate tax cut has arrived just in time to furnish a new bullish story line and provide an alibi for stretched valuations. \nSo what could possibly go wrong? Michael Santoli CNBC Senior Markets Commentator Related Securities", "external_links": [], "published": "2018-01-08T13:58:00.000+02:00", "crawled": "2018-01-08T13:59:20.037+02:00", "highlightTitle": ""}