{"organizations": [], "uuid": "bb03bc59a93f8d145cfa8db0e400128983185bf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-whats-happening-with-these-oil-gas-pipelines-stocks--energy-transfer-partners-magellan-midstream-partners-nustar-energy-and.html", "country": "US", "domain_rank": 767, "title": "What's Happening With These Oil & Gas Pipelines Stocks? -- Energy Transfer Partners, Magellan Midstream Partners, NuStar Energy, and Rice Midstream Partners", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.986, "site_type": "news", "published": "2018-01-30T14:20:00.000+02:00", "replies_count": 0, "uuid": "bb03bc59a93f8d145cfa8db0e400128983185bf6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-whats-happening-with-these-oil-gas-pipelines-stocks--energy-transfer-partners-magellan-midstream-partners-nustar-energy-and.html", "ord_in_thread": 0, "title": "What's Happening With These Oil & Gas Pipelines Stocks? -- Energy Transfer Partners, Magellan Midstream Partners, NuStar Energy, and Rice Midstream Partners", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "energy transfer partners", "sentiment": "negative"}, {"name": "rice midstream partners", "sentiment": "negative"}, {"name": "magellan midstream partners", "sentiment": "negative"}, {"name": "nustar energy", "sentiment": "negative"}, {"name": "mmp", "sentiment": "none"}, {"name": "magellan midstream partners l.p.", "sentiment": "none"}, {"name": "texas-based energy transfer partners l.p.", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "rmp", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "rice midstream partners l.p.", "sentiment": "none"}, {"name": "wallstequities.com on energy transfer partners l.p.", "sentiment": "none"}, {"name": "nustar energy l.p.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 30, 2018 /PRNewswire/ -- WallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on ETP, MMP, NS, and RMP which can be accessed for free by signing up to www.wallstequities.com/registration . Research reports have been issued by WallStEquities.com on Energy Transfer Partners L.P. (NYSE: ETP), Magellan Midstream Partners L.P. (NYSE: MMP), NuStar Energy L.P. (NYSE: NS), and Rice Midstream Partners L.P. (NYSE: RMP). These stocks operate in the Oil and Gas Pipelines space, which transports fuel through pipelines, often over great distances. All you have to do is sign up today for this free limited time offer by clicking the link below. www.wallstequities.com/registration\nEnergy Transfer Partners\nOn Monday, shares in Dallas, Texas-based Energy Transfer Partners L.P. saw a decline of 2.81%, ending the day at $20.07. The stock recorded a trading volume of 5.65 million shares. The Company's shares have advanced 11.31% in the last month and 20.90% over the previous three months. The stock is trading above its 50-day and 200-day moving averages by 11.96% and 2.89%, respectively. Moreover, shares of the Company, which engages in the natural gas midstream, and intrastate transportation and storage businesses in the US, have a Relative Strength Index (RSI) of 63.48.\nOn January 05 th , 2018, research firm Credit Suisse initiated an 'Outperform' rating on the Company's stock, with a target price of $20 per share.\nOn January 16 th , 2018, Energy Transfer Partners (ETP); Energy Transfer Equity, L.P.; and USA Compression Partners, L.P. (\"USAC\") announced a transaction valued at approximately $1.8 billion, providing for (i) the contribution of ETP's subsidiaries, CDM Resource Management LLC and CDM Environmental & Technical Services LLC, to USAC and (ii) the cancellation of the incentive distribution rights in USAC and conversion of the general partner interest in USAC into a non-economic general partner interest. Get the full research report on ETP for free by clicking below at: www.wallstequities.com/registration/?symbol=ETP\nMagellan Midstream Partners\nShares in Tulsa, Oklahoma headquartered Magellan Midstream Partners L.P. ended the day 1.80% lower at $73.50 with a total trading volume of 690,057 shares. In the last month and the previous three months, the stock has gained 5.59% and 9.07%, respectively. The Company's shares are trading above their 50-day and 200-day moving averages by 5.57% and 4.59%, respectively. Furthermore, shares of the Company have an RSI of 57.80.\nOn January 05 th , 2018, research firm Credit Suisse initiated an 'Underperform' rating on the Company's stock, with a target price of $61 per share.\nOn January 23 rd , 2018, Magellan Midstream Partners' Board of Directors has increased the Partnership's quarterly cash distribution to 92 cents per unit for the period October 01 st , 2017 through December 31 st , 2017. The new distribution, which equates to $3.68 per unit on an annualized basis, will be paid on February 14 th , 2018 to unitholders of record at the close of business on February 06 th , 2018. Today's complimentary research report on MMP is accessible at: www.wallstequities.com/registration/?symbol=MMP\nNuStar Energy\nAt the close of trading on Monday, shares in San Antonio, Texas headquartered NuStar Energy L.P. finished 3.33% lower at $33.68 with a total trading volume of 409,035 shares. The stock has advanced 13.75% in the last month and 0.63% over the previous three months. The Company's shares are trading above their 50-day moving average by 9.29%. Additionally, NuStar Energy's stock has an RSI of 58.74.\nOn January 22 nd , 2018, NuStar Energy and NuStar GP Holdings, LLC announced that they will host a joint conference call on February 08 th , 2018, at 9:00 a.m. CT to discuss their Q4 2017 earnings results, which will be released earlier that day. The live presentation of the call may be accessed on both companies' websites. Register now for your free research document on NS at: www.wallstequities.com/registration/?symbol=NS\nRice Midstream Partners\nCanonsburg, Pennsylvania headquartered Rice Midstream Partners L.P.'s shares recorded a trading volume of 770,247 shares at the end of yesterday's session, which was above their three months average volume of 414,410 shares. The stock closed the day 2.56% lower at $21.32. The Company's shares have advanced 1.77% in the past month and 6.28% in the previous three months. The stock is trading above its 50-day moving average by 0.08%. Additionally, shares of Rice Midstream Partners have an RSI of 44.09.\nOn January 18 th , 2018, Rice Midstream Partners declared a quarterly cash distribution of $0.2917 per unit for Q4 2017. The distribution will be paid on February 14 th , 2018, to all Company unitholders of record at the close of business on February 02 nd , 2018. The quarterly cash distribution is 4% higher than the third quarter of 2017, and 16% higher than the fourth quarter of 2016.\nOn January 29 th , 2018, research firm Johnson Rice downgraded the Company's stock rating from 'Accumulate' to 'Hold'. Click on the link below and see our free report RMP at: www.wallstequities.com/registration/?symbol=RMP\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither WSE nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit https://wallstequities.com/legal-disclaimer/\nFor any questions, inquiries, or comments reach out to us directly. If you're a company, we are covering and wish to no longer feature on our coverage list contact us via email and/or phone between 09:30 EDT to 16:00 EDT from Monday to Friday at:\nEmail: info@wallstequities.com\nPhone number: +21-32-044-483\nOffice Address: 1 Scotts Road #24-10, Shaw Center Singapore 228\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\nView original content: http://www.prnewswire.com/news-releases/whats-happening-with-these-oil--gas-pipelines-stocks----energy-transfer-partners-magellan-midstream-partners-nustar-energy-and-rice-midstream-partners-300590114.html\nSOURCE Wall St. Equities", "external_links": ["http://www.wallstequities.com/registration/?symbol=MMP", "http://www.wallstequities.com/registration/?symbol=ETP", "https://wallstequities.com/legal-disclaimer/", "http://www.prnewswire.com/news-releases/whats-happening-with-these-oil--gas-pipelines-stocks----energy-transfer-partners-magellan-midstream-partners-nustar-energy-and-rice-midstream-partners-300590114.html", "http://www.wallstequities.com/registration/?symbol=NS", "http://www.wallstequities.com/registration/?symbol=RMP", "http://www.wallstequities.com/registration"], "published": "2018-01-30T14:20:00.000+02:00", "crawled": "2018-01-30T15:34:18.008+02:00", "highlightTitle": ""}