{"organizations": [], "uuid": "6033ba41a8365a9609c4d923bab1482ce3e4d1ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/31/102883297-RTR4LX70.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/09/oil-prices-hit-highest-since-2014-but-analysts-warn-of-overheated-market.html", "country": "US", "domain_rank": 767, "title": "Oil prices hit highest since 2014, but analysts warn of overheated market", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.064, "site_type": "news", "published": "2018-01-10T04:19:00.000+02:00", "replies_count": 0, "uuid": "6033ba41a8365a9609c4d923bab1482ce3e4d1ef"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/oil-prices-hit-highest-since-2014-but-analysts-warn-of-overheated-market.html", "ord_in_thread": 0, "title": "Oil prices hit highest since 2014, but analysts warn of overheated market", "locations": [], "entities": {"persons": [{"name": "william o'loughlin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "rivkin securities", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "ec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Crude oil prices rose but backed away from multi-year highs on Wednesday after U.S. government data showed an increase in fuel inventories and a falloff in refining activity.\nA broad, global market rally, including stocks, has also been fueling investment into crude oil futures, but analysts warned of possible overheating.\nU.S. crude inventories fell 4.9 million barrels last week, more than the 3.9-million decline forecast, but bigger-than-expected builds in gasoline and fuel stocks offset that drawdown, the Energy Information Administration reported.\nThe market was also bolstered modestly by data showing a sharp decline in U.S. production last week that analysts say could have been the result of extreme cold temperatures across the United States to start the year.\n\"The lower draw in crude oil stocks, combined with the strong builds in product stocks is bearish news for prices. But market participants could also use the sharp drop in production as an excuse to buy,\" said Carsten Fritsch, oil analyst at Commerzbank AG in Frankfurt, Germany.\nshow chapters Oil in the first two quarters 2:06 PM ET Tue, 9 Jan 2018 | 00:15 U.S. West Texas Intermediate (WTI) crude futures ended Wednesday's trade up 61 cents at $63.57 a barrel, its best closing level since Dec. 9, 2014. The contract rose earlier to $63.67, also its highest since Dec. 9, 2014.\nBrent crude futures rose 34 cents to $69.16 a barrel by 2:29 p.m. ET. Brent earlier hit $69.37, the highest since May 2015.\nGasoline stocks rose by 4.1 million barrels, compared with analysts' expectations in a Reuters poll for a 2.6 million-barrel gain. Distillate stockpiles, which include diesel and heating oil, rose by 4.3 million barrels, versus expectations for a 1.5 million-barrel increase, the EIA data showed.\n\"We're still drawing U.S. stocks and that continues to support a very positive sentiment,\" said Olivier Jakob, managing director of PetroMatrix.\nHe noted that physical Brent was above $70 per barrel — a psychologically important level that Jakob says will trigger discussion among OPEC members about oil policy.\nThe Organization of the Petroleum Exporting Countries , together with Russia and a group of other producers, last November extended an output-cutting deal to cover all of 2018.\nThe cuts were aimed at reducing a global supply overhang that had dogged oil markets since 2014.\nThe U.S. Energy Information Administration (EIA) raised its 2018 world oil demand growth forecast by 100,000 barrels per day (bpd) from its previous estimate.\nshow chapters Commodities tomorrow: Inventories, demand drive crude higher 3:29 PM ET Tue, 9 Jan 2018 | 00:37 Oil prices have risen more than 13 percent since early December, and there are indications of overheating. Analysts warned that the market is ignoring U.S. production increases at its peril.\nIn the latest week, U.S. output fell by nearly 300,000 barrels a day to 9.49 million barrels a day, EIA said. However, U.S. crude oil production is expected to hit 10 million bpd next month. Only Russia and Saudi Arabia produce at higher levels.\n\"Selective perception is the reason why the market is completely ignoring this just now,\" Commerzbank analyst Carsten Fritsch said. \"Attention is paid only to news that tallies with the picture of rising prices.\"\nIn Asia, the world's biggest oil-consuming region, refiners are suffering from high prices and ample fuel supplies.\nAsian oil prices are higher than in the rest of the world. While Brent and WTI are below $70 per barrel, the average price for Asian crude grades has risen to $70.62, Thomson Reuters Eikon data showed.", "external_links": [], "published": "2018-01-10T04:19:00.000+02:00", "crawled": "2018-01-10T04:06:36.010+02:00", "highlightTitle": ""}