{"organizations": [], "uuid": "22b86e2f574e3c35f2c4407c534224d47958ebcd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-vietnam-security/fugitive-vietnamese-tycoon-remains-in-singapore-lawyer-says-idUKKBN1ES07I", "country": "US", "domain_rank": 408, "title": "Fugitive Vietnamese tycoon remains in Singapore, lawyer says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T06:35:00.000+02:00", "replies_count": 0, "uuid": "22b86e2f574e3c35f2c4407c534224d47958ebcd"}, "author": "", "url": "https://uk.reuters.com/article/uk-vietnam-security/fugitive-vietnamese-tycoon-remains-in-singapore-lawyer-says-idUKKBN1ES07I", "ord_in_thread": 0, "title": "Fugitive Vietnamese tycoon remains in Singapore, lawyer says", "locations": [], "entities": {"persons": [{"name": "remy choo", "sentiment": "none"}, {"name": "phan van anh vu", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 4:40 AM / Updated 22 minutes ago Vietnam tycoon held in Singapore fears for well-being because of 'internal politics' at home John Geddie 2 Min Read \nSINGAPORE (Reuters) - A Vietnamese tycoon detained in Singapore has concerns for his well-being because of “internal politics” in his home country, where he says he served as a senior intelligence officer, one of his lawyers told Reuters on Wednesday. \nProperty developer Phan Van Anh Vu, 42, is wanted in Vietnam for revealing state secrets, media say. He was detained in Singapore last week as he tried to leave for Malaysia. \nSerious security offences such as revealing state secrets can carry the death penalty in Vietnam. \nHis case adds a new international dimension to a Vietnamese corruption crackdown that has led to the arrest of dozens of officials and business figures and is entangled with political intrigue in the single-party communist state. \n“He said he has well-founded concerns for his well-being. They relate to internal Vietnamese politics,” said Remy Choo, one of at least three lawyers representing Vu, adding that his client said he was formerly a senior intelligence officer in Vietnam. \nAfter meeting Vu for the first time on Wednesday, Choo said his client did not know why he had been detained in Singapore, believed he had valid travel documents and wanted to travel to Germany. \nSingapore’s Immigration and Checkpoints Authority, which has the power to repatriate people under certain circumstances, said Vu was arrested on Dec. 28 for committing offences under the Immigration Act. \nVu’s lawyers have applied to Germany to grant him passage. One lawyer said his rank in the secret service meant he could give details of an operation in which Germany says a Vietnamese oil executive was kidnapped in a Berlin park last summer and bundled home to face trial. \nHis lawyers have written to Singapore immigration authorities and filed a application to Singapore’s High Court to try to find out why Vu was detained. \nA date has been set for a court hearing on Jan 18, one of his lawyers said. Reporting by John Geddie; Editing by Paul Tait and Nick Macfie", "external_links": [], "published": "2018-01-03T06:35:00.000+02:00", "crawled": "2018-01-03T06:59:10.021+02:00", "highlightTitle": ""}