{"organizations": [], "uuid": "3b062c48023ca50d004859781bd2ec18145b54cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221106444&w=1200&r=LYNXMPEE0A0QO", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-california-mudslides/rescuers-race-against-time-to-find-missing-in-california-mudslides-idUSKBN1F01B8", "country": "US", "domain_rank": 408, "title": "Rescuers race against time to find missing in California mudslides", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T13:16:00.000+02:00", "replies_count": 0, "uuid": "3b062c48023ca50d004859781bd2ec18145b54cf"}, "author": "", "url": "https://www.reuters.com/article/us-california-mudslides/rescuers-race-against-time-to-find-missing-in-california-mudslides-idUSKBN1F01B8", "ord_in_thread": 0, "title": "Rescuers race against time to find missing in California mudslides", "locations": [], "entities": {"persons": [{"name": "alan devall", "sentiment": "none"}, {"name": "rollo ross", "sentiment": "none"}, {"name": "bill brown", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}, {"name": "los padres national forest", "sentiment": "none"}, {"name": "calif", "sentiment": "none"}, {"name": "santa barbara county", "sentiment": "none"}, {"name": "pacific ocean", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "kcal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA BARBARA, Calif. (Reuters) - Rescue workers on Thursday searched for eight people missing after mudslides that ripped through a coastal Southern California community, as the identities of some of the 17 who died in Tuesday’s disaster began trickling out. \nSome 700 rescue workers in helicopters and high-wheeled military vehicles picked through waist-deep mud in the hunt for the missing in a disaster zone littered with the remnants of hundreds of damaged or destroyed homes. \n“The focus is still on search and rescue; that’s still our primary goal,” Amber Anderson, a spokeswoman for the Santa Barbara County Fire Department, said in a phone interview, adding that searchers have been working 24-hour days. \nThe dead included an elderly woman killed when the mud washed away her house, the founder of a Roman Catholic school and a real estate executive, according to friends, family and local news media. \nHeavy rains on hillsides that had been denuded by last year’s record wildfires triggered the deadly floods that destroyed 100 homes and injured at least 28 people, officials said. \nThe region’s natural beauty and easy access to Los Angles to the southeast has long attracted the rich and powerful, including media mogul and actress Oprah Winfrey, talk-show host Ellen DeGeneres and actor Jeff Bridges. \n“Our home has been severely damaged, but we are safe, and so thankful for that and for the first responders who are working tirelessly to save people,” Bridges wrote on Twitter. “We are heartbroken over the loss of lives in our community.” \nSearch and rescue efforts have been slow as crews have had to make their way through waist-deep mud, fallen trees, boulders and other debris. Teams have completed initial searches of the entire debris field and are about a quarter of the way through a more intensive follow-up search of the zone, Anderson said. \nStreets in the region were clogged with mud, downed trees and debris, including bits of destroyed homes and cars and trucks swept away by the mudslides. \nMudflow and damage from mudslides are pictured in this aerial photo taken from a Santa Barbara County Air Support Unit Fire Copter over Montecito, California January 10, 2018. Matt Udkow/Santa Barbara County FD/Handout via REUTERS In addition to destroying 100 homes, the debris flow from the mudslides has damaged hundreds of other structures, officials said. \nNAMES OF THE DEAD Families and friends of the people who died in the mudslides began to identify those lost. \n\nSlideshow (2 Images) The dead included Josie Gower, who died when she was swept away in the mudslides, her daughter-in-law Sarah Gower confirmed in a Facebook post. The 69-year-old woman’s body was found that night, near a highway hit by the slide. \n“I told her to stay on the second floor, but she went downstairs and opened the door and just got swept away,” her son, Hayden Gower, told NBC station KSBY. \n“I should have just told her to leave. You just don’t even think that this is possible,” he said. \nAnother fatality was Roy Rohter, 84, founder of the St. Augustine Academy Roman Catholic school, who died when the slide swept him from his home in Montecito, in the mud’s path, according to school officials and local news media. \nAlso killed in Montecito was Rebecca Riskin, the 61-year-old founder of a real estate firm, according to the company and local news media. She left behind a husband and two children. \nLast month’s spate of wildfires, including the largest in California history, burned away grass and shrubs that held soil in place, and baked a waxy layer into the earth that prevents water from sinking deeply into the ground. \nAdditional reporting by Keith Coffman in Denver, Dan Whitcomb in Los Angeles and Gina Cherelus and Peter Szekely in New York; Writing by Scott Malone and Dan Whitcomb; Editing by Jonathan Oatis\n ", "external_links": [], "published": "2018-01-11T13:16:00.000+02:00", "crawled": "2018-01-11T13:28:11.002+02:00", "highlightTitle": ""}