{"organizations": [], "uuid": "8289dbb90931e7dc45da52c038c95d5b1fd5dd43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/06/15/103715810-GettyImages-535977886.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/25/chinas-stock-market-is-on-a-once-in-a-lifetime-kind-of-rally.html", "country": "US", "domain_rank": 767, "title": "China’s stock market is on a ‘once in a lifetime’ kind of rally", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T22:14:00.000+02:00", "replies_count": 0, "uuid": "8289dbb90931e7dc45da52c038c95d5b1fd5dd43"}, "author": "Keris Lahiff", "url": "https://www.cnbc.com/2018/01/25/chinas-stock-market-is-on-a-once-in-a-lifetime-kind-of-rally.html", "ord_in_thread": 0, "title": "China’s stock market is on a ‘once in a lifetime’ kind of rally", "locations": [], "entities": {"persons": [{"name": "michael bapis", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "the bapis group", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "fxi", "sentiment": "none"}, {"name": "china construction bank", "sentiment": "none"}, {"name": "commercial bank", "sentiment": "none"}, {"name": "hightower advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "China's stock market is on a remarkable winning streak, and one analyst sees its rapid run stretching even further.\n\"The growth will continue and the growth will continue at a rapid pace,\" Michael Bapis, managing director of The Bapis Group at HighTower Advisors, told CNBC's \" Trading Nation \" on Wednesday. \"The expansion that's happening there is rapid, once in a lifetime and we think it's going to continue.\"\nThe iShares China large-cap ETF , also known as the FXI, has had an impressive start to the year already. The ETF, which tracks the 50 largest Chinese stocks on the Hong Kong stock exchange, closed out Wednesday with its 10th day in a row of gains, its longest win streak since late 2006. It was on track to snap that streak Thursday as it was down more than 1 percent at midafternoon.\nHowever, it remains on pace for its seventh straight week in the green, its longest run since mid-2007.\nAs China's economy has matured, stocks in its financials, technology and telecoms sectors have been particularly attractive to investors. China Construction Bank , Industrial and Commercial Bank of China , Ping An Insurance , Bank of China and China Life Insurance – five of the ETF's largest holdings – have seen an average gain of 14 percent in the year to date. Tencent Holdings , the ETF's largest tech holding and the world's fifth-largest internet company, has gained nearly 13 percent in 2018.\nThe ETF is up 14 percent in the year to date, adding to a solid 33 percent gain in 2017. Last year's performance was the its best since 2009. The ETF's 2018 gains are more than double the S&P 500 's 6 percent rise.\nThe FXI's steep ascent could provide some resistance in the short term as it trades in overbought territory, warns Matt Maley , equity strategist at Miller Tabak.\n\"It's getting right up near to its 2015 highs,\" Maley said on \"Trading Nation.\" \"That should provide some resistance here on a near-term basis. It's overbought again, up 100 days in a row, so it could pull back a little bit.\"\nThe FXI ended Wednesday's session above the levels reached in April 2015 and sat around the all-time highs seven years earlier. The ETF's RSI – relative strength index – is at its highest level since 2007 after topping 77 at the end of last week. A level that high suggests the ETF is trading in overbought conditions.\n\nA potential pullback aside, Maley sees strength in China, especially given recent gains in industrial commodities. He sees a strong correlation between the JOC-ECRI industrial commodity index and gains in the FXI.\n\"Industrial commodities have broken out in a major way in the last two months, so much so that it would be very, very odd for it to roll back over and fall apart,\" said Maley. \"If they can hold up, which I think they will, and rally to new highs, China is going to do the same thing.\"\nOutside of the 50 stocks in the FXI, markets in Asia have generally tracked Wall Street. Hong Kong's Hang Seng has added 9 percent so far this year, while the Shanghai composite is up 7 percent.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-25T22:14:00.000+02:00", "crawled": "2018-01-25T22:29:33.000+02:00", "highlightTitle": ""}