{"organizations": [], "uuid": "65abb00b91dfdfe1903ceda390adf39c367e1645", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-technical-perspectives-on-medical-research-stocks--accelerate-diagnostics-biocept-exact-sciences-and-htg-molecular-diagnostics.html", "country": "US", "domain_rank": 767, "title": "Technical Perspectives on Medical Research Stocks -- Accelerate Diagnostics, Biocept, Exact Sciences, and HTG Molecular Diagnostics", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.703, "site_type": "news", "published": "2018-01-29T14:15:00.000+02:00", "replies_count": 0, "uuid": "65abb00b91dfdfe1903ceda390adf39c367e1645"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-technical-perspectives-on-medical-research-stocks--accelerate-diagnostics-biocept-exact-sciences-and-htg-molecular-diagnostics.html", "ord_in_thread": 0, "title": "Technical Perspectives on Medical Research Stocks -- Accelerate Diagnostics, Biocept, Exact Sciences, and HTG Molecular Diagnostics", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "exas", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "htg molecular diagnostics", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "biocept inc.", "sentiment": "none"}, {"name": "bioc", "sentiment": "none"}, {"name": "exas", "sentiment": "none"}, {"name": "wallstequities.com", "sentiment": "none"}, {"name": "four medical laboratories and research", "sentiment": "none"}, {"name": "exact sciences corp.", "sentiment": "none"}, {"name": "accelerate diagnostics inc.", "sentiment": "none"}, {"name": "htg molecular diagnostics inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK,\nWallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on AXDX, BIOC, EXAS, and HTGM which can be accessed for free by signing up to www.wallstequities.com/registration . Four Medical Laboratories and Research stocks have been lined up by WallStEquities.com for assessment today: Accelerate Diagnostics Inc. (NASDAQ: AXDX), Biocept Inc. (NASDAQ: BIOC), Exact Sciences Corp. (NASDAQ: EXAS), and HTG Molecular Diagnostics Inc. (NASDAQ: HTGM). Medical laboratories are independent, commercial enterprises that provide information to the health care professionals about the severity, onset, and reason of patients' physical ailments. All you have to do is sign up today for this free limited time offer by clicking the link below.\nwww.wallstequities.com/registration\nAccelerate Diagnostics\nArizona headquartered Accelerate Diagnostics Inc.'s stock finished last Friday's session 0.67% higher at $29.90. A total volume of 333,620 shares was traded. The Company's shares have advanced 7.94% in the past month, 57.78% over the previous three months, and 51.78% over the past year. The stock is trading above its 50-day and 200-day moving averages by 10.59% and 18.19%, respectively. Additionally, shares of Accelerate Diagnostics, which provides solutions for the diagnosis of serious infections in the US, have a Relative Strength Index (RSI) of 61.83.\nOn January 10 th , 2018, Accelerate Diagnostics announced the Company's declaration of conformity to the European In Vitro Diagnostic Directive 98/79/EC and CE mark of its latest assay for the Accelerate Pheno ™ system targeting severe bacterial pneumonia infections. During the related study, results for the severe pneumonia assay were available about 57 hours faster than the standard of care. Get the full research report on AXDX for free by clicking below at: www.wallstequities.com/registration/?symbol=AXDX\nBiocept\nOn Friday, shares in California headquartered Biocept Inc. ended the session 26.76% lower at $0.35. The stock recorded a trading volume of 16.14 million shares, which was higher than its three months average volume of 815,320 shares. The Company's shares are trading 49.54% below their 50-day moving average. Moreover, shares of Biocept have an RSI of 22.66.\nOn January 04 th , 2018, Biocept announced the issuance of Australian Patent No. 2012250516, entitled METHODS FOR DETECTING NUCLEIC ACID SEQUENCE VARIANTS. This is the second issued patent for the Company's Target Selector™ assays for molecular analysis using real-time PCR, Sanger sequencing, and next generation sequencing. Access the free research report on BIOC now by signing up at: www.wallstequities.com/registration/?symbol=BIOC\nExact Sciences\nWisconsin headquartered Exact Sciences Corp.'s shares declined slightly by 0.38%, closing the session at $50.07. A total volume of 2.75 million shares was traded, which was above their three months average volume of 2.38 million shares. The stock has gained 2.00% over the previous three months and 183.20% over the past year. The stock is trading 16.53% above their 200-day moving average. Additionally, shares of Exact Sciences, which focuses on developing products for the early detection and prevention of various cancers in the US, have an RSI of 44.34.\nOn January 07 th , 2018, Exact Sciences announced that it expects to report revenue between $86.9 million and $87.9 million for Q4 2017 ended December 31 st , 2017, an increase of 148% from Q4 2016. For the full year 2017, the Company anticipates reporting revenue between $265.5 million and $266.5 million, a year-over-year increase of 168%.\nOn January 08 th , 2018, research firm The Benchmark Company reiterated its 'Buy' rating on the Company's stock with an increase of the target price from $60 a share to $65 a share. Are you already registered with Wall St. Equities? Do so now for free, and get the report on EXAS at: www.wallstequities.com/registration/?symbol=EXAS\nHTG Molecular Diagnostics\nLast Friday, shares in Arizona-based HTG Molecular Diagnostics Inc. recorded a trading volume of 1.12 million shares. The stock ended the session 4.09% lower at $3.99. The Company's shares have surged 105.67% in the past month, 55.86% over the previous three months, and 101.52% over the past year. The stock is trading above its 50-day and 200-day moving averages by 60.58% and 44.44%, respectively. Furthermore, shares of HTG Molecular Diagnostics have an RSI of 63.78.\nOn January 23 rd , 2018, HTG Molecular Diagnostics announced the completion of its previously announced underwritten public offering of 13,915,000 shares of the Company's common stock at a price to the public of $2.90 per share, including 1,815,000 shares sold, pursuant to the exercise in full of the underwriters' option to purchase additional shares. All of the shares in the offering were sold by the Company. The aggregate gross proceeds from the offering are approximately $40.4 million, before deducting the underwriting discounts and commissions and offering expenses. Aspiring Member, please take a moment to register below for your free research report on HTGM at: www.wallstequities.com/registration/?symbol=HTGM\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither WSE nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit https://wallstequities.com/legal-disclaimer/\nCONTACT\nFor any questions, inquiries, or comments reach out to us directly. If you're a company, we are covering and wish to no longer feature on our coverage list contact us via email and/or phone between 09:30 EDT to 16:00 EDT from Monday to Friday at:\nEmail: info@wallstequities.com\nPhone number: +21-32-044-483\nOffice Address: 1 Scotts Road #24-10, Shaw Center Singapore 228\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n : releases/technical-perspectives-on-medical-research-stocks----accelerate-diagnostics-biocept-exact-sciences-and-htg-molecular-diagnostics-300589365.html\nSOURCE Wall St. Equities", "external_links": ["http://www.prnewswire.com/news-releases/technical-perspectives-on-medical-research-stocks----accelerate-diagnostics-biocept-exact-sciences-and-htg-molecular-diagnostics-300589365.html", "http://www.wallstequities.com/registration/?symbol=EXAS", "https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=HTGM", "http://www.wallstequities.com/registration/?symbol=BIOC", "http://www.wallstequities.com/registration", "http://www.wallstequities.com/registration/?symbol=AXDX"], "published": "2018-01-29T14:15:00.000+02:00", "crawled": "2018-01-29T16:48:41.012+02:00", "highlightTitle": ""}