{"organizations": [], "uuid": "d2f734cc9bc7d87ef6324be037e29e658c622df4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 117, "shares": 117, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/01/104313505-GettyImages-646462320.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/trump-state-of-the-union-to-focus-on-economy-trade-immigration.html", "country": "US", "domain_rank": 767, "title": "Trump State of the Union to focus on economy, trade, immigration", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.16, "site_type": "news", "published": "2018-01-27T21:01:00.000+02:00", "replies_count": 0, "uuid": "d2f734cc9bc7d87ef6324be037e29e658c622df4"}, "author": "Christina Wilkie", "url": "https://www.cnbc.com/2018/01/26/trump-state-of-the-union-to-focus-on-economy-trade-immigration.html", "ord_in_thread": 0, "title": "Trump State of the Union to focus on economy, trade, immigration", "locations": [], "entities": {"persons": [{"name": "jim lo scalzo", "sentiment": "negative"}, {"name": "donald j. trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump state", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Jim Lo Scalzo | Pool Image via Getty Images Donald J. Trump delivers his first address to a joint session of Congress from the floor of the House of Representatives in Washington, United States on February 28, 2017. \nPresident Donald Trump will deliver his first State of the Union address on Tuesday, marking the end to a turbulent first year of his presidency, but one that has seen U.S. markets ascend to new heights. \nThe theme of Trump's address will be \"building a safe, strong and proud America,\" a senior administration official told reporters on Friday. According to the White House, the speech will focus on five main policy areas: jobs and the economy, infrastructure, immigration, trade and national security. \nAs part of his economic message, Trump will review the country's economic growth over the past year, with a focus on how the administration's massive tax cuts, and its regulatory rollback, have contributed to the economy. \nOn infrastructure, the White House official said Trump would strike a bipartisan tone -- a nod to the many Democrats in Congress who would likely support an infrastructure bill. \n\"He's going to try to get the country excited about the urgency of rebuilding our infrastructure,\" the official said. \nTrump will also address the immigration framework the White House previewed earlier this week, which offers a path to citizenship for nearly 2 million undocumented young people in exchange for $25 billion in funding for border security and draconian cuts to current legal immigration levels. \nOn trade, the White House official pointed to Trump's speech Friday in Davos, Switzerland , where he called for \"fair and reciprocal\" trade practices. The administration would not say whether Trump intends to bring up the Trans-Pacific Partnership, a trade deal the president has long dismissed as \"terrible,\" but which he seemed to warm to, slightly, in Davos. \nThe fifth pillar of the speech will be national security, the White House official said. There, the president will emphasize \"peace through strength,\" a phrase made popular during the Reagan administration. \nAsked about the president's speech writing process, the official said that the specific wording needs to be coordinated across a wide range of agencies and stakeholders. But he added, \"the process begins and ends with the president.\" \nTrump is scheduled to deliver the State of the Union address at 9 p.m. ET on Tuesday.", "external_links": [], "published": "2018-01-27T21:01:00.000+02:00", "crawled": "2018-01-27T21:07:15.000+02:00", "highlightTitle": ""}