{"organizations": [], "uuid": "dce8a83fa3c78772781271a0efacfc766b098b4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/axis-bank-results/update-1-indias-axis-bank-profit-rises-as-bad-loan-additions-slow-shares-up-idUSL4N1PH38D", "country": "US", "domain_rank": 408, "title": "UPDATE 1-India's Axis Bank profit rises as bad loan additions slow, shares up", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-22T17:47:00.000+02:00", "replies_count": 0, "uuid": "dce8a83fa3c78772781271a0efacfc766b098b4b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/axis-bank-results/update-1-indias-axis-bank-profit-rises-as-bad-loan-additions-slow-shares-up-idUSL4N1PH38D", "ord_in_thread": 0, "title": "UPDATE 1-India's Axis Bank profit rises as bad loan additions slow, shares up", "locations": [], "entities": {"persons": [], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "thomson reuters", "sentiment": "none"}, {"name": "bank ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Q3 gross bad loan adds at 44.28 bln rupees vs 89.36 bln in Q2\n* Gross non-performing loan ratio narrows q/q to 5.28 pct\n* Q3 net profit 7.26 bln rupees vs 7.98 bln rupees estimate\n* Shares rise 5.3 percent to hit highest since September 2016 (Adds details on results, shares)\nJan 22 (Reuters) - Axis Bank Ltd, India’s third-biggest private sector lender by assets, reported a 25 percent rise in quarterly net profit on higher interest and fee incomes as well as a sharp slowdown in bad loan additions.\nShares in company rose as much as 5.3 percent to a more than one-year high as investors cheered the results that showed Axis added only 44.28 billion rupees of bad loans in the three months to December, less than half of levels in the September quarter.\nThe bank reported a net profit of 7.26 billion rupees ($113.86 million) for the third quarter, up from 5.80 billion rupees a year ago but slightly below an average estimate of 7.98 billion rupees from 21 analysts polled by Thomson Reuters.\nAxis’s gross bad loans as a percentage of total loans stood at 5.28 percent at end-December, compared with 5.90 percent in the previous quarter, and 5.22 percent a year earlier.\nOutstanding loans on the bank’s watch list for potential troubled loans declined 12 percent from the previous quarter to 53.09 billion rupees as of end-December, Axis said.\nThe lender, with exposure to some of the troubled sectors such as metals and power, has seen its bad loans surge in the past year. While bulk of India’s $150 billion sour debts are with the 21 state-backed lenders, some private sector banks like Axis and ICICI Bank also account for sizeable chunks.\nAxis’ net interest income for the quarter grew 9 percent from a year ago, while fee income grew 24 percent on year driven by the retail segment. Net interest margin was 3.38 percent.\nThe bank kept its credit cost guidance of 220-260 basis points for the full year to March, versus 282 basis points in the previous year. Its provision coverage ratio improved to 66 percent at end-December, from 60 percent three months earlier.\nThe bank has 60.74 billion rupees tied up in loans to companies that have been ordered by India’s central bank to be taken to bankruptcy court, Axis said, adding it had set aside funds to cover 68 percent of those loans.\nAxis shares rose to 621.75 rupees, their highest since September 2016, before trading at 614.80 rupees at 0936 GMT, versus the wider market which was up 0.71 percent. ($1 = 63.7625 Indian rupees) (Reporting by Krishna V Kurup and Devidutta Tripathy; Editing by Himani Sarkar)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T17:47:00.000+02:00", "crawled": "2018-01-23T17:52:13.010+02:00", "highlightTitle": ""}