{"organizations": [], "uuid": "9bbb539c79a1c8d7d01a163915daa084445296f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-2-intel-results-beat-estimates-on-data-center-growth.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-Intel results beat estimates on data center growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T23:45:00.000+02:00", "replies_count": 0, "uuid": "9bbb539c79a1c8d7d01a163915daa084445296f6"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-2-intel-results-beat-estimates-on-data-center-growth.html", "ord_in_thread": 0, "title": "UPDATE 2-Intel results beat estimates on data center growth", "locations": [], "entities": {"persons": [{"name": "bob", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "intel corp", "sentiment": "negative"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds executive quote, analyst quote, context about chip flaws)\nJan 25 (Reuters) - Intel Corp on Thursday blew past Wall Street profit and revenue expectations for the fourth quarter on the strength of record-breaking sales to data center customers, even as it warned investors for the first time that fallout from security flaws found it is chips could hurt its future results and customer relationships.\nIntel also boosted its full-year forecast for 2018 above Wall Street expectations, saying it would boost dividends 10 percent to $1.20 on a yearly basis despite taking a $5.4 billion charge related to recent changes in U.S. tax law. Intel shares rose 3.8 percent to $47.06 in after-hours trading after the results.\nRevenue from the company's higher-margin data center business rose about 20 percent to $5.58 billion, beating the average analyst estimate of $5.13 billion, according to Thomson Reuters I/B/E/S. Revenue from Intel's PC group hit $9 billion for the quarter, a 2 percent decline from the year before, but ticked up 3 percent for the year to $34 billion.\nChief Financial Officer Bob Swan said PC business was doing well in a declining market and the company was on track to becoming more focused on data centers. \"Compared to the expectations we set, our revenue was stronger, our operating margins were higher, and our spending was lower,\" he said in a statement.\nThe improved dividend and forecasts are important because they are the first signal of how much success Intel has had in containing fallout from the so-called Spectre and Meltdown security flaws that could allow hackers to steal data from computers. The flaws were disclosed after the close of the currently reported quarter.\nThe problems affect most modern computing chips but analysts believe that Intel, the No. 1 maker of microprocessors, is at greater risk because all the variants of the flaws affect its chips, which have a dominant market position in data centers.\nIntel warned in its earnings release that fallout from the discovery of Spectre and Meltdown could hurt future results, as well as customer relationships and the company's reputation.\nIt added that publicity over the two vulnerabilities could prompt outside parties to look for other security flaws, which could also harm the company's business.\nBut the immediate forecasts were positive. GBH Insights analyst Daniel Ives said that Intel investors would heave a sigh of relief. \"The chip vulnerability situation was an overhang over Intels shares and this robust quarter, healthy guidance, and underlying business metrics should help investors sleep a bit easier at night.\"\nDue to the tax charge, the company posted a loss of $687 million, or 15 cents per share, in the fourth quarter ended Dec. 30.\nExcluding items, the chipmaker earned $1.08 per share. Total revenue rose 4.1 percent to $17.05 billion.\nAnalysts on average were expecting a profit of 86 cents per share on a revenue of $16.34 billion, according to Thomson Reuters I/B/E/S. (Reporting by Laharee Chatterjee in Bengaluru, Stephen Nellis in San Francisco and Jim Finkle in Toronto; Editing by Saumyadeb Chakrabarty and Lisa Shumaker)", "external_links": [], "published": "2018-01-25T23:45:00.000+02:00", "crawled": "2018-01-26T11:22:42.000+02:00", "highlightTitle": ""}