{"organizations": [], "uuid": "638d0cf0d4dbf207ca7b6b8ec078bee8057734d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223232228&w=1200&r=LYNXMPEE0I062", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-edmund/tennis-edmund-outlasts-basilashvili-in-brutal-heat-idUSKBN1F80C3", "country": "US", "domain_rank": 408, "title": "Tennis: Edmund outlasts Basilashvili in brutal heat", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T06:16:00.000+02:00", "replies_count": 0, "uuid": "638d0cf0d4dbf207ca7b6b8ec078bee8057734d8"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-edmund/tennis-edmund-outlasts-basilashvili-in-brutal-heat-idUSKBN1F80C3", "ord_in_thread": 0, "title": "Tennis: Edmund outlasts Basilashvili in brutal heat", "locations": [], "entities": {"persons": [{"name": "edmund", "sentiment": "negative"}, {"name": "basilashvili", "sentiment": "negative"}, {"name": "kyle edmund", "sentiment": "none"}, {"name": "andy murray", "sentiment": "none"}, {"name": "amlan chakraborty", "sentiment": "none"}, {"name": "ivo karlovic", "sentiment": "none"}, {"name": "georgian nikoloz basilashvili", "sentiment": "none"}, {"name": "andreas seppi", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "min read  melbourne", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " Britain’s Kyle Edmund overcame Georgian Nikoloz Basilashvili and temperatures well above 100 degrees Fahrenheit in a brutal three-and-a-half hour battle to reach the fourth round of the Australian Open for the first time on Friday.\nThe 23-year-old Yorkshireman, the only Briton in the men’s draw in the absence of Andy Murray, mixed 70 winners with 68 unforced errors to prevail 7-6(0) 3-6 4-6 6-0 7-5 in a topsy-turvy contest played out on the exposed court two.\n“Mostly a bit tired, but really good to win a match like that in tough conditions,” said Edmund, who upset 11th seed Kevin Anderson in another five-setter in the first round.\n”This one today was very tough. Probably hottest conditions I played in for that sort of period of time.\n“Just really happy to come through and, you know, mentally it’s a really good win, that sort of match.”\nEdmund made a poor start and was broken in his first service game but came back after receiving treatment on his back to break back and, going for his shots, ran away with the tiebreak to seal the set with a thumping forehand return.\nIt was Basilashvili’s turn to be broken at the start of the second set but the Georgian then rattled off five straight games from 3-1 down to level up the match when Edmund fired a forehand wide.\nBasilashvili made it seven games in a row before Edmund got back on the board and although the world number 49 got the set back on serve, another errant forehand gave him a 2-1 lead.\nTennis - Australian Open - Melbourne, Australia, January 19, 2018. Kyle Edmund of Britain hits a shot against Nikoloz Basilashvili of Georgia. REUTERS/Edgar Su The mercury hit 39 degrees Celsius (102F) in the blinding sunshine as the players abandoned their ice towels to head back out for the fourth set.\nThe match turned when Edmund outlasted Basilashvili in an extraordinary 20-minute game featuring 15 deuces to take a 2-0 lead, the Englishman receiving an ovation from the crowd for his efforts.\nSlideshow (2 Images) “Sets get played as quick as that,” said Edmund. “It worked out to be a very key game, because that game was a set from him, you know. The way he played, dictated, wanted to go to a fifth. It was a key game to get through, and very long game.”\nBasilashvili effectively conceded the rest of the set to conserve his energy for the decider, which went with serve until two winners and a double fault gave Edmund his 27th break point.\nAfter all the effort in getting to that point, Edmund was not about to pass it up and duly set up a fourth round clash against Ivo Karlovic or Andreas Seppi.\nInjured British number one Murray suggested in a tweet that it was the best win of Edmund’s career.\n“It’s definitely up there, for sure,” said Edmund.\n“The physical test was a great, great win for me to come through like that in a grand slam. Best-of-five sets in that kind of heat, really good for my career and my confidence going forward.”\nReporting by Nick Mulvenney in Sydney, editing by Amlan Chakraborty\n ", "external_links": [], "published": "2018-01-19T06:16:00.000+02:00", "crawled": "2018-01-19T07:16:53.009+02:00", "highlightTitle": ""}