{"organizations": [], "uuid": "a3e9d3027001c5c8589b503378be175cced17d13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/australia-stocks-close/australia-shares-led-higher-by-financials-nz-gains-idUSL4N1PO1ZN", "country": "US", "domain_rank": 408, "title": "Australia shares led higher by financials; NZ gains", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T08:09:00.000+02:00", "replies_count": 0, "uuid": "a3e9d3027001c5c8589b503378be175cced17d13"}, "author": "", "url": "https://www.reuters.com/article/australia-stocks-close/australia-shares-led-higher-by-financials-nz-gains-idUSL4N1PO1ZN", "ord_in_thread": 0, "title": "Australia shares led higher by financials; NZ gains", "locations": [], "entities": {"persons": [{"name": "comyn", "sentiment": "none"}, {"name": "matt comyn", "sentiment": "none"}, {"name": "michael mccarthy", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "nz", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "westpac banking corp", "sentiment": "none"}, {"name": "cba", "sentiment": "none"}, {"name": "asx", "sentiment": "none"}, {"name": "commonwealth bank of australia", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}, {"name": "cmc markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 11 AM / in 17 minutes Australia shares led higher by financials; NZ gains Reuters Staff 3 Min Read \n(Updates to close) \nJan 29 (Reuters) - Australian shares rose 0.4 percent on Monday, led by financials, taking a cue from Wall Street which closed at record levels after strong earnings reports. \nBoosted by the latest round of earnings including Intel and AbbVie, the three main U.S. indexes climbed to record closing highs on Friday. \n“Clearly positive leads from U.S. markets are helping the Australian share market, so it is no surprise to see the bounce” said Michael McCarthy, chief market strategist at CMC Markets. \nThe S&P/ASX 200 index rose 0.4 percent or 25.4 points to 6,074.4. The benchmark closed marginally lower on Thursday. \nAustralian banks rose, following their U.S. counterparts, with the financial index climbing 0.6 percent. \nCommonwealth Bank of Australia (CBA) rose 0.7 percent, while Westpac Banking Corp firmed 0.6 percent. \nCBA named retail banking head Matt Comyn as chief executive on Monday. The bank said Comyn’s appointment seeks to maintain the bank’s operational continuity while trying to improve its reputation in challenging trading conditions. \nHealthcare was among the top performing sectors, with CSL Ltd and Australian shares of Resmed Inc hitting record closing highs. \nEnergy stocks also showed gains, underpinned by higher oil prices. \nOil prices held firm on Monday, supported by strong demand, a weak dollar and ongoing supply cuts lead by OPEC and Russia, although soaring U.S. output means many analysts expect crude prices to fall later in the year. \nOil and gas company Woodside Petroleum Ltd rose 0.3 percent, ending higher for a fourth consecutive session. \n“Energy stocks are definitely rising on the back of the rally in oil prices, though the focus in the sector could also be reflecting the fact that we have had a takeover bid in the sector with Mitsui out of Japan bidding for AWE,” added McCarthy. \nJapan’s Mitsui & Co made an A$594 million ($481 million) offer to buy Australia’s AWE Ltd, trumping bids from two other companies vying for a stake in the promising onshore Waitsia gas field. \nShares of AWE closed 16.5 percent higher, at a near 2 1/2 year after the bid. \nReal estate stocks were the biggest drag on the index, with Scentre Group falling 1.5 percent. \nGlobal miner Rio Tinto Ltd rose 0.3 percent despite despite Chinese iron ore futures falling on Monday to their lowest in a month. Rival BHP Billiton fell 0.4 percent. \nAcross the Tasman Sea, the benchmark New Zealand S&P/NZX 50 index rose 0.2 percent or 16.17 points to 8,327.59. \nFisher & Paykel Healthcare Corporation Ltd rose 2.7 percent, accounting for most of the gains, while a2 Milk Company Ltd climbed 1.7 percent. ($1 = 1.2359 Australian dollars) (Reporting by Aaron Saldanha in Bengaluru; Editing by Eric Meijer)", "external_links": [], "published": "2018-01-29T08:09:00.000+02:00", "crawled": "2018-01-29T08:32:24.004+02:00", "highlightTitle": ""}