{"organizations": [], "uuid": "3af3c17f76702c867316e75bed8509498f4d5c86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226615033&w=1200&r=LYNXMPEE0T0YQ", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-pope-chile/pope-sends-envoy-to-chile-to-investigate-bishop-accused-of-abuse-cover-up-idUSKBN1FJ1WO", "country": "US", "domain_rank": 408, "title": "Pope sends envoy to Chile to investigate bishop accused of abuse cover up", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:55:00.000+02:00", "replies_count": 0, "uuid": "3af3c17f76702c867316e75bed8509498f4d5c86"}, "author": "", "url": "https://www.reuters.com/article/us-pope-chile/pope-sends-envoy-to-chile-to-investigate-bishop-accused-of-abuse-cover-up-idUSKBN1FJ1WO", "ord_in_thread": 0, "title": "Pope sends envoy to Chile to investigate bishop accused of abuse cover up", "locations": [], "entities": {"persons": [{"name": "pope", "sentiment": "negative"}, {"name": "pope francis", "sentiment": "none"}, {"name": "juan barros", "sentiment": "none"}, {"name": "philip pullella", "sentiment": "none"}, {"name": "crispian balmer", "sentiment": "none"}, {"name": "barros", "sentiment": "none"}], "locations": [{"name": "chile", "sentiment": "none"}, {"name": "vatican", "sentiment": "none"}, {"name": "osorno", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "vatican city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VATICAN CITY (Reuters) - Pope Francis is sending the Catholic Church’s top investigator into sexual abuse by clergy to Chile to probe a bishop accused of covering up crimes against minors, in a remarkable turnaround only days after the pope defended him.\nA Vatican statement on Tuesday said new information had emerged about Bishop Juan Barros and that Archbishop Charles Scicluna of Malta would go to “listen to those who want to submit elements in their possession”.\nThe statement, which gave no details, was stunning U-turn for the pope, who on Jan. 21 told reporters aboard his plane returning from Latin America he was sure Barros was innocent and that the Vatican had received no concrete evidence against him.\nIt was Scicluna who doggedly uncovered evidence of sexual abuse that led to the removal of the late Mexican priest Marcial Maciel, founder of the Legionaries of Christ, in 2005.\nControversy over Barros, bishop of the city of Osorno in Chile’s south, dominated Francis’ recent trip, with critics accusing the pope of not understanding the depth of the crisis in the South American country and of dismissing his accusers.\nBarros has been accused of protecting his former mentor, the Rev. Fernando Karadima, who was found guilty in a Vatican investigation in 2011 of abusing teenage boys over many years. Karadima denies the allegations, and Barros said he was unaware of any wrongdoing.\nBarros and his main accusers were not available to comment on the latest twist of a long-running saga that has gripped Chile and severely hurt the Church’s prestige there.\nDuring the trip, a Chilean reporter managed to get close to the pope at an event and shouted out a question about Barros.\n“The day I see proof against Bishop Barros, then I will talk. There is not a single piece of evidence against him. It is all slander. Is that clear?” the pope replied in a snippy tone.\nHis comments were seen as trying to dismiss the credibility of accusers and was widely criticized by victims, their advocates and newspaper editorials in Chile and the pope’s native Argentina.\nEven Cardinal Sean O‘Malley of Boston, a key papal adviser on how to root out sexual abuse in the Church, distanced himself with a statement saying the pope had caused “great pain”.\nSpeaking to reporters on the plane returning to Rome, Francis, in an extremely rare act of self-criticism, apologized to victims, acknowledging that his choice of words and tone of voice had “wounded many”.\nOne of Barros’ accusers, Juan Carlo Cruz, has said the bishop was present when Karadima abused him. He said he was shocked that the Vatican had said it had no evidence against the bishop.\n“As if I could have taken a selfie or photo while Karadima abused me and others with Juan Barros standing next to him watching everything,” he tweeted on Jan. 18, during the pope’s visit.\nVictims and their advocates have said Francis should never have appointed Barros because there had been accusations against him. Anti-Barros parishioners demonstrated during his investiture ceremony in 2015.\nWhile the pope, who met two victims in Chile during the trip, has vowed “zero tolerance” of sexual abuse, a planned Vatican tribunal to judge bishops accused of covering up abuse or mishandling cases has never started.\nThe much-touted commission O‘Malley heads has meanwhile been hit by defections by high-profile non-clerical members who quit in frustration over what they said was lack of progress.\nReporting by Philip Pullella; Editing by Crispian Balmer and Catherine Evans\n ", "external_links": [], "published": "2018-01-30T15:55:00.000+02:00", "crawled": "2018-01-30T16:08:57.021+02:00", "highlightTitle": ""}