{"organizations": [], "uuid": "711b4d9682e130a4c2b1a78551ab4e65e0b85796", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-zayo-to-acquire-neutral-path.html", "country": "US", "domain_rank": 767, "title": "Zayo to Acquire Neutral Path", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T16:00:00.000+02:00", "replies_count": 0, "uuid": "711b4d9682e130a4c2b1a78551ab4e65e0b85796"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-zayo-to-acquire-neutral-path.html", "ord_in_thread": 0, "title": "Zayo to Acquire Neutral Path", "locations": [], "entities": {"persons": [{"name": "zayo", "sentiment": "negative"}], "locations": [{"name": "midwest boulder", "sentiment": "none"}, {"name": "colo.", "sentiment": "none"}, {"name": "omaha", "sentiment": "none"}, {"name": "des moines", "sentiment": "none"}, {"name": "kansas city", "sentiment": "none"}, {"name": "midwest", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}], "organizations": [{"name": "group holdings, inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "near north partners", "sentiment": "none"}, {"name": "neutral path communications", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acquisition to add unique, high-count fiber routes in Midwest\nBOULDER, Colo.--(BUSINESS WIRE)-- Zayo Group Holdings, Inc. (NYSE: ZAYO) today announced that it has entered into an agreement to acquire substantially all of the assets of Neutral Path Communications and Near North Partners for $31.5 million. Neutral Path is a long haul infrastructure provider, operating a fiber network in the Midwest.\nThe transaction will add 452 owned plus additional leased route miles to Zayo’s extensive North American network, including a unique, high-count fiber route from Minneapolis to Omaha. The assets are highly complementary to Zayo’s Midwestern long haul dark fiber footprint.\nAs a result, Zayo will be able to sell multi-city dark fiber and fiber-based lit solutions from Minneapolis into Omaha, extending to Denver, Kansas City, Tulsa, Dallas, Des Moines, Chicago and other major markets. The network was architected to provide convenient options for carrier backhaul (both wireline and wireless) from the cities along the route to further enable broadband expansion in this area of the country.\n“This is another example of executing on our ‘tuck-in’ strategy, acquiring companies that add strategic assets that we can leverage immediately,” said Jack Waters, CTO and president of Fiber Solutions at Zayo. “Based on expressed customer demand, we’re confident we will quickly be able to pursue the robust funnel of sales opportunities and grow the revenue base on these assets.”\nNeutral Path is expected to generate $2.1M in annualized EBITDA for the quarter ended March 31, 2018. Zayo expects to achieve approximately $0.6M in annualized cost synergies within four quarters of the acquisition closing date.\nThe transaction is expected to close in the second calendar quarter of 2018, subject to regulatory approvals and customary closing conditions. The purchase price is subject to net working capital and other customary adjustments, as well as a contingent payment based on sales performance through June 30, 2018.\nAbout Zayo Group\nZayo Group Holdings, Inc. (NYSE: ZAYO) provides communications infrastructure services, including fiber and bandwidth connectivity, colocation and cloud infrastructure to the world’s leading businesses. Customers include wireless and wireline carriers, media and content companies and finance, healthcare and other large enterprises. Zayo’s 126,000-mile network in North America and Europe includes extensive metro connectivity to thousands of buildings and data centers. In addition to high-capacity dark fiber, wavelength, Ethernet and other connectivity solutions, Zayo offers colocation and cloud infrastructure in its carrier-neutral data centers. Zayo provides clients with flexible, customized solutions and self-service through Tranzact, an innovative online platform for managing and purchasing bandwidth and services. For more information, visit zayo.com .\nForward Looking Statements\nThis press release contains a number of forward-looking statements. Words, and variations of words such as “believe,” “expect,” “plan,” “continue,” “will,” “should,” and similar expressions are intended to identify our forward-looking statements. No assurance can be given that future results expressed or implied by the forward-looking statements will be achieved and actual results may differ materially from those contemplated by the forward-looking statements. These forward-looking statements involve risks and uncertainties, many of which are beyond our control. For additional information on these and other factors that could affect our forward-looking statements, see our risk factors, as they may be amended from time to time, set forth in our filings with the SEC, including our 10-K dated August 22, 2017. We disclaim and do not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005395/en/\nZayo Group\nMedia:\nShannon Paulk , 303-577-5897\nCorporate Communications\npress@zayo.com\nor\nInvestors:\nBrad Korch , 720-306-7556\nInvestor Relations\nIR@zayo.com\nSource: Zayo Group", "external_links": ["http://www.businesswire.com/news/home/20180129005395/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.zayo.com%2F&esheet=51749934&newsitemid=20180129005395&lan=en-US&anchor=zayo.com&index=1&md5=bb0ad96dabcc382e119af3d2fcf099ed"], "published": "2018-01-29T16:00:00.000+02:00", "crawled": "2018-01-29T17:38:02.033+02:00", "highlightTitle": ""}