{"organizations": [], "uuid": "7c2dff48baf257301f83bfddbaed962820dae895", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/china-energy-cnpc-demand/update-1-chinas-natural-gas-consumption-to-rise-10-pct-on-yr-in-2018-cnpc-research-idUSL3N1PB26N", "country": "US", "domain_rank": 408, "title": "UPDATE 1-China's natural gas consumption to rise 10 pct on yr in 2018 - CNPC research", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T09:07:00.000+02:00", "replies_count": 0, "uuid": "7c2dff48baf257301f83bfddbaed962820dae895"}, "author": "", "url": "https://www.reuters.com/article/china-energy-cnpc-demand/update-1-chinas-natural-gas-consumption-to-rise-10-pct-on-yr-in-2018-cnpc-research-idUSL3N1PB26N", "ord_in_thread": 0, "title": "UPDATE 1-China's natural gas consumption to rise 10 pct on yr in 2018 - CNPC research", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "cnpc", "sentiment": "negative"}, {"name": "china national petroleum corp", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 7:07 AM / Updated 6 minutes ago UPDATE 2-China's CNPC forecasts 10 pct growth in gas consumption, bumper fuel exports Reuters Staff 5 Min Read \n* Gas demand, import growth to drop, but remain in double digits * 2018 oil demand growth at 4.6 pct, down from 5.9 pct in 2017 * Net diesel exports to rise 47 pct, gasoline exports by 23 pct (Adds details on fuel surplus, comment, table, byline) By Muyu Xu and Chen Aizhu BEIJING, Jan 16 (Reuters) - China's natural gas consumption will rise by 10 percent and imports by 13.4 percent in 2018, China National Petroleum Corp (CNPC) forecast on Tuesday, boosted by a steady push to replace coal with the cleaner-burning fuel to curb air pollution. China's gas demand will reach 258.7 billion cubic metres (bcm) this year and total natural gas imports will grow to 105 billion cubic metres (bcm), CNPC said in its annual outlook released by the state oil giant's research institute. While urban and industrial users will continue to drive the growth in use of natural gas, this year's increase is expected to ease from last year's 17 percent, CNPC said. The growth in gas imports is also down from a more robust 27 percent in 2017. \"Seasonal shortages will persist this year due to the coal-to-gas push and lagging constructions of storage ... but due to slower economic growth, demand from the steel, glass and ceramics industries will fall,\" CNPC said. CNPC's demand forecast for natural gas was in line with Wood Mackenzie's estimate pegging growth this year at 11 percent due to the government being more conservative with gasification than last year, said Wang Wen, an analyst with the consultancy. The world's third-largest gas consumer has been hit by a supply crunch this winter as the government's massive gasification effort led to demand surges that were too fast for the current state of supplies and infrastructure. CNPC also said China's apparent oil demand will expand by 4.6 percent this year to 615 million tonnes, or 12.3 million barrels per day (bpd). That compares with oil demand growth of 5.9 percent for last year. CNPC also said it expects refining capacity at the country's independent refineries to hit 230 million tonnes a year (4.6 million bpd) by 2020, accounting for just over a quarter of China's total installed oil processing capacity. BUMPER FUEL EXPORTS SEEN CNPC also expected China's net diesel exports this year to rise 47 percent to 23.8 million tonnes and gasoline by 23 percent to 12.8 million tonnes, as a result of a swelling surplus in refining capacity and fuel production. Dominant state refiners have been harried since 2016 by growing competition from more than 30 independent refiners that Beijing has allowed to process imported crude oil, prompting fuel exports to reach for record highs. \"Competition in the refined oil market will intensify with the launch of new refining capacities in the second half of the year,\" said CNPC, forecasting that this year's excess refining capacity would reach 2 million bpd. Two large greenfield refineries, one by private chemical giant Rongsheng Group and the other by Hengli Group , are scheduled to start operating 800,000 bpd of crude processing capacity from the second half of 2018. National crude oil throughput will likely grow 5.2 percent this year to 598 million tonnes, or 11.96 million bpd, CNPC said, maintaining a pace seen in the first 11 months of 2017. Domestic crude oil production will rise just 0.2 percent to 192 million tonnes, or 3.84 million bpd, CNPC forecast. That compares with a 4.1 percent fall in January-November 2017. Below lists CNPC's forecast details: 2018 forecast pct change vs 2017 Crude output 192 mln T 0.2 Net crude oil imports 451 mln T 7.7 Refinery throughput 598 mln T 5.2 Net new annual 38 mln T refining capacity Total refining 807.5 mln T 4.7 capacity Net exports of diesel 23.8 mln T 47.0 Apparent oil demand 615 mln T 4.6 Natural gas 258.7 bcm 10.0 consumption Natural gas imports 105 bcm 13.4 Net gasoline exports 12.8 mln T 23.0 (1 tonne = 7.3 barrels for crude oil) (Reporting by Xu Muyu and Chen Aizhu; Editing by Tom Hogue)", "external_links": [], "published": "2018-01-16T09:07:00.000+02:00", "crawled": "2018-01-16T09:30:35.012+02:00", "highlightTitle": ""}