{"organizations": [], "uuid": "3ba62b635947e26b4b2962b2c8e8d51db33633f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/15/103550301-GettyImages-107227643.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/17/european-stocks-focus-on-earnings-inflation.html", "country": "US", "domain_rank": 767, "title": "European stocks: focus on earnings, inflation", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.676, "site_type": "news", "published": "2018-01-17T08:42:00.000+02:00", "replies_count": 0, "uuid": "3ba62b635947e26b4b2962b2c8e8d51db33633f8"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/17/european-stocks-focus-on-earnings-inflation.html", "ord_in_thread": 0, "title": "European stocks: focus on earnings, inflation", "locations": [], "entities": {"persons": [{"name": "ferrero", "sentiment": "none"}, {"name": "zalando", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bank of america", "sentiment": "none"}, {"name": "vw", "sentiment": "none"}, {"name": "carrefour", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "nestle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Europe ended under slight pressure on Wednesday as positive trade on Wall Street failed to lift sentiment, as corporate news dominated discussion.\nThe pan-European Stoxx 600 provisionally slipped 0.1 percent by the close, off its session lows. Britain's FTSE 100 fell 0.39 percent, while France's CAC 40 dipped 0.36 percent and Germany's DAX dropped 0.47 percent. Peripheral markets closed in different directions.\nSymbol Name Price Change %Change Volume FTSE --- DAX --- CAC --- IBEX 35 --- Sectors closed mostly lower. Among them, media was one of the worst-performing industries, slipping 0.6 percent — dragged down by Informa and Pearson. Shares of Pearson sank 4.65 percent after the publisher reported a 2 percent fall in revenue in the first nine months of its fiscal year.\nTelecoms sank 0.8 percent as a sector, with most stocks closing in the red. Technology meantime finished on a positive note, boosted by ASML , which rose 5 percent, after reporting better-than-expected results.\nOn Wall Street, U.S. stocks posted solid gains around Europe's close , with the Dow Jones industrial average rising some 150 points, on better-than-expected earnings.\nStock movers and shakers Looking across the European benchmark, Ubm was one of the top gainers, jumping some 12 percent. This followed news that the British firm Informa has decided to buy the events organizer for £4 billion ($5.2 billion), Reuters reported. Informa meantime dropped 5.7 percent.\nshow chapters 65% chance of US government shutdown on immigration: Expert 9 Hours Ago | 03:38 U.K. fashion house Burberry sat at the bottom of the STOXX 600 at the end of trade, tumbling 9.3 percent, after reporting lower sales in its third quarter.\nNews that Interserve is being monitored by the U.K. government on concerns over its financial health weighed on the construction sector, following the collapse of Carillion. Interserve ended in the red, but off its highs.\nAt the top of Europe's benchmark, Rolls Royce popped 5.4 percent after the manufacturer announced that it would evaluate the strategic options of its commercial marine businesses, a division that has suffered due to weak demand in the offshore oil and gas markets.\nEurope's top performer was Steinhoff , which rose 16.13 percent by the close, having posted sharp gains at the end of the session.\nIn other news, Swiss food group Nestle announced Tuesday that it had agreed to sell its U.S. business to Ferrero for $2.8 billion.\nInflation data On the data front, consumer inflation in the euro zone slowed down in December to 1.4 percent year-on-year from 1.5 percent in the previous month.\nMeanwhile, Jens Weidmann, the German representative to the European Central Bank said in an interview published Wednesday that it would be \"appropriate\" to stop bond purchases, the newspaper Frankfurter Allgemeine Zeitung reported.\nLooking overseas, Asian markets closed lower after Wall Street reversed from record highs on Tuesday. The Dow hit the 26,000 benchmark briefly in its previous session, however, it also recorded its biggest one-day reversal in nearly a year, on government shutdown concerns.\nCongress needs to pass a spending bill by the end of Friday to avoid a government shutdown.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.", "external_links": [], "published": "2018-01-17T08:42:00.000+02:00", "crawled": "2018-01-17T08:43:04.004+02:00", "highlightTitle": ""}