{"organizations": [], "uuid": "2d29a3a8c48140e63271e39310ef4122307a931e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/19/reuters-america-update-4-clock-running-out-as-u-s-senate-tries-to-avert-u-s-government-shutdown.html", "country": "US", "domain_rank": 767, "title": "UPDATE 4-Clock running out as U.S. Senate tries to avert U.S. government shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T19:05:00.000+02:00", "replies_count": 0, "uuid": "2d29a3a8c48140e63271e39310ef4122307a931e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/reuters-america-update-4-clock-running-out-as-u-s-senate-tries-to-avert-u-s-government-shutdown.html", "ord_in_thread": 0, "title": "UPDATE 4-Clock running out as U.S. Senate tries to avert U.S. government shutdown", "locations": [], "entities": {"persons": [{"name": "mcconnell", "sentiment": "negative"}, {"name": "marc short", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mick mulvaney", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "hill", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "u.s. senate", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "shutdown@ (Adds McConnell, Short comments)\nWASHINGTON, Jan 19 (Reuters) - The U.S. Senate raced to avert a government shutdown on Friday ahead of a midnight deadline with no agreement on funding in sight and both parties squabbling over who is to blame for the impasse.\nPresident Donald Trump postponed plans to leave Washington on Friday as a bill to fund the government through Feb. 16, approved on Thursday night by the House of Representatives, appeared on the verge of collapse in the Senate, where Democratic votes are needed to pass it.\nThe Republican-controlled House planned to adjourn later on Friday for a scheduled week-long break but members were warned they could be called back for votes and to stay flexible.\nWhite House budget director Mick Mulvaney said on Thursday he was ratcheting up the likelihood of a government shutdown from 30 percent to a 50-50 possibility.\nTrump's legislative liaison, Marc Short, told reporters at a White House briefing that talks with Democrats on Thursday were productive and \"we're about to go back up to the Hill today to continue those conversations.\"\nCongress has been struggling for months to agree on long-term government funding levels but has been sidetracked by a dispute on immigration. The federal government is operating on a third temporary funding measure since the new fiscal year began in October.\nMarkets were keenly focused Friday morning on the budget woes. The U.S. dollar moving to a near three-year low while Wall Street largely played down any fears of the looming possible shutdown and opened higher before falling about 70 points around midday.\nTrump, who was scheduled to leave for his Florida resort in the afternoon, will remain in Washington until Congress passes legislation to avert a shutdown, White House officials said.\n\"The trip is on ice. If there is a shutdown he won't go,\" one official said on condition of anonymity.\nIn a morning tweet, Trump accused Democrats of holding up the measure over immigration. \"Democrats are needed if it is to pass in the Senate - but they want illegal immigration and weak borders. Shutdown coming?\" he said.\nRepublicans control the Senate but with Senator John McCain undergoing cancer treatment at home in Arizona, they will need at least 10 Democrats to reach the 60 votes required to pass a spending bill. In addition to strong Democratic opposition, at least three Republican senators have said they will not back the continuing resolution in its current form.\nLEANING SENATORS\nRepublican Senator Mike Rounds, who had earlier said he could not back the bill in current form, on Friday said in a statement that while the measure was \"not ideal,\" he would support it after being assured that other legislation to adequately fund the U.S. military would be raised soon.\nDemocratic Senator Joe Manchin of West Virginia has indicated he was leaning in favor of the stopgap measure. Manchin is one of 10 Democrats up for re-election this year in states Trump won in the 2016 presidential election.\nWhen the government shuts down, which has only happened three times in a meaningful way since 1995, hundreds of thousands of \"non-essential\" federal workers may be put on furlough, while \"essential\" employees, dealing with public safety and national security, would keep working.\nAmid the deadlock, more senators were raising the possibility of merely approving enough new federal funds for a few days. The idea is to put pressure on negotiators to then cut deals on immigration, defense spending and non-defense funding by next week.\nBut Senate Republican Leader Mitch McConnell shot down that plan on Friday. \"Let's fund the government for a full month so we can actually get something done\" and negotiate other issues including immigration, he said.\nDick Durbin, the No. 2 Senate Democrat, urged Republicans to sit down and negotiate on immigration and called on the House to stay in session until there was a resolution. \"We don't want to shut down the government,\" he said.\nThe immigration fight is over Democrats' demand that 700,000 young undocumented immigrants be protected from deportation. Those children, known as \"Dreamers,\" were brought into the United States as children, largely from Mexico and Central America, and given temporary legal status under a program started by former President Barack Obama. Many have been educated in the United States and know no other country.\nIn September, Trump announced he was ending the program and giving Congress until March 5 to come up with a legislative replacement.\nSince then, however, the president has had a series of spats with Congress. Trump and conservatives in Congress have used the Dreamer fight to try to win tough immigration controls, including the president's promised border wall.\nDurbin, who is leading the fight for the Dreamers, told reporters late on Thursday there had been some signs earlier in the day that talks with Republicans were taking a positive turn and a deal could be within reach.\nBut in a late-night speech on the Senate floor, McConnell accused Democrats of aiming to \"hold the entire country hostage\" by demanding immediate resolution of a \"non-imminent problem\" related to immigration.\nMcConnell continued to push for passage of the bill approved by the House so that a government shutdown could be avoided. (Reporting by Richard Cowan and Amanda Becker; Additional reporting by Roberta Rampton, Steve Holland; Editing by Chizu Nomiyama and Bill Trott)", "external_links": [], "published": "2018-01-19T19:05:00.000+02:00", "crawled": "2018-01-20T00:25:25.008+02:00", "highlightTitle": ""}