{"organizations": [], "uuid": "74234d3a4eae6207248392c7d4b9631794d08ce0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/cnbc-interview-with-credit-suisse-ceo-tidjane-thiamfrom-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Credit Suisse CEO, Tidjane Thiam,from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:33:00.000+02:00", "replies_count": 0, "uuid": "74234d3a4eae6207248392c7d4b9631794d08ce0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/cnbc-interview-with-credit-suisse-ceo-tidjane-thiamfrom-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Credit Suisse CEO, Tidjane Thiam,from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "tidjane thiam", "sentiment": "negative"}, {"name": "steve", "sentiment": "negative"}, {"name": "sedgwick", "sentiment": "none"}, {"name": "geoff cutmore", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "credit suisse", "sentiment": "negative"}, {"name": "credit suisse ceo", "sentiment": "negative"}, {"name": "imf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Tidjane Thiam, Credit Suisse CEO and CNBC's Steve Sedgwick & Geoff Cutmore from the World Economic Forum 2018.\nSS: And we're just going to take you away from US programming, to bring you a special interview, live here from Davos 2018.\nGC: Yes, we have the CEO of Credit Suisse with us, Tidjane Thiam. Before we ask him a question, let's just point out to you, Credit Suisse could post its third consecutive annual loss, due to write-downs from the US tax overhaul. The Swiss lender has estimated it will take a one-off hit now of about 2.3 billion Swiss francs. The bank reports full-year earnings on February 14th, which probably makes it tricky to get too much from you at this point, on-,\nTT: It-, it is at any time, but particularly at this time [laughter].\nSS: [Laughter].\nGC: [Laughter] the direction of travel. So, let me open up by just asking you about-,\nTT: Yes.\nGC: The broader economic backdrop. Interesting, as we came in to this World economic Forum, the IMF talking about significant upgrades of key Eurozone members at this point. Are you starting to see the benefit of any of that?\nTT: We're starting to see that, and we're very positive. Like many people, I'm sure, you've heard here, everybody's talking about 'synchronous growth', because the US, Europe and Asia are growing strongly at the same time, but we see a lot of indications of that. As you said, I have to be careful, we have our results on February 14th, and we're in a closed period, but what we saw in Q4 is a buildup of a pipeline, which is now coming through in Q1. I think everybody will tell you the Q1 start has been very strong, across-, across zones, and we had to invest a little bit in Q4, in anticipation of this pipeline. I think we will see that in the results, invest a bit of capital. But the US is firing on all cylinders, and as I said, the tax reform was well-timed, because QE had kind of run its course, in terms of stimulating the economy, and providing additional liquidity, and we needed a-, a new leg to this-, to this-, to this growth-, growth cycle, and that has provided that.\nGC: Well, I saw your-, I saw your counterpart, over at UBS, just across the square, yesterday-,\nTT: Mm. Mm.\nGC: And he was still bemoaning that, in spite of these more positive indicators-,\nTT: Mm.\nGC: The ECB continues to run policy as if we're in a crisis, and that's reflected through the Bund yield, but also in the negative deposit rates we still continue to see.\nTT: Mm. Mm. Mm.\nGC: Somebody needs to wake up. Either the growth is here, or it isn't.\nTT: No, no, the growth is here, and that's the big story. All the indicators, if you look at France, the GDP growth rate has been consistently upgraded for 2017, the GDP growth rate, and you will see that every revision will drive it up. Consumption is very strong, unemployment is going down, which is absolutely key to Europe, for-, from a political perspective, from an economic perspective, from a social perspective. It's also easier to implement those labor reforms as unemployment is going down, that President Macron is implementing. So, I think-, I think that's the big story. The policy will follow, as growth accelerates, and I'm very confident it will accelerate.\nSS: And yet, we look at the valuations in certain assets-,\nTT: Mm.\nSS: We look at the housing market, we look at the level of the bond market, and the stock market, and there are a lot of people, including Yale Professor, Robert Shiller, who we were talking to earlier on, who just say that it doesn't feel right. He's got a gut feeling it feels like we're overvalued, and that something could happen, as well. But he can't find the catalyst, no one seems to know what the catalyst is. Do you see a catalyst, in anything we're seeing at the moment, for a big correction?\nTT: Look, I think we have very good visibility on 2018, and I think 2018 looks like it's going to be a great year. If you look at the deal flow, we just announced the Ferrero acquisition of Nestle US chocolate operations, on which we advised $2.8 billion. Just before Christmas, KKR did an $8 billion acquisition of Unilever's business, that we also advised on, and we see that pipeline of transactions building up very strongly. So, the cross-border, actually inward, into the US, is going to be very strong, because it's the largest economy in the world, all the flows, deep markets, liquid markets, a very strong consumer sector, so that's going to work. What, I think, for me is less clear, is the visibility beyond '18.\nSS: Mm-hm.\nTT: So, in terms of risk, of course there is a geopolitical risk. I think everybody-, everybody knows that. You know, from North Korea, to Syria, etc., those risks are there, and one has to be mindful of them. But, again, keep in mind, also, that the financial system is much more robust. The level of capitalization of banks globally, they are less leveraged, and they are much more capital.\nSS: Robust, but manipulated, perhaps, and, as you say, QE has lost its-, the bang for its buck, so to speak-,\nTT: Mm. Mm.\nSS: And yet it is still there, as you've just discussed with Geoff-,\nTT: Mm.\nSS: In enormous quantities. So, is that going to create problems in itself?\nTT: But-, but I think the-, the exit is being well-managed. Better managed than I expected. I think, really, the Fed-,\nSS: Sure.\nTT: The guidance given, they've been really able to, kind of, progressively get out of that.\nSS: But, Tidjane, you've been in the insurance and-, and global investment markets, for a long, long time.\nTT: Mm.\nSS: When have you ever, in your entire career, before now, seen such a suppression of bad news? Every time there's bad news, we've got a central bank picking us up. They won't let us have a cycle, and that worries me.\nTT: I don't think it's a suppression of bad news. I really-, I really think that the world has changed in ways, and I don't want to be rude to you, but in ways that people our age find increasingly difficult to-, to comprehend. Luckily, I have two children who are 23 and 22, and their reaction to all this is very, very different. I think we are in a very fortunate period. We had a period of job destruction, through technology, but we are finally in the period where, actually, the net job changes are positive. There's pretty strong evidence that for every job you lose to technology, there's 2.4 being created. The issue has always been that they are not created at the same time, or in the same place. So, it's all about, kind of, surviving until the 2.4 jobs materialize.\nSS: Mm.\nTT: And this has been going on long enough now that we are now on an upswing, where there is job creation. Look at the unemployment rate in the US. Look at the drop in unemployment across the Euro Zone. People are not used to ascribe job creation to technology, because we have it ingrained that technology destroys jobs-,\nSS: Alright, well, let's do that. Let's ascribe it to technology-,\nTT: On a net basis, it doesn't. Long-term. Long-term.\nSS: But-, but-, but then the salaries haven't come, though. Yes, it's created-, jobs have been lost-,\nTT: Mm.\nSS: But jobs have been created-,\nTT: Mm.\nSS: But where's the income from these new jobs?\nTT: No, then you're pointing to a potential risk to all this, which is inflation. If you have a demography that is such that you have fewer and fewer workers, which is what, kind of, G7, western economies have, and you have unemployment that keeps going down, and you have consumption that keeps going up, yes, pressure is going to build up on the-, on the wage front, which I think, politically, is good news, because, actually, if wages go up, it's not bad for society, it's income. But, it will have to be contained, and as central banks move to contain inflation, I think then we will have, potentially, a spoiler to all this. But that's quite a few semesters down the road.\nGC: And it's ironic that we're sat here, because tomorrow will be the tenth anniversary of the great SocGén trader loss, €4.9 billion, I think-,\nTT: Mm.\nGC: Lost, at the time, and that scandal ultimately led us in to the financial crisis.\nTT: I remember very well. I remember very well, because one of my close friends had the misfortune of running SocGén investment bank.\nGC: Yes, so, are there any of those still out there, do you think?\nTT: Look, you-, you-,\nGC: Or has the system been suitably cleansed, post the financial crisis?\nTT: You can-, you can never say never. You can never say never. I think we-, we all have worked very hard to-, to improve surveillance and compliance, and we invested huge amounts for that, and we continue to invest for that, but one can never say that there cannot be a-, an isolated event.\nSS: Because the appetite, I mean, from the professionals-,\nGC: Mm.\nTT: Mm.\nSS: Is what you're saying-, is there a professional malfeasance out there-,\nTT: Mm.\nSS: But from the investor point of view, as well, and I know that you've made comments on Bitcoin, previously, as well, but there's still this appetite for the-, this lust for quick gain, regardless of the economic rationale, and that's still out there. So, I still worry that that could create a-, an opposite reaction.\nTT: That's-, I think that's been with us for a few millennia.\nSS: Yes, but we've-, yes, but we haven't had Bitcoin for a few millennia.\nTT: That's true, but the appetite for a quick gain, it's part of the economy. The economy is made of very many classes of speculators and investors-,\nSS: But as a trigger for something nasty?\nTT: Sorry, but with different risk/return appetites, and that's what constitutes the market. You can't suppress that end of the market, because it also performs a useful function-\nGC: Look. You mentioned geopolitical risks. Let me just tick a couple of boxes, before we let you go.\nTT: Mm. Mm.\nGC: Obviously, Trump has just introduced fresh trade tariffs on solar panels and washing machines, they hit South Korea and China, raises some risk around a trade war.\nTT: Mm-hm.\nGC: Deutsche Bank, revising down its expected numbers leaving London around Brexit. Just a couple of issues, could you just give us your latest thinking?\nTT: Well, trade is, for me, vital. I really see it always as the oil of the economy. And you can create something from nothing, I always mention the China/Africa trade, because it's a good example of that. It went from zero to $200 billion today, and the US/China trade is $350. Very few people have in mind that China/Africa trade is almost as big of a trade issue as US/China. Okay? So, trade is core. For-, in '17, for the first time in a while, trade grew faster than world GDP. So, I think-, I hope that the reaction to those decisions will be muted. Every indication we get, so far, from China and South Korea, is that they will-, they will have a sensible reaction to that, and if that's the case, then we can continue on a path of growing trade, which is really good for global prosperity. Nobody wants a trade war.\nGC: Alright. We'll-, we'll let you get away with not touching on Brexit, I think we've all had a lot of Brexit-, and there's still lots of-,\nTT: I-, I-, I made a valiant attempt.\nGC: There's still a lot of Brexit to come, so, we'll put that to one side for the time being. Tidjane, lovely to see you-,\nTT: Very good to see you Geoff, and Steve.\nGC: Thanks very much for stopping by-,\nSS: Thank you very much.\nTT: Thank you very much.\nGC: Tidjane Thiam joining us, the CEO of Credit Suisse.\nENDS", "external_links": [], "published": "2018-01-23T16:33:00.000+02:00", "crawled": "2018-01-23T17:32:12.030+02:00", "highlightTitle": ""}