{"organizations": [], "uuid": "8cd3a424a6bf79f567ce52f3617d17ef234418db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-spirit-realty-capital-inc-to-provide-update-on-path-forward.html", "country": "US", "domain_rank": 767, "title": "Spirit Realty Capital, Inc. To Provide Update on Path Forward", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.032, "site_type": "news", "published": "2018-01-23T17:12:00.000+02:00", "replies_count": 0, "uuid": "8cd3a424a6bf79f567ce52f3617d17ef234418db"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-spirit-realty-capital-inc-to-provide-update-on-path-forward.html", "ord_in_thread": 0, "title": "Spirit Realty Capital, Inc. To Provide Update on Path Forward", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "spirit realty capital, inc.", "sentiment": "neutral"}, {"name": "spirit realty capital, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "spirit mta", "sentiment": "none"}, {"name": "eastern time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 23, 2018 /PRNewswire/ -- Spirit Realty Capital, Inc. (NYSE: SRC) (\"Spirit\" or the \"Company\"), a premier net lease real estate investment trust (REIT) that invests in single-tenant, operationally essential real estate, announced today that the Company will post a presentation after the close of markets today, Tuesday, January 23, 2018 to update investors on the Company's progress with the previously announced spin-off of certain assets of the Company into Spirit MTA REIT (\"SMTA\"), which is still expected to close in the first half of 2018.\nSpirit's management team will host a conference call and audio webcast today, Tuesday, January 23, 2018, at 5:00pm Eastern Time.\nInterested parties can listen to the call via the following:\nINTERNET: Go to www.spiritrealty.com and select the investor relations page at least 15 minutes prior to the start time of the call in order to register, download and install any necessary audio software. The webcast will be accessible for three months.\nPHONE: No access code required.\n(888) 349-0136 (Domestic) / (412) 542-4152 (International) / (855) 669-9657 (Canada)\nREPLAY: Available through February 6, 2017 with access code 10116454\n(877) 344-7529 (Domestic) / (412) 317-0088 (International) / (855) 669-9658 (Canada)\nAbout Spirit Realty Capital\nSpirit Realty Capital, Inc. (NYSE: SRC) is a premier net-lease real estate investment trust (REIT) that primarily invests in high-quality, operationally essential real estate, subject to long-term, net leases. Over the past decade, Spirit has become an industry leader and owner of income-producing, strategically located retail, industrial and office properties providing superior risk adjusted returns and steady dividend growth for our shareholders.\nAs of September 30, 2017, our diversified portfolio was comprised of 2,511 properties, including properties securing mortgage loans made by the Company. Our properties, with an aggregate gross leasable area of approximately 49.7 million square feet, are leased to approximately 421 tenants across 49 states and 30 industries.\nMore information about Spirit can be found on the investor relations section of the Company's website at www.spiritrealty.com .\nForward-looking and Cautionary Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and other federal securities laws. These forward-looking statements can be identified by the use of words such as \"expect,\" \"plan,\" \"will,\" \"estimate,\" \"project,\" \"intend,\" \"believe,\" \"guidance,\" and other similar expressions that do not relate to historical matters. These forward-looking statements are subject to known and unknown risks and uncertainties that can cause actual results to differ materially from those currently anticipated due to a number of factors, which include, but are not limited to, Spirit's continued ability to source new investments, risks associated with using debt to fund Spirit's business activities (including refinancing and interest rate risks, changes in interest rates and/or credit spreads, changes in the price of our common stock, and conditions of the equity and debt capital markets, generally), unknown liabilities acquired in connection with acquired properties or interests in real-estate related entities, general risks affecting the real estate industry and local real estate markets (including, without limitation, the market value of our properties, the inability to enter into or renew leases at favorable rates, portfolio occupancy varying from our expectations, dependence on tenants' financial condition and operating performance, and competition from other developers, owners and operators of real estate), the financial performance of our retail tenants and the demand for retail space, particularly with respect to challenges being experienced by general merchandise retailers, potential fluctuations in the consumer price index, risks associated with our failure to maintain our status as a REIT under the Internal Revenue Code of 1986, as amended, risks and uncertainties related to the completion and timing of Spirit's proposed spin-off of properties leased to Shopko Retail Shops Holding Corp. and certain of its affiliates and assets that collateralize Master Trust 2014 and the impact of the spin-off on Spirit's business, and other additional risks discussed in Spirit's most recent filings with the Securities and Exchange Commission, including its Annual Report on Form 10-K. Spirit expressly disclaims any responsibility to update or revise forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nView original content: http://www.prnewswire.com/news-releases/spirit-realty-capital-inc-to-provide-update-on-path-forward-300586642.html\nSOURCE Spirit Realty Capital, Inc.", "external_links": ["http://www.spiritrealty.com/", "http://www.prnewswire.com/news-releases/spirit-realty-capital-inc-to-provide-update-on-path-forward-300586642.html"], "published": "2018-01-23T17:12:00.000+02:00", "crawled": "2018-01-23T17:35:14.009+02:00", "highlightTitle": ""}