{"organizations": [], "uuid": "add78fa76af9fd7937d7c7bb326526fab2535135", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-polyone-announces-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "PolyOne Announces Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T14:48:00.000+02:00", "replies_count": 0, "uuid": "add78fa76af9fd7937d7c7bb326526fab2535135"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-polyone-announces-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "PolyOne Announces Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [{"name": "robert m. patterson", "sentiment": "none"}], "locations": [{"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "polyone corporation", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Jan. 26, 2018 /PRNewswire/ -- PolyOne Corporation (NYSE: POL) today reported its fourth quarter and full year results for 2017. GAAP earnings per share in the fourth quarter of 2017 of $0.43 compared to $0.42 in the fourth quarter of 2016. Adjusted earnings per share of $0.41 increased from $0.39 in the prior year fourth quarter. Special items for the fourth quarter of 2017, which primarily included tax adjustments associated with the Tax Cuts and Jobs Act, resulted in a net after-tax gain of $2.2 million, or $0.02 per share (see Attachment 1). Special items in the prior year quarter, the largest of which were a mark-to-market pension adjustment and restructuring charges, resulted in a net after-tax gain of $2.5 million, or $0.03 per share.\nFull year GAAP earnings per share of $2.11 in 2017 compared to $1.96 in 2016. Adjusted earnings per share in 2017 increased to $2.21, a 7% increase from $2.06 in 2016.\n\"I am pleased to report record adjusted EPS for the 8 th consecutive year,\" said Robert M. Patterson, chairman, president and chief executive officer, PolyOne Corporation. \"Over the last three years, we have increased our sales, marketing and R&D resources by nearly 20%. These investments have improved collaboration and service levels for our existing and new customers, leading to accelerated and sustained growth at PolyOne.\"\nMr. Patterson continued, \"In 2017, we delivered the highest level of organic sales expansion since coming out of the recession in 2010, allowing us to overcome substantial raw material inflation and supply chain disruptions resulting from Hurricane Harvey.\"\n\"Color, Additives and Inks had an outstanding quarter to end the year, driven by a 5% increase in organic sales and a 24% increase in operating income,\" stated Mr. Patterson. \"Color has tremendous momentum heading into 2018 bolstered by the four bolt-on acquisitions we have completed over the last twelve months, adding to our specialty colorant technology portfolio and geographic presence.\"\nMost recently, the company acquired IQAP Masterbatch (IQAP), a privately owned and innovative provider of specialty colorants and additives based in Spain with customers throughout Europe. PolyOne expects IQAP will add approximately $45 million in revenue and be accretive to earnings in 2018.\nBradley C. Richardson, executive vice president and chief financial officer, PolyOne Corporation, said, \"Our strong free cash flow for the year enabled us to fund the acquisitions of SilCoTec, Rutland, Mesa, and IQAP while also returning cash to shareholders. In 2017, we repurchased 2.0 million shares of common stock and announced a significant dividend expansion of 30% this year and a plan for more than 60% cumulatively over the next three years.\"\nMr. Richardson continued, \"With liquidity of nearly $600 million, we have significant financial capacity to continue to pursue strategic acquisitions, invest in innovation and return cash to shareholders via share repurchases and dividends.\"\nMr. Patterson concluded, \"2017 was an important year for our company, as we transformed and repositioned our portfolio for sustainable growth, and delivered record adjusted EPS. I am excited to kick-off 2018 with another highly innovative color and additives acquisition. IQAP is a great addition to the PolyOne family and fits our strategy of acquiring specialty businesses where we can accelerate growth with additional commercial investment.\"\nThe company is hosting a conference call at 9:00 a.m. Eastern Time. Management will discuss fourth quarter and full year results, outlook for 2018, as well as the impact of U.S. tax reform legislation.\nConference Call\nThe company will conduct a conference call at 9:00 a.m. Eastern Time on Friday, January 26, 2018. To participate in the conference call, dial 1-844-835-7433 (domestic) or 1-914-495-8589 (international) and provide conference ID number 8783669. A simultaneous webcast of the call will be accessible via the company's website at www.polyone.com/investor .\nA recording of the call will also be available for one week, beginning at 12:00 p.m. Eastern Time on January 26, 2018. To listen to this recording, dial 1-855-859-2056 (domestic) or 1-404-537-3406 (international) and enter conference ID number 8783669.\nAbout PolyOne\nPolyOne Corporation (NYSE: POL) is a $3.2 billion premier provider of specialized polymer materials, services and solutions. The company is dedicated to serving customers in diverse industries around the globe, by creating value through collaboration, innovation and an unwavering commitment to excellence. Guided by its Core Values, Sustainability Promise and No Surprises Pledge SM , PolyOne is an ACC Responsible Care® certified company committed to its customers, employees, communities and shareholders through ethical, sustainable and fiscally responsible principles. For more information, visit www.polyone.com .\nTo access PolyOne's news library online, please visit www.polyone.com/news .\nForward-looking Statements\nIn this press release, statements that are not reported financial results or other historical information are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements give current expectations or forecasts of future events and are not guarantees of future performance. They are based on management's expectations that involve a number of business risks and uncertainties, any of which could cause actual results to differ materially from those expressed in or implied by the forward-looking statements. They use words such as \"will,\" \"anticipate,\" \"estimate,\" \"expect,\" \"project,\" \"intend,\" \"plan,\" \"believe,\" and other words and terms of similar meaning in connection with any discussion of future operating or financial condition, performance and/or sales. Factors that could cause actual results to differ materially from those implied by these forward-looking statements include, but are not limited to: our ability to identify and evaluate acquisition targets and consummate acquisitions; the ability to successfully integrate acquired businesses into our operations, such as IQAP Masterbatch, Mesa, Rutland, Comptek, SilCoTec, Gordon Composites and Polystrand, including whether such businesses will be accretive, retain the management teams of acquired businesses, and retain relationships with customers of acquired businesses; disruptions, uncertainty or volatility in the credit markets that could adversely impact the availability of credit already arranged and the availability and cost of credit in the future; our ability to achieve new business gains; the effect on foreign operations of currency fluctuations, tariffs and other political, economic and regulatory risks; changes in polymer consumption growth rates and laws and regulations regarding the disposal of plastic in jurisdictions where we conduct business; changes in global industry capacity or in the rate at which anticipated changes in industry capacity come online; fluctuations in raw material prices, quality and supply and in energy prices and supply; production outages or material costs associated with scheduled or unscheduled maintenance programs; unanticipated developments that could occur with respect to contingencies such as litigation and environmental matters; an inability to achieve or delays in achieving or achievement of less than the anticipated financial benefit from initiatives related to working capital reductions, cost reductions and employee productivity goals; an inability to raise or sustain prices for products or services; our ability to continue to pay cash dividends, including at the increasing rate, which will be subject to, among other factors, market conditions, our cash flow and cash requirements and restrictions contained in any of our debt agreements; and other factors affecting our business beyond our control, including, without limitation, changes in the general economy, changes in interest rates and changes in the rate of inflation. The above list of factors is not exhaustive.\nWe undertake no obligation to publicly update forward-looking statements, whether as a result of new information, future events or otherwise. You are advised to consult any further disclosures we make on related subjects in our reports on Form 10-Q, 8-K and 10-K that we provide to the Securities and Exchange Commission.\nAttachment 1\nPolyOne Corporation\nSummary of Condensed Consolidated Statements of Income (Unaudited)\n(In millions, except per share data)\nThree Months Ended\nDecember 31,\nYear Ended\nDecember 31,\n2017\n2016\n2017\n2016\nSales\n$\n800.6\n$\n694.8\n$\n3,229.9\n$\n2,938.6\nOperating income\n45.8\n62.1\n277.5\n286.3\nNet income from continuing operations attributable to PolyOne\nshareholders\n35.4\n35.2\n173.5\n166.4\nBasic earnings per share from continuing operations attributable to\nPolyOne shareholders\n$\n0.44\n$\n0.43\n$\n2.13\n$\n1.98\nDiluted earnings per share from continuing operations attributable to\nPolyOne shareholders\n$\n0.43\n$\n0.42\n$\n2.11\n$\n1.96\nSenior management uses comparisons of adjusted net income from continuing operations attributable to PolyOne shareholders and diluted adjusted earnings per share (EPS) from continuing operations attributable to PolyOne shareholders, excluding special items, to assess performance and facilitate comparability of results. Senior management believes these measures are useful to investors because they allow for comparison to PolyOne's performance in prior periods without the effect of items that, by their nature, tend to obscure PolyOne's operating results due to the potential variability across periods based on timing, frequency and magnitude. Non-GAAP financial measures have limitations as analytical tools and should not be considered in isolation from, or solely as alternatives to, financial measures prepared in accordance with GAAP. Below is a reconciliation of these non-GAAP financial measures to their most directly comparable financial measures calculated and presented in accordance with GAAP. See Attachment 3 for a definition and summary of special items.\nThree Months Ended\nDecember 31, 2017\nThree Months Ended\nDecember 31, 2016\nReconciliation to Condensed Consolidated Statements of Income\n$\nEPS\n$\nEPS\nNet income from continuing operations attributable to PolyOne\nshareholders\n$\n35.4\n$\n0.43\n$\n35.2\n$\n0.42\nSpecial items, after tax (Attachment 3)\n(2.2)\n(0.02)\n(2.5)\n(0.03)\nAdjusted net income / EPS - excluding special items\n$\n33.2\n$\n0.41\n$\n32.7\n$\n0.39\nYear Ended\nDecember 31, 2017\nYear Ended\nDecember 31, 2016\nReconciliation to Condensed Consolidated Statements of Income\n$\nEPS\n$\nEPS\nNet income from continuing operations attributable to PolyOne\nshareholders\n$\n173.5\n$\n2.11\n$\n166.4\n$\n1.96\nSpecial items, after tax (Attachment 3)\n8.1\n0.10\n7.9\n0.10\nAdjusted net income / EPS - excluding special items\n$\n181.6\n$\n2.21\n$\n174.3\n$\n2.06\nAttachment 2\nPolyOne Corporation\nCondensed Consolidated Statements of Income (Unaudited)\n(In millions, except per share data)\nThree Months Ended\nDecember 31,\nYear Ended\nDecember 31,\n2017\n2016\n2017\n2016\nSales\n$\n800.6\n$\n694.8\n$\n3,229.9\n$\n2,938.6\nCost of sales\n631.4\n542.3\n2,510.9\n2,261.5\nGross margin\n169.2\n152.5\n719.0\n677.1\nSelling and administrative expense\n123.4\n90.4\n441.5\n390.8\nOperating income\n45.8\n62.1\n277.5\n286.3\nInterest expense, net\n(15.5)\n(15.4)\n(60.8)\n(59.7)\nDebt extinguishment costs\n—\n—\n(0.3)\n(0.4)\nOther (expense) income, net\n(0.9)\n0.4\n(4.1)\n0.4\nIncome from continuing operations before income taxes\n29.4\n47.1\n212.3\n226.6\nIncome tax benefit (expense)\n6.1\n(12.0)\n(38.7)\n(60.4)\nNet income from continuing operations\n35.5\n35.1\n173.6\n166.2\nIncome (loss) from discontinued operations, net of taxes\n2.6\n(1.4)\n(231.2)\n(1.2)\nNet income (loss)\n$\n38.1\n$\n33.7\n$\n(57.6)\n$\n165.0\nNet (income) loss attributable to noncontrolling interests\n(0.1)\n0.1\n(0.1)\n0.2\nNet income (loss) attributable to PolyOne common shareholders\n$\n38.0\n$\n33.8\n$\n(57.7)\n$\n165.2\nEarnings (loss) per common share attributable to PolyOne common shareholders - Basic:\nContinuing operations\n$\n0.44\n$\n0.43\n$\n2.13\n$\n1.98\nDiscontinued operations\n0.03\n(0.02)\n(2.84)\n(0.01)\nTotal\n$\n0.47\n$\n0.41\n$\n(0.71)\n$\n1.97\nEarnings (loss) per common share attributable to PolyOne common shareholders - Diluted:\nContinuing operations\n$\n0.43\n$\n0.42\n$\n2.11\n$\n1.96\nDiscontinued operations\n0.03\n(0.02)\n(2.81)\n(0.01)\nTotal\n$\n0.46\n$\n0.40\n$\n(0.70)\n$\n1.95\nCash dividends declared per share of common stock\n$\n0.175\n$\n0.135\n$\n0.580\n$\n0.495\nWeighted-average shares used to compute earnings per common share:\nBasic\n80.9\n83.1\n81.5\n83.9\nDiluted\n81.8\n83.7\n82.1\n84.6\nAttachment 3\nPolyOne Corporation\nSummary of Special Items (Unaudited)\n(In millions, except per share data)\nSpecial items (1)\nThree Months Ended\nDecember 31,\nYear Ended\nDecember 31,\n2017\n2016\n2017\n2016\nCost of sales:\nRestructuring costs\n$\n(0.2)\n$\n(0.2)\n$\n3.1\n$\n(1.1)\nEnvironmental remediation costs\n(2.7)\n(2.2)\n(14.8)\n(8.4)\nReimbursement of previously incurred environmental costs\n2.8\n0.8\n9.1\n6.1\nPension & other post-retirement benefits - mark-to-market adjustment\n(0.1)\n0.3\n(0.1)\n0.3\nAcquisition related costs\n(0.3)\n(0.3)\n(3.0)\n(6.8)\nImpact on cost of sales\n(0.5)\n(1.6)\n(5.7)\n(9.9)\nSelling and administrative expense:\nRestructuring, legal and other\n(9.2)\n(3.0)\n(20.7)\n(19.8)\nPension & other post-retirement benefits - mark-to-market adjustment\n(3.2)\n8.1\n(3.2)\n8.1\nAcquisition related costs\n(0.5)\n(0.6)\n(2.9)\n(2.0)\nImpact on selling and administrative expense\n(12.9)\n4.5\n(26.8)\n(13.7)\nImpact on operating income\n(13.4)\n2.9\n(32.5)\n(23.6)\nDebt extinguishment costs\n—\n—\n(0.3)\n(0.4)\nOther income (expense), net\n0.1\n0.1\n(0.1)\n0.2\nImpact on income from continuing operations before income taxes\n(13.3)\n3.0\n(32.9)\n(23.8)\nIncome tax benefit (expense) on above special items\n4.8\n(1.8)\n11.6\n8.3\nTax adjustments (2)\n10.7\n1.3\n13.2\n7.6\nImpact of special items on net income from continuing operations\nattributable to PolyOne Shareholders\n$\n2.2\n$\n2.5\n$\n(8.1)\n$\n(7.9)\nDiluted earnings per common share impact\n$\n0.02\n$\n0.03\n$\n(0.10)\n$\n(0.10)\nWeighted average shares used to compute adjusted earnings per share:\nDiluted\n81.8\n83.7\n82.1\n84.6\n(1)\nSpecial items include charges related to specific strategic initiatives or financial restructuring such as: consolidation of operations; debt\nextinguishment costs; costs incurred directly in relation to acquisitions or divestitures; employee separation costs resulting from personnel\nreduction programs, plant realignment costs, executive separation agreements; asset impairments; mark-to-market adjustments associated\nwith actuarial gains and losses on pension and other post-retirement benefit plans; environmental remediation costs, fines, penalties and\nrelated insurance recoveries related to facilities no longer owned or closed in prior years; gains and losses on the divestiture of operating\nbusinesses, joint ventures and equity investments; gains and losses on facility or property sales or disposals; results of litigation, fines or\npenalties, where such litigation (or action relating to the fines or penalties) arose prior to the commencement of the performance period;\none-time, non-recurring items; and the effect of changes in accounting principles or other such laws or provisions affecting reported results.\n(2)\nTax adjustments include the net tax benefit/(expense) from one-time income tax items, the set-up or reversal of uncertain tax position\nreserves and deferred income tax valuation allowance adjustments.\nAttachment 4\nPolyOne Corporation\nCondensed Consolidated Balance Sheets\n(In millions)\nYear Ended\nDecember 31, 2017\nYear Ended\nDecember 31, 2016\nASSETS\nCurrent assets\nCash and cash equivalents\n$\n243.6\n$\n225.5\nAccounts receivable, net\n392.4\n325.6\nInventories, net\n327.8\n266.4\nCurrent assets held-for-sale\n—\n86.5\nOther current assets\n102.8\n45.5\nTotal current assets\n1,066.6\n949.5\nProperty, net\n461.6\n426.3\nGoodwill\n610.5\n532.7\nIntangible assets, net\n400.0\n342.7\nNon-current assets held for sale\n—\n347.4\nOther non-current assets\n166.6\n137.2\nTotal assets\n$\n2,705.3\n$\n2,735.8\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities\nShort-term and current portion of long-term debt\n$\n32.6\n$\n18.5\nAccounts payable\n388.9\n320.9\nCurrent liabilities held-for-sale\n—\n45.3\nAccrued expenses and other current liabilities\n149.1\n125.2\nTotal current liabilities\n570.6\n509.9\nNon-current liabilities:\nLong-term debt\n1,276.4\n1,239.4\nPension and other post-retirement benefits\n62.3\n63.1\nNon-current liabilities held-for-sale\n—\n50.2\nOther non-current liabilities\n196.6\n147.7\nTotal non-current liabilities\n1,535.3\n1,500.4\nShareholders' equity\nPolyOne shareholders' equity\n598.5\n724.7\nNoncontrolling interests\n0.9\n0.8\nTotal equity\n599.4\n725.5\nTotal liabilities and shareholder's equity\n$\n2,705.3\n$\n2,735.8\nAttachment 5\nPolyOne Corporation\nCondensed Consolidated Statements of Cash Flows (Unaudited)\n(In millions)\nYear Ended December 31,\n2017\n2016\nOperating Activities\nNet (loss) income\n$\n(57.6)\n$\n165.0\nAdjustments to reconcile net income to net cash provided by operating activities:\nLoss on sale of business, net of tax\n227.7\n—\nDepreciation and amortization\n97.4\n100.5\nAccelerated depreciation and fixed asset charges associated with restructuring\nactivities\n0.9\n5.4\nGain on sale of closed facilities\n(3.6)\n—\nDebt extinguishment costs\n0.3\n0.4\nShare-based compensation expense\n10.2\n8.4\nChange in assets and liabilities, net of the effect of acquisitions:\nIncrease in accounts receivable\n(44.7)\n(17.6)\n(Increase) decrease in inventories\n(41.1)\n0.8\nIncrease in accounts payable\n52.2\n12.4\nDecrease in pension and other post-retirement benefits\n(9.6)\n(43.2)\nDecrease in accrued expenses and other assets and liabilities - net\n(29.7)\n(4.5)\nNet cash provided by operating activities\n202.4\n227.6\nInvesting activities\nCapital expenditures\n(79.6)\n(84.2)\nBusiness acquisitions, net of cash acquired\n(163.8)\n(164.2)\nProceeds from sale of business and other assets\n124.0\n13.0\nNet cash used by investing activities\n(119.4)\n(235.4)\nFinancing activities\nProceeds from long-term debt\n—\n100.0\nBorrowing under credit facilities\n1,472.9\n1,031.9\nRepayment under credit facilities\n(1,417.0)\n(1,032.7)\nPurchase of common shares for treasury\n(70.7)\n(86.2)\nCash dividends paid\n(44.1)\n(40.2)\nRepayment of long-term debt\n(6.5)\n(6.0)\nPayments of withholding tax on share awards\n(4.7)\n(5.1)\nDebt financing costs\n(2.6)\n(2.0)\nNet cash used by financing activities\n(72.7)\n(40.3)\nEffect of exchange rate changes on cash\n6.6\n(5.0)\nIncrease (decrease) in cash and cash equivalents\n16.9\n(53.1)\nCash and cash equivalents at beginning of year\n226.7\n279.8\nCash and cash equivalents at end of year\n$\n243.6\n$\n226.7\nAttachment 6\nPolyOne Corporation\nBusiness Segment and Platform Operations (Unaudited)\n(In millions)\nOperating income at the segment level does not include: special items as defined in Attachment 3; corporate general and administration costs that are not allocated to segments; intersegment sales and profit eliminations; share-based compensation costs; and certain other items that are not included in the measure of segment profit and loss that is reported to and reviewed by the chief operating decision maker. These costs are included in Corporate and eliminations.\nThree Months Ended\nDecember 31,\nYear Ended\nDecember 31,\n2017\n2016\n2017\n2016\nSales:\nColor, Additives and Inks\n$\n222.6\n$\n184.7\n$\n893.2\n$\n797.7\nSpecialty Engineered Materials\n150.2\n135.3\n624.3\n565.8\nPerformance Products and Solutions\n177.0\n158.2\n720.6\n668.5\nPolyOne Distribution\n286.6\n254.8\n1,154.6\n1,071.0\nCorporate and eliminations\n(35.8)\n(38.2)\n(162.8)\n(164.4)\nSales\n$\n800.6\n$\n694.8\n$\n3,229.9\n$\n2,938.6\nGross margin:\nColor, Additives and Inks\n$\n75.4\n$\n62.8\n$\n312.2\n$\n286.1\nSpecialty Engineered Materials\n40.8\n38.6\n169.5\n167.5\nPerformance Products and Solutions\n26.5\n26.6\n123.0\n121.2\nPolyOne Distribution\n29.2\n27.3\n126.0\n117.1\nCorporate and eliminations\n(2.7)\n(2.8)\n(11.7)\n(14.8)\nGross margin\n$\n169.2\n$\n152.5\n$\n719.0\n$\n677.1\nSelling and administrative expense:\nColor, Additives and Inks\n$\n46.9\n$\n39.8\n$\n173.6\n$\n158.6\nSpecialty Engineered Materials\n24.8\n22.8\n91.3\n86.4\nPerformance Products and Solutions\n11.6\n11.2\n45.9\n46.8\nPolyOne Distribution\n14.1\n12.6\n53.4\n48.9\nCorporate and eliminations\n26.0\n4.0\n77.3\n50.1\nSelling and administrative expense\n$\n123.4\n$\n90.4\n$\n441.5\n$\n390.8\nOperating income:\nColor, Additives and Inks\n$\n28.5\n$\n23.0\n$\n138.6\n$\n127.5\nSpecialty Engineered Materials\n16.0\n15.8\n78.2\n81.1\nPerformance Products and Solutions\n14.9\n15.4\n77.1\n74.4\nPolyOne Distribution\n15.1\n14.7\n72.6\n68.2\nCorporate and eliminations\n(28.7)\n(6.8)\n(89.0)\n(64.9)\nOperating income\n$\n45.8\n$\n62.1\n$\n277.5\n$\n286.3\nAttachment 7\nPolyOne Corporation\nReconciliation of Non-GAAP Financial Measures (Unaudited)\n(In millions, except per share data)\nSenior management uses gross margin before special items and operating income before special items to assess performance and allocate resources because senior management believes that these measures are useful in understanding current profitability levels and how it may serve as a basis for future performance. In addition, operating income before the effect of special items is a component of PolyOne annual and long-term employee incentive plans and is used in debt covenant computations. Senior management believes these measures are useful to investors because they allow for comparison to PolyOne's performance in prior periods without the effect of items that, by their nature, tend to obscure PolyOne's operating results due to the potential variability across periods based on timing, frequency and magnitude. Non-GAAP financial measures have limitations as analytical tools and should not be considered in isolation from, or solely as alternatives to, financial measures prepared in accordance with GAAP. Below is a reconciliation of these non-GAAP financial measures to their most directly comparable financial measures calculated and presented in accordance with GAAP. See Attachment 3 for a definition and summary of special items.\nThree Months Ended\nDecember 31,\nYear Ended\nDecember 31,\nReconciliation to Consolidated Statements of Income\n2017\n2016\n2017\n2016\nSales\n$\n800.6\n$\n694.8\n$\n3,229.9\n$\n2,938.6\nGross margin - GAAP\n169.2\n152.5\n719.0\n677.1\nSpecial items in gross margin (Attachment 3)\n0.5\n1.6\n5.7\n9.9\nAdjusted Gross margin\n$\n169.7\n$\n154.1\n$\n724.7\n$\n687.0\nAdjusted Gross margin as a percent of sales\n21.2\n%\n22.2\n%\n22.4\n%\n23.4\n%\nOperating income - GAAP\n45.8\n62.1\n277.5\n286.3\nSpecial items in operating income (Attachment 3)\n13.4\n(2.9)\n32.5\n23.6\nAdjusted Operating income\n$\n59.2\n$\n59.2\n$\n310.0\n$\n309.9\nAdjusted Operating income as a percent of sales\n7.4\n%\n8.5\n%\n9.6\n%\n10.5\n%\nThe tables below reconciles pre-special income tax expense and the pre-special effective tax rate to their most comparable US GAAP figures.\nThree Months Ended\nDecember 31, 2017\nThree Months Ended\nDecember 31, 2016\nGAAP\nResults\nSpecial\nItems\nAdjusted\nResults\nGAAP\nResults\nSpecial\nItems\nAdjusted\nResults\nIncome from continuing operations before income taxes\n$\n29.4\n$\n13.3\n$\n42.7\n$\n47.1\n$\n(3.0)\n$\n44.1\nIncome tax benefit (expense) - GAAP\n6.1\n—\n6.1\n(12.0)\n—\n(12.0)\nIncome tax impact of special items (Attachment 3)\n—\n(4.8)\n(4.8)\n—\n1.8\n1.8\nTax adjustments (Attachment 3)\n—\n(10.7)\n(10.7)\n—\n(1.3)\n(1.3)\nIncome tax benefit (expense)\n$\n6.1\n$\n(15.5)\n$\n(9.4)\n$\n(12.0)\n$\n0.5\n$\n(11.5)\nEffective Tax Rate\nnm\n22.0\n%\n25.5\n%\n26.1\n%\nnm - not meaningful\nYear Ended\nDecember 31, 2017\nYear Ended\nDecember 31, 2016\nGAAP\nResults\nSpecial\nItems\nAdjusted\nResults\nGAAP\nResults\nSpecial\nItems\nAdjusted\nResults\nIncome from continuing operations before income taxes\n$\n212.3\n$\n32.9\n$\n245.2\n$\n226.6\n$\n23.8\n$\n250.4\nIncome tax expense - GAAP\n(38.7)\n—\n(38.7)\n(60.4)\n—\n(60.4)\nIncome tax impact of special items (Attachment 3)\n—\n(11.6)\n(11.6)\n—\n(8.3)\n(8.3)\nTax adjustments (Attachment 3)\n—\n(13.2)\n(13.2)\n—\n(7.6)\n(7.6)\nIncome tax expense\n$\n(38.7)\n$\n(24.8)\n$\n(63.5)\n$\n(60.4)\n$\n(15.9)\n$\n(76.3)\nEffective Tax Rate\n18.2\n%\n25.9\n%\n26.7\n%\n30.5\n%\nLiquidity is calculated as follows:\n(In millions)\nAs of December 31, 2017\nCash and cash equivalents\n$\n243.6\nRevolving credit availability\n330.3\nLiquidity\n$\n573.9\nView original content: http://www.prnewswire.com/news-releases/polyone-announces-fourth-quarter-and-full-year-2017-results-300588752.html\nSOURCE PolyOne Corporation", "external_links": ["http://www.polyone.com/", "http://www.polyone.com/investor", "http://www.polyone.com/news", "http://www.prnewswire.com/news-releases/polyone-announces-fourth-quarter-and-full-year-2017-results-300588752.html"], "published": "2018-01-26T14:48:00.000+02:00", "crawled": "2018-01-26T16:43:53.002+02:00", "highlightTitle": ""}