{"organizations": [], "uuid": "4d403fed945aa847f2742c0bda065502714292f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000666/device/rss", "section_title": "IPOs", "url": "https://www.cnbc.com/2018/01/15/reuters-america-update-2-xiaomi-taps-clsa-morgan-stanley-goldman-for-ipo-sponsor-role-sources.html", "country": "US", "domain_rank": 767, "title": "2-Xiaomi taps CLSA, Morgan Stanley, Goldman for IPO sponsor role -sources", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T13:15:00.000+02:00", "replies_count": 0, "uuid": "4d403fed945aa847f2742c0bda065502714292f4"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/15/reuters-america-update-2-xiaomi-taps-clsa-morgan-stanley-goldman-for-ipo-sponsor-role-sources.html", "ord_in_thread": 0, "title": "2-Xiaomi taps CLSA, Morgan Stanley, Goldman for IPO sponsor role -sources", "locations": [], "entities": {"persons": [{"name": "deutsche ba", "sentiment": "negative"}, {"name": "xiaomi", "sentiment": "negative"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "goldman for ipo", "sentiment": "negative"}, {"name": "ifr", "sentiment": "negative"}, {"name": "credit suisse", "sentiment": "negative"}, {"name": "clsa", "sentiment": "negative"}, {"name": "morgan stanley", "sentiment": "negative"}, {"name": "deutshe bank", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "xiaomi ipo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "-sources@\n* Xiaomi's IPO expected to come in 2nd half of this year- IFR\n* Credit Suisse, Deutsche Bank also tapped to work on Xiaomi IPO - source\n* Xiaomi's IPO most likely to happen in Hong Kong - sources (Changes sourcing, adds more details of Xiaomi's IPO banks and context)\nHONG KONG, Jan 15 (Reuters) - Xiaomi has tapped CLSA, Goldman Sachs and Morgan Stanley as joint sponsors for its proposed IPO, people with direct knowledge of the matter said, in what could potentially value the Chinese smartphone maker at up to $100 billion.\nThe initial public offering could be the worlds biggest tech float in 2018 and is expected to come in the second half of the year, IFR reported on Monday.\nXiaomi has separately tapped Credit Suisse and Deutshe Bank to work on its IPO, another source told Reuters. The source, however, added that the roles for global banks haven't been decided and that no formal mandate has been given to any Chinese bank.\nA spokesman for Xiaomi declined to comment. IFR, a Thomson Reuters publication, first reported on the IPO sponsors.\nThe smartphone maker last month told bankers that it would beat its 2017 sales targets by up to 18 percent as it continues to benefit from a business overhaul that followed its over-expansion and fierce competition from domestic rivals including Oppo and Vivo.\nBankers expect Xiaomis profits to rise sharply in 2018 as its rebound continues, and have told the company valued at $46 billion in a 2014 funding round before its slump - that a $100 billion valuation at the IPO is possible.\nThe smartphone maker will add more banks to its IPO later in the process, according to IFR, which reported that Credit Suisse, Deutsche Bank, JP Morgan and two Chinese banks were expected to get the nod for roles as joint global coordinators.\nXiaomi's potential IPO - most likely in Hong Kong, according to sources - would headline a series of hotly-anticipated Chinese tech floats in the city this year. Other expected listings include Lufax, the wealth management platform backed by insurance group Ping An.\nLufax, China's largest online wealth management platform, is expected to sell $6 billion to $9 billion of shares in its IPO, and is seeking a valuation of $60 billion, the South China Morning Post reported on Monday.\nIn all, bankers anticipate tech companies worth up to $500 billion could seek IPOs in Hong Kong or New York over the next two years, encouraged by investor enthusiasm for recent tech floats and buoyant stock markets. (Reporting by Julie Zhu and Fiona Lau of IFR; Writing by Jennifer Hughes and Kane Wu; Editing by Malcolm Foster and Muralikumar Anantharaman)", "external_links": [], "published": "2018-01-15T13:15:00.000+02:00", "crawled": "2018-01-16T09:55:43.009+02:00", "highlightTitle": ""}