{"organizations": [], "uuid": "fa40bb9f2652872199690eb4adfeb39e131a3c2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-alpine-4-technologies-alpp-expects-to-report-revenue-growth-of-35-percent-for-q4-2017.html", "country": "US", "domain_rank": 767, "title": "Alpine 4 Technologies (ALPP) Expects to Report Revenue Growth of 35% for Q4 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:13:00.000+02:00", "replies_count": 0, "uuid": "fa40bb9f2652872199690eb4adfeb39e131a3c2a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-alpine-4-technologies-alpp-expects-to-report-revenue-growth-of-35-percent-for-q4-2017.html", "ord_in_thread": 0, "title": "Alpine 4 Technologies (ALPP) Expects to Report Revenue Growth of 35% for Q4 2017", "locations": [], "entities": {"persons": [{"name": "kent b. wilson", "sentiment": "none"}], "locations": [{"name": "phoenix", "sentiment": "none"}], "organizations": [{"name": "automotive technologies", "sentiment": "none"}, {"name": "venture west energy services", "sentiment": "none"}, {"name": "technologies, ltd.", "sentiment": "none"}, {"name": "electronics manufacturing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHOENIX, Jan. 10, 2018 /PRNewswire/ -- Alpine 4 Technologies (ALPP) announced today that it is providing the preliminary guidance for its Q4 2017 sales. The company expects to report for the period ending Q4 2017 sales to be roughly $3.1 million dollars, which is growth of approximately 35% over Q3 2017 and by approximately 68% over Q4 2016.\nKent B. Wilson CEO had this to say. \"As we were anticipating, our Q4 2017 certainly shaped up to be a record quarter for Alpine 4. All three subsidiaries grew as a percentage of revenue over Q3 2017 and Q4 2016; however, the largest percentage of growth came with our connected car company ALTIA, and with our energy services company, Venture West Energy Services. We believe Q4 has set the foundation for what will be a remarkable 2018 for Alpine 4, and we attribute this success to the hard and resolute work of our employees and executive leadership team.\"\nAbout Alpine 4 Technologies, Ltd.: Alpine 4 is a publicly traded enterprise with business-related endeavors in Automotive Technologies, Electronics Manufacturing, Engineering and Software development, and Energy Services.\nFour principles at the core of our business are: Synergy. Innovation. Drive. Excellence. At Alpine 4, we believe synergistic innovation drives excellence. By anchoring these words to our combined experience and capabilities, we are able to aggressively pursue opportunities within and across vertical markets. We deliver solutions that not only drive industry standards, but also increase value for our shareholders.\nContact: Kent B. Wilson, CEO or Ian Kantrowitz, Director of Investor Relations\nkwilson@alpine4.com\niank@alpine4.com\nwww.alpine4.com\nForward-Looking Statements:\nThe information disclosed in this press release is made as of the date hereof and reflects Alpine 4 most current assessment of its historical financial performance. Actual financial results filed with the SEC may differ from those contained herein due to timing delays between the date of this release and confirmation of final audit results. The information in this press release is unaudited and is subject to adjustment when the Company's financial statements are audited and presented in the Company's Annual Report on Form 10-K. These forward-looking statements are not guarantees of future performance and are subject to uncertainties and other factors that could cause actual results to differ materially from those expressed in the forward-looking statements including, without limitation, the risks, uncertainties, including the uncertainties surrounding the current market volatility, and other factors the Company identifies from time to time in its filings with the SEC. Although Alpine 4 believes that the assumptions on which these forward-looking statements are reasonable, any of those assumptions could prove to be inaccurate and, as a result, the forward-looking statements based on those assumptions also could be incorrect. You should not place undue reliance on these forward-looking statements. The forward-looking statements contained in this release are made as of the date hereof, and Alpine 4 disclaims any intention or obligation to update the forward-looking statements for subsequent events.\nView original content: http://www.prnewswire.com/news-releases/alpine-4-technologies-alpp-expects-to-report-revenue-growth-of-35-for-q4-2017-300580839.html\nSOURCE Alpine 4 Technologies, Ltd.", "external_links": ["http://www.prnewswire.com/news-releases/alpine-4-technologies-alpp-expects-to-report-revenue-growth-of-35-for-q4-2017-300580839.html", "http://www.alpine4.com/"], "published": "2018-01-10T20:13:00.000+02:00", "crawled": "2018-01-10T20:07:39.023+02:00", "highlightTitle": ""}