{"organizations": [], "uuid": "11f16bd50c7a79dd69b856f41c9c8fd3e23b05d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-1-top-eu-diplomat-upbeat-as-she-ends-cuba-visit.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Top EU diplomat upbeat as she ends Cuba visit", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T01:18:00.000+02:00", "replies_count": 0, "uuid": "11f16bd50c7a79dd69b856f41c9c8fd3e23b05d8"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-1-top-eu-diplomat-upbeat-as-she-ends-cuba-visit.html", "ord_in_thread": 0, "title": "UPDATE 1-Top EU diplomat upbeat as she ends Cuba visit", "locations": [], "entities": {"persons": [{"name": "mogherini", "sentiment": "negative"}, {"name": "bruno rodriguez", "sentiment": "none"}, {"name": "federica mogherini", "sentiment": "none"}], "locations": [{"name": "cuba", "sentiment": "none"}, {"name": "havana", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "negative"}, {"name": "european investment bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts throughout with Mogherini news conference)\nHAVANA, Jan 4 (Reuters) - The European Union's top diplomat Federica Mogherini said on Thursday that member countries combined were now Cuba's most important economic partner and announced a series of agreements as she ended a two-day visit to the communist country.\nAs the U.S.-Cuba rapprochement unfolded in 2015-2016 the EU dropped all sanctions and negotiated a political dialogue and cooperation agreement, the first between Cuba and the EU.\n\"The agreement provides new potential in the fields of cooperation, trade, investment and also political dialogue,\" Mogherini said in brief comments to journalists before meeting with Cuban Foreign Minister Bruno Rodriguez Thursday morning.\n\"The EU has become Cuba's first trade partner and was already the first in investment and development cooperation ... which means it is possible to increase the level of economic relations and investments,\" she said at a news conference before her departure in the afternoon.\nMogherini said a delegation from the European Investment Bank would visit Cuba later this month.\nShe said cooperation agreements in renewable energy, sustainable agriculture, culture and expertise valued at 49 million euros ($59.1 million) would be signed shortly.\nIn February Mogherini will preside with Rodriguez in Brussels over the first ever joint cooperation meeting between the EU and Cuba, she said.\nDuring her visit she repeatedly criticized the U.S. trade embargo and said on Thursday she regretted \"that the current U.S. administration has apparently changed course with Cuba.\"\nThe Trump administration has partially rolled back a fragile detente between the old Cold War foes begun by former U.S. President Barack Obama.\nDiplomats said the EU appeared to sense an opportunity, with President Raul Castro expected to retire in April and market-oriented reforms already underway.\n\"I believe that Europe has the potential and interest to take an independent agenda in Cuba in economic and political matters for strategic purposes,\" said a senior Latin American diplomat, who asked not to be identified.\n\"Cuba does not cost so much and is very symbolic worldwide. At the same time it balances the growing Russian and Chinese influence,\" he said.\nRichard Feinberg, an economist and expert on Latin America and Cuba at the Brookings Institution, said Cuban commerce is so spread around the world today that no single country accounts for more than 20 percent of its total trade.\n\"Strong relations with Europe fits into their international diversification strategy so as not to be dependent on anyone,\" he said. (Reporting by Marc Frank; Addiitonal reporting by Nelson Acosta in Havana; Editing by Frank Jack Daniel, Tom Brown and Richard Chang)", "external_links": [], "published": "2018-01-05T01:18:00.000+02:00", "crawled": "2018-01-05T04:35:10.000+02:00", "highlightTitle": ""}