{"organizations": [], "uuid": "384a5aa85c4a868aaf793dd4e3d690314f02636a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-vertical-edge-consulting-group-announces-acquisition-of-metavero.html", "country": "US", "domain_rank": 767, "title": "Vertical Edge Consulting Group Announces Acquisition of METAVERO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.988, "site_type": "news", "published": "2018-01-05T15:05:00.000+02:00", "replies_count": 0, "uuid": "384a5aa85c4a868aaf793dd4e3d690314f02636a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-vertical-edge-consulting-group-announces-acquisition-of-metavero.html", "ord_in_thread": 0, "title": "Vertical Edge Consulting Group Announces Acquisition of METAVERO", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "metavero tampa", "sentiment": "none"}], "organizations": [{"name": "vertical edge consulting group", "sentiment": "negative"}, {"name": "specialized platinum partner", "sentiment": "none"}, {"name": "oracle cloud standard designee", "sentiment": "none"}, {"name": "oracle gold partner", "sentiment": "none"}, {"name": "metavero", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TAMPA, Fla.--(BUSINESS WIRE)-- Vertical Edge Consulting Group, a Professional Services firm and Oracle Specialized Platinum Partner in Enterprise Performance Management (EPM) and Business Intelligence (BI) and Oracle Cloud Standard Designee announced today the acquisition of METAVERO, an Oracle Gold Partner consulting firm specializing in Enterprise Performance Managed (EPM) solutions.\nThe acquisition of METAVERO is part of Vertical Edge Consulting Group’s aggressive growth strategy to build on core capabilities in solving fragmented and complex reporting and business analysis issues. Vertical Edge Consulting Group will combine METAVERO’s cross-functional skillset bridging finance and information technology and their experience with Fortune 500 companies with its existing proven expertise in delivering full lifecycle solutions through the design and implementation of enterprise back office technologies. An emerging leader in the industry, Vertical Edge Consulting Group continues to solidify its commitment to providing a well-rounded scope of offerings including cloud solutions to ensure that the highest level of value and service is maintained for its growing base of EPM and BI customers.\nAs a Gold-level member of the Oracle PartnerNetwork, METAVERO has a deep-rooted working knowledge, proven hands-on application competencies and specialized technical skills and training traversing the Oracle Enterprise Performance Management suite of products. Founded in 2011 with a strong focus on the finance function, METAVERO’s services include implementation, migration, managed services as well as application and infrastructure support and span industries including hospitality, oil and gas and construction. Their notable core competencies include Oracle Hyperion Planning, Oracle Essbase and Oracle Hyperion Financial Management.\n\"Vertical Edge Consulting Group has collaborated with METAVERO over the years in successfully implementing projects in a myriad of industries,” said John Conlee, Chairman and CEO of Vertical Edge Consulting Group. “With a team of motivated and seasoned consultants, a proven track record in the EPM space and core goals that align with Vertical Edge Consulting Group’s mission and growth plan, we enthusiastically welcome the METAVERO team.”\nJohn Booth, Founder and CEO of METAVERO, now joins Vertical Edge Consulting Group as the Vice President of Technology. “I am excited to see the strengths and success of METAVERO marry together with our long-time partner Vertical Edge Consulting Group,” said Booth. “The growing Vertical Edge team will continue our commitment to providing our clients unrivaled services and industry best practice solutions.”\n“This is the first acquisition for Vertical Edge Consulting Group as part of our ambitious plans to grow and market our best in class services,” said Conlee. “We are excited to continue growing in the Oracle EPM and BI Cloud space as we help our clients maximize their investment in Oracle technology.”\nAbout Vertical Edge\nVertical Edge Consulting Group is a full-service Oracle Enterprise Performance Management / Business Intelligence and IT Advisory consulting firm with offices in Tampa, FL and Indianapolis, IN. As an Oracle Platinum Partner, the firm specializes in solving fragmented and complex reporting and business analysis issues through the design and implementation of technology solutions that integrate strategic, operational, and financial data to optimize enterprise-wide performance. For more information, call 888-241-4284, email info@verticaledgecg.com or visit the website at www.verticaledgecg.com .\nAbout METAVERO\nMETAVERO is a consulting company in the Enterprise Performance Management (EPM) services space, offering a combination of financial and technical expertise to maximize end-to-end process improvements. Their services include implementation, migration, managed services, as well as application and infrastructure support. With leadership having 25 years of direct Fortune 500 experience, METAVERO focuses on implementation services, consulting with companies on planning and budgeting or financial consolidation processes and software. They also specialize in transitioning from a legacy platform and/or moving to the cloud.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005223/en/\nVertical Edge Consulting Group\nSarah Hart, 205-919-8007\nMarketing Manager\nsjhart@verticaledgecg.com\nSource: Vertical Edge Consulting Group", "external_links": ["http://www.businesswire.com/news/home/20180105005223/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.verticaledgecg.com&esheet=51738095&newsitemid=20180105005223&lan=en-US&anchor=www.verticaledgecg.com&index=1&md5=b2fc990e64eae7073c0269eeb04e4ed0"], "published": "2018-01-05T15:05:00.000+02:00", "crawled": "2018-01-05T17:52:10.000+02:00", "highlightTitle": ""}