{"organizations": [], "uuid": "5be7308fc562ba6c4f7429270a43b9fce2c5a864", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-provident-bancorp-inc-reports-earnings-for-the-december-31-2017-quarter-and-year.html", "country": "US", "domain_rank": 767, "title": "Provident Bancorp, Inc. Reports Earnings for the December 31, 2017 Quarter and Year", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:30:00.000+02:00", "replies_count": 0, "uuid": "5be7308fc562ba6c4f7429270a43b9fce2c5a864"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-provident-bancorp-inc-reports-earnings-for-the-december-31-2017-quarter-and-year.html", "ord_in_thread": 0, "title": "Provident Bancorp, Inc. Reports Earnings for the December 31, 2017 Quarter and Year", "locations": [], "entities": {"persons": [{"name": "david p. mansfield", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "amesbury", "sentiment": "none"}], "organizations": [{"name": "provident bancorp, inc", "sentiment": "neutral"}, {"name": "provident bancorp, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "provident bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AMESBURY, Mass., Jan. 25, 2018 (GLOBE NEWSWIRE) -- Provident Bancorp, Inc. (the “Company”) (Nasdaq:PVBC), the holding company for The Provident Bank (the “Bank”), reported net income for the three months ended December 31, 2017 of $1.7 million, or $0.19 per diluted share, compared to $1.7 million, or $0.19 per diluted share, for the three months ended December 31, 2016. Net income for the year ended December 31, 2017 was $7.9 million, or $0.86 per diluted share, compared to $6.3 million, or $0.69 per diluted share, for the year ended December 31, 2016. In December 2017, the Bank recorded a one-time charge to reduce the carrying value of its deferred tax assets by $2.0 million due to the Tax Cuts and Jobs Act. During the fourth quarter, the Company sold the remaining balance of its equity portfolio and approximately $30.6 million in state and municipal securities that generated gains of $3.5 million.\nDavid P. Mansfield, Chief Executive Officer, said, “2017 was an extraordinary year of growth for The Provident Bank. By staying true to our focus on commercial lending with a high-level of service, we grew our commercial and industrial (C&I) loan portfolio by 45%. The C&I portfolio now represents 32% of total loans, up from 26% at the prior year-end. The success of our business model was further validated by American Banker in their 2017 ranking of banks by C&I loans and leases. The Provident achieved the rank of the tenth largest C&I loan portfolio for banks with less than $1 billion in assets, up from our rank of thirty in 2016. This represents the seventh highest growth rate in the C&I category nationwide. We look forward to continued C&I growth in 2018.”\nNet interest and dividend income before provision for loan losses increased by $1.8 million, or 26.4%, compared to the three months ended December 31, 2016 and increased by $5.9 million, or 22.8%, compared to year ended December 31, 2016. The growth in net interest and dividend income this quarter over the prior year’s fourth quarter is primarily the result of an increase in our average interest earning assets of $124.7 million, or 17.0%, and an increase in net interest margin of 30 basis points to 3.98%. The growth in net interest income for the year ended December 31, 2017 compared to the same period in 2016 is primarily the result of an increase in average interest earning assets of $107.1 million or 15.0% and an increase of the net interest margin of 25 basis points to 3.90%.\nProvisions for loan losses of $462,000 were booked for the three months ended December 31, 2017 compared to $219,000 for the same period in 2016. For the year ended December 31, 2017 $2.9 million of provisions were recognized compared to $703,000 for the year ended December 31, 2016. The changes in the provision were based on management’s assessment of loan portfolio growth and composition changes, historical charge-off trends, levels of problem loans and other asset quality trends.\nThe allowance for loan losses as a percentage of total loans was 1.30% as of December 31, 2017 compared to 1.36% as of December 31, 2016. The allowance for loan losses as a percentage of non-performing loans was 108.02% as of December 31, 2017 compared to 542.98% as of December 31, 2016. Non-performing assets were $9.0 million, or 1.00% of total assets as of December 31, 2017 compared to $1.6 million, or 0.20% of total assets as of December 31, 2016. The non-performing assets at December 31, 2017 consist primarily of two loan relationships. The relationships were evaluated for impairment and charge-offs of $1.5 million have been recorded.\nNoninterest income increased $3.3 million, or 283.5% to $4.5 million for the three months ended December 31, 2017 compared to $1.2 million for the three months ended December 31, 2016. For the year ended December 31, 2017, noninterest income increased $5.5 million, or 124.5%, to $10.0 million compared to $4.4 million for the year ended December 31, 2016. The increase in both periods is primarily due to increased gains on sales of securities. The gains on sales of securities primarily consisted of $2.9 million from equity securities and $850,000 from state and municipal for the three months ended December 31, 2017 and $5.0 million from equity securities and $1.1 million from state and municipal securities for the year ended December 31, 2017. Effective January 2018, the Company is adopting ASU (Accounting Standards Update) No. 2016-01, Financial Instruments – Overall (Subtopic 825-10): “Recognition and Measurement of Financial Assets and Financial Liabilities.” This standard will require us to measure our equity investments at fair value with changes in fair value recognized in net income. The Company evaluated the pronouncement and decided to divest from its equity securities portfolio to reduce potential volatility within the Company’s earnings performance.\nNoninterest expense increased $1.1 million, or 20.5%, to $6.3 million for the three months ended December 31, 2017 compared to $5.3 million for the three months ended December 31, 2016. For the year ended December 31, 2017, noninterest expense increased $3.3 million, or 16.0%, to $23.7 million compared to $20.5 million for the year ended December 31, 2016. The primary reason for the increase in both periods was salary expense. The increase of $641,000, or 19.1%, for the three months ended December 31, 2017 in salary and employee benefits was due to a higher number of employees. The increase of $2.5 million, or 19.3%, for the year ended December 31, 2017 was due to a full year’s expense of the Company’s 2016 Equity Incentive Plan as well as a higher number of employees. Total equity award expense for 2017 was $926,000 compared to $114,000 in 2016.\nIncome tax expense increased $3.8 million, or 516.2%, to $4.5 million for the three months ended December 31, 2017 compared to $730,000 for the three months ended December 31, 2016. For the year ended December 31, 2017, income tax expense increased $4.4 million, or 145.2%, to $7.4 million, reflecting an effective tax rate of 48.4%, compared to $3.0 million for the year ended December 31, 2016, reflecting an effective tax rate of 32.3%. Excluding the effect of the $2.0 million tax adjustment due to the Tax Cuts and Jobs Act, the Company’s effective tax rate was 35.0% in fiscal 2017. The tax change is subject to continued evaluation and adjustment in future periods.\nAs of December 31, 2017, total assets have increased $106.7 million, or 13.4%, to $902.3 million compared to $795.5 million at December 31, 2016. The primary reason for the increase is due to net loans with an increase of $117.7 million, or 18.9%. The increase in net loans was due to an increase in commercial loans of $74.1 million, or 44.6%, an increase in commercial real estate loans of $35.4 million, or 10.5%, an increase in consumer loans of $11.3 million, or 182.8%, and an increase in construction and development loans of $7.8 million, or 15.9%. The increase was partially offset by a decrease in investments in available-for-sale securities of $56.4 million, or 47.9%. During the fourth quarter, the Company sold $30.6 million of state and municipal securities and $9.8 million of equity securities. The sale of the state and municipal securities was done to reduce our concentration within this category. The divesture resulted in a 34% concentration of the portfolio as compared to 47% of the portfolio prior to sale.\nTotal liabilities increased $100.1 million, or 14.6%, due to increased deposits. Deposits were $750.1 million as of December 31, 2017 representing an increase of $122.1 million, or 19.4%, compared to December 31, 2016. The primary reason for the increase in deposits was due to an increase of $80.4 million, or 55.3%, in money market deposits, an increase of $28.7 million, or 10.2%, in NOW and demand deposits, and an increase in time deposits of $11.3 million, or 12.5%. Borrowings decreased $23.0 million, or 46.2%, as the Company was able to reduce borrowings as a result of our increase in deposits.\nAs of December 31, 2017, shareholders’ equity was $115.8 million compared to $109.1 million at December 31, 2016 representing an increase of $6.6 million, or 6.1%. The increase is primarily due to net income of $7.9 million for the year.\nAbout Provident Bancorp, Inc.\nProvident Bancorp, Inc. is a Massachusetts corporation that was formed in 2011 by The Provident Bank to be its holding company. Approximately 52.1% of Provident Bancorp, Inc. outstanding shares are owned by Provident Bancorp, a Massachusetts corporation and a mutual holding company. The Provident Bank is an innovative, commercial bank that finds solutions for our business clients. We are committed to strengthening the economic development of the regions we serve, by working closely with businesses and delivering superior products and high-touch services to meet their banking needs. The Provident has offices in Massachusetts and New Hampshire. All deposits are insured in full through a combination of insurance provided by the Federal Deposit Insurance Corporation (FDIC) and the Depositors Insurance Fund (DIF). For more information about The Provident Bank please visit our website www.theprovidentbank.com or call 877-487-2977.\nForward-looking statements\nThis news release may contain certain forward-looking statements, such as statements of the Company’s or the Bank’s plans, objectives, expectations, estimates and intentions. Forward-looking statements may be identified by the use of words such as, “expects,” “subject,” “believe,” “will,” “intends,” “may,” “will be” or “would.” These statements are subject to change based on various important factors (some of which are beyond the Company’s or the Bank’s control) and actual results may differ materially. Accordingly, readers should not place undue reliance on any forward-looking statements (which reflect management’s analysis of factors only as of the date of which they are given). These factors include general economic conditions, trends in interest rates, the ability of our borrower to repay their loans, the ability of the Company or the Bank to effectively manage its growth and results of regulatory examinations, among other factors. The foregoing list of important factors is not exclusive. Readers should carefully review the risk factors described in other documents of the Company files from time to time with the Securities and Exchange Commission, including Current Reports on Form 8-K.\nProvident Bancorp, Inc.\nCarol Houle, 978-834-8534\nExecutive Vice President/CFO\nchoule@theprovidentbank.com\nProvident Bancorp, Inc.\nConsolidated Balance Sheet At At December 31, December 31, (In thousands) 2017\n2016\nAssets (unaudited) Cash and due from banks $ 10,326 $ 7,939 Interest-bearing demand deposits with other banks 37,363 2,637 Money market mutual funds - 129 Cash and cash equivalents 47,689 10,705 Investments in available-for-sale securities (at fair value) 61,429 117,867 Federal Home Loan Bank stock, at cost 1,854 2,787 Loans, net 742,138 624,425 Assets held-for-sale 3,286 - Bank owned life insurance 25,540 19,395 Premises and equipment, net 10,981 11,587 Accrued interest receivable 2,345 2,320 Deferred tax asset, net 4,920 4,913 Other assets 2,083 1,544 Total assets $ 902,265 $ 795,543 Liabilities and Equity Deposits: Noninterest-bearing $ 186,222 $ 158,075 Interest-bearing 563,835 469,907 Total deposits 750,057 627,982 Federal Home Loan Bank advances 26,841 49,858 Other liabilities 9,590 8,554 Total liabilities 786,488 686,394 Shareholders' equity: Preferred stock; authorized 50,000 shares: no shares issued and outstanding - - Common stock, no par value: 30,000,000 shares authorized; 9,657,319 shares issued, 9,628,496 shares outstanding at December 31, 2017 and 9,652,448 issued and outstanding at December 31, 2016 - - Additional paid-in capital 44,592 43,393 Retained earnings 74,144 66,229 Accumulated other comprehensive income 492 2,622 Unearned compensation - ESOP (2,857 ) (3,095 ) Treasury stock: 28,823 shares at December 31, 2017 (594 ) - Total shareholders' equity 115,777 109,149 Total liabilities and shareholders' equity $ 902,265 $ 795,543\nProvident Bancorp, Inc.\nConsolidated Income Statements Three Months Ended Year Ended December 31, December 31, (Dollars in thousands, except per share data) 2017 2016 2017 2016 Interest and dividend income: (unaudited) Interest and fees on loans $ 8,963 $ 6,688 $ 32,510 $ 25,549 Interest and dividends on securities 575 763 3,172 3,312 Interest on interest-bearing deposits 77 11 100 33 Total interest and dividend income 9,615 7,462 35,782 28,894 Interest expense: Interest on deposits 913 540 2,944 2,163 Interest on Federal Home Loan Bank advances 149 154 782 622 Total interest expense 1,062 694 3,726 2,785 Net interest and dividend income 8,553 6,768 32,056 26,109 Provision for loan losses 462 219 2,929 703 Net interest and dividend income after provision for loan losses 8,091 6,549 29,127 25,406 Noninterest income: Customer service fees on deposit accounts 342 338 1,406 1,274 Service charges and fees - other 434 484 1,905 1,777 Gain on sale of securities, net 3,521 215 5,912 690 Bank owned life insurance income 178 142 645 602 Other income (expense) 12 (9 ) 87 92 Total noninterest income 4,487 1,170 9,955 4,435 Noninterest expense: Salaries and employee benefits 3,998 3,357 15,344 12,857 Occupancy expense 507 354 1,839 1,548 Equipment expense 131 160 587 631 FDIC assessment 93 30 309 323 Data processing 198 171 741 662 Marketing expense 69 71 300 249 Professional fees 280 212 936 1,088 Directors' fees 174 124 607 351 Other 889 782 3,086 2,768 Total noninterest expense 6,339 5,261 23,749 20,477 Income before income tax expense 6,239 2,458 15,333 9,364 Income tax expense 4,498 730 7,418 3,025 Net income $ 1,741 $ 1,728 $ 7,915 $ 6,339 Income per share: Basic $ 0.19 $ 0.19 $ 0.86 $ 0.69 Diluted $ 0.19 $ 0.19 $ 0.86 $ 0.69 Weighted Average Shares: Basic 9,208,854 9,185,285 9,199,274 9,176,384 Diluted 9,257,702 9,185,285 9,199,887 9,176,384\nProvident Bancorp, Inc.\nSelected Financial Ratios For the three For the months ended year ended December 31, December 31, 2017\n2016\n2017\n2016\n(unaudited) Performance Ratios: Return on average assets (1) 0.77 % 0.89 % 0.91 % 0.84 % Return on average equity (1) 5.92 % 6.35 % 6.84 % 5.98 % Interest rate spread (1) (3) 3.77 % 3.50 % 3.71 % 3.47 % Net interest margin (1) (4) 3.98 % 3.68 % 3.90 % 3.65 % Non-interest expense to average assets (1) 2.79 % 2.71 % 2.74 % 2.71 % Efficiency ratio (5) 66.59 % 68.12 % 65.79 % 68.59 % Average interest-earning assets to average interest-bearing liabilities 143.17 % 148.45 % 142.10 % 147.58 % Average equity to average assets 12.96 % 14.02 % 13.32 % 14.06 %\nAt At December 31, December 31, (unaudited) 2017 2016 Asset Quality Ratios: Allowance for loan losses as a percent of total loans (2) 1.30 % 1.36 % Allowance for loan losses as a percent of non-performing loans 108.02 % 542.98 % Non-performing loans as a percent of total loans (2) 1.20 % 0.25 % Non-performing loans as a percent of total assets 1.00 % 0.20 % Non-performing assets as a percent of total assets (6) 1.00 % 0.20 % (1) Annualized for the three months periods. (2) Loans are presented before the allowance but include deferred costs/fees. Loans held-for-sale are excluded. (3) Represents the difference between the weighted average yield on average interest-earning assets and the weighted average cost of interest-bearing liabilities. (4) Represents net interest income as a percent of average interest-earning assets. (5) Represents noninterest expense divided by the sum of net interest income and noninterest income, excluding gains on securities available for sale, net. (6) Non-performing assets consists of non-accrual loans plus loans accruing but 90 days overdue and OREO.\nSource:Provident Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/97c5c6cf-cbbe-4d12-ae65-405611231c86", "https://www.globenewswire.com/Tracker?data=MYNLfF7os2YNU-AK7cVKmWike6qIGXEcdurnYX9abnkGN3HptKTWvZSL5fwJRada7kXImDug_weizGjSmgia6x1M9TOE3fG7BlAQXhxMm_qhkyvH6g_cm-eLu5e80wun"], "published": "2018-01-26T00:30:00.000+02:00", "crawled": "2018-01-26T01:38:56.002+02:00", "highlightTitle": ""}