{"organizations": [], "uuid": "07f0ae08abf5847d4d1bf0e69459c157725bb7be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-china-weather-snow/china-lifts-blizzard-alert-but-second-round-of-snow-forecast-idUSKBN1EU0AC", "country": "US", "domain_rank": 408, "title": "China lifts blizzard alert but second round of snow forecast", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T05:36:00.000+02:00", "replies_count": 0, "uuid": "07f0ae08abf5847d4d1bf0e69459c157725bb7be"}, "author": "", "url": "https://www.reuters.com/article/us-china-weather-snow/china-lifts-blizzard-alert-but-second-round-of-snow-forecast-idUSKBN1EU0AC", "ord_in_thread": 0, "title": "China lifts blizzard alert but second round of snow forecast", "locations": [], "entities": {"persons": [{"name": "shang", "sentiment": "negative"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "hunan", "sentiment": "none"}, {"name": "hubei", "sentiment": "none"}, {"name": "jiangsu", "sentiment": "none"}, {"name": "guizhou", "sentiment": "none"}, {"name": "nanjing", "sentiment": "none"}], "organizations": [{"name": "national meteorological center", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 3:39 AM / Updated 2 hours ago China warns of second wave of snow after blizzard alert lifted Reuters Staff 3 Min Read \nSHANGHAI/BEIJING (Reuters) - China warned of a second wave of snow and sleet hitting northern, central and eastern parts on Friday after record snowfall paralyzed parts of the country in the most severe weather this winter. \nHeavy snowfall has wreaked havoc in central and eastern China since Tuesday, killing 10 people and disrupting the lives of more than half a million people in five provinces, according to the official Xinhua news agency. \nAgriculture has also been hit, with economic losses amounting to 510 million yuan ($79 million) so far. \nThe National Meteorological Centre lifted a blizzard alert, but said light to moderate snowfall was expected to sweep across much of the north between Friday and Sunday. \nSnow has disrupted public transport and energy supplies, damaged power lines and shut roads, airports and schools in parts of central China. \nAll power in Suizhou, a small city of 2.5 million people in the north of central Hubei province, was down due to heavy snow, state broadcaster China Central Television reported. \nTemperatures in Suizhou are expected to plunge as low as minus 5 degrees Celsius (23 degrees Fahrenheit) on Friday. \nHubei, which does not have central heating infrastructure unlike northern provinces, has seen a spike in electricity consumption for heating, according to CCTV. \nOn Thursday, at least three airports were shut and nine were experiencing extensive delays because of heavy snowfall. \nAs of 0630 GMT on Friday, all airports in China were open, and only three airports faced delays, according to Chinese aviation data provider VariFlight. \nSeveral high-speed trains from Shanghai and Beijing were also delayed or canceled on Thursday, and highways in the provinces of Jiangsu, Henan, Shaanxi and Hubei have also been closed off, the China Daily reported. \nThe ceilings of several bus stations in Hefei, the capital of Anhui province, had collapsed as a result of snow, resulting in at least one death, the newspaper said. The province saw a record 30 cm (12 inches) of snow on Thursday. \nThe roof of a factory in Xiangyang, also in Hubei province, collapsed, trapping five people, and traffic in the city ground to a halt, according to the state broadcaster, China National Radio. \nCCTV footage on Friday also showed collapsed roofs of factories in Henan and Anhui provinces. \nBy contrast, Beijing has been dry, with many parts of northern China experiencing little to no snowfall. Reporting by David Stanway in SHANGHAI and Michael Martina in BEIJING; Additional reporting by Judy Hua, Ryan Woo, Brenda Goh and Zhang Min; Editing by Nick Macfie", "external_links": [], "published": "2018-01-05T05:36:00.000+02:00", "crawled": "2018-01-05T05:52:54.008+02:00", "highlightTitle": ""}