{"organizations": [], "uuid": "a28552befb84d2d213814a4e8709efa9f87cecc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104924001-GettyImages-831175246.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/youtube-star-logan-paul-apologizes-for-posting-video-showing-dead-body.html", "country": "US", "domain_rank": 767, "title": "YouTube star Logan Paul apologizes for posting video showing dead body", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T18:38:00.000+02:00", "replies_count": 0, "uuid": "a28552befb84d2d213814a4e8709efa9f87cecc7"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/youtube-star-logan-paul-apologizes-for-posting-video-showing-dead-body.html", "ord_in_thread": 0, "title": "YouTube star Logan Paul apologizes for posting video showing dead body", "locations": [], "entities": {"persons": [{"name": "logan paul", "sentiment": "negative"}, {"name": "taylor swift", "sentiment": "none"}, {"name": "hoda kotb", "sentiment": "none"}, {"name": "matt lauer", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}], "locations": [], "organizations": [{"name": "youtube", "sentiment": "negative"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A YouTube star with millions of followers apologized on Monday for posting a video that showed a dead body hanging from a tree in a Japanese forest known as a destination for suicide victims.\nLogan Paul, 22, posted an apology on Twitter after the video attracted a torrent of criticism online, saying that he had published it in an attempt to raise awareness about suicide and suicide prevention.\n\"I was misguided by shock and awe, as portrayed in the video,\" he said. \"I still am.\"\nLogan Paul tweet \nThe video, which has since been removed from YouTube but is available elsewhere online, begins with Mr. Paul warning viewers that the following footage will be graphic.\nRead more from The New York Times: \nTaylor Swift's 'Reputation' takes back No. 1 on the chart \n'Fake news': Wide reach but little impact, study suggests \nHoda Kotb named 'Today' co-anchor, replacing Matt Lauer \n\"This definitely marks a moment in YouTube history,\" he says. \"Because I'm pretty sure that this has never hopefully happened to anyone on YouTube ever.\"\n\"Now with that said, buckle up,\" Mr. Paul adds, cursing for effect.\nAs the video proceeds, Mr. Paul describes the reputation of the Aokigahara forest , which has become well-known in the past decade as a destination for people looking to kill themselves .\nIn 2016 alone, three North American films were set in the forest, which lies at the base of Mount Fuji, a sacred site in Japan.\nLocal folk tales have also fueled talk about the paranormal within the forest, a subject that Mr. Paul eagerly latches onto as he and his companions begin their trek with a guide.\nIn the next scene, they come across the body. The face is blurred; the rest is left visible. Mr. Paul and the others react in shock and Mr. Paul urges the guide to call the police.\n\"Yo, are you alive?\" he shouts toward the body.\nAs a camera pans over the body, which Mr. Paul later says is only about 100 yards away from the parking lot, he describes its condition, and speculates that the death was recent. He apologizes to his viewers and says that suicide, depression and mental illness are not a joke.\nAs the group leaves the area where the body was found, Mr. Paul, who has television experience and has trained with comedy troupes , begins to engage in the kinds of behavior most familiar to his viewers: exaggerated reaction shots and nervous laughter. The tone soon becomes more antic as Mr. Paul and the others appear to try to lighten the mood.\nToward the end of the video, Mr. Paul says that his smiling and laughing \"is not a portrayal of how I feel about the circumstances,\" describing it as his coping mechanism.\nThe video, which was posted on Sunday, quickly received pushback online, as people reacted to Mr. Paul's decision to show the body and his capering afterward. Some shared numbers for suicide hotlines and told stories about their own struggles with mental illness.\nTweet 2 \nMr. Paul's YouTube channel has more than 15 million subscribers, making him even more popular than his younger brother, Jake , who may be more well-known to those who do not regularly watch vlogs thanks to his own brushes with controversy.\nTheir audiences are largely made up of younger people. Toward the end of the Japan video, Mr. Paul runs into a young fan in the parking lot who is with an older chaperone.\n\"I have one piece of advice,\" he tells them, smiling and pointing to where the body is. \"Don't go over there.\"", "external_links": [], "published": "2018-01-02T18:38:00.000+02:00", "crawled": "2018-01-02T19:02:23.000+02:00", "highlightTitle": ""}