{"organizations": [], "uuid": "c2161c7e2aad8a8d7762bffcd5f54676250079d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223264778&w=1200&r=LYNXMPEE0I0BH", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-tennis-ausopen-cornet/tennis-australian-open-heat-policy-could-be-dangerous-cornet-idUSKBN1F80LV", "country": "US", "domain_rank": 408, "title": "Tennis: Australian Open heat policy could be 'dangerous' - Cornet", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-19T15:11:00.000+02:00", "replies_count": 0, "uuid": "c2161c7e2aad8a8d7762bffcd5f54676250079d7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tennis-ausopen-cornet/tennis-australian-open-heat-policy-could-be-dangerous-cornet-idUSKBN1F80LV", "ord_in_thread": 0, "title": "Tennis: Australian Open heat policy could be 'dangerous' - Cornet", "locations": [], "entities": {"persons": [{"name": "cornet", "sentiment": "none"}, {"name": "mertens", "sentiment": "none"}, {"name": "alize cornet", "sentiment": "none"}, {"name": "elise mertens", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "hisense arena", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - The Australian Open’s extreme heat policy could be endangering the safety of players according to France’s Alize Cornet after she suffered dizzy spells during her third round match against Elise Mertens on Friday.\nCornet slumped to the court after serving during the second set of her 7-5 6-4 defeat by Mertens at the Hisense Arena and needed a medical assessment as temperatures pushed past 40 degrees Celsius (104F) at Melbourne Park.\nThe tournament’s extreme heat policy, which involves closing the roofs of the stadiums and suspending outdoor matches, is invoked when the ambient temperature exceeds 40 and the wet bulb globe temperature index reading exceeds 32.5 degrees.\nOrganizers said the brutal conditions did not meet the thresholds, however.\n“Playing at this time was probably the worst time of the day,” former world number 11 Cornet told reporters.\n“I kind of felt that I could faint at any moment.”\n”I think it could be dangerous, but I think that the fact the doctor came on the court and took my blood pressure and she was looking if I was feeling good enough to keep playing the match ... They are very careful about that.\n”But still, you know, playing in this condition is of course very dangerous for the health of the player.\n”The limit of not playing the match is really high, it’s like it needs to be above 45 degrees and humidity.\n“I think this limit should be a little lower because playing in this condition is not nice for anyone,” she added.\n“The crowd was in the shade but for the player it’s incredibly tough.”\nA number of players have complained of being made to play in the conditions during the heatwave that descended on Melbourne this week.\nCornet’s compatriot Gael Monfils felt he was “dying” during his four-set loss to Novak Djokovic on Thursday and said it was tough to breathe.\nHe added that players should feel no hesitation to pull out of their matches in such conditions but Cornet, who was determined to battle on against Belgian Mertens, was skeptical that any would.\nShe said players’ determination to fight on regardless was part of the problem, given they might not know their limits and continue to push themselves into dangerous territory.\n“You push your body so hard, you almost feel like you’re on the edge, you know,” she said.\n”But I agree that sometimes it can be too much and the high level athletes are capable of pushing these limits very far, sometimes too far and that’s why I say it could be dangerous.\n”Because you don’t feel your limits and you’re always pushing them.\n“Especially me, I would need to crawl on the court to give up.”\nEditing by Greg Stutchbury\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T15:11:00.000+02:00", "crawled": "2018-01-20T17:37:15.048+02:00", "highlightTitle": ""}