{"organizations": [], "uuid": "f1849381870843479dfd77d9b72cccfd02d46a2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-probility-media-corp-welcomes-dr-michael-e-webber-to-the-board-of-advisors.html", "country": "US", "domain_rank": 767, "title": "ProBility Media Corp. Welcomes Dr. Michael E. Webber to the Board of Advisors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.028, "site_type": "news", "published": "2018-01-24T19:05:00.000+02:00", "replies_count": 0, "uuid": "f1849381870843479dfd77d9b72cccfd02d46a2d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-probility-media-corp-welcomes-dr-michael-e-webber-to-the-board-of-advisors.html", "ord_in_thread": 0, "title": "ProBility Media Corp. Welcomes Dr. Michael E. Webber to the Board of Advisors", "locations": [], "entities": {"persons": [{"name": "michael e. webber", "sentiment": "negative"}, {"name": "michael", "sentiment": "none"}, {"name": "evan levine", "sentiment": "none"}, {"name": "michael webber", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "texa", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}], "organizations": [{"name": "probility media corp.", "sentiment": "negative"}, {"name": "board of advisors", "sentiment": "negative"}, {"name": "probility media corp", "sentiment": "negative"}, {"name": "university of texas", "sentiment": "none"}, {"name": "probility media board of advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 24, 2018 (GLOBE NEWSWIRE) -- ProBility Media Corp. (OTCQB:PBYA) based in Houston, Texas, a technology company offering immersive technologies, digital learning and compliance solutions for the education and training markets, today announced that Dr. Michael E. Webber, Professor of Mechanical Engineering at the University of Texas at Austin, has joined the ProBility Media Board of Advisors.\n“We are extremely excited to have Michael, a venerated educator in the energy sector, join our advisory board,” stated Evan Levine, Chairman and Chief Executive Officer of ProBility Media Corp. “Michael is contributing his expertise to the development of new education and training products and the team has already initiated the process of converting some of Michael’s established coursework in to a virtual reality format.”\n“I am excited to be working with the team at ProBility,” stated Dr. Michael Webber. “I have been extremely impressed that they are an early mover in the recognition that implementing technology for training for the industrial and construction skills has not paced with offerings for other professions. ProBility’s advanced suite of virtual and augmented reality products are changing the way that education is delivered.”\nDr. Michael Webber is an internationally recognized thought leader, widely cited author, and dynamic speaker with a passion for making energy accessible for broad audiences. He is a professor of Mechanical Engineering, Deputy Director of the Energy Institute, and co- Director of the Clean Energy Incubator at UT Austin. Dr. Webber’s prior successes with the Energy at the Movies PBS TV special and the Energy101 Massive Open Online Class (MOOC) demonstrate his ability to reach a global audience. The Energy101 MOOC had more than 44,000 students enrolled from around the world and received positive coverage in Forbes and the New York Times. The hour-long Energy at the Movies special was nationally syndicated on PBS between March 2013 and March 2015. The special reached over 43 million households and was awarded a Bronze Telly in May 2014 for excellence in educational programming. His first book, Thirst for Power (Yale University Press), debuted in early 2016 and he is authoring an educational STEM app that was recently announced by the White House.\nAbout ProBility Media Corp.\nProBility Media Corp. is an education and training technology company based in Houston, Texas, with offices in Florida, New York, and Vermont. ProBility is executing a disruptive strategy of defragmenting the education and training market place by offering high quality training courses and materials and preparing the workforce for excellence. ProBility services customers from the individual to the small business to the enterprise level corporation.\nFor more information, visit http://www.ProBilityMedia.com .\nForward-Looking Statements\nThis Press Release may contain certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements reflect the Company's current beliefs and are based upon information currently available to it. Accordingly, such forward-looking statements involve known and unknown risks, uncertainties and other factors which could cause the Company's actual results, performance or achievements to differ materially from those expressed in or implied by such statements. The Company undertakes no obligation to update or advise in the event of any change, addition or alteration to the information included in this Press Release including such forward-looking statements.\nContacts:\nProBility Media Corp.\nEvan Levine\nChairman and Chief Executive Officer\nNoah Davis\nPresident and Chief Operating Officer\n713.652.3937\nInvestor Contact:\nPCG Advisory Group\nChuck Harbey\n646.863.7997\ncharbey@pcgadvisory.com\nSource:ProBility Media Corp.", "external_links": ["https://www.globenewswire.com/Tracker?data=3KcMkqeIiXSnxMTq8dOr8r4PteZiwhVgWp5iRFPcMJYffK9NLP3RqvMAnQGgYST_4U2YWmdY6npbWAPq8WId0zZpdXhkLzM2rLgU4auKIco=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/74aaf36d-e4d3-4772-adf7-5cb3785a51c9", "https://www.globenewswire.com/Tracker?data=FJgCdx0JuEFTIJRPO035EVbIFF6K_qi4wWQ_rTTrVTV2omkxyeH1eFzhGWPhigKvBtx90GNsF7RR5o01RZj0X2qU6PKHC9kv3BT6L9XRDZo="], "published": "2018-01-24T19:05:00.000+02:00", "crawled": "2018-01-24T19:32:23.006+02:00", "highlightTitle": ""}