{"organizations": [], "uuid": "7bcd683b3f94a6f0b1b5fb2d76d1f7a5f2ea5784", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-franklin-templeton-investments-announces-agreement-to-acquire-edinburgh-partners.html", "country": "US", "domain_rank": 767, "title": "Franklin Templeton Investments Announces Agreement to Acquire Edinburgh Partners", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.996, "site_type": "news", "published": "2018-01-17T16:30:00.000+02:00", "replies_count": 0, "uuid": "7bcd683b3f94a6f0b1b5fb2d76d1f7a5f2ea5784"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-franklin-templeton-investments-announces-agreement-to-acquire-edinburgh-partners.html", "ord_in_thread": 0, "title": "Franklin Templeton Investments Announces Agreement to Acquire Edinburgh Partners", "locations": [], "entities": {"persons": [{"name": "franklin templeton", "sentiment": "none"}, {"name": "nairn", "sentiment": "none"}, {"name": "sandy nairn", "sentiment": "none"}, {"name": "john templeton", "sentiment": "none"}, {"name": "jenny johnson", "sentiment": "none"}], "locations": [{"name": "edinburgh partners san mateo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "franklin templeton investments", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "franklin resources, inc.", "sentiment": "neutral"}, {"name": "edinburgh partners", "sentiment": "none"}, {"name": "edinburgh partners limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN MATEO, Calif., Jan. 17, 2018 (GLOBE NEWSWIRE) -- Franklin Resources, Inc. (NYSE:BEN), a global investment management organization operating as Franklin Templeton Investments, today announced that it has entered into an agreement to acquire Edinburgh Partners Limited. The transaction is subject to regulatory approvals and is expected to be completed in the first half of 2018. Terms of the transaction were not disclosed.\nJenny Johnson, president and chief operating officer of Franklin Resources, Inc. said, “We’re pleased to announce the acquisition of Edinburgh Partners, an established global value investment manager, and to welcome back Dr. Sandy Nairn to our organization. Dr. Nairn worked alongside the late legendary global investor, Sir John Templeton, and was employed by Franklin Templeton for more than a decade. He brings a tremendous amount of leadership experience and expertise in managing global and international equities, an area that continues to be of strong interest to our clients around the world. This is the latest example of the firm continuing to make strategic investments in relatively small, yet highly experienced asset management teams that complement Franklin Templeton’s global offerings.”\nNairn will become chairman of Templeton Global Equity Group and remain investment partner and CEO of Edinburgh Partners. He will report to Stephen Dover, Franklin Templeton’s head of Equities.\nBased in Edinburgh, with an office in London and two in the United States, Edinburgh Partners is an independent fund management company that invests globally with an emphasis on absolute returns over a long-term time horizon. Its team of 12 investment professionals are highly regarded within the international asset management industry, with a combined average tenure of 22 years managing four distinctive strategies. Edinburgh Partners manages approximately US $10 billion as of December 31, 2017 in global and emerging markets equities.\nTempleton Global Equity Group is a pioneer in global investing, with a storied investment philosophy that dates back to the 1940s. Templeton’s team of 39 experienced investment professionals, based in offices around the world, search for undervalued stocks across all sectors and regions globally. Templeton Global Equity Group manages over US $101 billion in assets as of December 31, 2017.\n“Dr. Nairn and his experienced team will be an excellent addition to our global equity capabilities,” said Dover. “As chairman of Templeton Global Equity Group, Dr. Nairn will bring many new insights to share, having run his own firm for the last 15 years, while also drawing upon his in-depth knowledge of the Templeton investment philosophy and process from his many prior years with the group. We look forward to having Dr. Nairn and his team join our strong lineup of investment groups.\"\nNairn said, “I am very excited to be coming back to Templeton, the company that gave me my great appreciation for global investing. My team and I are deeply familiar with the history and strong reputation of the broader Franklin Templeton organization, and we’re pleased to join such a well-regarded firm. I look forward to sharing my perspective and experience with the Franklin Templeton organization. The access to Franklin Templeton’s extensive global resources will allow me to focus my time on investment management, as we continually seek to bolster our investment process and enhance our clients’ experience.”\nNairn’s Biography\nSandy Nairn, Ph.D., is one of the founders of Edinburgh Partners. Prior to establishing Edinburgh Partners in 2003, he was chief investment officer of Scottish Widows Investment Partnership (November 2000 to March 2003).\nBetween 1990 and 2000, Nairn was part of the Templeton Global Equity Group where he was executive vice president and the director of research. While there, he managed a range of institutional accounts.\nBefore joining Templeton, Nairn spent four years at Murray Johnstone as a portfolio manager and research analyst. Prior to that, he spent a year as an economist at the Scottish Development Agency.\nNairn graduated from the University of Strathclyde in 1982, and in 1985 he earned a Ph.D. in economics from the University of Strathclyde/Scottish Business School. He is an associate of the UK Society of Investment Professionals in the UK and is a CFA charterholder.\nAbout Franklin Templeton Investments\nFranklin Resources, Inc. (NYSE:BEN) is a global investment management organization operating as Franklin Templeton Investments. Franklin Templeton Investments provides global and domestic investment management to retail, institutional and sovereign wealth clients in over 170 countries. Through specialized teams, the company has expertise across all asset classes—including equity, fixed income, alternative and custom solutions. The company’s more than 650 investment professionals are supported by its integrated, worldwide team of risk management professionals and global trading desk network. With offices in over 30 countries, the California-based company has more than 70 years of investment experience and $753 billion in assets under management as of December 31, 2017. For more information, please visit investors.franklinresources.com .\nForward-looking statements\nThe statements contained herein may include prospects, statements of future expectations and other forward-looking statements that are based on management's current views and assumptions and involve known and unknown risks and uncertainties. Actual results, performance or events may differ materially from those expressed or implied in such forward-looking statements. Any forward-looking statements herein are made only as of the date of this press release, and the company assumes no obligation to update any information or forward-looking statement contained herein, except as required to be disclosed by law.\nCopyright © 2018. Franklin Templeton Investments. All rights reserved .\nFROM: Franklin Resources, Inc.\nInvestor Relations: Brian Sevilla (650) 312-4091\nMedia Relations:\nDorine Johnson +44 (0) 207 073 8538 / dorine.johnson@franklintempleton.co.uk\nMatt Walsh (650) 312-2245 / matthew.walsh@franklintempleton.com\ninvestors.franklinresources.com\nSource:Franklin Resources, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=aOetW7oUevtpOHxenaFJsjocmqRbdqz5wjcsF9uYIGjLQQQ96UE117tSOJZlRjrMZjbZolPjr-oRVGNc-dMfMUQkzDXThw8KCAhhLEoVpkTJeNQeqmRCYygapQlVzCXuQs8Dd_j0j0G9gy5A39Ncww==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/50feedbf-dc58-4044-9ac8-242b68d2eff3", "https://www.globenewswire.com/Tracker?data=iaPSQsM4vracMypp23RgTn5g69FoR4FDH3cEo4gWUxBJZhDpiiwrTCKry7cGlTKKl0iAmScNkqcvSPqmJxTJsyTR3ORboKPF9LOB4DcR931wte1jZhH9ecOPOCbZnwfkAJXJAHkF6v-_Y1Q4n5F0_Q=="], "published": "2018-01-17T16:30:00.000+02:00", "crawled": "2018-01-17T16:35:18.009+02:00", "highlightTitle": ""}