{"organizations": [], "uuid": "5575a34a9cb5f314529990bed0510dbf1b160303", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-sempra-energy-announces-pricing-of-public-offerings-of-common-stock-and-mandatory-convertible-preferred-stock.html", "country": "US", "domain_rank": 767, "title": "Sempra Energy Announces Pricing of Public Offerings of Common Stock and Mandatory Convertible Preferred Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.16, "site_type": "news", "published": "2018-01-05T05:19:00.000+02:00", "replies_count": 0, "uuid": "5575a34a9cb5f314529990bed0510dbf1b160303"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-sempra-energy-announces-pricing-of-public-offerings-of-common-stock-and-mandatory-convertible-preferred-stock.html", "ord_in_thread": 0, "title": "Sempra Energy Announces Pricing of Public Offerings of Common Stock and Mandatory Convertible Preferred Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "sempra energy announces pricing of public offerings of common stock", "sentiment": "negative"}, {"name": "sempra energy", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "energy future holdings corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 4, Sempra Energy (NYSE: SRE) today announced that it has priced its concurrent offerings (the equity offerings) of 23,364,486 shares of its common stock in connection with the forward sale agreements described below at $107 per share and 15,000,000 shares of its 6-percent Mandatory Convertible Preferred Stock, Series A, at $100 per share, each in a separate registered public offering. The equity offerings are expected to close on or about Jan. 9, 2018, subject to customary closing conditions. In addition, the underwriters in the respective equity offerings have been granted the option to purchase directly from Sempra Energy up to an additional 3,504,672 shares of its common stock and up to an additional 2,250,000 shares of its Mandatory Convertible Preferred Stock.\nThese offerings are being made by means of separate prospectus supplements and are not contingent on each other or upon the consummation of Sempra Energy's pending acquisition (the merger) of Energy Future Holdings Corp. (EFH), including EFH's indirect, approximately 80-percent ownership of Oncor Electric Delivery Company LLC (Oncor).\nThe net proceeds from the Mandatory Convertible Preferred Stock offering will be approximately $1.47 billion, after deducting the underwriting discount, but before deducting estimated offering expenses payable by Sempra Energy. Sempra Energy expects to use the net proceeds from the Mandatory Convertible Preferred Stock offering and the related sale of shares of its common stock pursuant to the forward sale agreements referred to below, together with the net proceeds from planned future debt financings, which may include the issuance of its debt securities, commercial paper supported by its revolving credit facilities and borrowings under its revolving credit facilities, to finance the merger and related costs and expenses or, in the case of any proceeds received from settlements under the forward sale agreements that occur after the closing of the proposed merger, to repay indebtedness incurred to finance a portion of the cost of the merger and related costs and expenses. If for any reason the merger is not completed on or prior to Dec. 1, 2018, or the related merger agreement is terminated on or prior to that date, then Sempra Energy expects to use the net proceeds from the equity offerings for general corporate purposes, which may include, in Sempra Energy's sole discretion, the voluntary redemption of the Mandatory Convertible Preferred Stock, debt repayment, including repayment of commercial paper, capital expenditures, investments and possibly repurchases of its common stock at the discretion of its board of directors.\nMorgan Stanley, RBC Capital Markets and Barclays are acting as joint bookrunners of the equity offerings and representatives of the underwriters.\nIn connection with the common stock offering, Sempra Energy has entered into forward sale agreements with each of Morgan Stanley & Co. LLC, an affiliate of RBC Capital Markets, LLC and an affiliate of Barclays Capital Inc. (in such capacity, the forward purchasers) with respect to 23,364,486 shares of its common stock. In connection with the forward sale agreements, the forward purchasers or their affiliates (in such capacity, the forward sellers) are expected to borrow from third parties and sell to the underwriters of the common stock offering for resale by such underwriters in such offering, an aggregate of 23,364,486 shares of the common stock. If, however, the forward purchasers determine in good faith, after using commercially reasonable efforts, that the forward sellers are unable to borrow and deliver to the underwriters any such shares of common stock, or the forward sellers are unable to borrow and deliver to the underwriters any such shares at a stock loan rate not greater than a specified rate, Sempra Energy will issue and sell to the underwriters a number of shares of common stock equal to the number of shares that the forward sellers did not deliver.\nSempra Energy will not initially receive any proceeds from the sale of common stock sold by the forward sellers to the underwriters. Instead, subject to its right to elect cash settlement or net share settlement subject to certain conditions, Sempra Energy intends to deliver, upon physical settlement of such forward sale agreements on one or more dates specified by Sempra Energy occurring no later than Dec. 15, 2019, an aggregate of 23,364,486 shares of its common stock to the forward purchasers in exchange for cash proceeds per share equal to the applicable forward sale price per share, which will initially be equal to the public offering price per share in the common stock offering, less underwriting discounts and commissions, as subsequently adjusted as provided in the forward sale agreements.\nEach share of Mandatory Convertible Preferred Stock will be issued with a liquidation preference of $100 per share.\nUnless earlier converted or redeemed, each share of Mandatory Convertible Preferred Stock will automatically convert into a variable number of shares of Sempra Energy's common stock on the mandatory conversion date, which is expected to be Jan. 15, 2021. The number of shares of Sempra Energy's common stock issuable on mandatory conversion will be determined based on the average volume-weighted average price of Sempra Energy's common stock over the 20-trading day period commencing on and including the 21st scheduled trading day prior to Jan. 15, 2021.\nDividends on the shares of Mandatory Convertible Preferred Stock will be payable on a cumulative basis when, as and if declared by Sempra Energy's board of directors, at an annual rate of 6 percent on the liquidation preference of $100 per share. The dividends may be paid in cash or, subject to certain limitations, in shares of Sempra Energy common stock or, at Sempra Energy's election, any combination of cash and shares of common stock on Jan. 15, April 15, July 15 and Oct. 15 of each year, commencing on April 15, 2018, and to, and including, Jan. 15, 2021.\nThe offerings are being made pursuant to an effective shelf registration statement filed with the U.S. Securities and Exchange Commission (SEC). Each offering is being made only by means of a prospectus supplement relating to such offering and the accompanying base prospectus, copies of which may be obtained by contacting the representatives of the underwriters using the information provided below under \"Underwriter Contact Information.\" An electronic copy of each final prospectus supplement, together with the accompanying prospectus, will be available on the SEC's website, www.sec.gov .\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy the securities described herein, nor shall there be any sale of these securities in any state or other jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nThis press release contains statements that are not historical fact and constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements can be identified by words such as \"believes,\" \"ex", "external_links": ["http://www.sec.gov/", "http://www.sempra.com/", "http://www.prnewswire.com/news-releases/sempra-energy-announces-pricing-of-public-offerings-of-common-stock-and-mandatory-convertible-preferred-stock-300578031.html"], "published": "2018-01-05T05:19:00.000+02:00", "crawled": "2018-01-05T06:17:32.038+02:00", "highlightTitle": ""}