{"organizations": [], "uuid": "619f33f78242b94fc5a9c524502997cff0bca6a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/25/104550333-GettyImages-800563376.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/23/the-world-is-facing-many-new-and-serious-challenges-indias-modi-tells-davos.html", "country": "US", "domain_rank": 767, "title": "The world is facing many new and serious challenges, India's Modi tells Davos", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.029, "site_type": "news", "published": "2018-01-23T13:02:00.000+02:00", "replies_count": 0, "uuid": "619f33f78242b94fc5a9c524502997cff0bca6a7"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/23/the-world-is-facing-many-new-and-serious-challenges-indias-modi-tells-davos.html", "ord_in_thread": 0, "title": "The world is facing many new and serious challenges, India's Modi tells Davos", "locations": [], "entities": {"persons": [{"name": "modi", "sentiment": "negative"}, {"name": "davos davos", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "narendra modi", "sentiment": "none"}, {"name": "davos modi", "sentiment": "none"}, {"name": "patricia de melo moreira", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "lisbon", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "necessidades palace", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The world is facing many new and serious challenges from the rise of anti-globalization to technological changes and the environment, Indian Prime Minister Narendra Modi said Tuesday.\nGiving the opening plenary speech at the World Economic Forum (WEF) in Davos, Switzerland on Tuesday, Modi laid out his vision for India and the world in a speech that touched upon technology, climate change, terrorism and trade agreements.\nModi said that there was a \"worrying trend\" against globalization and towards isolationism, trends that U.S. President Donald Trump has been accused of promoting in his first year of office.\n\"Forces of protectionism are raising their heads against globalization, their intention is not only to avoid globalization themselves but they also want to reverse its natural flow,\" he said.\n\"The result of all this is that we get to witness new types of tariff and non-tariff barriers. Bilateral and multilateral trade agreements and negotiations have come to a kind of standstill. Most nations have seen a decrease in cross-border financial investment further, growth in the global supply chain has also stopped.\n\"The solution to this worrying situation against globalization is not isolation. Its solution is in understanding and accepting change and in formulating agile and flexible policies in line with the changing times.\"\nFabrice Coffrini | AFP | Getty Images Indian Prime Minister Narendra Modi delivers a speech on the opening day of the World Economic Forum (WEF) 2018 annual meeting, on January 23, 2018 in Davos, eastern Switzerland. Technological challenges\nIn a speech that promoted Indian values and philosophy, Modi said that changes in society, and particularly technological change, presented the world with both opportunities and risks.\n\"Technology-driven transformation is deeply influencing the way we live, the way we work, behave and talk to each other and influencing international politics and economics,\" Modi told an audience in Davos.\n\"This technology-driven world has influenced every aspect of our lives ... Technology has the ability to bend, break and link and a very good example of these three aspects is the use of social media,\" he said.\nModi said that data is a huge asset but that \"the flow of global data is creating the biggest opportunities and the greatest challenges.\"\nshow chapters Indian PM Modi: We need to build a shared future 9 Hours Ago | 05:54 The Forum's theme in 2018 is \"Creating a shared future in a fractured world\" and the organizers hope that the 3,000 or so participants will come to shared solutions and actions to try to resolve the world's most pressing problems and challenges, such as inequality, climate change and innovations in technology and labor markets.\nParticipants at Davos range from political and business leaders to public and private policymakers and the odd celebrity.\nResponding to WEF's theme this year, Modi said \"in the world is full of fault-lines and rifts we need to build a shared future with the changes taking place and the new forces arising, the balance between economic capabilities and political power is changing at great speed.\"\nModi was initially the headline guest at this week's meeting although he has been somewhat upstaged by the news that President Donald Trump would also attend the event and is due to speak on Friday.\nModi tweet\nYet the prime minister's appearance comes at a time when global attention is given to India. The country's economy is one of the world's strongest although last October the World Bank lowered its forecasts for India's gross domestic product (GDP) growth, predicting an expansion of 7 percent rather than a previously predicted 7.2 percent expansion.\nThe World Bank said the revision was due to disruptions caused by demonetization (aimed at rooting out black money) and the implementation of the goods and services tax (GST) although it said the economy would recover, predicting it would grow at 7.4 percent by 2019-20.\nModi said that the last time an Indian prime minister had been to Davos was in 1997 when India's GDP was little more than $400 billion, and now, it was almost six times that much. Modi said that India would have a $5 billion economy by 2025.\nStill, the country of 1.34 billion people has deep social problems including income and gender inequality and high levels of pollution.\nshow chapters Modi: India wants to produce 175 gigawatts of renewable energy by 2022 9 Hours Ago | 01:40", "external_links": [], "published": "2018-01-23T13:02:00.000+02:00", "crawled": "2018-01-23T13:02:16.016+02:00", "highlightTitle": ""}