{"organizations": [], "uuid": "f94f2950d446b0a52f2fc63121bc3b291c05fbce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-nuvo-pharmaceuticals-ireland-limited-acquires-u-s-product-rights-to-resultza-from-piedmont-pharmaceuticals-llc.html", "country": "US", "domain_rank": 767, "title": "Nuvo Pharmaceuticals (Ireland) Limited Acquires U.S. Product Rights to Resultz® from Piedmont Pharmaceuticals LLC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.068, "site_type": "news", "published": "2018-01-15T15:30:00.000+02:00", "replies_count": 0, "uuid": "f94f2950d446b0a52f2fc63121bc3b291c05fbce"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-nuvo-pharmaceuticals-ireland-limited-acquires-u-s-product-rights-to-resultza-from-piedmont-pharmaceuticals-llc.html", "ord_in_thread": 0, "title": "Nuvo Pharmaceuticals (Ireland) Limited Acquires U.S. Product Rights to Resultz® from Piedmont Pharmaceuticals LLC", "locations": [], "entities": {"persons": [{"name": "resultz", "sentiment": "negative"}, {"name": "resul", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "nuvo ireland", "sentiment": "none"}, {"name": "piedmont", "sentiment": "none"}, {"name": "mississauga", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "nuvo pharmaceuticals", "sentiment": "negative"}, {"name": "resultz", "sentiment": "negative"}, {"name": "piedmont pharmaceuticals llc resultz", "sentiment": "negative"}, {"name": "nri", "sentiment": "none"}, {"name": "nuvo", "sentiment": "none"}, {"name": "piedmont pharmaceuticals llc", "sentiment": "none"}, {"name": "nuvo pharmaceuticals inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Resultz was FDA cleared in May 2017\n- Company now owns Resultz product rights globally -\n- Opens access to ~US$255 million head lice market -\nMISSISSAUGA, ON, Jan. 15, 2018 /PRNewswire/ - Nuvo Pharmaceuticals Inc. ™ (Nuvo or the Company) (TSX: NRI; OTCQX: NRIFF), a commercial healthcare company with a portfolio of commercial products and pharmaceutical manufacturing capabilities, today announced that its wholly owned subsidiary, Nuvo Pharmaceuticals (Ireland) Limited (Nuvo Ireland) has acquired the U.S. rights to Resultz ® (50% isopropyl myristate, 50% cyclomethicone D5 topical solution lice and egg removal kit) from Piedmont Pharmaceuticals LLC (Piedmont). The acquisition includes all U.S. product and intellectual property rights and is a complementary follow-on to Nuvo's acquisition of the global, ex-U.S. Resultz product rights announced on January 2, 2018. Nuvo now owns all Resultz product and intellectual property rights throughout the world.\nResultz is a commercial-stage, best-in-class, clinically proven, safe, non-pesticide, over-the-counter (OTC) treatment for head lice. Resultz was cleared as a Class 1 medical device by the U.S. Food and Drug Administration (FDA) in May 2017 and has not yet been commercially launched in the U.S. The topical head lice market in the U.S. was valued at US$255 million in 2016, inclusive of both prescription and OTC products. Resultz, with its class-leading 5-minute application time, is well positioned to enter this attractive market. Nuvo anticipates commercializing Resultz in the U.S. through a licensing partner and has already initiated discussions with potential licensees. With this transaction, Nuvo gains global control of the Resultz franchise and adds an additional FDA cleared U.S. product to its growing commercial product portfolio. Alongside existing manufacturing partners, Nuvo will be able to produce Resultz for the U.S. market at its Varennes, Québec manufacturing facility.\n\"We are thrilled to complete full ownership of the global Resultz business through the acquisition of the U.S. rights for Resultz,\" said Jesse Ledger, Nuvo's President & CEO. \"We believe the product attributes that have made Resultz a market leader in Canada and Europe, where market capture rates have reached as high as 35%, namely the class-leading 5-minute application time, up to 100% efficacy and exceptional safety profile as a non-pesticide treatment, will make it a success in the United States as well. Additionally, the team at Nuvo has been working hard for more than a year, with discipline and clear criteria for strong acquisition and in-licensing opportunities, and we are pleased to have been able to deliver on several recent transactions as a result, including the two Resultz transactions and international Pennsaid 2% licensing transactions. We continue to review and pursue multiple opportunities with that same focus and discipline.\"\nPurchase Agreement Details\nUnder the terms of the agreement, US$1.5 million was paid to Piedmont on close using existing cash on hand. The transaction includes a single-digit royalty payable by Nuvo Ireland on net sales through 2034. Nuvo, through its Nuvo Ireland subsidiary, has also obtained a right of first refusal to license or acquire certain related assets from Piedmont targeting other human indications. Nuvo now has cash and short-term investments of approximately $8.3 million and no debt with an unused $6.0 million line of credit, which positions Nuvo to acquire additional products and businesses from existing resources.\nStifel, Nicolaus & Company, Incorporated acted as exclusive financial advisor to Piedmont Pharmaceuticals LLC in this transaction.\nAbout Resultz\nResultz is a pesticide-free pediculicide rinse which was originally developed by Piedmont that addresses the challenge of increasing pesticide resistance in lice and concerns about patient safety through exposure to pesticides. In as little as a 5-minute application (the shortest treatment application time for head lice products), Resultz acts to disrupt the wax covering of the head louse resulting in their dehydration and death. Resultz lice and egg removal kit facilitates removal of lice, nymphs and nits with efficacy of up to 100 % in as little as 5 minutes. If necessary, a second application approximately 7-10 days later will eliminate any remaining lice. The Resultz lice and egg removal kit and its unique physical mechanism of action allows Resultz to work even with pesticide resistant super lice. Resultz is indicated for treating both children and adults. It has an excellent safety profile and contains active ingredients commonly found in many cosmetic products. Resultz was first launched as a medical device in the United Kingdom and Ireland in 2005 and more than ten million patients have been treated globally to-date. Current global licensees include Reckitt Benckiser Group PLC, Aralez Pharmaceuticals Inc. and Lapidot Medical. Resultz is also pending registration in Japan, where the local license is held by Sato Pharmaceutical Co. Ltd. Resultz is protected by a robust portfolio of 40 issued patents globally, including two U.S. patents which provide protection through to 2022 and 2024, respectively.\nAbout Piedmont Pharmaceuticals LLC\nPiedmont Pharmaceuticals has been committed to seeking regulatory approval and commercializing the Resultz Brand globally. It is closely affiliated with Piedmont Animal Health which at one time was a wholly owned subsidiary. Piedmont Animal Health LLC is a Greensboro, N.C.-based companion animal pharmaceutical development and marketing company focused on inventing and developing innovative technologies to address veterinary healthcare needs. Piedmont's founders have developed, launched, and/or marketed over 20 FDA Rx companion animal products for dogs, cats, and horses, including four innovative products developed and launched in the U.S. by Piedmont Animal Health in the last four years. The company is currently developing a broad range of convenient and long-acting medications, including ones focusing on the therapeutic areas of pain management and anti-infectives.\nAbout Nuvo Pharmaceuticals Inc.\nNuvo (TSX: NRI; OTCQX: NRIFF) is a global commercial healthcare company with a portfolio of commercial products and pharmaceutical manufacturing capabilities. Nuvo has four commercial products that are available in a number of countries; Pennsaid ® 2%, Pennsaid, Resultz and the heated lidocaine/tetracaine patch. Pennsaid 2% is sold in the U.S. by Horizon Pharma plc (NASDAQ: HZNP) and is available for partnering in certain other territories around the world. Nuvo manufactures Pennsaid for the global market and Pennsaid 2% for the U.S. market at its FDA, Health Canada and E.U. approved manufacturing facility in Varennes, Québec. For additional information, please visit www.nuvopharmaceuticals.com .\nForward-Looking Statements\nThis Press Release contains \"forward-looking statements\" within the meaning of applicable securities laws. Forward-looking statements can be identified by words such as: \"anticipate,\" \"intend,\" \"plan,\" \"goal,\" \"seek,\" \"believe,\" \"project,\" \"estimate,\" \"expect,\" \"strategy,\" \"future,\" \"likely,\" \"may,\" \"should,\" \"will\" and similar references to future periods.\nForward-looking statements are neither historical facts nor assurances of future performance. Instead, th", "external_links": ["http://www.nuvopharmaceuticals.com/"], "published": "2018-01-15T15:30:00.000+02:00", "crawled": "2018-01-15T16:28:56.011+02:00", "highlightTitle": ""}