{"organizations": [], "uuid": "f5ed1307b2c1193fc7f086cf82a22af05a57128d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-southern-missouri-bancorp-reports-preliminary-results-for-second-quarter-of-fiscal-2018-dividend-of-0-point-11-per-common.html", "country": "US", "domain_rank": 767, "title": "Southern Missouri Bancorp Reports Preliminary Results for Second Quarter of Fiscal 2018; Dividend of $0.11 Per Common Share Declared; Conference Call to Discuss Results Scheduled for Tuesday, January 23 at 3:30 P.m. Central Time", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.412, "site_type": "news", "published": "2018-01-23T01:45:00.000+02:00", "replies_count": 0, "uuid": "f5ed1307b2c1193fc7f086cf82a22af05a57128d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-southern-missouri-bancorp-reports-preliminary-results-for-second-quarter-of-fiscal-2018-dividend-of-0-point-11-per-common.html", "ord_in_thread": 0, "title": "Southern Missouri Bancorp Reports Preliminary Results for Second Quarter of Fiscal 2018; Dividend of $0.11 Per Common Share Declared; Conference Call to Discuss Results Scheduled for Tuesday, January 23 at 3:30 P.m. Central Time", "locations": [], "entities": {"persons": [], "locations": [{"name": "missouri", "sentiment": "none"}], "organizations": [{"name": "southern missouri bancorp reports preliminary results", "sentiment": "neutral"}, {"name": "central time poplar bluff", "sentiment": "neutral"}, {"name": "southern missouri bancorp, inc.", "sentiment": "neutral"}, {"name": "southern bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Poplar Bluff, Missouri, Jan. 22, 2018 (GLOBE NEWSWIRE) --\nSouthern Missouri Bancorp, Inc. (“Company”) (NASDAQ: SMBC), the parent corporation of Southern Bank (“Bank”), today announced preliminary net income available to common stockholders for the second quarter of fiscal 2018 of $5.2 million, an increase of $1.0 million, or 23.8%, as compared to the same period of the prior fiscal year. The increase was attributable to increases in net interest income and noninterest income, as well as a reduction in provision for loan losses, partially offset by an increase in noninterest expense and provision for income taxes. Preliminary net income available to common stockholders was $.60 per fully diluted common share for the second quarter of fiscal 2018, an increase of $.04 as compared to the $.56 per fully diluted common share reported for the same period of the prior fiscal year. The December enactment of the Tax Cuts and Jobs Act (“Tax Act”) negatively impacted after-tax earnings by a net $284,000.\nHighlights for the second quarter of fiscal 2018:\nAnnualized return on average assets was 1.17%, while annualized return on average common equity was 11.6%, as compared to 1.13% and 12.9%, respectively, in the same quarter a year ago, and 1.12% and 11.1%, respectively, in the first quarter of fiscal 2018, the linked quarter.\nEarnings per common share (diluted) were $.60, up $.04, or 7.1%, as compared both to the same quarter a year ago and the first quarter of fiscal 2018, the linked quarter.\nNet loan growth for the second quarter of fiscal 2018 slowed to $3.4 million, while net loans are up $55.2 million, or 4.0%, for the fiscal year to date. Deposit growth was $37.3 million for the second quarter, and $53.4 million, or 3.7%, for the fiscal year to date. Loan growth in the second quarter of the fiscal year is typically slower for the Company, as our agricultural loan portfolio has passed its seasonal peak.\nNet interest margin for the second quarter of fiscal 2018 was 3.87%, up from the 3.71% reported for the year ago period, and from 3.79% for the first quarter of fiscal 2018, the linked quarter. Activity in the current period included elevated discount accretion discussed in detail below.\nNoninterest income, excluding securities gains, was up 16.1% for the second quarter of fiscal 2018, compared to the year ago period, and down 4.1% from the first quarter of fiscal 2018, the linked quarter.\nNoninterest expense was up 20.8% for the second quarter of fiscal 2018, compared to the year ago period, and down 2.2% from the first quarter of fiscal 2018, the linked quarter.\nNonperforming assets were $11.0 million, or 0.62% of total assets, at December 31, 2017, as compared to $6.3 million, or 0.37% of total assets, at June 30, 2017. The increase was attributable primarily to a single classified commercial relationship discussed in detail below.\nDividend Declared:\nThe Board of Directors, on January 16, 2018, declared a quarterly cash dividend on common stock of $0.11, payable February 28, 2018, to stockholders of record at the close of business on February 15, 2018, marking the 95 th consecutive quarterly dividend since the inception of the Company. The Board of Directors and management believe the payment of a quarterly cash dividend enhances stockholder value and demonstrates our commitment to and confidence in our future prospects.\nConference Call:\nThe Company will host a conference call to review the information provided in this press release on Tuesday, January 23, 2018, at 3:30 p.m. central time (4:30 p.m. eastern). The call will be available live to interested parties by calling 1-888-339-0709 in the United States (Canada: 1-855-669-9657, international: 1-412-902-4189). Participants should ask to be joined into the Southern Missouri Bancorp (SMBC) call. Telephone playback will be available beginning one hour following the conclusion of the call through February 5, 2018. The playback may be accessed by dialing 1-877-344-7529 (Canada: 1-855-669-9658, international: 1-412-317-0088), and using the conference passcode 10116392.\nBalance Sheet Summary:\nThe Company experienced balance sheet growth in the first six months of fiscal 2018, with total assets of $1.8 billion at December 31, 2017, reflecting an increase of $69.0 million, or 4.0%, as compared to June 30, 2017. Asset growth was comprised mainly of loan growth.\nAvailable-for-sale (“AFS”) securities were $148.4 million at December 31, 2017, an increase of $3.9 million, or 2.7%, as compared to June 30, 2017. Cash equivalents and time deposits were $35.7 million, an increase of $4.2 million, or 13.3%, as compared to June 30, 2017.\nLoans, net of the allowance for loan losses, were $1.5 billion at December 31, 2017, an increase of $55.2 million, or 4.0%, as compared to June 30, 2017. The increase was attributable primarily to growth in ­­­commercial real estate loans, along with smaller increases in residential real estate loans and consumer loans, partially offset by declines in drawn construction loan balances and commercial operating loans. The increase in commercial real estate lending was attributable mostly to loans secured by nonresidential properties. The increase in residential lending was attributable to loans secured by one- to four-family residential properties, partially offset by a decline in loans secured by multifamily properties. The decrease in commercial operating loans was attributable primarily to a seasonal decline in agricultural loan balances, partially offset by an increase in commercial and industrial loan balances. Loans anticipated to fund in the next 90 days stood at $97.3 million at December 31, 2017, as compared to $85.4 million at September 30, 2017, and $40.9 million at December 31, 2016.\nNonperforming loans were $7.3 million, or 0.50% of gross loans, at December 31, 2017, as compared to $3.2 million, or 0.23% of gross loans, at June 30, 2017. Nonperforming assets were $11.0 million, or 0.62% of total assets, at December 31, 2017, as compared to $6.3 million, or 0.37% of total assets, at June 30, 2017. The increase in nonperforming loans and assets was comprised mainly of an increase in loans 90 or more days past due and still accruing interest, which was attributable primarily to a $4.7 million commercial relationship which has been classified for more than five years and with whom the Company was in negotiations for renewal and modification during the quarter ended December 31, 2017. Included in the relationship is a $3.5 million loan secured by commercial real estate and equipment which carries a 90% guaranty from the USDA. The remaining balance is structured as lines of credit which are secured by additional commercial real estate, receivables, and a personal residence. The lines of credit matured as of September 30, 2017, though the borrower has continued to make interest payments since that date. As of the date of this release, the Company continues to work to negotiate a renewal of the entire relationship on terms acceptable to both parties, but there can be no assurance that such an agreement will be reached. Our allowance for loan losses at December 31, 2017, totaled $16.9 million, representing 1.15% of gross loans and 231% of nonperforming loans, as compared to $15.5 million, or 1.10% of gross loans, and 482% of nonperforming loans, at June 30, 2017. For all impaired loans, the Company has measured impairment under ASC 310-10-35. Management believes the allowance for loan losses at December 31, 2017, is adequate, based on that measurement.\nTotal liabilities were $1.6 billion at December 31, 2017, an increase of $61.6 million, or 4.0%, as compared to June 30, 2017.\nDeposits were $1.5 billion at December 31, 2017, an increase of $53.4 million, or 3.7%, as compared to June 30, 2017. Deposit growth was comprised primarily of interest-bearing transaction accounts, along with smaller increases in money market deposit accounts and noninterest-bearing transaction accounts, partially offset by declines in certificates of deposit. Since June 30, 2017, the Company’s public unit deposits increased by $44.3 million, brokered certificates of deposit decreased $37.5 million, and brokered nonmaturity deposits increased $3.3 million. Our discussion of brokered deposits excludes those brokered deposits originated through reciprocal arrangements, as our reciprocal brokered deposits are primarily originated by our public unit depositors and utilized as an alternative to pledging securities against those deposits. The average loan-to-deposit ratio for the second quarter of fiscal 2018 was 98.4%, as compared to 103.0% for the same period of the prior fiscal year.\nFHLB advances were $59.9 million at December 31, 2017, an increase of $16.3 million, or 37.3%, as compared to June 30, 2017, as the Company utilized overnight and short-term funding to fund loan growth in excess of deposit growth and to allow brokered deposits to decrease. Securities sold under agreements to repurchase totaled $3.7 million at December 31, 2017, a decrease of $6.5 million, or 63.8%, as compared to June 30, 2017, as we continued to encourage larger customers to migrate from this product to a reciprocal brokered deposit arrangement. At both dates, the full balance of repurchase agreements was due to local small business and government counterparties.\nThe Company’s stockholders’ equity was $180.5 million at December 31, 2017, an increase of $7.4 million, or 4.3%, as compared to June 30, 2017. The increase was attributable to retention of net income, partially offset by payment of dividends on common stock and a decrease in accumulated other comprehensive income.\nIncome Statement Summary:\nThe Company’s net interest income for the three-month period ended December 31, 2017, was $15.7 million, an increase of $3.1 million, or 24.9%, as compared to the same period of the prior fiscal year. The increase was attributable to a 19.6% increase in the average balance of interest-earning assets, combined with an increase in net interest margin to 3.87% in the current three-month period, from 3.71% three-month period a year ago.\nLoan discount accretion and deposit premium amortization related to the Company’s August 2014 acquisition of Peoples Service Company and its subsidiary, Peoples Bank of the Ozarks (the “Peoples Acquisition”), increased to $558,000 for the three-month period ended December 31, 2017, as compared to $267,000 for the same period of the prior fiscal year. Loan discount accretion and deposit premium amortization related to the Company’s June 2017 acquisition of Tammcorp, Inc., and its subsidiary, Capaha Bank (the “Capaha Acquisition”) resulted in an additional $302,000 in net interest income for the three-month period ended December 31, 2017, with no comparable item in the same period a year ago. Combined, these components of net interest income contributed 21 basis points to net interest margin in the three-month period ended December 31, 2017, as compared to a contribution of eight basis points for the same period of the prior fiscal year. For the linked quarter, ended September 30, 2017, when net interest margin was 3.79%, comparable items contributed twelve basis points to the net interest margin. The dollar impact of this component of net interest income has generally been declining each sequential quarter as assets from the Peoples Acquisition mature or prepay, however, the Capaha Acquisition will contribute additional net interest income during fiscal 2018, with no comparable items from fiscal 2017 periods. Also, additional interest income was recognized in the current quarter due to the resolution of specific purchased credit impaired loans from both the Peoples Acquisition and the Capaha Acquisition.\nThe provision for loan losses for the three-month period ended December 31, 2017, was $642,000, as compared to $656,000 in the same period of the prior fiscal year. As a percentage of average loans outstanding, the provision for loan losses in the current three-month period represented a charge of 0.18% (annualized), while the Company recorded net charge offs during the period of 0.04% (annualized). During the same period of the prior fiscal year, provision for loan losses as a percentage of average loans outstanding represented a charge of 0.22% (annualized), while the Company recorded net charge offs of 0.04% (annualized).\nThe Company’s noninterest income, including securities gains, for the three-month period ended December 31, 2017, was $3.2 million, an increase of $474,000, or 17.6%, as compared to the same period of the prior fiscal year. The increase was attributable primarily to deposit account service charges, bank card interchange income, loan servicing income, and gains on sales of securities, partially offset by declines in loan fees and gains on sales of residential real estate loans originated for that purpose.\nNoninterest expense for the three-month period ended December 31, 2017, was $10.5 million, an increase of $1.8 million, or 20.8%, as compared to the same period of the prior fiscal year. The increase was attributable primarily to increases in compensation and benefits and occupancy expenses, as a result of the Company’s larger staff and number of facilities following the Capaha Acquisition. Expenses related to merger and acquisition activity in the current quarter totaled $84,000, compared to $100,000 in comparable charges in the same quarter a year ago. The efficiency ratio for the three-month period ended December 31, 2017, was 55.8%, as compared to 57.0% in the same period of the prior fiscal year.\nThe income tax provision for the three-month period ended December 31, 2017, was $2.5 million, an increase of $811,000, or 46.7%, as compared to the same period of the prior fiscal year, attributable primarily to higher pre-tax income, combined with an increase in the effective tax rate, to 33.0%, from 29.4%. The higher effective tax rate was attributed primarily to the December enactment of Tax Act, which negatively impacted after-tax earnings by a net $284,000, the result of a required revaluation of the Company’s deferred tax asset (“DTA”), partially offset by a reduction in the Company’s annual effective tax rate (“AETR”) applied to pre-tax income for the first six months of fiscal 2018. Specifically, the revaluation of the DTA increased provision for income taxes by approximately $1.1 million, while the lower AETR resulted in an $840,000 reduction in the provision for income taxes. After applying the reduction in the AETR to the first half of fiscal 2018, the revaluation of the DTA increased the effective tax rate by approximately 5.9 percentage points, to 30.7% for the fiscal year to date. If the Company maintains a consistent level of tax-advantaged activity and investment relative to its pre-tax income, it would expect an effective tax rate for the second half of fiscal 2018 of 24 to 26 percent, and for the full year fiscal 2018 of 27 to 29 percent, which includes the impact of the DTA revaluation. For fiscal 2019, assuming a consistent level of tax-advantaged activity and investment relative to the Company’s pre-tax income, it would expect an effective tax rate of 18 to 20 percent.\nForward-Looking Information:\nExcept for the historical information contained herein, the matters discussed in this press release may be deemed to be forward-looking statements that are subject to known and unknown risks, uncertainties, and other factors that could cause the actual results to differ materially from the forward-looking statements, including: the strength of the United States economy in general and the strength of the local economies in which we conduct operations; fluctuations in interest rates and in real estate values; monetary and fiscal policies of the Board of Governors of the Federal Reserve System and the U.S. Government and other governmental initiatives affecting the financial services industry; the risks of lending and investing activities, including changes in the level and direction of loan delinquencies and write-offs and changes in estimates of the adequacy of the allowance for loan losses; our ability to access cost-effective funding; the timely development of and acceptance of our new products and services and the perceived overall value of these products and services by users, including the features, pricing and quality compared to competitors' products and services; expected cost savings, synergies and other benefits from the Company’s merger and acquisition activities might not be realized to the extent anticipated or within the anticipated time frames, if at all, and costs or difficulties relating to integration matters, including but not limited to customer and employee retention, might be greater than expected; fluctuations in real estate values and both residential and commercial real estate market conditions; demand for loans and deposits in our market area; legislative or regulatory changes that adversely affect our business; results of examinations of us by our regulators, including the possibility that our regulators may, among other things, require us to increase our reserve for loan losses or to write-down assets; the impact of technological changes; and our success at managing the risks involved in the foregoing. Any forward-looking statements are based upon management’s beliefs and assumptions at the time they are made. We undertake no obligation to publicly update or revise any forward-looking statements or to update the reasons why actual results could differ from those contained in such statements, whether as a result of new information, future events or otherwise. In light of these risks, uncertainties and assumptions, the forward-looking statements discussed might not occur, and you should not put undue reliance on any forward-looking statements.\nSouthern Missouri Bancorp, Inc. UNAUDITED CONDENSED CONSOLIDATED FINANCIAL INFORMATION Summary Balance Sheet Data as of: December 31, September 30, June 30, March 31, December 31, (dollars in thousands, except per share data) 2017 2017 2017 2017 2016 Cash equivalents and time deposits $ 35,734 $ 25,849 $ 31,533 $ 21,508 $ 30,865 Available for sale securities 148,353 147,680 144,416 134,048 132,116 FHLB/FRB membership stock 7,504 8,384 6,119 6,220 8,256 Loans receivable, gross 1,469,842 1,465,917 1,413,268 1,241,120 1,224,828 Allowance for loan losses 16,867 16,357 15,538 15,190 14,992 Loans receivable, net 1,452,975 1,449,560 1,397,730 1,225,930 1,209,836 Bank-owned life insurance 34,795 34,562 34,329 30,147 30,491 Intangible assets 14,752 15,071 15,390 7,287 7,478 Premises and equipment 53,479 54,129 54,167 46,624 46,371 Other assets 29,105 28,256 24,028 24,220 26,936 Total assets ﻿$ 1,776,697 ﻿$ 1,763,491 $ 1,707,712 $ 1,495,984 $ 1,492,349 Interest-bearing deposits $ 1,316,703 $ 1,276,943 $ 1,268,662 $ 1,133,405 $ 1,075,792 Noninterest-bearing deposits 192,266 194,747 186,935 139,095 136,024 Securities sold under agreements to repurchase 3,697 6,627 10,212 17,900 22,542 FHLB advances 59,914 84,654 43,637 51,619 107,502 Note payable 3,000 3,000 3,000 - - Other liabilities 5,721 5,613 7,335 5,156 5,336 Subordinated debt 14,896 14,872 14,848 14,824 14,800 Total liabilities 1,596,197 1,586,456 1,534,629 1,361,999 1,361,996 Common stockholders' equity 180,500 177,035 173,083 133,985 130,353 Total stockholders' equity 180,500 177,035 173,083 133,985 130,353 Total liabilities and stockholders' equity $ 1,776,697 $ 1,763,491 $ 1,707,712 $ 1,495,984 $ 1,492,349 Equity to assets ratio 10.16 % 10.04 % 10.14 % 8.96 % 8.73 % Common shares outstanding 8,588,338 8,591,363 8,591,363 7,450,041 7,450,041 Less: Restricted common shares not vested 10,600 17,975 18,775 33,175 33,175 Common shares for book value determination 8,577,738 8,573,388 8,572,588 7,416,866 7,416,866 Book value per common share $ 21.04 $ 20.65 $ 20.19 $ 18.06 $ 17.58 Closing market price 37.59 36.49 32.26 35.52 35.38 Nonperforming asset data as of: December 31, September 30, June 30, March 31, December 31, (dollars in thousands) 2017 2017 2017 2017 2016 Nonaccrual loans $ 1,635 $ 2,307 $ 2,825 $ 3,069 $ 5,572 Accruing loans 90 days or more past due 5,681 303 401 134 85 Total nonperforming loans 7,316 2,610 3,226 3,203 5,657 Other real estate owned (OREO) 3,653 3,357 3,014 3,296 3,310 Personal property repossessed 71 67 86 37 39 Total nonperforming assets $ 11,040 $ 6,034 $ 6,326 $ 6,536 $ 9,006 Total nonperforming assets to total assets 0.62 % 0.34 % 0.37 % 0.44 % 0.60 % Total nonperforming loans to gross loans 0.50 % 0.18 % 0.23 % 0.26 % 0.47 % Allowance for loan losses to nonperforming loans 230.55 % 626.70 % 481.65 % 474.24 % 265.02 % Allowance for loan losses to gross loans 1.15 % 1.12 % 1.10 % 1.22 % 1.22 % Performing troubled debt restructurings (1) $ 8,472 $ 10,740 $ 10,908 $ 8,649 $ 7,673 (1) Nonperforming troubled debt restructurings are included with nonaccrual loans or accruing loans 90 days or more past due.\nFor the three-month period ended Quarterly Average Balance Sheet Data: December 31, September 30, June 30, March 31, December 31, (dollars in thousands) 2017 2017 2017 2017 2016 Interest-bearing cash equivalents $ 3,027 $ 2,268 $ 2,482 $ 1,896 $ 1,599 Available for sale securities and membership stock 157,101 153,872 143,114 141,223 139,183 Loans receivable, gross 1,463,054 1,436,156 1,271,705 1,221,642 1,216,607 Total interest-earning assets 1,623,182 1,592,296 1,417,301 1,364,761 1,357,389 Other assets 141,666 140,660 117,235 119,437 123,287 Total assets $ 1,764,848 $ 1,732,956 $ 1,534,536 $ 1,484,198 $ 1,480,676 Interest-bearing deposits $ 1,293,165 $ 1,280,842 $ 1,155,547 $ 1,099,319 $ 1,043,542 Securities sold under agreements to repurchase 4,585 9,492 13,694 24,053 24,323 FHLB advances 70,797 55,063 55,914 71,405 124,834 Note payable 3,000 3,000 1,451 - - Subordinated debt 14,884 14,860 14,836 14,812 14,789 Total interest-bearing liabilities 1,386,431 1,363,257 1,241,442 1,209,589 1,207,488 Noninterest-bearing deposits 193,028 187,330 145,790 138,667 137,468 Other noninterest-bearing liabilities 6,657 7,367 5,191 3,480 5,873 Total liabilities 1,586,116 1,557,954 1,392,423 1,351,736 1,350,829 Common stockholders' equity 178,732 175,002 142,113 132,462 129,847 Total stockholders' equity 178,732 175,002 142,113 132,462 129,847 Total liabilities and stockholders' equity $ 1,764,848 $ 1,732,956 $ 1,534,536 $ 1,484,198 $ 1,480,676 For the three-month period ended Quarterly Summary Income Statement Data: December 31, September 30, June 30, March 31, December 31, (dollars in thousands, except per share data) 2017 2017 2017 2017 2016 Interest income: Cash equivalents $ 11 $ 10 $ 8 $ 13 $ 4 Available for sale securities and membership stock 984 946 895 875 850 Loans receivable 18,236 17,455 15,442 14,067 14,229 Total interest income 19,231 18,411 16,345 14,955 15,083 Interest expense: Deposits 3,025 2,862 2,386 2,111 2,043 Securities sold under agreements to repurchase 8 14 18 25 25 FHLB advances 284 226 214 224 282 Note payable 29 28 13 - - Subordinated debt 182 178 173 163 160 Total interest expense 3,528 3,308 2,804 2,523 2,510 Net interest income 15,703 15,103 13,541 12,432 12,573 Provision for loan losses 642 868 383 376 656 Securities gains 37 - - - - Other noninterest income 3,137 3,271 2,884 2,925 2,700 Noninterest expense 10,519 10,755 10,823 9,564 8,706 Income taxes 2,546 1,889 1,506 1,463 1,735 Net income available to common stockholders $ 5,170 $ 4,862 $ 3,713 $ 3,954 $ 4,176 Basic earnings per common share $ 0.60 $ 0.57 $ 0.49 $ 0.53 $ 0.56 Diluted earnings per common share 0.60 0.56 0.49 0.53 0.56 Dividends per common share 0.11 0.11 0.10 0.10 0.10 Average common shares outstanding: Basic 8,589,000 8,591,000 7,606,000 7,450,000 7,441,000 Diluted 8,619,000 8,620,000 7,635,000 7,479,000 7,467,000 Return on average assets 1.17 % 1.12 % 0.97 % 1.07 % 1.13 % Return on average common stockholders' equity 11.6 % 11.1 % 10.5 % 11.9 % 12.9 % Net interest margin 3.87 % 3.79 % 3.82 % 3.64 % 3.71 % Net interest spread 3.72 % 3.66 % 3.71 % 3.55 % 3.61 % Efficiency ratio 55.8 % 58.5 % 65.9 % 62.3 % 57.0 %\nMatt Funke, CFO 573-778-1800\nSource:Southern Missouri Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/1ba76204-abb9-4976-bd33-cd4e869569d4"], "published": "2018-01-23T01:45:00.000+02:00", "crawled": "2018-01-23T04:04:34.015+02:00", "highlightTitle": ""}