{"organizations": [], "uuid": "a9862ff75cae57263f970e1061d2e6af222156bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/07/104637133-GettyImages-598728662.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19832390/device/rss/rss.html", "section_title": "Asia-Pacific News", "url": "https://www.cnbc.com/2018/01/24/jobs-and-hiring-advice-for-start-ups-that-want-to-be-global.html", "country": "US", "domain_rank": 767, "title": "Jobs and hiring: advice for start-ups that want to be global", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T07:35:00.000+02:00", "replies_count": 0, "uuid": "a9862ff75cae57263f970e1061d2e6af222156bb"}, "author": "Karen Gilchrist", "url": "https://www.cnbc.com/2018/01/24/jobs-and-hiring-advice-for-start-ups-that-want-to-be-global.html", "ord_in_thread": 0, "title": "Jobs and hiring: advice for start-ups that want to be global", "locations": [], "entities": {"persons": [{"name": "moray maclennan", "sentiment": "none"}, {"name": "maclennan", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "m&c saatchi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Breaking into a new country is tough for any company — and it's even harder for start-ups.\nIt can be done, and done well, however, if you follow one simple rule, according to the worldwide CEO of M&C Saatchi. He should know, he's gone from working out of an apartment to building one of the world's biggest advertising agencies with 27 offices in 23 countries.\n\"Hire local,\" Moray MacLennan tells CNBC Make It .\nIt may sound obvious, MacLennan acknowledges, but so many companies get it wrong because of either \"laziness or arrogance.\"\n\"If you have a big chunk of revenue, then maybe you can put someone in (to a new market). But if you're a start-up, it increases the odds of success massively if you can find someone on the ground who knows the region and who knows its people,\" MacLennan explains.\n\"We are in the ideas business — any agency is — and those ideas rely on an understanding of the audience.\" -Moray MacLennan, CEO, M&C Saatchi The advice fits with M&C Saatchi's founding philosophy: to grow through partnerships with local start-ups rather than chasing acquisitions. But almost two-and-a-half decades on from launch, it rings true now more than ever, he says.\n\"Thirty years ago or so the mantra was globalization, and you could argue that with social media everything is becoming more similar; but actually, local differences are being celebrated now more than ever.\"\nThis is especially important for businesses within the creative industry, he says. It has been seen time and again how poor knowledge of a specific market can result in failed ventures, public criticism , and, perhaps most notably, lost political campaigns.\nLearning from Brexit 'Remain' campaign MacLennan admits it was a failure to understand the electorate that led to the failure of M&C Saatchi's Remain campaign in the U.K.'s EU referendum.\n\"We are in the ideas business — any agency is — and those ideas rely on an understanding of the audience.\"\n\"It is possible to come up with a universal idea that appeals to people everywhere, but often it's the subtle nuances and culture references that are important, and for that you need to have the people with the local insights, who have grown up and lived in a place, who know the local humor.\"\nMacLennan used this insight in expanding M&C Saatchi into its latest market: Indonesia.\nWhile identifying Indonesia as M&C Saatchi's sixth Asia market was \"relatively easy,\" it was all about finding the right talent, he says.\n\"Indonesia is quite traditional and conservative with a small c. It's easy for Western companies to come to Indonesia and misjudge the cultural sensitivities here,\" he says. \"For us, it was all about finding someone who understands that.\"\nM&C Saatchi chose Indonesian advertiser Anish Daryani to lead its operations in Jakarta.", "external_links": [], "published": "2018-01-24T07:35:00.000+02:00", "crawled": "2018-01-25T08:32:15.018+02:00", "highlightTitle": ""}