{"organizations": [], "uuid": "bea86065d1bf885427fbf02ef2e5aa0a39cb547d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-broadridge-enhances-focus-on-global-growth-creates-broadridge-international-to-accelerate-next-wave-of-growth-in-emea-and-asia.html", "country": "US", "domain_rank": 767, "title": "Broadridge Enhances Focus on Global Growth, Creates Broadridge International to Accelerate Next Wave of Growth in EMEA and Asia Pacific", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.056, "site_type": "news", "published": "2018-01-16T11:00:00.000+02:00", "replies_count": 0, "uuid": "bea86065d1bf885427fbf02ef2e5aa0a39cb547d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-broadridge-enhances-focus-on-global-growth-creates-broadridge-international-to-accelerate-next-wave-of-growth-in-emea-and-asia.html", "ord_in_thread": 0, "title": "Broadridge Enhances Focus on Global Growth, Creates Broadridge International to Accelerate Next Wave of Growth in EMEA and Asia Pacific", "locations": [], "entities": {"persons": [{"name": "tim gokey", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "carey", "sentiment": "none"}, {"name": "broadridge", "sentiment": "none"}, {"name": "tom carey", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "asia pacific lake", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "broadridge international", "sentiment": "none"}, {"name": "broadridge", "sentiment": "none"}], "organizations": [{"name": "broadridge financial solutions, inc.", "sentiment": "neutral"}, {"name": "emea", "sentiment": "neutral"}, {"name": "executive committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAKE SUCCESS, N.Y., Jan. 16, 2018 /PRNewswire/ -- Broadridge Financial Solutions, Inc. (NYSE: BR) today announced the creation of Broadridge International, appointing Tom Carey to head Broadridge's International efforts, responsible for leading the company's rapidly expanding efforts and presence in the EMEA and Asia Pacific regions across all business lines. Carey has also been appointed to serve on Broadridge's Executive Committee.\n\"International expansion is a core strategy for Broadridge and this new strategic focus will enhance our long-term commitment to supporting our International and North American clients as we increase our capabilities to deliver more globally integrated solutions to address the challenges clients face today and tomorrow,\" said Tim Gokey, President and COO of Broadridge. \"Tom has a highly successful track record of building technology platforms and client relationships in the global markets and will be responsible for driving the growth of our governance, capital markets and asset management solutions. He will be focused on helping our clients transform to meet the growing regulatory, economic and convergence challenges and complexities of the global markets.\"\n\"With a proven ability to help firms transform and grow, Broadridge brings a truly differentiated value proposition,\" said Carey. \"I am excited to lead our international efforts outside of North America, redoubling our focus and commitment to helping our clients support their business needs through the global scale and local relevance of our solutions and services, to meet today's challenges and capitalize on what's coming next.\"\nPrior to his new appointment, Carey headed Broadridge's Technology and Operations Solutions business in EMEA and Asia Pacific. He was instrumental in driving growth through Broadridge's next generation global post-trade solution and creating transformational partnerships. He also led many of Broadridge's international solution acquisitions, broadening the company's portfolio of offerings to align with clients' increasing needs, through superior levels of efficiency and market access, mutualized and scalable services, and unique insights through data and analytics.\nIn Carey's expanded role, he will work closely with Broadridge's Governance and Communications product groups led by Patricia Rosch outside of North America. \"Working closely with Tom and his team will enable us to take our current and next generation of products directly to market in EMEA and APAC in the most effective manner to meet clients' growing needs,\" said Patricia Rosch, Head of Broadridge Investor Communication Solutions, International.\nGlobally, Broadridge provides capital market solutions for clients in over 70 markets, governance solutions in approximately 100 markets and a fast-growing global solution suite for investment managers and funds. Broadridge's expanding global footprint and growth in EMEA and APAC address increasing client demands as they look to solve global challenges, embrace mutualization, and consolidate relationships as they seek partners who are investing in global technology-driven solutions.\nAbout Broadridge\nBroadridge Financial Solutions, Inc. (NYSE:BR), the $4 billion global fintech leader, provides investor communications and technology-driven solutions for broker-dealers, banks, mutual funds and corporate issuers globally. Broadridge's investor communications, securities processing and managed services solutions help clients reduce their capital investments in operations infrastructure, allowing them to increase their focus on core business activities. With over 50 years of experience, Broadridge's infrastructure underpins proxy voting services for over 50 percent of public companies and mutual funds globally, and processes more than $5 trillion in fixed income and equity trades per day. Broadridge employs approximately 10,000 full-time associates in 16 countries. For more information about Broadridge, please visit www.broadridge.com .\nInvestors:\nW. Edings Thibault\nHead of Investor Relations\n+1 516-472-5129\nedings.thibault@broadridge.com\nMedia:\nTina Wadhwa\nCorporate Communications\n+1 212-973-6164\ntina.wadhwa@broadridge.com\nHannah James\nCognito, EMEA\n+44 (0) 20 74269428\nHannah.James@cognitomedia.com\nPeggy Wu\nTeneo Strategy, APAC\n+65 6876 5785\npeggy.wu@teneostrategy.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/broadridge-enhances-focus-on-global-growth-creates-broadridge-international-to-accelerate-next-wave-of-growth-in-emea-and-asia-pacific-300581118.html\nSOURCE Broadridge Financial Solutions, Inc.", "external_links": ["http://www.broadridge.com/", "http://www.prnewswire.com/news-releases/broadridge-enhances-focus-on-global-growth-creates-broadridge-international-to-accelerate-next-wave-of-growth-in-emea-and-asia-pacific-300581118.html", "https://www.broadridge.com/"], "published": "2018-01-16T11:00:00.000+02:00", "crawled": "2018-01-16T11:00:35.000+02:00", "highlightTitle": ""}