{"organizations": [], "uuid": "899cd73a9fc3c383963083aa957b9a8510f1d913", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/23/104547783-RTXLC51.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/theres-going-to-be-a-made-in-america-stock-boom-this-year-jefferies.html", "country": "US", "domain_rank": 767, "title": "There's going to be a 'Made in America' stock boom this year: Jefferies", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-11T21:16:00.000+02:00", "replies_count": 0, "uuid": "899cd73a9fc3c383963083aa957b9a8510f1d913"}, "author": "Thomas Franck", "url": "https://www.cnbc.com/2018/01/11/theres-going-to-be-a-made-in-america-stock-boom-this-year-jefferies.html", "ord_in_thread": 0, "title": "There's going to be a 'Made in America' stock boom this year: Jefferies", "locations": [], "entities": {"persons": [{"name": "oleg popov", "sentiment": "neutral"}, {"name": "sean darby", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "jefferies", "sentiment": "neutral"}, {"name": "nafta", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The stock market will enjoy a \"Made in America\" boom this year thanks to a slew of policies spearheaded by the Trump administration, according to a Wall Street investment bank.\nSome of the nation's largest industrial and steel companies will rally under President Trump's focus on domestic prosperity, spelling even more upside for investors, according to Jefferies.\nWith the U.S. thinking about leaving NAFTA, \"new tax incentives to repatriate profits in place and the dollar weak, the ingredients for a domestic investment boom are in place,\" analyst Sean Darby wrote on Thursday. \"While the corporate sector is obviously euphoric over the tax changes, it is not often highlighted that it has improved U.S.'s competitive position.\"\nPresident Trump and Republican lawmakers clinched major legislative victory by passing the Tax Cuts and Jobs Act in late 2017, reducing the corporate tax rate to 21 percent and offering new incentives for companies to repatriate profits. The GOP hopes that by amending the tax code the economy will surge further, and drive most investing dollars into the U.S.\nBut even as some of the country's industrial titans catch a tax break, the fate some of the country's most iconic trade agreements hang in the balance. President Trump is currently debating U.S. participation in NAFTA, the iconic 24-year-old trade arrangement with Canada and Mexico. Should the U.S. pull out of the arrangement, incentives to \"off-shore\" factories could diminish.\n\"The NAFTA trade agreement encouraged 'off-shoring' or the placement of U.S. manufacturing in its neighbors due to better labor laws, cheaper exchange rates and/or lower wages,\" added Darby. \"Coincidentally, next Tuesday, the U.S. Department of Commerce is expected to provide formal recommendations to the President regarding possible action to combat U.S. steel imports on national security grounds.\"\nSuch decisions by the Trump administration are likely already having an effect on the business world.\nThe Dow Jones industrial average added more than 150 points to claim another all-time high Thursday while both the S&P 500 and the Nasdaq hit records. The gains in the Dow have largely stemmed from industrial giants Boeing , Chevron and Caterpillar , seen as key beneficiaries from the tax changes.\n\nThe materials sector, including the nation's largest steel manufacturers, should also benefit from more protective policies, said Darby, even as factory activity climbs.\n\"The bottom line is that the backdrop for the U.S. materials sector is improving,\" wrote Darby. \"The cocktail of tax reform, NAFTA, steel tariffs, and booming investment intentions comes at a time when the ISM manufacturing index is surging.\"\nNames like United States Steel , Commercial Metals and Steel Dynamics are the \"best positioned\" to benefit from steel tariffs, Darby said, all of which have buy ratings at the investment bank. The companies were up 0.75 percent, 2.1 percent, and 1.7 percent respectively during Thursday trading.\nDisclaimer", "external_links": [], "published": "2018-01-11T21:16:00.000+02:00", "crawled": "2018-01-11T21:53:31.010+02:00", "highlightTitle": ""}