{"organizations": [], "uuid": "0738e7827c162c0d2fbe3d304c71bcb022634870", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/15/104169656-GettyImages-460496974.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/30/exxon-mobil-will-triple-production-in-the-permian-basin-by-2025.html", "country": "US", "domain_rank": 767, "title": "Exxon Mobil will triple production in the Permian basin by 2025", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T20:52:00.000+02:00", "replies_count": 0, "uuid": "0738e7827c162c0d2fbe3d304c71bcb022634870"}, "author": "Tom DiChristopher", "url": "https://www.cnbc.com/2018/01/30/exxon-mobil-will-triple-production-in-the-permian-basin-by-2025.html", "ord_in_thread": 0, "title": "Exxon Mobil will triple production in the Permian basin by 2025", "locations": [], "entities": {"persons": [], "locations": [{"name": "permian", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "permian basin", "sentiment": "none"}], "organizations": [{"name": "exxon mobil", "sentiment": "negative"}, {"name": "exxon", "sentiment": "none"}, {"name": "irving", "sentiment": "none"}, {"name": "u.s. southwest", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Lee Celano | Reuters A sign is seen at the entrance of the ExxonMobil Port Allen Lubricants Plant in Port Allen, Louisiana, November 6, 2015. \nExxon Mobil on Tuesday said it will triple its production of oil and chemical feedstocks in one of the most productive shale basins in the United States and expand infrastructure to bring those products to market by 2025. \nThe announcement came one day after the world's largest publicly listed oil company said it would ratchet up its U.S. investments to $50 billion over the next five years, in part due to the benefit of recent U.S. tax cuts. \nThe Irving, Texas-based oil major said it plans to increase total daily production in the U.S. Southwest's Permian Basin by 600,000 barrels of oil equivalent, a measure of crude, natural gas and other product output. In 2016, Exxon's total output was 4.1 million barrels of oil equivalent per day. \nExxon expects crude oil production alone to increase five-fold in the Permian, which runs beneath western Texas and eastern New Mexico. Last year, Exxon doubled its Permian holdings through the $5.6 billion acquisition of companies owned by the Bass family. \n\"Our geographic and competitive advantages in the Permian position the company for strong growth and long-term value creation,\" Sara Ortwein, president of Exxon's shale oil and gas subsidiary XTO Energy, said in a statement. \"We can deliver profitable production at a range of prices, and we have logistics and technology advantages over our competitors.\" show chapters 3:31 PM ET Mon, 29 Jan 2018 | 00:58 \nThe oil giant also plans to spend $2 billion to expand infrastructure to bring oil and feedstocks to market. Bottlenecks have emerged as a concern in the Permian as drillers packed into the basin in recent years to take advantage of its low-cost production during a prolonged oil price slump. \nU.S. shale drillers use advanced technology such as horizontal drilling and hydraulic fracturing to wring oil and gas from rock formations. Oil companies have driven down the cost of the process and can quickly start and shut production from shale wells, giving them flexibility when crude prices sink. \nExxon plans to expand the Wink, Texas, crude oil terminal it acquired in October in order to bring its production and third-party oil from the Permian to the Gulf Coast refining and export hub. \nThe growing production will provide a cheap feedstock to three of Exxon's Texas refining and chemical plants and another facility in Baton Rouge, Louisiana, the company said. \nByproducts from oil and gas drilling are the inputs for chemicals such as polyethylene, the most commonly used plastic in manufacturing. The petrochemicals segment is a major growth area for oil companies such as Exxon, in part due to surging use of plastics in developing nations. \nLast year, Exxon said it would invest $20 billion to build chemical, refining, lubricant and liquefied natural gas facilities along the U.S. Gulf coast. \nExxon is scheduled to announce fourth-quarter 2017 and full-year earnings on Friday morning. Shares of the company were down nearly 1 percent at about $87 on Tuesday. The stock is up 2.8 percent over the last year, lagging other integrated oil companies. ", "external_links": [], "published": "2018-01-30T20:52:00.000+02:00", "crawled": "2018-01-30T20:11:30.000+02:00", "highlightTitle": ""}