{"organizations": [], "uuid": "82249fc62c00f270a42ed55781f1814e982bca8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-op-bancorp-earns-1-point-90-million-in-the-fourth-quarter-of-2017.html", "country": "US", "domain_rank": 767, "title": "OP Bancorp Earns $1.90 Million in the Fourth Quarter of 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T13:00:00.000+02:00", "replies_count": 0, "uuid": "82249fc62c00f270a42ed55781f1814e982bca8d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-op-bancorp-earns-1-point-90-million-in-the-fourth-quarter-of-2017.html", "ord_in_thread": 0, "title": "OP Bancorp Earns $1.90 Million in the Fourth Quarter of 2017", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "op bancorp", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Financial Highlights\nNet income totaled $1.90 million for the fourth quarter of 2017, or $0.13 per diluted common share. Income tax expense for the quarter reflects an additional $1.3 million, or $0.10 per diluted share, from the reassessment of deferred tax assets due to the change in the federal tax rate. Net interest margin was 4.69% for the fourth quarter of 2017, compared to 4.68% for the third quarter of 2017 and 4.41% for the fourth quarter of 2016. Total assets were $901 million at December 31, 2017, up 2.5% from $879 million at September 30, 2017, and up 18.4% from $761 million at December 31, 2016. Net loans receivable were $739 million at December 31, 2017, up 1.6% from $727 million at September 30, 2017 and up 10.9% from $666 million at December 31, 2016. Total deposits were $773 million at December 31, 2017, up 2.5% from $755 million at September 30, 2017 and up 16.9% from $662 million at December 31, 2016. Noninterest bearing deposits at December 31, 2017 was $289 million or 37.4% of total deposits. Nonperforming assets to total assets were 0.12% at December 31, 2017.\nLOS ANGELES--(BUSINESS WIRE)-- OP Bancorp (the “Company”) (OTCQB: OPBK), the holding company of Open Bank (the “Bank”), today reported that net income for the fourth quarter of 2017 was $1.90 million, or $0.13 per diluted common share. This compares with net income of $2.73 million, or $0.19 per diluted share, for the third quarter of 2017, and net income of $2.26 million, or $0.16 per diluted share, for the fourth quarter of 2016.\nOn December 22, 2017, H.R.1, formerly known as the Tax Cuts and Jobs Act (the “Tax Act”), was signed into law, which among other items reduces the federal corporate tax rate to 21% from 34%, effective January 1, 2018. U.S. generally accepted accounting principles requires companies to revalue certain tax-related assets as of the date of enactment of the new legislation with resulting tax effects accounted for in the reporting period of enactment. As a result, we recorded an adjustment of $1.3 million to reduce the net deferred tax assets, which increased income tax expense and reduced the earnings for the fourth quarter of 2017 by approximately $0.10 per diluted share.\n“We are pleased announce another solid quarter with healthy assets and earnings growth. Notwithstanding our tax expense of $1.3 million from the adjustment to reduce the net deferred tax assets as a result of the new tax act enacted in the fourth quarter, we earned net income of $1.90 million. Our income before taxes for the fourth quarter was $5.09 million, a 39% increase from the fourth quarter of 2016,” stated Min Kim, President and Chief Executive Officer.\nQuarter Financial Highlights\n(in thousands, except per share data)\nAs of or for the Three Months Ended December 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\nIncome Statement Data: Net interest income $ 9,701 $ 9,208 $ 7,879 Provision for loan losses 322 278 323 Noninterest income 2,278 2,255 2,533 Noninterest expense 6,571 6,744 6,428 Income before taxes 5,086 4,441 3,661 Provision for income taxes 3,186 1,713 1,407 Net Income $ 1,900 $ 2,728 $ 2,254 Balance Sheet Data: Loans held for sale $ 15,739 $ 12,893 $ 1,646 Gross loans, net of unearned income 748,024 736,058 674,227 Allowance for loan losses 9,139 8,909 7,910 Total assets 900,999 879,087 761,250 Deposits 773,306 754,533 661,784 Shareholders’ equity 91,480 89,478 81,284 Credit Quality: Nonperforming loans $ 1,037 $ 734 $ 576 Nonperforming assets 1,037 734 576 Performance Ratios: Net interest margin 4.69 % 4.68 % 4.41 % Efficiency ratio 54.86 % 58.83 % 61.73 % Net charge-offs to average gross loans (annualized) 0.05 % -0.04 % 0.02 % Nonperforming assets to gross loans plus OREO 0.14 % 0.10 % 0.09 % ALLL to nonperforming loans 881 % 1,214 % 1,373 % ALLL to gross loans 1.22 % 1.21 % 1.17 % Capital Ratios: Tangible common equity to tangible assets (1) 10.15 % 10.18 % 10.68 % Leverage ratio 10.46 % 10.77 % 10.89 % Common Equity Tier 1 ratio 12.26 % 12.15 % 12.17 % Tier 1 risk-based capital ratio 12.26 % 12.15 % 12.17 % Total risk-based capital ratio 13.49 % 13.37 % 13.37 %\n(1) Represents a non-GAAP financial measure.\nResults of Operations\nNet interest income before loan loss provision for the fourth quarter of 2017 was $9.7 million, an increase of $493 thousand, or 5.4%, compared to $9.2 million for the third quarter of 2017. The increase in net interest income was primarily due to a 5.0% increase in average loans, including loans held-for-sale, coupled with a 6 basis point increase in average loan yields, offset by a 6 basis point increase in average cost of funds. The average yields on loans increased to 5.63% for the fourth quarter of 2017, compared to 5.57% for the third quarter of 2017, due to a 25 basis point market rate increase by the Federal Reserve in December 2017.\nThe net interest margin for the fourth quarter of 2017 was 4.69%, a 1 basis point increase from 4.68% for the third quarter of 2017. The increase in the net interest margin was primarily due to the Federal Reserve market rate increase, which affected the repricing of our earning assets to a greater extent than the repricing of our liabilities, and an increase of noninterest-bearing funding sources. The average balance of noninterest-bearing deposits increased $7.8 million, or 3.0%, during the fourth quarter of 2017.\nNet interest income before provision for loan losses for the fourth quarter of 2017 increased $1.8 million, or 23.1%, compared to $7.9 million for the fourth quarter of 2016. The increase in net interest income was primarily due to a 15.2% increase in average loans, including loans held-for-sale, coupled with a 53 basis point increase in average loan yields from 5.10% for the fourth quarter of 2016, offset by an 18 basis point increase in average cost of funds. The increase in the average yields on loans was primarily due to cumulative market rate increases by the Federal Reserve of 75 basis points through three rate hikes of 25 basis points in each of March 2017, June 2017 and December 2017.\nThe net interest margin for the fourth quarter of 2017 increased 28 basis points from 4.41% for the fourth quarter of 2016. The increase in the net interest margin was primarily due to the Federal Reserve market rate increases during 2017 and an increase of noninterest-bearing funding sources. The average balance of noninterest-bearing deposits increased $32.4 million, or 13.7%, during 2017.\nThe following table shows the asset yields, liability costs, spreads and margins.\nThree Months Ended December 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\nYield on loans (1) 5.63 % 5.57 % 5.10 % Yield on interest-earning assets 5.35 % 5.29 % 4.91 % Cost of interest-bearing liabilities 1.08 % 1.01 % 0.83 % Cost of deposits 0.70 % 0.64 % 0.54 % Cost of funds 0.71 % 0.65 % 0.53 % Net interest spread 4.27 % 4.28 % 4.07 % Net interest margin 4.69 % 4.68 % 4.41 %\n(1) Includes loans held for sale\nThe provision for loan losses for the fourth quarter of 2017 was $322 thousand, compared to $278 thousand for the third quarter of 2017 and $323 thousand for the fourth quarter of 2016.\nNoninterest income for the fourth quarter of 2017 was $2.28 million, an increase of $23 thousand, or 1.0%, from $2.26 million for the third quarter of 2017, due to increases in gain on sale of SBA loans and service charges on deposit accounts, offset by a decrease in loan servicing income. Gain on sale of SBA loans increased $215 thousand to $1.4 million for the fourth quarter of 2017 from $1.2 million for the third quarter of 2017. We sold $18.6 million in SBA loans with an average premium of 9.35% in the fourth quarter of 2017 compared to the sale of $15.0 million in SBA loans with an average premium of 9.97% in the third quarter of 2017. Service charges on deposit accounts increased $61 thousand due to noninterest-bearing accounts and related activities during the fourth quarter of 2017. Loan servicing income, net of amortization, decreased $248 thousand, primarily due to an increase in servicing assets amortization on SBA loan payoffs.\nNoninterest income for the fourth quarter of 2017 decreased $255 thousand, or 10%, compared to $2.5 million for the fourth quarter of 2016, due to decreases in loan servicing income and gain on sale of SBA loans, offset by an increase in service charges on deposit accounts. Loan servicing income, net of amortization, decreased $369 thousand, primarily due to an increase in servicing assets amortization on SBA loan payoffs. Gain on sale of SBA loans decreased $59 thousand compared to $1.4 million for the fourth quarter of 2016. We sold $21.4 million in SBA loans with an average premium of 8.15% in the fourth quarter of 2016. Service charges on deposit accounts increased $102 thousand due to noninterest-bearing accounts and related activities during 2017.\nNoninterest expense for the fourth quarter of 2017 was $6.6 million, a decrease of $172 thousand, or 2.6%, compared to $6.7 million for the third quarter of 2017. The decrease was primarily due to $202 thousand decrease in salary and employee benefits, $83 thousand decrease in foundation donation and other contributions, partially offset by $85 thousand increase in other operations expenses.\nNoninterest expense for the fourth quarter increased $143 thousand, or 2.2%, compared to $6.4 million for the fourth quarter of 2016. The increase was primarily due to $124 thousand increase in occupancy, $114 thousand increase in business development, $99 thousand increase in other operations expenses, partially offset by $174 thousand decrease in salary and employee benefits.\nTax provision for the fourth quarter of 2017 was $3.2 million, compared to $1.7 million for the third quarter of 2017 and $1.4 million for the fourth quarter of 2016. The effective tax rate for the fourth quarter of 2017 was 62.6%, compared to 38.6% for the third quarter of 2017 and 38.4% for the fourth quarter of 2016. As noted previously, the provision for the fourth quarter of 2017 includes the additional income tax expense of $1.3 million resulting from the adjustment to reduce the net deferred tax assets due to the Tax Act.\nBalance Sheet\nTotal assets were $901 million at December 31, 2017, an increase of $21.9 million, or 2.5%, from $879.1 million at September 30, 2017, and an increase of $139.7 million, or 18.4%, from $761.3 million at December 31, 2016. Gross loans, net of unearned income, were $748.0 million at December 31, 2017, an increase of $12.0 million, or 1.6%, from $736.1 million at September 30, 2017, and an increase of $73.8 million, or 10.9%, from $674.2 million at December 31, 2016.\nNew loan originations for the fourth quarter of 2017 totaled $57.1 million, including SBA loan originations of $18.0 million, compared to $87.5 million, including SBA loan originations of $34.6 million for the third quarter of 2017. New loan originations for the fourth quarter of 2016 were $82.3 million, including SBA loan originations of $29.5 million. Loan payoffs for the fourth quarter of 2017 were $22.9 million, compared to $28.2 million for the third quarter of 2017, and $20.5 million for the fourth quarter of 2016.\nTotal deposits were $773.3 million at December 31, 2017, an increase of $18.8 million, or 2.5%, from $754.5 million at September 30, 2017, and an increase of $111.5 million, or 16.9%, from $661.8 million at December 31, 2016. Noninterest bearing deposits were $289.4 million at December 31, 2017, an increase of $256 thousand, or 0.1%, from $289.2 million at September 30, 2017, and an increase of $42.0 million, or 17.0%, from $247.4 million at December 31, 2016.\nNoninterest bearing deposits accounted for 37.4% of total deposits at December 31, 2017, compared to 38.3% at September 30, 2017 and 37.4% at December 31, 2016.\nDecember 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\nNoninterest-bearing deposits 37.4 % 38.3 % 37.4\n%\nInterest-bearing demand deposits 32.0 % 34.6 % 34.7 % Savings 0.5 % 0.5 % 0.5 % Time deposits over $250,000 14.1 % 12.8 % 11.9 % Other time deposits 16.0 % 13.8 % 15.5 % Total deposits\n100.0 % 100.0 % 100.0 % There was $25 million in borrowing from the Federal Home Loan Bank (“FHLB”) at December 31, 2017 and September 30, 2017 and $10 million at December 31, 2016.\nAt December 31, 2017, the Company continued to exceed all regulatory capital requirements to be classified as “well-capitalized,” as summarized in the following table.\nDecember 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\nTier 1 leverage capital ratio 10.46 % 10.77 % 11.89 % CET 1 capital ratio 12.26 % 12.15 % 12.17 % Tier 1 risk-based capital ratio 12.26 % 12.15 % 12.17 % Total risk-based capital ratio 13.49 % 13.37 % 13.37 % At December 31, 2017, the tangible common equity represented 10.15% of tangible assets, compared to 10.18% at September 30, 2017 and 10.68% at December 31, 2016. The tangible common equity to tangible assets ratio is a non-GAAP financial measure that represents common equity less goodwill and other net intangible assets divided by total assets less goodwill and other net intangible assets. Management reviews the tangible common equity to tangible assets ratio to evaluate the Company’s capital levels.\nAsset Quality\nNonperforming assets were $1.0 million, or 0.12% of total assets, at December 31, 2017, $734 thousand, or 0.08% of total assets, at September 30, 2017 and $576 thousand, or 0.08% of total assets, at December 31, 2016. There was no other real estate owned (“OREO”) at December 31, 2017, September 30, 2017, or December 31, 2016.\nNonperforming loans to gross loans were 0.14% at December 31, 2017, compared to 0.10% at September 30, 2017 and 0.09% at December 31, 2016. Total classified loans were $2.1 million, or 0.28% of gross loans, at December 31, 2017, compared to $2.1 million, or 0.29% of gross loans, at September 30, 2017 and $2.3 million, or 0.34% of gross loans, at December 31, 2016.\nThe allowance for loan losses was $9.1 million at December 31, 2017, compared to $8.9 million at September 30, 2017 and $7.9 million at December 31, 2016. The allowance for loan losses was 1.22% of gross loans at December 31, 2017 and 1.21% at September 30, 2017 and 1.17% at December 31, 2016. The allowance for loan losses was 881% of nonperforming assets at December 31, 2017 and 1,214% at September 30, 2017 and 1,373% at December 31, 2016.\nAbout OP Bancorp\nOP Bancorp, the holding company for Open Bank, is a California corporation whose common stock is traded on the OTCQB under the ticker symbol, “OPBK.” Open Bank (the \"Bank\") is engaged in the general commercial banking business in Los Angeles and Orange Counties and is focused on serving the banking needs of small- and medium-sized businesses, professionals, and residents with a particular emphasis on Korean and other ethnic minority communities. The Bank currently operates with seven full branch offices in Downtown Los Angeles, Los Angeles Fashion District, Los Angeles Koreatown, Gardena and Buena Park. The Bank also has three loan production offices in Seattle, Washington, Dallas, Texas, and Atlanta, Georgia. The Bank commenced its operations on June 10, 2005 as First Standard Bank and changed its name to Open Bank in October 2010. Its headquarters is located at 1000 Wilshire Blvd., Suite 500, Los Angeles, California 90017. Phone 213.892.9999; www.myopenbank.com Member FDIC, Equal Housing Lender\nForward-Looking Statements\nThis press release contains certain forward-looking information about OP Bancorp. All statements other than statements of historical fact are forward-looking statements. These forward-looking statements may include, but are not limited to, such words as \"believes,\" \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"estimates,\" \"may,\" \"will,\" \"should,\" \"could,\" \"predicts,\" \"potential,\" \"continue,\" or the negative of such terms and other comparable terminology or similar expressions. Forward-looking statements are not guarantees. Such statements involve inherent risks and uncertainties, many of which are difficult to predict and are generally beyond the control of OP Bancorp such as the ability of our new branch to attract sufficient number of customers, deposits and new business to become profitable. OP Bancorp cautions readers that a number of important factors could cause actual results to differ materially from those expressed in, or implied or projected by, such forward-looking statements. If any of these risks or uncertainties materializes or if any of the assumptions underlying such forward-looking statements proves to be incorrect, OP Bancorp’s results could differ materially from those expressed in, or implied or projected by such forward-looking statements. OP Bancorp assumes no obligation to update such forward-looking statements, except as required by law.\nBalance Sheet (Dollars in thousand, except per share data) December 31, 2017\nSeptember 30, 2017\n$ change\n% change December 31, 2016 $ change\n% change (Unaudited) (Unaudited) (Audited) Assets Cash and due from banks $ 63,250 $ 53,961 $ 9,289 17.2 % $ 20,126 $ 43,124 214.3 % Investment securities 41,472 43,578 (2,106 ) -4.8 % 35,463 6,009 16.9 % Loans held for sale 15,739 12,893 2,846 22.1 % 1,646 14,093 856.2 % Real Estate Loans 420,760 405,453 15,307 3.8 % 362,585 58,175 16.0 % SBA Loans 115,559 116,681 (1,122 ) -1.0 % 104,286 11,273 10.8 % C & I Loans 103,682 107,476 (3,794 ) -3.5 % 97,660 6,022 6.2 % Home Mortgage Loans 104,068 102,283 1,785 1.7 % 104,810 (742 ) -0.7 % Consumer & Other Loans 3,956 4,165 (209 ) -5.0 % 4,887 (931 ) -19.1 % Gross loans, net of unearned income 748,024 736,058 11,966 1.6 % 674,227 73,797 10.9 % Allowance for loan losses (9,139 ) (8,909 ) (230 ) -2.6 % (7,910 ) (1,229 ) -15.5 % Net loans receivable 738,885 727,149 11,736 1.6 % 666,317 72,568 10.9 % Premises and equipment, net 4,481 4,442 39 0.9 % 5,067 (586 ) -11.6 % Accrued interest receivable 2,463 2,182 281 12.9 % 2,001 462 23.1 % FHLB and Pacific Coast Bankers Bank Stock, at cost 4,287 4,287 0 0.0 % 3,438 849 24.7 % Servicing assets 6,771 6,957 (186 ) -2.7 % 6,783 (12 ) -0.2 % Company owned life insurance 11,090 11,012 78 0.7 % 10,770 320 3.0 % Deferred tax assets 3,383 4,214 (831 ) -19.7 % 3,276 107 3.3 % Other assets 9,177 8,412 765 9.1 % 6,362 2,815 44.2 % Total assets $ 900,999 $ 879,087 $ 21,912 2.5 % $ 761,250 $ 139,749 18.4 % Liabilities and Shareholders' Equity Noninterest bearing deposits $ 289,410 $ 289,154 $ 256 0.1 % $ 247,376 $ 42,034 17.0 % Savings 3,838 3,809 29 0.8 % 3,207 631 19.7 % Money market and others 247,324 260,930 (13,606 ) -5.2 % 229,566 17,758 7.7 % Time deposits over $250,000 108,952 96,641 12,311 12.7 % 79,024 29,928 37.9 % Other time deposits 123,782 103,999 19,783 19.0 % 102,611 21,171 20.6 % Total deposits 773,306 754,533 18,773 2.5 % 661,784 111,522 16.9 % Other borrowings 25,000 25,000 0 0.0 % 10,000 15,000 150.0 % Other liabilities 11,213 10,076 1,137 11.3 % 8,182 3,031 37.0 % Total liabilities 809,519 789,609 19,910 2.5 % 679,966 129,553 19.1 % Total shareholders' equity 91,480 89,478 2,002 2.2 % 81,284 10,196 12.5 % Total Liabilities and Shareholders' Equity $ 900,999 $ 879,087 $ 21,912 2.5 % $ 761,250 $ 139,749 18.4 % Statement of Operations (Dollars in thousand, except per share data) Three Months Ended Year Ended December 31, 2017 September 30, 2017 % change December 31, 2016 % change December 31, 2017 December 31, 2016 % change Interest income $ 11,077 $ 10,419 6.3 % $ 8,766 26.4 % $ 40,283 $ 31,701 27.1 % Interest expense 1,376 1,211 13.6 % 887 55.1 % 4,573 3,371 35.7 % Net interest income 9,701 9,208 5.4 % 7,879 23.1 % 35,710 28,330 26.1 % Provision for loan losses 322 278 15.8 % 323 -0.3 % 1,311 1,682 -22.1 % Non interest income 2,278 2,255 1.0 % 2,533 -10.1 % 8,986 9,007 -0.2 % Non interest expense 6,571 6,744 -2.6 % 6,428 2.2 % 26,257 23,334 12.5 % Income before income taxes 5,086 4,441 14.5 % 3,661 38.9 % 17,128 12,321 39.0 % Provision for income taxes 3,186 1,713 86.0 % 1,407 126.4 % 7,892 4,894 61.3 % Net income (loss) $ 1,900 $ 2,728 -30.4 % $ 2,254 -15.7 % $ 9,236 $ 7,427 24.4 % Book Value $ 6.94 $ 6.80 2.0 % $ 6.30 10.0 % $ 6.94 $ 6.30 10.0 % Basic EPS $ 0.14 $ 0.20 -30.4 % $ 0.17 -16.4 % $ 0.68 $ 0.55 23.6 % Diluted EPS $ 0.13 $ 0.19 -30.6 % $ 0.16 -16.8 % $ 0.66 $ 0.53 23.2 % Shares of common stock outstanding 13,190,527 13,162,732 0.2 % 12,896,548 2.3 % 13,190,527 12,896,548 2.3 % Weighted Average Shares: - Basic 13,182,630 13,132,237 0.4 % 12,879,956 2.3 % 13,063,344 12,788,378 2.2 % - Diluted 13,655,872 13,560,140 0.7 % 13,275,943 2.9 % 13,485,791 13,158,155 2.5 % Three Months Ended Year Ended December 31, 2017 September 30, 2017 % change December 31, 2016 % change December 31, 2017 December 31, 2016 % change Key Ratios Return on average assets (ROA)* 0.87 % 1.31 % -0.44 % 1.21 % -0.34 % 1.13 % 1.08 % 0.05 % Return on average equity (ROE) * 8.33 % 12.35 % -4.02 % 11.27 % -2.94 % 10.63 % 9.69 % 0.94 % Net interest margin * 4.69 % 4.68 % 0.01 % 4.41 % 0.28 % 4.61 % 4.34 % 0.27 % Net Interest Margin, excl. non-recurring items * 4.42 % 4.49 % -0.07 % 4.30 % 0.12 % 4.43 % 4.22 % 0.21 % Efficiency ratio 54.86 % 58.83 % -3.97 % 61.73 % -6.87 % 58.74 % 62.50 % -3.76 % Tangible common equity to tangible assets 10.15 % 10.18 % -0.03 % 10.68 % -0.53 % 10.15 % 10.68 % -0.53 % Tier 1 Leverage Ratio 10.46 % 10.77 % -0.31 % 10.89 % -0.43 % 10.46 % 10.89 % -0.43 % Common Equity Tier 1 Ratio 12.26 % 12.15 % 0.11 % 12.17 % 0.09 % 12.26 % 12.17 % 0.09 % Tier 1 Capital Ratio 12.26 % 12.15 % 0.11 % 12.17 % 0.09 % 12.26 % 12.17 % 0.09 % Total Risk Based Capital Ratio 13.49 % 13.37 % 0.12 % 13.37 % 0.12 % 13.49 % 13.37 % 0.12 % Average Balances Investments $ 65,205 $ 60,767 7.3 % $ 54,369 19.9 % $ 60,547 $ 66,372 -8.8 % Loans, including loans held for sale 756,956 720,880 5.0 % 657,078 15.2 % 714,315 586,628 21.8 % Interest earning assets 822,161 781,647 5.2 % 711,448 15.6 % 774,861 653,000 18.7 % Total assets $ 875,527 $ 829,891 5.5 % $ 746,673 17.3 % $ 820,360 $ 685,617 19.7 % Noninterest bearing deposits $ 268,691 $ 260,863 3.0 % $ 236,249 13.7 % $ 256,267 $ 198,413 29.2 % Interest bearing deposits 494,514 454,995 8.7 % 413,078 19.7 % 460,987 387,986 18.8 % Total deposits 763,205 715,858 6.6 % 649,328 17.5 % 717,253 586,399 22.3 % Interest bearing liabilities 505,146 474,354 6.5 % 423,405 19.3 % 470,289 404,972 16.1 % Shareholders' equity 91,246 88,373 3.3 % 79,991 14.1 % 86,909 76,647 13.4 % Net interest earning assets $ 317,015 $ 307,293 3.2 % $ 288,043 10.1 % $ 304,572 $ 248,028 22.8 % Asset Quality 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 Nonaccrual Loans 683 377 421 - 209 Loans 90 days or more past due, accruing - - - - - Accruing Restructured Loans 354 357 360 364 367 Total Non-Performing Loans 1,037 734 781 364 576 Other Real Estate Loans (OREO) - - - - - Total Non-Performing Assets 1,037 734 781 364 576 Classified Loans 2,127 2,138 2,561 2,065 2,304 Non-Performing Assets/Total Assets 0.12 % 0.08 % 0.09 % 0.05 % 0.08 % Non-Performing Assets/(Gross Loans +OREO) 0.14 % 0.10 % 0.11 % 0.05 % 0.09 % Non-Performing Loans/Gross Loans 0.14 % 0.10 % 0.11 % 0.05 % 0.09 % Allowance for Loan Losses/Non-Performing Loans 881 % 1214 % 1096 % 2302 % 1373 % Allowance for Loan Losses/Non-Performing Assets 881 % 1214 % 1096 % 2302 % 1373 % Allowance for Loan Losses/Gross Loans 1.22 % 1.21 % 1.22 % 1.23 % 1.17 % Classified Loans/Gross Loans 0.28 % 0.29 % 0.36 % 0.30 % 0.34 % Net Charge-offs $ 92 $ (75 ) $ (6 ) $ 71 $ 28 Net Charge-offs to Average Gross Loans * 0.05 % -0.04 % 0.00 % 0.04 % 0.02 % * Annualized\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005439/en/\nOP Bancorp\nChristine Oh\nEVP & CFO\n213.892.1192\nChristine.oh@myopenbank.com\nSource: OP Bancorp", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.myopenbank.com&esheet=51750638&newsitemid=20180130005439&lan=en-US&anchor=www.myopenbank.com&index=1&md5=58b4e3aaddaa5cbbb6250084c49b858a", "http://www.businesswire.com/news/home/20180130005439/en/"], "published": "2018-01-30T13:00:00.000+02:00", "crawled": "2018-01-30T13:08:16.008+02:00", "highlightTitle": ""}