{"organizations": [], "uuid": "2bdc6189b21ac5694ad983487bb0ec4a4f413916", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226207134&w=1200&r=LYNXMPEE0S0CV", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/sanofi-dengue-competitors/how-sanofis-setback-could-lead-to-better-dengue-vaccines-idINKBN1FI0G9", "country": "US", "domain_rank": 408, "title": "Analysis: How Sanofi's setback could lead to better dengue vaccines", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T08:01:00.000+02:00", "replies_count": 0, "uuid": "2bdc6189b21ac5694ad983487bb0ec4a4f413916"}, "author": "", "url": "https://in.reuters.com/article/sanofi-dengue-competitors/how-sanofis-setback-could-lead-to-better-dengue-vaccines-idINKBN1FI0G9", "ord_in_thread": 0, "title": "Analysis: How Sanofi's setback could lead to better dengue vaccines", "locations": [], "entities": {"persons": [{"name": "takeda", "sentiment": "none"}, {"name": "julie steenhuysen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "dengvaxia", "sentiment": "none"}], "organizations": [{"name": "sanofi", "sentiment": "negative"}, {"name": "butantan institute", "sentiment": "none"}, {"name": "takeda pharmaceuticals co ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. national institutes of health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 6:09 AM / Updated 14 hours ago How Sanofi's setback could lead to better dengue vaccines Julie Steenhuysen 8 Min Read \nCHICAGO (Reuters) - New dengue vaccines being developed by Takeda Pharmaceuticals Co Ltd and U.S. government scientists are poised to provide a safer alternative to Sanofi’s Dengvaxia, according to vaccine experts, because they already take into account some of the issues that sidelined the product last year. \nSanofi revealed in November that Dengvaxia - the world’s first dengue vaccine - might increase the risk of severe disease in people who had never been exposed to the virus. The news prompted an uproar in the Philippines, where more than 800,000 school-age children had been vaccinated. \nNext-generation vaccines by Japan’s Takeda and the U.S. National Institutes of Health, in conjunction with Brazil’s Butantan Institute, are now in late-stage testing. \nThey both differ significantly from Dengvaxia, which may increase the chances for a stronger, more durable immune response, according to more than a dozen dengue experts interviewed by Reuters. \nThey expressed especially high hopes for the NIH vaccine, which protected 100 percent of volunteers who received it in a small study. \nMerck & Co Inc holds an exclusive license for the NIH vaccine in the United States, Canada, China, Japan and the European Union, and plans to begin its own trials in the first half of 2018. \nIt’s too early to say whether either candidate will ultimately succeed, and experts await data from large, late-stage clinical trials. \nAnd while Sanofi’s early safety troubles may delay licensing of new vaccines for a few years as global regulators seek assurances from longer-term data, the increased scrutiny should result in a better, safer product, they said. \n“We’ve learned a tremendous amount about dengue from the Sanofi vaccine,” said Dr. Anna Durbin, a researcher at the Johns Hopkins Bloomberg School of Public Health who helped develop the NIH vaccine. “There is hope the two candidates coming down the pike can provide the benefit of a good dengue vaccine without the risk.” LESSONS LEARNED \nDengue is the world’s fastest-growing infectious disease, afflicting up to 100 million people worldwide, causing half a million life-threatening infections and killing up to 25,000 people, mostly children, each year. An effective vaccine could be worth more than $1 billion globally, according to industry analysts. \nThere are four distinct types of dengue. A first infection with any one of them can increase the chances of severe disease when exposed to a second. \nExperts say an effective vaccine must protect against all four types at once. A weak response to one of them could act like a first infection and leave a person vulnerable to severe disease when exposed a second time. \nThat is what appears to have happened with Sanofi’s Dengvaxia, according to vaccine experts. \n“It wasn’t a uniformly high level of response to all four subtypes (of dengue) simultaneously,” Dr. Anthony Fauci, director of the NIH’s National Institutes of Allergy and Infectious Diseases, said in an interview. \nSanofi’s late-stage clinical trials, which were designed in 2009, only collected blood samples from 10 to 15 percent of study participants before they were vaccinated. \nAs a result, it was impossible to know when the studies were published in 2015 whether risks were greater in children who had never been exposed to dengue, said Dr. Su-Peing Ng, Sanofi’s global medical head, in an interview. \nTo answer this question, Sanofi developed a special test to re-analyze its results, leading to the November 2017 disclosure. \n“We’ve been extremely transparent with our data,” Ng said, adding that the company consulted with the field’s leading experts as it was developing its vaccine. \nClinical trials testing the two new vaccines both require blood samples for all participants before they are vaccinated so they can quickly identify any similar risks. \nDr. Stephen Whitehead, who developed the NIH vaccine, said in a 2016 review that the long-term follow up from Sanofi’s studies “was instrumental in identifying safety concerns that are currently being investigated.” IMMUNE RESPONSE \nDengvaxia uses a widely effective yellow fever virus vaccine as its genetic backbone. To induce an immune response to dengue, certain yellow fever genes were swapped out for dengue genes. \n“It seemed like a bright idea 20 years ago,” said dengue expert Dr. Scott Halstead, an adjunct professor at the Uniformed Services University of the Health Sciences in Bethesda, Maryland. \nIn hindsight, Halstead said, simply splicing select dengue genes into a yellow fever vaccine may not present enough of the virus to the immune system to induce full protection. \nInstead of yellow fever, Takeda’s vaccine, TAK-003, is based on a weakened version of a live dengue 2 virus. \n“We’ve taken a dengue 2 virus backbone and inserted elements of dengue 1, 3 and 4,” said Dr. Rajeev Venkayya, president of Takeda’s global vaccine business unit. \nThat’s important, Venkayya said, “because it exposes an individual that is immunized to a broad range of proteins on the outside and the inside of the virus, which allows individuals to generate a broad immune response.” \nData published in November in Lancet Infectious Diseases showed Takeda’s vaccine produced responses against all four virus types, regardless of previous dengue exposure. There were no safety concerns. \nTakeda’s vaccine is being tested in 20,000 children aged 4 to 16 in Asia and Latin America. Initial data are expected in late 2018. \nVenkayya said the company’s research has shown the vaccine, given in two doses, can produce both antibodies to dengue as well as a second type of response in which immune cells - known as CD8-positive T cells - recognize and kill virus-infected cells. \nSeveral researchers suspect exposure to the full spectrum of dengue proteins is key to developing a fully protective vaccine. \nJohns Hopkins’ Durbin said the presence of T-cells triggered by non-structural proteins in dengue 2 could help clear the virus before people become sick. But, like Sanofi’s Dengvaxia, the Takeda vaccine appears to produce an unbalanced antibody response, with the highest protection offered against dengue 2. \nIn a July 2017 paper published in Cold Spring Harbor Perspectives in Biology, Halstead said that it is also not clear whether Takeda’s vaccine will provoke T-cell immunity to the other three dengue viruses, clouding its potential to succeed. \nThe NIH vaccine, called TV003/TV005, also features weakened versions of live dengue, but three of the four components - dengue 1, 3 and 4 - are based on whole dengue viruses. The fourth component is based on a dengue 4 backbone with dengue 2 genes spliced in. \nIt has been shown to provoke a strong antibody response to all four types of dengue in a single shot, as well as producing T-cell immunity. \n“It appears to be a true, protective, one-dose vaccine,” Halstead said. \nBrazil’s non-profit Butantan Institute is testing the vaccine in some 17,000 participants in 14 areas with widespread dengue. \n“Though you never, ever, definitively predict until after everything is completely over, everything we’ve seen on the preliminary work on that looks pretty good,” Fauci said. Editing by Michele Gershberg and Edward Tobin", "external_links": [], "published": "2018-01-29T08:01:00.000+02:00", "crawled": "2018-01-29T08:32:50.014+02:00", "highlightTitle": ""}