{"organizations": [], "uuid": "c93978121dc8b69d4863e2db4b006efdfb3acfa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/tsmc-results/update-1-chip-boom-propels-tsmc-to-strong-q4-profit-just-below-record-levels-idUSL3N1PD2FT", "country": "US", "domain_rank": 408, "title": "UPDATE 2-TSMC forecasts record 2018 revenue on cryptocurrency boom", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:37:00.000+02:00", "replies_count": 0, "uuid": "c93978121dc8b69d4863e2db4b006efdfb3acfa7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/tsmc-results/update-1-chip-boom-propels-tsmc-to-strong-q4-profit-just-below-record-levels-idUSL3N1PD2FT", "ord_in_thread": 0, "title": "UPDATE 2-TSMC forecasts record 2018 revenue on cryptocurrency boom", "locations": [], "entities": {"persons": [{"name": "jess macy yu", "sentiment": "none"}, {"name": "morris chang", "sentiment": "none"}], "locations": [{"name": "taipei", "sentiment": "none"}], "organizations": [{"name": "tsmc", "sentiment": "negative"}, {"name": "reuters) - taiwan semiconductor manufacturing co ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* TSMC expects 2018 revenue to climb 10-15 percent\n* Q4 net profit edges down 0.9 percent, just below record level\n* Q4 revenue up 5.9 percent from a year ago (Recasts, adds comment from earnings call)\nBy Jess Macy Yu\nTAIPEI, Jan 18 (Reuters) - Taiwan Semiconductor Manufacturing Co Ltd (TSMC) expects a boom in the cryptocurrency market to drive up demand for high-end chips and help it post a record revenue this year, outweighing softening sales to smartphone vendors.\nTSMC’s outlook highlights a trend of chip makers benefiting from new technology, such as blockchain, cloud computing, self-driving cars and artificial intelligence, that require powerful processing power and low energy-consumption. Cryptocurrency is the latest entry on this list of revenue drivers.\n“The urge to mine cryptocurrency is very strong, and the incentive of course depends on the price of cryptocurrency,” TSMC Chairman Morris Chang said at an earnings conference on Thursday, after the company earlier reported a better-than-expected quarterly profit.\n“Demand right now or for the last year has been very strong, and we expect it to continue to be strong ... I believe that we will both satisfy our customers and we will not be too optimistic,” Chang added.\nTSMC expects revenue to grow between 10-15 percent this year, versus a modest 3.1-percent growth in 2017, after factoring in flat demand from mobile customers.\nTSMC, which is a key supplier for Apple, Qualcomm Inc and Nvidia Corp, posted a net profit of T$99.29 billion ($3.36 billion) for the quarter ended December, just 0.9 percent less than a year ago. But this was slightly ahead of an average forecast of T$97.78 billion drawn from 20 analysts polled by Thomson Reuters I/B/E/S.\nRevenue rose to $9.2 billion, in line with the company’s guidance and up 5.9 percent from a year ago.\nApart from cryptocurrency-related demand, results were also aided by a major smartphone release, TSMC’s co-CEO, C.C. Wei, said. Analysts said he was referring to Apple’s delayed launch of iPhone X in early November.\nRevenue at TSMC’s computer segment surged 25 percent in the quarter, while its communications business, which generates nearly 60 percent of the company’s total sales, logged a 2 percent decline.\nHigh performance computing will register the strongest growth this year, thanks to demand for graphics chips and high-performance chips used to mine cryptocurrencies, said co-CEO Mark Liu who is set to take over from retiring Chang in June as chairman.\nCryptocurrencies are digital currencies that use encryption techniques for security and can be traded. Mining consumes large quantities of energy and needs chips with a lot of processing power to solve complex math puzzles to validate transactions.\nCryptocurrencies saw a dramatic run-up in 2017 as an explosion in so-called initial coin offerings - digital, token-based fundraising rounds - drove demand. But there has been a reversal of fortunes this year amid concerns global coordination on how to regulate the sector will accelerate.\nTSMC’s market value increased by 38 percent over the past year to $212 billion, partly due to the cryptocurrency wave.\nPrior to the earnings announcement on Thursday, shares in TSMC closed up 2.7 percent, versus a 0.6 percent rise in the wider market.\nFor the current quarter, usually a slower period for the tech sector, TSMC sees revenue at $8.4 billion to $8.5 billion. ($1 = 29.5410 Taiwan dollars) (Reporting by Jess Macy Yu; Editing by Edwina Gibbs and Himani Sarkar)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T14:37:00.000+02:00", "crawled": "2018-01-19T12:15:02.021+02:00", "highlightTitle": ""}