{"organizations": [], "uuid": "02d8d952a728470acca13f5f922d4ef6e80cdb85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220268164&w=1200&r=LYNXMPEE070SW", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-murray/murray-undergoes-hip-surgery-eyes-wimbledon-return-idUKKBN1EX19A", "country": "US", "domain_rank": 408, "title": "Murray undergoes hip surgery, eyes Wimbledon return", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:23:00.000+02:00", "replies_count": 0, "uuid": "02d8d952a728470acca13f5f922d4ef6e80cdb85"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-murray/murray-undergoes-hip-surgery-eyes-wimbledon-return-idUKKBN1EX19A", "ord_in_thread": 0, "title": "Murray undergoes hip surgery, eyes Wimbledon return", "locations": [], "entities": {"persons": [{"name": "murray", "sentiment": "negative"}, {"name": "andy murray", "sentiment": "none"}, {"name": "martyn", "sentiment": "none"}, {"name": "reuters/tony o'brien", "sentiment": "none"}, {"name": "john o‘donnell", "sentiment": "none"}], "locations": [{"name": "great britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "st vincent hospital", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:24 PM / Updated 4 hours ago Murray undergoes hip surgery, eyes Wimbledon return Martyn Herman 4 Min Read \nLONDON (Reuters) - Three-times grand slam champion Andy Murray underwent hip surgery on Monday but is optimistic about his chances of returning in time for Wimbledon and believes he can still challenge for major titles. Tennis - ATP World Tour Finals Preview - The O2 Arena, London, Britain - November 11, 2017 Great Britain's Andy Murray during practice Action Images via Reuters/Tony O'Brien \nThe 30-year-old Briton has not played a competitive match since hobbling to defeat by Sam Querrey in the Wimbledon quarter-finals six months ago and last week he withdrew from the Australian Open. \n“Today I underwent successful right hip surgery at the St Vincent Hospital in Melbourne,” Murray said on Facebook. \n“I’d like to thank Dr John O‘Donnell and all of the staff for looking after me. I look forward to returning to competitive tennis during the grasscourt season,” he added. \n“Thanks to everyone for all the well wishes and support over the last few days. I’ll come back from this.” \nMurray, who ended 2016 as world number one, has slipped down to 19th in the rankings but the Scot is insists he is not a spent force. \n“I‘m not finished playing tennis yet. I‘m going to be competing at the highest level again,” Murray, talking from his hospital bed, was quoted as saying by British media. \n“I‘m very optimistic about the future - the surgeon is very happy about how it went.” CONTINUE RECOVERY \nMurray is expected to return home in a week or two to continue his recovery and rehabilitation. \nThe twice Wimbledon champion and reigning Olympic champion has made it back from surgery before after having an operation to his lower back at the end of 2013. \nHe went on to win a second Wimbledon title in 2016 and played arguably the best tennis of his career. \nLast year, however, his hip began to cause concern at the French Open where he reached the semi-finals and he was walking with a limp throughout Wimbledon. \nWhile he faces the possibility of almost a year out in total, Murray says if he can return to 95 percent of his best he can still compete for the game’s biggest prizes. \n”The surgeon felt that my hip will be feeling better than it did a year ago,“ Murray said. ”Obviously, I was still doing fine a year ago - I was ranked number one in the world. \n”I‘m certainly not going to be putting in the same amount of tournaments and effort to try to get to number one in the world. \n”I’ll be playing a reduced schedule, and then focusing more on trying to win major events and big tournaments rather than trying to achieve certain ranking goals. \n“So if I can get myself to 95 per cent of my best, I believe that’s enough to compete at the highest level. No question.” \nFormer world number one Boris Becker believes a “100 percent comeback” is possible for Murray, although the German says he might be regretting leaving the surgery so long. \nMurray had hoped to avoid going under the knife, saying it would not necessarily achieve a positive outcome, but finally decided it was his only realistic option because he had been in constant pain for six months. \n“With a good surgery and a good recovery a 100 percent comeback is more than possible,” Becker, who will be working as a Eurosport analyst at the Open, told Reuters. \n”Lleyton Hewitt had it, Tommy Haas had it, just to mention a few who came back and played strong. I just wish that he had done it earlier. \n“Hindsight is always easier. He tried the conservative route but came to the conclusion that the only way back was surgery. If he had done it earlier he could have been back earlier.” Reporting by Martyn Herman, editing by Ed Osmond", "external_links": [], "published": "2018-01-08T15:23:00.000+02:00", "crawled": "2018-01-08T15:41:29.015+02:00", "highlightTitle": ""}