{"organizations": [], "uuid": "0b03531081d152e97da4718fe867a80c8d54fff3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/thyssenkrupp-agm/update-1-investors-intensify-pressure-on-thyssenkrupp-boss-before-agm-idUSL8N1PC450", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Investors intensify pressure on Thyssenkrupp boss before AGM", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:11:00.000+02:00", "replies_count": 0, "uuid": "0b03531081d152e97da4718fe867a80c8d54fff3"}, "author": "", "url": "https://www.reuters.com/article/thyssenkrupp-agm/update-1-investors-intensify-pressure-on-thyssenkrupp-boss-before-agm-idUSL8N1PC450", "ord_in_thread": 0, "title": "UPDATE 1-Investors intensify pressure on Thyssenkrupp boss before AGM", "locations": [], "entities": {"persons": [{"name": "tom käckenhoff", "sentiment": "none"}, {"name": "lars foerberg", "sentiment": "none"}, {"name": "heinrich hiesinger", "sentiment": "none"}, {"name": "cevian", "sentiment": "none"}, {"name": "christoph steitz", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "cevian", "sentiment": "none"}], "organizations": [{"name": "thyssen", "sentiment": "negative"}, {"name": "agm reuters", "sentiment": "none"}, {"name": "halbach foundation", "sentiment": "none"}, {"name": "thyssenkrupp", "sentiment": "none"}, {"name": "alfried krupp von bohlen", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 2:12 PM / Updated 15 minutes ago UPDATE 1-Investors intensify pressure on Thyssenkrupp boss before AGM Reuters Staff \n* Thyssenkrupp AGM scheduled for Jan. 19 \n* Cevian, other shareholders unhappy with complex structure \n* Investors urge group to slim down via spin-offs, listings (Adds shareholder comments) \nBy Christoph Steitz and Tom Käckenhoff \nFRANKFURT, Jan 17 (Reuters) - Shareholders led by activist investor Cevian have renewed calls for structural change at Thyssenkrupp, putting more pressure on Chief Executive Heinrich Hiesinger before the steelmaker’s annual general meeting. \nInvestors have questioned whether producing everything from steel and car parts to submarines and elevators is still the right set-up for Thyssenkrupp, due to hold its AGM on Jan. 19. \n“It’s the root cause of Thyssenkrupp’s underperformance,” Lars Foerberg, co-founder of Cevian, said in response to a Reuters request for comment. \nCevian is Thyssenkrupp’s second-largest shareholder after the Alfried Krupp von Bohlen and Halbach Foundation and holds a stake of about 18 percent. \nSince Hiesinger took the helm seven years ago, Thyssenkrupp sold its loss-making U.S. steel business, significantly lowered its debt pile and invested in new technologies and plants. \nUnder his leadership the company’s shares have lost 18 percent, underperforming an 87-percent rise in the DAX , but have performed more strongly than ArcelorMittal , the world’s biggest steelmaker, whose shares have halved. \n“Management and board need to address the (complex) structure so that each and every business area gets a chance to thrive,” Foerberg said, adding a new structure could be achieved via spinning off or listing businesses or creating joint ventures. \nThyssenkrupp in September reached a deal with India’s Tata Steel to combine their European steel activities, which was welcomed by shareholders and analysts but has not deterred calls for more restructuring. \n“It doesn’t stop with the steel merger. The corporate overhaul has to continue,” Ingo Speich, fund manager at Union Investment, one of Thyssenkrupp’s top 20 shareholders, told German newspaper WAZ. \nHiesinger has so far not given in to calls to spin-off or list divisions such as its thriving elevators business, arguing that all businesses, including the struggling industrial solutions division, can prosper under the corporation’s roof. \nThomas Hechtfischer, managing director of shareholder advisory group DSW, which usually represents 1 percent of Thyssenkrupp’s voting rights at its annual general meeting, disagrees. \n“I am more and more inclined to say that it is not so far-fetched of Cevian to suggest a stock market listing,” he said. “We are missing progress. We are missing a real breakthrough.” (Editing by Arno Schuetze and Jane Merriman)", "external_links": [], "published": "2018-01-17T16:11:00.000+02:00", "crawled": "2018-01-17T16:34:02.000+02:00", "highlightTitle": ""}