{"organizations": [], "uuid": "4577fea6545c239d1cddaec2c2bbf409b2607a71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226341327&w=1200&r=LYNXMPEE0S17K", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain-fcb-pique/pique-unrepentant-over-provocative-espanyol-comments-idUKKBN1FI219", "country": "US", "domain_rank": 408, "title": "Pique unrepentant over provocative Espanyol comments", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:02:00.000+02:00", "replies_count": 0, "uuid": "4577fea6545c239d1cddaec2c2bbf409b2607a71"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain-fcb-pique/pique-unrepentant-over-provocative-espanyol-comments-idUKKBN1FI219", "ord_in_thread": 0, "title": "Pique unrepentant over provocative Espanyol comments", "locations": [], "entities": {"persons": [{"name": "rik sharma", "sentiment": "negative"}, {"name": "pique", "sentiment": "none"}, {"name": "cornella", "sentiment": "none"}, {"name": "gerard pique", "sentiment": "none"}], "locations": [{"name": "la liga", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}], "organizations": [{"name": "espanyol", "sentiment": "negative"}, {"name": "nou camp", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "espanyol de cornella", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 04 PM / Updated 28 minutes ago Pique unrepentant over provocative Espanyol comments Rik Sharma 3 Min Read \nBARCELONA (Reuters) - Gerard Pique says he does not regret his comments mocking Barcelona’s rivals Espanyol after eliminating them from the King’s Cup last week, stoking up the rivalry ahead of another visit to Cornella on Sunday in La Liga. \nBarcelona beat Espanyol 2-0 at the Nou Camp last Thursday to qualify for the semi-finals (2-1 on aggregate) and Pique repeatedly referred to the visitors as “Espanyol de Cornella” when speaking to the media afterwards. \nThe defender was referring to the location of the club’s RCDE Stadium, which is on the outskirts of Cornella, where Espanyol moved in 2009 after playing at the Olympic Stadium in the city of Barcelona. \nEspanyol made a formal complaint about Pique’s comments and the Spanish football federation’s anti-violence committee are investigating the matter. \nHowever, speaking to reporters after signing his new Barcelona contract which keeps him at the club until 2022, Pique played down on his comments. \n“I don’t regret it (making his comments) and I don’t think today’s the day’s the day to talk about it. On Sunday we will play there and in the mixed zone I will give you the headlines if you want,” said Pique. \n“I am not saying this to upset people, I am just stating a fact. Espanyol play in Cornella.” \nPique has never been shy of speaking his mind and previously it may have cost him the chance to be one of Barcelona’s four club captains. \nWith Javier Mascherano’s departure to Hebei Fortune, Pique is expected to be chosen as a replacement for the Argentine. \n”I have always seen myself as a captain,“ added Pique. ”Now I see it differently. I am different in the sense I get involved more with things and make more noise. I understand the dressing room prefers another profile of player. \n“I try to be an example, but everyone has defects and in some respects I am not an example. I am how I am. I think I have improved in some areas, but I will keep being myself.” \nPique’s commitment to the Barcelona cause is never in doubt and the 30-year-old says he would rather retire than play for another club side. \n“It was Barca or nothing. I don’t want to be anywhere else that isn’t here,” Pique explained. “I am not motivated to play for another club. I play football to play for Barca. If I was at another team, I would have retired from football.” Editing by Christian Radnedge", "external_links": [], "published": "2018-01-29T18:02:00.000+02:00", "crawled": "2018-01-29T18:33:40.035+02:00", "highlightTitle": ""}