{"organizations": [], "uuid": "a870f7223d0e9181636525be090bb696b086129d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222214693&w=1200&r=LYNXMPEE0E1CE", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-czech-election-president/openness-or-protection-czechs-choice-echoes-eu-u-s-votes-idUSKBN1F42H0", "country": "US", "domain_rank": 408, "title": "Openness or protection? Czechs' choice echoes EU, U.S. votes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T20:56:00.000+02:00", "replies_count": 0, "uuid": "a870f7223d0e9181636525be090bb696b086129d"}, "author": "", "url": "https://www.reuters.com/article/us-czech-election-president/openness-or-protection-czechs-choice-echoes-eu-u-s-votes-idUSKBN1F42H0", "ord_in_thread": 0, "title": "Openness or protection? Czechs' choice echoes EU, U.S. votes", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "drahos", "sentiment": "none"}, {"name": "jan lopatka", "sentiment": "none"}, {"name": "robert muller", "sentiment": "none"}, {"name": "milos zeman", "sentiment": "none"}, {"name": "jiri drahos", "sentiment": "none"}, {"name": "zeman", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRAGUE (Reuters) - Czechs, like fellow voters from Europe to the United States, must weigh promises of a more outward-looking society against protection from the uncertainties of the global economy and immigration when they elect their president later this month.\nIn the run-off on Jan. 26-27, academic Jiri Drahos will face incumbent political veteran Milos Zeman in a contest that echoes a string of elections in the past two years across the European Union as well as Donald Trump’s battle with Hillary Clinton for the White House.\nZeman - a 73-year-old who has courted the far-right in rejecting migrants from Muslim countries while pursuing warmer relations with Russia and China - won the first round with 38.6 percent of the vote, results showed on Saturday.\nHowever, Drahos finished a solid second on 26.6 percent with support from liberal voters attracted by his policies favoring EU integration. The 68-year-old has also won endorsement from most of the other candidates eliminated in the first round.\nCzech presidents wield limited executive powers but from their office in Prague Castle they appoint prime ministers and represent the nation abroad.\nThey can also influence public opinion at a time when Czech political, economic and social debate shows similarities to that in the United States, France and Austria as well as in fellow post-Communist neighbors Poland, Hungary and Slovakia.\nCzech voters, like others, are split between those who have benefited from European integration and those who fear the impact of globalization and cultural change.\nTomas Klvana, a professor at NYU in Prague, draws parallels between Zeman’s voter appeal and the U.S. president‘s.\n“The pattern is affected by domestic issues but this is similar to Trump, turning to the same voters,” he told Reuters. “On one side there are more successful, better educated, younger people not afraid of opening up, integrating economically... and (on the other) are people who are less successful, less educated, have lower income and live in smaller towns.”\nKlvana also saw similarities between Zeman and two other central European leaders, right-wing Polish party leader Jaroslaw Kaczynski and Hungarian Prime Minister Viktor Orban, who have both picked fights with EU partners.\nPOLITICAL NOVICE Drahos won the first round in the capital Prague, which has grown prosperous since the return to a free-market economy. Zeman won in all other regions, and performed particularly strongly in areas that have struggled since the fall of Communism in 1989.\nDrahos, a soft-spoken political novice and professor of chemistry, offers a direct contrast to Zeman, who has used expletives in live debates, relishes drinking and smokes heavily. In politics since the fall of Communism, Zeman also suffers from diabetes and has difficulty walking.\nThe clash is similar to Austrian President Alexander Van der Bellen’s fight against a far-right opponent in a 2016 presidential vote, Klvana said.\nBeyond the region, French President Emmanuel Macron also offered a liberal vision when he beat far-right candidate Marine Le Pen last year.\nCzech President Milos Zeman attends a news conference, after polling stations closed for the country's direct presidential election, in Prague, the Czech Republic January 13, 2018. REUTERS/Matej Stransky/Pool MIGRATION Zeman has won votes with a tough stance on migration. The ethnically homogenous country of 10.6 million is united against accepting large number of refugees, even though few came in 2015 while hundreds of thousands arrived in neighboring Germany.\nLike Zeman, Drahos opposes EU quotas that would force member states to share asylum seekers but he would accept a limited number seeking shelter if they met certain criteria.\nWhile Drahos lacks Zeman’s charisma among some voters, opinion polls show fewer view the father of two daughters in a negative light than the incumbent.\nDrahos, who comes from a small town on the Slovak border, joined the Czech Academy of Sciences in 1976 but missed out on promotion until the 1989 Velvet Revolution as he refused offers to join the ruling Communist Party.\nThe physical chemist, who plays the piano and has sung in a chamber choir for four decades, eventually chaired the academy from 2009-2017.\nSECOND ROUND MATHS While Drahos trailed Zeman in the first round by 12 percentage points, he immediately won endorsements from five other candidates who collectively won 32.6 percent - making him a slight favorite at betting firms.\n“The aim of Zeman’s team will be to discourage those voters who are not rock-solid from voting for Drahos,” said Marek Vocel, a former campaign leader for Karel Schwarzenberg who lost to Zeman in the last election in 2013. “Migration is a theme that moves almost everybody. I would expect that to feature in the debates.”\nZeman has the backing of the Communists as well as the far-right anti-EU and anti-NATO SPD party.\nOn social media and websites that often carry pro-Russian content, Drahos was accused on Monday of being a weakling who would threaten the country and give in to foreign interests.\nDrahos brushed off allegations that he had informed for the Communist secret police, or worse. “My adversaries are hoping that if they ram down people’s throats that I was an StB collaborator or a pedophile, it will stick with someone. I know Milos Zeman will come with blows below the belt,” he told daily Mlada fronta Dnes in an interview published on Monday.\nZeman has insisted since declaring his candidacy last March that he was not actively campaigning. But he has had a weekly show on a sympathetic TV channel and traveled the country to meet voters, while posters proclaiming “Zeman Again” hang around the country.\nHe refused to face his first round rivals on TV, but has agreed to a debate with Drahos for the run-off.\nDrahos’s biggest declared campaign donations are from self-made businessmen, electronics firm founder Dalibor Dedek and real estate developer Ludek Sekyra, and asset management office BPD Partners. Zeman’s donations include 2 million Czech crowns ($96,000) from a firm owned by arms industry entrepreneur Jaroslav Strnad.\nFormer President Vaclav Klaus, who also holds pro-Russian and anti-EU views, has backed Zeman. After the first round, he thanked Zeman voters for “not bowing to foreign interests”, migration and the related “threat of liquidation of European and Czech culture, traditions and values”.\nWriting by Jan Lopatka, Editing by Michael Kahn and David Stamp\n ", "external_links": [], "published": "2018-01-15T20:56:00.000+02:00", "crawled": "2018-01-15T21:21:25.000+02:00", "highlightTitle": ""}