{"organizations": [], "uuid": "3f69ddbfe7b7a131e3a088f09172dcdb2d69ae2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104974594-GettyImages-911805422.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/more-than-1-million-people-sign-up-for-early-access-to-robinhoods-new-crypto-trading-service.html", "country": "US", "domain_rank": 767, "title": "More than 1 million people sign up for early access to Robinhood's new crypto trading service", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.126, "site_type": "news", "published": "2018-01-29T23:56:00.000+02:00", "replies_count": 0, "uuid": "3f69ddbfe7b7a131e3a088f09172dcdb2d69ae2d"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/29/more-than-1-million-people-sign-up-for-early-access-to-robinhoods-new-crypto-trading-service.html", "ord_in_thread": 0, "title": "More than 1 million people sign up for early access to Robinhood's new crypto trading service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gold More than 1 million people sign up for early access to Robinhood's new crypto trading service Although the service will initially only be available in just five states, four days later more than one million people had indicated they wanted to be notified about \"early access\" to cryptocurrency trading. \"Despite the downturn in price and the fraud in Japan, the interest in the cryptospace remains very high,\" said Tom Lehrkinder, senior analyst at consulting firm Tabb Group. Online stock brokerages have also benefited from the surge of interest in cryptocurrencies. CNBC.com David Paul Morris | Bloomberg | Getty Images Baiju Bhatt, co-founder and co-chief executive officer of Robinhood Financial LLC, speaks during an interview in San Francisco, Jan. 25, 2018. \nIn the latest sign of tremendous interest in cryptocurrencies, more than 1 million people have joined the waitlist for Robinhood Crypto in just four days. \nNo-fee stock trading app Robinhood announced Thursday it was rolling out commission-free trading in digital currencies bitcoin and ethereum beginning in February. Although the service will initially only be available in just five states, within one day after that announcement hundreds of thousands of people had indicated they wanted to be notified about \"early access\" to cryptocurrency trading. \nAround 1 p.m., ET, Monday, that number had more than doubled to 1 million. If all those sign-ups become Robinhood Crypto customers, that will mark an increase of more than 30 percent to the company's overall user base of more than 3 million. \n\"Despite the downturn in price and the fraud in Japan , the interest in the cryptospace remains very high,\" said Tom Lehrkinder, senior analyst at consulting firm Tabb Group. \"More and more [futures commission merchants] are starting to execute and settle the bitcoin futures contracts.\" \nBitcoin's price skyrocketed last year from below $1,000 to above $19,000 as investors piled in, generating demand from institutional investors for futures contracts that launched December on the largest futures exchange, CME, and its competitor, Cboe. Coinbase, the leading U.S. marketplace for major digital currencies, saw its users more than double from fewer than 5 million in late 2016 to more than 13 million by the end of the following year. \nCoinbase did not respond to a CNBC request for comment on Robinhood Crypto's launch. The stock-trading app had nothing to add on Monday's 1 million sign-ups, other than a tweet from co-founder Baiju Bhatt stating the figure. \n\"To me, this speaks to a generational interest in crypto,\" said Blockchain Capital co-founder Bart Stephens. \nAbout one in three millennials preferred bitcoin to stocks in a survey last fall from venture capital firm Blockchain Capital and Harris Poll. And Robinhood said 78 percent of its users fall into that younger age category of 18 to 35-year-olds. \nBut \"what Robinhood's going to find quickly is they're going to jump right into the same growing pains that Coinbase has,\" Stephens said. \nWhile the cryptocurrency exchange reportedly took in more than $1 billion in revenue last year, the company struggled to handle high demand and trading was sometimes unavailable. Coinbase said in a statement it would not comment on the accuracy of the figures. \nRobinhood co-founder Vlad Tenev told CNBC last week he is confident the start-up can handle customer demand. Cryptocurrency trading will also initially be rolled out in just California, Massachusetts, Missouri, Montana and New Hampshire. \n\"I think we're going to be seeing more and more of these on-ramps,\" Stephens said. \"I think this is the beginning of a huge wave embracing this asset class.\" WATCH: Robinhood's CEO on future of stock trading show chapters", "external_links": [], "published": "2018-01-29T23:56:00.000+02:00", "crawled": "2018-01-30T00:05:32.000+02:00", "highlightTitle": ""}