{"organizations": [], "uuid": "59c34849f22ee8a7a4c564dae2d8e7a3c408e45c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/slovenia-banks/swiss-franc-loan-annulled-in-slovenia-because-currency-risks-not-spelt-out-idUSL8N1PE2XG", "country": "US", "domain_rank": 408, "title": "Swiss franc loan annulled in Slovenia because currency risks not spelt out", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T14:34:00.000+02:00", "replies_count": 0, "uuid": "59c34849f22ee8a7a4c564dae2d8e7a3c408e45c"}, "author": "", "url": "https://www.reuters.com/article/slovenia-banks/swiss-franc-loan-annulled-in-slovenia-because-currency-risks-not-spelt-out-idUSL8N1PE2XG", "ord_in_thread": 0, "title": "Swiss franc loan annulled in Slovenia because currency risks not spelt out", "locations": [], "entities": {"persons": [{"name": "robert preininger", "sentiment": "none"}, {"name": "marja novak", "sentiment": "none"}], "locations": [{"name": "slovenia", "sentiment": "none"}, {"name": "ljubljana", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 12:35 PM / Updated 2 hours ago Swiss franc loan annulled in Slovenia because currency risks not spelt out Marja Novak 3 Min Read \nLJUBLJANA, Jan 19 (Reuters) - A court in Slovenia has annulled a real-estate loan in Swiss francs because the borrower was not informed of the high risks of such a currency deal, the borrower’s lawyer said on Friday. \nThe decision puts as much as 524 million euros of loans held by Slovenian banks at risk and may have implications elsewhere in Europe. \nHouseholds and firms in Slovenia and elsewhere in Europe took out loans denominated in Swiss francs, mostly from 2004 to 2008, to benefit from low Swiss interest rates. \nBut their repayment obligations later soared due to a surge in the franc, particularly after Switzerland scrapped its cap on the currency in January 2015. \n“This is a break-through decision. It is the first such decision in Slovenia and one of the first in the European Union,” the lawyer, Robert Preininger, told Reuters. \n“The main reason for such a decision is that banks were aware of high risks and of a possibility of depreciation of the Swiss franc but did not inform consumers of those risks while they expected to profit on that account. That was a very immoral business practice,” he said. \nPreininger declined to give any details about the loan or borrower. \nAccording to the court decision the borrowed has to repay the Slovenian unit of Austrian bank Sparkasse only the amount of loan received without any interest, Preininger said. \nHe said this meant the total repayment will be at least 60 percent lower than it would have been if the loan was not annulled. \nSparkasse told Reuters it has not yet received the decision and gave no further comment. The court -- the appellate High Court in Ljubljana gave no immediate comment. \nThe central Bank of Slovenia told Reuters total outstanding amount of loans in Swiss francs amounted to 524 million euros at the end of May 2017 but gave no comment on the ruling. \nAccording to local media a total of about 20,000 loans denominated in Swiss francs were given to individuals and companies by the Slovenian banks. (Reporting By Marja Novak Editing by Jeremy Gaunt)", "external_links": [], "published": "2018-01-19T14:34:00.000+02:00", "crawled": "2018-01-19T16:23:39.045+02:00", "highlightTitle": ""}