{"organizations": [], "uuid": "40406838702e42580fcd2ce89acd16f34c1e8202", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/21/104232891-GettyImages-632302236.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/21/were-not-going-anywhere-the-2018-womens-marches-show-the-movements-endurance.html", "country": "US", "domain_rank": 767, "title": "“We’re not going anywhere”: the 2018 women’s marches show the movement’s endurance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T19:55:00.000+02:00", "replies_count": 0, "uuid": "40406838702e42580fcd2ce89acd16f34c1e8202"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/21/were-not-going-anywhere-the-2018-womens-marches-show-the-movements-endurance.html", "ord_in_thread": 0, "title": "“We’re not going anywhere”: the 2018 women’s marches show the movement’s endurance", "locations": [], "entities": {"persons": [{"name": "scott williams", "sentiment": "none"}, {"name": "tatjana meyerowitz", "sentiment": "none"}, {"name": "veronica escobar", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "broadway", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "central park west", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "2nd district", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\"Follow the pussygates!\"\nThe shouts came up from a crowd trying to make its way from Broadway to the official route of the 2018 women's march along Central Park West in New York City on Saturday.\nThe pussygates in question were cutout gates decorated with images of cats, held aloft by marchers in a whimsical take on President Trump 's comments on the Access Hollywood tape released in 2016. Other marchers carried cutout eagles bearing the names of women running for office, like Veronica Escobar, running for Congress in Texas's 16th district, and Audri Scott Williams, running in Alabama's 2nd district. The signs were created by a group of artists called We Make America, said Tatjana Meyerowitz, who was helping to hold up one of the gates as it moved toward the march route.\nFollowing the pussygates was no easy task. The street was packed with demonstrators, and making it to the march route a few blocks away was a slow proposition. With more than 120,000 protesters estimated in New York City on Saturday, and more around the world, it was clear that the appetite for change that inspired the women's marches last year remains strong in 2018.\nIn the last year, the Women's March has grown into a broad-based movement, advocating for causes from reproductive freedom to immigrants' rights. It has also experienced divisions, as disagreements about ideology and strategy have led some activists to form their own groups. But what was most on display on Saturday was the endurance of marchers, many of whom had been in the streets a year ago too. Last January, some questioned whether the Women's March organizers and those who followed their lead could sustain the energy they mustered in a single day for an entire presidency. So far, the answer seems to be yes.\nStill marching, one year later \"I'm fed up with this entire administration, and I think it's important for us to press on for changes,\" said Suelita Maki, who had gathered with friends near the fountain at Lincoln Center. Several members of the group had marched last year as well.\nTrump \"cannot continue doing all this stuff and calling other countries you-know-what, without being accountable,\" Maki said, referring to the president's recent comment about immigrants from \"shithole countries .\" The comment was a popular subject for signs at the march.\nA few blocks away, Eunice Kim held a banner simply reading, \"Resist,\" from the Protest Banner Lending Library started by Chicago-based artist Aram Han Sifuentes. \"It's been a year, and we can't be fatigued,\" Kim said. For her, the march was \"a really great way to reinvigorate everyone.\"\n\"As a non-citizen and a new mother, I cannot always go to protests,\" Sifuentes writes on her website. She leads workshops where others — including those who can't attend protests for similar reasons — make banners that are lent out to protesters around the country.\nOther banners bear messages like \"Black Lives Matter,\" \"No Wall,\" and, simply, \"Nope.\" \"The banners carry the histories of the hands that made and hold them, and the places they have and will travel,\" Sifuentes writes.\nRead more from Vox:\nTrump is proposing the \"nuclear option\" on the government shutdown. It makes no sense. \nThe Women's March showed its power on a day Donald Trump's presidency stood still \nSome libertarians cheer when the government shuts down. Here's why they shouldn't \nWomen's marches have been criticized in the past for deemphasizing the concerns of non-citizen women and other marginalized groups — some argued that the Women's March last January focused too much on the responses of white women to the 2016 election, in which 53 percent of white female voters cast their ballots for Trump. This year, the Women's March organizers emphasized their commitment to inclusivity with a statement on Friday cautioning that \"there are many different events this weekend that are associating themselves under the 'Women's March' banner, but not all of them share the national Women's March's commitment to intersectionality.\"\n\"We ask that you look around you when you march this weekend,\" the statement continued. \"Think about why the presence of police checkpoints will make communities of color feel unwelcome. Think about why the lack of an accessible route, stage or event space will make it difficult or impossible for disabled people to attend.\"\nThe creation of a new group, March On, by marchers who felt that women's march protests were not effective in red states, has led to talk of divisions within the movement. The New York City march was not organized by the official Women's March group, but some organizers affiliated with that group were on the ground on Saturday to participate. They had met at the Women's Convention in Detroit in October and decided to start a New York City chapter of the national Women's March organization. Like many members of the group, they plan to spend this year working on voter registration as part of the group's #PowerToThePolls initiative, said Teresa Mayer, one of the organizers.\n\"We're all marching towards the same thing,\" said Audra Heinrichs, another organizer, responding to discussion of divisions within the movement. \"Whatever we want to call ourselves, whatever group we're aligning with, whoever we showed up here with today, it doesn't ultimately matter.\"\n\"We're taking the energy that has been galvanized by the march a year ago and turning it into a strategy and into concrete actions to really effect change,\" said Erycka Montoya, another organizer with the Women's March.\nFor her, the message of the march on Saturday was \"that we're still here, that we're not going anywhere.\"", "external_links": [], "published": "2018-01-21T19:55:00.000+02:00", "crawled": "2018-01-21T21:02:55.000+02:00", "highlightTitle": ""}