{"organizations": [], "uuid": "2b40379e92c1c6f8d40369fbf59097f28b68df75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-iron-horse-acquisition-corp-files-registration-statement-for-initial-public-offering-of-units.html", "country": "US", "domain_rank": 767, "title": "Iron Horse Acquisition Corp. Files Registration Statement for Initial Public Offering of Units", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.061, "site_type": "news", "published": "2018-01-09T16:00:00.000+02:00", "replies_count": 0, "uuid": "2b40379e92c1c6f8d40369fbf59097f28b68df75"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-iron-horse-acquisition-corp-files-registration-statement-for-initial-public-offering-of-units.html", "ord_in_thread": 0, "title": "Iron Horse Acquisition Corp. Files Registration Statement for Initial Public Offering of Units", "locations": [], "entities": {"persons": [{"name": "steven f. mayer", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "iron horse acquisition corp", "sentiment": "negative"}, {"name": "files registration statement for initial public offering of units", "sentiment": "negative"}, {"name": "iron horse acquisition corp.", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "citigroup global markets inc.", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "cerberus iron horse holdings", "sentiment": "none"}, {"name": "cerberus capital management", "sentiment": "none"}, {"name": "goldman sachs & co", "sentiment": "none"}, {"name": "ccm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 9, 2018 /PRNewswire/ -- Iron Horse Acquisition Corp. (\"Iron Horse\" or the \"Company\"), announced today that it has filed a registration statement on Form S-1 with the Securities and Exchange Commission (\"SEC\") relating to the proposed initial public offering of its units. Iron Horse is being sponsored by Cerberus Iron Horse Holdings, LLC, an affiliate of Cerberus Capital Management, L.P. (\"CCM\"), and is founded by CCM, Steven F. Mayer, and certain other senior executives of CCM. The Company expects to offer 50,000,000 units at $10.00 per unit for gross proceeds of $500,000,000. Each unit consists of one Class A ordinary share and one-third of one warrant, each whole warrant entitling the holder thereof to purchase one Class A ordinary share. The Company expects to grant the underwriters a 45-day option to purchase up to an additional 7,500,000 units to cover over-allotments, if any. The Company plans to list its units on the New York Stock Exchange under the symbol \"LOU.U\".\nCitigroup Global Markets Inc. and Goldman Sachs & Co. LLC will act as the joint book-running managers for the offering. A registration statement relating to these securities has been filed with the SEC, but has not yet become effective. These securities may not be sold nor may offers to buy be accepted prior to the time that the registration statement becomes effective. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. The registration statement Iron Horse has filed with the SEC can be obtained by visiting EDGAR on the SEC website at www.sec.gov .\nThe offering will be made only by means of a prospectus. Copies of the preliminary prospectus related to the offering may be obtained, when available, from Citigroup, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, Telephone: (800) 831-9146 or Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, NY 10282, or by telephone toll-free at 1-866-471-2526 or by email at prospectus-ny@ny.email.gs.com .\nAbout Iron Horse Acquisition Corp.\nWe are a newly organized blank check company newly incorporated as a Cayman Islands exempted company for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses. We have not identified any business combination target and we have not, nor has anyone on our behalf, initiated any substantive discussions, directly or indirectly, with respect to identifying any business combination target.\nForward Looking Statements\nThis press release includes forward-looking statements that involve risks and uncertainties. Forward looking statements are statements that are not historical facts. Such forward-looking statements, including the successful consummation of the Company's initial public offering, are subject to risks and uncertainties, which could cause actual results to differ from the forward looking statements. The Company expressly disclaims any obligations or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in the Company's expectations with respect thereto or any change in events, conditions or circumstances on which any statement is based.\nContact\nAndrew Johnson\nGlover Park Group\n646-495-2700\najohnson@gpg.com\nView original content: http://www.prnewswire.com/news-releases/iron-horse-acquisition-corp-files-registration-statement-for-initial-public-offering-of-units-300579634.html\nSOURCE Iron Horse Acquisition Corp.", "external_links": ["http://www.sec.gov/", "http://www.prnewswire.com/news-releases/iron-horse-acquisition-corp-files-registration-statement-for-initial-public-offering-of-units-300579634.html"], "published": "2018-01-09T16:00:00.000+02:00", "crawled": "2018-01-09T17:52:08.038+02:00", "highlightTitle": ""}