{"organizations": [], "uuid": "05999765f0303a2ee505741d9b6896089a5a3a2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104924490-RAW_WATER_1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/unfiltered-fervor-the-rush-to-get-water-off-the-grid.html", "country": "US", "domain_rank": 767, "title": "Unfiltered fervor: The rush to get water off the grid", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T21:55:00.000+02:00", "replies_count": 0, "uuid": "05999765f0303a2ee505741d9b6896089a5a3a2e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/unfiltered-fervor-the-rush-to-get-water-off-the-grid.html", "ord_in_thread": 0, "title": "Unfiltered fervor: The rush to get water off the grid", "locations": [], "entities": {"persons": [{"name": "kevin freeman", "sentiment": "none"}], "locations": [{"name": "mission district", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "west coast", "sentiment": "none"}, {"name": "tourmaline spring", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "novembe", "sentiment": "none"}], "organizations": [{"name": "rainbow grocery", "sentiment": "negative"}, {"name": "zero mass water", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "At Rainbow Grocery, a cooperative in this city's Mission District, one brand of water is so popular that it's often out of stock. But one recent evening, there was a glittering rack of it: glass orbs containing 2.5 gallons of what is billed as \"raw water\" — unfiltered, untreated, unsterilized spring water, $36.99 each and $14.99 per refill, bottled and marketed by a small company called Live Water.\n\"It has a vaguely mild sweetness, a nice smooth mouth feel, nothing that overwhelms the flavor profile,\" said Kevin Freeman, a shift manager at the store. \"Bottled water's controversial. We've curtailed our water selection. But this is totally outside that whole realm.\"\nHere on the West Coast and in other pockets around the country, many people are looking to get off the water grid.\nStart-ups like Live Water in Oregon and Tourmaline Spring in Maine have emerged in the last few years to deliver untreated water on demand. An Arizona company, Zero Mass Water, which installs systems allowing people to collect water directly from the atmosphere around their homes, began taking orders in November from across the United States. It has raised $24 million in venture capital.\nAnd Liquid Eden, a water store that opened in San Diego three years ago, offers a variety of options, including fluoride-free, chlorine-free and a \"mineral electrolyte alkaline\" drinking water that goes for $2.50 a gallon.\nTrisha Kuhlmey, the owner, said the shop sells about 900 gallons of water a day, and sales have doubled every year as the \"water consciousness movement\" grows.\nRead more from the New York Times:\nAmerica's Tap Water: Too Much Contamination, Not Enough Reporting, Study Finds\nSelling Bottled Water That's Better for the Planet\nFiber Is Good for You. Now Scientists May Know Why. \nWhat adherents share is a wariness of tap water, particularly the fluoride added to it and the lead pipes that some of it passes through. They contend that the wrong kind of filtration removes beneficial minerals. Even traditional bottled spring water is treated with ultraviolet light or ozone gas and passed through filters to remove algae. That, they say, kills healthful bacteria — \"probiotics\" in raw-water parlance.\nThe quest for pure water is hardly new; people have been drinking from natural springs and collecting rainwater from time immemorial. The crusade against adding fluoride to public water began in the 1950s among Americans who saw danger in the protective measures that had been adopted over decades to protect the populace from disease and contamination.\nThe New York Times Crooked River, which is primarily fed by the Opal Springs Aquifer, and is the source of the Opal Springs Water Company's unfiltered, untreated, unsterilized spring water, in Culver, Ore., Dec. 4, 2017. But the off-grid water movement has become more than the fringe phenomenon it once was, with sophisticated marketing, cultural cachet, millions of dollars in funding and influential supporters from Silicon Valley.\nOne recent morning in the hills of Berkeley, Calif., Cody Friesen, the founder and chief executive of Zero Mass Water, was inspecting water collection panels he had installed for his investor Skip Battle, a longtime tech leader who now sits on the boards of LinkedIn, Netflix and OpenTable.\nThe system — called Source, which retails for $4,500, including installation — draws moisture from the air (the way rice does in a saltshaker) and filters it, producing about 10 liters of water a day and storing about 60 liters. The goal, Mr. Friesen said, is to make water \"that's ultra high quality and secure, totally disconnected from all infrastructure.\"\n\"Just take a breath of air,\" said Mr. Friesen, a professor of materials science at Arizona State University. \"Take a deep breath. No matter how wealthy or poor you are, you can take a breath and own that air that you breathe. And yet water — the government brings it to you.\"\nMr. Battle's system runs on power from its own small solar panel. It feeds into a tap set up in his stone garden, where he goes to drink. He said he's been making all his meals and drinks with it.\nMr. Battle poured himself a glass. \"The water from the tap just doesn't taste quite as refreshing,\" he said. \"Now is that because I saw it come off the roof, and anything from the roof feels special? Maybe.\"\nThe most prominent proponent of raw water is Doug Evans, a Silicon Valley entrepreneur. After his juicing company, Juicero , collapsed in September, he went on a 10-day cleanse, drinking nothing but Live Water. \"I haven't tasted tap water in a long time,\" he said.\nBefore he could order raw water on demand, Mr. Evans went \"spring hunting\" with friends. This has become more challenging lately: The closest spring around San Francisco has recently been cut off by landslides, so reaching it means crossing private property, which he does under cover of night.\n\"You have to be agile and tactile, and be available to experiment,\" he said. \"Literally, you have to carry bottles of water through the dark.\"\nAt Burning Man, the summer festival in the Nevada desert that attracts the digerati and others, Mr. Evans and his R.V. mate brought 50 gallons of spring water they had collected. \"I'm extreme about health, I know, but I'm not alone with this,\" Mr. Evans said. \"There are a lot of people doing this with me. You never know who you'll run into at the spring.\"\nThe founder of Live Water, Mukhande Singh, started selling spring water from Opal Springs in Culver, Ore., three years ago, but it was a small local operation until this year. Marketing materials show Mr. Singh (né Christopher Sanborn) sitting naked and cross-legged on a hot spring, his long brown hair flowing over his chest.\nPure water can be obtained by using a reverse osmosis filter, the gold standard of home water treatment, but for Mr. Singh, the goal is not pristine water, per se. \"You're going to get 99 percent of the bad stuff out,\" he said. \"But now you have dead water.\"\nHe said \"real water\" should expire after a few months. His does. \"It stays most fresh within one lunar cycle of delivery,\" he said. \"If it sits around too long, it'll turn green. People don't even realize that because all their water's dead, so they never see it turn green.\"\nMr. Singh believes that public water has been poisoned. \"Tap water? You're drinking toilet water with birth control drugs in them,\" he said. \"Chloramine, and on top of that they're putting in fluoride. Call me a conspiracy theorist, but it's a mind-control drug that has no benefit to our dental health.\" (There is no scientific evidence that fluoride is a mind-control drug, but plenty to show that it aids dental health.)\nTalk like Mr. Singh's disturbs Dr. Donald Hensrud, the director of the Healthy Living Program at the Mayo Clinic in Rochester, Minn. What the raw-water partisans see as dangers, he says, are important safety measures.\n\"Without water treatment, there's acute and then chronic risks,\" Dr. Hensrud said, including E. coli bacteria, viruses, parasites and carcinogenic compounds tha", "external_links": [], "published": "2018-01-02T21:55:00.000+02:00", "crawled": "2018-01-02T22:54:30.002+02:00", "highlightTitle": ""}