{"organizations": [], "uuid": "2152e338fdc3c4873cd1c73a895c5d7c68d50177", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224276240&w=1200&r=LYNXMPEE0L22S", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-netflix-results-breakingviews/breakingviews-netflix-cash-flow-hole-is-becoming-a-moat-idUSKBN1FB2YS", "country": "US", "domain_rank": 408, "title": "Breakingviews - Netflix cash-flow hole is becoming a moat", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T05:52:00.000+02:00", "replies_count": 0, "uuid": "2152e338fdc3c4873cd1c73a895c5d7c68d50177"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-netflix-results-breakingviews/breakingviews-netflix-cash-flow-hole-is-becoming-a-moat-idUSKBN1FB2YS", "ord_in_thread": 0, "title": "Breakingviews - Netflix cash-flow hole is becoming a moat", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hulu", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters breakingviews", "sentiment": "negative"}, {"name": "netflix", "sentiment": "negative"}, {"name": "reed hastings", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "ihs markit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK Netflix is pouring money into what is fast becoming a formidable competitive moat. The $95 billion video-streaming service run by Reed Hastings ended 2017 with negative free cash flow of $2 billion, based on figures released on Monday. Even so, it probably has more subscribers than rivals Hulu and Amazon combined. A hefty content budget is a risk, but ensures only the most deep-pocketed media firms can take Netflix on.\nNetflix netted more subscribers in the fourth quarter, bringing its worldwide total to almost 111 million despite a recent price hike. That torrid growth is testament to the first-mover advantage Netflix has, more than a decade after it planted a flag in streaming video. Its domestic U.S. customer base of nearly 53 million dwarfs that of Hulu, the U.S.-only service that earlier this month announced it had 17 million subscribers. Amazon’s active subscriber base, which it doesn’t disclose, is estimated at 44 million by IHS Markit, most of those in the United States.\nAmazon is meanwhile a troubled No. 2. The e-commerce giant’s video product is closely tied to its Prime premium delivery service, so it has been targeting the rights to bigger, commercial movies in the $50 million range, in a shift away from smaller independent films, to attract a wider audience. Amazon still lacks a permanent studio head after Roy Price resigned in October amid sexual-harassment allegations.\nBeyond that, the competition is mind-bogglingly fragmented. Consumers eager to ditch pricey cable packages can choose from an array of pared-down networks such as Dish’s Sling TV or HBO Now. Walt Disney, part-owner of Hulu, is also waking up to the possibility of launching its own so-called over-the-top streaming service. Apple, Facebook and Alphabet’s YouTube are ramping up their efforts too.\nThe more Netflix spends on its library of original content, which includes series like “Stranger Things,” the harder it is for new entrants to compete. That explains its rampant growth, but is also a potential hazard for Hastings’ company if it can’t generate hits. Netflix figures its cash burn could be as much as $4 billion this year. Morgan Stanley figures Netflix won’t be cash-flow positive until 2022 – and the company has committed to some $18 billion of future content costs, against just $300 million of EBITDA for 2017. Netflix’s moat is a defense, so long as it doesn’t become a drain.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-23T05:52:00.000+02:00", "crawled": "2018-01-23T07:19:30.001+02:00", "highlightTitle": ""}