{"organizations": [], "uuid": "49a3ddb0bbc71ecc64b17ede29edc9796f8036fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-buckeye-partners-l-p-prices-400-million-offering-of-6-point-375-percent-junior-subordinated-notes.html", "country": "US", "domain_rank": 767, "title": "Buckeye Partners, L.P. Prices $400 Million Offering of 6.375% Junior Subordinated Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.077, "site_type": "news", "published": "2018-01-19T01:31:00.000+02:00", "replies_count": 0, "uuid": "49a3ddb0bbc71ecc64b17ede29edc9796f8036fd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-buckeye-partners-l-p-prices-400-million-offering-of-6-point-375-percent-junior-subordinated-notes.html", "ord_in_thread": 0, "title": "Buckeye Partners, L.P. Prices $400 Million Offering of 6.375% Junior Subordinated Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "buckeye", "sentiment": "none"}], "organizations": [{"name": "buckeye partners", "sentiment": "negative"}, {"name": "bpl", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Buckeye Partners, L.P. (“Buckeye”) (NYSE:BPL) announced today that it has priced an offering of $400.0 million aggregate principal amount of 6.375% junior subordinated notes due 2078 at 99.474% of par. The notes will bear interest at a fixed rate of 6.375% per year from the date they are issued up to, but not including, January 22, 2023 or an earlier redemption date. The notes will bear interest from, and including, January 22, 2023 up to, but not including, the maturity date at a floating rate based on the Three-Month LIBOR Rate plus 402 basis points, reset quarterly.\nBuckeye expects the offering to close on January 22, 2018, subject to the satisfaction of customary closing conditions. Buckeye expects to receive net proceeds after deducting the underwriting discount and offering expenses in connection with the offering of approximately $394.9 million. Buckeye intends to use the net proceeds from this offering in addition to the net proceeds of the offering of 4.125% senior notes due 2027 (i) to repay borrowings under its revolving credit facility and (ii) for general partnership purposes, which may include, among other things, repayment of indebtedness, acquisitions, capital expenditures and additions to working capital.\nDeutsche Bank Securities Inc. and Wells Fargo Securities, LLC are acting as joint book-running managers of the junior subordinated notes offering.\nThis news release does not constitute an offer to sell or a solicitation of an offer to buy the securities described herein, nor shall there be any sale of these securities in any state or jurisdiction in which such an offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. The offering may be made only by means of a prospectus supplement and accompanying base prospectus.\nCopies of the prospectus supplement and accompanying base prospectus related to this offering may be obtained from: Deutsche Bank Securities Inc., 60 Wall Street, New York, NY 10005-2836 , Attn: Prospectus Group, by email at prospectus.cpdg@db.com , or by telephone at (800) 503-4611 or Wells Fargo Securities, LLC, 608 2nd Avenue South, Suite 1000, Minneapolis, MN 55402, Attn: WFS Customer Service, by email at wfscustomerservice@wellsfargo.com , or by telephone at (800) 645-3751. You may also obtain these documents for free by visiting EDGAR on the SEC’s website at www.sec.gov .\nAbout Buckeye Partners, L.P.\nBuckeye Partners, L.P. (NYSE: BPL) is a publicly traded master limited partnership that owns and operates, or owns a significant interest in, a diversified global network of integrated assets providing midstream logistic solutions, primarily consisting of the transportation, storage, processing and marketing of liquid petroleum products. Buckeye is one of the largest independent liquid petroleum products pipeline operators in the United States in terms of volumes delivered, with approximately 6,000 miles of pipeline. Buckeye also uses its service expertise to operate and/or maintain third-party pipelines and perform certain engineering and construction services for its customers. Buckeye’s global terminal network, including through its interest in VTTI B.V. (“VTTI”), comprises more than 135 liquid petroleum products terminals with aggregate storage capacity of over 173 million barrels across our portfolio of pipelines, inland terminals and marine terminals located primarily in the East Coast, Midwest and Gulf Coast regions of the United States as well as in the Caribbean, Northwest Europe, the Middle East and Southeast Asia. Buckeye’s global network of marine terminals enables it to facilitate global flows of crude oil and refined petroleum products, offering its customers connectivity between supply areas and market centers through some of the world’s most important bulk liquid storage and blending hubs. Buckeye’s flagship marine terminal in The Bahamas, Buckeye Bahamas Hub Limited, is one of the largest marine crude oil and refined petroleum products storage facilities in the world and provides an array of logistics and blending services for the global flow of petroleum products. Buckeye’s Gulf Coast regional hub, Buckeye Texas Partners LLC, offers world-class marine terminalling, storage and processing capabilities. Through its 50% equity interest in VTTI, Buckeye’s global terminal network offers premier storage and marine terminalling services for petroleum product logistics in key international energy hubs. Buckeye is also a wholesale distributor of refined petroleum products in certain areas served by its pipelines and terminals. More information concerning Buckeye can be found at www.buckeye.com .\nThis press release includes forward-looking statements that we believe to be reasonable as of today’s date. Such statements are identified by use of the words “anticipates,” “believes,” “estimates,” “expects,” “intends,” “plans,” “predicts,” “projects,” “should,” and similar expressions. Actual results may differ significantly because of risks and uncertainties that are difficult to predict and that may be beyond our control. Among them are (i) changes in federal, state, local, and foreign laws or regulations to which we are subject, including those governing pipeline tariff rates and those that permit the treatment of us as a partnership for federal income tax purposes, (ii) terrorism and other security risks, including cyber risk, adverse weather conditions, including hurricanes, environmental releases, and natural disasters, (iii) changes in the marketplace for our products or services, such as increased competition, changes in product flows, better energy efficiency, or general reductions in demand, (iv) adverse regional, national, or international economic conditions, adverse capital market conditions, and adverse political developments, (v) shutdowns or interruptions at our pipeline, terminalling, storage, and processing assets or at the source points for the products we transport, store, or sell, (vi) unanticipated capital expenditures in connection with the construction, repair, or replacement of our assets, (vii) volatility in the price of liquid petroleum products, (viii) nonpayment or nonperformance by our customers, (ix) our ability to integrate acquired assets with our existing assets and to realize anticipated cost savings and other efficiencies and benefits, (x) our ability to realize the expected benefits of our investment in VTTI and (xi) our ability to successfully complete our organic growth projects and to realize the anticipated financial benefits. You should read our filings with the U.S. Securities and Exchange Commission, including our Annual Report on Form 10-K for the year ended December 31, 2016, for a more extensive list of factors that could affect results. We undertake no obligation to revise our forward-looking statements to reflect events or circumstances occurring after today’s date except as required by law.\nContact:\nKevin J. Goodwin\nVice President & Treasurer\nirelations@buckeye.com\n(800) 422-2825\nSource:Buckeye Partners L.P.", "external_links": ["https://www.globenewswire.com/Tracker?data=j6Gs6PSlz3VWpVp-3qw7YkGp5Vaj4V--EAn8KGYdF7sNU_GvGNLLUCqWUTHlpj9dVPPHqfctoQp-cJv_MMi9rGvyD1X7SEKegUMe2fsIsSI="], "published": "2018-01-19T01:31:00.000+02:00", "crawled": "2018-01-19T02:35:01.003+02:00", "highlightTitle": ""}