{"organizations": [], "uuid": "24f1972034463eb9084643fbd7d8ffbe8e274a64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224485545&w=1200&r=LYNXMPEE0M135", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-tennis-ausopen-wednesday/giant-killers-chung-and-sandgren-primed-for-big-battle-idUSKBN1FC1U2", "country": "US", "domain_rank": 408, "title": "Giant killers Chung and Sandgren primed for big battle", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-23T22:06:00.000+02:00", "replies_count": 0, "uuid": "24f1972034463eb9084643fbd7d8ffbe8e274a64"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tennis-ausopen-wednesday/giant-killers-chung-and-sandgren-primed-for-big-battle-idUSKBN1FC1U2", "ord_in_thread": 0, "title": "Giant killers Chung and Sandgren primed for big battle", "locations": [], "entities": {"persons": [{"name": "sandgren", "sentiment": "negative"}, {"name": "chung", "sentiment": "negative"}, {"name": "djokovic", "sentiment": "none"}, {"name": "tennys sandgren", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "hyeon", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - The Australian Open will lose one of its giant killers when South Korean Chung Hyeon meets American Tennys Sandgren in an unlikely quarter-final showdown at the Rod Laver Arena on Wednesday.\nChung subjected his boyhood idol to arguably the biggest upset of the year’s first grand slam when he prevailed 7-6(4) 7-5 7-6(3) over six-time champion Novak Djokovic, who was out-gunned by a younger and fitter version of himself on Monday.\nThe bespectacled 21-year-old’s fairytale win made him the first South Korean to reach a grand slam quarter-final, not a mean achievement for someone who took up tennis because doctors said it would improve his failing eyesight.\nChung was not sure if he should consider himself lucky to face world number 97 Sandgren, whom he beat in their only previous meeting in Auckland earlier this month.\n“Maybe yes, maybe not, because he beat every good player. I‘m just focused for tomorrow,” he said after beating Djokovic.\nChung is naturally cautious about taking on the American journeyman who, like the Korean, finds himself in unknown territory after overcoming fifth seed Dominic Thiem in a five-set thriller on Monday.\nTennis - Australian Open - Hisense Arena, Melbourne, Australia, January 22, 2018. Tennys Sandgren of the U.S. in action during his match against Austria's Dominic Thiem. REUTERS/Toru Hanai Sandgren failed to win a match in his two previous main draw appearances at grand slams before arriving at Melbourne Park and he attributes the turnaround to his round of 32 defeat to Chung in Auckland.\n“I think a big deal was playing Chung in Auckland,” said the Tennessee native, only the second debutant to reach the Australian Open quarter-finals in 20 years.\n”I think that helped me a lot going into this week, seeing I could play a good level.\n“Being able to play a good level like that made me feel like, okay, maybe I can do it in three-out-of-five sets, on a bigger stage, against other players, too, maybe not just one time, maybe I am somewhere around there.”\nIn the nightcap, defending champion Roger Federer will take on Tomas Berdych in a quarter-final rematch of last year’s third round contest, which the Swiss maestro won in straight sets.\n“I‘m looking forward to playing him. He seems in good shape, and I‘m happy he’s over his back issues that he also had at the end of last year. That’s a good thing,” Federer said.\nElsewhere, women’s top seed Simona Halep takes on sixth seeded Karolina Pliskova, while Angelique Kerber will face American Madison Keys in the German’s first grand slam quarter-final since 2016 on Rod Laver Arena.\nReporting by Amlan Chakraborty in New Delhi; Editing by John O'Brien\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T22:06:00.000+02:00", "crawled": "2018-01-24T15:14:55.008+02:00", "highlightTitle": ""}