{"organizations": [], "uuid": "8444033b7d0fd79c47f7b28600590104004eae27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-rising-private-equity-investment-fuels-surging-us-oil-and-gas-production-ma-activity.html", "country": "US", "domain_rank": 767, "title": "Rising Private Equity Investment Fuels Surging US Oil and Gas Production, M&A Activity", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "8444033b7d0fd79c47f7b28600590104004eae27"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-rising-private-equity-investment-fuels-surging-us-oil-and-gas-production-ma-activity.html", "ord_in_thread": 0, "title": "Rising Private Equity Investment Fuels Surging US Oil and Gas Production, M&A Activity", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Private equity (PE) firms made equity commitments of $12.4 billion to 73 new upstream US oil and gas companies in 2017, a 32% increase from the $9.4 billion contributed in 2016, according to analysis from oil and gas research provider 1Derrick. The 2017 start-ups bring the number of active PE-sponsored oil and gas producers to nearly 375. This PE investment together with equity and debt markets have provided capital to fuel the US oil and gas production surge. US oil output, is forecast to surpass 10 million barrels per day in 2018, and Lower-48 natural gas production, reached an all-time high of 77 Bcf/d at year-end 2017.\nPE-backed firms have also played a growing role in the upstream M&A market, participating in almost $15 billion each in both acquisitions and divestitures in 2017. After joining in less than $5 billion in upstream transactions in 2008-2012, PE-sponsored firms have made over $50 billion in purchases in the next 5 years through 2017, including $28 billion in the last two years. In 2017, these E&P companies were involved as buyers or sellers in 15 of the 20 largest US upstream deals. These deals included Parsley Energy acquiring Midland basin acreage from Double Eagle Energy Permian, Anadarko divesting Eagle Ford assets to Sanchez and Gavilan Resources and Silver Run II acquiring Alta Mesa Holdings. PE-backed firms are also likely to impact 2018 transaction activity, as only 23 of the 73 new producers funded in 2017 have made significant acquisitions to date. Unallocated equity commitments announced in last two years stand at almost $10 billion.\nThe plunge in oil prices that started in 2014 and lasted through mid-2016 produced favorable asset valuations and a few distressed asset sellers, a major trigger for the recent wave of private equity investment, according to Mangesh Hirve, COO of 1Derrick. He added, “Other key factors included the tightening of public markets and debt capital markets, and technological innovations that slashed drilling and operating costs and boosted well production. These investments were heavily concentrated on a handful of premium resource plays, especially the Permian Basin .Also, at the same time, dozens of PE-funded firms were also able to monetize their holdings at attractive multiples in a surge of M&A activity beginning mid-2016. More recently, rising commodity prices have expanded opportunities to include significant assets in other plays that were shed by major E&P firms as they core up their portfolios.”\n1Derrick’s data reflects the heavy initial concentration of investment in the Permian, which remains a target of approximately 150 of the nearly 375 active companies tracked in their Private Equity Database, and the SCOOP, STACK, and related plays in the Anadarko Basin, which is the focus of 65 companies. Permian ($7.5 billion) and Anadarko ($4 billion) basins accounted for 75% of the PE-backed divestitures in 2017.\nThe scramble for Permian assets cooled off after Q1 2017. Only one of the 20 significant 2017 PE-backed acquisitions targeted the Permian and two involved properties in the SCOOP/STACK. These totaled just $800 million. The Eagle Ford Shale topped the expanded list of target plays with $4.4 billion in five acquisitions. Conventional oil and gas transactions included the $2.7 billion purchase in the San Juan Basin by an entity funded by the Carlyle Group. Three deals were transacted in the Williston Basin’s Bakken Shale, one in the Marcellus Shale, two in the Niobrara Shale, and one in the Haynesville. Notably, the sellers in 17 of the 20 deals were major public E&P firms, including ConocoPhillips, Anadarko Petroleum, Noble Energy, Encana, Pioneer Natural Resources, SM Energy, and Cabot Oil & Gas.\n1Derrick’s Mangesh Hirve expects the level of PE-equity commitments and M&A activity to continue to grow in 2018. “Crude oil, natural gas liquids, and natural gas production is continuing to rise to meet growing demand from both domestic and export markets. Private equity investors that have reaped substantial returns from their investments in upstream companies are highly likely to continue to reinvest in the industry. 1Derrick will continue to track this activity through our comprehensive, proprietary Private Equity Database as well as our industry-leading Global M&A Database.”\n1Derrick ( www.1derrick.com ) is an independent oil and gas research firm with offices in Houston, Dallas, New York, London, Singapore and Bangalore. For more information on its industry leading databases and reports on M&A, business development strategy, new ventures, and exploration, please contact Ajit Thomas at Ajit.Thomas@1Derrick.com or 1.646.284.8661.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005828/en/\n1Derrick\nAjit Thomas, 646-284-8661\nAjit.Thomas@1Derrick.com\nSource: 1Derrick", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.1derrick.com&esheet=51747441&newsitemid=20180123005828&lan=en-US&anchor=www.1derrick.com&index=1&md5=ce3b8ab288fac334b86781034b847256", "http://www.businesswire.com/news/home/20180123005828/en/"], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T18:23:16.003+02:00", "highlightTitle": ""}