{"organizations": [], "uuid": "4b6884b7ce21cb75adba609d0edad55765a40867", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-two-lawyers-at-texas-based-roberts-markel-weinberg-butler-hailey-named-shareholders.html", "country": "US", "domain_rank": 767, "title": "Two Lawyers at Texas-based Roberts Markel Weinberg Butler Hailey Named Shareholders", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.991, "site_type": "news", "published": "2018-01-22T23:12:00.000+02:00", "replies_count": 0, "uuid": "4b6884b7ce21cb75adba609d0edad55765a40867"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-two-lawyers-at-texas-based-roberts-markel-weinberg-butler-hailey-named-shareholders.html", "ord_in_thread": 0, "title": "Two Lawyers at Texas-based Roberts Markel Weinberg Butler Hailey Named Shareholders", "locations": [], "entities": {"persons": [{"name": "roberts markel weinberg butler hailey", "sentiment": "negative"}, {"name": "frank carroll iii", "sentiment": "none"}, {"name": "carroll", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "mark rabe", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "roberts markel weinberg butler hailey pc", "sentiment": "negative"}, {"name": "university of houston law center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Texas law firm Roberts Markel Weinberg Butler Hailey PC is pleased to announce that Houston trial and appellate lawyer Frank Carroll III and Austin trial lawyer Mark Rabe have been promoted to shareholder. Mr. Carroll has been named head of the firm's appellate law group.\nMr. Carroll represents corporations and individuals in disputes ranging from catastrophic personal injury to complex commercial litigation. He is the editor-in-chief of TexAppBlog.com , an appellate blog for non-appellate lawyers, and hosts the podcast Two-Minute Trial Lawyer.\nMr. Carroll has tried nearly two dozen cases to verdict, including obtaining a defense verdict in a $30 million personal injury case and a seven-figure recovery in a real estate dispute. He has also prosecuted over 50 appeals, ranging from oil and gas to defining the bounds of new technologies such as Airbnb.\nA graduate of the University of Houston Law Center, Mr. Carroll is one of the school's winningest advocates in interscholastic competitions. He is a certified Texas mediator. He earned a B.A. from the University of California at San Diego.\nMr. Rabe represents clients in disputes including construction contracts, employment, insurance, property tax challenges, homeowners association issues, real estate transactions and professional malpractice. He concentrates his practice in the Texas Hill Country and South Texas.\nAlso engaged in the firm's corporate practice, he handles complex issues affecting restaurants and is involved in the Greater Austin Restaurant Association. The firm provides a robust range of services to restaurateurs including business creation and governance, real estate leasing, and purchase and employment guidance.\nMr. Rabe earned his law degree from the University of Houston Law Center and a B.A. from UH. He is a U.S. Army veteran and served as a paratrooper in both the 82 nd Airborne Division and 525 th Military Intelligence Brigade.\nAbout the Firm\nRoberts Markel Weinberg Butler Hailey PC is committed to providing an enhanced level of service to clients seeking counsel in professional liability, directors and officers litigation, fiduciary litigation, commercial disputes, labor and employment, appeals, community association law, wills probate and trusts and corporate and real estate transactions. The firm has offices in Houston, Austin, Dallas, San Antonio and Fort Bend County. To learn more, please visit http://www.rmwbhlaw.com/ .\nContact Information\nKit Frieden\n800-559-4534\nkit@androvett.com\n releases/two-lawyers-at-texas-based-roberts-markel-weinberg-butler-hailey-named-shareholders-300586133.html\nSOURCE Roberts Markel Weinberg Butler Hailey PC", "external_links": ["http://www.rmwbhlaw.com/", "http://www.prnewswire.com/news-releases/two-lawyers-at-texas-based-roberts-markel-weinberg-butler-hailey-named-shareholders-300586133.html"], "published": "2018-01-22T23:12:00.000+02:00", "crawled": "2018-01-23T02:17:08.049+02:00", "highlightTitle": ""}