{"organizations": [], "uuid": "d170daaee000e68ded944e7cbc9b8f758519d772", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/16/104656842-GettyImages-828260770-retail-shopping.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/10/what-to-buy-every-month-of-the-year-in-2018.html", "country": "US", "domain_rank": 767, "title": "What to buy every month of the year in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-10T23:40:00.000+02:00", "replies_count": 0, "uuid": "d170daaee000e68ded944e7cbc9b8f758519d772"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/10/what-to-buy-every-month-of-the-year-in-2018.html", "ord_in_thread": 0, "title": "What to buy every month of the year in 2018", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In 2018, you may resolve to save more , spend less or budget better. Whatever your money goal, the one common key to your success is shopping smart. That means knowing the best time to buy just about anything.\nTo help you out, we've created a purchase calendar so you can plan your shopping for the year.\nMore From NerdWallet:\nHow to save money: Daily, monthly and long term\nHow to create a budget\nWhat to buy (and skip) in January\nJanuary With a fresh page on the calendar comes a fresh start for sales. These products are discounted in January :\nBedding and linens: Department stores hold bedding and linen \"white sales\" in January with deep discounts on sheets and towels Fitness equipment: Retailers know you want to get in shape. Expect fitness equipment and apparel sales to abound at sporting goods stores. TVs and electronics: Just before the Super Bowl, retailers normally discount their selections of HDTVs and other home-theater essentials February It's the month of love and gift-giving, but February might be a better time to buy major items for yourself than trinkets for your loved one. Options include:\nTVs. TV sales spill over from January into February. Aside from Black Friday, this is one of the prime times to buy a new TV. Winter products: With winter winding down, stores will be looking to unload their inventories of cold-weather products. Look for sales on apparel and winter sporting accessories. Home goods: Presidents Day is Feb. 19 this year. Expect retailers to have home and apparel sales on that Monday and the weekend preceding the holiday show chapters Why the co-founders of Siri first turned down a buyout offer from Steve Jobs 1:27 PM ET Fri, 9 June 2017 | 01:38 March There aren't any major shopping holidays in March, but that doesn't mean sales are lacking. Look for sales on these products:\nGolf clubs: Expect to find discounts on golf clubs in preparation for summer. Whenever consumer demand is down, prices usually are, too. Grills: Buy your summer grilling necessities in March to avoid the spike in prices that will come when summer arrives St. Patrick's Day essentials: St. Patrick's Day is March 17. Around that time, online retailers and department stores usually discount their selection of green-themed clothing, party supplies and jewelry. April April has its fair share of spring deals and discounts, including:\nVacuums: Buying a vacuum isn't the most exciting purchase, but it'll be less painful if you take advantage of a spring cleaning sale. Look for these at department stores as well as manufacturers like Dyson. Jewelry: The general rule is to avoid buying jewelry close to major holidays. Try to get a good deal when jewelers have a slower period and may be more motivated to make sales. Freebies: Year after year, retailers and restaurants try to lighten the burden of tax day with discounts and freebies. Keep an eye out for these around mid-April. Tax day this year is April 17. May April showers bring May flowers — and sales blossom then, too. Here's a look at some products to consider buying this month:\nSpring cleaning necessities: Before summer arrives, act on spring cleaning discounts on vacuums and mops Small kitchen appliances: Use May discounts as a perfect opportunity to buy small kitchen appliances, such as coffee makers and blenders. These products normally are included in Memorial Day sales. Furniture: Three of the biggest blowout shopping days are Black Friday, Labor Day and Memorial Day. This year, Memorial Day is May 28. Look for plenty of furniture and home-decor discounts from big-box stores. June June may be one of the shorter months of the year, but its supply of shopping events isn't lacking. Smart purchases include these products:\nLingerie: Stock up on undergarments in June. That's when Victoria's Secret has been known to host its famed Semi-Annual Sale. The sale usually occurs in December also. Gym memberships: Consider buying a gym membership during the summer, and don't forget to negotiate to get the best possible deal. Gyms may be more eager for sign-ups at this time. Gifts for Dad: You don't have to buy dad's gift at full price. Expect Father's Day deals this month, especially the closer you get to the holiday on June 17. show chapters Here's how far $300,000 will get you in these states 1:50 PM ET Fri, 12 May 2017 | 00:49 July The temperature usually rises in July, but the prices of certain products drop. Consider buying these items this month:\nApparel: If you don't want to wait for end-of-summer sales, buy clothes in midsummer. You'll likely find a better price than you would at the start of the season. Patriotic items: Retailers like a reason to celebrate. In the days leading up to the Fourth of July, there is usually an abundance of sales on red, white and blue products (and products that are all three colors), as well as on sporting goods, jewelry and furniture. Personal electronics: Black Friday is a big deal day that falls in November, but many retailers have begun hosting Black Friday in July sales, including Best Buy and Amazon. Expect discounts in nearly every product category. August Close out summer by buying summer products? That's right. Look for end-of-season clearance sales in August:\nBack-to-school supplies: The start of school marks the need to buy small items such as pencils and expensive ones like laptops. Generally, the closer to the start of the school year you buy, the better your chances of getting a good price. Lawn mowers: Ride out the end of summer with a big deal on lawn mowers and other seasonal outdoor equipment Swimsuits: There may not be many swimming days left by the time August rolls around, but that's exactly why swimsuit clearance sales will crest. Buy your swimsuits now to stock up for next year. September With deals on items as varied as electronics and back-to-school supplies, September is a surprising month for good buys. Pick up reasonable prices in these departments:\nMattresses: Year after year, September is the time for mattress sales. Expect these from department stores and mattress centers, usually as a part of Labor Day deals. iPhones: Apple has been known to announce its new iPhone installments at the company's annual keynote in September. Usually, the unveiling is followed by a drop in prices on the current phones in anticipation of the new models. Appliances: This year, Labor Day falls on Sept. 3. Expect a series of blowout deals in the week leading up to the holiday, including promotions on appliances big and small. October Don't let the cost of shopping spook you during the Halloween season. There will be plenty of deals on these product categories in October:\nOutdoor furniture: People generally spend less time outdoors when the temperature drops. Expect deals on patio furniture and outdoor living products when summer ends. Jeans: Fall inventory arrives in stores in August and September, but you'll pay top dollar unless you wait a few weeks. October is a great time to buy a new pair of jeans. Candy: The closer you get to Oct. 31, the better your chance at snagging a discounted bag of candy for your trick-or-treaters. show chapters Here's what $1.3 million can buy you in real estate in the U.S.'s biggest metropolitan areas 7:51 PM ET Fri, 7 Ap", "external_links": ["https://www.nerdwallet.com/blog/how-to-save-money/?utm_campaign=ct_prod&utm_source=syndication&utm_medium=wire&utm_term=cnbc&utm_content=477196", "https://www.nerdwallet.com/blog/finance/how-to-build-a-budget/?utm_campaign=ct_prod&utm_source=syndication&utm_medium=wire&utm_term=cnbc&utm_content=477196", "https://www.nerdwallet.com/blog/shopping/buy-skip-january/?utm_campaign=ct_prod&utm_source=syndication&utm_medium=wire&utm_term=cnbc&utm_content=477196", "https://www.facebook.com/CNBCMakeIt/", "https://www.nerdwallet.com/article/buy-every-month-year-2018/"], "published": "2018-01-10T23:40:00.000+02:00", "crawled": "2018-01-10T23:14:58.003+02:00", "highlightTitle": ""}