{"organizations": [], "uuid": "4bdf8196212ddc16bcb4e49aaca82432e6b00139", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223390568&w=1200&r=LYNXMPEE0I0T9", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-southsudan-war/u-n-warns-of-lost-generation-in-south-sudans-grinding-conflict-idUKKBN1F81GE", "country": "US", "domain_rank": 408, "title": "U.N. warns of 'lost generation' in South Sudan's grinding conflict", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T19:28:00.000+02:00", "replies_count": 0, "uuid": "4bdf8196212ddc16bcb4e49aaca82432e6b00139"}, "author": "", "url": "https://uk.reuters.com/article/uk-southsudan-war/u-n-warns-of-lost-generation-in-south-sudans-grinding-conflict-idUKKBN1F81GE", "ord_in_thread": 0, "title": "U.N. warns of 'lost generation' in South Sudan's grinding conflict", "locations": [], "entities": {"persons": [{"name": "salva kiir", "sentiment": "none"}, {"name": "henrietta h. fore", "sentiment": "none"}, {"name": "riek machar", "sentiment": "none"}, {"name": "fore", "sentiment": "none"}], "locations": [{"name": "south sudan", "sentiment": "none"}, {"name": "sudan", "sentiment": "none"}], "organizations": [{"name": "u.n.", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "unicef", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:10 PM / Updated 44 minutes ago U.N. warns of 'lost generation' in South Sudan's grinding conflict Reuters Staff 3 Min Read \nJUBA (Reuters) - Seventy percent of South Sudan’s children are out of school and the young country risks losing a generation that would make it harder to rebuild after conflict ends, a United Nations official said. \nSouth Sudan, which split off from its northern neighbour Sudan in 2011, has been gripped by a four-year civil war sparked by political rivalry between incumbent leader Salva Kiir and his former deputy Riek Machar. \nIn an interview with Reuters on Friday, Henrietta H. Fore, UNICEF’s executive director, made the warning after visiting some of the areas most devastated by the war. \n“70 percent of the children are out of school, that is highest in the world. There is too much violence,” she said. \n“If we don’t help... we are going to lose this generation and that would be tragic for South Sudan because a country cannot build itself without this next generation of young people.” \nFore said she had visited towns in the country’s north and witnessed widespread malnutrition among children and warned: “We are heading into the dry season... we might lose up to a quarter of a million children in South Sudan.” \nTens of thousands are estimated to have died in the conflict which has also displaced a quarter of the country’s population of 12 million. FILE PHOTO - South Sudan's opposition leader Riek Machar speaks during a briefing ahead of his return to South Sudan as vice president, in Ethiopia's capital Addis Ababa April 9, 2016. REUTERS/Tiksa Negeri \nThe economy, almost entirely dependant on oil exports, has been left in tatters as output has been cut. \nAgricultural production, too, has declined as insecurity has left sometimes entire villages abandoned and crops untended. \nA ceasefire deal was signed in Ethiopia’s capital Addis Ababa last month but it has been violated repeatedly with both sides blaming each other. \nAttacks have also been directed at humanitarian workers, complicating delivery of relief services on which hundreds of thousands of the displaced depend. \nSome 28 aid workers were killed in South Sudan last year, with nine shot dead in November alone, according to the United Nations. \nSouth Sudan’s Cabinet Affairs minister Martin Elia Lomuro warned non-governmental organisations (NGOs) against reporting on alleged ceasefire violations. \nHe told reporters in Juba some NGOs had “taken as part of their job to report on military issues including violations, ambushes and misleading (the) international Community.” \n“We want to warn you severely,” he said, adding monitoring such violations should be left to international monitors. Reporting by Denis Dumo; Writing by Elias Biryabarema; Editing by Toby Chopra", "external_links": [], "published": "2018-01-19T19:28:00.000+02:00", "crawled": "2018-01-19T20:12:28.008+02:00", "highlightTitle": ""}