{"organizations": [], "uuid": "c474de7568d0e8ba462f41988ce8c832ebb31cac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/12/104215246-GettyImages-628070984.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/21/amazon-go-automated-grocery-store-is-poised-to-launch.html", "country": "US", "domain_rank": 767, "title": "Amazon Go automated grocery store is poised to launch", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.163, "site_type": "news", "published": "2018-01-21T17:01:00.000+02:00", "replies_count": 0, "uuid": "c474de7568d0e8ba462f41988ce8c832ebb31cac"}, "author": "Deirdre Bosa", "url": "https://www.cnbc.com/2018/01/21/amazon-go-automated-grocery-store-is-poised-to-launch.html", "ord_in_thread": 0, "title": "Amazon Go automated grocery store is poised to launch", "locations": [], "entities": {"persons": [{"name": "david ryder", "sentiment": "negative"}], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "amazon", "sentiment": "none"}, {"name": "amazon go", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "After nearly a year's delay, Amazon Go is finally opening to the public on Monday morning.\nAmazon 's first automated grocery store promises \"no lines, no checkouts, no registers\" — and it could be a game-changer for the grocery and retail industry.\nIt'll test whether the technology can deliver after reports that the automated check-out technology wasn't working as planned early in 2017. It will raise questions of job creation and destruction by the e-commerce giant, and it'll test whether consumers will warm to an omnichannel, technologically advanced retail experience.\nThe single 1,800 square foot located in the middle of Amazon's Seattle campus was first unveiled in late 2016, and was supposed to open to the public in early 2017, according to the website.\nYet until now, it has remained in beta mode for Amazon employees only, reportedly due to the very thing that makes it so interesting: Technology that eliminates the cashier.\nAmazon calls it \"Just Walk Out\" technology and it uses computer vision, deep learning algorithms and sensor fusion — many of the same advances being used to develop autonomous driving.\nJason Redmond | Reuters Amazon employees are pictured outside the Amazon Go brick-and-mortar grocery store without lines or checkout counters, in Seattle Washington, U.S. December 5, 2016. For customers, it's simple: Scan your Amazon Go app as you walk into the store, pick up whatever you want, and simply walk out.\nOn the back-end, Amazon's technology detects everything you're taking or returning to shelves, and keeping track in a virtual shopping cart. When you walk out, Amazon charges your account and sends a receipt.\nFor now, Amazon is testing the concept on a limited basis and has no plans to implement the technology in Whole Foods. But an expansion of Amazon's grocery technology could have enormous implications.\nAccording to the Department of Labor, more than 3.5 million Americans held cashier jobs as of May 2016. Nearly 900,000 of those were in grocery stores. The Amazon Go store eliminates the need for cashiers, and could thus make thousands of jobs redundant. Amazon Go does hire people to work in the store -- a team of \"associates\" who prep ingredients, make prepared items, greet customers and stock shelves.\nStill, it could prove a tricky subject, given the current administration's focus on creating jobs in America and President Donald Trump's contentious relationship with Jeff Bezos .\nIn e-commerce, Amazon has already been investing heavily in automation, running the gamut from delivery drones to warehouse robots. At the same time, it's been hiring thousands of new employees each year, growing headcount by 40 percent year over year.\nWith its purchase of Whole Foods last year for nearly $14 billion, it became the second biggest private employer in the country behind Walmart. However, an analysis published by Quartz last year looked at employment data for the retail industry as a whole and found that Amazon's growth and hiring numbers don't offset the overall retail job losses that it has helped cause.", "external_links": [], "published": "2018-01-21T17:01:00.000+02:00", "crawled": "2018-01-21T17:01:22.011+02:00", "highlightTitle": ""}