{"organizations": [], "uuid": "a8640360f170a574b20dffaa198adfba9cba4f5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/579454696.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/black-panther-advance-ticket-sales-marvel-record/", "country": "US", "domain_rank": 1196, "title": "Marvel's 'Black Panther' Set a Ticket Pre-Sales Record | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.904, "site_type": "news", "published": "2018-01-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "a8640360f170a574b20dffaa198adfba9cba4f5c"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/10/black-panther-advance-ticket-sales-marvel-record/", "ord_in_thread": 0, "title": "Marvel's 'Black Panther' Set a Ticket Pre-Sales Record | Fortune", "locations": [], "entities": {"persons": [{"name": "tom huddleston jr.", "sentiment": "negative"}, {"name": "michael b. jordan", "sentiment": "none"}, {"name": "ryan coogler", "sentiment": "none"}, {"name": "king t’challa", "sentiment": "none"}, {"name": "chadwick boseman", "sentiment": "none"}, {"name": "angela ba", "sentiment": "none"}, {"name": "lupita nyong", "sentiment": "none"}], "locations": [], "organizations": [{"name": "walt disney", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. January 10, 2018 \nMarvel fans are excited for the studio’s Black Panther movie. The film, which hits theaters next month, set a record for the best first-day advance ticket sales for any Marvel movie, according to the website Fandango. \nThe movie ticket sales site said on Wednesday that pre-sale tickets for Black Panther outpaced the first-day advance sales of 2016’s Captain America: Civil War , which previously had the best first day of pre-sales for a movie from Walt Disney’s Marvel Cinematic Universe. Tickets for Black Panther officially went on sale earlier this week for the highly-anticipated film that will be released worldwide on Feb. 16. \nBlack Panther is the first standalone film to focus on the titular character, the superhero alias of King T’Challa of the fictional country Wakanda, portrayed by actor Chadwick Boseman. The character first appeared onscreen in Civil War last year, and the new film is already generating loads of buzz thanks to director Ryan Coogler ( Creed ) and a loaded cast that also includes Lupita Nyong’o, Michael B. Jordan, and Angela Bassett. Earlier this week, Disney and Marvel also debuted a new trailer for Black Panther , featuring music from rapper Kendrick Lamar, which aired during the College Football Playoff National Championship . \nAlso on Wednesday, the actress Nyong’o posted a video to her Instagram account in which she hyped Black Panther ‘s pre-sales record and even said she’d had difficulty securing tickets for herself. A post shared by Lupita Nyong'o (@lupitanyongo) on Jan 10, 2018 at 9:03am PST \nGet Data Sheet , Fortune’s technology newsletter. \nWhile Fandango did not release specific figures for Black Panther ‘s first day of advance ticket sales, the film’s fast start should put it on the path toward a blockbuster box-office debut next month. For instance, last year, Civil War posted a massive $179 million domestic opening weekend on its way to $1.15 billion in worldwide ticket sales overall. If Black Panther ‘s own debut and total box-office haul can match its predecessor, the new movie would be among the highest-grossing Marvel films ever. According to Box Office Mojo , 2012’s The Avengers is the top-grossing Marvel film of all-time ($1.5 billion globally), and Disney will also release the third Avengers film, Avengers: Infinity War (which will also feature the Black Panther character along with many other Marvel superheroes), in May 2018. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-05T02:00:00.000+02:00", "crawled": "2018-01-11T01:50:16.000+02:00", "highlightTitle": ""}