{"organizations": [], "uuid": "b065cabee5a5e4e7199b7d4a0d4d8cc6dd63dde3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219332168&w=1200&r=LYNXMPEE030VI", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain/atletico-lifted-by-return-of-costa-as-la-liga-campaign-resumes-idUKKBN1ET1LD", "country": "US", "domain_rank": 408, "title": "Atletico lifted by return of Costa as La Liga campaign resumes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:14:00.000+02:00", "replies_count": 0, "uuid": "b065cabee5a5e4e7199b7d4a0d4d8cc6dd63dde3"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain/atletico-lifted-by-return-of-costa-as-la-liga-campaign-resumes-idUKKBN1ET1LD", "ord_in_thread": 0, "title": "Atletico lifted by return of Costa as La Liga campaign resumes", "locations": [], "entities": {"persons": [{"name": "la liga cam", "sentiment": "negative"}, {"name": "la liga", "sentiment": "negative"}, {"name": "lleida esportiu", "sentiment": "none"}, {"name": "kevin gameiro", "sentiment": "none"}, {"name": "diego costa", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "richard martin", "sentiment": "none"}, {"name": "antoine griezmann", "sentiment": "none"}, {"name": "reuters/susana vera  atletico", "sentiment": "none"}, {"name": "angel correa", "sentiment": "none"}], "locations": [{"name": "costa", "sentiment": "none"}, {"name": "la liga", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "getafe", "sentiment": "none"}, {"name": "wanda metropolitano", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "atletico", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  barcelona", "sentiment": "none"}, {"name": "atletico madrid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 18 PM / Updated 11 minutes ago Atletico lifted by return of Costa as La Liga campaign resumes Richard Martin 3 Min Read \nBARCELONA (Reuters) - Diego Costa has already given Atletico Madrid a reminder of what they have missed since he left for Chelsea and the striker will be looking to breathe new life into his side’s blunt strikeforce when he is unleashed against Getafe in La Liga on Saturday. FILE PHOTO - Atletico Madrid's soccer player Diego Costa listens to a reporter's question at Wanda Metropolitano stadium in Madrid, Spain, December 31, 2017. REUTERS/Susana Vera \nAtletico may be second in the standings but they have badly missed Costa’s energy and determination as their forwards have all underperformed: talisman Antoine Griezmann has only scored five league goals while Kevin Gameiro and Angel Correa have struggled for consistency. \nCosta needed only five minutes as a substitute against Lleida Esportiu in the King’s Cup on Wednesday to make an impact on his return to Atletico, scoring the third goal in a 4-0 thrashing and giving his side some badly needed aggression and pace in attack. \nThe Spain international, who rejoined the club for $77 million (£56.88 million), even shrugged off a bleeding shin. After taking a moment to rest on the sidelines, he was back in the thick of the action as if nothing had happened. \n“In one sense Costa never left us,” said Atletico goalkeeper Miguel Angel Moya. \n“He had a very good spell at Chelsea and I don’t think he’s changed how he is or how he plays, we expect everything of him.” \nAtletico coach Diego Simeone added: “Costa generates enthusiasm. In those first five minutes he showed what he is all about and I hope he can keep it up.” \nThe man who enraptured the Vicente Calderon with his combative and ruthlessly effective displays is now set for his baptism at Atletico’s new home, the 68,000 capacity Wanda Metropolitano, and he could hardly have hoped for more fitting opponents in his first game back in La Liga than Getafe. \nCosta scored a stunning goal in a 7-0 thrashing of Getafe in November 2013 during Atletico’s remarkable title winning campaign. He also scored in the 2-0 away win against the Madrid side in April 2014, banging his shin against the post in the process. \nHe had to be carried off the pitch on a stretcher but immediately after that game Atletico coach Simeone summed up Costa attitude, saying: “He’s fine, one more scratch won’t hurt this tiger”. \nBarca, who lead Atletico in the standings by nine points and are still buzzing from their impressive 3-0 win over Real Madrid before the Christmas break, host struggling Levante on Sunday. They will be boosted by the return of club record signing Ousmane Dembele from a long injury spell. \nChampions Real Madrid are 14 points behind Barca and will look to kickstart their season away to Celta Vigo on Sunday, while Sevilla’s new coach Vincenzo Montella faces a baptism of fire in his first game in La Liga on Saturday as his side host fierce city rivals Real Betis. Reporting by Richard Martin, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-04T16:14:00.000+02:00", "crawled": "2018-01-04T16:32:36.035+02:00", "highlightTitle": ""}