{"organizations": [], "uuid": "bae0e5477de204b95f6df3f50e6f4aa5a5122fb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224002823&w=1200&r=LYNXMPEE0L02F", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-japan-economy-budget/japans-fiscal-target-pushed-back-as-government-prioritizes-social-spending-idUSKBN1FB03W", "country": "US", "domain_rank": 408, "title": "Japan's fiscal target pushed back as government prioritizes social spending", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T09:16:00.000+02:00", "replies_count": 0, "uuid": "bae0e5477de204b95f6df3f50e6f4aa5a5122fb0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-japan-economy-budget/japans-fiscal-target-pushed-back-as-government-prioritizes-social-spending-idUSKBN1FB03W", "ord_in_thread": 0, "title": "Japan's fiscal target pushed back as government prioritizes social spending", "locations": [], "entities": {"persons": [], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "cabinet office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - Japan pushed back its projections for achieving a primary budget surplus by two years to the 2027 fiscal year on Monday, highlighting the difficulty of restoring fiscal health as spending grows.\nThe new projections presented by the Cabinet Office will provide the basis for a fresh fiscal reform plan, to be drawn up by the government this summer.\nThe delay in the fiscal target was widely expected, but concerns still remain about how Japan will lower its debt burden, which is the industrial world’s heaviest at more than twice the size of its economy.\nQuestions about fiscal discipline also affect the Bank of Japan, because it prints money to buy government debt under its aggressive monetary stimulus.\nThe government expects to swing to a primary budget surplus of 800 billion yen ($7.23 billion) or 0.1 percent of gross domestic product in fiscal 2027, the latest forecasts showed.\nThe government’s previous twice-yearly projections last July showed the budget would swing to a primary surplus of 1.8 trillion yen or 0.2 percent of GDP in fiscal 2025.\nThe primary budget excludes debt servicing costs and income from bond sales.\nOriginally the goal was to achieve the surplus in fiscal 2020, but Prime Minister Shinzo Abe’s ruling Liberal Democratic Party omitted this deadline from its campaign platform for last October’s election and made spending on education and welfare at the core of its campaign.\nAbe has expressed a desire to achieve the primary budget surplus as early as possible. But the premier remains hesitant to set a binding cap on spending, as he focuses more on growth than austerity to revive the economy and restore fiscal health.\nSome analysts say a delay in the primary budget target isn’t problematic because the economy is enjoying its best run of growth in a decade and tax revenue has been rising.\nAbe’s government last month compiled a 97.7 trillion yen budget - a record high for the sixth year - for fiscal 2018, led by bulging welfare spending due to an aging population and the cost of servicing snowballing debt.\nReporting by Stanley White; Editing by Shri Navaratnam\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T09:16:00.000+02:00", "crawled": "2018-01-22T05:49:10.026+02:00", "highlightTitle": ""}