{"organizations": [], "uuid": "586a10920168c4c0adc68d54aaaefe266568d7d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/britain-stocks/weak-results-weigh-on-ftse-100-profit-warning-pummels-mothercare-idUSL8N1P31MD", "country": "US", "domain_rank": 408, "title": "Weak results weigh on FTSE 100, profit warning pummels Mothercare", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.05, "site_type": "news", "published": "2018-01-08T17:55:00.000+02:00", "replies_count": 0, "uuid": "586a10920168c4c0adc68d54aaaefe266568d7d7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/britain-stocks/weak-results-weigh-on-ftse-100-profit-warning-pummels-mothercare-idUSL8N1P31MD", "ord_in_thread": 0, "title": "Weak results weigh on FTSE 100, profit warning pummels Mothercare", "locations": [], "entities": {"persons": [{"name": "eik", "sentiment": "negative"}, {"name": "helen reid", "sentiment": "none"}, {"name": "chri", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "mothercare", "sentiment": "negative"}, {"name": "micro focus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon, see cpurl://apps.cp./cms/?pageId=livemarkets)\n* FTSE 100 flat, underperforming European markets\n* Micro Focus falls 14 pct on weaker guidance\n* Baby goods retailer Mothercare sinks 27 pct on poor Xmas trading\n* Poor start to heavy week for UK retailers reporting\nBy Helen Reid\nLONDON, Jan 8 (Reuters) - Ripples through the retail sector dented British stocks on Monday as small-cap Mothercare sank by a third after a profit warning, while software firm Micro Focus dropped 13 percent after cutting guidance.\nThe FTSE 100 underperformed European benchmarks, holding flat, with tech the biggest weight. Mid- and small-cap indexes held onto gains of 0.1 percent despite some significant single-stock falls.\nBaby goods retailer Mothercare sank 27 percent to a record low after saying full-year profit would be much lower than earlier expectations as it did not see any short-term improvement to the UK market.\nMothercare’s update marked a poor start to a heavy week for UK retailers reporting on Christmas trading, after the season kicked off last week with a disappointing update from department store Debenhams.\n“Very much in the Debenhams, rather than Next, school of post-Christmas updates, the baby specialist unveiled an ugly 7.2 percent plunge in like-for-like sales with an especially ominous 6.9 percent drop in online sales,” said Spreadex market analyst Connor Campbell.\nAlso in small-caps, McBride, a provider of household goods, sank 18 percent after its trading update showed declining revenues and Investec cut its price target on the stock.\nUK consumer spending fell in 2017 for the first time in 5 years, an overnight survey from Visa found, highlighting the strain many retailers are under.\nSainsbury‘s, Tesco, Morrisons, and M&S are all reporting Christmas trading this week.\nConcerns around consumers, the engine of the UK economy, have been weighing on forecasts for Britain’s economic growth and keeping UK stocks from fully participating in the strong rally across European markets.\n“Happy bullish year EU (27 that is, not the other one),” was how Bank of America Merrill Lynch analysts put it.\nMicro Focus tumbled 13.4 percent to the bottom of the FTSE 100 after first-half results in which lower-than-expected revenue guidance overshadowed positives including a 16 percent dividend hike and future U.S. tax reform benefits.\n“Perhaps investors need more time to see that the latest monster acquisition is providing value,” said Accendo Markets analyst Michael van Dulken, referring to the company’s $8.8 billion acquisition of Hewlett Packard Enterprise’s software assets.\n“Given the mix of pluses and minuses, we expect some volatility in the share price,” said Stifel analysts.\nGSK was the biggest boost to the FTSE, rising 1.3 percent after Novo Nordisk’s $3.1 billion offer to buy Ablynx reignited enthusiasm around mergers and acquisitions in the healthcare sector.\nStrong metals prices also helped limit the damage from weak results, with miners including Glencore, BHP Billiton and Rio Tinto supporting the FTSE.\nReporting by Helen Reid; Editing by Robin Pomeroy\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T17:55:00.000+02:00", "crawled": "2018-01-09T16:59:41.088+02:00", "highlightTitle": ""}