{"organizations": [], "uuid": "93548c9909400686f59cf497330abaebd598a96a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/mideast-syria-idlib-strikes/suspected-russian-warplanes-hit-busy-market-in-idlib-kill-15-rescuers-residents-idINKBN1FJ2UI", "country": "US", "domain_rank": 408, "title": "Suspected Russian warplanes hit busy market in Idlib, kill 15 - rescuers, residents", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T22:28:00.000+02:00", "replies_count": 0, "uuid": "93548c9909400686f59cf497330abaebd598a96a"}, "author": "", "url": "https://in.reuters.com/article/mideast-syria-idlib-strikes/suspected-russian-warplanes-hit-busy-market-in-idlib-kill-15-rescuers-residents-idINKBN1FJ2UI", "ord_in_thread": 0, "title": "Suspected Russian warplanes hit busy market in Idlib, kill 15 - rescuers, residents", "locations": [], "entities": {"persons": [], "locations": [{"name": "idlib", "sentiment": "none"}, {"name": "amman", "sentiment": "none"}, {"name": "ariha", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 8:31 PM / Updated 17 minutes ago Suspected Russian warplanes hit busy market in Idlib, kill 15 - rescuers, residents Reuters Staff 2 Min Read \nAMMAN (Reuters) - At least 15 people were killed on Tuesday when suspected Russian warplanes struck a crowded market in the rebel-held city of Ariha in the second such strike on a shopping area in opposition-held Idlib within 24 hours, residents and rescuers said. \nThey said the aircraft were flying at high altitude, which differentiates it from ageing Syrian airforce. \nThe opposition-run Civil Defence service said a further 20 people were wounded in the strike. Video released by local activists showed extensive damage, with produce mixed up with human parts. \nReuters could not verify the authenticity of the footage \nA resident said the attack took place at the busiest time of the day. \nRussia’s defence ministry regularly says it is attacking hardline Islamist militants. It denies opposition and witness accounts that its warplanes target market places, medical centres and residential areas away from frontlines. \nSyrian media made no mention of the strikes. \nCivil Defence workers and residents said dozens of raids have since Sunday struck the towns of Khan Sheikhoun, Maarat al Numan, Saraqeb and scores of villages. \nOn Monday, warplanes bombed a potato market in nearby Saraqeb, killing at least 11 people, mostly farmers and traders. Shortly after that warplanes knocked out of action the only public hospital in the city, which was supported by French charity Medecins Sans Frontieres (MSF). \nMSF said in a statement the attack on the hospital killed at least five people, including a child, and injured six. It said this was the second strike on the hospital in just over a week. \nRussia has escalated its strikes in Idlib in recent months, throwing its military weight behind a Syrian military campaign to push deeper into the mainly rebel-held northwestern province. Reporting by Suleiman Al-Khalidi, Editing by Angus MacSwan", "external_links": [], "published": "2018-01-30T22:28:00.000+02:00", "crawled": "2018-01-30T22:49:42.011+02:00", "highlightTitle": ""}