{"organizations": [], "uuid": "a67a0a0904758e630fd6ac9c9777d9b599d058a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/sne-02-18-brooks.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/brooks-running-shoes-hp/", "country": "US", "domain_rank": 1196, "title": "Your Next Running Shoes Will Be Custom-Built for You | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.195, "site_type": "news", "published": "2018-01-22T08:30:00.000+02:00", "replies_count": 0, "uuid": "a67a0a0904758e630fd6ac9c9777d9b599d058a1"}, "author": "Phil Wahba", "url": "http://fortune.com/2018/01/22/brooks-running-shoes-hp/", "ord_in_thread": 0, "title": "Your Next Running Shoes Will Be Custom-Built for You | Fortune", "locations": [], "entities": {"persons": [{"name": "brooks", "sentiment": "none"}, {"name": "phil wahba", "sentiment": "none"}, {"name": "courtesy of brooks", "sentiment": "none"}], "locations": [{"name": "brooks", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}], "organizations": [{"name": "brooks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Your Next Running Shoes Will Be Custom-Built for You Brooks Levitate running shoe with customized sole. Courtesy of Brooks By Phil Wahba 6:30 AM EST \nAfter he attaches sensors to my ankles, shins, and knees, a technician at Brooks, the Seattle running shoe maker, asks me to do a series of knee bends and run a few steps on a treadmill equipped with a camera. The device will capture my motion with the goal of recording the biomechanics of how I run. It will analyze how far my knees point away from each other and how the swing of my hips affects my knees. A running fanatic, I am intrigued that a machine could know my gait better than I do. A technician at Brooks records a customer's biomechanics or her running style by using sensors attached to her ankles, shins, and knees. Courtesy of Brooks \nThis biomechanical assessment, part of a service and philosophy that Brooks calls Run Signature, has long been in use by the company to help guide its customers to the best-fitting shoe in its arsenal. But the options so far have been limited to what Brooks can sell off the shelf. \nNow Brooks, the top brand in specialty running with 25% of the shoe market, according to the NPD Group, wants to take that a step further. The company is working with tech stalwart HP to marry a runner’s gait information with a three-dimensional foot scan generated by HP’s new FitStation device. HP’s technology can measure pressure along the foot as it lands in each stride. The data help Brooks determine how much polyurethane to inject in a shoe’s sole to achieve the right density for as many as 30 zones of your foot. Biomechanical data help Brooks make running shoes with custom levels of support. Courtesy of Brooks \nAt a time when Adidas, Nike (nke) , and other sportswear companies limit footwear customization to color and material, Berkshire Hathaway–owned Brooks seeks to create running shoes with customized performance elements as well as build data-rich digital customer profiles. \n“Everyone is fighting commoditization,” says Brooks CEO Jim Weber. “It’s a shoe for you. It does exactly what you need it to do.” Brooks is working with tech stalwart HP to marry a runner’s gait information with a three-dimensional foot scan generated by HP’s new FitStation device. Courtesy of Brooks \nBrooks is testing FitStation at 12 locations; it will formally launch the effort in June and enjoy one year of exclusivity for HP’s tech. (The companies are working with insole maker Superfeet, which can manufacture up to 500,000 pairs of shoes a year at its facility in Ferndale, Wash.) If successful, Brooks will continue its defiance of the malaise that has gripped the running shoe category, the result of a boom that has since fizzled. In its most recent quarter, Brooks’ global footwear sales rose 14%. The data collected about each customer helps Brooks determine how much polyurethane to inject in the shoe’s sole to achieve the right density for as many as 30 zones of the foot. Courtesy of Brooks \nHP, which has dedicated 80 full-time engineers to FitStation, hopes to extend its technology to apparel and eyewear. But Brooks is firmly focused on feet. Says Weber: “This is the fruition of our vision for how we want to build shoes.” \nA version of this article appears in the Feb. 1, 2018 issue of Fortune with the headline “A Kindred Sole.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-22T08:30:00.000+02:00", "crawled": "2018-01-22T14:33:52.024+02:00", "highlightTitle": ""}