{"organizations": [], "uuid": "3ca62b7435e393ba2e5842df01db6c5c69a84e26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/20/the-associated-press-the-latest-senate-vote-to-stop-shutdown-10-votes-short.html", "country": "US", "domain_rank": 767, "title": "The Latest: Senate vote to stop shutdown 10 votes short", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T07:01:00.000+02:00", "replies_count": 0, "uuid": "3ca62b7435e393ba2e5842df01db6c5c69a84e26"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/20/the-associated-press-the-latest-senate-vote-to-stop-shutdown-10-votes-short.html", "ord_in_thread": 0, "title": "The Latest: Senate vote to stop shutdown 10 votes short", "locations": [], "entities": {"persons": [{"name": "sarah huckabee sanders", "sentiment": "none"}, {"name": "democr", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "democratic", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "white house press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The Latest on the budget battle in Congress (all times local):\n12:15 a.m.\nThe final Senate vote on a Republican bill aimed at preventing a federal shutdown is in, and it's 10 votes short.\nFriday's late-night vote means a government closure is under way. There have been no clear public signs that the two parties have significantly narrowed their disputes over immigration and the budget.\nThe House approved the measure Thursday over Democratic opposition. It would have kept agencies afloat through Feb. 16, but Democrats wanted a package lasting just days in hopes of intensifying pressure on the GOP to compromise.\nRepublicans control the Senate 51-49. The GOP needed 60 votes to prevail, but the tally was 50-49.\nFive Democrats voted in favor of the measure. Five Republicans voted against it.\n12:01 a.m.\nThe White House says it will not negotiate with the Democrats on immigration until the end of the federal government shutdown.\nWhite House Press Secretary Sarah Huckabee Sanders says in a statement that, \"We will not negotiate the status of unlawful immigrants while Democrats hold our lawful citizens hostage over their reckless demands.\"\nShe adds, \"When Democrats start paying our armed forces and first responders we will reopen negotiations on immigration reform.\"\nThe government shut down at midnight after Congress failed to pass a spending deal.\nSanders says, \"Senate Democrats own the Schumer Shutdown,\" adding, \"This is the behavior of obstructionist losers, not legislators.\"\n12 midnight\nThe U.S. government shut down at midnight after Congress failed to resolve a partisan standoff over immigration and spending.\nIn a late-night vote, Senate Democrats joined to block a bill that would have kept the government running for another four weeks. A flurry of last-minute negotiations failed to beat the deadline.\nDemocrats have tried to use the Friday night funding deadline to win concessions from Republicans, including an extension of an Obama-era program protecting some young immigrants from deportation. The program is set to expire in March. Republicans sought more time for talks, but Democrats refused.\nThe shutdown is only the fourth government closure in a quarter-century. It will only partially curb government operations. Uniformed service members, health inspectors, and law enforcement officers are set to work without pay.\n11:59 p.m.\nMany of the immediate effects of the government shutdown will be muted for most Americans, as it comes on a Friday night.\nSocial Security and most other safety net programs are unaffected by the lapse in federal spending authority. Critical government functions will continue, with uniformed service members, health inspectors and law enforcement officers set to work without pay.\nBut if no deal is brokered before Monday,   federal employees are set to be furloughed.\nThe White House and Capitol Hill will be working with skeleton staffs, but some government agencies, like the Environmental Protection Agency, have said they were able to shift funding around to keep most workers on the job. National parks and federal museums will be open, but with potentially reduced services.\n11 p.m.\nSenate Democrats appear to have derailed a Republican bill aimed at preventing a federal shutdown set to begin as soon as the calendar flips to Saturday.\nFriday's late-night vote means at least a short government closure is all but unavoidable. There have been no clear public signs that the two parties have significantly narrowed their disputes over immigration and the budget.\nThe House approved the measure Thursday over Democratic opposition. It would keep agencies afloat through Feb. 16, but Democrats want a package lasting just days in hopes of intensifying pressure on the GOP to compromise.\nRepublicans control the Senate 51-49. The GOP needed 60 votes to prevail, but the tally was 50-48 as of 11 p.m. Eastern time. The Senate is awaiting a final vote from Majority Leader Mitch McConnell.\n10:30 p.m.\nThe Trump administration will exempt several hundred presidential staffers from mandatory furloughs if the government shuts down at midnight.\nContingency plans released Friday night show that 659 Executive Office of the President staffers would be allowed to report to duty because they are considered essential workers. More than 1,000 of 1,700 staffers would be furloughed.\nThe number is higher than the Obama administration, which deemed 545 staffers essential in 2015.\nThe Executive Office of the President includes those who work in White House Office, the Office of the Vice President and the National Security Council, among others.\n9:30 p.m.\nPresident Donald Trump says efforts to avert a government shutdown are \"Not looking good.\"\nTrump says in a tweet late Friday evening that it's \"Not looking good for our great Military or Safety & Security on the very dangerous Southern Border.\"\nAnd he's blaming Democrats, saying they want a federal government shutdown \"in order to help diminish the great success of the Tax Cuts, and what they are doing for our booming economy.\"\nLawmakers are trying to hash out a deal to keep the federal government open. A partial shutdown will begin at midnight if Congress doesn't pass a funding bill.\n8:55 p.m.\nNewly minted Alabama Democratic Sen. Doug Jones is breaking ranks with party leaders and will vote for the House-passed Republican bill preventing a federal shutdown.\nJones tells The Associated Press he will \"reluctantly\" vote for the measure late Friday. He says he's backing it because the measure contains fresh financing for the Children's Health Insurance Program, which helps low-income children.\nIt will be Jones' highest-profile vote since he joined the Senate Jan. 3 after his upset special election victory over conservative Roy Moore.\nDemocrats say they have the votes to block the GOP measure. Republicans control the Senate 51-49 but need 60 votes to prevail.\nJones joins at least three other Democrats saying they'll support the bill: North Dakota's Heidi Heitkamp, Indiana's Joe Donnelly and West Virginia's Joe Manchin.\n7:30 p.m.\nAdministration officials say President Donald Trump would be allowed to travel to Davos, Switzerland, next week even if the government has been partially shut down.\nSenior administration officials told reporters in a background briefing call that the president is permitted to continue to exercise his constitutional duties during a funding lapse. That includes carrying out diplomacy.\nThe officials declined to comment on whether the president would be able to travel to Florida this weekend to spend time at his Mar-a-Lago club.\nTrump is planning to attend the World Economic Forum Annual Meeting next week in Switzerland. He plans to meet with British Prime Minister Theresa May, among others.\n7:20 p.m.\nThe Senate has scheduled a showdown vote for 10 p.m. EST on preventing a federal government shutdown. Democrats are ready to block the Republican measure.\nUnless Congress approves some legislation providing money, government agencies will begin shutting down at midnight.\nThe initial impact on most people will be slight, but the closure will raise the stakes in a partisan fight over immigration and the budget.\nThe House approved a bil", "external_links": [], "published": "2018-01-20T07:01:00.000+02:00", "crawled": "2018-01-20T07:40:31.002+02:00", "highlightTitle": ""}