{"organizations": [], "uuid": "fb1c6a432e34ea4c05010ae62eeb1b46f7b714d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-908615156.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/crock-pot-this-is-us-milo-ventimiglia/", "country": "US", "domain_rank": 1196, "title": "Crock-Pot to 'This Is Us' Fans: Don't Blame Us | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.474, "site_type": "news", "published": "2018-01-25T13:27:00.000+02:00", "replies_count": 0, "uuid": "fb1c6a432e34ea4c05010ae62eeb1b46f7b714d1"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/25/crock-pot-this-is-us-milo-ventimiglia/", "ord_in_thread": 0, "title": "Crock-Pot to 'This Is Us' Fans: Don't Blame Us | Fortune", "locations": [], "entities": {"persons": [{"name": "tom huddleston jr.", "sentiment": "negative"}, {"name": "milo ventimiglia", "sentiment": "none"}, {"name": "ventimiglia", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. 11:27 AM EST \nIt’s not often a major fictional plot twist makes you rethink your relationship with a kitchen appliance. \nWARNING: Spoilers for NBC’s drama This Is Us ahead. \nBut that’s the situation that fans of the critically-acclaimed NBC drama This Is Us found themselves in after Tuesday’s episode, in which the long-anticipated death of a leading character (actor Milo Ventimiglia’s Jack) is hinted to ended up coming at the hands of a faulty slow-cooker, of all things. \nViewers of the show watched in disbelief earlier this week as Ventimiglia’s Jack switched off an outdated (and, importantly, non-branded) slow-cooker only to have the appliance short-circuit and start a fire that destroys the home and kills Jack. While Jack’s eventual death had already been established by the time-jumping series, the cause of his passing had been left up in the air. And let’s just say that most viewers were not suspecting the slow-cooker. \nFans took their surprise to social media, with some even casting further suspicion on Crock-Pot, the appliance brand that is synonymous with slow-cookers for many casual chefs. My mom just threw our crockpot out #ThisIsUs #SOSIMILAR pic.twitter.com/RmeXQrfog5 \n— Chelsea Stevens (@ChelseaMS731) January 24, 2018 #ThisIsUs just savagely killed #CROCKPOT usage in America. Meanwhile #InstantPot is like….. pic.twitter.com/ij0T3VbU5a \nGet Data Sheet , Fortune’s technology newsletter. \nFor its part, the Crock-Pot brand has gently pushed back against the fictional narrative of This Is Us , with representatives of the company issuing a statement to The Washington Post . \n“Crock-Pot understands the concerns brought up by last night’s episode of This Is Us , and we too are heartbroken by the latest development in Jack’s storyline,” the company said. “However, it is important that our consumers understand and have confidence that all Crock-Pot slow cookers exceed all internal testing protocols and all applicable industry safety standards and regulations as verified by independent third-party testing labs.” \nAdditionally, Crock-Pot noted that its products are “low current, low wattage,” reducing the likelihood of an electrical fire, and the switches themselves are “constructed of self-extinguishing, flame resistant material.” \n“Our hope is that the team at NBC’s This Is Us will help us in spreading factual information regarding our product’s safety,” Crock-Pot told the Post . Taking a moment to remind everyone that it was a 20 year old fictional crockpot with an already funky switch? Let's not just lump all those lovely hardworking crockpots together. #ThisIsUs \n— Dan Fogelman (@Dan_Fogelman) January 24, 2018 \nThis Is Us creator Dan Fogelman did just that with his own tweet on Wednesday, in which he stressed that the appliance used on the show was fictional (it did not say “Crock-Pot” on the device) and that fans should not take out their ire on the real-life brand. Fogelman and NBC have told This Is Us fans that all details of Jack’s passing will finally be fully revealed in the show’s next episode , which will air immediately after the Super Bowl on Feb. 4. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T13:27:00.000+02:00", "crawled": "2018-01-25T21:04:26.003+02:00", "highlightTitle": ""}