{"organizations": [], "uuid": "2b1766787d1a7ec7f404015e5820046d7d7cdb39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-healthsouth-corporation-completes-planned-corporate-name-change-to-encompass-health-company-to-begin-trading-on-nyse-under.html", "country": "US", "domain_rank": 767, "title": "HealthSouth Corporation Completes Planned Corporate Name Change To Encompass Health; Company To Begin Trading On NYSE Under Ticker Symbol EHC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-02T16:15:00.000+02:00", "replies_count": 0, "uuid": "2b1766787d1a7ec7f404015e5820046d7d7cdb39"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-healthsouth-corporation-completes-planned-corporate-name-change-to-encompass-health-company-to-begin-trading-on-nyse-under.html", "ord_in_thread": 0, "title": "HealthSouth Corporation Completes Planned Corporate Name Change To Encompass Health; Company To Begin Trading On NYSE Under Ticker Symbol EHC", "locations": [], "entities": {"persons": [{"name": "mark tarr", "sentiment": "none"}], "locations": [{"name": "birmingham", "sentiment": "none"}, {"name": "ala.", "sentiment": "none"}], "organizations": [{"name": "healthsouth corporation completes planned corporate name change to encompass health", "sentiment": "neutral"}, {"name": "healthsouth corporation", "sentiment": "neutral"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "healthsouth corporation and encompass home health & hospice", "sentiment": "none"}, {"name": "encompass health corporation", "sentiment": "none"}, {"name": "encompass health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BIRMINGHAM, Ala., Jan. 2, 2018 /PRNewswire/ -- HealthSouth Corporation, the nation's leading owner and operator of inpatient rehabilitation hospitals and a leader in home-based care, has completed its planned name change to Encompass Health Corporation. Effective with the opening of trading today, the Company's New York Stock Exchange (NYSE) ticker symbol will change from \"HLS\" to \"EHC.\"\n\"As Encompass Health, we will honor the legacy of our foundational businesses, HealthSouth Corporation and Encompass Home Health & Hospice, while continuing to advance our position as the leading provider of integrated post-acute care solutions in a rapidly changing healthcare environment,\" said Encompass Health President and Chief Executive Officer Mark Tarr. \"Our new corporate name further reinforces our strength as one Company, and reflects our expanding national footprint and our strategy to deliver high-quality, cost-effective care across the post-acute continuum.\"\nThe full rollout of the Encompass Health brand will include changing the name and logo across its field operations, as well as corporate resources such as its website. Inpatient rehabilitation hospitals and home care agencies will begin transitioning to the Encompass Health name, beginning with locations in Texas, Alabama, and Arkansas, on April 1, with local migrations continuing throughout 2018. The rollout is expected to be fully completed by the first quarter of 2019.\n\"The decision to rebrand as Encompass Health Corporation is the result of a yearlong, research-intensive process that helped us understand how our brand could better reflect and support our business strategy, while raising awareness of our Company's strategy and value proposition with all key constituencies,\" said Tarr.\nThe Company will host a presentation at the 36th Annual J.P. Morgan Healthcare Conference on Jan. 9, 2018. On Feb. 6, the encompasshealth.com website will go live and Tarr will ring The Closing Bell ® at the NYSE.\nAbout Encompass Health\nAs a national leader of inpatient rehabilitation hospitals and home-based care, Encompass Health (NYSE: EHC) offers facility-based and home-based patient care through its network of inpatient rehabilitation hospitals, home health agencies, and hospice agencies. With a national footprint that spans 127 hospitals and 235 home health & hospice agencies in 36 states and Puerto Rico, the Company is committed to delivering high-quality, cost-effective care across the post-acute continuum. Driven by a set of shared values, Encompass Health is the result of the union between HealthSouth Corporation and Encompass Home Health & Hospice, and is ranked as one of Fortune's 100 Best Companies to Work For, as well as Modern Healthcare's Best Places to Work.\nForward-Looking Statements\nStatements contained in this press release which are not historical facts, such as the timing and effect of the rebranding initiative, are . In addition, Encompass Health, through its senior management, may from time to time make forward-looking public statements concerning the matters described herein. All such estimates, projections, and forward-looking information speak only as of the date hereof, and Encompass Health undertakes no duty to publicly update or revise such forward-looking information, whether as a result of new information, future events, or otherwise. Such are necessarily estimates based upon current information, involve a number of risks and uncertainties, and relate to, among other things, future events, Encompass Health's business strategy, its future financial performance, and its projected business results or model. Actual events or results may differ materially from those anticipated in these as a result of a variety of factors. While it is impossible to identify all such factors, factors which could cause actual events or results to differ materially from those estimated by Encompass Health include, but are not limited to, any adverse outcome of various lawsuits, claims, and legal or regulatory proceedings that may be brought by or against Encompass Health; the ability to successfully integrate acquisitions; changes in the regulation of the healthcare industry broadly or the inpatient rehabilitation, home health and hospice areas specifically at either or both of the federal and state levels; competitive pressures in the healthcare industry broadly or the inpatient rehabilitation, home health and hospice areas specifically and Encompass Health's response thereto; the ability to maintain proper local, state and federal licensing where the company does business; potential disruptions, breaches, or other incidents affecting the proper operation, availability, or security of Encompass Health's information systems, including the unauthorized access to or theft of patient or other sensitive information; changes, delays in (including in connection with resolution of Medicare payment reviews or appeals), or suspension of reimbursement for Encompass Health's services by governmental or private payors; general conditions in the economy and capital markets; and other factors which may be identified from time to time in Encompass Health's SEC filings and other public announcements, including Encompass Health's Form 10 K for the year ended Dec.31, 2016 and Form 10-Q for the quarters ended Sept. 30, 2017, June 30, 2017, and March 31, 2017.\nMedia Contact:\nCasey Lassiter | 205.447.6410\ncasey.lassiter@encompasshealth.com\nInvestor Relations Contact:\nCrissy Carlisle | 205.970.5860\ncrissy.carlisle@encompasshealth.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/healthsouth-corporation-completes-planned-corporate-name-change-to-encompass-health-company-to-begin-trading-on-nyse-under-ticker-symbol-ehc-300576297.html\nSOURCE Encompass Health Corporation", "external_links": ["http://investor.healthsouth.com/press-releases/press-release-details/2017/HealthSouth-To-Present-At-The-36th-Annual-JP-Morgan-Healthcare-Conference/default.aspx", "http://www.prnewswire.com/news-releases/healthsouth-corporation-completes-planned-corporate-name-change-to-encompass-health-company-to-begin-trading-on-nyse-under-ticker-symbol-ehc-300576297.html"], "published": "2018-01-02T16:15:00.000+02:00", "crawled": "2018-01-02T16:30:06.000+02:00", "highlightTitle": ""}