{"organizations": [], "uuid": "29c7b1ac8a5a78d69512ad7eee34adab7adeb33c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-axogen-inc-preannounces-estimated-fourth-quarter-and-full-year-2017-revenue.html", "country": "US", "domain_rank": 767, "title": "AxoGen, Inc. Preannounces Estimated Fourth Quarter and Full Year 2017 Revenue", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-08T15:00:00.000+02:00", "replies_count": 0, "uuid": "29c7b1ac8a5a78d69512ad7eee34adab7adeb33c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-axogen-inc-preannounces-estimated-fourth-quarter-and-full-year-2017-revenue.html", "ord_in_thread": 0, "title": "AxoGen, Inc. Preannounces Estimated Fourth Quarter and Full Year 2017 Revenue", "locations": [], "entities": {"persons": [{"name": "karen zaderej", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "alachua", "sentiment": "none"}], "organizations": [{"name": "axogen, inc", "sentiment": "neutral"}, {"name": "axogen", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Q4 Revenue will be at least $16.5 million, representing 45% growth over prior year\n2017 Revenue will be at least $60.0 million, representing 46% growth over prior year\nALACHUA, Fla., Jan. 08, 2018 (GLOBE NEWSWIRE) -- AxoGen, Inc. (NASDAQ:AXGN), a global leader in developing and marketing innovative surgical solutions for peripheral nerve injuries, today announced preliminary unaudited fourth quarter and full year 2017 revenue and selected business highlights for the quarter and year ended December 31, 2017.\nPreliminary Revenue and Selected Business Highlights\nFourth quarter revenue is expected to be at least $16.5 million, up 45% compared to the fourth quarter of 2016 revenue of $11.4 million Full year 2017 revenue is expected to be at least $60.0 million, up 46% compared to 2016 revenue of $41.1 million Ended the quarter with 60 direct sales representatives and 20 independent distributors Completed 15 national education programs in 2017 and expect to conduct 18 programs in 2018\n“We are pleased to report another successful quarter and a solid finish to 2017,” said Karen Zaderej, president and CEO of AxoGen. “These results reflect the strength of our growing platform for nerve repair where we see continued momentum in our core trauma, nerve protection and oral and maxillofacial markets. We enter 2018 with an expanding sales force that will allow us to continue growth in our core markets while also supporting our newest application in breast reconstruction neurotization.”\n2017 Financial Guidance\nManagement increases its full year 2017 revenue guidance to at least $60.0 million. Management reiterates its full year 2017 gross margin guidance to exceed 80%.\n2018 Financial Guidance\nManagement reiterates 2018 annual revenue will grow at least 40% over 2017 revenue and gross margins will remain above 80%.\nUpcoming Investor Event\nMembers of the AxoGen senior management team will participate in The Trout Group Annual 1-on-1 Management Access Event in San Francisco, January 8–10, 2018. To request a meeting, please contact axogenevents@troutgroup.com . AxoGen will also participate in the Leerink 7 th Annual Global Healthcare Conference in New York City, February 14, 2018.\nThe results disclosed are preliminary and unaudited. The Company will report full, audited results for the fourth quarter and year ended December 31, 2017 on February 28, 2018.\nAbout AxoGen\nAxoGen (AXGN) is the leading company focused specifically on the science, development and commercialization of technologies for peripheral nerve regeneration and repair. We are passionate about helping to restore nerve function and quality of life to patients with peripheral nerve injuries by providing innovative, clinically proven and economically effective repair solutions for surgeons and health care providers. Peripheral nerves provide the pathways for both motor and sensory signals throughout the body. Every day, people suffer traumatic injuries or undergo surgical procedures that impact the function of their peripheral nerves. Damage to a peripheral nerve can result in the loss of muscle or organ function, the loss of sensory feeling, or the initiation of pain.\nAxoGen's platform for nerve repair features a comprehensive portfolio of products, including Avance ® Nerve Graft, an off-the-shelf processed human nerve allograft for bridging severed nerves without the comorbidities associated with a second surgical site, AxoGuard ® Nerve Connector, a porcine submucosa extracellular matrix (ECM) coaptation aid for tensionless repair of severed nerves, AxoGuard ® Nerve Protector, a porcine submucosa ECM product used to wrap and protect injured peripheral nerves and reinforce the nerve reconstruction while preventing soft tissue attachments, and Avive ® Soft Tissue Membrane, a minimally processed human umbilical cord membrane that may be used as a resorbable soft tissue covering to separate tissue layers and modulate inflammation in the surgical bed. Along with these core surgical products, AxoGen also offers AcroVal ® Neurosensory & Motor Testing System and AxoTouch ® Two-Point Discriminator. These evaluation and measurement tools assist health care professionals in detecting changes in sensation, assessing return of sensory, grip, and pinch function, evaluating effective treatment interventions, and providing feedback to patients on nerve function. The AxoGen portfolio of products is available in the United States, Canada, the United Kingdom, and several other European and international countries.\nCautionary Statements Concerning Forward-Looking Statements\nThis Press Release contains \"forward-looking\" statements as defined in the Private Securities Litigation Reform Act of 1995. These statements are based on management's current expectations or predictions of future conditions, events, or results based on various assumptions and management's estimates of trends and economic factors in the markets in which we are active, as well as our business plans. Words such as \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" \"projects,\" \"forecasts,\" \"continue,\" \"may,\" \"should,\" \"will,\" and variations of such words and similar expressions are intended to identify such The may include, without limitation, statements regarding our assessment on our internal control over financial reporting, our growth, our 2017 and 2018 guidance, product development, product potential, financial performance, sales growth, product adoption, market awareness of our products, data validation, our visibility at and sponsorship of conferences and educational events. The are subject to risks and uncertainties, which may cause results to differ materially from those set forth in the statements. Forward-looking statements in this release should be evaluated together with the many uncertainties that affect AxoGen's business and its market, particularly those discussed in the risk factors and cautionary statements in AxoGen's filings with the Securities and Exchange Commission. Forward-looking statements are not guarantees of future performance, and actual results may differ materially from those projected once audited financial statement are finalized. The are representative only as of the date they are made and, except as required by law, AxoGen assumes no responsibility to update any , whether as a result of new information, future events, or otherwise.\nContacts:\nAxoGen, Inc.\nPeter J. Mariani, Chief Financial Officer\nInvestorRelations@AxoGenInc.com\nThe Trout Group – Investor Relations\nBrian Korb\n646.378.2923\nbkorb@troutgroup.com\nSource:AxoGen, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/dbd2dc88-7dcb-462c-95d5-e761b40e63e4", "https://www.globenewswire.com/Tracker?data=h491F083_VeUveR75nYQNuz9leCqRpD_on2likSDG_GFRPAuTm-8WLH4cZTOoAQefSDGdZzDa3TzltsY-J_Tl2V6WnI4EMvtPcxgUN5tMvDsvDcnJc83TkNbdDFGoRZ_", "https://www.globenewswire.com/Tracker?data=iXLxAikyQYAPWOr_xNFr5aIKWLAWCfJN0DSxhk-wYyFfWgd40cjt4wfwu1lfHGHTnwI90MkpwrtQbgAbmuyu0RWLiNrKxz1e5OsY_Hci4Tk="], "published": "2018-01-08T15:00:00.000+02:00", "crawled": "2018-01-08T15:19:53.000+02:00", "highlightTitle": ""}