{"organizations": [], "uuid": "d217bbf98b3a98a646a41fd89542389db17f7b83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-in-the-wake-of-doubling-employee-count-maropost-names-joseph-schirripa-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "In the Wake of Doubling Employee Count, Maropost Names Joseph Schirripa Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "d217bbf98b3a98a646a41fd89542389db17f7b83"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-in-the-wake-of-doubling-employee-count-maropost-names-joseph-schirripa-chief-operating-officer.html", "ord_in_thread": 0, "title": "In the Wake of Doubling Employee Count, Maropost Names Joseph Schirripa Chief Operating Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 31, 2018 (GLOBE NEWSWIRE) -- Today, Maropost, the innovating force in Marketing and Sales technology, named current Chief Financial Officer—Joseph Schirripa—as its new Chief Operating Officer. As CFO and COO, Schirripa will be working a dual role in the organization, with his responsibilities spanning everything from investor relations to employee initiatives.\nSince joining Maropost in early 2017, Schirripa quickly proved himself to be more than a standard CFO. Continually taking on projects beyond his department, the former investment banker was soon seen as a cross-departmental leader—while still managing to streamline the company's financial systems and reporting processes for future growth.\nThe new role also adds some new structure to the company, with Schirripa set to work alongside CEO and Chairman, Ross Andrew Paquette—providing executional expertise for Paquette's strategic vision.\n\"Joseph was an important part of the company long before he officially joined the team. While we brought him on to lead the finance department, he's gone above and beyond the call of duty for a CFO. Now his title reflects that,\" says Paquette. \"We're extremely growth-focused, and the work he's doing as CFO—and now COO—is going to help us achieve that at scale.\"\nSchirripa's appointment comes after a year of unprecedented growth at Maropost. Over the course of 2017, the company has doubled its employee count, bringing the global total to over 150. The organization's growth was also officially recognized by both PROFIT500 and Deloitte, who named them Canada's 3 rd fastest growing company and North America's 32 nd fastest growing tech company, respectively.\n\"I've long been inspired by Maropost's story—that's why I wanted to join this outstanding team,\" says Schirripa. \"My goal here is to ensure our employees, customers, and partners all have a remarkable Maropost experience, so Ross can focus on innovating our offerings to achieve the same goal. We're poised for an impressive future and I'm excited to be a part of it.\"\nSchirripa holds both a Bachelor of Commerce and an MBA from the University of Toronto's Rotman School of Management.\nAbout Maropost\nMaropost is a B2C cloud-based revenue optimization suite that gives companies the ability to increase cross-channel customer engagement to maximize revenue. Through integrated marketing and sales automation, Maropost provides essential tools, strategic guidance, and support needed to create more personalized customer experiences through a 360-degree business view—from marketing automation, to CRM, commerce, and customer support. Headquartered in Toronto, Canada, Maropost is trusted by brands like New York Post, DigitalMarketer, SHOP.com , and Mercedes-Benz.\nFor more information, please contact:\nBrandi Smith, VP Marketing\nMaropost\n1-888-438-3152 x333\nbrandi@maropost.com\nChristine Glossop\nMarketing Communications Manager\nMaropost\n1-888-438-3152 x239\nchristine@maropost.com\nSource: Maropost", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/3c09b18f-e25c-48d0-8bc2-bee51fcfaeac", "https://www.globenewswire.com/Tracker?data=VwYpWCYWlCpC28XAjLe3gQ8UztQk3wiYMzXfzSO1KrHhzAFLdg7yVB1f64TIEIVaYub4gi_guxns8z01seNanao5U70zva_XJNyzkF3_ELs=", "https://www.globenewswire.com/Tracker?data=uDPZYu_ivQmusHa3X4g2KEs-fpx9vbEwhQx0c2sMvVBMf5lkL7xbx-PQyjKMP0PLHXurvinpuj-bC6fENl5S3KeOO8N3nedxvYqxDlAqQwM="], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:46:26.002+02:00", "highlightTitle": ""}