{"organizations": [], "uuid": "ea8324f607f27b0cefaf6a5a07c06a6c03d9acb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-american-water-statement-on-impact-of-tax-cuts-and-jobs-act-on-prior-guidance.html", "country": "US", "domain_rank": 767, "title": "American Water Statement on Impact of Tax Cuts and Jobs Act on Prior Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.131, "site_type": "news", "published": "2018-01-02T17:45:00.000+02:00", "replies_count": 0, "uuid": "ea8324f607f27b0cefaf6a5a07c06a6c03d9acb6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-american-water-statement-on-impact-of-tax-cuts-and-jobs-act-on-prior-guidance.html", "ord_in_thread": 0, "title": "American Water Statement on Impact of Tax Cuts and Jobs Act on Prior Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "prior guidance voorhees", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "american water works company, inc.", "sentiment": "neutral"}, {"name": "sec", "sentiment": "none"}, {"name": "tcja", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VOORHEES, N.J.--(BUSINESS WIRE)-- American Water Works Company, Inc. (NYSE: AWK), the largest publicly traded U.S. water and wastewater utility company, has issued a statement related to the Tax Cuts and Jobs Act (TCJA), and the company’s guidance previously issued on Dec. 11, 2017. The Company stated that the TCJA and any future Treasury rules, regulations or guidance, may materially impact the company’s 2017 results of operations, as well as its expectations, and the related estimates, assumptions and sensitivities, for its future financial and operational performance disclosed in this prior guidance. As stated on the Dec. 11 guidance call, the company’s prior guidance did not include the impact of any tax reform legislation.\nThe company expects to provide an estimate of the impact of the TCJA in conjunction with the filing of its Annual Report on Form 10-K for the year ended Dec. 31, 2017 and related information, expected in February 2018. Additional information on the preliminary impact of the TCJA may be found in the company’s Form 8-K, filed with the SEC today.\nAbout American Water\nWith a history dating back to 1886, American Water is the largest and most geographically diverse U.S. publicly-traded water and wastewater utility company. The company employs more than 6,800 dedicated professionals who provide regulated and market-based drinking water, wastewater and other related services to an estimated 15 million people in 47 states and Ontario, Canada. More information can be found by visiting amwater.com .\nCautionary Statement Concerning Forward-Looking Statements\nCertain statements in this press release including, without limitation, the impact and effect of the TCJA and any related Treasury regulations, rules or interpretations, if and when issued, on the company’s Dec. 11 guidance, as well as on the Company’s results of operations to be reported for fiscal 2017, are forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and the Federal securities laws. In some cases, these forward-looking statements can be identified by words with prospective meanings such as “intend,” “plan,” “estimate,” “believe,” “anticipate,” “expect,” “predict,” “project,” “propose,” “assume,” “forecast,” “likely,” “outlook,” “future,” “pending,” “goal,” “objective,” “potential,” “continue,” “seek to,” “may,” “can,” “will,” “should” and “could” and or the negative of such terms or other variations or similar expressions. These forward-looking statements are predictions based on American Water’s current expectations and assumptions regarding future events. They are not guarantees or assurances of any outcomes, financial results of levels of activity, performance or achievements, and readers are cautioned not to place undue reliance upon them. The forward-looking statements are subject to a number of estimates and assumptions, and known and unknown risks, uncertainties and other factors. Actual results may differ materially from those discussed in the forward-looking statements included in this press release as a result of the factors discussed in the Company’s Annual Report on Form 10-K for the year ended Dec. 31, 2016, and subsequent filings with the SEC, and because of factors such as: the decisions of governmental and regulatory bodies, including decisions to raise or lower rates; the timeliness and outcome of regulatory commissions’ actions concerning rates, capital structure, authorized return on equity, capital investment, permitting, impacts pertaining to the TCJA, and other decisions; changes in laws, governmental regulations and policies, including public utility and tax regulations and policies; changes in its capital requirements; its ability to control operating expenses and to achieve efficiencies in its operations; changes in general economic, political, business and financial market conditions; changes in Federal or state income, general and other tax laws, rules and regulations, including tax reform, the availability of tax credits and tax abatement programs, and the ability to utilize its U.S. and state net operating loss carryforwards; the incurrence of impairment charges related to American Water’s goodwill or other assets; and the impact of new accounting standards or changes to existing standards.\nThese forward-looking statements are qualified by, and should be read together with, the risks and uncertainties set forth above and the risk factors included in the company’s annual and quarterly SEC filings, and readers should refer to such risks, uncertainties and risk factors in evaluating such forward-looking statements. Any forward-looking statements speak only as of the date of this press release. The company does not have or undertake any obligation or intention to update or revise any forward-looking statement, whether as a result of new information, future events, changed circumstances or otherwise, except as otherwise required by the Federal securities laws. Furthermore, it may not be possible to assess the impact of any such factor on the company’s businesses, either viewed independently or together, or the extent to which any factor, or combination of factors, may cause results to differ materially from those contained in any forward-looking statement. The foregoing factors should not be construed as exhaustive.\nClick here to subscribe to Mobile Alerts for American Water .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005401/en/\nAmerican Water Works Company, Inc.\nEd Vallejo\nVice President, Investor Relations\n856-566-4005\nedward.vallejo@amwater.com\nor\nMaureen Duffy\nVice President, Communications and Federal Affairs\n856-309-4546\nMaureen.Duffy@amwater.com\nSource: American Water Works Company, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Falerts.businesswire.com%2Fsubscribe%2Famerican_water_works_company_inc&esheet=51736486&newsitemid=20180102005401&lan=en-US&anchor=Click+here+to+subscribe+to+Mobile+Alerts+for+American+Water&index=1&md5=d6e24c360fea03a4c5df3a12fa55f7ba", "http://www.businesswire.com/news/home/20180102005401/en/"], "published": "2018-01-02T17:45:00.000+02:00", "crawled": "2018-01-02T19:21:14.000+02:00", "highlightTitle": ""}