{"organizations": [], "uuid": "e14a05d2f738ca59bea7d152feec7ee27b50f2c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 31}, "facebook": {"likes": 17, "shares": 17, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104931180-paul_edmondson.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/06/hubpages-sells-to-maven-giving-venture-investors-exit-after-12-years.html", "country": "US", "domain_rank": 767, "title": "HubPages sells to Maven, giving venture investors exit after 12 years", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T00:49:00.000+02:00", "replies_count": 0, "uuid": "e14a05d2f738ca59bea7d152feec7ee27b50f2c2"}, "author": "Ari Levy", "url": "https://www.cnbc.com/2018/01/06/hubpages-sells-to-maven-giving-venture-investors-exit-after-12-years.html", "ord_in_thread": 0, "title": "HubPages sells to Maven, giving venture investors exit after 12 years", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "none"}, {"name": "paul edmondson", "sentiment": "none"}, {"name": "evan williams", "sentiment": "none"}, {"name": "evan spiegel", "sentiment": "none"}, {"name": "marc benioff", "sentiment": "none"}, {"name": "edmondson", "sentiment": "none"}], "locations": [], "organizations": [{"name": "paul edmondson  silicon valley", "sentiment": "neutral"}, {"name": "twitter", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "salesforce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Silicon Valley celebrates the massive exits and the brilliant entrepreneurs behind them. There's Facebook's Mark Zuckerberg , Snap's Evan Spiegel, Salesforce's Marc Benioff and Twitter's Evan Williams, just to name a few. \nBut the overwhelming majority of start-up founders are a lot more like Paul Edmondson than any of the aforementioned celebrities.\nEdmondson poured 12 years of money, sweat and tears into HubPages. He raised $8 million from venture capitalists in the early days before hitting a wall — and then another wall — and then falling out of favor with tech's financiers. \nOn Friday morning, Edmondson finally got his exit. HubPages, a collection of websites that cover topics ranging from pets and cars to healthy living, was acquired by a Seattle-based content company named Maven , which has a market value below $70 million and a stock that trades over-the-counter (OTC).\nTerms of the deal weren't fully disclosed, but the general structure calls for HubPages' investors to get $5 million and for company founders and employees to receive a combination of cash and shares that could be worth another $10 million to $15 million, based on performance metrics and stock appreciation over the next three years.\nExistential threats The story didn't get any pickup, not even from the reliable tech blogs. Edmondson called to tell me about the deal, not so much because he wanted a story, but because we've spoken many times in recent years about the deep existential challenges that companies like his face in a world where so much traffic comes from Google search. \nEdmondson was excited because he'd found a home for himself and his 32 employees (including eight that start on Monday) and he's giving them a chance to own stock with potential upside. \n\"When you're trapped inside small private companies, you don't have a way for you or your employees to get liquid,\" Edmondson said. He added that he's been paying himself a \"below-market salary.\"\nEdmondson's team will double the size of Maven, which similarly operates a network of websites on topics from chocolate to economics. Both companies have been trying to build a business that can survive without reliance on Google and Facebook , which control about two-thirds of the U.S. digital ad market, according to eMarketer . \nshow chapters How to find out what Facebook knows about you      4:30 PM ET Wed, 3 Jan 2018 | 01:58 HubPages attracts more than 35 million visitors a month through its 27 domains. Close to 70 percent of that traffic is now on mobile, Edmondson said.\nThe business has stabilized since 2016, when HubPages narrowed its focus to those 27 particular subjects and committed to obtaining premium content that could be edited by in-house professionals. \nIn previous years, HubPages' success was tied to Google and fluctuated based on whatever the web giant did with its search engine. For example, in May 2015, HubPages saw its traffic plunge 22 percent in one week after Google suddenly lowered the visibility of how-to sites. Like with most of Google's algorithm changes, there was no warning and no explanation.\n\"Imagine how hard it is to run a business when you see 22 percent of your traffic evaporate overnight,\" Edmondson told CNBC for a story about that change, which was dubbed \"Phantom 2\" by one analyst. \nIt was just the latest in a series of hits that HubPages had faced over the years. Building an independent online media company has mostly been a losing model, as ad dollars have concentrated in the hands of the giant internet and entertainment businesses.\nHubPages was able to raise venture money in 2007 and 2008, and then never again.\nFar from taking a breather, Edmondson is now likely to be working even harder. The company has performance targets it has to meet for him to maximize his pay, and he also wants to do what he can to help Maven's stock. \nAs an OTC company, Maven shares are highly volatile and thinly traded. After the announcement on Friday, the stock jumped as much as 32 percent to $2.57, before closing up 6.6 percent at $1.95. \nMaven CEO James Heckman knows the internet ad and content market, having previously served as the chief media strategist at Yahoo and chief strategy officer at Fox Interactive Media. He said that Maven's goal is to build a publishing business that's not beholden to the Google-Facebook duopoly. That requires acquiring premium content sites with a technology platform that allows advertisers to promote across the network.\n\"Paul and I are aligned because we both agree that mom-and-pop or small publishers no longer have a sustainable business,\" Heckman said in an interview. \"It's over.\"", "external_links": [], "published": "2018-01-07T00:49:00.000+02:00", "crawled": "2018-01-07T00:50:03.002+02:00", "highlightTitle": ""}