{"organizations": [], "uuid": "e86108306bd504bbe76f34b065d713d3268aebcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-hudbay-acquires-mining-properties-near-its-constancia-mine-in-peru.html", "country": "US", "domain_rank": 767, "title": "Hudbay Acquires Mining Properties Near its Constancia Mine in Peru", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-01-09T01:00:00.000+02:00", "replies_count": 0, "uuid": "e86108306bd504bbe76f34b065d713d3268aebcc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-hudbay-acquires-mining-properties-near-its-constancia-mine-in-peru.html", "ord_in_thread": 0, "title": "Hudbay Acquires Mining Properties Near its Constancia Mine in Peru", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Hudbay Minerals Inc. (“Hudbay” or the “company”) (TSX:HBM) (NYSE:HBM) announced today that its wholly owned subsidiary, HudBay Peru S.A.C., has entered into the following agreements to acquire mining properties in southern Peru near its Constancia mine: (i) an option agreement with a private Peruvian consortium to earn a 100% interest in the Caballito (formerly Katanga) and Maria Reyna mining properties; and (ii) an agreement to acquire from Panoro Minerals Ltd. 100% of the Kusiorcco mining properties.\nThis map highlights the location of the acquired mining properties relative to Hudbay’s Constancia mine and the Pampacancha deposit.\nThe Caballito property, located approximately three kilometers northwest of Constancia, is a 120-hectare (297-acre) concession block and is the site of the former Katanga mine, which was in intermittent copper oxide production from the early 1900s to the early 1990s.\nThe Maria Reyna property, located within ten kilometers of Constancia, is a 5,850-hectare (14,456-acre) concession block. Diamond drilling by a previous optionee of the Maria Reyna property resulted in a copper skarn-porphyry discovery. Geophysical surveys and geological mapping have also been conducted on the property and the area remains very prospective for additional discoveries.\nThe Kusiorcco property, located within seven kilometers of Constancia, is a 3,962-hectare (9,790-acre) concession block nearby the Caballito and Maria Reyna properties.\nHudbay is commencing permitting, community relations and technical activities required to access and conduct drilling activities on the concessions and expects to provide further details on its exploration plans for these properties in due course. These mineral properties are situated within the regional mineralization trend of the Andahuaylas-Yauri belt and provide Hudbay with a large, contiguous block of mineral rights to explore for mineable deposits within trucking distance of the Constancia processing facility. The appendix attached to this news release highlights the location of the acquired mining properties relative to Hudbay’s Constancia mine and the Pampacancha deposit.\nForward-Looking Information\nThis news release contains “forward-looking statements” and “forward-looking information” (collectively, “forward-looking information”) within the meaning of applicable Canadian and United States securities legislation. All information contained in this news release, other than statements of current and historical fact, is forward-looking information. Often, but not always, forward-looking information can be identified by the use of words such as “plans”, “expects”, “budget”, “guidance”, “scheduled”, “estimates”, “forecasts”, “strategy”, “target”, “intends”, “objective”, “goal” “understands”, “anticipates” and “believes” (and variations of these or similar words) and statements that certain actions, events or results “may”, “could”, “would”, “should”, “might” “occur” or “be achieved” or “will be taken” (and variations of these or similar expressions). All of the forward-looking information in this news release is qualified by this cautionary note.\nForward-looking information includes, but is not limited to, statements related to, among other things, Hudbay’s objectives, strategies, and intentions, its future financial and operating performance and prospects and its expectations as to the exploration and potential of the mining properties it has acquired in Peru. Forward-looking information is not, and cannot be, a guarantee of future results or events. Forward-looking information is based on, among other things, opinions, assumptions, estimates and analyses that, while considered reasonable by Hudbay at the date the forward-looking information is provided, inherently are subject to significant risks, uncertainties, contingencies and other factors that may cause actual results and events to be materially different from those expressed or implied by the forward-looking information. The material factors or assumptions that Hudbay identified and were applied by Hudbay in drawing conclusions or making forecasts or projections set out in the forward-looking information include, but are not limited to, the execution of Hudbay’s business and growth strategies, including the success of its strategic investments and initiatives; the availability of additional financing, if needed; the ability to complete project targets on time and on budget and other events that may affect Hudbay’s ability to develop its projects; and no significant and continuing adverse changes in general economic conditions or conditions in the financial markets.\nThe risks, uncertainties, contingencies and other factors that may cause actual results to differ materially from those expressed or implied by the forward-looking information may include, but are not limited to, risks generally associated with the mining industry, such as economic factors (including future commodity prices, currency fluctuations, energy prices and general cost escalation), risks related to the schedule for mining the Pampacancha deposit (including the timing and cost of acquiring the required surface rights), risks related to political or social unrest or change, risks in respect of aboriginal and community relations, rights and title claims, operational risks and hazards, including unanticipated environmental, industrial and geological events and developments and the inability to insure against all risks, failure of plant, equipment, processes, transportation and other infrastructure to operate as anticipated, compliance with government and environmental regulations, including permitting requirements and anti-bribery legislation, depletion of Hudbay’s reserves, volatile financial markets that may affect Hudbay’s ability to obtain additional financing on acceptable terms, the failure to obtain required approvals or clearances from government authorities on a timely basis, uncertainties related to the geology, continuity, grade and estimates of mineral reserves and resources, and the potential for variations in grade and recovery rates, uncertain costs of reclamation activities, Hudbay’s ability to comply with its pension and other post-retirement obligations, Hudbay’s ability to abide by the covenants in its debt instruments and other material contracts, tax refunds, hedging transactions, as well as the risks discussed under the heading “Risk Factors” in Hudbay’s most recent annual information form.\nShould one or more risk, uncertainty, contingency or other factor materialize or should any factor or assumption prove incorrect, actual results could vary materially from those expressed or implied in the forward-looking information. Accordingly, the reader should not place undue reliance on forward-looking information. Hudbay does not assume any obligation to update or revise any forward-looking information after the date of this news release or to explain any material difference between subsequent actual events and any forward-looking information", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/9d9d3efb-2d50-4d61-9be5-64f7243288ab", "https://www.globenewswire.com/NewsRoom/AttachmentNg/37b1b962-076f-453a-ac24-bc73c93319dc/en", "http://www.globenewswire.com/NewsRoom/AttachmentNg/37b1b962-076f-453a-ac24-bc73c93319dc", "http://www.hudbayminerals.com/files/PeruMap.pdf"], "published": "2018-01-09T01:00:00.000+02:00", "crawled": "2018-01-09T09:40:58.916+02:00", "highlightTitle": ""}