{"organizations": [], "uuid": "24fedc3d21c360392fbe18ab2d5604042cd837a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-biorestorative-therapies-announces-the-appointment-of-adam-d-bergstein-as-sr-vp-planning-and-business-development.html", "country": "US", "domain_rank": 767, "title": "BioRestorative Therapies Announces the Appointment of Adam D. Bergstein as Sr. VP, Planning and Business Development", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:00:00.000+02:00", "replies_count": 0, "uuid": "24fedc3d21c360392fbe18ab2d5604042cd837a9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-biorestorative-therapies-announces-the-appointment-of-adam-d-bergstein-as-sr-vp-planning-and-business-development.html", "ord_in_thread": 0, "title": "BioRestorative Therapies Announces the Appointment of Adam D. Bergstein as Sr. VP, Planning and Business Development", "locations": [], "entities": {"persons": [{"name": "adam d. bergstein", "sentiment": "negative"}, {"name": "adam bergstein", "sentiment": "none"}, {"name": "bergstein", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "melville", "sentiment": "none"}], "organizations": [{"name": "biorestorative therapies, inc.", "sentiment": "neutral"}, {"name": "pharmashield", "sentiment": "none"}, {"name": "j.l. kellogg graduate school of management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELVILLE, N.Y., Jan. 22, 2018 (GLOBE NEWSWIRE) -- BioRestorative Therapies, Inc. (\"BioRestorative\" or the “Company\") (OTC:BRTX), a life sciences company focused on stem cell-based therapies, today announced the appointment of Adam Bergstein as Senior Vice President, Planning and Business Development. In this capacity, Mr. Bergstein will be responsible for strategic planning, business development, capital market activities and related endeavors.\nFrom 2008 until 2017, Mr. Bergstein founded and operated PharmaShield, an analytics company that created the first known data model that accurately predicts litigation loss and the timing of outcomes in branded pharmaceutical patent cases. From 2006 through 2008, Mr. Bergstein worked as a consultant to a health economics group inside RAND Corporation, during which time he created derivatives to help mitigate risk within the broader healthcare markets. From 1998 through 2006, Mr. Bergstein was a private equity investor in the healthcare and technology sectors.\nMr. Bergstein has an MBA from the J.L. Kellogg Graduate School of Management with concentrations in finance and organizational behavior, as well as a Bachelor of Arts degree in Economics with distinction from the University of Pennsylvania.\n“Based on the 33 human patients that received the precursor to BRTX-100 , I believe that BioRestorative’s disc therapy stands an excellent chance of receiving regulatory clearance from the FDA within a relatively short time frame. I believe the therapy will significantly improve the lives of so many with chronic lumbar disc disease,” Mr. Bergstein commented.\nMark Weinreb, CEO of BioRestorative, further commented, \"We are extremely excited to have Adam join BioRestorative at this important time of our development. With his industry expertise, capital markets experience and impressive track record, Adam will be a strong addition to our senior management team as we accelerate our clinical, regulatory and business development activities.”\nAbout BioRestorative Therapies, Inc.\nBioRestorative Therapies, Inc. ( www.biorestorative.com ) develops therapeutic products using cell and tissue protocols, primarily involving adult stem cells. Our two core programs, as described below, relate to the treatment of disc/spine disease and metabolic disorders:\n• Disc/Spine Program (brtxDISC™): Our lead cell therapy candidate, BRTX-100, is a product formulated from autologous (or a person’s own) cultured mesenchymal stem cells collected from the patient’s bone marrow. We intend that the product will be used for the non-surgical treatment of protruding and bulging lumbar discs in patients suffering from chronic lumbar disc disease. The BRTX-100 production process involves collecting a patient’s bone marrow, isolating and culturing stem cells from the bone marrow and cryopreserving the cells. In an outpatient procedure, BRTX-100 is to be injected by a physician into the patient’s damaged disc. The treatment is intended for patients whose pain has not been alleviated by non-invasive procedures and who potentially face the prospect of surgery. We have received clearance from the Food and Drug Administration to commence a Phase 2 clinical trial using BRTX-100 to treat chronic lower back pain due to degenerative disc disease related to protruding/bulging discs.\n• Metabolic Program (ThermoStem®): We are developing a cell-based therapy to target obesity and metabolic disorders using brown adipose (fat) derived stem cells to generate brown adipose tissue (“BAT”). BAT is intended to mimic naturally occurring brown adipose depots that regulate metabolic homeostasis in humans. Initial preclinical research indicates that increased amounts of brown fat in the body may be responsible for additional caloric burning as well as reduced glucose and lipid levels. Researchers have found that people with higher levels of brown fat may have a reduced risk for obesity and diabetes.\nForward-Looking Statements\nThis press release contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and such forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. You are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances, events or results to differ materially from those projected in the forward-looking statements as a result of various factors and other risks, including those set forth in the Company's Form 10-K filed with the Securities and Exchange Commission. You should consider these factors in evaluating the forward-looking statements included herein, and not place undue reliance on such statements. The forward-looking statements in this release are made as of the date hereof and the Company undertakes no obligation to update such statements.\nCONTACT:\nEmail: ir@biorestorative.com\nSource:BioRestorative Therapies, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/4a8189c4-9ed5-4ccf-955f-a9ea0f9bf034", "https://www.globenewswire.com/Tracker?data=tYYfb6OR0FRj0FlISXwe71yHb6X6uwNv5GcRBnI5U0BB7JmoNyM_k9e7vHXkRgqlkYEUesor58VfESEF1IH7kId_JfmLCylR6QKcC80sZes="], "published": "2018-01-22T19:00:00.000+02:00", "crawled": "2018-01-22T20:12:22.002+02:00", "highlightTitle": ""}