{"organizations": [], "uuid": "08af940e2a6fc8215da516b9ab3efdeb971038e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-peapack-gladstone-bank-announces-appointment-of-david-santom-senior-vice-president-head-of-asset-management-peapack-capital.html", "country": "US", "domain_rank": 767, "title": "Peapack-Gladstone Bank Announces Appointment of David Santom, Senior Vice President, Head of Asset Management, Peapack Capital, a Subsidiary of Peapack-Gladstone Bank", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.435, "site_type": "news", "published": "2018-01-04T20:37:00.000+02:00", "replies_count": 0, "uuid": "08af940e2a6fc8215da516b9ab3efdeb971038e1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-peapack-gladstone-bank-announces-appointment-of-david-santom-senior-vice-president-head-of-asset-management-peapack-capital.html", "ord_in_thread": 0, "title": "Peapack-Gladstone Bank Announces Appointment of David Santom, Senior Vice President, Head of Asset Management, Peapack Capital, a Subsidiary of Peapack-Gladstone Bank", "locations": [], "entities": {"persons": [{"name": "david santom", "sentiment": "neutral"}, {"name": "santom", "sentiment": "none"}], "locations": [{"name": "bedminster", "sentiment": "none"}, {"name": "marlborough", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}], "organizations": [{"name": "peapack-gladstone financial corporation", "sentiment": "neutral"}, {"name": "peapack capital", "sentiment": "neutral"}, {"name": "peapack-gladstone bank", "sentiment": "neutral"}, {"name": "equipment management at santander equipment finance", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "cit capital equipment finance", "sentiment": "none"}, {"name": "peapack-gladstone bank with", "sentiment": "none"}, {"name": "pgc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEDMINSTER, NJ, Jan. 04, 2018 (GLOBE NEWSWIRE) -- Peapack-Gladstone Financial Corporation (NASDAQ Global Select Market: PGC) and Peapack-Gladstone Bank are proud to introduce a new member of the team of private bankers at Peapack Capital, a subsidiary of the Bank, which focuses on equipment finance and leasing. Based out of Marlborough, Massachusetts, David Santom, Senior Vice President, Head of Asset Management at Peapack Capital is now responsible for all aspects of the Asset Management function at Peapack Capital including equipment valuations and reviews, portfolio analyses, end of lease negotiations, equipment inspections and dispositions.\nDavid Santom, Senior Vice President, Head of Asset Management, Peapack Capital, a subsidiary of Peapack-Gladstone Bank\nWith over 33 years of experience in the equipment finance industry, Mr. Santom’s knowledge and experience are invaluable to the institution. He most recently served as Director of Equipment Management at Santander Equipment Finance, as well as at CIT Capital Equipment Finance, where he was responsible for all asset management functions of the business units. Prior to that, Mr. Santom served as Vice President of Northeast Operations at Asset Control Services, Inc., a provider of equipment appraisals, equipment inspections, and remarketing services to the equipment finance industry. Additionally, as Vice President at John Hancock Leasing Corporation, David managed a full spectrum of leasing acquisitions and financings, with transaction sizes ranging from $500,000 to $20 million. He started his equipment finance career with American Finance Group, an independent lessor in Boston, Massachusetts.\nA resident of Westborough, Massachusetts, Mr. Santom earned a Bachelor of Science Degree in Civil Engineering from the University of Pennsylvania and an MBA in Finance from Boston College, Wallace E. Carroll Graduate School of Management where he was the recipient of the annual MBA Alumni Award. He is a member of the Equipment Leasing and Finance Association (ELFA).\nPeapack-Gladstone Financial Corporation is a New Jersey bank holding company with total assets of $4.18 billion as of September 30, 2017. Founded in 1921, Peapack-Gladstone Bank is a commercial bank that provides innovative private banking services to businesses, non-profits and consumers, which help them to establish, maintain and expand their legacy. Through its private banking locations in Bedminster, Morristown, Princeton and Teaneck, its private wealth management, commercial private banking, retail private banking and residential lending divisions, along with its online platforms, Peapack-Gladstone Bank offers an unparalleled commitment to client service.\nContact: Rosanne Schwab Peapack-Gladstone Bank Assistant Vice President, Public Relations and Corporate Communications Manager 500 Hills Drive, Suite 300 Bedminster, NJ 07921 rschwab@pgbank.com (908) 719-6543\nSource:Peapack-Gladstone Financial Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/282c7520-2371-4b9d-92a0-1e301e8fc675/en", "https://www.globenewswire.com/NewsRoom/AttachmentNg/53b6bb79-23d0-48f1-86d7-afdb745bcf7e"], "published": "2018-01-04T20:37:00.000+02:00", "crawled": "2018-01-04T23:05:42.000+02:00", "highlightTitle": ""}