{"organizations": [], "uuid": "10deeda8547762a0808b39265a961bee7605b799", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 14, "shares": 14, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104978098-GettyImages-599512774.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/uk-theresa-may-wants-more-trade-with-china-beijing-wants-belt-and-road-endorsement.html", "country": "US", "domain_rank": 767, "title": "UK's May wants free trade with China. Beijing has its own goals", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-31T08:41:00.000+02:00", "replies_count": 0, "uuid": "10deeda8547762a0808b39265a961bee7605b799"}, "author": "Huileng Tan", "url": "https://www.cnbc.com/2018/01/31/uk-theresa-may-wants-more-trade-with-china-beijing-wants-belt-and-road-endorsement.html", "ord_in_thread": 0, "title": "UK's May wants free trade with China. Beijing has its own goals", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "etienne oliveau", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "road uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "hangzhou", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "British Prime Minister Theresa May landed on Wednesday in China , where she will be seeking a free trade agreement ahead of the U.K. exiting the European Union trade bloc.\nBeijing knows that, and Chinese leaders are thought to be looking for something themselves: an endorsement of President Xi Jinping's pet project, the Belt and Road Initiative .\nMay, for her part, said the project has a lot of potential, but cautioned that the initiative had to be carried out in the proper way, Reuters reported. \n\"What I would like to see is ensuring that we have transparency and international standards being adhered to, and I will be discussing that with my Chinese interlocutors,\" May said.\nA spokesman for the prime minister's office declined to comment on whether May would endorse the Belt and Road plan, the Financial Times reported .\nThe British reticence over the Belt and Road Initiative stems from Western concerns about Chinese firms dominating a widening swath of the globe, said Rajiv Biswas, Asia Pacific chief economist at IHS Markit.\nThe Belt and Road Initiative aims to connect Asia, Europe, the Middle East and Africa with a vast logistics and transport network, using roads, ports, railway tracks, pipelines, airports, transnational electric grids and even fiber optic lines. The plan, which continues to evolve, at one point included 65 countries, which together accounted for one-third of global GDP and 60 percent of the world's population, or 4.5 billion people, according to Oxford Economics.\nIt's all part of Beijing's push to increase global clout — building modern infrastructure can attract more investment and trade along the route. The policy could also boost the domestic economy with demand abroad, and might soak up some of the overcapacity in China's industrial sector .\nMay's reservations about the Belt and Road project are notable since China launched its first freight service by train to the U.K. in 2017.\nThe service runs from the Chinese city of Yiwu, in the country's eastern Zhejiang province, to Barking in London. The journey takes 18 days.\nWith that, the U.K. can already claim to be at the far end of the Belt and Road route, Nicholas Holt, the Asia Pacific head of research at real estate agency Knight Frank, told CNBC.\nChina has been pushing hard ahead of May's visit to sell the Belt and Road project to the British with the Chinese envoy to the U.K. touting a new \"Golden Era\" for two countries.\nThat phrase was used during Xi's high-profile visit to the U.K. in 2015.\nThe relationship between the two naitons, however, is seen to have cooled after May's government ordered a review of a Chinese investment in a nuclear power plant in 2016.\nTrading ties Beijing knows the U.K. needs more business with China to help bolster the country's position ahead of Brexit. \nA delegation of 50 business leaders joined May for her three-day state visit. She touched down in the central Chinese city of Wuhan — a university city where she is expected to announce education deals — before moving onto Beijing and Shanghai .\nIn 2016, exports to China were just 3.1 percent of U.K. exports, so there is scope for more trade, Biswas said.\nThe Chinese state media is hyping the benefits of a closer relationship that could follow Brexit.\nshow chapters May: UK will be advocate of free trade      10:59 AM ET Thu, 25 Jan 2018 | 03:01 \"Upgrading China-U.K. relations and securing Chinese investments would effectively help to ease the ensuing withdrawal pains the U.K. is expected to suffer,\" state-owned China Daily said in an editorial this week touting the \"reboot\" of Sino-U.K. ties.\n\"And since Downing Street has its eyes on the 'huge trade opportunities' in China's market of more than 1.3 billion consumers for U.K. businesses, there is no reason for it not to take advantage of China's pro-globalization efforts, those under the Belt and Road Initiative in particular\" the paper added.\nBritish businesses will be rewarded \"handsomely\" due to the global reach of the Belt and Road, the editorial said.\nHua Chunying, a spokeswoman for China's foreign ministry, said at a news conference on Tuesday that the Belt and Road is an \"open and inclusive platform for cooperation.\"\nBoth China and the U.K. can cooperate on the route for \"mutually beneficial and win-win results,\" she said, using a frequent refrain from Beijing's foreign policy rhetoric.\n—Reuters contributed to this report.", "external_links": [], "published": "2018-01-31T08:41:00.000+02:00", "crawled": "2018-01-31T08:40:55.007+02:00", "highlightTitle": ""}