{"organizations": [], "uuid": "0cff88814efd07be12545bb17578cf5d7fc66e60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/oil-refineries-gunvor/gunvor-gets-go-ahead-for-rotterdam-refinery-upgrade-for-new-shipping-fuels-idUSL8N1PK3LJ", "country": "US", "domain_rank": 408, "title": "Gunvor gets go-ahead for Rotterdam refinery upgrade for new shipping fuels", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T21:05:00.000+02:00", "replies_count": 0, "uuid": "0cff88814efd07be12545bb17578cf5d7fc66e60"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/oil-refineries-gunvor/gunvor-gets-go-ahead-for-rotterdam-refinery-upgrade-for-new-shipping-fuels-idUSL8N1PK3LJ", "ord_in_thread": 0, "title": "Gunvor gets go-ahead for Rotterdam refinery upgrade for new shipping fuels", "locations": [], "entities": {"persons": [{"name": "gunvor", "sentiment": "negative"}, {"name": "seth pietras", "sentiment": "none"}], "locations": [{"name": "rotterdam", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "gunvor", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "international maritime organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 25 (Reuters) - The Netherlands has given provisional approval to Gunvor to add a fuel upgrading unit at its Rotterdam refinery, according to a document seen by Reuters, as the international oil trader prepares for tough new environmental rules on shipping fuels.\nThe rules from the International Maritime Organization (IMO), due to come into effect in 2020, aim to cut sulphur emissions produced by ships, creating a challenge for shipping companies and oil refiners.\nRefiners have to decide whether to invest in new capacity to convert the old-style bunker shipping fuel - known as high-sulphur fuel oil - into higher quality products such as diesel.\nThe Dutch authorities, in a decision published early last month, told Gunvor that it would not have to conduct an environmental assessment to move forward with construction of the upgrade facility, known as a delayed coker unit, which would allow the refinery to turn high-sulphur fuel into various types of diesel.\nGunvor spokesman Seth Pietras said the company had not yet determined whether it would build the unit.\n“Gunvor is currently studying several options for how best to respond to the IMO decision,” Pietras said. “We have not made any decision yet.”\nA number of oil big oil companies, including ExxonMobil and Total, have invested in similar refinery upgrades to produce lower sulphur fuels in advance of the new shipping rules and also in response to tighter rules worldwide limiting sulphur in automotive fuels.\nThe bulk of Europe’s refineries have not yet made preparations for the tighter rules though experts have said some could struggle to stay profitable if they do not act.\nIn an interview with Reuters in October, Gunvor founder Torbjorn Tornqvist said the company was “making preparations” for the shipping fuel change, but declined to comment on what would be included in those plans.\n“We expect to run our refineries. There is no doubt about that,” Tornquist said.\nGunvor’s Rotterdam refinery has a capacity of 88,000 barrels per day (bpd). (Reporting By Libby George and Julia Payne. Editing by Jane Merriman)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T21:05:00.000+02:00", "crawled": "2018-01-26T21:37:28.000+02:00", "highlightTitle": ""}