{"organizations": [], "uuid": "f5547ac1c616cb48754e3cf1c22d9b417f5d8e7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/05/103523251-20160405-_95A1338.1910x1000.JPG", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/ceo-elle-kaplan-eq-can-make-you-successful-according-to-science.html", "country": "US", "domain_rank": 767, "title": "CEO Elle Kaplan: EQ can make you successful, according to science", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T17:25:00.000+02:00", "replies_count": 0, "uuid": "f5547ac1c616cb48754e3cf1c22d9b417f5d8e7d"}, "author": "Elle Kaplan", "url": "https://www.cnbc.com/2018/01/16/ceo-elle-kaplan-eq-can-make-you-successful-according-to-science.html", "ord_in_thread": 0, "title": "CEO Elle Kaplan: EQ can make you successful, according to science", "locations": [], "entities": {"persons": [{"name": "elle kaplan", "sentiment": "negative"}, {"name": "warren buffett", "sentiment": "neutral"}, {"name": "tilman fertitta", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aspiring for more success and wealth drives most to concentrate on boosting their IQ levels for that competitive edge. While I fully advocate sharpening your skills and memory , for holistic self-development, there's an often overlooked factor that's equally important: building your EQ.\nEQ, or emotional intelligence, is just as if not more vital for a person's growth. Extensive studies show that it plays a huge role in building one's personal and financial success. One even tracked a group of people from age one to 30 and found that EQ was the single biggest predictor of monetary success. \nThe good news is that one's emotional intelligence is something that can be shaped through habits to deliver wealth and achievement. Without further ado, see what traits you need to focus on to boost your EQ and future success:\nshow chapters The world's greatest leaders have these traits in common      9:14 AM ET Thu, 10 Aug 2017 | 00:59 1. Take control of your emotional state Warren Buffett once said that \"if you can't control your emotions, you can't control your money.\"\nTo shape your fate, you need to harness your emotions. Your mind is a powerful tool, and it can't work to full capacity if you're hindering it with irrational feelings, like anger. This is truer than ever when it comes to money, where emotional spending or investing can wreak havoc on your finances.\nTo manage your emotions, you need to see situations through a rational, long-term lens. Don't let temporary emotional states become permanent mistakes.\nOne technique that most successful people use, including Warren Buffett, is the 10:10:10 method . Before arriving at conclusions, ask yourself how this will make you feel after 10 minutes, 10 months and 10 years. Giving utmost consideration to your future self is key in creating a successful mental and emotional state.\n2. Learn how to lead different personalities For billionaire and hospitality titan Tilman Fertitta, one of the key secrets to success is being an adaptive people person. It's what helped his company, Landry's Inc., become one of America's most powerful and far-reaching restaurant corporations.\n\"People want to be led, but you've got to know how to lead different people,\" Fertitta says . \"I treat everybody differently depending on how I've evaluated that person. And if you do it that way in business, you're going to be a lot more successful.\"\nshow chapters A self-made billionaire's best advice for 20-year-olds      9:00 AM ET Tue, 6 Dec 2016 | 00:53 3. Be curious Innate curiosity makes a child develop new skills. This is also the same case for adults who do not lose their curiosity in life. Even Steve Jobs acknowledged the fact that his voracious curiosity led him to success in life.\nResearch shows that curiosity prepares the brain for learning. It drives you to get involved in things you have not encountered before and therefore stops you from procrastinating. It also opens your mind to new concepts that are useful in order for you to progress in your endeavors. By being able to instinctively recognize gaps, you're able to generate tools to improve your performance.\n4. Impose self-discipline Discipline acts as your compass providing directions to your goals. It is like an imaginary voice inside your head telling you what to do or what to avoid depending on how you think it will be instrumental to your future success.\nIt is also a powerful tool when it comes to growing your wealth. Taking the time to impose self-discipline with the financial decisions you make today impacts your success tomorrow. By sticking to your long-term goals , regardless of ups and downs, you'll find returns that are more substantial over time.\n5. Be empathetic For Oprah Winfrey , leadership is all about empathy. It is about having the ability to relate to and connect with people to empower them.\nWe need to belong to grow as an individual and at the same time develop our own identity. However, along the way, we often neglect the significance of others in our lives as we focus only on ourselves. But if you want higher chances of success, you need to have empathy.\nElle Kaplan, Founder and CEO of LexION Capital Our EQ feeds on how much empathy we have for other people. It is in our ability to recognize others' need that we learn to sacrifice and go the extra mile. If you only do things for your own benefit and forget about compassion, you'll will find it hard to move forward as we will become difficult to work or get along with.\n6. Handle rejection On our quest for success and happiness, it's inevitable that things will not always go as planned. It's important to remember that progress is largely driven by mindset. Negative thoughts and feelings can often be hard to shake, causing our ability to focus on a goal that much harder. The best thing to do is channel them into means of motivation.\nSuccessful people know how to move on and leave the past in the past. If you latch onto to your latest mistakes they will inevitably slow and bring you down. Instead, learn from them, see challenges as opportunities (sometimes to even bigger challenges), surround yourself with positivity and stop complaining.\n7. Constantly seek out people smarter than you In today's hyper-competitive business world, one might think that ultra-successful people wouldn't even give each other the time of day.\nThe opposite tends to be true, like with Former Starbucks Founder Howard Schultz , who said \"Don't be threatened by people smarter than you.\"\nWhether it's meeting with a competitor to exchange information , or seeking out a mentor, the path to billionaire status involves constantly seeking out brighter and more talented people, rather than trying to squash them.\nElle Kaplan is the founder and CEO of LexION Capital , a fiduciary wealth management firm in New York City serving high-net-worth individuals. She is also the Chief Investment Officer and Portfolio Manager at LexION Alpha , her systematic hedge fund that will soon be open to new investments. It is one of the only women-owned and run hedge funds in the nation. \nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: 4 ways you can overcome self-doubt and achieve success \nVideo by Nate Skid \nshow chapters The trait shared by billionaires around the world      9:32 AM ET Thu, 9 March 2017 | 00:52", "external_links": [], "published": "2018-01-16T17:25:00.000+02:00", "crawled": "2018-01-16T17:26:04.022+02:00", "highlightTitle": ""}