{"organizations": [], "uuid": "e5a80088fe42700adbabe3efb7c77c08b7af8cb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/media", "section_title": "Media | Reuters.com", "url": "https://www.reuters.com/article/usa-trump-russia-bannon/bannon-calls-trump-jr-meeting-with-russians-treasonous-book-idUSL1N1OY0KF", "country": "US", "domain_rank": 408, "title": "Bannon calls Trump Jr meeting with Russians 'treasonous' -book", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-04T00:42:00.000+02:00", "replies_count": 0, "uuid": "e5a80088fe42700adbabe3efb7c77c08b7af8cb9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-trump-russia-bannon/bannon-calls-trump-jr-meeting-with-russians-treasonous-book-idUSL1N1OY0KF", "ord_in_thread": 0, "title": "Bannon calls Trump Jr meeting with Russians 'treasonous' -book", "locations": [], "entities": {"persons": [{"name": "trump jr", "sentiment": "negative"}, {"name": "bannon", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "donald trump jr.", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "jared kushner", "sentiment": "none"}, {"name": "paul manafort", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "trump tower", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "trump white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Editors: note language in paragraph 5)\nWASHINGTON, Jan 3 (Reuters) - Former White House chief strategist Steve Bannon has called a June 2016 meeting with a group of Russians attended by Donald Trump Jr. and his father’s top campaign officials “treasonous” and “unpatriotic,” according to excerpts of a new book seen by Reuters on Wednesday.\nBannon expressed derision and astonishment over the meeting in Trump Tower in New York in which a Russian lawyer was said to be offering damaging information about Democratic presidential candidate Hillary Clinton, according to the book “Fire and Fury: Inside the Trump White House” by Michael Wolff.\nThe meeting arranged by Trump’s son also included Trump’s son-in-law, Jared Kushner, and then-campaign chairman Paul Manafort. It has become part of a federal investigation into potential collusion between the Trump campaign and Russia in the election. Trump has denied any such collusion.\n“The three senior guys in the campaign thought it was a good idea to meet with a foreign government inside Trump Tower in the conference room on the 25th floor - with no lawyers. They didn’t have any lawyers,” Bannon said in the book in excerpts seen by Reuters.\n“Even if you thought that this was not treasonous, or unpatriotic, or bad shit, and I happen to think it’s all of that, you should have called the FBI immediately.”\nWhen an intermediary proposed the meeting, saying the Russians were offering damaging information about Clinton, Trump Jr. responded in an email, “I love it.”\nBannon was incredulous about the meeting shortly after it was revealed, according to the book, concluding sarcastically, “That’s the brain trust they had.”\nThe book, due out next Tuesday, was based on more than 200 interviews with Trump, senior White House staffers and confidantes conducted by Wolff, a contributing editor for The Hollywood Reporter, according to publisher Henry Holt.\nThere was no immediate comment from the White House or Bannon on the book details, first reported by the Guardian. The Trump Organization did not immediately respond to a request for comment from Trump Jr.\nBannon became Trump’s campaign manager in the months before the November 2016 election, but after the Trump Tower meeting, and was chief White House strategist during the turbulent first eight months of Trump’s presidency.\nTrump fired Bannon in August, removing a far-right architect of his election victory and a driving force behind his nationalist and anti-globalization agenda.\nIn the book, Bannon also said he believed the investigation into possible collusion between the Trump campaign and Moscow will focus on money laundering.\n“They’re going to crack Don Junior like an egg on national TV,” Bannon was Quote: d as saying.\nManafort and business associate Rick Gates, who also worked on Trump’s campaign, pleaded not guilty in November to federal charges brought by special counsel Robert Mueller including conspiracy to launder money, conspiracy against the United States and failing to register as foreign agents of Ukraine’s former pro-Russian government.\nAdditional reporting by Jim Oliphant; Writing by Doina Chiacu; Editing by Will Dunham\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T00:42:00.000+02:00", "crawled": "2018-01-04T08:07:37.034+02:00", "highlightTitle": ""}