{"organizations": [], "uuid": "4d89b01130c9dbfe371d2120dba76d114947f3bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-incorta-expands-executive-roster-with-two-new-hires.html", "country": "US", "domain_rank": 767, "title": "Incorta Expands Executive Roster with Two New Hires", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T14:00:00.000+02:00", "replies_count": 0, "uuid": "4d89b01130c9dbfe371d2120dba76d114947f3bd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-incorta-expands-executive-roster-with-two-new-hires.html", "ord_in_thread": 0, "title": "Incorta Expands Executive Roster with Two New Hires", "locations": [], "entities": {"persons": [{"name": "osama elkady", "sentiment": "none"}, {"name": "aran nathanson", "sentiment": "none"}, {"name": "meyer", "sentiment": "none"}, {"name": "karl", "sentiment": "none"}, {"name": "karl meyer", "sentiment": "none"}], "locations": [{"name": "san mateo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "incorta", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "aran", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN MATEO, Calif., Jan. 03, 2018 (GLOBE NEWSWIRE) -- Incorta , the enterprise analytics platform that bypasses data modeling to deliver real-time insights straight from operational data, today announced two new executive hires: Karl Meyer as vice president of business development and Aran Nathanson as vice president of product.\n“2017 truly was a pivotal year for Incorta, and I’m happy to see that momentum carry into 2018 with these critical additions to our executive team,” said Osama Elkady, chief executive officer (CEO) of Incorta. “Karl’s straightforward, down-to-earth approach and broad experience with Silicon Valley startups already are paying dividends for our business development efforts. And, with Aran and his adventurous spirit, we gain a credible, influential product leader our engineers trust to task them with interesting, pertinent analytics challenges and also equip them with whatever means they need to overcome them.”\nMeyer is a recognized leader in driving transformational change at Fortune 100 companies, possessing more than 20 years of experience with corporate strategy, business development, and product management at global technology firms as well as venture-backed startups. In this new role at Incorta, Meyer is focused on building a robust, multi-faceted partner ecosystem comprised of technology partners—hardware platforms, existing analytics players, and other large-scale enterprise applications—with whom Incorta’s technology will integrate; system integrators interested in embedding Incorta’s technology within their own solutions; and traditional go-to-market partners, such as resellers and distributors.\nImmediately prior to Incorta, Meyer founded and grew the enterprise business development function at leading venture capital firm Kleiner Perkins, and before that drove the strategy behind Hewlett Packard Enterprise’s hybrid cloud and advanced analytics transformation areas.\n“I’ve always believed business users know what they need to do—they just don’t have the data access or tools needed to do it,” said Meyer. “I ran one of the largest strategy teams at Hewlett Packard Enterprise, and one-third of my team’s time was wasted on rudimentary, non-strategic tasks related to locating, accessing, and attempting to understand key business data. Unfortunately, not much has changed since then. Even so-called data analytics innovations pitched to us when I was with Kleiner Perkins were merely companies finding new ways to copy data or hiring flocks of data scientists for increased manpower—they weren’t actually innovating a new concept. Incorta, on the other hand, is true advancement that will make possible a whole new set of analytics capabilities not even envisioned before. I’m excited to help Incorta’s experienced enterprise team develop a robust partner network that more quickly brings Incorta’s unique, game-changing analytics platform to a wider, global audience.”\nAs vice president of product, Nathanson is responsible for managing and translating stakeholder product requirements into manageable “chunks” that guide Incorta engineers on the strategic iteration of the analytics platform. Before Incorta, Nathanson co-founded, bootstrapped, and built to $5 million in annual revenue the advanced report generation, distribution, and scheduling application Vizubi, which sold for a substantial profit to data analytics platform Qlik in 2014. Post-acquisition, Nathanson led product strategy for the former Vizubi product (renamed QlikView NPrinting), increasing its annual revenue by more than five times in its first year.\n“I wanted to join a small, dynamic company that solves an interesting business problem, and Incorta met those requirements in spades,” said Nathanson. “The speed at which Incorta users can arrive at interesting insights is simply unheard of in the traditional enterprise analytics space. As an engineering organization, Incorta needs to match that kind of speed and agility via a structured, repeatable development process that efficiently delivers ongoing innovation and ever-expanding ease of use to Incorta customers. I’m extremely pleased to join Incorta’s experienced leadership team and look forward to working with its very talented engineers.”\nMeyer holds a Bachelor of Arts in Mathematical Economics from Pomona College and also studied British Economic Policy at Oxford University. Nathanson holds a Bachelor of Arts in Biology from the University of Pennsylvania, and a Master of Business Administration in Finance and International Business from the NYU Stern School of Business.\nAbout Incorta\nIncorta’s enterprise analytics platform aggregates complex business data in real-time, augmenting—or bypassing—the need for a traditional data warehouse. Powered by the industry’s first Direct Data Mapping TM engine, Incorta provides unprecedented query performance and eliminates costly join operations altogether. Incorta’s powerful software engine allows companies to go from transactional data directly to business analytics at speeds unheard of in the current analytics environment. Incorta reduces from months to days the time required to roll out new analytics applications, and reduces query and reporting times from hours to seconds.\nInnovative, fast-growth companies—including one of the three largest consumer electronics companies, one of the largest global social media companies, a top 10 private university , Broadcom , Shutterfly, and Toast —rely on Incorta to gain secure, sub-second access to meaningful business insight.\nBacked by GV (formerly Google Ventures) and Kleiner Perkins, Incorta is deployed in the Fortune 10, and powers analytics for some of the world’s largest and fastest-growing companies.\nTo learn the fastest way to what matters, visit www.incorta.com or join the conversation on Twitter @incorta.\nMedia Contact Emily Lewis emily.lewis@incorta.com\nSource:Incorta, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/afda5557-1eba-4d9d-8be3-dd6b65f10bec", "https://www.globenewswire.com/Tracker?data=4cEGSmLv5bmo4FRsy47heD9qPBXzNhAYGDyy5RpxNlmuvb665ubTY1BSyDk05bKt-taRvS5TDdUGWtTfyAvR6g==", "https://www.globenewswire.com/Tracker?data=Sgr4Nr025wn9s0kN5bX9LHJ4UKEawhGqF882J5q4-5gq4p4PfTTWEsMGa4wfUde_zYrYAnG_C5j2NVBlXWDVNsL_gU_QACfnQIYskuWEidY=", "https://www.globenewswire.com/Tracker?data=YrSoZoy7_ze6P45hamQD_0RLdpI5lQlbKVpiyx9pdtUet2mIiZVeEoNDbIQHwBp6P8Dgf_irANOyAHbpYrMXlBwu90h6ZZqgx1ZUmJn044bk22jmSr2dDgoavF0qDydIyqgndXjL7g3Hg_EEVH8uQRGaDOiDiw5D06SGoKUnZLA=", "https://www.globenewswire.com/Tracker?data=qVrTt2M41kTFIiL8eVnpTss_-fwOgc6wGz-R8OACpp5h6OzWQ36dh-hLfr3B9k55fGnmyqTx0ttS59JrZ_wiA_8kPwCQh4JW9h6qG8fZ-BQ=", "https://www.globenewswire.com/Tracker?data=NDM0j1Ghv-1J1mFwM_gkIUIMAl6KAi78ChO-uKPU4zwG_h7PsRlq_NrsBRND5TelmUYg1e8y8xAiHXNoyDi6sDA8CuprRnMrqK9N4uPfTwQ=", "https://www.globenewswire.com/Tracker?data=G38nkvaHoOhz-IghGbQFEpzUYaOqupNqO93qMCk8LT5JQrtekVASLViKROJZP7VQ", "https://www.globenewswire.com/Tracker?data=gaJIFdqSkvqF_LCbA-ebBxsmYR7hAv7QybO0mu-WbUPjPDPltG-d3WeJYiHlROYI5Gxey8c0h3R0SfHsP4lKzNu9vgpslTZ-LsIQB5ftpT7-1etkxo5Kao8B0YL8-DAJ"], "published": "2018-01-03T14:00:00.000+02:00", "crawled": "2018-01-03T13:56:58.020+02:00", "highlightTitle": ""}