{"organizations": [], "uuid": "fbcfd8e0ef85e44570c4ae300843fd7a79aac491", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-toppan-vintage-names-sharon-xu-vice-president-strategic-development.html", "country": "US", "domain_rank": 767, "title": "Toppan Vintage Names Sharon Xu Vice President, Strategic Development", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-17T16:00:00.000+02:00", "replies_count": 0, "uuid": "fbcfd8e0ef85e44570c4ae300843fd7a79aac491"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-toppan-vintage-names-sharon-xu-vice-president-strategic-development.html", "ord_in_thread": 0, "title": "Toppan Vintage Names Sharon Xu Vice President, Strategic Development", "locations": [], "entities": {"persons": [{"name": "sharon xu", "sentiment": "negative"}, {"name": "jim yuan", "sentiment": "none"}, {"name": "sharon", "sentiment": "none"}, {"name": "xu", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "toppan vintage", "sentiment": "negative"}, {"name": "toppan", "sentiment": "negative"}, {"name": "sec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 17, 2018 /PRNewswire/ -- Toppan Vintage , a leading international financial printing, communications and technology company, announced today the hiring of Sharon Xu as Vice President, Strategic Development.\nXu joins the Toppan Vintage team with more than 15 years of experience in financial printing, financial media, SEC disclosure and compliance. She is based out of Toppan Vintage's Beijing office and will be primarily responsible for focusing on the firm's China compliance customer base and supporting U.S. IPOs in the China market.\n\"Sharon brings extensive experience and insight that will aid our continued expansion into new regions and industries, while growing market share,\" said Jim Yuan, Manager of Toppan Vintage's Beijing office. \"She has proven experience in team-building across many cultures, which is crucial to a diverse organization like Toppan Vintage. We are very excited to have Sharon on our team and expect her to have a significant impact with our company in both Asia and the United States.\"\nPrior to joining Toppan Vintage, Xu served as the Director of IR services for PR Newswire Asia, where she focused on building the company's compliance and investor relations service for the Asia region. Toppan Vintage acquired Vintage Filings, a division of PR Newswire, in March 2017, so Xu has worked closely with many senior members of Toppan Vintage for the past several years.\nPreviously, she also served as an analyst at JP Morgan Chase and as an associate with Salomon Smith Barney, both in New York.\n\"Toppan Vintage is the leading filer for transactions and regulatory compliance coming out of Asia, and our hiring of Sharon will be a driving force in adding market share,\" said Trevor Loe, Senior Vice President, Sales Manager of Toppan Vintage in the U.S. \"In her new role we're confident that Sharon will continue to support Toppan Vintage's market-leading position in the U.S. and Asia.\"\nOver the course of her career she has worked with more than 200 China-based U.S.-listed companies. While at PR Newswire, Xu also built a top-performing IR team and led that team to achieve rapid revenue growth and increased market share. In 2017 Xu led PR Newswire to a No. 1 ranking in China in terms of market share of compliance and led seven IPO projects.\n\"I have worked closely with the Toppan Vintage U.S. and Asian teams for the past several years and I am grateful for the opportunity to be a part of the Toppan Vintage family,\" said Xu. \"Together, we'll be able to continue to grow the business and provide high quality and cost-effective service to our customers.\"\nXu's new role will allow her to continue to grow relationships at PR Newswire by providing more focus Toppan Vintage's compliance suite of services to current customers. By leveraging both companies and past relationships, Xu can further solidify business for both Toppan Vintage and PR Newswire.\nAbout Toppan Vintage\nToppan Vintage, a leader in financial printing and communications solutions, is part of the Toppan Printing Co., Ltd. , the world's largest printing group, headquartered in Tokyo with approximately US$13 billion in annual sales. Toppan Vintage has been a pioneer and trusted partner in the financial markets for three decades, serving the financial, legal and corporate communities with meticulous, responsive service and unparalleled local market expertise and capabilities. Toppan Vintage's expanding operations deliver a hassle-free experience for mission-critical content for capital markets transactions, financial reporting and regulatory compliance filings, investment companies and insurance providers. Collaboration is at the heart of what we do and who we are. Our Hive ® suite of SaaS solutions , utilizing cutting-edge technology and expertise, aspires to the idea of the hive – an industrious community working together in a secure, efficient environment. Learn more at www.toppanvintage.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/toppan-vintage-names-sharon-xu-vice-president-strategic-development-300583738.html\nSOURCE Toppan Vintage", "external_links": ["http://www.prnewswire.com/news-releases/toppan-vintage-names-sharon-xu-vice-president-strategic-development-300583738.html", "http://www.toppanvintage.com/", "http://www.toppan.co.jp/english/", "http://toppanvintage.com/the-hive/"], "published": "2018-01-17T16:00:00.000+02:00", "crawled": "2018-01-17T16:46:22.005+02:00", "highlightTitle": ""}