{"organizations": [], "uuid": "7709ebd04dbc72702fc5c70644baaf09cae0d2a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/brazil", "section_title": "Brazil | Reuters.com", "url": "https://www.reuters.com/article/us-vietnam-security/vietnam-sentences-former-official-to-13-years-jail-amid-corruption-crackdown-state-media-idUSKBN1FB0C5", "country": "US", "domain_rank": 408, "title": "Vietnam sentences former official to 13 years jail amid corruption crackdown: state media", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T11:54:00.000+02:00", "replies_count": 0, "uuid": "7709ebd04dbc72702fc5c70644baaf09cae0d2a7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-vietnam-security/vietnam-sentences-former-official-to-13-years-jail-amid-corruption-crackdown-state-media-idUSKBN1FB0C5", "ord_in_thread": 0, "title": "Vietnam sentences former official to 13 years jail amid corruption crackdown: state media", "locations": [], "entities": {"persons": [{"name": "paul tait", "sentiment": "none"}, {"name": "trinh xuan thanh", "sentiment": "none"}, {"name": "mai nguyen", "sentiment": "none"}, {"name": "james pearson", "sentiment": "none"}, {"name": "dinh la thang", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "hanoi", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "voice of vietnam", "sentiment": "none"}, {"name": "petrovietnam", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 3:54 AM / a minute ago Vietnam jails former politburo official for 13 years in graft crackdown Mai Nguyen , James Pearson 4 Min Read \nHANOI (Reuters) - A court in Vietnam on Monday sentenced a former politburo official to 13 years in prison and another high-profile energy official to life imprisonment for embezzlement and violating state rules, in a corruption crackdown, state media said. \nDinh La Thang, a former politburo official and the most senior Vietnamese politician tried in decades, was jailed for 13 years for “deliberate violation of state regulations on economic management that caused serious consequences,” state-run Voice of Vietnam and the Vietnam News Agency said. \nTrinh Xuan Thanh, a high-profile official whom Germany said Vietnamese agents kidnapped in a Berlin park in a scene reminiscent of Cold War disappearances, was sentenced to life in prison for both violating state regulations and embezzlement. \nTheir sentencing concluded the trial of 22 people connected to violations at state oil and gas group PetroVietnam’s (PVN) thermal power project that caused it losses of 119 billion dong ($5 million). \nMore trials are expected this year as part of a Communist party-led crackdown the government says is targeting fraud and mismanagement. Both Thang and Thanh were prosecuted for other corruption cases, separate from Monday’s case. \nThanh is expected to go on trial again on Wednesday for embezzlement allegations related to a real estate project under a separate PVN unit. \nCritics say the crackdown is also politically motivated, however, and is targeting those close to former premier Nguyen Tan Dung after the influence of Vietnam’s conservative security forces grew in 2016 following a power struggle in the party. \nPresiding judge Troung Viet Toan said he had faced no pressure during the trial, beyond a request from his superiors to proceed quickly, video on the Tuoi Tre news website showed. \n“All citizens are equal under the law,” Toan said. FILE PHOTO Vietnam's Transport Minister Dinh La Thang is seen at a ceremony in Hanoi, Vietnam, July 2, 2015. REUTERS/Kham/Files PRISON TRUCKS \nPolicemen escorted Thang and Thanh separately to the courtroom in prison trucks. They wore simple shirts and jackets as judges in dark gowns read their sentences in images broadcast by state media. \nThe courtroom was packed with judges, defendants, police as well as lawyers and other officials. Only a few state-run media were allowed in, while other reporters watched the televised trial from a separate room. \nForeign media were not permitted to attend the trial or allowed in the televised room but some foreign embassy staff were reportedly given access. \nThanh was a former chairman of PVN’s unit PetroVietnam Construction before becoming a vice chairman for the Hau Giang province, where he was found to have a luxury Lexus car with a government license plate, causing an outcry in a country where officials are supposed to live modestly. \nAuthorities have mostly focused on the banking and energy sectors but the campaign has spread to other industries, including real estate, and provincial offices of the ruling Communist Party of Vietnam. \nPVN is a tangled enterprise of 15 direct units, 18 subsidiaries and 46 affiliates in which it owns smaller stakes with hundreds of millions of dollars in losses racked up at units such as banks, power plants and textile mills. \nThe PetroVietnam scandal is connected to the banking sector through a deal in which the oil firm lost $35 million in an investment in Ocean Bank. \nThe lender’s former chief executive, a previous PetroVietnam chairman, was sentenced to death. \nThanh and Thang both apologised to the Communist Party in statements to the Hanoi court last week. Reporting by Mai Nguyen and James Pearson; Editing by Paul Tait and Clarence Fernandez", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T11:54:00.000+02:00", "crawled": "2018-01-22T05:58:35.003+02:00", "highlightTitle": ""}