{"organizations": [], "uuid": "a9a6f66a49f73c8a666c5f5152940b7cdc2c1179", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221956873&w=1200&r=LYNXMPEE0D0JI", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-liv-mci/liverpool-end-man-citys-unbeaten-run-in-seven-goal-thriller-idUKKBN1F30UH", "country": "US", "domain_rank": 408, "title": "Liverpool end Man City's unbeaten run in seven-goal thriller", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T20:37:00.000+02:00", "replies_count": 0, "uuid": "a9a6f66a49f73c8a666c5f5152940b7cdc2c1179"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-liv-mci/liverpool-end-man-citys-unbeaten-run-in-seven-goal-thriller-idUKKBN1F30UH", "ord_in_thread": 0, "title": "Liverpool end Man City's unbeaten run in seven-goal thriller", "locations": [], "entities": {"persons": [{"name": "ederson", "sentiment": "none"}, {"name": "alex oxlade-chamberlain", "sentiment": "none"}, {"name": "roberto firmino", "sentiment": "none"}, {"name": "simon jennings", "sentiment": "none"}, {"name": "firmino", "sentiment": "none"}, {"name": "leroy sane", "sentiment": "none"}, {"name": "mohamed salah", "sentiment": "none"}, {"name": "sadio mane", "sentiment": "none"}], "locations": [{"name": "man city", "sentiment": "none"}, {"name": "manchester city - anfield", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "negative"}, {"name": "manchester city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "city", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 6:38 PM / Updated 39 minutes ago Liverpool end Man City's unbeaten run in seven-goal thriller Simon Jennings 3 Min Read \n(Reuters) - Liverpool scored three times in nine minutes on the way to a dramatic 4-3 win over Manchester City on Sunday which ended the Premier League leaders’ unbeaten start to the season. Soccer Football - Premier League - Liverpool vs Manchester City - Anfield, Liverpool, Britain - January 14, 2018 Liverpool’s Alex Oxlade-Chamberlain applauds fans after the match REUTERS/Phil Noble \nLiverpool struck after less than 10 minutes when Alex Oxlade-Chamberlain surged forward from midfield to collect a neat layoff from Roberto Firmino and send a low shot past City keeper Ederson. \nLeroy Sane equalised shortly before the interval, but Liverpool blew City away after halftime with Firmino chipping Ederson to restore the home side’s lead and Sadio Mane striking from the edge of the box. \nEgypt international Mohamed Salah looked to have completed the rout when he collected Ederson’s clearance and sent the ball sailing back over the stranded keeper’s head, but City substitute Bernardo Silva grabbed one back and midfielder Ilkay Gundogan prodded home in stoppage-time. \nCity’s first league defeat in 23 games this season left them 15 points clear at the top, ahead of Manchester United, Liverpool and Chelsea. \n“Congratulations to Liverpool for the victory,” City manager Pep Guardiola told Sky Sports. \n”The game was in our hands at 1-1 but our finishing was not good and then it went suddenly to 4-1. You have to live this kind of situation in the season. \n”The reality is we lose the game, we have a week to recover and prepare for the Newcastle game. All credit to the opponent, we know how difficult it is against a Juergen Klopp team, so aggressive, at Anfield too. We did a good performance apart from a few minutes. Soccer Football - Premier League - Liverpool vs Manchester City - Anfield, Liverpool, Britain - January 14, 2018 Manchester City's Leroy Sane looks dejected after the match Action Images via Reuters/Carl Recine \n“In every press conference for the last few months you have said that the Premier League is done and I always said no. We will defend our position game by game.” \nAgainst the runaway leaders, Liverpool started strongly at a raucous Anfield and their high pressing game was vindicated when Oxlade-Chamberlain surged forward and finished brilliantly. Slideshow (2 Images) \nIn an entertaining match which produced chances at both ends, City began to assert themselves before a deserved equaliser. \nKyle Walker’s brilliant pass beat Joe Gomez and Sane, having controlled the ball superbly with his chest, fizzed a shot past Loris Karius’s weak attempted save at his near post. \nThe game continued at the same frantic pace after the break with chances for both sides before Liverpool, in one of the most irresistible attacking displays of the season, scored three times in nine blistering minutes. \nFirmino lifted a deft finish over Ederson to restore their lead before Mane - just seconds after curling a shot against the post - unleashed an unstoppable drive into the top corner with his left foot. \nWith Anfield in raptures and the visitors looking shell-shocked, Ederson’s attempted clearance only found Salah who controlled the ball before clipping it over the Brazilian from long range. \nLate goals from substitute Silva and Gundogan set up a tense final few minutes but City’s revival came too late. Reporting by Simon Jennings and Tom Hayward, editing by Ed Osmond", "external_links": [], "published": "2018-01-14T20:37:00.000+02:00", "crawled": "2018-01-14T21:20:16.000+02:00", "highlightTitle": ""}