{"organizations": [], "uuid": "cbfc5d718b6b2baed518a94dc532409b4dbd4a69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 926, "shares": 926, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-644931983.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/def-leppard-journey/", "country": "US", "domain_rank": 1196, "title": "Def Leppard Announces Joint Stadium and Arena Tour With Journey | Fortune", "performance_score": 9, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "cbfc5d718b6b2baed518a94dc532409b4dbd4a69"}, "author": "Phil Wahba", "url": "http://fortune.com/2018/01/19/def-leppard-journey/", "ord_in_thread": 0, "title": "Def Leppard Announces Joint Stadium and Arena Tour With Journey | Fortune", "locations": [], "entities": {"persons": [{"name": "phil wahba", "sentiment": "negative"}, {"name": "def leppard", "sentiment": "none"}], "locations": [{"name": "madison square garden", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "fenway park", "sentiment": "none"}], "organizations": [{"name": "def leppard", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Phil Wahba January 19, 2018 \nIn the latest demonstration of the lasting box office power of so-called legacy bands, Def Leppard and Journey on Friday announced a co-headlining tour that will take them to arenas and stadiums throughout North America between May and September. \nDef Leppard, one of the last holdouts among major acts in making its catalog of classics like “Pour Some Sugar On Me” and “Photograph” available for streaming or download online, also said its entire oeuvre, including rarities and live recordings, was now available on platforms such as Spotify and Apple Music. AC/DC and the Beatles, previous holdouts, put their work on iTunes in 2012 and 2010 respectively. \nThe two bands will take turns closing out the shows that will include concerts at iconic venues such as Boston’s Fenway Park and New York’s Madison Square Garden, an arena at which Def Leppard will play its first ever full concert. (The English rockers played a charity concert there in 1992.) Of the 58 dates, ten will take place at stadiums, a rarity for both bands and a sign of how confident promoter Live Nation (lyv) is in the tour’s prospects. The itinerary starts in Hartford on May 21 and wraps up in Los Angeles October 6th. Tickets will be available for sale to the general public on February 3. \nThis is not the first time Journey, a recent Rock ‘n Roll Hall of Fame inductee known for songs such as “Don’t Stop Believin'” and “Open Arms”, and Def Leppard have hit the road together: they toured U.S. amphitheaters in 2006 with Leppard headlining in an outing that fueled a resurgence in Leppard’s box office drawing power. In the early 2000’s, Def Leppard tours attracted more modest crowds than they had during the band’s 1980s and 1990s heyday. But starting with a joint run with Bryan Adams in 2005, Def Leppard has since taken to leading package tours as it did in 2017 with Tesla and Poison, a formula that has proven very successful. \n“We’ve toured together before and it was massive. This time it’s going to be even bigger and better!” Def Leppard frontman Joe Elliott said in a statement of the Journey news. \nIndeed, while Def Leppard hasn’t had a Billboard Top 40 hit since 1993’s “Two Steps Behind” (though it has landed several Top 10 albums including an eponymous recording in 2015), it has toured nearly every year since 2005, and ranked among the top tours each time, according to Pollstar data. Last year, Def Leppard averaged a haul of $817,404 per show on its North American tour. Journey has also been a big box office draw despite the absence of lead singer Steve Perry for decades. \nDef Leppard’s decision to add its catalog to streaming and downloading services marks the resolution of a years-long dispute with its former record company on how much the band would be paid considering their contract was drawn up long before digital songs existed. The band has sold some 40 million albums in the U.S., led by records such as 1983’s “Pyromania” and 1987’s “Hysteria.” \nThe band also announced a British and Irish tour in December with 1970s rockers Cheap Trick in tow that will see Def Leppard play “Hysteria” in its entirety, as it did during a residency in 2013 in Las Vegas. \n", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T17:15:06.008+02:00", "highlightTitle": ""}