{"organizations": [], "uuid": "5916fbfe13f0b4ea790e0b705f1d45aeafdc027f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/03/jam-04-01-17-jack-ma-02.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/ceo-daily-january-4-2018/", "country": "US", "domain_rank": 1196, "title": "CEO Daily for January 4, 2018: The China Trade War Has Begun | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-04T09:10:00.000+02:00", "replies_count": 0, "uuid": "5916fbfe13f0b4ea790e0b705f1d45aeafdc027f"}, "author": "Alan Murray", "url": "http://fortune.com/2018/01/04/ceo-daily-january-4-2018/", "ord_in_thread": 0, "title": "CEO Daily for January 4, 2018: The China Trade War Has Begun | Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "intel", "sentiment": "negative"}, {"name": "arm holdings", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "ihs markit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\n\nIntel working on fix for huge chip security flaws. \nIntel said Wednesday that it is working with rival chip designers ARM Holdings and Advanced Micro Devices to fix massive security flaws in their chips that can make it possible for hackers to swipe users’ confidential information. Intel’s shares dipped yesterday after initial reports suggested that the tech company’s chips were the only ones with security issues, but others later came forward to confirm that many of the processors running computers and mobile devices around the world are affected. Fortune \nU.S. auto sales growth skids to a halt. \nIn 2017, the number of annual car sales in the U.S. dropped for the first time since the financial crisis, falling 1.8% to 17.2 million vehicles sold. While that number marks the first time the auto industry has seen three straight years above 17 million sales, it also ends a streak of seven straight years of sales growth. Meanwhile, IHS Markit predicts the number will slip again in 2018, amid higher interest rates and higher-quality cars that require fewer upgrades. The New York Times \nTesla disappoints Wall Street. \nTesla reported disappointing fourth-quarter sales for its Model 3 electric sedans on Wednesday. Elon Musk’s electric car company delivered only 1,550 Model 3s in the final three months of 2017, the company said, which came well short of analysts’ average estimates (2,900 units) that had already been lowered as Tesla again pushed back its goal of producing 5,000 Model 3s per week. The company now expects to hit that milestone in the middle of this year. Fortune \nThe Spotify IPO is apparently humming along . \nSpotify reportedly filed confidential IPO documents with the SEC at the end of December. The music streaming giant, which boasts roughly 60 million paid subscribers, has been expected to go public via a relatively rare direct listing sometime in early-2018. An IPO could value the company at as high as $20 billion. Axios Around the Water Cooler \nApple’s cheaper battery replacements could slump sales. \nApple’s older iPhones could see a sales hit after the tech giant lowered the price of some replacement batteries in response to complaints that the company was intentionally slowing older iPhones to prevent sudden shutdowns. Apple apologized (but said it never slowed its iPhones to convince users to upgrade their devices) and cut the price of battery replacements on older models. Barclays analyst Mark Moskowitz said on Wednesday the move could prevent roughly 16 million iPhone users from buying newer models for the time being. Bloomberg \nCryptocurrency has a new #2, behind bitcoin. \nRipple is now the second most valuable cryptocurrency after it broke the $3 mark in the first few days of 2018. Ripple gained roughly 29% in value in a 24-hour period as of Wednesday, bringing its market value to more than $120 billion, which is almost half of bitcoin’s $250 billion value. The gains moved Ripple past Ethereum ($94 billion), long considered bitcoin’s main competitor. Fortune \nAT&T looks to win 5G race. \nThe telecoms giant says it plans to be the first U.S. carrier to offer 5G (fifth-generation mobile service) to its wireless customers. While rivals Verizon and T-Mobile have made it clear they are also working on developing commercial 5G service, AT&T now says it plans to roll out 5G for customers in more than a dozen U.S. cities later this year. Bloomberg \nChina’s Didi Chuxing goes after Uber in Latin America. \nDidi Chuxing, the Chinese ride-hailing service, said Wednesday it’s buying control of Brazil’s 99 from investors that include Qualcomm Ventures and Softbank Group in a deal reportedly valued at roughly $1 billion. The deal is a step toward Didi’s goal of globalization and it could create an intimidating rival to Uber in a major Latin American market. Reuters ", "external_links": [], "published": "2018-01-04T09:10:00.000+02:00", "crawled": "2018-01-04T16:11:20.024+02:00", "highlightTitle": ""}