{"organizations": [], "uuid": "84d97ca64e019153816cf8164ea2bba339a94737", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/yamato-holdings-results/update-1-yamato-raises-profit-forecast-price-hikes-propel-recovery-idUSL4N1PP2FE", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Yamato returns to profit as higher delivery prices propel recovery", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.08, "site_type": "news", "published": "2018-01-30T14:58:00.000+02:00", "replies_count": 0, "uuid": "84d97ca64e019153816cf8164ea2bba339a94737"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/yamato-holdings-results/update-1-yamato-raises-profit-forecast-price-hikes-propel-recovery-idUSL4N1PP2FE", "ord_in_thread": 0, "title": "UPDATE 2-Yamato returns to profit as higher delivery prices propel recovery", "locations": [], "entities": {"persons": [{"name": "sam nussey", "sentiment": "none"}, {"name": "kenichi shibasaki", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "yamato holdings co ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Returns to profit in Q3 after three quarters of losses\n* Higher prices, curbs on volumes boosted profits\n* Price negotiations with corporate customers “virtually complete”\n* Corporate customers agree to price rises of more than 15 pct (Adds executive comment, details of price negotiations)\nBy Sam Nussey\nTOKYO, Jan 30 (Reuters) - Yamato Holdings Co Ltd, Japan’s biggest parcel delivery firm, returned to profit in the third quarter after three successive quarters of losses, as higher prices charged to customers and cost-saving measures helped its bottom line.\nThe delivery business, known for its black cat logo, has been trying to improve margins by raising prices for retail and corporate customers in recent months. It has also implemented measures to reduce its workload such as by cutting parcel volumes, avoiding redeliveries and restricting scheduled delivery times.\nPrice negotiations with 1,100 large corporate customers are “virtually complete”, Senior Managing Executive Officer Kenichi Shibasaki told a news conference on Tuesday. Sixty percent of customers have agreed to price rises higher than the 15 percent enacted on retail customer last October - the first such increase in almost 30 years - he added.\nYamato posted a 21.3 percent rise in third-quarter operating profit to around 45 billion yen ($414.02 million), according to Reuters calculations based on the company’s results for the first nine months of the fiscal year.\nThe earnings rebound prompted Yamato to raise its annual operating profit forecast by nearly a quarter to 31 billion yen.\nFor the six months ended in September, the delivery firm posted an operating loss of 12.9 billion yen.\nCustomers such as Amazon were sticking with Yamato, the company said - with that firm’s prices hiked this month - but the remaining 40 percent of large corporate customers have said they would move to rivals.\n“We thought there might be a little more movement by customers to other firms and so appreciate them understanding our situation,” Shibasaki said.\nThe company has become a symbol of the country’s struggle with labour shortages as spiralling demand from the growth of internet shopping left the firm struggling to fulfill orders, increasing the burden on its overworked delivery drivers.\nThe company has promised to boost driver numbers and improve their working conditions. Japan’s job market is the tightest it has been in more than 40 years.\nParcel volumes fell 6 percent in December from the previous year. Yamato has said it wants to reduce overall volumes.\nYamato is also introducing labour-saving measures including opening a new logistics facility outside Tokyo to automate parcel-sorting work currently done by an army of part-time workers.\n$1 = 108.6900 yen Editing by Jacqueline Wong\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T14:58:00.000+02:00", "crawled": "2018-01-31T16:30:17.022+02:00", "highlightTitle": ""}