{"organizations": [], "uuid": "8d101d0c6c84f38a9bff31cacd0856c0261ffb7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222807305&w=1200&r=LYNXMPEE0G1MF", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-germany-turkey/germany-turkey-resume-bilateral-meetings-still-at-odds-over-reporters-arrest-idUSKBN1F62LN", "country": "US", "domain_rank": 408, "title": "Germany, Turkey resume bilateral meetings, still at odds over reporter's arrest", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T21:09:00.000+02:00", "replies_count": 0, "uuid": "8d101d0c6c84f38a9bff31cacd0856c0261ffb7c"}, "author": "", "url": "https://www.reuters.com/article/us-germany-turkey/germany-turkey-resume-bilateral-meetings-still-at-odds-over-reporters-arrest-idUSKBN1F62LN", "ord_in_thread": 0, "title": "Germany, Turkey resume bilateral meetings, still at odds over reporter's arrest", "locations": [], "entities": {"persons": [{"name": "deniz yucel", "sentiment": "none"}, {"name": "yucel", "sentiment": "none"}, {"name": "johannes dimroth", "sentiment": "none"}, {"name": "maria adebahr", "sentiment": "none"}, {"name": "sigmar gabriel", "sentiment": "none"}, {"name": "mevlut cavusoglu", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "interior ministry", "sentiment": "none"}, {"name": "foreign ministry", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 11 PM / Updated 26 minutes ago Germany, Turkey resume bilateral meetings, still at odds over reporter's arrest Reuters Staff 3 Min Read \nBERLIN (Reuters) - Germany and Turkey on Wednesday resumed bilateral government consultations that had been suspended after Ankara’s arrest of German-Turkish journalist Deniz Yucel in February 2017, an issue that continues to divide the two NATO allies. \nState secretaries from both countries met at the German Interior Ministry for discussions about counterterrorism and other issues, ministry spokesman Johannes Dimroth said during a regular government briefing. \nHe said common interests on fighting terrorism meant this was a good time to resume talks, but both sides remained at odds over issues such as the continued detention of Yucel. \nGerman Foreign Ministry spokeswoman Maria Adebahr added that German-Turkish relations still faced “significant challenges,” but Berlin was ready to continue working to “improve relations bit by bit”. \nGerman Foreign Minister Sigmar Gabriel and Turkish Foreign Minister Mevlut Cavusoglu earlier this month pledged to improve a relationship that soured amid disputes over Ankara’s crackdown following the failed 2016 coup and the arrests of German citizens in Turkey. \nGermany, home to some 3 million people with a Turkish background, remains critical of Turkey’s post-coup arrests of some 50,000 people, and the suspension or firing of 150,000 others, including teachers, judges and soldiers. \nTurkey says the crackdown on alleged supporters of a network of followers of a Muslim cleric it blames for the coup is needed to shore up security, and has criticized Germany’s refusal to hand over asylum seekers it says were involved in the putsch. \nDifferences remain over the fate of Yucel, a reporter for German newspaper Die Welt, whom Ankara accuses of spreading propaganda for the outlawed Kurdistan Workers Party (PKK). He denies the charge. \nGabriel has vowed to block major arms sales to Turkey until Yucel’s case is resolved. But the foreign minister signaled after his meeting with Cavusoglu that Berlin would consider whether to deliver mine protection gear for armored vehicles in Turkey, an issue not linked to arrests. \nSome members of Gabriel’s own Social Democrats and the radical Left party have rejected any such move. \nSevim Dagdalen, a Left party lawmaker, said Germany should immediately halt all weapons exports to Turkey, voicing concerns about recent Turkish warnings about imminent military operations against Kurdish forces in northern Syria. \n“Plans by Foreign Minister Gabriel to conclude new weapons deals with Turkey are a slap in the face to the resistance against Islamic State,” she said in a statement. \nStern magazine reported on Wednesday that Gabriel had met last fall with officials from Rheinmetall about potential Turkish exports. \nRheinmetall has a joint venture with the Turkish firm BMC, and hopes to set up a factory that would build tanks, trucks and buses in the city of Karasu, east of Istanbul, it said. Reporting by Sabine Siebold and Andrea Shalal; Editing by Peter Graff", "external_links": [], "published": "2018-01-17T21:09:00.000+02:00", "crawled": "2018-01-17T21:32:33.009+02:00", "highlightTitle": ""}