{"organizations": [], "uuid": "fc1ccceee9037ae048b0a3c79c22634459ea92a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/31/the-associated-press-earnings-drive-gains-for-us-stocks-in-afternoon-trading.html", "country": "US", "domain_rank": 767, "title": "Earnings drive gains for US stocks in afternoon trading", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:22:00.000+02:00", "replies_count": 0, "uuid": "fc1ccceee9037ae048b0a3c79c22634459ea92a8"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/31/the-associated-press-earnings-drive-gains-for-us-stocks-in-afternoon-trading.html", "ord_in_thread": 0, "title": "Earnings drive gains for US stocks in afternoon trading", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stocks moved higher in afternoon trading Wednesday after several big U.S. companies reported strong quarterly results. Technology companies accounted for much of the market's gain, outweighing losses in health care and other sectors. Oil prices reversed an early slide. Bond prices fell, sending yields higher. The market was coming off a two-day drop that was its biggest since August.\nKEEPING SCORE: The Standard & Poor's 500 index rose 8 points, or 0.3 percent, to 2,830 as of 1:25 p.m. Eastern Time. The Dow Jones industrial average gained 163 points, or 0.6 percent, to 26,240. The Nasdaq added 28 points, or 0.4 percent, to 7,430. The Russell 2000 index of smaller-company stocks gave up 1 point, or 0.1 percent, to 1,580.\nTHE QUOTE: \"The markets have turned around,\" said Erik Davidson, chief investment officer for Wells Fargo Private Bank. \"Many people have been waiting for it to dip as it's marched higher and higher, and we finally had two days of weakness, particularly yesterday.\"\nTHE FED SPEAKS: Investors were awaiting the Federal Reserve's latest policy statement, which is due out Wednesday afternoon. The statement follows a two-day meeting of the central bank's policymakers, including Fed Chair Janet Yellen, who is stepping down when her term expires at the end of this week. The Fed has signaled it could raise its benchmark interest rate three times this year, but analysts don't expect the first hike to be announced before the Fed's March meeting.\nTECH SURGE: Technology companies posted solid gains, recouping some of their losses from a day earlier. Chipmaker Advanced Micro Devices added 74 cents, or 5.7 percent, to $13.61. Electronic Arts jumped 7.2 percent after the video game maker forecast quarterly earnings and sales that were well ahead of what Wall Street analysts expected. The stock was the biggest gainer in the S&P 500, rising $8.52 to $127.23.\nHIGH FLYER: Boeing climbed 5.1 percent after the aerospace giant's latest quarterly earnings topped Wall Street's expectations. The stock, which has been the biggest gainer in the Dow over the past year, added $17.26 to $354.97.\nUNDER THE WEATHER: Health care stocks, including several drugmakers, were among the biggest decliners for the second day in a row. Eli Lilly lost $3.92, or 4.6 percent, to $82.17, while Gilead Sciences gave up $3.10, or 3.6 percent, to $84.19.\nBIG DECLINER: Juniper Networks slumped 9.5 percent after the provider of network equipment forecast quarterly results that were well below what Wall Street analysts expected. The stock was down more than any other company in the S&P 500, shedding $2.68 to $25.64.\nNOT GOOD ENOUGH: Textron shares fell 2.6 percent after the industrial conglomerate's earnings and revenue fell short of forecasts. The stock slid $1.54 to $58.64.\nENERGY: Oil prices reversed an early slide. Benchmark U.S. crude were up 3 cents to $64.53 per barrel on the New York Mercantile Exchange. Brent crude, used to price international oils, gained 22 cents to $68.74 in London.\nBOND YIELDS: Bond prices fell. The yield on the 10-year Treasury rose to 2.73 percent from 2.72 percent late Tuesday. The prospect for stronger economic growth, both in the U.S. and abroad, has helped drive bond yields higher in recent months. This week yields have hovered at the highest level since April 2014. Rising yields make bonds more appealing to investors seeking income, but they can also lead to higher financing costs for companies, homebuyers and other borrowers.\nCURRENCIES: The dollar rose to 109.32 yen from 108.78 yen on Tuesday. The euro strengthened to $1.2416 from $1.2404.\nMARKETS OVERSEAS: Germany's DAX fell 0.2 percent, while France's CAC 40 gained less than 0.1 percent. London's FTSE 100 fell 0.8 percent. In Asia, Tokyo's Nikkei 225 fell 0.8 percent, while Hong Kong's Hang Seng rose 0.9 percent. Sydney's S&P-ASX 200 added 0.3 percent.", "external_links": [], "published": "2018-01-31T17:22:00.000+02:00", "crawled": "2018-01-31T21:05:05.012+02:00", "highlightTitle": ""}