{"organizations": [], "uuid": "3e71691ca9a29b7658662505dc92bd310d9b0333", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WG843_3iWmW_TOP_20171122120135.jpg", "site_section": "https://www.wsj.com/news/markets", "section_title": "Stock Market &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/bending-facebook-without-breaking-it-1516185181", "country": "US", "domain_rank": 387, "title": "Can Mark Zuckerberg Bend Facebook Without Breaking It?", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-17T13:33:00.000+02:00", "replies_count": 0, "uuid": "3e71691ca9a29b7658662505dc92bd310d9b0333"}, "author": "Dan Gallagher", "url": "https://www.wsj.com/articles/bending-facebook-without-breaking-it-1516185181", "ord_in_thread": 0, "title": "Can Mark Zuckerberg Bend Facebook Without Breaking It?", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "neutral"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS Six years ago, Mark Zuckerberg introduced Facebook ’s FB -0.42% main credo as “move fast and break things.” His main challenge now is fixing the social network without breaking it.\nThat dilemma was apparent last week when the 33-year-old chief executive announced changes to the company’s News Feed tool . He essentially promised it would improve users’ experiences while also conceding the risk that usage of the site may decline. The dilemma will be even more apparent in a couple of weeks when Facebook is expected to report yet another year of booming revenue and earnings that stem directly from its ability to serve up highly targeted advertising to a quarter of the earth’s population.\nAnalysts believe Facebook ended 2017 with advertising revenue at nearly $40 billion. Photo: thomas white/Reuters Facebook’s business, in other words, isn’t exactly broken. In fact, the problem may be that it works too well. The company has steadily grown its daily and monthly active user base every quarter since going public in May 2012. That has produced a lucrative advertising business. Analysts believe Facebook ended 2017 with advertising revenue at nearly $40 billion—up 47% from the previous year—and operating profit surging 55% to $19.3 billion.\nAll that has made Facebook the fifth most valuable company on the U.S. market. But its success and now massive scale also exposes the company to lawmakers, regulators and practically anyone else concerned about the role technology now plays in both global politics as well as users’ personal lives. Facebook in particular has been getting flogged for more than a year over its role in the contentious 2016 U.S. presidential election and the spread of fake news and other unsavory content on its site.\nMr. Zuckerberg rightfully wants to change that story, hence, his New Year’s resolution . But, unlike his earlier promise to boost spending on security to keep objectionable content off the network, Mr. Zuckerberg’s proposition to “make time spent on Facebook well spent” runs the risk of hurting user growth in the long term if enough users don’t appreciate the company’s paternalistic approach. Wall Street has been counting on Facebook’s user base to keep growing at double-digit rates through 2020.\nThat is why investors who largely shrugged off last year’s growing raft of negative headlines are officially worried now . Facebook’s share price has slipped 5% since Mr. Zuckerberg announced his latest plans last week. That is after doubling the Nasdaq Composite Index’s impressive gains for 2017. Hosting more than 2 billion users is a very different thing from knowing what is best for them.\nWrite to Dan Gallagher at dan.gallagher@wsj.com", "external_links": [], "published": "2018-01-17T13:33:00.000+02:00", "crawled": "2018-01-17T16:11:43.001+02:00", "highlightTitle": ""}