{"organizations": [], "uuid": "5047eea2bf9c894c45ddb90b05d002226a0d312f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220183144&w=1200&r=LYNXMPEE070A4", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-india-biometric/india-sparks-outcry-over-press-freedom-by-naming-reporter-in-probe-on-database-breach-idUKKBN1EX0CR", "country": "US", "domain_rank": 408, "title": "India sparks outcry over press freedom by naming reporter in probe on database breach", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T07:58:00.000+02:00", "replies_count": 0, "uuid": "5047eea2bf9c894c45ddb90b05d002226a0d312f"}, "author": "", "url": "https://uk.reuters.com/article/uk-india-biometric/india-sparks-outcry-over-press-freedom-by-naming-reporter-in-probe-on-database-breach-idUKKBN1EX0CR", "ord_in_thread": 0, "title": "India sparks outcry over press freedom by naming reporter in probe on database breach", "locations": [], "entities": {"persons": [], "locations": [{"name": "india", "sentiment": "none"}, {"name": "merta", "sentiment": "none"}, {"name": "rajasthan", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "unique identification authority of india", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "tribune", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 03 AM / Updated an hour ago India sparks outcry over press freedom by naming reporter in probe on database breach Reuters Staff 3 Min Read \nNEW DELHI (Reuters) - The Indian government named a reporter in a police complaint after she wrote an article alleging a data breach in a federal identity database, drawing criticism from a journalist group that accused officials of trying to muzzle free speech. FILE PHOTO: A villager goes through the process of a fingerprint scanner for the Unique Identification (UID) database system at an enrolment centre at Merta district in the desert state of Rajasthan, India, February 22, 2013. REUTERS/Mansi Thapliyal/File Photo \nThe Unique Identification Authority of India (UIDAI), which runs the world’s largest biometric identity card scheme called “Aadhaar”, started investigating a report last week by The Tribune newspaper which said access to the identity database of more than 1 billion citizens was being sold for just 500 rupees, or $8 (6 pounds), on social media. \nUIDAI on Sunday said four people were named in its complaint to police in New Delhi to investigate the incident, including the reporter, and also her newspaper, which is based in the north Indian city of Chandigarh. \nThe Editors Guild of India condemned UIDAI’s action, saying it was designed to “browbeat a journalist.” \n“It is unfair, unjustified and a direct attack on the freedom of the press,” the Guild said in a statement on Sunday. \nThe UIDAI said in a statement on Sunday that it respects freedom of press, adding that it was duty bound to name everyone involved in the incident, including the reporter. \n“It does not mean that those who are named in the report are necessarily guilty,” the authority said. \nThe Tribune newspaper said it regretted the decision of the authorities. \nIndia last year slipped three places to 136th in the World Press Freedom Index of 180 nations, compiled by Reporters Without Borders. \nJournalists in India have increasingly become targets of online smear campaigns, with prosecutorial actions being used to gag journalists who are overly critical of the government, the group said. \nThe Tribune newspaper last week reported that it was able to buy login credentials to the government’s Aadhaar database, allowing it to acquire information such as the names, telephone numbers and home addresses of millions of people. \nThe alleged breach is the latest in the Aadhaar programme which is facing increasing scrutiny over privacy concerns. \nAfter the report was published, the UIDAI said the “case appears to be an instance of misuse.” \nThe Aadhaar scheme was introduced in 2009 to streamline welfare payments and reduce wastage in public spending. Since then, the government of Prime Minister Narendra Modi has been keen to mandate the use of Aadhaar for everything from filing income taxes to the registration of mobile phone numbers and booking railway tickets. Reporting by Aditya Kalra; Editing by Tom Lasseter & Simon Cameron-Moore", "external_links": [], "published": "2018-01-08T07:58:00.000+02:00", "crawled": "2018-01-08T08:32:51.014+02:00", "highlightTitle": ""}