{"organizations": [], "uuid": "971432f0a714656a7d6116303f1c7e9dd414c3c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221402785&w=1200&r=LYNXMPEE0B0J0", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-southkorea-bitcoin/uproar-over-crackdown-on-cryptocurrencies-divides-south-korea-idUSKBN1F10YG", "country": "US", "domain_rank": 408, "title": "Uproar over crackdown on cryptocurrencies divides South Korea", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T12:06:00.000+02:00", "replies_count": 0, "uuid": "971432f0a714656a7d6116303f1c7e9dd414c3c3"}, "author": "", "url": "https://www.reuters.com/article/us-southkorea-bitcoin/uproar-over-crackdown-on-cryptocurrencies-divides-south-korea-idUSKBN1F10YG", "ord_in_thread": 0, "title": "Uproar over crackdown on cryptocurrencies divides South Korea", "locations": [], "entities": {"persons": [{"name": "park sang-ki", "sentiment": "none"}, {"name": "heekyong yang", "sentiment": "none"}, {"name": "cynthia kim", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 10:03 AM / in 6 hours Uproar over crackdown on cryptocurrencies divides South Korea Cynthia Kim , Heekyong Yang 5 Min Read \nSEOUL (Reuters) - With a tech-savvy population quick to adopt the latest gadgets and a young generation facing dim prospects in the conventional workplace, South Korea has been a fertile ground for virtual currencies. \nBut the country’s swift embrace of bitcoin and other cryptocurrencies has been met with an equally swift backlash by regulators, who have gone so far as to propose outright bans on trading. \nWith markets around the world watching, South Korea has become a fault line between a generation that sees cryptocurrencies as a way to a better life, and government officials who have likened the market to gambling and warned that it encourages illicit behavior. \nOn Thursday the justice minister, Park Sang-ki, sent global bitcoin prices temporarily plummeting and virtual coin markets into turmoil when he said regulators were preparing legislation to halt cryptocurrency trading. \nAs of Friday, a petition on the website of the presidential Blue House had drawn more than 120,000 signatures opposing the move. Heavy internet traffic briefly crashed the site. \nThe online uprising against the government’s plans puts President Moon Jae-in a tough spot, and his office was quick to say a ban is just one proposal under consideration. \n“The latest idea to ban it all seems to have come out of a fear that when the bubble bursts and things go wrong, it will be all on the government,” said Yun Chang-hyun, an economics professor at University of Seoul. A BETTER FUTURE? \nWith the youth unemployment rate three times the national average and a growing income gap between rich and poor, many young Koreans worry about their economic prospects. \n“Tax it as much as you want but don’t shut it down. My life depends on it,” one petitioner wrote on the Blue House website. \nLee Min-kyung, a 25-year old student in a Seoul-based graduate school said she earned about 18 million won (16,973.93), double her initial investment in bitcoin. She said the government is showing haphazard responses simply because officials have “no idea.” \n“They say the purpose of the regulation is to curb speculative moves, but it makes me just think the government simply doesn’t understand what the market is,” Lee said. \nMore than 30 percent of 941 office workers surveyed in December by Saramin, a South Korea-based job portal, said they traded cryptocurrencies. The respondents had an average of 5.7 million won ($5,357.14) invested in virtual currencies, and a majority of them said they began trading because they saw it as the fastest way to earn money. A woman using her mobile phone is reflected on an electric board showing exchange rates of various cryptocurrencies at Bithumb cryptocurrencies exchange in Seoul, South Korea, January 11, 2018. REUTERS/Kim Hong-Ji \nThat trend has earned critics on the street as well as in government offices. \nKoh Young-sam, a 56-year old mechanic in Seoul, warned that the craze would collapse. \n“Young people shouldn’t be lured into this kind of scam. There is always something fishy about things that grow this fast,” Koh said. FINANCIAL FEARS Slideshow (3 Images) \nSouth Korea is not alone in struggling to figure out how to tax and regulate online currencies, many of which are designed to provide anonymity for transactions. \nIn September last year, China cracked down on cryptocurrency trading, citing what officials saw as broader risks to the country’s economy. \nAs South Korea accounts for about 15 percent of global bitcoin trading, according to the website Coinhills.com, how regulators approach the issue will likely have international effects. \nThe local price of bitcoin in South Korea bounced back on Friday to 19.3 million won ($17,481.20) from as low as 17.5 million won ($16,445.82) according to Bithumb, the nation’s second-largest cryptocurrency exchange. On the Luxembourg-based Bitstamp, bitcoin stood at $13,709 after touching $12,800 the prior day. \nPark Chong-hoon, an economist at Standard Chartered Bank in Seoul, said, “South Koreans find it hard to deal with the jealousy from watching their neighbours getting rich fast.” \nIt is a sentiment echoed by many. Scepticism of “get-rich-quick” schemes among South Korean officials has colored past forays by international finance into the country. \nIn the mid-2000s the U.S. private equity fund Lone Star faced raids of its offices and a years-long legal battle with the South Korean government after the foreign fund made millions of dollars buying and selling a controlling stake in a major South Korean bank. \nThat controversy, which raised concerns over South Korean money flowing to foreign entities, is probably among several factors making South Korea officials wary of managing the new breed of markets originated abroad, analysts said. \n“In a practical sense, the South Korean government needs to factor in some political aspects – if a growing number of people lose huge sums of money on bitcoin because of the government’s failed attempts to rein in the frenzy, people will blame the government,” Lee Dong-gwi, a psychology professor at Yonsei University. “Simply put, the South Korean government could be afraid of the political hassles of being held accountable.” Additional reporting by Dahee Kim; Writing by Josh Smith; Editing by Gerry Doyle", "external_links": [], "published": "2018-01-12T12:06:00.000+02:00", "crawled": "2018-01-12T12:19:39.017+02:00", "highlightTitle": ""}