{"organizations": [], "uuid": "542fdb315340e5b85c1b2dcd221b0c5a655aa4ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-pakistan-politics-baluchistan/pakistans-baluchistan-region-elects-new-chief-minister-amid-turmoil-idUSKBN1F20JT", "country": "US", "domain_rank": 408, "title": "Pakistan's Baluchistan region elects new chief minister amid turmoil", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T22:29:00.000+02:00", "replies_count": 0, "uuid": "542fdb315340e5b85c1b2dcd221b0c5a655aa4ad"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-pakistan-politics-baluchistan/pakistans-baluchistan-region-elects-new-chief-minister-amid-turmoil-idUSKBN1F20JT", "ord_in_thread": 0, "title": "Pakistan's Baluchistan region elects new chief minister amid turmoil", "locations": [], "entities": {"persons": [{"name": "muslim league-nawaz", "sentiment": "none"}, {"name": "abdul qudoos bezenjo", "sentiment": "none"}, {"name": "bezenjo", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "quetta", "sentiment": "none"}, {"name": "baluchistan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "china-pakistan economic corridor", "sentiment": "none"}, {"name": "pml-n", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "QUETTA, Pakistan (Reuters) - Pakistan’s volatile Baluchistan province elected a new chief minister on Saturday, days after the previous leader was ousted in a blow to the ruling Pakistan Muslim League-Nawaz (PML-N) party ahead of the 2018 polls.\nAbdul Qudoos Bezenjo, former deputy speaker of the provincial assembly and member of the opposition Pakistan Muslim League-Q (PML-Q) party, was sworn in as third chief minister in four years in the restive southwestern province.\nResource-rich Baluchistan is plagued by violence, perpetrated by both Islamist militants and nationalist insurgents fighting to keep a greater share of the revenues from gas and minerals in the province. Security has improved in recent years, though militants still carry out attacks.\nThe province also forms an important leg of the $57 billion China-Pakistan Economic Corridor of energy and infrastructure projects that China hopes to build as part of its belt and road initiative.\nBezenjo’s ascent to power follows weeks of political infighting which saw provincial lawmakers from the ruling PML-N party rebel to help the opposition call for a vote of no confidence in PML-N’s Nawab Sanaullah Zehri, prompting him to resign in a bitter blow to his party.\nThe political crisis had been intensified by speculation, widely circulated in media, that elements of Pakistan’s powerful military were behind efforts to destabilize the region and possibly dissolve the assembly ahead of the senate elections due around March, and the general elections in mid-2018.\n“This assembly will complete its constitutional term,” Bezenjo said after being sworn in. “And if somebody made any attempt (to dissolve the parliament) I will fully resist.”\nThe military, which has ruled Pakistan for about half its history since independence in 1947, denies meddling in civilian politics.\nBezenjo’s election is seen hurting PML-N’s chances at the nationwide senate elections, with analysts saying the ruling party is now expected to get fewer senators from Baluchistan. In 2015, the vote for members of the upper house Senate was done through secret ballots of provincial lawmakers.\nWriting by Drazen Jorgic; Editing by Ros Russell\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T22:29:00.000+02:00", "crawled": "2018-01-13T19:34:09.059+02:00", "highlightTitle": ""}