{"organizations": [], "uuid": "2d15a61352e83f5945f6d9a3eea7d3f1dd06707a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-morning-technical-insight-on-these-personal-products-stocks--unilever-estee-lauder-nu-skin-enterprises-and-kimberly-clark.html", "country": "US", "domain_rank": 767, "title": "Morning Technical Insight on These Personal Products Stocks -- Unilever, Estee Lauder, Nu Skin Enterprises, and Kimberly-Clark", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.258, "site_type": "news", "published": "2018-01-02T14:05:00.000+02:00", "replies_count": 0, "uuid": "2d15a61352e83f5945f6d9a3eea7d3f1dd06707a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-morning-technical-insight-on-these-personal-products-stocks--unilever-estee-lauder-nu-skin-enterprises-and-kimberly-clark.html", "ord_in_thread": 0, "title": "Morning Technical Insight on These Personal Products Stocks -- Unilever, Estee Lauder, Nu Skin Enterprises, and Kimberly-Clark", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "kimberly-clark", "sentiment": "negative"}, {"name": "estee lauder", "sentiment": "negative"}, {"name": "unilever", "sentiment": "negative"}, {"name": "estee lauder cos", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "unilever plc", "sentiment": "none"}, {"name": "nu skin enterprises inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "kimberly-clark corp.", "sentiment": "none"}, {"name": "nus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 02, 2018 /PRNewswire/ -- WallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on UL, EL, NUS, and KMB which can be accessed for free by signing up to www.wallstequities.com/registration . WallStEquities.com shifts focus on the Personal Products industry, which consists of companies engaged in the manufacturing of toiletries, personal hygienic products, and birth control products. Stocks in this morning's lineup are Unilever PLC (NYSE: UL), The Estee Lauder Cos. Inc. (NYSE: EL), Nu Skin Enterprises Inc. (NYSE: NUS), and Kimberly-Clark Corp. (NYSE: KMB). All you have to do is sign up today for this free limited time offer by clicking the link below\nwww.wallstequities.com/registration\nUnilever\nShares in London, the UK headquartered Unilever PLC ended Friday's session 0.05% higher at $55.34 with a total trading volume of 525,925 shares. The stock has advanced 35.97% on an YTD basis. The Company's shares are trading 0.33% above their 200-day moving average. Moreover, shares of Unilever, which operates in the fast-moving consumer goods market, have a Relative Strength Index (RSI) of 42.70.\nOn December 14 th , 2017, Unilever announced an agreement to acquire Schmidt's Naturals, a personal care company based in Portland, Oregon. Its co-founders, Jaime Schmidt and Michael Cammarata, will continue to be involved with the brand. Alan Jope, President, Unilever Personal Care, said, \"Schmidt's Naturals is a great strategic fit for our Personal Care business, allowing us to reach new consumers who prefer natural options.\" Get the full research report on UL for free by clicking below at:\nwww.wallstequities.com/registration/?symbol=UL\nEstee Lauder\nNew York-based The Estee Lauder Cos. Inc.'s shares saw a slight decline of 0.51%, closing the day at $127.24. A total volume of 805,149 shares was traded. The stock has advanced 2.67% in the last month, 17.99% in the previous three months, and 66.35% on an YTD basis. The Company's shares are trading 3.89% and 22.83% above their 50-day and 200-day moving averages, respectively. Additionally, shares of Estee Lauder, which manufactures and markets skin care, makeup, fragrance, and hair care products worldwide, have an RSI of 59.76.\nOn December 14 th , 2017, research firm Deutsche Bank initiated a 'Hold' rating on the Company's stock, with a target price of $134 per share. To experience our free membership services anytime/ anywhere and access the free report on EL, click to register at: www.wallstequities.com/registration/?symbol=EL\nNu Skin Enterprises\nLast Friday, shares in Provo, Utah headquartered Nu Skin Enterprises Inc. declined 0.06%, closing the session at $68.23. The stock recorded a trading volume of 472,259 shares, which was higher than its three months average volume of 404,590 shares. The Company's shares have advanced 0.40% in the last one month, 10.98% over the previous three months, and 42.80% on an YTD basis. The stock is trading 4.77% above its 50-day moving average and 12.67% above its 200-day moving average. Furthermore, shares of the Company, which develops and distributes anti-aging personal care products and nutritional supplements under the Nu Skin and Pharmanex category brands worldwide, have an RSI of 55.26. Join our big investor community at Wall St. Equities today and start so with your free report on NUS at: www.wallstequities.com/registration/?symbol=NUS\nKimberly-Clark\nDallas, Texas headquartered Kimberly-Clark Corp.'s stock finished the session 0.36% higher at $120.66 with a total trading volume of 1.33 million shares. The Company's shares have advanced 1.28% in the last month, 2.53% over the previous three months, and 5.73% on YTD basis. The stock is trading above its 50-day moving average by 3.62%. Additionally, shares of Kimberly-Clark, which together with its subsidiaries, manufactures and markets personal care, consumer tissue, and professional products worldwide, have an RSI of 57.62.\nOn December 14 th , 2017, research firm Deutsche Bank initiated a 'Hold' rating on the Company's stock, with a target price of $121 per share. Know more about KMB in our free research coverage at: www.wallstequities.com/registration/?symbol=KMB\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disc", "external_links": ["http://www.wallstequities.com/registration/?symbol=EL", "http://www.wallstequities.com/registration/?symbol=NUS", "http://www.wallstequities.com/registration/?symbol=KMB", "http://www.wallstequities.com/registration/?symbol=UL", "https://wallstequities.com/legal-disclaimer/", "http://www.prnewswire.com/news-releases/morning-technical-insight-on-these-personal-products-stocks----unilever-estee-lauder-nu-skin-enterprises-and-kimberly-clark-300576339.html", "http://www.wallstequities.com/registration"], "published": "2018-01-02T14:05:00.000+02:00", "crawled": "2018-01-02T14:17:00.009+02:00", "highlightTitle": ""}