{"organizations": [], "uuid": "d545d5409d99090a9d80d9acc18d5a70ca2e12aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-armenia-president/armenian-president-proposes-ex-pm-as-successor-in-march-vote-idUSKBN1F81RF", "country": "US", "domain_rank": 408, "title": "Armenian president proposes ex-PM as successor in March vote", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:49:00.000+02:00", "replies_count": 0, "uuid": "d545d5409d99090a9d80d9acc18d5a70ca2e12aa"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-armenia-president/armenian-president-proposes-ex-pm-as-successor-in-march-vote-idUSKBN1F81RF", "ord_in_thread": 0, "title": "Armenian president proposes ex-PM as successor in March vote", "locations": [], "entities": {"persons": [{"name": "serzh sarksyan", "sentiment": "negative"}, {"name": "sarkissian", "sentiment": "none"}, {"name": "sarksyan", "sentiment": "none"}, {"name": "armen sarkissian", "sentiment": "none"}], "locations": [{"name": "yerevan", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ex-soviet republic", "sentiment": "none"}, {"name": "yerevan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "republican party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YEREVAN (Reuters) - Armenian President Serzh Sarksyan on Friday proposed the country’s ambassador in Britain to run to succeed him in a March election, a move critics said could allow him to continue wielding ultimate power after a constitutional change.\nThe Armenian presidency will lose much of its powers after the election under constitutional amendments approved in a 2015 referendum, with the prime minister and parliament taking on more responsibilities and influence in the ex-Soviet republic.\nSarksyan, nearing the end of his second term, nominated Yerevan’s envoy to London, Armen Sarkissian, 64, also a former prime minister, to run for president in the general election tentatively set for March 2.\n“I, taking into account your abilities and qualifications, have proposed to my colleagues that you agree to run for president for our political force (ruling Republican Party),” Sarksyan told Sarkissian at a televised meeting.\nSarkissian, a businessman seen as a political independent, replied that the proposal was an honor for him and that he would make a decision after meetings with politicians and members of the wider public.\nOpposition leaders cried foul, accusing Sarksyan of plans to move into the post of prime minister to continue ruling Armenia de facto after the presidency becomes a largely ceremonial post. He denied having any such intention.\nArmenian presidents will now be elected by a three-quarters majority of parliament, rather than voters, and serve only one seven-year term under the constitutional amendments. The opposition has yet to announce its candidate for the March vote.\nThe Republican Party (RPA) won parliamentary elections in April last year with 49 percent of the vote while the opposition Tsarukyan Alliance took 27 percent.\nSarksyan, 62, leader of the RPA and president since 2008, has repeatedly denied the constitutional changes were engineered to allow him to retain domination over Armenian politics.\nMany Armenians accuse the government of corruption and of mishandling the troubled economy. Armenia depends heavily for aid and investment on Russia.\nReporting by Hasmik Mkrtchyan; writing by Vladimir Soldatkin; editing by Mark Heinrich\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T22:49:00.000+02:00", "crawled": "2018-01-20T17:45:38.015+02:00", "highlightTitle": ""}