{"organizations": [], "uuid": "e897bf237f56aa824083cf30bddb69e4033a017b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/26/reuters-america-update-8-oil-firm-set-for-weekly-gain-as-weak-dollar-underpins.html", "country": "US", "domain_rank": 767, "title": "UPDATE 8-Oil firm, set for weekly gain as weak dollar underpins", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T18:51:00.000+02:00", "replies_count": 0, "uuid": "e897bf237f56aa824083cf30bddb69e4033a017b"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/26/reuters-america-update-8-oil-firm-set-for-weekly-gain-as-weak-dollar-underpins.html", "ord_in_thread": 0, "title": "UPDATE 8-Oil firm, set for weekly gain as weak dollar underpins", "locations": [], "entities": {"persons": [{"name": "brian larose", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* U.S. dollar has fallen to 2014 lows this week\n* Both benchmarks on track for weekly gain\n* Demand outlook weaker ahead of refinery maintenance season\n* Rising U.S. output undermines OPEC/Russia supply cuts\n* Coming Up: Baker Hughes U.S. oil rig count at 1 p.m./1800 GMT (New throughout, updates prices, market activity and analyst comments; changes byline, dateline from LONDON)\nHOUSTON, Jan 26 (Reuters) - Oil prices were firmer on Friday after hitting fresh three-year highs in the previous session, as weakness in the dollar continued to underpin prices with crude on track for a weekly gain.\nBrent crude futures were trading 5 cents higher at $70.47 per barrel at 11:15 a.m. EST (1615 GMT). On Thursday, the contract climbed to as high as $71.28, its highest since 2014.\nU.S. West Texas Intermediate (WTI) crude futures were trading 57 cents, or 0.8 percent higher, at $66.08 a barrel. On Thursday, they also reached their highest since December 2014, at $66.66.\n\"One has to question if this rally is sustainable. Downside protection is going to be warranted,\" said Brian LaRose, technical analyst at United-ICAP.\nBoth contracts were set for weekly gains after support from a weakening dollar, which on Friday hit new three-year lows against a basket of other leading currencies.\nBrent was so far up 2.7 percent this week, while WTI was on track for a weekly gain of 4 percent.\n\"This inverse dollar relationship with crude can be nebulous at times, but weve reached a point where the impact will be felt in the form of higher crude prices,\" said John Kilduff, partner at Again Capital LLC in New York.\nAs oil is traded in dollars, swings in the greenback can impact oil demand as they affect the price of fuel purchases for countries using other currencies.\nStill, crude prices were capped by seasonally weakening demand.\nGeorgi Slavov, head of research at commodities brokerage Marex Spectron, said despite a generally healthy outlook, there were short-term oil demand headwinds due to the coming end of winter in the northern hemisphere.\nMany refiners shut down after winter for maintenance, resulting in lower orders for crude, their most important feedstock.\n\"Demand is starting to weaken as ... refining capacity was taken out of the market,\" Slavov said.\nThis is reflecting in oil inventories. U.S. bank Morgan Stanley noted that global oil stocks built up overall in the week ending Jan. 19.\nOn the supply side, U.S. oil production <C-OUT-T-EIA> was expected to hit 10 million barrels per day (bpd) soon, putting it on a par with top exporter Saudi Arabia.\nOutput has grown by more than 17 percent since mid-2016. Only Russia produces more, averaging 10.98 million bpd in 2017.\nRising U.S. output threatens to undermine the supply restraint led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia, aimed at propping up prices.\nThe cuts, coupled with demand growth, have contributed to a near 60 percent rise in oil prices since mid-2017 as excess crude inventories have been drawn down.\nThe market is also awaiting Baker Hughes data at 1 p.m. on the U.S. rig count, an early indicator of future output. Last week drillers cut five oil rigs.\n(Additional reporting by Libby George in London and Henning Gloystein in Singapore; Editing by Marguerita Choy)", "external_links": [], "published": "2018-01-26T18:51:00.000+02:00", "crawled": "2018-01-26T21:35:40.025+02:00", "highlightTitle": ""}