{"organizations": [], "uuid": "29bfc2248ad82d665b69d40192108de1cbfe1cbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-motor-f1-tyres-isola/tyre-choice-is-not-so-hard-says-pirelli-chief-idUKKBN1F11OA", "country": "US", "domain_rank": 408, "title": "Tyre choice is not so hard, says Pirelli chief", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:49:00.000+02:00", "replies_count": 0, "uuid": "29bfc2248ad82d665b69d40192108de1cbfe1cbb"}, "author": "", "url": "https://uk.reuters.com/article/uk-motor-f1-tyres-isola/tyre-choice-is-not-so-hard-says-pirelli-chief-idUKKBN1F11OA", "ord_in_thread": 0, "title": "Tyre choice is not so hard, says Pirelli chief", "locations": [], "entities": {"persons": [{"name": "alan", "sentiment": "negative"}, {"name": "isola", "sentiment": "none"}, {"name": "mario isola", "sentiment": "none"}, {"name": "baldwin", "sentiment": "none"}], "locations": [{"name": "birmingham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "pirelli", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 1:50 PM / Updated 3 hours ago Tyre choice is not so hard, says Pirelli chief Alan Baldwin 4 Min Read \nBIRMINGHAM, England (Reuters) - Formula One fans will see Pirelli’s new super-hard tyre on track this season only if the sport’s sole supplier has got its sums wrong. \nMario Isola, the Italian company’s motorsports head, told Reuters that lap times were likely to keep on tumbling in 2018 thanks to softer compounds. \nPirelli has added hyper-softs and super-hards to its ‘rainbow’ range of seven compounds, with the sidewalls colour-coded for easy recognition. \nIsola said the hardest was only included as an insurance policy, however. \n“The current hard tyre, the light blue, is the medium level of last year,” he explained at the Autosport International show in Birmingham. \n”We are not going to use the super-hard, but we wanted to homologate this just as a backup. \n“We want to keep it in the range because if we under-estimate for any reason the development of the cars then maybe we need to move one step on the other side.” \nIsola said accurate simulations provided by teams in the past meant that was unlikely to happen, but Barcelona -- the fifth race of the year -- would be the first real test of the tyres. \n“If in Barcelona we understand that the hard tyre is degrading too much, we can evaluate to introduce the super-hard in Silverstone or Suzuka,” he said. “But honestly it is quite a remote possibility.” \nIsola said Pirelli had actually homologated 10 compounds at the end of 2016, when the rules changed and there was more uncertainty about the new-specification fatter tyres. \nThose compounds were a new ‘family’ from previous ones that had been criticised by drivers for high wear. TWO-STOP STRATEGY \nIsola said the target for 2018 was a general two-stop strategy. \n“To have a three-stop race you should have compounds with very high degradation. Very high degradation is not something that the drivers like... when they push on the tyre, the tyre loses performance,” he said. \n“We believe two stops is the right compromise. But again it will depend a lot on the tyre degradation.” \nPirelli’s 2018 range of tyres goes from super-hard through hard, medium, soft, super-soft, ultra-soft and hyper-soft with the pink-walled latter’s designation decided by a fan vote. \nHarder tyres are slower over a lap but longer lasting while softer ones are quicker but lose performance sooner. Three tyre types are selected for each race, with different requirements from circuit to circuit. \nIsola dismissed a suggestion that the rash of names and colours was confusing at a time when the sport is trying to become more accessible. \nHe said Pirelli had debated just using three names -- hard, medium and soft -- regardless of which of the seven compounds are actually used but decided that would be dumbing down the sport. \n”The point is, are we giving the right message to the spectators?,“ he said. ”We are saying we are going to Monte Carlo, Silverstone, Monza and Suzuka with the same three compounds. \n”We can explain they are different but the message for spectators watching on television is that we have three compounds we can use anywhere. It’s not Formula One. \n“Formula One has different set ups for each different circuit, different aero parts and wings and floors. It is the top of technology so also the tyres must be the top of technology.” \nIsola said it might take a few races to adapt but “spectators are not stupid.” \n“Formula One fans know everything about the cars, about the tyres, the drivers. It is really not too difficult to understand when you have three different compounds,” he added. \nThe season starts in Australia on March 25. Reporting by Alan Baldwin, editing by Christian Radnedge", "external_links": [], "published": "2018-01-12T15:49:00.000+02:00", "crawled": "2018-01-12T17:47:59.014+02:00", "highlightTitle": ""}