{"organizations": [], "uuid": "8bf5c86a31b35626d987bf01338433d0faabd00a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-westamerica-bancorporation-reports-fourth-quarter-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Westamerica Bancorporation Reports Fourth Quarter 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-18T19:00:00.000+02:00", "replies_count": 0, "uuid": "8bf5c86a31b35626d987bf01338433d0faabd00a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-westamerica-bancorporation-reports-fourth-quarter-2017-financial-results.html", "ord_in_thread": 0, "title": "Westamerica Bancorporation Reports Fourth Quarter 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "san rafael", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "westamerica bancorporation", "sentiment": "negative"}, {"name": "wabc", "sentiment": "negative"}, {"name": "westamerica", "sentiment": "none"}, {"name": "westamerica bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN RAFAEL, Calif., Jan. 18, 2018 (GLOBE NEWSWIRE) -- Westamerica Bancorporation (Nasdaq: WABC), parent company of Westamerica Bank, generated net income for the fourth quarter 2017 of $4.2 million and diluted earnings per common share (\"EPS\") of $0.16. Fourth quarter 2017 results include adjustments to asset values triggered by enactment of the Tax Cuts and Jobs Act of 2017 which reduced EPS $0.48, recognition of a loss contingency which reduced EPS $0.12, and securities gains which increased EPS $0.18. Fourth quarter 2017 results compare to third quarter 2017 net income of $15.0 million and EPS of $0.57, and to fourth quarter 2016 net income of $14.5 million and EPS of $0.56.\n\"Fourth quarter 2017 net income benefited from higher net interest income; Westamerica’s annualized net interest margin on a fully taxable equivalent basis increased to 3.12 percent in the fourth quarter 2017 from 3.10 percent in the third quarter 2017. The margin is supported by a relatively low cost of funding, which has been steady at 0.04 percent of loans and investments from the fourth quarter of 2016 through the fourth quarter 2017. Asset quality remains very high with nonperforming assets totaling only $7.9 million at December 31, 2017 and net loan losses for the year 2017 were just 0.08 percent of average loan balances,” said Chairman, President and CEO David Payne. “After the accounting charges required by the new tax law, Westamerica’s capital position remains solid with total capital to assets of 10.7 percent at December 31, 2017 compared to 11.1 percent at September 30, 2017. Westamerica increased its quarterly dividend to $0.40 per common share in the fourth quarter 2017,” concluded Payne.\nThe annualized net interest margin on a fully taxable equivalent basis was 3.12 percent for the fourth quarter 2017, compared to 3.10 percent for the third quarter 2017, and 3.15 percent for the fourth quarter 2016. Net interest income on a fully taxable equivalent basis was $36.6 million for the fourth quarter 2017, compared to $35.7 million for the third quarter 2017, and $36.0 million for the fourth quarter 2016. The annualized funding cost of deposits and other interest-bearing borrowings, as a percentage of average earning assets, was unchanged at 0.04 percent for the fourth quarter 2017, third quarter 2017, and fourth quarter 2016. Checking and savings deposits, which earn relatively low interest rates and are less volatile than time deposits during periods of rising market interest rates, represented 95 percent of average total deposits during the fourth quarter 2017.\nThe Company recognized no provision for loan losses for the fourth quarter 2017 given stable nonperforming loan volumes and other credit quality attributes. At December 31, 2017, the allowance for loan losses totaled $23.0 million.\nNoninterest income for the fourth quarter 2017 totaled $20.3 million, including $8.0 million in securities gains, compared to $12.5 million for the third quarter 2017 and $11.5 million for the fourth quarter 2016. Merchant processing fees were $2.3 million for the fourth quarter 2017, $2.2 million for the third quarter 2017 and $1.7 million for the fourth quarter 2016; the increase is due to successful sales efforts and increased processing volumes.\nNoninterest expense for the fourth quarter 2017 totaled $30.2 million, including a $625 thousand impairment of low income housing limited partnership investments due to enactment of the Tax Cuts and Jobs Act of 2017 and a $5.5 million loss contingency accrual. As disclosed in the Company’s Form 8-K filed October 19, 2017 and Form 10-Q filed November 3, 2017, the Company has determined that it is obligated to provide refunds of revenue recognized in prior years to some customers; the Company has estimated the probable amount of these obligations and accrued a liability as of December 31, 2017.\nThe book tax provision on a fully taxable equivalent basis for the fourth quarter 2017 totaled $22.6 million, of which $12.3 million represents the charge to re-measure the Company’s net deferred tax asset triggered by enactment of the Tax Cuts and Jobs Act of 2017.\nWestamerica Bancorporation, through its wholly owned subsidiary Westamerica Bank, operates commercial banking and trust offices throughout Northern and Central California.\nWestamerica Bancorporation Web Address: www.westamerica.com\nFor additional information contact:\nWestamerica Bancorporation\n1108 Fifth Avenue, San Rafael, CA 94901\nRobert A. Thorson – SVP & Chief Financial Officer\n707-863-6840\ninvestments@westamerica.com\nFORWARD-LOOKING INFORMATION:\nThe following appears in accordance with the Private Securities Litigation Reform Act of 1995:\nThis press release may contain forward-looking statements about the Company, including descriptions of plans or objectives of its management for future operations, products or services, and forecasts of its revenues, earnings or other measures of economic performance. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include the words \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"estimate,\" or words of similar meaning, or future or conditional verbs such as \"will,\" \"would,\" \"should,\" \"could,\" or \"may.\"\nForward-looking statements, by their nature, are subject to risks and uncertainties. A number of factors — many of which are beyond the Company's control — could cause actual conditions, events or results to differ significantly from those described in the forward-looking statements. The Company's most recent reports filed with the Securities and Exchange Commission, including the annual report for the year ended December 31, 2016 filed on Form 10-K and quarterly report for the quarter ended September 30, 2017 filed on Form 10-Q, describe some of these factors, including certain credit, interest rate, operational, liquidity and market risks associated with the Company's business and operations. Other factors described in these reports include changes in business and economic conditions, competition, fiscal and monetary policies, disintermediation, legislation including the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2011, the Sarbanes-Oxley Act of 2002 and the Gramm-Leach-Bliley Act of 1999, and mergers and acquisitions.\nForward-looking statements speak only as of the date they are made. The Company does not undertake to update forward-looking statements to reflect circumstances or events that occur after the date forward looking statements are made.\nPublic Information January 18, 2018 WESTAMERICA BANCORPORATION FINANCIAL HIGHLIGHTS December 31, 2017 1. Net Income Summary. (in thousands except per-share amounts) % Q4'17 Q4'16 Change Q3'17 Net Interest and Fee Income (FTE) $ 36,644 $ 35,959 1.9 % $ 35,680 Reversal of Provision for Loan Losses - - n/m - Noninterest Income 20,300 11,545 75.8 % 12,548 Noninterest Expense 30,167 24,577 22.7 % 24,114 Income Before Taxes (FTE) 26,777 22,927 16.8 % 24,114 Income Tax Provision (FTE) 22,617 8,474 n/m 9,097 Net Income $ ", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/0c2f19fe-23e5-4269-90fa-d14fa10ad7b4", "https://www.globenewswire.com/Tracker?data=NeoCEunDw-jsjB04hxr-eLslyZP1MmXKx7WDQtkBtddcc74E6G-mgKHWyNFzTUe_hj3OTIHWe4XTolchEZAuQYowf01knCm-nTUTq0pfAhk="], "published": "2018-01-18T19:00:00.000+02:00", "crawled": "2018-01-18T19:56:44.013+02:00", "highlightTitle": ""}