{"organizations": [], "uuid": "32f099ad5302b78835d999433758487dba3425a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-lincoln-financial-group-signs-agreement-to-acquire-liberty-life-assurance-company-of-boston.html", "country": "US", "domain_rank": 767, "title": "Lincoln Financial Group Signs Agreement to Acquire Liberty Life Assurance Company of Boston", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:30:00.000+02:00", "replies_count": 0, "uuid": "32f099ad5302b78835d999433758487dba3425a7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-lincoln-financial-group-signs-agreement-to-acquire-liberty-life-assurance-company-of-boston.html", "ord_in_thread": 0, "title": "Lincoln Financial Group Signs Agreement to Acquire Liberty Life Assurance Company of Boston", "locations": [], "entities": {"persons": [], "locations": [{"name": "pa.", "sentiment": "none"}, {"name": "radnor", "sentiment": "none"}], "organizations": [{"name": "lnc", "sentiment": "none"}, {"name": "liberty life assurance company of boston", "sentiment": "none"}, {"name": "lincoln financial group", "sentiment": "none"}, {"name": "liberty mutual insurance group", "sentiment": "none"}, {"name": "liberty’s group benefits", "sentiment": "none"}, {"name": "lincoln financial group’s strategic priority of increasing mortality", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "liberty’s individual life", "sentiment": "none"}, {"name": "protective life insurance company", "sentiment": "none"}, {"name": "lincoln financial", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acquisition Positions Lincoln Financial Group as a Group Benefits Market Leader by Enhancing Large Case Presence and Disability Expertise, Complementing Current Markets with Limited Sales Overlap\nFurther Advances Lincoln Financial Group’s Strategic Priority of Increasing Mortality and Morbidity Sources of Earnings\nRADNOR, Pa.--(BUSINESS WIRE)-- Lincoln Financial Group (NYSE: LNC) announced today that it has entered into a definitive agreement to acquire Liberty Life Assurance Company of Boston from Liberty Mutual Insurance Group. Upon completion of the transaction, Lincoln Financial will retain Liberty’s Group Benefits business and reinsure Liberty’s Individual Life and Annuity business to Protective Life Insurance Company. The acquisition, which is expected to create a single, powerful Group Benefits operation with industry-leading products, services, and capabilities, is expected to be completed in the second quarter of 2018, pending regulatory approvals and other customary closing conditions.\n“Through this transaction, Lincoln Financial will have a significantly increased presence in the Group Benefits market by complementing our existing small to middle-market strengths with even deeper large case and disability expertise,” said Dennis R. Glass, president and chief executive officer of Lincoln Financial Group. “Liberty is a respected and high-quality carrier, one with talented Group Benefits employees who will soon join our own impressive team in order to drive even greater benefit for all customers. The acquisition also aligns with our strategic priority of diversifying our sources of earnings and effectively deploying capital.”\nWith this acquisition, Lincoln Financial is poised to become a Group Benefits market leader, as the combined Fully Insured Disability sales market share would be ranked number one at 14 percent, and the combined Total Life and Fully Insured Disability sales market share rank would be number three. 1 Lincoln Financial will expand its distribution and product reach, strengthen its capabilities, and leverage new opportunities to benefit customers and shareholders by tapping into Liberty’s competitive advantages, which include enhanced absence management, extensive claim clinical resources and broader broker and consultant relationships.\n“Today’s announcement uniquely positions each company to expand on their core strengths, profitability and market presence,” said David H. Long, Liberty Mutual chairman and chief executive officer. “For Liberty, the transaction is an integral part of our overall strategy to focus on our property and casualty business. Lincoln Financial and Protective will each benefit from Liberty’s profitable book of business and its momentum in the Group, Individual Life and Annuity businesses, as well as from the addition of our many talented and committed employees.”\nThe combined organization will meet the evolving needs of employers and employees by featuring Life, Disability, Dental, Vision, Critical Illness, and Accident insurance, plus a full suite of enhanced absence management services. It will also have access to 10 million insureds and enable Lincoln Financial to accelerate its employee-paid sales, which has been an increasing area of focus.\nAdditional Transaction Details\nUnder the terms of the agreement, Lincoln Financial Group will pay Liberty Mutual approximately $3.3 billion, which consists of $1.446 billion total net investment for the Group Benefits business, including a purchase price of $1.021 billion and $425 million in required capital. The remaining components of the payment to Liberty Mutual include $410 million of individual life and annuity value paid by Protective Life; $1.202 billion associated with excess capital in LLAC; and $211 million of tax items. The acquisition is expected to be accretive to Lincoln Financial’s earnings per share in 2019, excluding integration costs, and will be financed with cash and the issuance of debt. Lincoln’s shareholder buyback program will be temporarily suspended, and is expected to resume no later than the third quarter of 2018. Goldman Sachs & Co. LLC acted as financial advisor to Lincoln Financial and Wachtell, Lipton, Rosen & Katz acted as legal advisor. Barclays acted as financial advisor to Liberty Mutual, and Skadden, Arps, Slate, Meagher, & Flom LLP acted as legal advisor.\nConference Call\nWebcast Information\nLincoln Financial Group will host a conference call this morning, Friday, January 19, 2018 at 8:30 a.m. Eastern Time, to discuss the details of this transaction. A presentation will be available on the Investor Relations webpage at www.lfg.com/investor prior to this morning’s call.\nInterested persons are invited to listen through the internet. Please visit the events section of our Investor Relations webpage at www.lfg.com/webcast at least fifteen minutes prior to the event to register, download and install any necessary streaming media software.\nConference Call Information\nInterested persons may also listen to the call by dialing the following numbers:\n(866) 394-4575 (U.S./Canada)\n(678) 509-7536 (International)\nAsk for the Lincoln National Conference Call.\nReplay Information\nA replay of the call will be available by 1:00 p.m. Eastern Time on January 19, 2018 at www.lfg.com/webcast .\nAudio replay will also begin by 1:00 p.m. Eastern Time on January 19, 2018, and it will remain available through 12:00 p.m. Eastern Time on January 26, 2018. To access the re-broadcast:\n(855) 859-2056 (Domestic)\n(404) 537-3406 (International)\nEnter conference code: 3898307\nAbout Lincoln Financial Group\nLincoln Financial Group provides advice and solutions that help empower people to take charge of their financial lives with confidence and optimism. Today, more than 17 million customers trust our retirement, insurance, and wealth protection expertise to help address their lifestyle, savings, and income goals, as well as to guard against long-term care expenses. Headquartered in Radnor, Pennsylvania, Lincoln Financial Group is the marketing name for Lincoln National Corporation (NYSE:LNC) and its affiliates. The company had $246 billion in assets under management as of September 30, 2017. Lincoln Financial Group is a committed corporate citizen and was named one of the Forbes Best Employers for 2017, is a member of the Dow Jones Sustainability Index North America, and received a perfect score of 100 percent on the 2017 Corporate Equality Index. Follow us on Facebook , Twitter , LinkedIn , and Instagram . Sign up for email alerts at http://newsroom.lfg.com .\nAbout Liberty Mutual Insurance\nLiberty Mutual’s purpose is to help people embrace today and confidently pursue tomorrow. Keeping this promise means we are there when our policyholders throughout the world need us most.\nIn business since 1912, and headquartered in Boston, Mass., today we are a leading global insurer with operations in 30 countries and economies around the world. We are the fourth largest property and casualty insurer in the U.S. based on 2016 direct written premium data as reported by the National Association of Insurance Commissioners. We also rank 75th on the Fortune 100 list of largest corporations in the U.S. based on 2016 revenue. As of December 31, 2016, we had $38.3 billion in annual consolidated revenue.\nWe employ more than 50,000 people in over 800 offices throughout the world. We offer a wide range of insurance products and services, including personal automobile, ho", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fnewsroom.lfg.com&esheet=51745813&newsitemid=20180119005305&lan=en-US&anchor=http%3A%2F%2Fnewsroom.lfg.com&index=8&md5=301ca76c8fa6483fccdaeadf33538d8f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2F4307%3FtrkInfo%3Dtas%253Alincoln%2Bfinancial%252Cidx%253A3-1-3%26trk%3Dtyah&esheet=51745813&newsitemid=20180119005305&lan=en-US&anchor=LinkedIn&index=6&md5=4497f2cd1fa2762c5e2a900ae70760a4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.facebook.com%2Flincolnfinancialgroup&esheet=51745813&newsitemid=20180119005305&lan=en-US&anchor=Facebook&index=4&md5=ebcb8b12dbedd75d871a0f6cd720758f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lfg.com%2Fwebcast&esheet=51745813&newsitemid=20180119005305&lan=en-US&anchor=www.lfg.com%2Fwebcast&index=2&md5=dc43db7a12262472819e6b7dbeeca12f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.Protective.com&esheet=51745813&newsitemid=20180119005305&lan=en-US&anchor=www.Protective.com&index=10&md5=7dc871e528431bd1069a0f5f373dfcf6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lfg.com%2Finvestor&esheet=51745813&newsitemid=20180119005305&lan=en-US&anchor=www.lfg.com%2Finvestor&index=1&md5=4bd40f24517ef98316a7ae8bbfc2417f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.instagram.com%2Flincolnfingroup%2F&esheet=51745813&newsitemid=20180119005305&lan=en-US&anchor=Instagram&index=7&md5=82cadeafdca99a5860acc2661931dd7f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.libertymutualinsurance.com&esheet=51745813&newsitemid=20180119005305&lan=en-US&anchor=www.libertymutualinsurance.com&index=9&md5=f0f6756f381025bae05ad5bc5441ae0d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fmobile.twitter.com%2Flincolnfingroup&esheet=51745813&newsitemid=20180119005305&lan=en-US&anchor=Twitter&index=5&md5=2ebe246a4618d668e161f1a8ef379031", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lfg.com%2Fwebcast&esheet=51745813&newsitemid=20180119005305&lan=en-US&anchor=www.lfg.com%2Fwebcast&index=3&md5=e934aaab3a84dfcfc940890e9d07c206", "http://www.businesswire.com/news/home/20180119005305/en/"], "published": "2018-01-19T15:30:00.000+02:00", "crawled": "2018-01-19T16:05:04.000+02:00", "highlightTitle": ""}