{"organizations": [], "uuid": "0d519af0c61a75b3cbfbd628de8929bd30b0e4dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-pembina-pipeline-corporation-announces-senior-management-appointments.html", "country": "US", "domain_rank": 767, "title": "Pembina Pipeline Corporation Announces Senior Management Appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T01:04:00.000+02:00", "replies_count": 0, "uuid": "0d519af0c61a75b3cbfbd628de8929bd30b0e4dc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-pembina-pipeline-corporation-announces-senior-management-appointments.html", "ord_in_thread": 0, "title": "Pembina Pipeline Corporation Announces Senior Management Appointments", "locations": [], "entities": {"persons": [{"name": "mick dilger", "sentiment": "none"}, {"name": "wiun", "sentiment": "none"}, {"name": "jason wiun", "sentiment": "none"}], "locations": [{"name": "calgary", "sentiment": "none"}], "organizations": [{"name": "pembina", "sentiment": "negative"}, {"name": "pembina pipeline corporation", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "ppl", "sentiment": "none"}, {"name": "pba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CALGARY, Jan. 2, 2018 /PRNewswire/ - Pembina Pipeline Corporation (\"Pembina\" or \"the Company\") (TSX: PPL; NYSE: PBA) announced today several senior executive appointments.\nOver the past few years, Pembina has experienced transformational growth. Since the beginning of 2015, the Company has placed over $8 billion of new assets into service. Furthermore, in 2017 the Company completed a major multi-billion dollar corporate acquisition. Given the enhanced scale and scope of Pembina's business and considering the future needs of both the Company and the North American energy industry, Pembina's management structure is evolving to position it for continued success. The following individuals have been appointed to newly created positions within Pembina's executive team reporting directly to Mick Dilger, Pembina's President & Chief Executive Officer:\nJason Wiun , Senior Vice President (\"SVP\") & Chief Operating Officer, Pipelines – Mr. Wiun started his career with Pembina in 1997 and has held progressive roles across the Company, with his most recent position being that of Vice President, Conventional Pipelines. In his new role, Mr. Wiun has accountability for the Company's natural gas liquids (\"NGL\"), crude, condensate, oil sands and natural gas transportation pipelines. Jaret Sprott, SVP & Chief Operating Officer, Facilities – Mr. Sprott joined Pembina as Vice President of its Gas Services business in January 2015. Prior to joining Pembina, Mr. Sprott spent a number of years with a leading North American upstream producer in a variety of engineering, development, operating and planning roles. In his new role, Mr. Sprott has accountability for the Company's natural gas processing, extraction, fractionation and storage facilities. Stu Taylor , SVP Marketing and New Ventures & Corporate Development Officer – Mr. Taylor joined Pembina in 2009 as Vice President, Gas Services and his most recent position was as Senior Vice President, NGL and Natural Gas Facilities. In his new role, Mr. Taylor has accountability for all commodity marketing activities, plus initiatives associated with extending Pembina's value chain such as the proposed integrated propane dehydrogenation and polypropylene facility and the Jordan Cove LNG projects as well as various other major projects. Paul Murphy , SVP & Corporate Services Officer – Mr. Murphy joined Pembina in February 2011 as Vice President, Conventional Pipelines, and his most recent position was as Senior Vice President, Pipeline & Crude Oil Facilities. Mr. Murphy has over 30 years of related experience in hydrocarbon exploration, processing, NGL extraction and transportation, which includes holding several management and executive positions with major transportation and processing companies. In his new role, Mr. Murphy will ensure that corporate functions, including technical and operating services, information systems and human resources are aligned with the strategic goals of the Company.\nScott Burrows, Pembina's SVP & Chief Financial Officer, and Harry Anderson, Pembina's SVP, External Affairs & Chief Legal Officer, will continue in their current roles which they were appointed to on July 1, 2017.\n\"I would like to congratulate these individuals on their appointments,\" said Mr. Dilger. \"Each of them have been instrumental to Pembina's success and have made significant contributions to the major milestones that have helped transform Pembina into a leading North American energy infrastructure company.\"\nFor additional information please see Pembina's website at www.pembina.com\nAbout Pembina\nCalgary-based Pembina Pipeline Corporation is a leading transportation and midstream service provider that has been serving North America's energy industry for over 60 years. Pembina owns and operates an integrated system of pipelines that transport natural gas and various products derived from natural gas and hydrocarbon liquids produced primarily in western Canada. The Company also owns and operates gas gathering and processing facilities and an oil and natural gas liquids infrastructure and logistics business. Pembina's integrated assets and commercial operations along the majority of the hydrocarbon value chain allow it to offer a full spectrum of midstream and marketing services to the energy sector. Pembina is committed to working with its community and aboriginal neighbours, while providing value for investors in a safe, environmentally responsible manner. This balanced approach to operating ensures the trust Pembina builds among all of its stakeholders is sustainable over the long term. Pembina's common shares trade on the Toronto and New York stock exchanges under PPL and PBA, respectively. Pembina's preferred shares also trade on the Toronto stock exchange. For more information, visit www.pembina.com .\nSOURCE Pembina Pipeline Corporation", "external_links": ["http://www.pembina.com/"], "published": "2018-01-03T01:04:00.000+02:00", "crawled": "2018-01-03T02:10:50.000+02:00", "highlightTitle": ""}