{"organizations": [], "uuid": "5a8c2c1e3129a8a067393eeaeacaef5ec67b5ed0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-four-springs-capital-trust-announces-40-million-convertible-preferred-investment-from-guggenheim-investments.html", "country": "US", "domain_rank": 767, "title": "Four Springs Capital Trust Announces $40 Million Convertible Preferred Investment from Guggenheim Investments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:56:00.000+02:00", "replies_count": 0, "uuid": "5a8c2c1e3129a8a067393eeaeacaef5ec67b5ed0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-four-springs-capital-trust-announces-40-million-convertible-preferred-investment-from-guggenheim-investments.html", "ord_in_thread": 0, "title": "Four Springs Capital Trust Announces $40 Million Convertible Preferred Investment from Guggenheim Investments", "locations": [], "entities": {"persons": [{"name": "greg kranias", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "guggenheim", "sentiment": "none"}], "organizations": [{"name": "million convertible preferred investment", "sentiment": "negative"}, {"name": "guggenheim investments strategic investment", "sentiment": "negative"}, {"name": "company’s board", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "matt settle of guggenheim investments", "sentiment": "none"}, {"name": "company’s board of trustees", "sentiment": "none"}, {"name": "guggenheim investments", "sentiment": "none"}, {"name": "guggenheim partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Strategic Investment from Global Asset Manager with $243 Billion in Assets under Management\nLAKE COMO, N.J.--(BUSINESS WIRE)-- Four Springs Capital Trust (“Four Springs” or the “Company”), a real estate investment trust that invests in single-tenant net lease real estate, announced today that funds managed by Guggenheim Investments, the global asset management and investment advisory business of Guggenheim Partners (“Guggenheim”), have acquired $40 million of Series E Preferred Shares of Four Springs (“Convertible Preferred Shares”). As part of the transaction, the Company’s Board of Trustees will be increased from seven to eight members, and Greg Kranias of Guggenheim Investments will join the Company’s Board. In addition, Matt Settle of Guggenheim Investments will be designated as an observer to the Company’s Board.\nProceeds from the $40 million Convertible Preferred Share issuance to Guggenheim will be used by Four Springs for: (i) the acquisition of additional net lease properties in the Company’s pipeline; (ii) repayment of a portion of the Company’s debt under its credit facility led by KeyBank N.A.; and (iii) working capital and other general corporate purposes.\nBill Dioguardi, Chairman of the Board and Chief Executive Officer of Four Springs, commented, “We are excited to announce an investment of $40 million from Guggenheim, a leading global investment firm, and are thrilled to have a strategic capital partner of the caliber of Guggenheim.”\n“We believe there will be tremendous synergies between our two organizations that will enable us to execute on our growth strategy and create value for our shareholders,” added Coby Johnson, President and Chief Operating Officer of Four Springs.\nGreg Kranias of Guggenheim Investments said, “We were attracted to Four Springs by their successful track record of investing in net lease real estate and the high quality portfolio they had assembled with their disciplined investment approach. We are confident that the Four Springs management team will be able to leverage their robust net lease investment platform to grow Four Springs into a leading net lease REIT and deliver attractive returns to its shareholders.”\nAbout Four Springs Capital Trust:\nFour Springs Capital Trust is a private real estate investment trust focused on acquiring a diversified portfolio of retail, industrial/warehouse and healthcare properties net leased to investment grade and other creditworthy tenants under long-term leases. For more information about this announcement, please contact Jodi Hopkinson at (732) 749-7351 or jhopkinson@fsctrust.com .\nAbout Guggenheim Investments\nGuggenheim Investments is the global asset management and investment advisory division of Guggenheim Partners, with $243 billion 1 in assets across fixed income, equity, and alternative strategies. Guggenheim focuses on the return and risk needs of insurance companies, corporate and public pension funds, sovereign wealth funds, endowments and foundations, consultants, wealth managers, and high-net-worth investors. Guggenheim’s 275+ investment professionals perform rigorous research to understand market trends and identify undervalued opportunities in areas that are often complex and underfollowed. This approach to investment management has enabled Guggenheim to deliver innovative strategies providing diversification and attractive long-term results.\n1 Guggenheim Investments total asset figure is as of 9.30.2017. The assets include $11.6bn of leverage for assets under management and $0.4bn for assets for which Guggenheim provides administrative services. Guggenheim Investments represents the following affiliated investment management businesses: Guggenheim Partners Investment Management, LLC, Security Investors, LLC, Guggenheim Funds Investment Advisors, LLC, Guggenheim Funds Distributors, LLC, Guggenheim Real Estate, LLC, GS GAMMA Advisors, LLC, Guggenheim Partners Europe Limited and Guggenheim Partners India Management.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006043/en/\nFour Springs Capital Trust\nJodi Hopkinson, 732-749-7351\njhopkinson@fsctrust.com\nSource: Four Springs Capital Trust", "external_links": ["http://www.businesswire.com/news/home/20180123006043/en/"], "published": "2018-01-23T17:56:00.000+02:00", "crawled": "2018-01-23T20:16:57.003+02:00", "highlightTitle": ""}