{"organizations": [], "uuid": "c8c91a40ad3b8709666bacc89317891ff2a1bbac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/06/original_images-bikes-on-the-google-campus.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/06/google-bike-thieves/", "country": "US", "domain_rank": 1196, "title": "Google is Struggling with Friendly Neighborhood Bike Thieves | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.085, "site_type": "news", "published": "2018-01-06T18:52:00.000+02:00", "replies_count": 0, "uuid": "c8c91a40ad3b8709666bacc89317891ff2a1bbac"}, "author": "David Z. Morris", "url": "http://fortune.com/2018/01/06/google-bike-thieves/", "ord_in_thread": 0, "title": "Google is Struggling with Friendly Neighborhood Bike Thieves | Fortune", "locations": [], "entities": {"persons": [{"name": "david z. morris", "sentiment": "negative"}], "locations": [{"name": "mountain view", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Z. Morris 4:52 PM EST \nBetween 100 and 250 company bicycles are stolen from Google’s campus every week, out of a fleet of around 1,100 so-called Gbikes. Or maybe ‘borrowed’ is a better word than ‘stolen’ – it’s complicated. \nAccording to the Wall Street Journal , the bikes wind up in odd places, like schools, tavern roofs, and Burning Man. The people who take them are often residents of Mountain View, the town that’s home to Google’s headquarters. They often view the bikes as a kind of community service, even though they’re ostensibly meant for Google employees to use on the Google campus. \nGoogle has been trying to control its losses, using roving teams to collect the bikes from around town, and recently installing GPS trackers. That’s how they learned one had made it all the way to the Burning Man festival in Nevada. \nGet Data Sheet , Fortune’s technology newsletter. \nBut according to comments to the Journal from Mountain View residents, the deeper issue may be mixed feelings about the corporate giant. Some locals didn’t realize the bikes were supposed to be for Google employees only, suggesting they regard Google as a benevolent part of the community. \nBut others – perhaps including a man who claimed to have an entire garage full of the bikes – regard their borrowing as a kind of retributive justice against the massive company. One woman specifically cited the annoyance of Google Buses, which bring employees to work from around the San Francisco Bay, saying she borrowed the bikes to “balance it out.” The Google buses have been the target of protests in San Francisco, as a kind of proxy for income inequality and rising rents that have been blamed on the tech boom. \nThe bike situation is subtler and more complex, as befitting lower-key Mountain View. But it still reflects, in the words of one local speaking to the Journal , a sense among residents that “Google owes them somehow, someway.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-06T18:52:00.000+02:00", "crawled": "2018-01-06T23:53:39.001+02:00", "highlightTitle": ""}