{"organizations": [], "uuid": "5d0be615f93544291763cbdcbcf1633a6de84847", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-st-struggles-to-gain-further-as-healthcare-bank-stocks-weigh-idUSL4N1P349A", "country": "US", "domain_rank": 408, "title": "US STOCKS-Wall St struggles to gain further as healthcare, bank stocks weigh", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-09T02:20:00.000+02:00", "replies_count": 0, "uuid": "5d0be615f93544291763cbdcbcf1633a6de84847"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-st-struggles-to-gain-further-as-healthcare-bank-stocks-weigh-idUSL4N1P349A", "ord_in_thread": 0, "title": "US STOCKS-Wall St struggles to gain further as healthcare, bank stocks weigh", "locations": [], "entities": {"persons": [{"name": "investo", "sentiment": "none"}, {"name": "john brady", "sentiment": "none"}, {"name": "sruthi shankar jan", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "caterpillar", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "r.j. o‘brien & associates", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Caterpillar at record high after brokerage upgrade\n* Nasdaq biotech index on track for its worst day since Oct. 26\n* GoPro plunges to new lows after Q4 sales warning\n* Dow down 0.13 pct, S&P flat, Nasdaq up 0.17 pct (Updates to early afternoon)\nBy Sruthi Shankar\nJan 8 (Reuters) - The S&P 500 and the Dow struggled to edge higher on Monday, stalling the strong rally that marked the start of 2018, pressured by losses in healthcare and bank stocks.\nThe S&P and the Nasdaq last week recorded its strongest first four trading days in a year since 2006, and the Dow industrials posted its best since 2003.\n“The market was probably a little bit overbought, it was a big week for stocks in terms of strength and breadth, it’s more of a pause,” said John Brady, senior vice president at futures brokerage R.J. O‘Brien & Associates in Chicago.\nAt 12:40 p.m. ET (1740 GMT), the Dow Jones Industrial Average was down 33.16 points, or 0.13 percent, at 25,262.71.\nThe S&P 500 was up 0.13 points, or 0.004 percent, at 2,743.28 and the Nasdaq Composite was up 12.44 points, or 0.17 percent, at 7,148.99.\nInvestors waited for the fourth-quarter earnings reports to gauge the impact of recent tax cuts. The earnings season kicks off later this week, starting with big banks.\nShares of Bank of America, Goldman Sachs and Wells Fargo were down between 0.74 percent and 1 percent. Most big U.S. lenders have estimated one-off charges to their fourth quarter earnings on account of tax cuts.\nThe S&P healthcare index fell 0.7 percent and was the biggest loser among the major S&P sectors on the first day of JP Morgan annual healthcare conference in San Francisco.\nThe Nasdaq biotech index fell 1.77 percent and was set for its worst day since Oct. 26, led by a 4 percent drop in Biogen and 3.2 percent decline in Regeneron.\nCaterpillar climbed more than 2 percent to hit a record at $165.55, after JP Morgan upgraded the stock saying the tax overhaul could help North America’s construction business cycle extend in 2018.\nKohl’s Corp jumped as much as 8.7 percent after the department store operator posted far stronger same-store sales for the holidays than its bigger peers.\nAmazon edged up 1.23 percent after Credit Suisse hiked its price target on the online retailer’s stock.\nNvidia jumped about 4 percent after the graphics chipmaker announced partnership with Uber and Volkswagen as its artificial intelligence platforms expand into technology for self-driving cars.\nGoPro shares plunged 33 percent to hit a record low at $5.04 after the company said it expected lower fourth-quarter revenue and that it would exit the drone business.\nDeclining issues outnumbered advancers on the NYSE by 1,466 to 1,374. On the Nasdaq, 1,677 issues fell and 1,228 advanced.\nReporting by Sruthi Shankar in Bengaluru; Editing by Arun Koyyur\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T02:20:00.000+02:00", "crawled": "2018-01-09T17:03:44.006+02:00", "highlightTitle": ""}