{"organizations": [], "uuid": "0f6aea205a191939fa8fc824f98ba4907c0bc9ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/31/104808658-RTS1HRUO.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/iphone-x-cuts-here-are-apple-guidance-estimates.html", "country": "US", "domain_rank": 767, "title": "iPhone X cuts? Here are Apple guidance estimates", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-29T21:31:00.000+02:00", "replies_count": 0, "uuid": "0f6aea205a191939fa8fc824f98ba4907c0bc9ed"}, "author": "Anita Balakrishnan", "url": "https://www.cnbc.com/2018/01/29/iphone-x-cuts-here-are-apple-guidance-estimates.html", "ord_in_thread": 0, "title": "iPhone X cuts? Here are Apple guidance estimates", "locations": [], "entities": {"persons": [{"name": "thomas peter", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Thomas Peter | Reuters An attendee uses a new iPhone X during a presentation for the media in Beijing, China October 31, 2017. \nAt nearly $1,000 a pop, Apple 's iPhone X was supposed to drive more upgrades than ever. But more and more reports indicate it's not keeping up with expectations. \nSurprise, though: Aside from a few outspoken analysts, the reports don't seem to have sobered the rest of Wall Street too much. Expectations remain high for Apple's Thursday evening earnings report. In fact, analysts still think Apple is set this week to report its biggest quarter yet in terms of iPhone sales. \nHere's how the bulls and the bears are looking at this week's earnings report. The bad news \nA report in Nikkei Asian Review on Monday indicated that Apple plans to produce 20 million iPhone X units in the first half of this year, half of the 40 million originally expected. While it's not unusual for Apple to shift production schedules, it does sound like a dramatic shift for a flagship phone, a shift Nikkei attributes to soft holiday sales. \nThe report followed similar predictions from analysts at J.P. Morgan , Bernstein and KGI, who questioned whether Apple could fulfill predictions of an iPhone \"supercycle\" this spring. It all comes amid an iPhone cycle that's been unusually difficult to track, thanks to the release of three new phones this fall, and the staggered launch of the iPhone X. \nApple shares were down 2 percent on Monday morning, and 5 percent lower over the past week. The good news \nBut while traders were bearish on Apple, the rest of the Wall Street doesn't seem as concerned. \nNot only is Apple expected to report more iPhone sales than ever in the holiday season — analysts are still expecting average iPhone selling prices to rise through March, indicating a larger portion of phone sales will be high-end models. \nAnalysts surveyed by FactSet expect Apple to report 79 million iPhone unit sales in the December quarter, up from 78 million in the year-ago period. The average selling price will show a more dramatic increase, hitting $737, up from $694 the prior year, analysts predict. \nBetween January and March, Walls Street expects Apple's total Phone sales to grow to 60 million units, up from 51 million the prior year. And the average selling price is expected to hit $750, up from both the December quarter's $737, and from the $664 average selling price in March 2017. In fact, average selling prices are projected to be above $740 through December 2018, the estimates say. \nWhy does this matter? It indicates that while Apple is expected to post a modest increase in the number of phones sold, those phones are will be way more expensive than ever before, kind of like ... an iPhone X. \n\"Although March guidance could be a touch soft, surveys do not suggest a major iPhone X shortfall,\" UBS analysts wrote in a Monday research note. \"Fewer units now could mean modest growth in [the 2019 fiscal year.]\" So, who's right? \nSo if Apple is expected to sell more, expensive iPhones, why would it be cutting production? Did it just overestimate how \"super\" the \"supercycle\" of upgrades would be? That's the mystery Apple will have to address on Thursday. \nApple only traditionally provides forward guidance on a couple of numbers: revenue, gross margin, operating expenses, other income and tax rate. That leaves Wall Street trying to piece together the rest. \nRevenue, gross margin and operating expenses may be the only areas where analysts can get clues for the March quarter and beyond — the other two areas may be affected by Apple's recent announcements that it would pay tax on overseas cash and up domestic investments. \nAccording to FactSet, revenue for the current quarter is expected to be about $66.54 billion. On average, Apple has beat its sales guidance by about 3.3 percent over the past 3 years, FactSet says. \nBut how the market will interpret those numbers is yet to be seen. \n\"How significant can that shortfall be, and will the stock be negatively impacted as a result?\" Bernstein analyst Toni Sacconaghi asked on CNBC's \" Fast Money: Halftime Report \" last week. \n\"While units could be considerably weaker, the market may be underestimating how strong average selling prices are,\" Sacconaghi said. \"So when I'm talking with investors, the debate is: You know, revenues might not go down as much as units. So if units are 5 or 10 percent weaker than people think, perhaps revenue is only maybe a little bit weaker. And when you add in a lower average tax rate, earnings for the year are actually probably going up. So how does the market react to that? \nIn some senses, people may say, 'Wow, this is a super cycle and they're only going to get 3 percent to 5 percent unit growth this year? That's not good.' Others may say, 'It's not a super cycle, but they're getting very strong pricing on the new units. And earnings per share are actually going to be higher than we thought. Maybe that's ok. And that's really the debate that's happening in the investment community right now.\" 'Buyback bazooka' \nSacconaghi returned to \"Halftime Report\" on Monday and said he thinks that more bearish investors may be expecting 50 million to 55 million phones to be sold in the March quarter, well below the consensus estimate of 60 million. But that might still translate to revenue of up to $64 billion, just shy of the $66.5 billion consensus estimate for the March quarter. \n\"If it's that number or better, the stock's probably fine,\" he said. \nPlus, Apple's lower tax rate could be compounded by a \"buyback bazooka\" of cash brought back from overseas, Sacconaghi said.If the company repurchases a large swath of shares, it would more than pacify shareholders and boost earnings. \n\"We think it's possible, if Apple wanted to, it could do $100 billion in extra repurchases,\" Sacconaghi said. \"A lot of sentiment is going to be based on not only what the guide is, but what Apple says its tax rate is going to be, what it is going to do with its repatriated cash going forward, and how its outlook for its other businesses is going as well.\"", "external_links": [], "published": "2018-01-29T21:31:00.000+02:00", "crawled": "2018-01-29T21:31:19.008+02:00", "highlightTitle": ""}