{"organizations": [], "uuid": "f4a66129ce49eaad84f36e4919549558024fd9d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/12/12/102264647-AP946028108200.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/how-the-bomb-cyclone-could-impact-the-power-grid-and-electric-bills.html", "country": "US", "domain_rank": 767, "title": "How the 'bomb cyclone' could impact the power grid and electric bills", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-04T19:10:00.000+02:00", "replies_count": 0, "uuid": "f4a66129ce49eaad84f36e4919549558024fd9d9"}, "author": "Tom Dichristopher", "url": "https://www.cnbc.com/2018/01/04/how-the-bomb-cyclone-could-impact-the-power-grid-and-electric-bills.html", "ord_in_thread": 0, "title": "How the 'bomb cyclone' could impact the power grid and electric bills", "locations": [], "entities": {"persons": [{"name": "ryan hardy", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "ap power", "sentiment": "negative"}, {"name": "emory university", "sentiment": "negative"}, {"name": "national fuel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Let friends in your social network know what you are reading about Facebook How the 'bomb cyclone' could impact the U.S. power grid and electric bills The Northeast and New England face challenges and higher rates due to natural gas pipeline constraints. Post to Facebook A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs How the 'bomb cyclone' could impact the U.S. power grid and electric bills Tom DiChristopher, CNBC Published 4:39 p.m. ET Jan. 4, 2018 | Updated 4:44 p.m. ET Jan. 4, 2018 CLOSE Old Man Winter's first big breath brought similar snowy scenes all along the East Coast. Meteorologists say the strengthening storm has already surpassed the criteria for a \"bomb cyclone.\" USA TODAY A dog is seen in the driver's seat as two men help free a car stuck near the entrance to the Ben Franklin Bridge as a 'cyclone bomb' brings snowfall in in Camden, N.J Jan. 4, 2018. (Photo: Joe Lambert, USA TODAY NETWORK) CONNECT COMMENT EMAIL MORE Utilities have been girding for the \"bomb cyclone\" that's sweeping through the eastern United States, but analysts say Americans shouldn't expect the same impacts that strained the power grid and drove up prices during the 2014 \"polar vortex.\" Power outages have already hit thousands of customers in Florida and the Southeast because of the massive storm. National Fuel warned that it expects outages in New England that could take multiple days to restore. Most weather-related outages happen because of problems with the transmission and distribution system, the lines that carry electric power from generating plants to homes and businesses. Severe winds, freezing cold, accumulation and downed trees can wreak havoc on this system. However, extreme cold also can cause problems at power plants. While it's far rarer than downed lines, this was a major issue during the period of extreme cold called the polar vortex that struck the United States in January 2014. Then, temperatures that were 20 degrees to 40 degrees below normal in many parts of the United States created a host of problems for the plants that generate power throughout the country. At the same time, regional power grids and markets saw record or near-record power demand during the event. In the South, outages hit plants that weren't designed to operate at freezing temperatures, a report by the North American Electric Reliability Council concluded. Meanwhile, outages at coal-fired facilities and problems delivering natural gas to plants in the 13-state region that includes Pennsylvania and New Jersey pushed the system there to the brink. Analysts don't expect those issues to arise again with this week's storm, but natural gas pipeline constraints in the Northeast create challenges for the grid operator and will potentially raise costs for ratepayers. \nThree pedestrians brave the elements as a 'cyclone bomb' brings snowfall to Camden, N.J. Jan. 4, 2018. (Photo: Joe Lamberti, USA TODAY NETWORK) Northeast's natural gas problem Natural gas now accounts for about one-third of U.S. power generation, roughly on par with coal. However, there is significant opposition to new pipeline construction in the densely populated Northeast, which sits just above the major natural gas-producing region in Pennsylvania, Ohio and West Virginia. This becomes an issue during cold snaps, when residences that rely on natural gas for home heating compete for supplies with power plants. \"That's a unique thing that puts stress on the pipeline infrastructure in the Northeast,\" said Ryan Hardy, an energy markets advisor at PA Consulting Group. \"New England is definitely where you have the potential to see problems, particularly over the next few days.\" While natural gas accounted for about half of New England's electric power on an annual basis in 2016, it is currently generating about a quarter, according to New England ISO, the organization that operates the region's grid and power market. To address pipeline constraints and high demand, New England is turning to plants that burn oil, a relatively outdated method of producing power in the United States. About 1% of New England's electric power came from oil-fired generation in 2016. But in recent days, oil-fired generation has accounted for about 30% of the energy mix. Coal-fired generation has provided about 6% of New England's power during the cold snap, compared with about 2% in 2016. ", "external_links": [], "published": "2018-01-04T19:10:00.000+02:00", "crawled": "2018-01-04T19:11:18.000+02:00", "highlightTitle": ""}