{"organizations": [], "uuid": "116a0a8025877c4fb270ad714c7525188ab51626", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-salzmann-ag-st-gallen-sells-its-compression-division-to-the-international-corporate-group-lohmann-rauscher.html", "country": "US", "domain_rank": 767, "title": "Salzmann AG St. Gallen Sells Its Compression Division to the International Corporate Group Lohmann & Rauscher", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T21:04:00.000+02:00", "replies_count": 0, "uuid": "116a0a8025877c4fb270ad714c7525188ab51626"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-salzmann-ag-st-gallen-sells-its-compression-division-to-the-international-corporate-group-lohmann-rauscher.html", "ord_in_thread": 0, "title": "Salzmann AG St. Gallen Sells Its Compression Division to the International Corporate Group Lohmann & Rauscher", "locations": [], "entities": {"persons": [{"name": "salzmann", "sentiment": "negative"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "venosan china", "sentiment": "none"}, {"name": "venosan canada", "sentiment": "none"}, {"name": "venosan bras", "sentiment": "none"}], "organizations": [{"name": "salzmann ag st. gallen sells its compression division", "sentiment": "negative"}, {"name": "international corporate group lohmann & rauscher vienna", "sentiment": "negative"}, {"name": "lohmann & rauscher", "sentiment": "none"}, {"name": "l&r group", "sentiment": "none"}, {"name": "salzmann ag st. gallen", "sentiment": "none"}, {"name": "venosan brasil ltda", "sentiment": "none"}, {"name": "venosan canada inc.", "sentiment": "none"}, {"name": "l&r", "sentiment": "none"}, {"name": "swisslastic ag st. gallen", "sentiment": "none"}, {"name": "ag st. g allen", "sentiment": "none"}, {"name": "venosan (dalian) medical stocking co. ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VIENNA and RENGSDORF, Germany, January 29, 2018 /PRNewswire/ --\nEffective 01 January 2018, Salzmann AG St. G allen is selling its Swiss compression specialist SWISSLASTIC AG ST. GALLEN as well as its majority shares in Venosan Bras il, Venosan China and Venosan Canada to the medical device supplier Lohmann & Rauscher (L&R). With this step Salzmann AG St. Gallen is transferring its expertise in the areas of development, production, sales and distribution of compression therapy product solutions to the international L&R Group.\nIn addition to SWISSLASTIC AG ST. GALLEN, which specialises in the development and production of compression stockings, elastic-covered yarns and pressure measuring devices, L&R will take over Venosan (Dalian) Medical Stocking Co. Ltd., China, Venosan Canada Inc. and acquire majority shares in Venosan Brasil Ltda. These companies are responsible for the production, sales and distribution of compression stockings in the markets mentioned.\nStrong brands joining forces\nWith this acquisition, L&R is looking to have a more effective and comprehensive presence in the international healthcare market. Bundling traditionally strong brands in compression therapy, such as Rosidal, Velpeau, Solaris, and Varitex, and now also VENOSAN, under the umbrella of L&R secures competitive advantages and establishes a wider range of brand-name products for customers and patients. \"Salzmann AG St. Gallen feels that L&R, as a successful player in the medical device industry with a long history and roots as a family business, is the right buyer to successfully continue business operations in the spirit of our founder. Salzmann AG St. Gallen wants to concentrate more on its remaining business divisions,\" explains Patricia Künzli, President & CEO, Salzmann AG St. Gallen.\nSame \" Made in Switzerland \" quality\nThe production and Swiss quality will stay the same after the sale. With L&R, the production and distribution of these products is being taken over by a leading supplier of medical devices and hygiene products with a high level of expertise and strong brands in the compression therapy sector. \"With the acquisition of a well-established manufacturer of compression stockings, elastic-covered yarns and pressure measuring devices and the strong international brand VENOSAN, L&R is acquiring a compression expert with an international presence with a strategically important sales and distribution network and a high level of technological expertise,\" comments Wolfgang Süßle, President & CEO, L&R.\nComprehensive range of compression therapy products\nAs a solution provider, L&R is also seeking to broaden its range of combinable products and systems in the compression therapy sector in order to offer optimal treatment solutions for every indication. With the acquisition of VENOSAN, the L&R portfolio will include a complete range of circular-knit compression stockings, both in standard sizes and made-to-measure. With the compression bandages, ready-for-use bandages and circular- and flat-knit compression stockings and systems, L&R brings together tried-and-tested and innovative solutions for treating patients with venous disorders and/or chronic venous insufficiency and lymphatic indications at every stage of treatment.\nSALZMANN AG ST. GALLEN\nSalzmann AG St. Gallen is a family-run Swiss holding company based in St Gallen. The focus of its activities within Salzmann AG St. Gallen is on the production, sales and distribution of medical devices.\nThe national companies include SWISSLASTIC AG ST. GALLEN, which is a leading international supplier of medical compression stockings, elastic covered yarns and pressure measuring devices. The company has a 50-year history of successful operations characterised by know-how and expertise at the highest level.\nAt the production facility in Wald in the Zürcher Oberland region the company produces high-quality \"Made in Switzerland\" products. SWISSLASTIC AG ST. GALLEN's administrative offices are located in St. Gallen, Switzerland.\nSWISSLASTIC AG ST. GALLEN produces compression stockings under the reputable VENOSAN brand that are used for the prevention and treatment of venous disorders and phlebological indications. These high-quality products, which come in standard sizes and a made-to-measure option, are RAL certified and have been tested in accordance with Oeko-Tex Standard 100.\nSWISSLASTIC AG ST. GALLEN employs around 100 employees at the two sites in St. Gallen and Wald (Canton of Zürich).\nSalzmann AG St. Gallen's international holdings include the company's own production facilities and partner companies in Egypt, Brazil, China, Germany, Indonesia, Canada and the Philippines.\nLohmann & Rauscher Corporate Group\nLohmann & Rauscher (L&R) is a leading international supplier of high-quality medical devices and hygiene products ranging from conventional dressing material to modern treatment and nursing systems. Created in 1998 through the merger of Lohmann (founded in 1851) and Rauscher (founded in 1899), L&R has more than 160 years' expertise as a reliable solution provider for its customers.\nWith approx. 4,600 employees, 44 corporate subsidiaries and holdings and more than 130 select partners, the company is active in all of the world's key markets. It generated revenues in excess of €604,2 million in 2017. The L&R headquarters are located in Rengsdorf (Germany) and Vienna (Austria).\nL&R's corporate approach is reflected by the Group's claim of People.Health.Care.: people, their health and care for both.\nFurther information on Lohmann & Rauscher (L&R) can be found at:\nhttp://www.lohmann-rauscher.com\n- Cross reference: Pictures are available at AP Images ( http://www.apimages.com ) -\nReprint free of charge - specimen copy requested\nPress contact:\nLohmann & Rauscher International GmbH & Co. KG\nPublic Relations\nSabrina Klein\nJohann-Schorsch-Gasse 4 1140 Vienna\nTel.: +43-1-57670-386 Fax direct dial extension: 9386\nEmail: Sabrina.Klein@at.LRmed.com\nhttp://www.lohmann-rauscher.com\nSOURCE Lohmann & Rauscher", "external_links": [], "published": "2018-01-29T21:04:00.000+02:00", "crawled": "2018-01-29T20:43:06.006+02:00", "highlightTitle": ""}