{"organizations": [], "uuid": "7214dd9a3d0e8a105527e0fa365102c43fe80b13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-yellowfever-brazil/who-recommends-yellow-fever-shot-to-sao-paulo-visitors-idUSKBN1F52QN", "country": "US", "domain_rank": 408, "title": "WHO recommends yellow fever shot to Sao Paulo visitors", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T23:27:00.000+02:00", "replies_count": 0, "uuid": "7214dd9a3d0e8a105527e0fa365102c43fe80b13"}, "author": "", "url": "https://www.reuters.com/article/us-health-yellowfever-brazil/who-recommends-yellow-fever-shot-to-sao-paulo-visitors-idUSKBN1F52QN", "ord_in_thread": 0, "title": "WHO recommends yellow fever shot to Sao Paulo visitors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BRASILIA (Reuters) - The World Health Organization said on Tuesday that the whole of Sao Paulo state, which includes Brazil’s largest city, Sao Paulo, should be considered at risk for yellow fever and recommended foreign travelers get vaccinated before visiting.\nBut Brazil’s Health Ministry said the WHO recommendation, coming just weeks before Carnival when tens of thousands of tourists descend on Brazil, would not cause it to change its advisory that only travelers going to rural areas need to get vaccinated.\nDeputy Health Minister Antonio Carlos Nardi said Carnival celebrations in February were in urban areas and that visitors would not be at risk if they stayed in cities.\nNardi said the number of cases had risen again this year but that there was no outbreak of yellow fever in the country.\n“We are not at this time speaking of an outbreak but an increase in the number of cases in the states of Sao Paulo, Rio de Janeiro and Bahia,” Nardi told reporters.\nYellow fever is a viral disease transmitted by mosquitoes in tropical regions and is still a major killer in Africa. It had largely been brought under control in the Americas.\nThe first sign that the fever was back in Brazil was the death last year of hundreds of monkeys in the Atlantic rain forest in the states of Rio de Janeiro, Espirito Santo and Sao Paulo.\nThe WHO said 777 human cases of yellow fever had been reported in eight Brazilian states since December 2016 and that 261 people had died from the virus.\nNardi said Sao Paulo state would speed up and expand its vaccination campaign with the aim of vaccinating 8.3 million people in 54 cities in the state by mid-February.\nTo make vaccine stocks go further, recipients will be given half doses that are effective for eight years rather than a lifetime.\nReporting by Anthony Boadle; Editing by Peter Cooney\n ", "external_links": [], "published": "2018-01-16T23:27:00.000+02:00", "crawled": "2018-01-17T00:11:22.000+02:00", "highlightTitle": ""}