{"organizations": [], "uuid": "4e574d68175488c7abacf513acd83f312b8b984b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-liberty-health-sciences-announces-definitive-agreement-for-the-acquisition-of-a-387-acre-parcel-of-land-in-gainesville-florida.html", "country": "US", "domain_rank": 767, "title": "Liberty Health Sciences announces definitive agreement for the acquisition of a 387-acre parcel of land in Gainesville, Florida", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.09, "site_type": "news", "published": "2018-01-31T15:00:00.000+02:00", "replies_count": 0, "uuid": "4e574d68175488c7abacf513acd83f312b8b984b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-liberty-health-sciences-announces-definitive-agreement-for-the-acquisition-of-a-387-acre-parcel-of-land-in-gainesville-florida.html", "ord_in_thread": 0, "title": "Liberty Health Sciences announces definitive agreement for the acquisition of a 387-acre parcel of land in Gainesville, Florida", "locations": [], "entities": {"persons": [], "locations": [{"name": "gainesville", "sentiment": "none"}, {"name": "florida acquisition", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "liberty health sciences", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "cannabis canada ltd.", "sentiment": "none"}, {"name": "alico citrus nursery, llc", "sentiment": "none"}, {"name": "alico", "sentiment": "none"}, {"name": "liberty health sciences inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acquisition includes 200,000 square feet of greenhouse and processing facilities and a cash balance of up to $17.3 million\nTORONTO, Jan. 31, 2018 /PRNewswire/ - Liberty Health Sciences Inc. ( CSE: LHS ) ( OTCQX: LHSIF ) (\" Liberty \" or the \" Company \") announced today that it has entered into a definitive share purchase agreement (the \" Definitive Agreement \") with 242 Cannabis Canada Ltd. to acquire all of the issued and outstanding shares (the \" Purchased Shares \") of its wholly-owned subsidiary, 242 Cannabis, LLC, a Florida limited liability company, which includes a 387-acre parcel of land in Gainesville, Florida (the \" Property \") which was previously owned by Alico Citrus Nursery, LLC, a Florida limited liability company (\" Alico \").\nThe Property includes over 200,000 square feet of state-of-art greenhouses, head houses, tissue culture lab and processing facilities. Liberty plans to retrofit the facilities over the coming months to include a 16,000-square-foot processing area that will be used for extraction and refining of cannabis oils. It will be equipped to produce vaporizer products including preloaded disposable pens, cartridges and pods. Liberty will continue to offer other dosage forms such as capsules, oral solutions (tinctures) and topicals. In addition, the processing area will also have a commercial kitchen for the production of edibles and chewable dosage forms, once the state has defined and promulgated the necessary regulations to govern edible and chewable dosage forms.\nThe retrofitted facilities will enable the Company to expand production capacity a year sooner than projected, in order to meet the growing patient demand in Florida. Upon completion, Liberty will be one of the leading medical cannabis providers in the Florida market with an expected annual capacity of 12,000 kg of high quality, affordable, medical cannabis. Liberty's ability to cultivate at this new facility will be subject to the receipt of all required approvals and/or authorizations from the Florida Department of Health, Office of Medical Marijuana Use.\n\"With this acquisition we're accelerating our aggressive growth strategy to more quickly meet the increasing demand for high-quality medical cannabis in Florida,\" said George Scorsis, Director and CEO of Liberty. \"Bringing this additional capacity to the market sooner represents another important milestone in our unwavering commitment to serving Florida's patients in need.\"\nThe proposed acquisition will be completed through a series of transactions. 242 Cannabis, LLC previously entered into an asset purchase agreement with Alico to acquire the Property. The Company expects 242 Cannabis, LLC's purchase of the Property and the subsequent purchase by the Company of the Purchased Shares to close on or prior to February 9, 2018, and closing is subject to customary conditions, including confirmation of title, receipt of environmental assessments and surveys as well as the satisfaction of other customary conditions in accordance with the Definitive Agreement.\nAs consideration for the Purchased Shares, the Company will issue 18,815,322 units of the Company, with each unit being comprised of one common share of the Company issued at a common share price of $1.6476 and one-half common share purchase warrant, with each whole warrant exercisable into common shares of the Company at an exercise price of $2.07 per common share for a period of three years from the closing date of the acquisition. The Company has received conditional approval from the CSE for the issuance of such securities in respect of the transactions contemplated under the Definitive Agreement.\nAn integral part of the proposed acquisition of the Purchased Shares, the Company shall receive a cash balance of up to $17.3 million in 242 Cannabis, LLC. Approximately $3 million in cash will be held back under the Definitive Agreement as a purchase price adjustment, subject to the achievement of certain performance targets by the Company.\nThe Company also confirms the previously announced bought deal equity financing of units of the Company has been mutually terminated by the Company and the underwriters, Clarus Securities Inc. and AltaCorp. Capital Inc., in accordance with the terms of the Underwriting Agreement dated January 10, 2018.\nFor more information on Liberty please visit www.libertyhealthsciences.com\nAbout Liberty Health Sciences Inc.\nLiberty Health Sciences Inc. (\"Liberty\") is an investor and operator in the medical cannabis market, capitalizing on new and existing opportunities in U.S. states where medical cannabis is legal. Liberty's stringent investment criteria for expansion maximizes returns to shareholders, while focusing on significant near- and mid-term opportunities. Liberty has an extensive background in highly regulated industries, with expertise in becoming a low-cost producer. Liberty leverages commercial greenhouse knowledge to deliver high-quality, clean and safe pharmaceutical grade cannabis to patients.\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS: Certain information in this news release constitutes forward-looking statements under applicable securities laws. Any statements that are contained in this news release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements are often identified by terms such as \"may\", \"should\", \"anticipate\", \"expect\", \"believe\", \"plan\", \"intend\" or the negative of these terms and similar expressions. Forward-looking statements in this news release include, but are not limited to, expectations related to the Company's future expansion and growth strategies, the completion of 242 Cannabis, LLC's purchase of the Property and the subsequent purchase of the Purchased Shares by the Company, the Company's expectations in respect of the future growth of medical cannabis as a treatment option in Florida, the planned retrofitting and equipping of the facilities at the Property and the Company's expectations regarding market position. Forward-looking statements necessarily involve known and unknown risks, including, without limitation, risks associated with general economic conditions; adverse industry events; marketing costs; loss of markets; future legislative and regulatory developments involving medical marijuana; inability to access sufficient capital from internal and external sources, and/or inability to access sufficient capital on favourable terms; the medical marijuana industry in the United States generally, income tax and regulatory matters; the ability of Liberty to implement its business strategies; competition; crop failure; currency and interest rate fluctuations and other risks.\nReaders are cautioned that the foregoing list is not exhaustive. Readers are further cautioned not to place undue reliance on forward-looking statements as there can be no assurance that the plans, intentions or expectations upon which they are placed will occur. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement.\nSOURCE Liberty Health Sciences Inc.", "external_links": [], "published": "2018-01-31T15:00:00.000+02:00", "crawled": "2018-01-31T15:49:17.015+02:00", "highlightTitle": ""}