{"organizations": [], "uuid": "b00f69249246b555bf9ac96b5414b7be3d652693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2017/12/31/reuters-america-update-1-uk-may-use-taxes-to-get-tech-giants-to-do-more-to-fight-extremism-minister-says.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-UK may use taxes to get tech giants to do more to fight extremism, minister says", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-31T15:42:00.000+02:00", "replies_count": 0, "uuid": "b00f69249246b555bf9ac96b5414b7be3d652693"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2017/12/31/reuters-america-update-1-uk-may-use-taxes-to-get-tech-giants-to-do-more-to-fight-extremism-minister-says.html", "ord_in_thread": 0, "title": "UPDATE 1-UK may use taxes to get tech giants to do more to fight extremism, minister says", "locations": [], "entities": {"persons": [{"name": "ben wallace", "sentiment": "none"}, {"name": "wallace", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}, {"name": "sunday times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "minister says@\n* Minister accuses tech firms of \"inaction\" on extremism\n* Says UK could take tax measures unless they improve\n* Facebook says minister wrong, already taking action\n* Google's YouTube says doing more every day on issue (Adds comments from Facebook, YouTube)\nLONDON, Dec 31 (Reuters) - Britain may impose new taxes on tech giants like Google and Facebook unless they do more to combat online extremism by taking down material aimed at radicalising people or helping them to prepare attacks, the country's security minister said.\nBen Wallace accused tech firms of being happy to sell people's data but not to give it to the government which was being forced to spend vast sums on de-radicalisation programmes, surveillance and other counter-terrorism measures.\n\"If they continue to be less than co-operative, we should look at things like tax as a way of incentivising them or compen 3/8sating for their inaction,\" Wallace told the Sunday Times newspaper in an interview.\nHis quotes did not give further details on tax plans. The newspaper said that any demand would take the form of a windfall tax similar to that imposed on privatised utilities by former Prime Minister Tony Blair's government in 1997.\nWallace accused the tech giants of putting private profit before public safety.\n\"We should stop pretending that because they sit on beanbags in T-shirts they are not ruthless profiteers,\" he said. \"They will ruthlessly sell our details to loans and soft-porn companies but not give it to our democratically elected government.\"\nFacebook executive Simon Milner rejected the criticisms.\n\"Mr Wallace is wrong to say that we put profit before safety, especially in the fight against terrorism,\" he said in an emailed statement. \"We've invested millions of pounds in people and technology to identify and remove terrorist content.\"\nYouTube, which is owned by Google, said it was doing more every day to tackle violent extremism.\n\"Over the course of 2017 we have made significant progress through investing in machine learning technology, recruiting more reviewers, building partnerships with experts and collaboration with other companies,\" a YouTube spokeswoman said.\nDEADLY ATTACKS\nBritain suffered a series of attacks by Islamic extremists between March and June this year that killed a total of 36 people, excluding the attackers.\nTwo involved vehicles ramming people on bridges in London, followed by attackers stabbing people. The deadliest, a bombing at a concert in the northern city of Manchester, killed 22 people.\nFollowing the second bridge attack, Prime Minister Theresa May proposed beefing up regulations on cyberspace, and weeks later interior minister Amber Rudd travelled to California to ask Silicon Valley to step up efforts against extremism.\n\"We are more vulnerable than at any point in the last 100 years,\" said Wallace, citing extremist material on social media and encrypted messaging services like WhatsApp as tools that made life too easy for attackers.\n\"Because content is not being taken down as quickly as they could do, we're having to de-radicalise people who have been radicalised. That's costing millions. They can't get away with that and we should look at all the options, including tax.\"\nFacebook said it removed 83 percent of uploaded copies of terrorist content within one hour of its being found on the social media network.\nIt also highlighted plans to double the number of people working in its safety and security teams to 20,000 by the end of 2018.\nYouTube said that progress in machine learning meant that 83 percent of violent extremist content was removed without the need for users to flag it. (Reporting by Estelle Shirbon, editing by Larry King)", "external_links": [], "published": "2017-12-31T15:42:00.000+02:00", "crawled": "2018-01-01T08:01:08.045+02:00", "highlightTitle": ""}