{"organizations": [], "uuid": "5f0dff85db2eae341b9626a446ce0c85fc51198a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104971406-GettyImages-114250976.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/health-care-insurers-are-beefing-up-their-apps-to-make-you-like-them-more.html", "country": "US", "domain_rank": 767, "title": "Health-care insurers are beefing up their apps to make you like them more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-27T21:01:00.000+02:00", "replies_count": 0, "uuid": "5f0dff85db2eae341b9626a446ce0c85fc51198a"}, "author": "Bertha Coombs", "url": "https://www.cnbc.com/2018/01/26/health-care-insurers-are-beefing-up-their-apps-to-make-you-like-them-more.html", "ord_in_thread": 0, "title": "Health-care insurers are beefing up their apps to make you like them more", "locations": [], "entities": {"persons": [{"name": "emily michot", "sentiment": "none"}, {"name": "gurpreet singh", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "margate", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "miami herald", "sentiment": "none"}, {"name": "oscar health", "sentiment": "none"}, {"name": "northwest medical center", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}, {"name": "mct", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Health-care insurers are beefing up their apps to make you like them more The use of telemedicine appointments is rising as the flu season rages on. Oscar Health said nearly two-thirds of its customers use telemedicine services, ranging from doctor visits to phone consultations. Last year, less than half did. CNBC.com Emily Michot | Miami Herald | MCT | Getty Images A doctor demonstrates an app on an iPad to review medical tests of one of his patients at Northwest Medical Center in Margate, Florida. \nHouse calls from doctors may be a throwback idea, but this year health-care firms are making a hard push to engage patients more where they live: On their mobile phones. It's a matter of savings and building customer loyalty. \n\"Our health clients are now talking a lot about … [digital] technologies that can enable customer experience,\" said Gurpreet Singh, U.S. health services sector leader at consulting firm PwC, noting that more than half of health systems have beefed up investments in digital tools to communicate with patients on an ongoing basis. \n\"The more virtual touchpoints we create, the more engagement we get,\" said Mario Schlosser, CEO Oscar Health, the five-year-old health insurance start-up based in New York. \nThis year's flu epidemic is resulting in a surge of consumers turning to telemedicine appointments for doctor visits, but Oscar has been working on building virtual engagement with its members year round. \nLast year, the insurer engaged in virtual interactions with nearly two-thirds of its members, ranging from telemedicine visits and phone consultations, to scheduling visits with in-network doctors. That's up from less than half in 2016. \nThose virtual interactions have meant greater utilization, but Schlosser said it has also helped to drive down overall medical costs for conditions like asthma. \n\"The cost of care for an asthma episode without telemedicine is about $946,\" Schlosser explained. That's because it often involves more than one in-office visit. \"The cost of care for an asthma encounter all-in with telemedicine is only about $260, because we can make sure you don't end up in the wrong outlet of care like the ER.\" \nOscar is looking to ramp up its digital engagement even more this year, as it faces a surge in enrollment. The insurer has signed up 255,000 members in six states, a 150 percent increase over 2017, after expanding coverage on the Obamacare exchanges. \nFor hospitals, which are seeing greater competition from urgent care providers and retail clinics, virtual engagement is a priority not just to reduce costs but to keep patients engaged with their health system. \nKaiser Permanente, one of the nation's largest integrated hospital and health insurance systems, has seen digital patient interactions top in-office visits. Last year, Kaiser did more than 140,000 video visits and 8.4 million telephone visits with its members, which now number nearly 12 million. \n\"We're rapidly expanding our patient use of secure messaging and scheduled telephone visits and video visits,\" said Dr. Pat Conolly, Kaiser's executive vice president of information technology. \n\"What it does is support greater engagement between the patient and the doctor,\" she explained. \"Every opportunity to connect and reinforce recommendations or answer questions adds up to hopefully better adherence and hopefully better outcomes.\" \nAccording to PwC, this year nearly two-thirds of health systems will have an executive in charge of boosting patient experience. Many are also looking at how they use digital tools internally, as a way to retain staff and reduce turnover. \n\"We're seeing a number of our clients invest in 'how do I create a positive experience for the nurses' so they can spend time with patients,\" said Singh. \nAnalysts say the trend began long before the threat of new health care entrants like tech giant Amazon, which touts itself as \"building the earth's more customer-centric company.\" But when it comes to being more customer-friendly, health care firms have a long way to play catch up with consumer companies.", "external_links": [], "published": "2018-01-27T21:01:00.000+02:00", "crawled": "2018-01-27T21:01:26.001+02:00", "highlightTitle": ""}