{"organizations": [], "uuid": "14e1e6c28450cc6e1d7200dd86b24a97fbce0a59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/03/17/102511893-462837194.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/nintendo-shares-up-200-percent-since-pokemon-go-launch.html", "country": "US", "domain_rank": 767, "title": "Why Nintendo shares are up 200% since the launch of 'Pokemon Go'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-04T14:48:00.000+02:00", "replies_count": 0, "uuid": "14e1e6c28450cc6e1d7200dd86b24a97fbce0a59"}, "author": "Arjun Kharpal", "url": "https://www.cnbc.com/2018/01/04/nintendo-shares-up-200-percent-since-pokemon-go-launch.html", "ord_in_thread": 0, "title": "Why Nintendo shares are up 200% since the launch of 'Pokemon Go'", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "niantic", "sentiment": "none"}], "organizations": [{"name": "nintendo", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}, {"name": "pokemon company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nintendo's stock is on a Super Mario run. \n\nShares of the Japanese gaming giant closed 4.9 percent on Thursday after the Financial Times reported that \"Pokemon Go,\" the game that went viral in 2016, could finally be launching in China.\nSince the launch of \"Pokemon Go\" in July 2016, Nintendo stock is up 200 percent.\nBut that is not just down to the mobile game.\nThe 'Pokemon Go' effect In 2015, Nintendo was struggling. The company was losing users to smartphone games. This prompted management to announce that it was launching some mobile offerings. This was realized with \"Pokemon Go,\" and then with later games such as \"Super Mario Run\" and \"Fire Emblem Heroes.\"\nIn the six months to September 30, Nintendo's last official earnings announcements, mobile games raked in 17.9 billion yen ($117.2 million), a 426 percent year-on-year increase. \nBut Nintendo owns just a small stake in The Pokemon Company, which licenses its intellectual property to game developer Niantic. So the overall contribution of \"Pokemon Go\" to Nintendo's earnings is limited. However, it played an important role in 2016 to bring interest back to the Japanese gaming brand.\n\"Pokemon Go had a halo impact on existing Nintendo hardware and software and led to an increase in 3DS sales and related Pokemon games,\" Piers Harding-Rolls, head of games research at IHS, told CNBC by email.\n\"It certainly helped re-position the brand in the run up to the launch of the Switch along with the announcement of first-party games coming to smartphones and tablets.\"\nNintendo Switch gives boost When the Nintendo Switch was launched last year , there were some skeptical analysts . The console is unusual in that it is a hybrid, allowing users to play on their TV, then pick up the tablet-like device and continue playing the game from where they left off, on the go.\nBut the company announced in mid-December that it had sold more than 10 million Switch units since the March 2017 launch. In October, it upped its forecast for Switch sales saying it expects to sell 14 million units by the end of March 2018. \nAkio Kon | Bloomberg | Getty Images A statue of Nintendo's video-game character Mario \"The successful launch of the Switch is down to a flexible form factor making it attractive to a cross-section of regional consumers and a very strong slate of first-party titles, which have resonated strongly with its target audience,\" Harding-Rolls said.\nFirst-party titles refer to games that Nintendo has produced, such as \"The Legend of Zelda: Breath of the Wild\" and \"Mario Kart 8 Deluxe,\" the two top-selling games on the Switch.\nWhat next? Keeping up the momentum will be key for Nintendo, according to analysts. With the initial hype around the Switch potentially dying down, Nintendo will need to get other people beyond the core user, to buy the console.\nThis will mean signing third-party developers to make games. Many are already on there, such as Electronic Arts, which makes the popular \"FIFA\" soccer game franchise. But mobile, which is still a small part of the business, will be crucial.\n\"With monetization of Nintendo's mobile games a little hit and miss, I believe it needs to build out a portfolio of games to generate a significant amount of revenue from this part of the market,\" Harding-Rolls said.", "external_links": [], "published": "2018-01-04T14:48:00.000+02:00", "crawled": "2018-01-04T14:55:30.003+02:00", "highlightTitle": ""}