{"organizations": [], "uuid": "c266afdc9c6677342ccd44031a180b2016fe2667", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/17/104850328-RTS1K4LE-trump.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/us-stocks-had-a-good-first-year-under-trump-but-overseas-markets-did-better.html", "country": "US", "domain_rank": 767, "title": "US stocks had a good first year under Trump, but overseas markets did better", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.129, "site_type": "news", "published": "2018-01-22T21:02:00.000+02:00", "replies_count": 0, "uuid": "c266afdc9c6677342ccd44031a180b2016fe2667"}, "author": "Thomas Franck", "url": "https://www.cnbc.com/2018/01/22/us-stocks-had-a-good-first-year-under-trump-but-overseas-markets-did-better.html", "ord_in_thread": 0, "title": "US stocks had a good first year under Trump, but overseas markets did better", "locations": [], "entities": {"persons": [{"name": "joshua roberts", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "david kelly", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "s&p", "sentiment": "negative"}, {"name": "reuters donald trump", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "dow jones", "sentiment": "none"}, {"name": "j.p. morgan funds", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "US stocks had a good first year under Trump, but overseas markets did better The S&P 500 climbed 24 percent since President Trump's inauguration, underperforming both international and emerging markets. U.S. stocks not only lagged equities in developed countries, but they also fell short when compared to Mexican and Indian equities. \"2017 was a good year for the economies and a great year for stocks,\" David Kelly, chief global strategist at J.P. Morgan Funds, told CNBC. Joshua Roberts | Reuters Donald Trump \nPresident Donald Trump loves to take credit for the rally in U.S. stocks since his inauguration, but in a global context, it isn't as impressive as it seems. \nThe executive's philosophy of \"America First\" is largely based on the conviction that the United States needs to protect itself both economically and politically. Despite the tough talk, domestic markets and stocks have actually underperformed many international markets in the past year. \nTo Trump's credit, the 31 percent gain in the Dow Jones industrial average in his first year is the best rise since Roosevelt . The broader S&P 500, the more accepted benchmark for U.S. stocks, however, rose just 24 percent. \nThe index not only lagged other developed countries like Germany and France, but also fell short when compared to emerging countries like Mexico, India and South Korea. The iShares MSCI China ETF led the charge with a 58 percent gain since Jan. 20, 2017 while the South Korea MSCI ETF surged nearly 40 percent over the same time. \nMeanwhile the iShares MSCI Mexico ETF clinched a 26 percent gain and India rocketed 35 percent higher . Developed countries Germany and France rose 30 percent and 33 percent respectively. \nOne Wall Street veteran explained that currencies were a driver of the global rally. \n\"2017 was a good year for the economies and a great year for stocks,\" David Kelly, chief global strategist at J.P. Morgan Funds, told CNBC. \"Part of that was because the U.S. dollar came down a bit – 10 percent – it's been a very good year for international stocks as well.\" \nThe dollar index fell roughly 10 percent last year, traditionally a boon for commodities and emerging markets since commodities prices worldwide are often denominated in the dollar. \nBreaking from longstanding presidential tradition, President Trump stunned currency analysts around the world when he declared the dollar too strong just days before his inauguration. The comment from the president-elect likely stemmed from his goal of bolstering U.S. exporting; a weak dollar makes U.S. goods comparatively cheaper. \nSuch a protective position tends to benefit the materials and industrials industries , often seen as siloed sectors in an increasingly service-oriented economy. \nUS Dollar Index vs. iShares MSCI EM ETF \nSource: FactSet \nMeanwhile, the strategist also said that dovish monetary policies from global central banks contributed to a rally in developed countries. \nCentral banks worldwide have long maintained easing measures as countries rebounded from the 2008 financial crisis and resulting recession. The European Central Bank (ECB), the Federal Reserve and the Bank of Japan all flushed global economies with cash, lowering interest rates on borrowing and aggressively purchasing national debt. \n\"Central banks have been slowly reacting to a much better economy,\" Kelly added, referring more hawkish views at the Federal Reserve and its peer banks. \"The ECB wants to make sure they don't push up the euro against the dollar.\" \nBut Kelly isn't alone in his view. Renowned activist hedge fund manager Dan Loeb told CNBC last year that his success was largely thanks to accommodative global monetary policy. \n\"What has transpired has been global synchronized economic growth and a very accommodative global monetary structure,\" Loeb said, explaining the strength of the market in August. \nStrong showings in global PMIs point to additional upside in manufacturing. The euro zone economy closed out 2017 with its strongest growth in seven years largely thanks to scaling services and manufacturing across all major economies. \nBut the global outperformance may not last as their central banks move to take the easy money away. \nAll of the major central banks have recently signaled that they would either begin quantitative tightening or curb easing policy as global economies find their feet. Such a shift in policy will likely boost interest rates, discouraging borrowing and potentially tempting investors into debt and away from stocks.", "external_links": [], "published": "2018-01-22T21:02:00.000+02:00", "crawled": "2018-01-22T21:02:36.006+02:00", "highlightTitle": ""}