{"organizations": [], "uuid": "d835aeaf1a6dd5f28573dcddc264bc7461a35af0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226684782&w=1200&r=LYNXMPEE0T1DO", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-russia-sanctions-trump/experts-question-trump-decision-to-hold-off-on-russian-sanctions-idUSKBN1FJ2N5", "country": "US", "domain_rank": 408, "title": "Experts question Trump decision to hold off on Russian sanctions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T20:43:00.000+02:00", "replies_count": 0, "uuid": "d835aeaf1a6dd5f28573dcddc264bc7461a35af0"}, "author": "", "url": "https://www.reuters.com/article/us-usa-russia-sanctions-trump/experts-question-trump-decision-to-hold-off-on-russian-sanctions-idUSKBN1FJ2N5", "ord_in_thread": 0, "title": "Experts question Trump decision to hold off on Russian sanctions", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "warren strobel", "sentiment": "none"}, {"name": "pete schroeder", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate banking committee", "sentiment": "none"}, {"name": "forbes", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kremlin", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 6:44 PM / Updated an hour ago Experts question Trump decision to hold off on Russian sanctions Warren Strobel , Pete Schroeder 4 Min Read \nWASHINGTON (Reuters) - U.S. President Donald Trump’s decision not to impose sanctions on Russia for now, under a law overwhelmingly passed by Congress, represents a missed opportunity to deter the Kremlin’s aggressive behavior, former U.S. officials and Russia specialists said on Tuesday. \nThe Trump administration late on Monday said it would not immediately impose sanctions under the law, designed to punish Moscow for meddling in the 2016 presidential election. Russia denies doing so. \nThe administration also published a list of Russian oligarchs who could be sanctioned, as required by the law. \nThe list was dismissed in Moscow as little more than a “telephone directory” of the rich. U.S. and Russian observers said it appeared to be a virtual copy of Forbes magazine’s list of Russia’s wealthiest people. \nTreasury Secretary Steven Mnuchin told the Senate Banking Committee on Tuesday that the administration could still impose sanctions. \n“This should in no way be interpreted as we’re not putting sanctions on any of the people in that report,” Mnuchin told the Senate Banking Committee, referring to the list of oligarchs. \nUnder the law, the administration faced a Monday deadline to impose sanctions on anyone who was determined to have conducted significant business with Russian defense and intelligence sectors. Those sectors already have been sanctioned for their alleged role in the U.S. presidential election. U.S. President Donald Trump delivers remarks before a luncheon for ambassadors to the United Nations Security Council at the White House in Washington, U.S. January 29, 2018. REUTERS/Jonathan Ernst \n“I think the administration missed an opportunity to extend the use of sanctions” to deter Russia, said retired ambassador Daniel Fried, formerly the State Department’s top sanctions official. \nThe report on Russian oligarchs “seemed to be assembled in haste, and seemed to be close to a cut-and-paste job,” said Fried, now at the Atlantic Council think tank. \nTrump criticized the sanctions law, which Congress passed last year with enough backing to override any presidential veto, and has seemed unenthusiastic about implementing it. \nIn a statement late on Monday, State Department spokeswoman Heather Nauert said the law by itself was deterring Russian defense sales. \n“Since the enactment of the ... legislation, we estimate that foreign governments have abandoned planned or announced purchases of several billion dollars in Russian defense acquisitions,” she said. Related Coverage Democrats blast Trump as soft on Putin with no Russia sanctions \nWhile that explanation is “not preposterous,” said Lawrence Freedman, emeritus professor at King’s College London, “the main concern is clearly not wanting to upset Russia more.” \nRepublican Senator Bob Corker, chairman of the Senate Foreign Relations Committee, said he was heartened by a classified briefing that the State Department gave on Monday to the committee’s staff. \n“I am encouraged by the diplomatic steps Secretary (of State Rex) Tillerson has taken in recent months to compel other governments to comply with CAATSA,” Corker said, using an acronym for the Countering America’s Adversaries Through Sanctions Act. “On the whole, it is clear the administration is working in good faith.” Additional reporting by Patricia Zengerle, Jonathan Landay and Mark Hosenball; Editing by Bernadette Baum", "external_links": [], "published": "2018-01-30T20:43:00.000+02:00", "crawled": "2018-01-30T20:58:24.006+02:00", "highlightTitle": ""}