{"organizations": [], "uuid": "624ba6bc2604e5ab6a1867cf732b390d2b2ae393", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-watermill-completes-sale-of-cm-corporation.html", "country": "US", "domain_rank": 767, "title": "Watermill Completes Sale of C&M Corporation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "624ba6bc2604e5ab6a1867cf732b390d2b2ae393"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-watermill-completes-sale-of-cm-corporation.html", "ord_in_thread": 0, "title": "Watermill Completes Sale of C&M Corporation", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "lexington", "sentiment": "none"}], "organizations": [{"name": "c&m corporation", "sentiment": "negative"}, {"name": "c&m corporation news", "sentiment": "negative"}, {"name": "watermill group", "sentiment": "none"}, {"name": "c&m", "sentiment": "none"}, {"name": "snow phipps group", "sentiment": "none"}, {"name": "winchester interconnect corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Summary\nFollowing a strategic transformation over the past nine years, C&M Corporation is now a leading designer and manufacturer of wire & cable, coil cords and cable assembly solutions, serving customers in the medical device, industrial automation and military markets The exit represents a strong return for the Watermill Group and its investors A refreshed business strategy, facility improvements and key management hires under the Watermill Group’s ownership created a strong foundation for continued growth\nLEXINGTON, Mass.--(BUSINESS WIRE)-- The Watermill Group , LLC (the “Watermill Group”), a strategy-driven private investment firm, today announced the sale of C&M Corporation to Winchester Interconnect Corporation (“Winchester”), a portfolio company of Snow Phipps Group (“Snow Phipps”), a private equity firm focused on middle-market control investments. The transaction took place on December 22, 2017. C&M is a leading designer and manufacturer of wire & cable and coil cords for performance-critical applications. The company serves blue-chip customers across a variety of growing markets including industrial automation, medical and military. Based in Norwalk, Connecticut, Winchester is a designer and manufacturer of connectivity solutions, including both connectors and cable assemblies, for diversified end markets including medical, military, aerospace and semiconductor.\nC&M has transformed its business over the past nine years, following its acquisition by the Watermill Group in 2008. Management focused on establishing a scalable platform for growth and shifting its sales focus to high-growth industrial market segments, creating a strong customer pipeline that continues to expand today. In addition, C&M upgraded its facility, equipment and capabilities, including completing a major facility move and retrofit process. A new management team has also taken the helm to ensure engineering leadership, along with the delivery of high-performance products and exceptional customer service.\n“The C&M of today is quite different from the firm we originally acquired, and we have been proud partners through their strategic journey,” stated Timothy Eburne, Partner, the Watermill Group. “As a result of Watermill’s strategy development and implementation process, C&M evolved from a family owned job shop in an aging facility serving increasingly commoditized end markets into a professional, tightly run operation in a modern facility with a unique position in custom wire and cable. Their transformation is evidence that the application of strategic vision combined with hands on operational support can create lasting impact for businesses and employees.”\nWatermill and C&M were represented by M&A Advisor Sperry, Mitchell & Co and legal advisor K&L Gates LLP.\nAbout the Watermill Group\nThe Watermill Group is a strategy-driven private investment firm that helps companies achieve their full potential through strategic transformation. For more than three decades, the Watermill Group has been acquiring, operating and improving companies. The Watermill Group looks for businesses in which it can apply a unique combination of strategic insight and management expertise to re-imagine their future and drive growth.\nAbout C&M Corporation\nC&M Corporation has over 50 years of experience designing and manufacturing wire and cable, coil cords, and cable assembly solutions for mission and performance critical applications which simply cannot fail. In its role as a vertically integrated provider, the company’s seasoned engineering team collaborates with customers to understand their vision and needs and helps them overcome even the most complex design challenges. Ultimately C&M identifies the optimal path for transforming concepts into superior quality and delivery solutions with the end goal of getting products to market as quickly as possible.\n //www.businesswire.com/news/home/20180103005383/en/\nCXO Communication for Watermill\nSandy George, 617-413-6126\nsandy@cxocommunication.com\nSource: Watermill Group, LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.watermill.com%2F&esheet=51736927&newsitemid=20180103005383&lan=en-US&anchor=Watermill+Group&index=1&md5=84d09da4d005e6f3727d7bbcd7ecc369", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cmcorporation.com&esheet=51736927&newsitemid=20180103005383&lan=en-US&anchor=C%26M+Corporation&index=3&md5=6b9302b1fca7bfd8be65aa3135c98a80", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.watermill.com%2F&esheet=51736927&newsitemid=20180103005383&lan=en-US&anchor=Watermill+Group&index=2&md5=b2761fe48a53c3f6d2b53b19e584a127", "http://www.businesswire.com/news/home/20180103005383/en/"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T16:49:38.007+02:00", "highlightTitle": ""}