{"organizations": [], "uuid": "824de0c553d340ff095831db178bed5050e0866d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223944349&w=1200&r=LYNXMPEE0K0UB", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-sno-white/snowboarding-white-sees-himself-as-favourite-in-pyeongchang-idUKKBN1FA140", "country": "US", "domain_rank": 408, "title": "Snowboarding - White sees himself as favourite in Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T21:53:00.000+02:00", "replies_count": 0, "uuid": "824de0c553d340ff095831db178bed5050e0866d"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-sno-white/snowboarding-white-sees-himself-as-favourite-in-pyeongchang-idUKKBN1FA140", "ord_in_thread": 0, "title": "Snowboarding - White sees himself as favourite in Pyeongchang", "locations": [], "entities": {"persons": [{"name": "white", "sentiment": "negative"}, {"name": "rory carroll", "sentiment": "negative"}, {"name": "shaun white", "sentiment": "none"}], "locations": [{"name": "pyeongchang", "sentiment": "none"}, {"name": "turin", "sentiment": "none"}, {"name": "ntain", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "calif", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 7:56 PM / Updated an hour ago Snowboarding - White sees himself as favourite in Pyeongchang Rory Carroll 3 Min Read \nMAMMOTH MOUNTAIN, Calif (Reuters) - After recovering from a training crash which left him needing 62 stitches, American snowboarder Shaun White is backing himself to win the halfpipe gold in Pyeongchang next month even though he will be facing off against rivals who grew up idolising him. \nWhite, 31, burst onto the scene at the 2006 Turin Games where he won the first of his two Olympic golds, becoming the face of the sport globally. \nBut he faltered in Sochi in 2014, finishing a disappointing fourth in halfpipe, and last October he needed more than five dozen stitches after crashing in training. \nThose missteps, along with some recent flashes of dominance, have made it difficult to rate his chances going into the Games in South Korea. \n“I would love to feel like an underdog but I just don‘t,” White told a press conference at the U.S. Grand Prix in Mammoth. \n“Ever since I can remember I’ve been expected to do well not only from the media and fans but even more so from myself. So I‘m going in to hopefully do my best.” \nAmong those primed for a breakthrough in Pyeongchang are 23-year-old Australian Scotty James, who won a gold medal in Aspen at the 2017 Winter X Games, and 23-year-old Ben Ferguson, who qualified for the U.S. Olympic team before White. \nWhite, however, has reason for optimism after scoring a perfect 100 to win at the U.S. Grand Prix in Snowmass, Colorado last weekend to punch his ticket to Pyeongchang, a run he considers a career highlight. \n“Getting that 100 was just awesome. I felt like I was on the right track and all this hard work I put in over the holidays was paying off,” he said. \n“It started out as a rough competition and toward the end I looked at the coaches at the top and they said, ‘Just do the hard stuff, that’s what you have been working on the most’.” \nHeading into his fourth and possibly last Olympics, the San Diego native has the advantage of experience over the field. \nBut reflecting on his career, he said his devotion to the sport has not come without its sacrifices. \n“You get to these goals in life and it’s not always what it seems. There’s two sides of the coin in everything,” he said. \n“You can be the Olympic champion but you sacrifice things along the way.” \n“Sitting here today I am a happier person and more comfortable with who I am and what I’ve accomplished and what I intend to accomplish than ever before.” Reporting by Rory Carroll, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-21T21:53:00.000+02:00", "crawled": "2018-01-21T22:09:34.019+02:00", "highlightTitle": ""}