{"organizations": [], "uuid": "742c402d6e3372ed35e9a5ab13e5394fe3970ef7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-latam-rights-landrights/u-n-lambasts-latin-america-for-abusing-indigenous-rights-idUSKBN1F02J6", "country": "US", "domain_rank": 408, "title": "U.N. lambasts Latin America for abusing indigenous rights", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.074, "site_type": "news", "published": "2018-01-12T02:23:00.000+02:00", "replies_count": 0, "uuid": "742c402d6e3372ed35e9a5ab13e5394fe3970ef7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-latam-rights-landrights/u-n-lambasts-latin-america-for-abusing-indigenous-rights-idUSKBN1F02J6", "ord_in_thread": 0, "title": "U.N. lambasts Latin America for abusing indigenous rights", "locations": [], "entities": {"persons": [{"name": "victoria tauli-corpuz", "sentiment": "none"}, {"name": "tauli-corpuz", "sentiment": "none"}], "locations": [{"name": "bogota", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "guatemala", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOGOTA (Thomson Reuters Foundation) - Latin America is trampling on indigenous rights and jailing ever more campaigners to stifle opposition to big business taking over ancestral lands, according to a United Nations expert.\nVictoria Tauli-Corpuz, the U.N. Special Rapporteur on the Rights of Indigenous Peoples, said activists campaigning to protect their land from mining, logging, dams and other development projects were increasingly being criminalized.\n“Criminalization is really about using the justice system to stop indigenous peoples from pursing their own activities and their own actions against projects that are destructive to them,” Tauli-Corpuz told the Thomson Reuters Foundation.\nShe said the problem was “very prevalent” in Latin America and one that for her would be a priority this year, including an official visit to Guatemala in coming months.\nCriminal charges against activists include trespassing, economic sabotage and terrorism, Tauli-Corpuz said.\n“Increasing numbers of indigenous people are put in jail on the basis of those charges, so it’s really a serious concern,” she said. “It’s discrimination. It’s total injustice.”\nTERRORISM? She cited the case of Chile’s indigenous Mapuche people involved in a long-running and often violent struggle with the government to reclaim their lands in the country’s south.\nTauli-Corpuz urged the Chilean government to stop using the country’s anti-terrorism law to prosecute the Mapuche people.\nThe law, established during Chile’s 1973-1990 military dictatorship, allows state prosecutors to define as terrorism a variety of acts - including arson, destroying private property and clashing with police - and bring harsh sentences.\nAcross Latin America, she said, violent conflicts between indigenous groups, companies and the government often ensued when there is a lack of prior consultation and consent.\nTauli-Corpuz said she would focus strongly in 2018 on ensuring at-risk indigenous activists were better protected.\nGovernments in the region and the Inter-American Commission on Human Rights (IACHR) can grant precautionary measures against rights defenders whose lives are deemed to be a risk.\n“I will also invite governments to discuss with them what are the kinds of precautionary measures that are being done, how effective are these,” Tauli-Corpuz said.\nThe IACHR, which monitors human rights across the Americas, has granted dozens of precautionary measures in recent years, requiring governments to protect activists in the firing line.\nProtection can include the government providing activists with bodyguards, bullet-proof vests and mobile phones.\nThe most recent measure was granted in September to protect Peru’s “Tres Islas” community, which is campaigning against a mining project they say is harming their health, soil and water.\nDespite such measures, activists end up dead, she said.\nShe gave the example of Berta Caceres, a Honduran activist who was shot dead in 2016 despite having won IACHR protection.\n“Precautionary measures are put in place but it doesn’t automatically protect people,” Tauli-Corpuz said.\nIndigenous land defenders and environmentalists across Latin America, in particular Honduras, Mexico, Brazil and Colombia, are worst hit by violence.\nAccording to the human rights watchdog Global Witness, indigenous people accounted for 40 percent of the 185 activists killed in 2015 across 16 countries.\nReporting by Anastasia Moloney @anastasiabogota, Editing by Lyndsay Griffiths. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T02:23:00.000+02:00", "crawled": "2018-01-12T18:38:00.000+02:00", "highlightTitle": ""}