{"organizations": [], "uuid": "b5b995bb150c3f95687df3fa0b39d2059a88e8b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180114.html", "section_title": "Archive News &amp; Video for Sunday, 14 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-britain-women/britain-to-scrutinize-sexual-harassment-of-women-in-public-places-idUSKBN1F400V", "country": "US", "domain_rank": 408, "title": "Britain to scrutinize sexual harassment of women in public places", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T08:18:00.000+02:00", "replies_count": 0, "uuid": "b5b995bb150c3f95687df3fa0b39d2059a88e8b8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-women/britain-to-scrutinize-sexual-harassment-of-women-in-public-places-idUSKBN1F400V", "ord_in_thread": 0, "title": "Britain to scrutinize sexual harassment of women in public places", "locations": [], "entities": {"persons": [{"name": "maria miller", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "neutral"}, {"name": "equalities committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - A committee of British lawmakers will launch an inquiry on Monday into the sexual harassment of women and girls in public places such as streets, public transport, shops, bars and clubs.\nThe cross-party Women and Equalities Committee will examine what more can be done to combat unwanted sexual attention in public spaces other than the workplace, it said.\n“We are putting a spotlight on a problem that seems to be so routine in women’s lives, and yet has received very little attention in public policy,” said Maria Miller, committee chair, in a statement.\n“We want to find out why it happens, what the government is doing to root it out, and what more can be done.”\nA 2016 national survey published by YouGov found that 85 percent of women aged 18 to 24 had experienced unwanted sexual attention in public places while 45 percent had experienced unwanted sexual touching.\nThe inquiry follows the emergence of widespread allegations in Britain, the United States and globally about sexual assault and harassment.\nBritain’s parliament was among the institutions to become embroiled in a sex scandal after abuse allegations against Hollywood producer Harvey Weinstein prompted thousands of women and men to share stories about improper behavior.\nBritish Prime Minister Theresa May and other party leaders have agreed to introduce new safeguards for those working in parliament to try to contain a growing sexual harassment scandal there.\nThe committee said it would not be scrutinizing Westminster, as a separate parliamentary group was looking into those issues.\nThe committee will receive written evidence and later take oral submissions before compiling a report, likely in the summer.\nThe inquiry comes at the start of a year when Britain will mark 100 years since some women were granted the right to vote.\nIt wasn’t until 1928 that all women gained the same voting rights as men.\nReporting by Adela Suliman; editing by Ros Russell. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T08:18:00.000+02:00", "crawled": "2018-01-15T16:52:29.031+02:00", "highlightTitle": ""}