{"organizations": [], "uuid": "c87b7497fa748fec1241544b581f221d2ceb9192", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928880-RTX439ID.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/californias-new-weed-law-will-ignite-jobs-growth-commentary.html", "country": "US", "domain_rank": 767, "title": "Why Jeff Sessions' war on weed won't kill the industry-commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-05T15:19:00.000+02:00", "replies_count": 0, "uuid": "c87b7497fa748fec1241544b581f221d2ceb9192"}, "author": "Debra Borchardt", "url": "https://www.cnbc.com/2018/01/05/californias-new-weed-law-will-ignite-jobs-growth-commentary.html", "ord_in_thread": 0, "title": "Why Jeff Sessions' war on weed won't kill the industry-commentary", "locations": [], "entities": {"persons": [{"name": "jeff sessions", "sentiment": "none"}, {"name": "debra borchardt", "sentiment": "none"}, {"name": "lucy nicholson", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "west hollywood", "sentiment": "none"}, {"name": "california u.s.", "sentiment": "none"}], "organizations": [{"name": "justice department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Just two days after California began sales of legalized adult-use cannabis, Attorney General Jeff Sessions decided to rescind the Justice Department's Cole Memorandum.\nThis Obama-era document listed guidelines for states that legalized marijuana. Sessions decision, however is more bark than bite because it doesn't change the Rohrabacher-Blumenauer amendment which cut off funds to the Justice Department to enforce laws that say marijuana is federally illegal.\nIt also looks like Sessions will leave it up to state attorneys to choose whether they want to crack down or not.\nThis will be welcome news for the state of California that began legal sales on January 1 of adult-use cannabis. Its state attorney general, Xavier Becerra, defends his state's law, with good reason. Legal marijuana is a major jobs creator and tax generator.\nThe recently released Green Market Report predicts that legalization is going to create 160,000 new jobs. New government jobs, new retail jobs, new manufacturing jobs. Many of these jobs will pay well and that will be the best part of this green rush for the state of California. This is something that Sessions should be taking seriously when he considers curtailing legal weed.\nAs of November 2017, California had a record low 4.6 percent unemploymen t rate. Still, compare this to Colorado's unemployment rate of 2.9 percent.\nIn 2012 Colorado suffered from a whopping 8 percent unemployment rate . That was before legalization. Colorado has since reaped the job benefits of the marijuana industry. Its biggest problem now is managing the massive growth of Denver.\nLegalization brought high achieving scientists, chemists, retailers, horticulturalists and tech entrepreneurs to the state ready to solve the industries challenges. This should happen in California as well.\nWhile people outside California see the riches of Beverly Hills, the country's most expensive zip code in Santa Monica, and the outrageous housing costs of San Francisco, many towns in the state have never recovered from the 2008 financial crisis.\nThere is a great deal of attention paid to the outsize salaries of Silicon Valley workers, but real Californians know that when you venture outside these specific areas the economy declines dramatically.\nIn some areas, housing prices remained stagnant and employment fell by 15 percent. These depressed desert towns are welcoming the large cannabis cultivation facilities that cities like Los Angeles have no desire for.\nDesert Hot Springs declared a fiscal emergency in 2014. The median income was $33,000 in 2015 . It was one of the first cities to embrace legalizing marijuana cultivation. Land prices have now tripled in value.\nNot to be outdone, nearby Adelanto has issued 27 licensed permits for cultivation. Two years ago, this town also faced a fiscal emergency. It now boasts one million square feet of warehouse space ready to be used for marijuana.\nWeed jobs are also a boon to workers that other industries overlook. Older women, people with multiple visible tattoos and people that don't fit into the traditional corporate cubicle are welcome in the weed industry. Someone with a neck tattoo might not be the best choice for a bank job, but this industry doesn't bat an eye at neck ink or ear gauges.\nICF International published a white paper last year saying they believe that these jobs would result in $3.57 billion to $4.52 billion in labor income. The ripple effect of all these new salaries is felt throughout the local economies. Then there are the secondary jobs – from security to construction jobs to build grow facilities and create new dispensaries that meet new local laws.\nCalifornia's current budget deficit is $1.6 billion. The state is projected by ICF to earn between $2.4 billion and $3 billion a year in tax receipts from sales of marijuana. This will essentially wipe out the state's deficit in one year.\nNot only will marijuana reset the state's financial health, it will foster a new wave of entrepreneurs and jobs that will revitalize depressed parts of the state. So, all those people lining up to buy Pineapple Express are creating a whole new industry for the state that will revitalize employment and the economy. Let Sessions put that in his pipe and smoke it.\nCommentary by Debra Borchardt, co-founder, CEO and editor-in-chief at the Green Market Report, which focuses on the financial news of the rapidly growing cannabis industry. Follow her on Twitter @ WallandBroad .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-05T15:19:00.000+02:00", "crawled": "2018-01-05T16:14:46.034+02:00", "highlightTitle": ""}