{"organizations": [], "uuid": "8c810eec44184b415aee78aeddc977d6efb547f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222400947&w=1200&r=LYNXMPEE0F0OZ", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/india-reliance-refinery/reliance-declares-30-percent-higher-refinery-capacity-at-export-plant-document-idINKBN1F518P", "country": "US", "domain_rank": 408, "title": "Reliance declares 30 percent higher refinery capacity at export plant: document", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:34:00.000+02:00", "replies_count": 0, "uuid": "8c810eec44184b415aee78aeddc977d6efb547f2"}, "author": "", "url": "https://in.reuters.com/article/india-reliance-refinery/reliance-declares-30-percent-higher-refinery-capacity-at-export-plant-document-idINKBN1F518P", "ord_in_thread": 0, "title": "Reliance declares 30 percent higher refinery capacity at export plant: document", "locations": [], "entities": {"persons": [{"name": "nidhi verma", "sentiment": "none"}], "locations": [{"name": "jamnagar", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reliance", "sentiment": "negative"}, {"name": "petroleum planning & analysis cell", "sentiment": "none"}, {"name": "ppac", "sentiment": "none"}, {"name": "reliance industries", "sentiment": "none"}, {"name": "reliance industries limited", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 11:38 AM / Updated 8 hours ago Reliance declares 30 percent higher refinery capacity at export plant: document Nidhi Verma 3 Min Read \nNEW DELHI (Reuters) - India’s Reliance Industries has declared a 30 percent increase in the installed capacity of its export-focused oil refinery, a government report showed, increasing the size of the world’s largest refinery complex. Labourers rest in front of an advertisement of Reliance Industries Limited at a construction site in Mumbai, India, March 2, 2016. REUTERS/Shailesh Andrade/File Photo \nIndia’s Petroleum Planning & Analysis Cell (PPAC) in its October report showed 35.2 million tonnes a year as the installed capacity of Reliance’s refinery in the special economic zone (SEZ) at Jamnagar, in northwest India. That is up from 27 million tonnes, or 540,000 barrels per day (bpd), as of April 1 that PPAC reported in an August 2017 report. \nThe new capacity is the equivalent of 704,000 bpd of crude processing. \nReliance built its first refinery at Jamnagar with an installed capacity of 660,000 bpd in 1999. This refinery sells most of its fuels in the local market. The SEZ plant was added in 2008 and turned the entire Jamnagar complex into the world’s largest oil processing site. \nTwo sources familiar with the matter confirmed that Reliance has declared the increased SEZ capacity, which they said the company attributed to debottlenecking, or a by streamlining the processes at the plant. \n“They have declared enhanced capacity,” said one of the sources by telephone, without providing details on how the company raised the capacity. \nReliance has been consistently operating its export-oriented refinery at a rate higher than the nameplate capacity \nReliance had no immediate comment on the increase when contacted by Reuters. \nAlthough most of the products from the SEZ plant are meant for overseas market, some like cooking gas are sold in local markets. \nReliance’s refineries are among the most complex in the world and have facilities that can maximize the production of diesel and gasoline from so-called heavy, or higher density, crude oil that typically sells for less than other crude grades. \nReliance, in a presentation to India’s Center for High Technology (CHT), said it wanted to raise the capacity of its Jamnagar complex to 100 million tonnes a year by 2030, sources last year told Reuters. \nCHT is a unit of the Ministry of Petroleum and Natural Gas that evaluates projects and assesses their technological requirements. Reporting by Nidhi Verma; Editing by Christian Schmollinger", "external_links": [], "published": "2018-01-16T13:34:00.000+02:00", "crawled": "2018-01-16T14:00:16.000+02:00", "highlightTitle": ""}