{"organizations": [], "uuid": "dc13999ca2e5769701d32766c19c8de3669521b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-brandywine-realty-trust-announces-fourth-quarter-and-full-year-2017-results-and-revises-2018-guidance.html", "country": "US", "domain_rank": 767, "title": "Brandywine Realty Trust Announces Fourth Quarter and Full Year 2017 Results and Revises 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:44:00.000+02:00", "replies_count": 0, "uuid": "dc13999ca2e5769701d32766c19c8de3669521b4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-brandywine-realty-trust-announces-fourth-quarter-and-full-year-2017-results-and-revises-2018-guidance.html", "ord_in_thread": 0, "title": "Brandywine Realty Trust Announces Fourth Quarter and Full Year 2017 Results and Revises 2018 Guidance", "locations": [], "entities": {"persons": [{"name": "jerry sweeney", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}, {"name": "cira centre south", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "brandywine realty trust", "sentiment": "negative"}, {"name": "bdn", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "brandywine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Jan. 25, 2018 /PRNewswire/ -- Brandywine Realty Trust (NYSE: BDN) today reported its financial and operating results for the three and twelve-month periods ended December 31, 2017.\nManagement Comments\n\"The final quarter of 2017 was very active for Brandywine and we finished the year achieving or exceeding many of our business goals,\" stated Jerry Sweeney, President and Chief Executive Officer for Brandywine Realty Trust. \"Our fourth quarter operating metrics allowed us to exceed our rental rate mark-to-market and tenant retention while keeping our capital costs down. We are also pleased to announce a strong start to 2018 with the sale of our interests in evo at Cira Centre South for $197.5 million, a student housing project located in Philadelphia, in which we had a 50% ownership interest. The sale represents another very successful joint venture development project generating a $25.3 million gain and generating over a 20% annual rate of return on our invested equity. We also took advantage of the favorable public debt market to raise $550 million of unsecured bonds and prepaid $325 million of 2018 bonds, which lowered our average borrowing cost to 4.0% and lengthened our weighted-average debt maturities to 7.7 years. In addition, we utilized our continuous equity offering program to raise $51.6 million at an average price of $18.19 per share. These transactions demonstrate our priority to continually improve our balance sheet metrics and financial position and we have now pre-funded all of our 2018 balance sheet obligations. Based on our sale of evo and equity issuance, we are adjusting our 2018 FFO guidance from $1.36-$1.46 per share to $1.33-$1.43 per share.\"\nFourth Quarter 2017 Highlights\nFinancial Results\nNet income allocated to common shareholders; $73.1 million, or $0.41 per diluted share. Our fourth quarter results include net gains on sale of real estate totaling $75.4 million, or $0.43 per diluted share and includes one-time charges related to liability management totaling $3.9 million for early extinguishment of 2018 bonds, incremental interest totaling $0.8 million related to the make-whole provisions of our 2018 bonds, and $1.3 million related to the sale of properties in our joint venture located in Austin, Texas.\nFunds from Operations (FFO); $53.7 million, or $0.30 per diluted share. Our fourth quarter results include one-time charges related to liability management totaling $3.9 million for early extinguishment of 2018 bonds, incremental interest totaling $0.8 million related to the make-whole provisions of our 2018 bonds, and $1.3 million related to the sale of properties in our joint venture located in Austin, Texas.\nPortfolio Results\nCore portfolio was 92.9% occupied and 94.3% leased.\nSigned approximately 893,000 square feet of new and renewal leases.\nAchieved 90% tenant retention ratio for the fourth quarter and 75% for 2017.\nRental rate mark-to-market increased 19.3% on a GAAP basis and increased 4.6% on a cash basis.\nSame store net operating income growth: (2.3%) on a GAAP basis and 3.3% on a cash basis.\nRecent Transaction Activity\n2018 Business Plan Revisions\nNet Disposition Target: $100.0 million increase to our disposition target due to the sale of our interests in evo at Cira Centre South.\nJoint Venture Activity\nOn January 10, 2018, the evo at Cira Centre South Venture, a real estate venture in which we owned a 50% interest, sold its 347-unit residential property in Philadelphia, Pennsylvania, at a gross sales price of $197.5 million. We received net cash proceeds of $43.0 million after closing costs and related debt payoffs and recorded a gain of $25.3 million.\nOn January 5, 2018, we exchanged our 20% interest in Seven Tower Bridge, a real estate venture which owns an undeveloped land parcel in Conshohocken, Pennsylvania encumbered by $14.6 million of debt for the remaining 35% interest in Four Tower Bridge, a real estate venture which owns an office property containing 86,021 square feet in Conshohocken, Pennsylvania encumbered by $9.7 million of debt. The estimated gain on the transaction is $9.7 million.\nAs previously announced, on October 18, 2017, our joint venture in Austin, Texas, a real estate venture in which we own a 50% interest, sold five office portfolios containing an aggregate of approximately 1,164,500 square feet located in Austin, Texas for a gross sales price of $333.3 million. These properties were encumbered with $151.4 million of first mortgage financing. After closing costs and related debt payoffs, we received net cash proceeds totaling approximately $86.4 million. These properties were 86% occupied and 95% leased at September 30, 2017. Net cash proceeds were used to lower the outstanding balance on our unsecured line of credit. As a result of these property sales, we incurred a one-time charge of approximately $1.3 million for the early extinguishment of debt and recorded a net gain totaling $52.2 million.\nDispositions\nOn November 22, 2017, we completed the previously announced sale of five buildings in Newtown Square, Pennsylvania for $42.0 million. The buildings total approximately 253,000 square feet and we received net cash proceeds of $40.5 million and recorded a gain of $19.6 million. Net cash proceeds were used to lower the outstanding balance on our unsecured line of credit.\nAs previously announced, we completed the sale of a 150,000 square foot office building located at 630 Allendale Road in King of Prussia, Pennsylvania for $17.5 million. We received net cash proceeds of $16.6 million and recorded a gain of $3.6 million. Net cash proceeds were used to lower the outstanding balance on our unsecured line of credit.\nDevelopment/Redevelopment Acquisitions\nSchuylkill Yards/One Drexel Plaza\nAs previously announced, on October 13, 2017, we acquired a leasehold interest in an office building known as One Drexel Plaza in Philadelphia, Pennsylvania, containing approximately 283,000 rentable square feet for a gross purchase price of $35.0 million. The acquisition represents an investment in our Schuylkill Yards development and the property will be repositioned over the next 12-18 months. The acquisition was funded from borrowings under our unsecured line of credit.\nAustin, Texas Development\nAs previously announced, on October 2, 2017, we signed a 165,000 square foot, 10-year lease for a build-to-suit property located in our project at Four Points in Austin, Texas. We commenced construction on the 100% pre-leased building in October 2017. Estimated project costs total $48.2 million, with delivery anticipated in the first quarter 2019. We expect to fund the project with available cash balances and/or our unsecured line of credit.\nGuaranteed Note Transaction Highlights\nOn November 17, 2017, we issued $450.0 million of 3.95% ten-year guaranteed notes and $100.0 million 3.95% guaranteed notes due February 2023, realizing net proceeds of approximately $544.5 million. The $100.0 million of 3.95% guaranteed notes due February 2023 were issued at approximately 102.5% of their principal amount resulting in an effective yield to maturity of 3.40% and will be additive to the $250.0 million guaranteed notes that were issued in December 2012 with the same maturity date.\nOn November 16, 2017, we completed a $113.4 million tender offer of our 4.95% Guaranteed Notes due April 2018 (the \"2018 Notes\") and on December 18, 2017, we redeemed $211.6 million of 2018 Notes not previously retired through the tender offer.\nAs a result of the above transactions, we incurred approximately $4.7 million, or $0.03 per diluted share, of net one-time charges primarily related to the $3.9 million write-off of unamortized deferred financing costs and redemption costs associated with the early redemption of our 2018 Notes and $0.8 million of incremental interest related to the make-whole provisions of our 2018 Notes.\n2017 Finance / Capital Markets Activity\nDuring the fourth quarter of 2017 and the first quarter of 2018, we issued approximately 2.9 million shares under our continuous equity offering program raising $51.6 million in net proceeds.\nWe have no outstanding balance on our $600.0 million unsecured revolving credit facility as of December 31, 2017.\nWe have $202.2 million of cash and cash equivalents on-hand as of December 31, 2017.\nResults for the Three and Twelve-Month Periods Ended December 31, 2017\nNet income allocated to common shares totaled $73.1 million, or $0.41 per diluted share, in the fourth quarter of 2017 compared to a net loss of ($14.1) million or ($0.08) per share in the fourth quarter of 2016. Our fourth quarter 2017 results include net gains on sale of real estate totaling $75.4 million, or $0.43 per diluted share and one-time charges related to liability management totaling $3.9 million for early extinguishment of 2018 bonds, incremental interest totaling $0.8 million related to the make-whole provisions of our 2018 bonds, and $1.3 million related to the sale of properties in our joint venture located in Austin, Texas. Our fourth quarter 2016 results included impairment charges on real estate and unimproved land totaling $27.4 million, or ($0.16) per share.\nFFO available to common shares and units in the fourth quarter of 2017 totaled $53.7 million or $0.30 per diluted share versus $63.0 million or $0.35 per diluted share in the fourth quarter of 2016. Our fourth quarter 2017 results include one-time charges related to liability management totaling $3.9 million for early extinguishment of 2018 bonds, incremental interest totaling $0.8 million related to the make-whole provisions of our 2018 bonds, and $1.3 million related to the sale of properties in our joint venture located in Austin, Texas. Our fourth quarter 2016 results included $3.5 million, or $0.02 per share, from a net gain, after impairments on unimproved land. Our fourth quarter 2017 payout ratio ($0.16 common share distribution / $0.30 FFO per diluted share) was 53.3%.\nNet income allocated to common shares totaled $115.3 million or $0.65 per diluted share for twelve months of 2017 compared to net income of $33.0 million or $0.19 per diluted share in the twelve months of 2016. Our 2017 results include net gains on sale of real estate totaling $75.4 million, or $0.43 per diluted share and one-time charges related to liability management totaling $3.9 million for early extinguishment of 2018 bonds, incremental interest totaling $0.8 million related to the make-whole provisions of our 2018 bonds, and $1.3 million related to the sale of properties in our joint venture located in Austin, Texas. Our 2016 results included provisions for impairment of real estate totaling $40.5 million, or ($0.23) per share.\nOur FFO available to common shares and units for the twelve months ended 2017 totaled $229.2 million, or $1.29 per diluted share, compared to our FFO available to common shares and units for the twelve months of 2016, which totaled $167.0 million, or $0.94 per diluted share. Our 2017 results include net gains on sale of real estate totaling $75.4 million, or $0.43 per diluted share and one-time charges related to liability management totaling $3.9 million for early extinguishment of 2018 bonds, incremental interest totaling $0.8 million related to the make-whole provisions of our 2018 bonds, and $1.3 million related to the sale of properties in our joint venture located in Austin, Texas. Our 2016 results include a $66.6 million, or $0.38 per share, charge for the early extinguishment of debt related to our sale of our Cira Square property located in Philadelphia, Pennsylvania and $3.5 million, or $0.02 per share, from net gains/impairments on undeveloped land. Excluding the early extinguishment of debt and net gain, after impairments, on unimproved land, FFO available to common shares and units in the twelve months of 2016 totaled $230.1 million, or $1.30 per diluted share. Our 2017 FFO payout ratio ($0.64 common share distribution / $1.29 FFO per diluted share) was 49.6%.\nOperating and Leasing Activity\nIn the fourth quarter of 2017, our Net Operating Income (NOI) excluding termination revenues and other income items decreased 2.3% on a GAAP basis and increased 3.3% on a cash basis for our 83 same store properties, which were 93.2% and 94.8% occupied on December 31, 2017 and December 31, 2016, respectively.\nWe leased approximately 893,000 square feet and commenced occupancy on 400,000 square feet during the fourth quarter of 2017. The fourth quarter occupancy activity includes 133,000 square feet of renewals, 168,000 square feet of new leases and 99,000 square feet of tenant expansions. We have an additional 215,000 square feet of executed new leasing scheduled to commence subsequent to December 31, 2017.\nWe achieved a 90% tenant retention ratio in our core portfolio with net absorption of 141,000 square feet during the fourth quarter of 2017. Fourth quarter rental rate growth increased 19.3% as our renewal rental rates increased 11.2% and our new lease/expansion rental rates increased 28.4%, all on a GAAP basis.\nAt December 31, 2017, our core portfolio of 87 properties comprising 15.6 million square feet was 92.9% occupied and we are now 94.3% leased (reflecting new leases commencing after December 31, 2017).\nDistributions\nOn December 7, 2017, our Board of Trustees declared a quarterly cash dividend of $0.18 per common share and OP Unit that was paid on January 23, 2018 to holders of record on January 9, 2018. The quarterly dividend is equivalent to an annual rate of $0.72 per share representing a 12.5% increase from the previous annual dividend rate of $0.64 per share.\n2018 Earnings and FFO Guidance\nBased on current plans and assumptions and subject to the risks and uncertainties more fully described in our Securities and Exchange Commission filings, we are adjusting our 2018 net income guidance of $0.34 - $0.44 to $0.29 - $0.39 per diluted share and 2018 FFO guidance of $1.36 - $1.46 to $1.33 - $1.43 per diluted share. This guidance is provided for informational purposes and is subject to change. The following is a reconciliation of the calculation of 2018 FFO and earnings per diluted share:\nGuidance for 2018\nRange\nEarnings per diluted share allocated to common shareholders\n$0.29\nto\n$0.39\nPlus: real estate depreciation, amortization\n1.04\n1.04\nFFO per diluted share\n$ 1.33\nto\n$ 1.43\nOur 2018 FFO key assumptions to include:\nCore Occupancy improving to a range of 94-95% by year-end 2018 and 95-96% leased; Average Same-Store Occupancy of 92.6% during 2018 versus 93.5% during 2017; 8-10% GAAP increase in overall lease rates during 2018 with a resulting (1)-1% (decrease)/increase in 2018 same store GAAP NOI; (2)-2% cash (decrease)/increase in overall lease rates during 2018 with a resulting 1-3% increase in 2018 same store cash NOI growth; Speculative Revenue Target: $26.3 million, 75% achieved; $0.18 per share quarterly dividend; No acquisition activity; $100 million sales activity; One development start; and Annual earnings and FFO per diluted share based on 181.5 million fully diluted weighted average common shares.\nAbout Brandywine Realty Trust\nBrandywine Realty Trust (NYSE: BDN) is one of the largest, publicly traded, full-service, integrated real estate companies in the United States with a core focus in the Philadelphia, Washington, D.C., and Austin markets. Organized as a real estate investment trust (REIT), we own, develop, lease and manage an urban, town center and transit-oriented portfolio comprising 185 properties and 25.3 million square feet as of December 31, 2017, which excludes assets held for sale. Our purpose is to shape, connect and inspire the world around us through our expertise, the relationships we foster, the communities in which we live and work, and the history we build together. For more information, please visit www.brandywinerealty.com .\nConference Call and Audio Webcast\nBDN management will discuss 2017 financial results and earnings guidance for fiscal 2018 on Friday, January 26, 2018 at 9:00 a.m. EDT. The conference call can be accessed by dialing 1-833-818-6810 and providing conference ID: 6578749. Beginning two hours after the conference call, a taped replay of the call can be accessed through Friday, February 9, 2018, by calling 1-855-859-2056 and entering access code 6578749. The conference call can also be accessed via a webcast on our website at www.brandywinerealty.com.\nLooking Ahead – First Quarter 2018 Conference Call\nWe anticipate we will release our first quarter 2018 earnings on Thursday, April 19, 2018, after the market close and will host our first quarter 2018 conference call on Friday, April 20, 2018 at 9:00 a.m. Eastern Time. We expect to issue a press release in advance of these events to reconfirm the dates and times and provide all related information.\nForward-Looking Statements\nEstimates of future earnings per share, FFO per share, common share dividend distributions and certain other statements in this release constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause our and our affiliates' actual results, performance, achievements or transactions to be materially different from any future results, performance, achievements or transactions expressed or implied by such forward-looking statements. Such risks, uncertainties and other factors relate to, among others: our ability to lease vacant space and to renew or relet space under expiring leases at expected levels; competition with other real estate companies for tenants; the potential loss or bankruptcy of major tenants; interest rate levels; the availability of debt, equity or other financing; risks of acquisitions, dispositions and developments, including the cost of construction delays and cost overruns; unanticipated operating and capital costs; our ability to obtain adequate insurance, including coverage for terrorist acts; dependence upon certain geographic markets; and general and local economic and real estate conditions, including the extent and duration of adverse changes that affect the industries in which our tenants operate. The declaration and payment of future dividends (both timing and amount) is subject to the determination of our Board of Trustees, in its sole discretion, after considering various factors, including the Company's financial condition, historical and forecast operating results, and available cash flow, as well as any applicable laws and contractual covenants and any other relevant factors. The Company's practice regarding payment of dividends may be modified at any time and from time to time. Additional information on factors which could impact us and the forward-looking statements contained herein are included in our filings with the Securities and Exchange Commission, including our Form 10-K for the year ended December 31, 2016. We assume no obligation to update or supplement forward-looking statements that become untrue because of subsequent events except as required by law.\nNon-GAAP Supplemental Financial Measures\nWe compute our financial results in accordance with generally accepted accounting principles (GAAP). Although FFO and NOI are non-GAAP financial measures, we believe that FFO and NOI calculations are helpful to shareholders and potential investors and are widely recognized measures of real estate investment trust performance. At the end of this press release, we have provided a reconciliation of the non-GAAP financial measures to the most directly comparable GAAP measure.\nFunds from Operations (FFO)\nWe compute FFO in accordance with standards established by the National Association of Real Estate Investment Trusts (NAREIT), which may not be comparable to FFO reported by other REITs that do not compute FFO in accordance with the NAREIT definition, or that interpret the NAREIT definition differently than us. NAREIT defines FFO as net income (loss) before non-controlling interests and excluding gains (losses) on sales of depreciable operating property, impairment losses on depreciable consolidated real estate, impairment losses on investments in unconsolidated real estate ventures and extraordinary items (computed in accordance with GAAP); plus real estate related depreciation and amortization (excluding amortization of deferred financing costs), and after similar adjustments for unconsolidated joint ventures. Net income, the GAAP measure that we believe to be most directly comparable to FFO, includes depreciation and amortization expenses, gains or losses on property sales, extraordinary items and non-controlling interests. To facilitate a clear understanding of our historical operating results, FFO should be examined in conjunction with net income (determined in accordance with GAAP) as presented in the financial statements included elsewhere in this release. FFO does not represent cash flow from operating activities (determined in accordance with GAAP) and should not be considered to be an alternative to net income (loss) (determined in accordance with GAAP) as an indication of our financial performance or to be an alternative to cash flow from operating activities (determined in accordance with GAAP) as a measure of our liquidity, nor is it indicative of funds available for our cash needs, including our ability to make cash distributions to shareholders.\nNet Operating Income (NOI)\nNOI is a financial measure equal to net income available to common shareholders, the most directly comparable GAAP financial measure, plus corporate general and administrative expense, depreciation and amortization, interest expense, non-controlling interest in the Operating Partnership and losses from early extinguishment of debt, less interest income, development and management income, gains from property dispositions, gains on sale from discontinued operations, gains on early extinguishment of debt, income from discontinued operations, income from unconsolidated joint ventures and non-controlling interest in property partnerships. In some cases we also present NOI on a cash basis, which is NOI after eliminating the effects of straight-lining of rent and deferred market intangible amortization. NOI presented by us may not be comparable to NOI reported by other REITs that define NOI differently. NOI should not be considered an alternative to net income as an indication of our performance or to cash flows as a measure of the Company's liquidity or its ability to make distributions. NOI is a useful measure for evaluating the operating performance of our properties, as it excludes certain components from net income available to common shareholders in order to provide results that are more closely related to a property's results of operations. NOI is used internally to evaluate the performance of our operating segments and to make decisions about resource allocations. We concluded that NOI provides useful information to investors regarding our financial condition and results of operations, as it reflects only the income and expense items incurred at the property level, as well as the impact on operations from trends in occupancy rates, rental rates, operating costs and acquisition and development activity on an unlevered basis.\nCore Portfolio\nOur core portfolio is comprised of our wholly-owned properties, excluding any properties currently in development, re-development or re-entitlement.\nBRANDYWINE REALTY TRUST\nCONSOLIDATED BALANCE SHEETS\n(in thousands)\nDecember 31,\nDecember 31,\n2017\n2016\nASSETS\n(unaudited)\nReal estate investments:\nOperating properties\n$\n3,832,348\n$\n3,586,295\nAccumulated depreciation\n(895,091)\n(852,476)\nOperating real estate investments, net\n2,937,257\n2,733,819\nConstruction-in-progress\n121,188\n297,462\nLand held for development\n98,242\n150,970\nTotal real estate investments, net\n3,156,687\n3,182,251\nAssets held for sale, net\n392\n41,718\nCash and cash equivalents\n202,179\n193,919\nAccounts receivable, net of allowance of $3,467 and $2,373 in 2017 and 2016, respectively\n17,938\n12,446\nAccrued rent receivable, net of allowance of $13,645 and $13,743 in 2017 and 2016, respectively\n169,760\n149,624\nInvestment in real estate ventures, at equity\n194,621\n281,331\nDeferred costs, net\n96,695\n91,342\nIntangible assets, net\n64,972\n72,478\nOther assets\n92,204\n74,104\nTotal assets\n$\n3,995,448\n$\n4,099,213\nLIABILITIES AND BENEFICIARIES' EQUITY\nMortgage notes payable, net\n$\n317,216\n$\n321,549\nUnsecured term loans, net\n248,429\n248,099\nUnsecured senior notes, net\n1,365,183\n1,443,464\nAccounts payable and accrued expenses\n107,074\n103,404\nDistributions payable\n32,456\n30,032\nDeferred income, gains and rent\n42,593\n31,620\nAcquired lease intangibles, net\n20,274\n18,119\nLiabilities related to assets held for sale\n-\n81\nOther liabilities\n15,623\n19,408\nTotal liabilities\n$\n2,148,848\n$\n2,215,776\nBrandywine Realty Trust's Equity:\nPreferred Shares (shares authorized-20,000,000)\n6.90% Series E Preferred Shares, $0.01 par value; issued and outstanding- 0 in 2017 and 4,000,000 in 2016\n-\n40\nCommon Shares of Brandywine Realty Trust's beneficial interest, $0.01 par value; shares authorized\n400,000,000; 178,285,236 and 175,140,760 issued and outstanding in 2017 and in 2016, respectively\n1,784\n1,752\nAdditional paid-in-capital\n3,218,564\n3,258,870\nDeferred compensation payable in common shares\n11,304\n13,684\nCommon shares in grantor trust, 894,736 in 2017, 899,457 in 2016\n(11,304)\n(13,684)\nCumulative earnings\n660,174\n539,319\nAccumulated other comprehensive income (loss)\n2,399\n(1,745)\nCumulative distributions\n(2,053,741)\n(1,931,892)\nTotal Brandywine Realty Trust's equity\n1,829,180\n1,866,344\nNon-controlling interests\n17,420\n17,093\nTotal beneficiaries' equity\n1,846,600\n1,883,437\nTotal liabilities and beneficiaries' equity\n$\n3,995,448\n$\n4,099,213\nBRANDYWINE REALTY TRUST\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(unaudited, in thousands, except share and per share data)\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n2017\n2016\n2017\n2016\nRevenue\nRents\n$\n104,887\n$\n103,181\n$\n412,333\n$\n421,505\nTenant reimbursements\n18,808\n17,314\n72,620\n70,629\nTermination fees\n357\n880\n2,370\n2,339\nThird party management fees, labor reimbursement and leasing\n7,862\n8,983\n28,345\n26,674\nOther\n1,430\n1,728\n4,825\n4,316\nTotal revenue\n133,344\n132,086\n520,493\n525,463\nOperating expenses:\nProperty operating expenses\n39,888\n38,718\n150,835\n152,926\nReal estate taxes\n11,142\n11,319\n45,204\n46,252\nThird party management expenses\n2,569\n3,098\n9,960\n10,270\nDepreciation and amortization\n46,773\n46,940\n179,357\n189,676\nGeneral and administrative expenses\n6,741\n5,885\n28,538\n26,596\nProvision for impairment\n-\n27,448\n3,057\n40,517\nTotal operating expenses\n107,113\n133,408\n416,951\n466,237\nOperating income (loss)\n26,231\n(1,322)\n103,542\n59,226\nOther income (expense)\nInterest income\n478\n266\n1,113\n1,236\nInterest expense\n(20,413)\n(20,374)\n(81,886)\n(84,708)\nInterest expense - amortization of deferred financing costs\n(628)\n(633)\n(2,435)\n(2,696)\nInterest expense - financing obligation\n-\n-\n-\n(679)\nEquity in loss of Real Estate Ventures\n(2,919)\n(2,180)\n(8,306)\n(11,503)\nNet gain on disposition of real estate\n23,246\n2,358\n31,657\n116,983\nNet gain on sale of undepreciated real estate\n-\n9,044\n953\n9,232\nNet gain on real estate venture transactions\n52,186\n471\n80,526\n20,000\nLoss on early extinguishment of debt\n(3,933)\n-\n(3,933)\n(66,590)\nNet income (loss) before income taxes\n74,248\n(12,370)\n121,231\n40,501\nIncome tax (provision) benefit\n(404)\n-\n628\n-\nNet income (loss)\n73,844\n(12,370)\n121,859\n40,501\nNet (income) loss attributable to non-controlling interests\n(625)\n115\n(1,009)\n(310)\nNet income (loss) attributable to Brandywine Realty Trust\n73,219\n(12,255)\n120,850\n40,191\nDistribution to preferred shareholders\n-\n(1,725)\n(2,032)\n(6,900)\nPreferred share redemption charge\n-\n-\n(3,181)\n-\nNonforfeitable dividends allocated to unvested restricted shareholders\n(82)\n(78)\n(327)\n(341)\nNet income (loss) attributable to Common Shareholders of Brandywine\nRealty Trust\n$\n73,137\n$\n(14,058)\n$\n115,310\n$\n32,950\nPER SHARE DATA\nBasic income (loss) per common share\n$\n0.42\n$\n(0.08)\n$\n0.66\n$\n0.19\nBasic weighted average shares outstanding\n175,985,156\n175,140,760\n175,484,350\n175,018,163\nDiluted income (loss) per common share\n$\n0.41\n$\n(0.08)\n$\n0.65\n$\n0.19\nDiluted weighted average shares outstanding\n177,426,365\n175,140,760\n176,808,166\n176,010,814\nBRANDYWINE REALTY TRUST\nFUNDS FROM OPERATIONS\n(unaudited, in thousands, except share and per share data)\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n2017\n2016\n2017\n2016\nReconciliation of Net Income to Funds from Operations:\nNet income (loss) attributable to common shareholders\n$\n73,137\n$\n(14,058)\n$\n115,310\n$\n32,950\nAdd (deduct):\nNet income (loss) attributable to non-controlling interests - LP units\n621\n(118)\n980\n295\nNonforfeitable dividends allocated to unvested restricted shareholders\n82\n78\n327\n341\nNet gain on real estate venture transactions\n(52,186)\n(471)\n(80,526)\n(20,000)\nNet gain on disposition of real estate\n(23,246)\n(2,358)\n(31,657)\n(116,983)\nProvision for impairment\n-\n21,860\n2,730\n34,929\nOther than temporary impairment of equity method investment\n-\n-\n4,844\n-\nCompany's share of impairment of an unconsolidated real estate venture\n-\n-\n-\n5,238\nDepreciation and amortization:\nReal property\n38,208\n34,171\n142,548\n135,094\nLeasing costs including acquired intangibles\n8,207\n12,667\n35,920\n54,195\nCompany's share of unconsolidated real estate ventures\n9,117\n11,427\n39,622\n41,612\nPartners' share of consolidated real estate ventures\n(54)\n(59)\n(231)\n(235)\nFunds from operations\n$\n53,886\n$\n63,139\n$\n229,867\n$\n167,436\nFunds from operations allocable to unvested restricted shareholders\n(137)\n(176)\n(648)\n(457)\nFunds from operations available to common share and unit holders (FFO)\n$\n53,749\n$\n62,963\n$\n229,219\n$\n166,979\nFFO per share - fully diluted\n$\n0.30\n$\n0.35\n$\n1.29\n$\n0.94\nWeighted-average shares/units outstanding - fully diluted\n178,906,164\n177,491,208\n178,287,965\n177,516,451\nDistributions paid per common share\n$\n0.16\n$\n0.16\n$\n0.64\n$\n0.63\nFFO payout ratio (distributions paid per common share/FFO per diluted\nshare)\n53.3\n%\n45.7\n%\n49.6\n%\n67.0\n%\nBRANDYWINE REALTY TRUST\nSAME STORE OPERATIONS – 4 th QUARTER\n(unaudited and in thousands)\nOf the 93 properties owned by the Company as of December 31, 2017, a total of 83 properties (\"Same Store Properties\") containing an aggregate of 14.3 million net rentable square feet were owned for the entire three-month periods ended December 31, 2017 and 2016. As of December 31, 2017, four properties were recently completed/acquired, two properties were in development and four properties were in redevelopment. Average occupancy for the Same Store Properties was 92.8% during 2017 and 94.4% during 2016. The following table sets forth revenue and expense information for the Same Store Properties:\nThree Months Ended December 31,\n2017\n2016\nRevenue\nRents\n$\n90,603\n$\n91,748\nTenant reimbursements\n16,861\n15,641\nTermination fees\n357\n335\nOther\n416\n436\nTotal revenue\n108,237\n108,160\nOperating expenses\nProperty operating expenses\n32,628\n31,326\nReal estate taxes\n10,012\n9,682\nNet operating income\n$\n65,597\n$\n67,152\nNet operating income - percentage change over prior year\n-2.3\n%\nNet operating income, excluding net termination fees & other\n$\n64,824\n$\n66,381\nNet operating income, excluding net termination fees & other - percentage change over prior year\n-2.3\n%\nNet operating income\n$\n65,597\n$\n67,152\nStraight line rents & other\n(143)\n(3,164)\nAbove/below market rent amortization\n(450)\n(1,451)\nAmortization of tenant inducements\n390\n724\nNon-cash ground rent\n22\n22\nCash - Net operating income\n$\n65,416\n$\n63,283\nCash - Net operating income - percentage change over prior year\n3.4\n%\nCash - Net operating income, excluding net termination fees & other\n$\n64,439\n$\n62,406\nCash - Net operating income, excluding net termination fees & other - percentage change over prior year\n3.3\n%\nThree Months Ended December 31,\n2017\n2016\nNet income (loss)\n$\n73,844\n$\n(12,370)\nAdd/(deduct):\nInterest income\n(478)\n(266)\nInterest expense\n20,413\n20,374\nInterest expense - amortization of deferred financing costs\n628\n633\nEquity in loss of real estate ventures\n2,919\n2,180\nNet gain on real estate venture transactions\n(52,186)\n(471)\nNet gain on disposition of real estate\n(23,246)\n(2,358)\nNet gain on sale of undepreciated real estate\n-\n(9,044)\nLoss on early extinguishment of debt\n3,933\n-\nDepreciation and amortization\n46,773\n46,940\nGeneral & administrative expenses\n6,741\n5,885\nIncome tax provision\n404\n-\nProvision for impairment\n-\n27,448\nConsolidated net operating income\n79,745\n78,951\nLess: Net operating income of non-same store properties and elimination of non-property specific operations\n(14,148)\n(11,799)\nSame store net operating income\n$\n65,597\n$\n67,152\nBRANDYWINE REALTY TRUST\nSAME STORE OPERATIONS – TWELVE MONTHS\n(unaudited and in thousands)\nOf the 93 properties owned by the Company as of December 31, 2017, a total of 83 properties (\"Same Store Properties\") containing an aggregate of 14.3 million net rentable square feet were owned for the entire twelve-month periods ended December 31, 2017 and 2016. As of December 31, 2017, four properties were recently completed/acquired, two properties were in development and four properties were in redevelopment. Average occupancy for the Same Store Properties was 93.5% during 2017 and 94.2% during 2016. The following table sets forth revenue and expense information for the Same Store Properties:\nTwelve Months Ended December 31,\n2017\n2016\nRevenue\nRents\n$\n365,717\n$\n365,415\nTenant reimbursements\n66,124\n61,747\nTermination fees\n1,893\n660\nOther\n2,056\n1,744\nTotal revenue\n435,790\n429,566\nOperating expenses\nProperty operating expenses\n126,463\n124,154\nReal estate taxes\n39,928\n39,061\nNet operating income\n$\n269,399\n$\n266,351\nNet operating income - percentage change over prior year\n1.1\n%\nNet operating income, excluding net termination fees & other\n$\n265,450\n$\n263,947\nNet operating income, excluding net termination fees & other - percentage change over prior year\n0.6\n%\nNet operating income\n$\n269,399\n$\n266,351\nStraight line rents & other\n(6,117)\n(20,231)\nAbove/below market rent amortization\n(2,694)\n(6,648)\nAmortization of tenant inducements\n1,448\n1,752\nNon-cash ground rent\n88\n88\nCash - Net operating income\n$\n262,124\n$\n241,312\nCash - Net operating income - percentage change over prior year\n8.6\n%\nCash - Net operating income, excluding net termination fees & other\n$\n257,043\n$\n238,365\nCash - Net operating income, excluding net termination fees & other - percentage change over prior year\n7.8\n%\nTwelve Months Ended December 31,\n2017\n2016\nNet income:\n$\n121,859\n$\n40,501\nAdd/(deduct):\nInterest income\n(1,113)\n(1,236)\nInterest expense\n81,886\n84,708\nInterest expense - amortization of deferred financing costs\n2,435\n2,696\nInterest expense - financing obligation\n-\n679\nEquity in loss of real estate ventures\n8,306\n11,503\nNet gain on real estate venture transactions\n(80,526)\n(20,000)\nNet gain on disposition of real estate\n(31,657)\n(116,983)\nNet gain on sale of undepreciated assets\n(953)\n(9,232)\nLoss on early extinguishment of debt\n3,933\n66,590\nDepreciation and amortization\n179,357\n189,676\nGeneral & administrative expenses\n28,538\n26,596\nIncome tax benefit\n(628)\n-\nProvision for impairment\n3,057\n40,517\nConsolidated net operating income\n314,494\n316,015\nLess: Net operating income of non-same store properties and elimination of non-property specific operations\n(45,095)\n(49,664)\nSame store net operating income\n$\n269,399\n$\n266,351\nView original content with multimedia: http://www.prnewswire.com/news-releases/brandywine-realty-trust-announces-fourth-quarter-and-full-year-2017-results-and-revises-2018-guidance-300588595.html\nSOURCE Brandywine Realty Trust", "external_links": ["http://www.prnewswire.com/news-releases/brandywine-realty-trust-announces-fourth-quarter-and-full-year-2017-results-and-revises-2018-guidance-300588595.html", "http://www.brandywinerealty.com/"], "published": "2018-01-26T00:44:00.000+02:00", "crawled": "2018-01-26T01:41:08.004+02:00", "highlightTitle": ""}