{"organizations": [], "uuid": "e8fc4c062855ec4d0a54fec6c663ff03e2830a2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-880887288.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/golden-globes-2018-snubs-diversity/", "country": "US", "domain_rank": 1196, "title": "Commentary: Golden Globe 2018 Snubs Show Hollywood's Diversity Problem | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.969, "site_type": "news", "published": "2018-01-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "e8fc4c062855ec4d0a54fec6c663ff03e2830a2d"}, "author": "Nicholas Pearce", "url": "http://fortune.com/2018/01/04/golden-globes-2018-snubs-diversity/", "ord_in_thread": 0, "title": "Commentary: Golden Globe 2018 Snubs Show Hollywood's Diversity Problem | Fortune", "locations": [], "entities": {"persons": [{"name": "nicholas pearce", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "creative artists agency", "sentiment": "none"}, {"name": "ucla bunche center", "sentiment": "none"}, {"name": "hollywood diversity report", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Nicholas Pearce January 4, 2018 \nSunday’s 75th Golden Globe Awards ceremony shines a well-deserved spotlight on those being honored for excellence in film and television, but perhaps an even brighter one on some of those who are being overlooked: women directors. There are no women among this year’s five nominees in the prestigious Best Director category. \nProviding access and opportunity to diverse talent is not just a feel-good way to manage optics in a precarious societal moment. Making room at the table for diverse talent and creating space for their voices to matter is a proven way to drive differentiated results. This is particularly important in industries like entertainment that rely on creativity, collaboration, and innovation. \nAccording to the Creative Artists Agency, at every level of budget, films with diverse casts outperform those that are more homogeneous. The UCLA Bunche Center’s 2017 Hollywood Diversity Report found that films with diverse casts enjoyed above-average returns on investment and global box office receipts. These findings underscore decades of social and behavioral science that unambiguously reveal that social diversity (e.g., gender, race. etc.) when leveraged can enhance team functionality and bottom-line organizational performance. \nWhile this is certainly not the first year in which no women were nominated in this category, Hollywood’s glaring gender achievement gap is especially notable at this moment, given that this industry is the very epicenter of the national #MeToo conversation. And it still sits in the shadow cast by the #OscarsSoWhite boycott protesting the lack of racial diversity among the Academy Awards’ lead and supporting acting nominees. \nRather ironically, the Golden Globes’ ignoring of female directors comes before the ink has dried on 2017, a year that The African American Film Critics Association proudly hailed as “ the year of the woman in cinema ,” in recognition of unprecedented opportunities and successes for women filmmakers. Several deserving female directors were overlooked, including Patty Jenkins for Wonder Woman , Dee Rees for Mudbound , and Greta Gerwig for Lady Bird . (Perhaps Ava DuVernay will be nominated next year for directing A Wrinkle in Time .) Therefore, it cannot be said there were no women whose directorial prowess was worthy of at least garnering a nomination for recognition this year. \nTo be sure, there are notable snubs every year in every awards show—but this is not about individual snubs. Since 1944, only four women have ever been nominated for a Golden Globe in the Best Director category. And only four women have ever been nominated for a Best Director Oscar since the Academy Awards began in 1929. Historically, a paucity of directors in top-grossing films have been female, and many industry executives have operated with a “think director, think male” mindset. The evidence suggests that this phenomenon is about far more than isolated individual snubs—this is about pervasive, industry-level collective bias, discriminatory hiring practices, and a sustained pattern of systemic inequality. A recent investigation by the Equal Employment Opportunity Commission agrees. \nThe commitment to advocating for diverse talent must be matched by a commitment to advancing diverse talent. As a Hollywood insider recently tweeted , “The main thing the Golden Globes gives a nominee is visibility.” Advocating for more diverse directors in Hollywood is indeed necessary, but insufficient. When diverse talent is not sponsored into career-accelerating leadership opportunities and find themselves perennially shut out from the opportunity to gain organization-wide or industry-wide visibility, it is a recipe for sustained systemic inequality. The false narrative that diversity and excellence are mutually exclusive must be rejected. Advocacy must be matched with action. As Frederick Douglass said, “Power concedes nothing without a demand.” \n\nThe long road to achieving equity requires authentic allyship and sponsorship. The Golden Globes will reportedly be the setting for a blackout : Several women are planning to dress in black as an act of protest against sexual harassment and violence, and many men are expected to dress in black as a show of solidarity. However, true allyship must extend beyond marches, hashtags, and minimally inconvenient wardrobe choices. Such moments of embodied solidarity may often originate from a sincere desire to be helpful and may provide meaningful socioemotional support, but often do little to remedy the structural inequality that precipitated these moments of protest in the first place. While diversity and inclusion may benefit individual careers, the heavier lift of equity and social justice can influence organizations, industries, and societies for generations to come. \nNicholas Pearce serves as an award-winning clinical professor of management & organizations at Northwestern University’s Kellogg School of Management and CEO of The Vocati Group. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-04T02:00:00.000+02:00", "crawled": "2018-01-05T14:28:47.001+02:00", "highlightTitle": ""}