{"organizations": [], "uuid": "fe6c2370570aba9df1e61e3bc0747093320cf097", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-advicenne-appoints-linda-law-md-as-us-vice-president-clinical-development-and-medical-affairs.html", "country": "US", "domain_rank": 767, "title": "Advicenne Appoints Linda Law, MD as US Vice President, Clinical Development and Medical Affairs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T10:00:00.000+02:00", "replies_count": 0, "uuid": "fe6c2370570aba9df1e61e3bc0747093320cf097"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-advicenne-appoints-linda-law-md-as-us-vice-president-clinical-development-and-medical-affairs.html", "ord_in_thread": 0, "title": "Advicenne Appoints Linda Law, MD as US Vice President, Clinical Development and Medical Affairs", "locations": [], "entities": {"persons": [{"name": "law", "sentiment": "negative"}, {"name": "linda law", "sentiment": "negative"}, {"name": "advicenne", "sentiment": "negative"}, {"name": "luc-andré granier", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "states", "sentiment": "none"}, {"name": "advicenne", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "clinical development and medical affairs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NÎMES, France, January 24, 2018 /PRNewswire/ --\nDr Law's appointment paves the way for Advicenne's United States operations\nAdvicenne (Euronext:ADVIC), a late-stage biopharmaceutical company developing pediatric friendly therapeutics for the treatment of orphan renal and neurological diseases, appoints Linda Law, MD as US Vice President, Clinical Development and Medical Affairs. Dr. Law will oversee Advicenne's clinical development and medical affairs efforts in North America which are focused on the Company's most advanced program, ADV7103. A core focus will be the implementation of the product's pivotal Phase II/III study in patients with distal Renal Tubular Acidosis (dRTA), expected to start this year. Dr. Law Dr. Law will report to Dr. Luc-André Granier, CEO, Medical director and co-founder of Advicenne.\nDr. Law brings 20 years of experience in international pharmaceutical development and medical affairs across a wide range of therapeutic areas. She has been involved in the development, approval and launch of more than ten products, in addition to evaluating and developing integrated strategies for dozens of in-licensed candidates across a broad range of indications, including rare diseases.\nDr. Law started her career in clinical practice of high acuity, pediatric and adult Emergency Medicine. She transitioned to drug development with Procter&Gamble Pharmaceuticals, where she had positions of increasing responsibility and leadership in clinical development, medical affairs and licensing and acquisition, and oversaw GI development projects at Lexicon Pharmaceuticals. She has consulted on evaluation and development projects with, among others, Takeda Pharmaceuticals, Forest Pharmaceuticals, Confluence Life Sciences, Altheus Therapeutics and recently Raptor Pharmaceuticals, a company dedicated to orphan nephrology acquired by Horizon Pharma in September 2016.\nLinda Law received her MD from the University of Texas Health Science Center at Houston and her MBA from the Fisher College of Business at The Ohio State University. She is Board Certified in Emergency Medicine and in Obesity Medicine and maintains active license to practice medicine.\nDr. Luc-André Granier, CEO, Medical director and co - founder of Advicenne , states: \"We are delighted to welcome Dr Law to our team. This is a pivotal time for Advicenne and Dr Law's experience and deep knowledge of US clinical development will be of great value for Advicenne as we prepare for the start of the pivotal Phase II/III study with ADV7103 in patients with dRTA later this year. Her appointment also marks the start of the company's US operations\".\nAbout Advicenne\nAdvicenne (Euronext:ADVIC) is a late-stage biopharmaceutical company developing pediatric friendly therapeutics for the treatment of orphan renal and neurological diseases. The Company's most advanced product is ADV7103, which has shown positive results in a pivotal phase III study in children and adults with distal Renal Acidosis (dTRA). ADV7103 is also being developed in a second indication for the treatment of Cystinuria, an inherited renal tubulopathy and is expected to enter into a pivotal Phase II/III clinical trial in 2018 in Europe. In addition to ADV7103, the Company has a portfolio of products targeting critical unmet needs in nephrology and neurology. Advicenne also develops a clinical and pre-clinical pipeline of potential treatments for additional orphan diseases in collaboration with Key Opinion Leaders.\nAdvicenne is listed on the regulated market of Euronext in Paris (ISIN: FR0013296746; Euronext ticker: ADVIC). The Company, which was established in 2007, is headquartered in Nimes (France).\nAdditional information about Advicenne is available through its website: http://advicenne.com\nFor further information, please contact :\nAdvicenne\nLA Granier, S Delbaere, J Rachline\ninfo@advicenne.com\n+33-(0)-4-66-05-54-20\nCitigate Dewe Rogerson\nDavid Dible, Sylvie Berrebi, Marine Perrier\nadvicenne@citigatedewerogerson.com\n+44-(0)-20-7638-9571\nSOURCE Advicenne", "external_links": [], "published": "2018-01-24T10:00:00.000+02:00", "crawled": "2018-01-24T11:30:38.003+02:00", "highlightTitle": ""}