{"organizations": [], "uuid": "76760a4a62010f3bda456650b2dc1f0c902fc0d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-the-nhp-foundation-names-karen-caldwell-cfotreasurer.html", "country": "US", "domain_rank": 767, "title": "The NHP Foundation Names Karen Caldwell CFO/Treasurer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T19:59:00.000+02:00", "replies_count": 0, "uuid": "76760a4a62010f3bda456650b2dc1f0c902fc0d5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-the-nhp-foundation-names-karen-caldwell-cfotreasurer.html", "ord_in_thread": 0, "title": "The NHP Foundation Names Karen Caldwell CFO/Treasurer", "locations": [], "entities": {"persons": [{"name": "karen caldwell", "sentiment": "negative"}, {"name": "richard burns", "sentiment": "none"}, {"name": "caldwell", "sentiment": "none"}, {"name": "karen", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "nycha", "sentiment": "none"}, {"name": "new york city housing authority", "sentiment": "none"}], "organizations": [{"name": "nhp foundation", "sentiment": "negative"}, {"name": "nhpf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 17, 2018 /PRNewswire-USNewswire/ -- The NHP Foundation (NHPF) announced today that Karen Caldwell has been named Chief Financial Officer and Treasurer of the organization.\nCaldwell brings to NHPF an extensive knowledge of the affordable housing industry having served as CFO and Executive Vice-President for NYCHA, the New York City Housing Authority where she was responsible for the financial strategy, oversight and management of the nation's largest public housing authority, with an annual operating budget of $3.5 billion and a five-year capital budget of $5.45 billion serving 11,000 employees and 600,000 residents.\n\"The depth of Karen's career accomplishments and deep experience in finance and business operations make her the right person for this role within NHPF as we continue to transform the affordable housing industry through smart investments and spending,\" said NHPF President & CEO, Richard Burns. \"We will rely on her leadership to help us grow the business and deliver for our partners, residents and employees.\"\nCaldwell's role includes overseeing cash management for NHPF and all of its subsidiaries and affiliate entities, preparation and overview of financial statements, coordination of audits and tax returns for NHPF and its subsidiaries and affiliated entities; provision of quarterly financial reporting to lenders and grantors and preparation of the Foundation's annual budget.\nPrior to her work at NYCHA, Caldwell served as president of Hanseatic Management Services, Inc., an individual and institutional investment company. She is also a former Managing Director, Alternative Investments at Amundi Investments, LLC.\n\"NHPF is leading the way in the construction and preservation of affordable housing in this country,\" said Caldwell, \"I can't imagine a more exciting time to join this prestigious team.\"\nCaldwell received her Bachelor of Science in Accounting, cum laude from Florida A&M University and graduated magna cum laude from the Northwestern University, Kellogg School of Management, Evanston, IL with a Master of Business Administration, Finance & Marketing.\nFor more information on The NHP Foundation, please visit www.nhpfoundation.org\nAbout The NHP Foundation\nHeadquartered in New York City with offices in Washington, D.C., and Chicago, I.L., The NHP Foundation (NHPF) was launched on January 30, 1989, as a publicly supported 501(c)(3) not-for-profit real estate corporation. NHPF is dedicated to preserving and creating sustainable, service-enriched multifamily housing that is both affordable to low and moderate income families and seniors, and beneficial to their communities. NHPF also provides a robust resident services program to nearly 18,000 community residents. Through partnerships with major financial institutions, the public sector, faith-based initiatives, and other not-for-profit organizations, NHPF has 38 properties, with over 8,000 units, in 15 states and the District of Columbia. For more information, visit www.nhpfoundation.org .\nCONTACT: Colleen O'Connor, 212-367-9744, colleen@crenshawcomm.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/the-nhp-foundation-names-karen-caldwell-cfotreasurer-300584007.html\nSOURCE The NHP Foundation", "external_links": ["http://www.nhpfoundation.org/", "http://www.prnewswire.com/news-releases/the-nhp-foundation-names-karen-caldwell-cfotreasurer-300584007.html"], "published": "2018-01-17T19:59:00.000+02:00", "crawled": "2018-01-17T21:28:22.000+02:00", "highlightTitle": ""}