{"organizations": [], "uuid": "225672a14487d1dc72eb83c3103ee7e0f60e70fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-shutterfly-inc-announces-definitive-agreement-to-acquire-privately-held-lifetouch.html", "country": "US", "domain_rank": 767, "title": "Shutterfly Inc. Announces Definitive Agreement to Acquire Privately-Held Lifetouch", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:03:00.000+02:00", "replies_count": 0, "uuid": "225672a14487d1dc72eb83c3103ee7e0f60e70fe"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-shutterfly-inc-announces-definitive-agreement-to-acquire-privately-held-lifetouch.html", "ord_in_thread": 0, "title": "Shutterfly Inc. Announces Definitive Agreement to Acquire Privately-Held Lifetouch", "locations": [], "entities": {"persons": [{"name": "lifetouch", "sentiment": "negative"}], "locations": [{"name": "shutterfly", "sentiment": "none"}, {"name": "redwood city", "sentiment": "none"}, {"name": "lifetouch", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "acquire privately-held lifetouch combination", "sentiment": "negative"}, {"name": "shutterfly inc", "sentiment": "neutral"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Combination significantly expands customer base and product range Lifetouch achieved revenue of $963.9 million and EBITDA of $111.3 million for the period ended June 30, 2017 Acquisition adds significant Revenue, Adjusted EBITDA, and Cash Flow in the next twelve months with attractive future revenue and cost synergies Combined company total Adjusted EBITDA of at least $450 million targeted in 2020 Conference call scheduled for January 30, 2018 at 2:00 p.m. Pacific Time (5:00 p.m. Eastern Time) to discuss the acquisition and Shutterfly’s fourth quarter and full year 2017 financial results\nREDWOOD CITY, Calif.--(BUSINESS WIRE)-- Shutterfly (NASDAQ: SFLY), the leading online retailer and manufacturer of high-quality personalized products and services, and Lifetouch, the national leader in school photography, today announced a definitive agreement for Shutterfly to acquire privately-held Lifetouch for $825 million in cash.\n“Shutterfly and Lifetouch, two undisputed leaders in their respective industries, are both built around the mission of helping customers share life’s joy through photos,” said Christopher North, President & Chief Executive Officer of Shutterfly. “The two companies are uniquely well suited for one another, with similar target customers as well as complementary manufacturing capabilities. Most exciting of all is the potential to bring together Lifetouch’s unique access to millions of families who value high-quality photographic portraits with Shutterfly’s cloud photo management, product breadth, and product creation capabilities. Together, the two companies will accelerate each other’s respective strategies, driving shareholder value through consumer growth and significant incremental profits and cash flow. We’re excited to welcome the Lifetouch team to the Shutterfly family.”\nLifetouch is the clear leader in school photography. The company photographs more than 25 million children annually during the cherished fall picture day tradition, serving more than 10 million households, including more than one million new kindergarten households annually, across more than 50,000 schools. In Lifetouch’s fiscal year ended June 30, 2017, Lifetouch revenue was $963.9 million, and EBITDA was $111.3 million (audited).\nLifetouch provides Shutterfly with a highly complementary business. Shutterfly expects to gain access to many Lifetouch customers as Shutterfly customers, where they will benefit from Shutterfly’s leading cloud-photo management service, product creation capabilities, mobile app, and broad product range. Lifetouch will be able to offer Shutterfly’s broader product range to the Lifetouch customer, as well as to accelerate the development of Lifetouch’s online platform. The companies also expect to realize significant supply chain, manufacturing, and fulfillment synergies over time.\n“I’m excited to join the Shutterfly team,” said Michael Meek, CEO of Lifetouch. “Shutterfly and Lifetouch have a common mission and a common culture. Similar to Shutterfly, Lifetouch has a large and loyal customer base, and a talented and dedicated team that are excited about the opportunities at the combined company. As Lifetouch continues to leverage technology to better serve our customers, Shutterfly’s capabilities across photo management, product creation, and ecommerce will accelerate this transformation.”\nThe Board of Directors of Shutterfly and the trustee of the Lifetouch ESOP both approved the acquisition, which remains subject to customary closing conditions, including regulatory approval. The companies expect the acquisition to close in the second quarter of 2018. Shutterfly will finance the acquisition with an incremental $825 million Term Loan B issuance. In connection with the acquisition, for the time being, Shutterfly will suspend its share repurchase program in favor of near-term de-levering.\nShutterfly expects the acquisition to result in approximately $935.0 million of additional Net revenues, and approximately $100.0 million of additional Adjusted EBITDA, in the twelve-month period following closing of the acquisition.\nWith this acquisition, the combined Company targets a minimum of $450 million of Adjusted EBITDA by 2020. For additional information on the components of this Adjusted EBITDA target, please see the presentation accompanying the Company’s conference call.\nMorgan Stanley & Co. LLC is serving as financial advisor to Shutterfly for the acquisition, and BMO Capital Markets is serving as financial advisor to Lifetouch Board Special Committee.\nConference Call\nManagement will discuss the acquisition and review Shutterfly’s fourth quarter 2017 financial results and its expectations for the first quarter and full year 2018 on a conference call on Tuesday, January 30, 2018 at 2:00 p.m. Pacific Time (5:00 p.m. Eastern Time). To listen to the call and view the accompanying slides, please visit http://www.shutterflyinc.com . In the Investor Relations area, click on the link provided for the webcast, or dial (888) 243-4451 or (412) 542-4135, and ask to be to be joined into the Shutterfly call. The webcast will be archived and available at http://www.shutterflyinc.com in the Investor Relations section. A replay of the conference call will be available through Tuesday, February 13, 2018. To hear the replay, please dial (877) 344-7529 or (412) 317-0088 and enter access code 10116000.\nAbout Non-GAAP Financial Measure\nThis press release contains a non-GAAP financial measure (adjusted EBITDA). We have not reconciled our combined company non-GAAP Adjusted EBITDA target of $450 million for 2020 and Lifetouch non-GAAP Adjusted EBITDA of $100 million for the twelve-month period following closing of the acquisition to comparable GAAP operating income at this stage of the process because it is unreasonably difficult to provide guidance for stock-based compensation expense, capitalization and amortization of internal-use software and charges related to the proposed acquisition, which are reconciling items between GAAP operating loss and non-GAAP Adjusted EBITDA. The factors that may impact our future stock-based compensation expense and capitalization and amortization of internal-use software are out of our control and/or cannot be reasonably predicted, and therefore we are unable to provide such guidance without unreasonable effort. Factors include our market capitalization and related volatility of our stock price and our inability to project the cost or scope of internally-produced software and charges related to the proposed acquisition during this time period.\nTo supplement the Company's consolidated financial statements presented on a GAAP basis, we believe that this non-GAAP measure provides useful information about the Company's core operating results. We believe this measure provides both management and investors a more complete understanding of the Company's underlying operational results and trends and performance. The method we use to produce this measure may differ from the methods used by other companies. The presentation of additional information is not meant to be considered in isolation or as a substitute for measures in accordance with GAAP. For more information, please see Shutterfly's SEC Filings, including the most recent Form 10-K and Form 10-Q, which are available on the Securities and Exchange Commission's Web site at www.sec.gov .\nNotice Regarding Forward-Looking Statements\nThis media release contains “forward-looking” statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which involve risks and uncertainties. These include the expected financial impact (including revenue, Adjusted EBITDA and cash flow of the proposed transaction); the anticipated revenue and cost synergies; minimum Adjusted EBITDA targets for 2020 and expected Adjusted EBITDA targets for the twelve months following closing; the expected acceleration of Shutterfly and Lifetouch strategies, expectations around gaining access to Lifetouch customers and benefits to Shutterfly customers; anticipated acceleration of the development of Lifetouch’s online platform; and expected supply chain, manufacturing and fulfillment synergies over time. You can identify these statements by the use of terminology such as “guidance”, “believe”, “expect”, “will”, “should,” “could”, “estimate”, “anticipate” or similar forward-looking terms. You should not rely on these as they involve risks and uncertainties that may cause actual results to vary materially from the . Factors that might contribute to such differences include, among others, the possibility that the closing conditions to the proposed Lifetouch acquisition may not be satisfied or waived, including that a governmental entity may prohibit, delay or refuse to grant a regulatory approval; delay in closing the Lifetouch acquisition or the possibility of non-consummation of the transaction; the risk of stockholder litigation in connection with contemplated Lifetouch Acquisition; the retention of Lifetouch employees and our ability to successfully integrate the Lifetouch businesses; risks inherent in the achievement of anticipated synergies and the timing thereof; general economic conditions and changes in laws and regulations; decreased consumer discretionary spending as a result of general economic conditions; our ability to expand our customer base and increase sales to existing customers; our ability to meet production requirements; our ability to retain and hire necessary employees, including seasonal personnel, and appropriately staff our operations; the impact of seasonality on our business; our ability to develop innovative, new products and services on a timely and cost-effective basis; failure to realize the anticipated benefits of our 2017 restructuring activities; consumer acceptance of our products and services; our ability to develop additional adjacent lines of business; unforeseen changes in expense levels; and competition and the pricing strategies of our competitors, which could lead to pricing pressure. For more information regarding the risks and uncertainties that could cause actual results to differ materially from those expressed or implied in these , as well as risks relating to our business in general, we refer you to the “Risk Factors” section of our SEC filings, including our most recent Form 10-K and 10-Q, which are available on the Securities and Exchange Commission’s website at www.sec.gov . These are based on current expectations and the company assumes no obligation to update this information.\nAbout Shutterfly, Inc.\nShutterfly, Inc. is the leading online retailer and manufacturer of high-quality personalized products and services. Founded in 1999, the Shutterfly, Inc. brands includes Shutterfly ®, where your photos come to life in photo books, gifts, and cards and stationery - with premium offerings in its Tiny Prints ® boutique - as well as wedding invitations and stationery for every step of the planning process; BorrowLenses ®, the premier online marketplace for photographic and video equipment rentals; and GrooveBook ™, an iPhone and Android app and subscription service that prints up to 100 mobile phone photos in a GrooveBook and mails it to customers every month. For more information about Shutterfly, Inc. ( SFLY ), visit www.shutterflyinc.com .\nAbout Lifetouch\nFor over 80 years, Lifetouch has been the professional photography choice for schools and families. Headquartered in Eden Prairie, MN., Lifetouch is 100% employee owned. Built on the tradition of “Picture Day,” Lifetouch School Photography captures smiling faces, kindergarten through high school graduation. Product lines include sports, events, seniors and yearbooks. Lifetouch Portrait Studios leads the company’s retail presence in JCPenney Portraits studios. Lifetouch Church Photography connects church membership through family photography and printed and mobile pictorial directories. Lifetouch Preschool Photography is the preferred provider of infant and toddler photography from coast to coast. iMemories, a Lifetouch company, serves as a solution for digital transfer of home movies and images into cloud storage where they can be easily viewed, shared, and enjoyed on all modern devices.\nLifetouch, Inc.\nReconciliation of Operating Income to EBITDA\n(In millions)\n(Unaudited)\nTwelve months ended\nJune 30, 2017\nOperating Income (Loss) $ (3.9 ) Depreciation 37.3 Amortization of Intangible Assets 5.3 Contributions to ESOP and Retirement Plans 72.6 EBITDA $ 111.3\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006286/en/\nShutterfly, Inc.\nInvestor Relations:\nShawn Tabak, 650-610-6026\nstabak@shutterfly.com\nor\nMedia Relations:\nNicole Stier, 650-610-6013\nnstier@shutterfly.com\nSource: Shutterfly, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.shutterfly.com%2Ftinyprints&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=Tiny+Prints&index=6&md5=c001c42028f28ab05e78ff2757a3c248", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ffinance.yahoo.com%2Fquote%2Fsfly%3Fltr%3D1&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=SFLY&index=11&md5=41ec015448da07666ef0ccce621975bf", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.shutterfly.com%2F&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=Shutterfly&index=5&md5=303b2d8741732c5beb46b3cf8e163075", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fitunes.apple.com%2Fus%2Fapp%2Fgroovebook%2Fid561452319%3Fl%3Dde%26ls%3D1%26mt%3D8&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=iPhone&index=9&md5=94070e62c4456606f7bb448cf67363dd", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.shutterflyinc.com&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=www.shutterflyinc.com&index=12&md5=d9be18c1adbceed49312befe89919dfe", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=www.sec.gov&index=4&md5=ec88d757576f0cbfa8928097dd47fe7c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=www.sec.gov&index=3&md5=3f1e2fa15ed9caa9aa33736c557587ce", "http://www.businesswire.com/news/home/20180130006286/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.shutterflyinc.com&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=http%3A%2F%2Fwww.shutterflyinc.com&index=1&md5=4a19ceca0fb3397d75a84de3fb998ac6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fplay.google.com%2Fstore%2Fapps%2Fdetails%3Fid%3Dcom.photoupload%26hl%3Den_GB&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=Android&index=10&md5=23592eff4dc74636cbf85a9a57701112", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.shutterflyinc.com&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=http%3A%2F%2Fwww.shutterflyinc.com&index=2&md5=fdc836922eb0308c80dc7ea70748ff49", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.borrowlenses.com%2F&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=BorrowLenses&index=7&md5=bdaa7845ff8181b8c922af7017bd1154", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.groovebook.com%2F&esheet=51750699&newsitemid=20180130006286&lan=en-US&anchor=GrooveBook&index=8&md5=2f4a021bfcd372070f718332a5bd5aaf"], "published": "2018-01-31T00:03:00.000+02:00", "crawled": "2018-01-31T03:07:28.001+02:00", "highlightTitle": ""}