{"organizations": [], "uuid": "2aa1ea644ca8215a1943e26534de86aee3d0c5fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218983873&w=1200&r=LYNXMPEE0208H", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-next-outlook/uks-next-upgrades-profit-forecast-on-christmas-sales-beat-idUKKBN1ES0C2", "country": "US", "domain_rank": 408, "title": "UK's Next upgrades profit forecast on Christmas sales beat​", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T09:16:00.000+02:00", "replies_count": 0, "uuid": "2aa1ea644ca8215a1943e26534de86aee3d0c5fc"}, "author": "", "url": "https://uk.reuters.com/article/uk-next-outlook/uks-next-upgrades-profit-forecast-on-christmas-sales-beat-idUKKBN1ES0C2", "ord_in_thread": 0, "title": "UK's Next upgrades profit forecast on Christmas sales beat​", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 7:16 AM / Updated 8 minutes ago Happy Christmas for Next spreads cheer among UK clothing retailers James Davey 5 Min Read \nLONDON (Reuters) - British clothing chain Next ( NXT.L ) reported better-than-expected Christmas sales, helped by colder weather, sending shares across the sector higher on hopes other retailers have defied forecasts for gloomy festive trading. FILE PHOTO: A woman shelters beneath an umbrella as she walks past a branch of Next in Manchester, Britain September 21, 2017. REUTERS/Phil Noble/File Photo \nNext shares were up 7.4 percent at 1230 GMT on Wednesday after it also raised its full-year profit forecast, while shares in rivals Marks & Spencer ( MKS.L ) and Primark owner Associated British Foods ( ABF.L ) gained 1.5 and 2.2 percent respectively. \nWith Britain’s consumers being squeezed by slow wage growth and the jump in inflation that followed the 2016 Brexit vote, expectations for Christmas spending had been subdued. \nHowever, Next, the first major listed retailer to update on festive trading, reported full price sales growth of 1.5 percent in the 54 days to Dec. 24, a period covering the bulk of its financial fourth quarter. \nThat beat company guidance for a fall of 0.3 percent and follows third quarter growth of 1.3 percent. Growth in online sales more than compensated for lower sales in stores. \n“We have long believed that conditions were not as bad as many believed for the consumer and we expect the next few weeks’ statements to show that companies with the right offer can do very well,” said analysts at Peel Hunt. \nSeparately on Wednesday department store John Lewis [JLPLC.UL] reported strong trading in the week to Dec. 23, with total sales up 8.9 percent. It enjoyed its biggest ever week for fashion sales. \nNext CEO Simon Wolfson told Reuters he was “a lot more confident” about the retailer’s prospects than he was a year ago when the company issued a profit warning. \nNext trades from more than 500 stores in the UK and Ireland and operates the Directory internet and home shopping business. \nIt had been Britain’s most successful clothing retailer this century in terms of profits but has faltered over the last two years due to a shift in spending away from clothing towards holidays and entertainment. Its shares had fallen 7 percent over the last year prior to Wednesday’s update. KEEPING FAITH WITH STORES Slideshow (2 Images) \nCEO Wolfson cautioned that many of the issues Next faced over the last 12 months would linger in 2018. \nSubdued UK consumer demand driven by a decline in real income and the shift to spending on leisure at the expense of clothing remained major challenges, said Wolfson. \nBut he said cost price inflation would reduce to 2 percent in the first half of its 2018-19 year and disappear in the second half. \nThe Next figures illustrated the contrasting fortunes of trading in its stores and online. Sales at stores fell 6.1 percent but online sales were up 13.6 percent. \nThose numbers will fuel the debate over Next’s strategy of continuing to add retail space. \nNext’s first half results, published in September, showed 53 percent of total sales from stores and the balance from online. \nNext is still expanding its store base, with plans for up to 200,000 square feet of additional space in 2018-19. It believes that even if shops become less productive, they will not make losses. \nWolfson said that even if retail like-for-like sales were falling by 10 percent, the stores would remain an asset. \n“What we’ve had to get our heads around is the idea that you can invest in a shop today that will make less profit in year 10 than it does in year one but because you get your money back in two years it’s still a very good investment,” he said. \nNext upgraded its central pretax profit guidance for 2017-18 to 725 million pounds, up from previous guidance of 717 million pounds but well below the 790.2 million pounds made in 2016-17. \nNext forecast full price sales growth of about 1 percent in the 2018-19 year and another fall in profit to 705 million pounds, with costs growing faster than sales. That outcome would be a third straight year of profit decline. \nBut Next also flagged a 300 million pounds share buyback in 2018-19 that would boost earnings per share. Editing by Kate Holton and Keith Weir", "external_links": [], "published": "2018-01-03T09:16:00.000+02:00", "crawled": "2018-01-03T09:34:40.004+02:00", "highlightTitle": ""}