{"organizations": [], "uuid": "794c138c23f0a8cfdf308bccf9014142dfe67678", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-mamamancinis-holdings-files-8-ka-on-recent-joseph-epstein-foods-enterprises-inc-acquisition.html", "country": "US", "domain_rank": 767, "title": "MamaMancini's Holdings Files 8-K/A on Recent Joseph Epstein Foods Enterprises, Inc. Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.808, "site_type": "news", "published": "2018-01-27T01:10:00.000+02:00", "replies_count": 0, "uuid": "794c138c23f0a8cfdf308bccf9014142dfe67678"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-mamamancinis-holdings-files-8-ka-on-recent-joseph-epstein-foods-enterprises-inc-acquisition.html", "ord_in_thread": 0, "title": "MamaMancini's Holdings Files 8-K/A on Recent Joseph Epstein Foods Enterprises, Inc. Acquisition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "recent joseph epstein foods enterprises, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "joseph epstein foods enterprises, inc.", "sentiment": "none"}, {"name": "jefe", "sentiment": "none"}, {"name": "united states department of agriculture", "sentiment": "none"}, {"name": "holdings, inc.", "sentiment": "none"}, {"name": "operations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reaffirms Revenue and Earnings Goal Guidance\nEast Rutherford, NJ, Jan. 26, 2018 (GLOBE NEWSWIRE) -- MamaMancini's Holdings, Inc. (OTCQB: MMMB ), a marketer of specialty pre-prepared, frozen and refrigerated all-natural food products (as defined by the United States Department of Agriculture), today issued a Current Report on Form 8-K/A which includes the results of the recently-acquired Joseph Epstein Foods Enterprises, Inc. (JEFE) on a consolidated basis with the Company. As previously announced, the acquisition of JEFE occurred on November 1, 2017.\nThe Pro Forma Combined Statement of Operations indicates that Gross Profit would have increased by 2% of sales on a combined basis (compared to the results previously reported by the Company). On a combined basis consolidated net income for the nine- month period would have been $206,149.\nThe results of JEFE reflect a higher cost of goods sold than previously estimated by the Company in its initial analysis. Management believes that, going forward, the cost of goods sold for the combined Companies will be lower as a percentage of sales in future quarters compared to the pro forma results of the combined companies reflected as of October 10, 2017.\nCompany management has previously stated their belief that the JEFE merger will be accretive by approximately $1,500,000 in the 12 months commencing November 1, 2017. Company management maintains that belief.\nCompany management also believes that their indicated goal of an annualized sales run rate of $40,000,000 can be achieved over the next several months and that an EBITDA run rate of $5,500,000 to $6,000,000 can be achieved within the same period.\nFinally, Company management maintains its belief that the Company can achieve its goal of an $8,000,000 annualized EBITDA run rate once its annualized sales goal of $50,000,000 is achieved. Company management's goal is to achieve this by mid to late fiscal year 2019. The foregoing represents Company management’s goal and should not be deemed to be or interpreted as a projection.\nCompany management continually reviews the Company’s ongoing operations and goals. Obviously, the goals stated are based upon management's analysis of present and future operations and are subject to change in the future.\nAbout MamaMancini's\nMamaMancini's is a marketer and distributor of a line of beef meatballs and turkey meatballs all with sauce; five cheese stuffed beef and turkey meatballs all with sauce; original beef and turkey meatloaves; chicken parmesan; stuffed peppers and other similar Italian cuisine products. The Company's sales have been growing on a consistent basis as the Company expands its distribution channel; which includes major retailers and distributors such as Costco; Publix; Shop Rite; Jewel; Save Mart; Sam’s Club; Lucky's; Lunds and Byerlys; SuperValu; Safeway; Albertsons; Spartan Nash; Whole Foods Market; Hy-Vee; Shaw's; Kings; Roche Bros.; Key Foods; Stop & Shop; Giant; Giant Eagle; Foodtown; Kroger; Shoppers; Schnucks Markets; Fresh Direct; King Kullen; Lowes; Central Market; Weis Markets; Ingles; Food City; The Fresh Market; Market Basket; Meatball Obsession; Monterrey Provisions; Porky Products; Sysco; DPI; United Natural Foods; Bozzutos; Burris Foods; and C&S. The Company sells a variety of its products on air and on line on QVC; the world’s largest direct to consumer marketer.\nForward Looking Statements\nThis press release may contain \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934. \"Forward-looking statements\" describe future expectations, plans, results, or strategies and are generally preceded by words such as \"may,\" \"future,\" \"plan\" or \"planned,\" \"will\" or \"should,\" \"expected,\" \"anticipates,\" \"draft,\" \"eventually\" or \"projected.\" You are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances, events, or results to differ materially from those projected in the forward-looking statements, including the risks that actual results may differ materially from those projected in the forward-looking statements as a result of various factors, and other risks identified in the Company's 10-K for the fiscal year ended January 31, 2016 and other filings made by the Company with the Securities and Exchange Commission.\nContact: Carl Wolf Chairman and CEO MamaMancini’s Holdings, Inc. Stock Symbol: MMMB 973-985-0280 www.mamamancinis.com carl@mamamancinis.com\nSource:MamaMancini's Holdings, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/26c8e266-5759-4f17-9283-f729629b1650"], "published": "2018-01-27T01:10:00.000+02:00", "crawled": "2018-01-27T02:06:38.003+02:00", "highlightTitle": ""}