{"organizations": [], "uuid": "36eb0dba7192f3a5342b60a92d367fae02c4c724", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/10/104835514-Greys_Anatomy.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/why-the-us-spends-so-much-more-than-other-nations-on-health-care.html", "country": "US", "domain_rank": 767, "title": "Why the US spends so much more than other nations on health care", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T20:08:00.000+02:00", "replies_count": 0, "uuid": "36eb0dba7192f3a5342b60a92d367fae02c4c724"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/why-the-us-spends-so-much-more-than-other-nations-on-health-care.html", "ord_in_thread": 0, "title": "Why the US spends so much more than other nations on health care", "locations": [], "entities": {"persons": [{"name": "gerard anderson", "sentiment": "none"}, {"name": "peter hussey", "sentiment": "none"}, {"name": "varduhi petrosyan", "sentiment": "none"}, {"name": "ashish jha", "sentiment": "none"}, {"name": "uwe reinhardt", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}], "organizations": [{"name": "princeton university", "sentiment": "none"}, {"name": "harvard t.h. chan school of public health", "sentiment": "none"}, {"name": "harvard global health institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The United States spends almost twice as much on health care, as a percentage of its economy, as other advanced industrialized countries — totaling $3.3 trillion, or 17.9 percent of gross domestic product in 2016.\nBut a few decades ago American health care spending was much closer to that of peer nations.\nWhat happened?\nA large part of the answer can be found in the title of a 2003 paper in Health Affairs by the Princeton University health economist Uwe Reinhardt: \" It's the prices, stupid. \"\nMore from The New York Times: \nWhat we mean when we say evidence-based medicine \nThe leap to single-payer: What Taiwan can teach \nWhy new blood pressure guidelines could lead to harm \nThe study, also written by Gerard Anderson, Peter Hussey and Varduhi Petrosyan, found that people in the United States typically use about the same amount of health care as people in other wealthy countries do, but pay a lot more for it.\nAshish Jha, a physician with the Harvard T.H. Chan School of Public Health and the director of the Harvard Global Health Institute, studies how health systems from various countries compare in terms of prices and health care use. \"What was true in 2003 remains so today,\" he said. \"The U.S. just isn't that different from other developed countries in how much health care we use. It is very different in how much we pay for it.\"\nA recent study in JAMA by scholars from the Institute for Health Metrics and Evaluation in Seattle and the U.C.L.A. David Geffen School of Medicine also points to prices as a likely culprit. Their study spanned 1996 to 2013 and analyzed U.S. personal health spending by the size of the population; its age; and the amount of disease present in it.\nThey also examined how much health care we use in terms of such things as doctor visits, days in the hospital and prescriptions. They looked at what happens during those visits and hospital stays (called care intensity), combined with the price of that care.\nshow chapters How to eat without going broke      1:46 PM ET Thu, 15 June 2017 | 01:03 The researchers looked at the breakdown for 155 different health conditions separately. Since their data included only personal health care spending, it did not account for spending in the health sector not directly attributed to care of patients, like hospital construction and administrative costs connected to running Medicaid and Medicaid.\nOver all, the researchers found that American personal health spending grew by about $930 billion between 1996 and 2013, from $1.2 trillion to $2.1 trillion (amounts adjusted for inflation). This was a huge increase, far outpacing overall economic growth. The health sector grew at a 4 percent annual rate, while the overall economy grew at a 2.4 percent rate.\nYou'd expect some growth in health care spending over this span from the increase in population size and the aging of the population. But that explains less than half of the spending growth. After accounting for those kinds of demographic factors, which we can do very little about, health spending still grew by about $574 billion from 1996 to 2013.\nDid the increasing sickness in the American population explain much of the rest of the growth in spending? Nope. Measured by how much we spend, we've actually gotten a bit healthier. Change in health status was associated with a decrease in health spending — 2.4 percent — not an increase. A great deal of this decrease can be attributed to factors related to cardiovascular diseases, which were associated with about a 20 percent reduction in spending.\nThis could be a result of greater use of statins for cholesterol or reduced smoking rates, though the study didn't point to specific causes. On the other hand, increases in diabetes and low back and neck pain were associated with spending growth, but not enough to offset the decrease from cardiovascular and other diseases.\nDid we spend more time in the hospital? No, though we did have more doctor visits and used more prescription drugs. These tend to be less costly than hospital stays, so, on balance, changes in health care use were associated with a minor reduction (2.5 percent) in health care spending.\nThat leaves what happens during health care visits and hospital stays (care intensity) and the price of those services and procedures.\nshow chapters Buffett says it's a mistake for Trump to end the estate tax—here's how it could affect you      4:54 PM ET Tue, 3 Oct 2017 | 01:06 Did we do more for patients in each health visit or inpatient stay? Did we charge more? The JAMA study found that, together, these accounted for 63 percent of the increase in spending from 1996 to 2013. In other words, most of the explanation for American health spending growth — and why it has pulled away from health spending in other countries — is that more is done for patients during hospital stays and doctor visits, they're charged more per service, or both.\n\nThough the JAMA study could not separate care intensity and price, other research blames prices more. For example, one study found that the spending growth for treating patients between 2003 and 2007 is almost entirely because of a growth in prices, with little contribution from growth in the quantity of treatment services provided.", "external_links": [], "published": "2018-01-02T20:08:00.000+02:00", "crawled": "2018-01-02T21:03:40.007+02:00", "highlightTitle": ""}