{"organizations": [], "uuid": "31ad3f354c57c9f0e19535555663e57580bcb077", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/03/the-associated-press-white-house-lawmakers-hopeful-after-positive-budget-talks.html", "country": "US", "domain_rank": 767, "title": "White House, lawmakers hopeful after 'positive' budget talks", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T22:42:00.000+02:00", "replies_count": 0, "uuid": "31ad3f354c57c9f0e19535555663e57580bcb077"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/03/the-associated-press-white-house-lawmakers-hopeful-after-positive-budget-talks.html", "ord_in_thread": 0, "title": "White House, lawmakers hopeful after 'positive' budget talks", "locations": [], "entities": {"persons": [{"name": "chuck schumer", "sentiment": "none"}, {"name": "ryan", "sentiment": "none"}, {"name": "nancy pelosi", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "mick mulvaney", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "r-wis.", "sentiment": "none"}, {"name": "d-n.y.", "sentiment": "none"}, {"name": "d-calif.", "sentiment": "none"}, {"name": "r-ky.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "positive"}, {"name": "ap", "sentiment": "positive"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "pentagon", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The White House and top congressional leaders from both major parties issued upbeat assessments Wednesday after a Capitol Hill meeting in which they forged progress on a stack of unfinished Washington business, starting with a hoped-for bipartisan budget deal.\nThe session in the office of House Speaker Paul Ryan, R-Wis., came with little more than two weeks before the next threatened government shutdown. Topping the agenda was an effort to spare both the Pentagon and domestic Cabinet agencies from spending cuts. Other issues, including immigration, disaster aid, and health care, were also discussed in hopes of resolving the raft of leftover issues, which could be a prelude to moving on to new business such as President Donald Trump's overdue infrastructure plan.\nBoth sides issued bland but positive statements after the session, which lasted more than an hour and included White House budget director Mick Mulvaney.\n\"We had a positive and productive meeting and all parties have agreed to continue discussing a path forward to quickly resolve all of the issues ahead of us,\" said Sen. Chuck Schumer, D-N.Y., and Rep. Nancy Pelosi, D-Calif., in a joint statement.\nThe White House, Ryan and Senate Majority Leader Mitch McConnell, R-Ky., said in a joint statement of their own that they \"hope that further discussions will lead to an agreement soon.\" McConnell briefed fellow Republicans afterward and told them the session was \"surprisingly good,\" according to Sen. John Cornyn, R-Texas.\nSen. Roy Blunt, R-Mo., said, \"I don't think they reached any conclusions, but I think it was a fairly good meeting is what we were told.\"\nThe budget debate has been roiled by a demand from Democrats that nondefense programs win increases equal to those to be awarded to the Pentagon. That was a feature of prior budget pacts in 2013 and 2015 that were negotiated during the tenure of President Barack Obama.\nNow, with Trump in the Oval Office, Republicans insist that this idea of parity between guns and butter belongs on the scrap heap.\n\"We need to set aside the arbitrary notion that new defense spending be matched equally by new nondefense spending,\" McConnell said earlier in the day. \"There is no reason why funding for our national security and our service members should be limited by an arbitrary political formula that bears no relationship to actual need.\"\nBut unlike the recently passed tax bill and the GOP's failed efforts to repeal the Obama-era health care law, the upcoming agenda will require votes from Democrats. Bipartisanship has been in scarce supply under Trump, and heading into the session, spokesmen for Ryan and Schumer were not banking on a breakthrough.\nThe budget battle is but one element of a tricky Washington matrix facing the White House, its GOP allies and Democratic rivals like Schumer.\nParticularly challenging is the question of immigrants who were brought to the country illegally as children but who face deportation in March because of Trump's decision to strip away Obama-issued protections for them.\nDemocrats say they won't go along with any budget deal until those immigrants, commonly referred to as Dreamers, are guaranteed protections. That has sparked pushback from GOP leaders who have refused to cede leverage to Democrats and insist on dealing with politically nettlesome immigration issues on a separate track.\nCornyn told reporters that he and other Republicans on the Judiciary panel, which has jurisdiction over immigration, are meeting with Trump at the White House on Thursday to discuss the issue.\n\"I think there's plenty of goodwill and interest in trying to come up with a solution, but we're not quite there yet,\" Cornyn said, adding that GOP negotiators want a better sense from Trump about what he will support to better inform further talks with Democrats.\nRep. Tom Graves, R-Ga., said the president has made clear that immigration is an important issue he wants Congress to tackle.\n\"Our leadership's made it clear, and I agree with them, that this is not something that is negotiated as part of a spending package, but it is a separate issue that should merit debate and discussion aside from the spending discussion,\" Graves said.\nThe statement from Republicans said Democrats should \"not hold funding for our troops hostage for immigration policy.\"\nLess partisan is a leftover disaster-aid bill and renewal of a children's health insurance program that has sweeping bipartisan backing.\n\"I hope this year can be one of bipartisanship focused on improving the stock of the middle class,\" Schumer said. \"We can start on the budget, with opioids, and veterans' health care and pensions. With children's health insurance and disaster aid. And we can resolve the fate of the Dreamers, and say to these hardworking kids that America has a place for them, too.\"", "external_links": [], "published": "2018-01-03T22:42:00.000+02:00", "crawled": "2018-01-04T01:08:29.015+02:00", "highlightTitle": ""}