{"organizations": [], "uuid": "6617f7f97d3e1ce4b7d0831102cab49fa30f343e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-461394769.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/kodak-cryptocurrency-kodakcoin-stock/", "country": "US", "domain_rank": 1196, "title": "Commentary: Buy Kodak Stock, Not Kodak Cryptocurrency | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "6617f7f97d3e1ce4b7d0831102cab49fa30f343e"}, "author": "Stephan Goss", "url": "http://fortune.com/2018/01/18/kodak-cryptocurrency-kodakcoin-stock/", "ord_in_thread": 0, "title": "Commentary: Buy Kodak Stock, Not Kodak Cryptocurrency | Fortune", "locations": [], "entities": {"persons": [{"name": "stephan goss", "sentiment": "negative"}, {"name": "ko", "sentiment": "none"}], "locations": [], "organizations": [{"name": "kodak stock", "sentiment": "negative"}, {"name": "kodak", "sentiment": "negative"}, {"name": "kodakcoin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Stephan Goss January 18, 2018 \nKodak, once the iconic brand of pre-digital photography, just announced it will launch its own cryptocurrency: KodakCoin. So far, however, it has released very limited information about how this venture will work. Meaningful detail is at a premium on the Kodak website , and to call what we have seen so far “vague” is being generous. That makes it tough to determine whether this is a serious effort on Kodak’s part or if the company is simply trying to drive up its stock price. \nIf it is the latter, it certainly succeeded, at least initially. In what may be the stock’s first “Kodak moment” in many years, its share price shot up almost 250% within two days of the announcement. \nSo, should you buy into the hype and purchase Kodak stock, or should you go short in anticipation of this hype dying quickly? Let’s do a quick analysis. (Disclaimer: This is an analysis of the obvious use case. Kodak has given no indication that this is what it is actually planning. It may have a bunch of other stuff up its sleeve.) \nFirst off, the idea: From what we can tell, Kodak (KODK) plans to build a digital rights management platform—dubbed KODAKOne—that will utilize blockchain technology and continually crawl the web to monitor and protect the IP of images registered to the system. Photographers will be able to upload their pictures and get them securely watermarked using a cryptographic hash that will then be immortalized on the blockchain. Presumably, the system will allow photographers to sell their pictures or, at the very least, enforce against unauthorized use. \nQuite frankly, this business model, unlike that of many other ICOs, is a legitimately good application of blockchain technology. Having a clear chain of custody of digital rights to an image that includes who took it, who bought it and with which rights, etc., has been a longstanding problem for professional photographers. And it just happens to be a problem that can be very elegantly solved on the blockchain. \nSo for argument’s sake, let’s say Kodak has figured out the idea and the supporting tech perfectly, and it really is the bee’s knees. The next obvious question is whether or not there is a viable market for what it’s offering. \nI think “yes” is a reasonable answer, as this product would compete with iStock (Getty Images’ value offering) and many other marketplaces that sell rights to images. \nOne such marketplace is Shutterstock (SSTK) , a public company with $494 million in 2016 revenue and a market cap of $1.5 billion. Kodak, on the other hand, does $1.5 billion in annual revenue and has a $455 million market cap. That’s quite the difference in multiples. Clearly, the market likes digital rights management companies better than film companies. Just as clearly, there is revenue to be generated in digital rights management. \nNow to the biggest question: Can Kodak execute and actually build this product? I don’t see Kodak having much advantage when it comes to executing in this space. In fact, its size and corporate culture may well be obstacles, not advantages. \nOn the upside, Kodak has a real board, substantial backing, and a management team that can probably be trusted not to squander the money. Those are all huge pluses in my book, and most other ICOs don’t have them. I’d say the Kodak team structure is a plus. \nOne undeniable challenge Kodak will face is that there is a lot of competition in the space it is entering, and the brand does not have a strong foothold there. I think the blockchain will add incremental usefulness to its product as compared to competitors like iStock, but I don’t see it being a total game changer. To really have a shot at dominating this market, Kodak will have to excel at many other things not related to blockchain, especially building a community and network effect around this brand new product. \nNow, if Kodak were to go out and buy an existing online photo rights management platform (which it now may be able to afford, thanks to its recent stock pop), I’d be more bullish on the stock. All in all, however, this is a brand new business strategy for Kodak—one that comes with immense challenges. Not only does the company have to build some rather innovative tech in a space that will almost certainly attract more-nimble competitors, it also has to pull that off while dealing with a corporate structure that, based on past experience, is likely to be very slow-moving. \nSo, besides the stock implications, what will KodakCoin be worth? If the current market is any barometer, it will be worth a lot—completely unreasonably a lot compared to the market opportunity (chances are, many, many times more than all of Kodak’s stock, at least in the short run). Since Kodak is likely to issue itself many coins on issuance, like most ICOs do, its most valuable asset post-ICO will likely be its holdings of KodakCoin—even if no platform has been built and there is no MVP (minimum viable product) or anything else. Such is the current market climate in the crypto space. \nWould I buy KodakCoin? Almost definitely not, as I doubt the valuation will be what I’d consider reasonable. Would I buy Kodak stock? Maybe, and certainly before I’d buy the coin. If you are looking for what promises to be a huge money-making opportunity and you are comfortable attempting to time the market based on absolutely no fundamentals, this stock will likely explode in the short run. So put on your gambling pants and go for it. Just know that this change in stock price makes no sense, although that doesn’t make it any less real. \nLong story short, this is definitely one of the less-silly ICOs out there. A real company with an experienced team, a good idea and limited chance of fraud definitely exceeds the quite-low bar other ICOs have set. \nStephan Goss is president and CEO of Zeeto . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-20T05:18:33.017+02:00", "highlightTitle": ""}