{"organizations": [], "uuid": "61eef6d6611f2cbf3795aafac4a93f9205aece3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/technology", "section_title": "Technology News | Reuters.com", "url": "https://www.reuters.com/article/us-italy-autos-snam-it/italian-grid-operator-snam-shows-way-by-converting-car-fleet-to-natural-gas-idUSKBN1ES1F3", "country": "US", "domain_rank": 408, "title": "Italian grid operator Snam shows way by converting car fleet to natural gas", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:22:00.000+02:00", "replies_count": 0, "uuid": "61eef6d6611f2cbf3795aafac4a93f9205aece3b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-italy-autos-snam-it/italian-grid-operator-snam-shows-way-by-converting-car-fleet-to-natural-gas-idUSKBN1ES1F3", "ord_in_thread": 0, "title": "Italian grid operator Snam shows way by converting car fleet to natural gas", "locations": [], "entities": {"persons": [{"name": "marco alvera", "sentiment": "none"}], "locations": [{"name": "milan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "snam", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILAN (Reuters) - Italian gas grid company Snam has launched a 33 million euro ($40 million) tender to convert its car fleet to natural gas in a sign of its commitment to develop gas fuelling stations in the country.\nThe move comes as utilities across Europe race to embrace the fast-growing business of rolling out charging stations to meet carmaker pledges to move fleets to electric drives.\nSnam, controlled by state lender CDP, said in a tender it had set a Feb. 16 deadline for bids from European companies to convert its 1,500 vehicle fleet to natural gas.\nThe supply contracts will be for three years, it said.\nEurope’s biggest gas pipeline operator has pledged to spend 150 million euros to build 300 new gas fuelling stations to beef up the country’s existing 1,100 points.\nItaly is the leading European market for natural gas-fuelled cars, with motorists guzzling more than 1 billion cubic meters in 2015 and about 1 million vehicles in circulation.\nSnam CEO Marco Alvera told Reuters that by adding more stations the market could expand to 2-3 million vehicles and would be able to complement electric cars.\n“I drive a hybrid car, and I think the future will be gas and electricity - plug-in hybrids,” he said.\nSnam is looking to play a key role in helping develop new gas infrastructure and technology for Italy’s transport sector including the use of liquefied natural gas to drive ships.\nIt has already inked deals with oil major Eni and leading petrol pump network API as well as carmaker Fiat Chrysler.\nFiat CEO Sergio Marchionne is one of the few car bosses who has largely resisted the plug-in vogue, signing a deal with Eni in November to study new gas fuels to reduce carbon emissions.\nSnam makes most of its money from gas transmission in Italy and Europe but under Alvera has been looking for ways to create new faster-growing businesses to attract investors.\nLast April it signed an agreement to help modernize Ukraine’s gas network.\n($1 = 0.8321 euros)\nReporting by Stephen Jewkes; Editing by Adrian Croft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T00:22:00.000+02:00", "crawled": "2018-01-03T19:43:58.009+02:00", "highlightTitle": ""}