{"organizations": [], "uuid": "f4e5920eb4b2a3307cf53df9486fe1cc4ff080ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-community-bank-reports-financial-results-for-2017-the-impact-of-the-tcja-and-a-0-point-50-per-share-dividend.html", "country": "US", "domain_rank": 767, "title": "Community Bank Reports Financial Results for 2017; The Impact of the TCJA; and a $0.50 Per Share Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T03:16:00.000+02:00", "replies_count": 0, "uuid": "f4e5920eb4b2a3307cf53df9486fe1cc4ff080ae"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-community-bank-reports-financial-results-for-2017-the-impact-of-the-tcja-and-a-0-point-50-per-share-dividend.html", "ord_in_thread": 0, "title": "Community Bank Reports Financial Results for 2017; The Impact of the TCJA; and a $0.50 Per Share Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "pasadena", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}, {"name": "pasadena", "sentiment": "none"}], "organizations": [{"name": "tcja", "sentiment": "neutral"}, {"name": "community bank reports financial results", "sentiment": "neutral"}, {"name": "community bank", "sentiment": "neutral"}, {"name": "bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PASADENA, Calif.--(BUSINESS WIRE)-- Community Bank (OTC:CYHT) (“Bank”), founded in 1945, is an independent Southern California regional community bank, with assets of $3.7 billion, and headquartered in Pasadena with 16 business centers.\nImpact of Tax Cuts and Jobs Act (TCJA):\nCommunity Bank recorded a $6.8 million or $1.95 per share one-time non-cash charge in the fourth quarter of 2017 as a result of the recently enacted TCJA. This charge results solely from the revaluation of our deferred tax assets. Based on information presently available, the Bank anticipates its Federal and state statutory income tax rate for 2018 and beyond to decline from approximately 42.1% to 29.6%.\nFinancial highlights:\nNet income was $26.7 million in 2017 compared with $26.8 million in 2016. The decrease in net income during 2017 of $99 thousand was primarily due to a $3.4 million decrease in gain on loan sales, a $1.8 million 2016 gain on the sale of OREO that did not recur in 2017, the $6.8 million non-cash charge discussed above offset by a $4.5 million release in the provision for loan losses. Diluted earnings per share in 2017 were $8.52 compared with $8.57 in 2016. Net income before effect of the tax rate change was $33.5 million in the year ended December 31, 2017, an increase of $6.7 million or 24.9% over the same period last year. The increase in net income before the effect of the tax rate change during 2017 of $6.7 million resulted primarily from an increase in net interest income of $4.2 million and a $4.5 million release in the provision for loan losses during the year. These increases were partially offset by a $3.9 million decrease in non-interest income. Diluted earnings per share before the effect of the tax rate change were $10.68 compared with $8.57 in 2016. (See Non-GAAP measures disclosure below.) The increase in net interest income of $4.2 million was primarily the result of $99 million of average loan growth and slightly higher yields on loans driven by Fed rate increases and collections of past due loan interest, partially offset by increased funding costs. The $3.9 million decrease in non-interest income was primarily the result of lower loan sale revenue in 2017 and a large OREO property gain on sale in 2016, partially offset by smaller other amounts. Net interest margin increased to 3.35% from 3.31% in the same period due to the above plus growth in non-interest bearing deposits. Total loan balances at December 31, 2017 were a record $2.740 billion, representing a $245.4 million or 9.8% increase from the $2.495 billion at December 31, 2016. The Bank believes this growth reflects continued strong focus on origination of high quality loans in the greater Los Angeles area, primarily real estate and SBA loans. During the 3rd quarter of 2017, an impaired loan of $5.4 million with a related charge off of $4.5 million was paid in full, resulting in a recovery of $4.5 million and past due interest of $711 thousand. This recovery, along with the pay-off of approximately $30 million of substandard loans in Q 1 2017, were the primary drivers behind the 2017 YTD reserve release of $4.5 million. Loan credit quality continues to improve as criticized loan totals decreased from $66.2 million at December 31, 2016 to $17.1 million at December 31, 2017. Non-performing assets at December 31, 2017 were $9.9 million compared to $19.2 million at the end of 2016. The allowance for loan losses decreased to 1.29% at December 31, 2017 compared to 1.41% at December 31, 2016, reflecting overall improvement in credit quality. The coverage ratio related to non-performing loans at December 31, 2017 was 391% compared to 217% at the end of 2016. Deposits grew to a total of $2.860 billion as of December 31, 2017, an increase of $178.2 million or 6.6% from December 31, 2016. Non-interest bearing deposits increased 12.4%, or $130.2 million to $1.177 billion at December 31, 2017 compared to $1.047 billion as of December 31, 2016, in part due to a Bank wide focus on increasing deposits throughout the branch system and the Bank’s specialty deposit group. Average non-interest bearing deposits grew $124.8 million or 12.4% during 2017 over the prior year. Non-interest bearing deposits as a percentage of core deposits were 47.9% and at December 31, 2017, up from 45.6% at December 31, 2016. Non-interest bearing deposits as a percentage of total deposits were 41.2% compared to 39.0% at the prior year end. Details of changes in non-interest income and non-interest expenses are provided in the financial reports attached to the document including a reduction in loan sales of $3.4 million, an increase in salary related expenses of $2.8 million, an increase in deferral of loan origination costs of $2.9 million and an increase in professional services of $1.9 million during 2017 as compared to 2016. Community Bank’s capital ratios continue to exceed “well capitalized” regulatory requirements The Kroll Bond Rating Agency (KBRA) affirmed Community Bank’s ratings as follows as of December 31, 2017:\nType\nRating\nOutlook\nAction\nDeposit BBB+ Stable Affirmed Senior Unsecured Debt BBB+ Stable Affirmed Subordinated Debt BBB+ Stable Affirmed Short-term Deposit K2 N/A Affirmed Short-term Debt K2 N/A Affirmed Dividend:\nThe Board of Directors declared a $0.50 per share cash dividend (aggregating $1.6 million) on its outstanding common stock for common shareholders of record as of February 12, 2018 and payable on or about March 1, 2018. This represents the thirteenth consecutive quarter that the Bank has declared a dividend since introducing a formal dividend practice. The dividend was approved at the regularly scheduled Board of Directors meeting held on January 25, 2018.\nProvisional Estimate:\nThe $6.8 million charge for deferred tax assets is a provisional estimate that could change as the Bank anticipates subsequent regulations and interpretations to be released associated with TCJA that will provide additional guidance on the application of the law; it is anticipated that the provisional estimate will be finalized by March 31, 2018, but could take up to 12 months.\nNon-GAAP Financial Measures:\nThe Bank believes the presentation of net income before the effect of tax rate change, and the effect of the tax rate change which are both non-GAAP financial measures provides useful supplemental information that is essential to an investor’s proper understanding of the results of the operations and financial condition of the Bank. See the Statement on Non-GAAP measures and related table later in this document for additional disclosures and reconciliations.\nMarket Makers\nCBank is pleased to include the following as market makers in Community Bank stock. Community Bank stock trades on OTC pink sheets under the ticket of CYHT. Contact information for our market makers is as follows:\nRaymond James & Associates\nD.A. Davidson & Co.\nJohn T. Cavender, SVP Financial Institutions Michael R. Natzic, Senior Vice President 415-616-8935 1-800-288-2811 John.cavender@raymondjames.com\nmnatzic@dadco.com\nhttp://www.raymondjames.com\nhttps://dadavidson.com\nKeefe Bruyette & Woods, a Stifel Company\nSandler O’Neill + Partners, L.P.\nCathy Bellina, Equity Trader\nTom Thurston, Principal 212-887-8996 1-212-466-8027 cbellina@kbw.com\ntthurston@sandleroneill.com\nwww.kbw.com\nhttp://www.sandleroneill.com/\nWedbush Securities Joey Warmenhoven, Managing Director Community Banking Group 1-866-662-0351 Joey.warmenhoven@wedbush.com\nhttps://www.wedbush.com/\nCommunity Bank, partnering to be YOUR community bank, has offices in Anaheim, Burbank, Century City, Commerce, Corona, Glendale, Huntington Beach, Irvine, Laguna Niguel, Ontario, Pasadena, Redlands, Santa Clarita, Santa Fe Springs, South Bay, and Woodland Hills. For more information, visit the Community Bank Website at www.cbank.com .\nThis document may contain forward-looking statements concerning projections of revenues, income/loss, earnings/loss per share, capital expenditures, dividends, capital structure, or other financial items, plans and objectives of management for future operations, future economic performance, or any of the assumptions underlying or relating to any of the foregoing. Forward-looking statements can be identified by the fact that they do not relate\nstrictly to historical or current facts, and may include the words \"believes,\" \"plans,\" \"expects,\" \"anticipates,\" \"forecasts,\" \"intends,\" \"hopes,\" \"should,\" \"estimates,\" or words of similar meaning. While the Bank believes that our forward-looking statements and the assumptions underlying them are reasonably based, such statements and assumptions are by their nature subject to risks and uncertainties, and thus could later prove to be inaccurate or incorrect. Accordingly, actual results could materially differ from projections for a variety of reasons, to include, but not limited to: the effect of, and our failure to comply with any regulatory orders we are or may become subject to; adverse economic conditions in California; adverse changes in the financial performance and/or condition of our borrowers and, as a result, increased loan delinquency rates, deterioration in asset quality, and losses in our loan portfolio; the impact of local, national, and international economies and events (including political events, acts of war or terrorism, natural disasters such as wildfires and earthquakes) on the Bank’s business; deterioration or malaise in economic conditions, including destabilizing factors in the financial industry and deterioration of the real estate market, as well as the impact from any declining levels of consumer and business confidence in the state of the economy in general and in financial institutions in particular; the impact of regulatory action on the Bank and legislation affecting the financial services industry; changes in estimates of future reserve requirements based upon the periodic review thereof under relevant regulatory and accounting requirements; the Dodd-Frank Wall Street Reform and Consumer Protection Act, other regulatory reform, and any related rules and regulations on our business operations and competitiveness; the costs and effects of legal and regulatory developments, including legal proceedings or regulatory or other governmental inquiries and proceedings and the resolution thereof, and the results of regulatory examinations or reviews; changes in our business plan; the effect of the Tax Cuts and Jobs Act; the effects of and changes in trade, monetary and fiscal policies and laws, including the interest rate policies of the Board of Governors of the Federal Reserve System; inflation, interest rate,securities market and monetary fluctuations; changes in consumer spending, borrowings and savings habits; technological changes and developments; changes in the competitive environment among financial holding companies and other financial service providers, including fintech businesses; the effect of changes in accounting policies and practices, as may be adopted by the regulatory agencies, as well as the Public Company Accounting Oversight Board, the Financial Accounting Standards Board and other accounting standard setters; changes in our capital position; our ability to attract and retain skilled executives and employees; changes in our organization, compensation and benefit plans; and our success at managing the risks involved in any of the foregoing items.\nCOMMUNITY BANK - FINANCIAL HIGHLIGHTS (Unaudited) (Amounts in Thousands, except shares and per share data) As of December 31,\nDecember 31,\nDollar\nPercent\nBALANCE SHEET 2016 2017 Change Change Cash and cash equivalents $ 47,552 $ 44,298 $ (3,254 ) (6.8 %) Investments 913,781 837,415 (76,366 ) (8.4 %) FHLB Stock 17,250 17,250 - - Non-owner occupied real estate loans 823,621 919,714 96,093 11.7 % Owner occupied real estate loans 1,078,652 1,191,757 113,105 10.5 % Total real estate loans 1,902,273 2,111,471 209,198 11.0 % Commercial & industrial loans 545,332 590,462 45,130 8.3 % Other loans 46,902 37,926 (8,976 ) (19.1 %) Total loans 2,494,507 2,739,859 245,352 9.8 % Loan loss reserve (35,166 ) (35,346 ) (180 ) (0.5 %) Net loans 2,459,341 2,704,513 245,172 10.0 % Other assets 147,035 143,922 (3,113 ) (2.1 %) Total assets $ 3,584,959 $ 3,747,398 $ 162,439 4.5 % Earning assets $ 3,440,426 $ 3,606,816 $ 166,390 4.8 % Non-interest bearing deposits $ 1,047,221 $ 1,177,453 $ 130,232 12.4 % Interest bearing deposits 1,634,773 1,682,761 47,988 2.9 % Total deposits 2,681,994 2,860,214 178,220 6.6 % Borrowings - short term 228,000 197,500 (30,500 ) (13.4 %) Borrowings - long term 315,000 305,000 (10,000 ) (3.2 %) Other liabilities 32,256 32,274 18 0.1 % Total liabilities 3,257,250 3,394,988 137,738 4.2 % Stockholders' equity 327,709 352,410 24,701 7.5 % Total liabilities & stockholders' equity\n$ 3,584,959 $ 3,747,398 $ 162,439 4.5 % Shares outstanding 3,128,266 3,134,095 December 31,\nMinimum Ratios for a\nCAPITAL RATIOS 2016 2017 Well-Capitalized Bank Tier 1 leverage capital 9.36 % 9.43 % 5.00 % Tier 1 risk-based capital 10.88 % 10.91 % 8.00 % Total risk-based capital 12.08 % 12.04 % 10.00 % Common equity tier 1 capital 10.88 % 10.91 % 6.50 % For the Quarters Ended For the Year Ended December 31, December 31, Dollar Percent Dollar Percent INCOME STATEMENT 2016 2017 Change Change 2016 2017 Change Change Interest income $ 31,976 $ 35,126 $ 3,150 9.9 % $ 128,384 $ 136,078 $ 7,694 6.0 % Interest expense 3,488 4,400 912 26.1 % 13,357 16,840 3,483 26.1 % Net interest income 28,488 30,726 2,238 7.9 % 115,027 119,238 4,211 3.7 % Provision for loan losses 3,498 104 (3,394 ) (97.0 %) 6,948 (4,496 ) (11,444 ) (164.7 %) Net interest income after provision 24,990 30,622 5,632 22.5 % 108,079 123,734 15,655 14.5 % Non-interest income 1,972 1,903 (69 ) (3.5 %) 13,307 9,378 (3,929 ) (29.5 %) Non-interest expense 20,537 21,123 586 2.9 % 78,328 78,887 559 0.7 % Income before income tax 6,425 11,402 4,977 77.5 % 43,058 54,225 11,167 25.9 % Income tax 2,197 10,960 8,763 398.9 % 16,235 27,501 11,266 69.4 % Net income $ 4,228 $ 442 $ (3,786 ) (89.5 %) $ 26,823 $ 26,724 $ (99 ) (0.4 %) For the Quarters Ended For the Year Ended December 31, December 31, Selected Financial Data and Highlights 2016 2017 2016 2017 Return on average equity 5.01 % 0.49 % 8.07 % 7.71 % Return on average equity before effect of tax rate change 1) 5.01 % 8.00 % 8.07 % 9.66 % Return on average assets 0.47 % 0.05 % 0.74 % 0.72 % Return on average assets before effect of tax rate change 1) 0.47 % 0.76 % 0.74 % 0.91 % Earning Asset Yields 3.73 % 3.84 % 3.70 % 3.82 % Cost of Funds 0.40 % 0.48 % 0.39 % 0.47 % Net interest margin 3.33 % 3.36 % 3.31 % 3.35 % Efficiency ratio 67.42 % 64.85 % 61.07 % 61.40 % Book value per common share $ 104.76 $ 112.44 Basic earnings per common share $ 1.35 $ 0.14 $ 8.57 $ 8.53 Earnings per share - basic before effect of tax rate change 1) $ 1.35 $ 2.30 $ 8.57 $ 10.69 Diluted earnings per common share $ 1.35 $ 0.14 $ 8.57 $ 8.52 Diluted earnings per common before effect of tax rate change 1)\n$ 1.35 $ 2.29 $ 8.57 $ 10.68 Weighted average shares outstanding - basic 3,128,266 3,134,095 3,128,266 3,133,472 Weighted average shares outstanding - dilutive 3,128,609 3,143,534 3,128,350 3,136,431 Dividend declared $ 0.50 $ 0.50 $ 2.00 $ 2.00 1) See Statement of non-GAAP measures at the end of this document\nFor the Year Ended December 31, Interest income 2016 2017 Loans $ 106,463 $ 114,938 Securities 19,550 19,507 FHLB dividends 2,277 1,335 Interest bearing bank balances 94 298 Total interest income $ 128,384 $ 136,078 Interest expense Money market $ 2,927 $ 4,015 CD's 4,380 5,661 Other interest bearing deposits 416 148 Borrowings - Short term (<92 days) 1,378 2,176 Borrowings - long term 4,256 4,840 Total interest expense $ 13,357 $ 16,840 For the Year Ended December 31, Non-interest income 2016 2017 Service charges on deposits $ 3,838 $ 4,081 Fees and commissions 2,234 1,896 Bank owned life insurance 1,576 1,519 Gain on sale of OREO / fixed / other assets 1,702 480 Gain (loss) on sale of securities 83 145 Gain on sale of loans 3,599 168 Swap fee income - 494 Other non-interest income 275 595 Total non-interest income $ 13,307 $ 9,378 Non-interest expense Salary and employee benefits $ 56,789 $ 59,616 Deferral of loan origination costs (2,955 ) (5,873 ) Occupancy 6,919 6,808 Professional Services 3,114 4,975 FDIC Insurance 1,724 1,241 Net OREO income (expense) 388 106 Data processing 3,489 3,401 Other expense 8,860 8,613 Total non-interest expense $ 78,328 $ 78,887 COMMUNITY BANK - FINANCIAL HIGHLIGHTS (Unaudited) (Amounts in Thousands, except per share data) As of BALANCE SHEET December 31, March 31, June 30, September 30, December 31, 2016 2017 2017 2017 2017 Cash and cash equivalents $ 47,552 $ 57,612 $ 59,386 $ 48,546 $ 44,298 Investments 913,781 924,826 924,821 887,257 837,415 FHLB Stock 17,250 18,765 17,512 17,250 17,250 Non-owner occupied real estate loans 823,621 824,506 883,811 883,199 919,714 Owner occupied real estate loans 1,078,652 1,095,176 1,145,592 1,175,410 1,191,757 Total real estate loans 1,902,273 1,919,682 2,029,403 2,058,609 2,111,471 Commercial & industrial loans 545,332 555,708 576,854 585,369 590,462 Other loans 46,902 41,133 43,433 43,303 37,926 Total loans 2,494,507 2,516,523 2,649,690 2,687,281 2,739,859 Loan loss reserve (35,166 ) (33,449 ) (34,824 ) (35,345 ) (35,346 ) Net loans 2,459,341 2,483,074 2,614,866 2,651,936 2,704,513 Other assets 147,035 140,766 132,863 135,723 143,922 Total assets $ 3,584,959 $ 3,625,043 $ 3,749,448 $ 3,740,712 $ 3,747,398 Earning assets $ 3,440,426 $ 3,479,318 $ 3,614,466 $ 3,601,919 $ 3,606,816 Non-interest bearing deposits $ 1,047,221 $ 1,055,942 $ 1,135,140 $ 1,188,818 $ 1,177,453 Interest bearing deposits 1,634,773 1,589,917 1,611,711 1,682,461 1,682,761 Total deposits 2,681,994 2,645,859 2,746,851 2,871,279 2,860,214 Borrowings - short term 228,000 300,000 313,000 166,000 197,500 Borrowings - long term 315,000 315,000 315,000 315,000 305,000 Other liabilities 32,256 28,452 27,782 31,888 32,274 Total liabilities 3,257,250 3,289,311 3,402,633 3,384,167 3,394,988 Stockholders' equity 327,709 335,732 346,815 356,545 352,410 Total liabilities & stockholders'equity $ 3,584,959 $ 3,625,043 $ 3,749,448 $ 3,740,712 $ 3,747,398 DEPOSIT COMPONENTS Treasury deposits $ 385,662 $ 399,970 $ 407,647 $ 416,431 $ 400,752 Core Bank deposits 2,296,332 2,245,889 2,339,204 2,454,848 2,459,462 Total Deposits $ 2,681,994 $ 2,645,859 $ 2,746,851 $ 2,871,279 $ 2,860,214 Core deposits / total deposits 85.62 % 84.88 % 85.16 % 85.50 % 85.99 % Non-interest bearing deposits/core deposits 45.60 % 47.02 % 48.53 % 48.43 % 47.87 % As of CAPITAL RATIOS December 31, March 31, June 30, September 30, December 31, 2016 2017 2017 2017 2017 Tier 1 leverage capital 9.36 % 9.35 % 9.39 % 9.50 % 9.43 % Tier 1 risk-based capital 10.88 % 11.08 % 10.97 % 11.14 % 10.91 % Total risk-based capital 12.08 % 12.21 % 12.11 % 12.29 % 12.04 % Common equity tier 1 capital 10.88 % 11.08 % 10.97 % 11.14 % 10.91 % For the Quarters Ended INCOME STATEMENT December 31, March 31, June 30, September 30, December 31, 2016 2017 2017 2017 2017 Interest income $ 31,976 $ 31,582 $ 34,114 $ 35,256 $ 35,126 Interest expense 3,488 3,809 4,192 4,439 4,400 Net interest income 28,488 27,773 29,922 30,817 30,726 Provision for loan losses 3,498 (1,600 ) 1,000 (4,000 ) 104 Net interest income after provision 24,990 29,373 28,922 34,817 30,622 Non-interest income 1,972 1,981 3,141 2,353 1,903 Non-interest expense 20,537 18,730 18,436 20,598 21,123 Income before income tax 6,425 12,624 13,627 16,572 11,402 Income tax 2,197 4,837 5,273 6,431 10,960 Net income $ 4,228 $ 7,787 $ 8,354 $ 10,141 $ 442 For the Quarters Ended PERFORMANCE AND PER SHARE DATA December 31, March 31, June 30, September 30, December 31, 2016 2017 2017 2017 2017 Return on average equity 5.01 % 9.51 % 9.74 % 11.40 % 0.49 % Return on average equity before effect of tax rate change 1) 5.01 % 9.51 % 9.74 % 11.40 % 8.00 % Return on average assets 0.47 % 0.87 % 0.91 % 1.08 % 0.05 % Return on average assets before effect of tax rate change 1) 0.47 % 0.87 % 0.91 % 1.08 % 0.76 % Earning Asset Yields 3.73 % 3.69 % 3.87 % 3.88 % 3.84 % Cost of Funds 0.40 % 0.45 % 0.48 % 0.49 % 0.48 % Net interest margin 3.33 % 3.24 % 3.39 % 3.39 % 3.36 % Efficiency ratio 67.42 % 62.92 % 55.76 % 62.29 % 64.85 % Book value per common share $ 104.76 $ 107.12 $ 110.66 $ 113.76 $ 112.44 Earnings per share - basic $ 1.35 $ 2.49 $ 2.67 $ 3.24 $ 0.14 Earnings per share - basic before effect of tax rate change 1) $ 1.35 $ 2.49 $ 2.67 $ 3.24 $ 2.30 Diluted earnings per common share $ 1.35 $ 2.49 $ 2.66 $ 3.23 $ 0.14 Diluted earnings per common share before effect of tax rate change 1) $ 1.35 $ 2.49 $ 2.66 $ 3.23 $ 2.29 1) See Statement of non-GAAP measures at the end of this document\nFor the Quarters Ended December 31, March 31, June 30, September 30, December 31, 2016 2017 2017 2017 2017 Interest income Loans $ 26,229 $ 26,124 $ 28,702 $ 30,064 $ 30,048 Securities 4,672 5,031 5,045 4,790 4,641 FHLB dividends 1,049 394 314 320 307 Interest bearing bank balances\n26 33 53 82 130 Total interest income $ 31,976 $ 31,582 $ 34,114 $ 35,256 $ 35,126 Interest expense Money market 845 800 837 1,034 1,344 CD's 1,213 1,216 1,438 1,522 1,485 Other interest bearing deposits 39 40 35 36 37 Borrowings - Short term (<92 days) 155 560 641 633 342 Borrowings - long term 1,236 1,193 1,241 1,214 1,192 Total interest expense $ 3,488 $ 3,809 $ 4,192 $ 4,439 $ 4,400 For the Quarters Ended December 31, March 31, June 30, September 30, December 31, 2016 2017 2017 2017 2017 Non-interest income Service charges on deposits $ 955 $ 1,021 $ 1,022 $ 1,013 $ 1,025 Fees and commissions 576 502 503 488 403 Bank owned life insurance 393 353 384 417 365 Gain on sale of OREO / fixed / other assets (12 ) 8 521 1 (50 ) Gain (loss) on sale of securities - (15 ) - 104 56 Gain on sale of loans 6 63 19 56 30 Swap fee income - - 494 - - Other non-interest income 54 49 198 274 74 Total non-interest income $ 1,972 $ 1,981 $ 3,141 $ 2,353 $ 1,903 Non-interest expense Salary and employee benefits 15,923 14,595 14,302 15,181 15,538 Deferral of loan origination costs (1,231 ) (1,256 ) (1,896 ) (1,492 ) (1,229 ) Occupancy 1,698 1,710 1,640 1,776 1,682 Professional Services 498 575 1,000 1,126 2,274 FDIC Insurance 282 308 355 339 239 Net OREO income (expense) 140 39 21 3 43 Data processing 1,057 807 908 1,059 627 Other expense 2,170 1,952 2,106 2,606 1,949 Total non-interest expense $ 20,537 $ 18,730 $ 18,436 $ 20,598 $ 21,123 AVERAGE BALANCE SHEET AND YIELDS (Unaudited) For the Year Ended For the Year Ended (In thousands) December 31, 2016 December 31, 2017 Average Yield/ Average Yield/ Balance Interest Rate Balance Interest Rate INTEREST EARNING ASSETS Loans and leases $ 2,508,726 $ 106,463 4.24 % $ 2,607,885 $ 114,938 4.41 % Investment securities 927,427 19,550 2.11 % 910,132 19,507 2.14 % FHLB Stock/Dividends 18,744 2,277 12.15 % 17,793 1,335 7.50 % FFSold/Fed balances/Due from Time 19,261 94 0.48 % 26,549 298 1.11 % Total Earning Assets 3,474,158 128,384 3.70 % 3,562,359 136,078 3.82 % Nonearning assets 126,758 138,615 Total Assets $ 3,600,916 $ 3,700,974 INTEREST BEARING LIABILITIES Time deposits 617,508 4,380 0.71 % 564,348 5,661 1.00 % Interest bearing demand 164,244 397 0.24 % 77,362 122 0.16 % Money market 854,987 2,927 0.34 % 955,272 4,015 0.42 % Savings and other 39,347 19 0.05 % 46,150 26 0.06 % Total Interest Bearing Deposits 1,676,086 7,723 0.46 % 1,643,132 9,824 0.60 % Borrowings - short term 304,382 1,378 0.45 % 233,951 2,176 0.93 % Borrowings - long term 253,361 4,256 1.68 % 312,131 4,840 1.55 % Total Interest Bearing Liabilities 2,233,829 13,357 0.60 % 2,189,214 16,840 0.77 % Non-interest bearing deposits 1,007,703 1,132,495 Accrued interest payable and other liabilities\n27,167 32,519 Total Liabilities 3,268,699 3,354,228 Shareholders' equity 332,217 346,746 Total Liabilities and Shareholders' Equity\n$ 3,600,916 $ 3,700,974 Net Interest Spread 3.10 % 3.05 % Effect of noninterest-bearing sources 0.21 % 0.30 % Net Interest Income and Margin $ 115,027 3.31 % $ 119,238 3.35 % COMMUNITY BANK - FINANCIAL HIGHLIGHTS AVERAGE BALANCE SHEET AND YIELDS (Unaudited) Quarters Ended (In thousands) December 31, 2016 March 31, 2017 June 30, 2017 September 30, 2017 December 31, 2017 Average Yield/ Average Yield/ Average Yield/ Average Yield/ Average Yield/ Balance Interest Rate Balance Interest Rate Balance Interest Rate Balance Interest Rate Balance Interest Rate INTEREST EARNING ASSETS Loans and leases $ 2,481,496 $ 26,229 4.20 % $ 2,510,592 $ 26,124 4.22 % $ 2,563,327 $ 28,702 4.49 % $ 2,652,270 $ 30,064 4.50 % $ 2,702,750 $ 30,048 4.41 % Investment securities 889,076 4,672 2.10 % 924,218 5,031 2.18 % 937,691 5,045 2.15 % 911,808 4,790 2.10 % 867,418 4,641 2.14 % FHLB Stock/Dividends 17,250 1,049 24.19 % 18,170 394 8.79 % 18,388 314 6.85 % 17,378 320 7.31 % 17,250 307 7.06 % FFSold/Fed balances/Due from Time 19,861 26 0.51 % 18,194 33 0.73 % 20,743 53 1.01 % 27,274 82 1.18 % 39,739 130 1.28 % Total Earning Assets 3,407,683 31,976 3.73 % 3,471,174 31,582 3.69 % 3,540,149 34,114 3.87 % 3,608,730 35,256 3.88 % 3,627,157 35,126 3.84 % Nonearning assets 136,952 145,407 139,026 130,200 139,469 Total Assets $ 3,544,635 $ 3,616,581 $ 3,679,175 $ 3,738,930 $ 3,766,626 INTEREST BEARING LIABILITIES Time deposits 602,108 1,213 0.80 % 568,364 1,216 0.87 % 588,910 1,438 0.98 % 570,096 1,522 1.06 % 530,375 1,485 1.11 % Interest bearing demand 81,051 34 0.17 % 84,890 34 0.16 % 75,851 29 0.15 % 75,528 29 0.15 % 73,327 30 0.16 % Money market 931,832 845 0.36 % 887,016 800 0.37 % 880,323 837 0.38 % 979,452 1,034 0.42 % 1,071,997 1,344 0.50 % Savings and other 43,456 5 0.05 % 43,992 6 0.06 % 44,248 6 0.05 % 47,567 7 0.06 % 48,725 7 0.06 % Total Interest Bearing Deposits 1,658,447 2,097 0.50 % 1,584,262 2,056 0.53 % 1,589,332 2,310 0.58 % 1,672,643 2,592 0.61 % 1,724,424 2,866 0.66 % Borrowings - short term 128,587 155 0.48 % 327,984 560 0.69 % 288,088 641 0.89 % 212,728 633 1.18 % 109,635 342 1.24 % Borrowings - long term 318,261 1,236 1.54 % 315,000 1,193 1.54 % 313,494 1,241 1.59 % 315,000 1,214 1.53 % 305,109 1,192 1.55 % Total Interest Bearing Liabilities 2,105,295 3,488 0.66 % 2,227,246 3,809 0.69 % 2,190,914 4,192 0.77 % 2,200,371 4,439 0.80 % 2,139,168 4,400 0.82 % Non-interest bearing deposits 1,070,434 1,023,236 1,113,374 1,154,496 1,236,292 Accrued interest payable and other liabilities\n33,160 34,141 31,019 31,037 33,387 Total Liabilities 3,208,889 3,284,623 3,335,307 3,385,904 3,408,847 Shareholders' equity 335,746 331,958 343,868 353,026 357,779 Total Liabilities and Shareholders' Equity\n$ 3,544,635 $ 3,616,581 $ 3,679,175 $ 3,738,930 $ 3,766,626 Net Interest Spread 3.07 % 3.00 % 3.10 % 3.08 % 3.02 % Effect of noninterest-bearing sources 0.25 % 0.24 % 0.29 % 0.31 % 0.34 % Net Interest Income and Margin $ 28,488 3.33 % $ 27,773 3.24 % $ 29,922 3.39 % $ 30,817 3.39 % $ 30,726 3.36 % COMMUNITY BANK - FINANCIAL HIGHLIGHTS ALLL Trend and Statistics (Unaudited) (Amounts in Thousands) For the Year Ended ALLL ROLLFORWARD December 31, 2016 December 31, 2017 Beginning Balance $ 36,327 $ 35,166 Provision for / (Release of) Loan Losses 6,948 (4,496 ) Charge Offs (9,161 ) (690 ) Recoveries 1,052 5,366 Net (Charge Offs) Recoveries (8,109 ) 4,676 Ending Balance $ 35,166 $ 35,346 Period End Loan Balance $ 2,494,507 $ 2,739,859 Average Loan Balance for the period $ 2,508,726 $ 2,607,885 ASSET QUALITY INDICATORS Non-Performing Loans 16,188 9,041 OREO 3,000 825 Total Non-Performing Assets (NPA) $ 19,188 $ 9,866 Criticized Loan Totals $ 66,196 $ 17,097 Loans and Leases 30 - 89 days past due 2,708 4,175 Loans and Leases >89 days past due 2 - Total Delinquent Loans and Leases $ 2,710 $ 4,175 Delinquent Loans and Leases to Total Loans 0.11 % 0.15 % Net Charge Offs to Avg Loans (Annualized) -0.32 % 0.18 % NPL as a % of Total Loans 0.65 % 0.33 % NPA as a % of Total Loans + OREO 0.77 % 0.36 % ALLL/Non Performing loans 217.2 % 391.0 % ALLL as a % of Total Loans 1.41 % 1.29 % COMMUNITY BANK - FINANCIAL HIGHLIGHTS ALLL Trend and Statistics (Unaudited) (Amounts in Thousands) For the Quarters Ended ALLL ROLLFORWARD December 31, March 31, June 30, September 30, December 31, 2016 2017 2017 2017 2017 Beginning Balance $ 35,826 $ 35,166 $ 33,449 $ 34,824 $ 35,345 Provision for / (Release of) Loan Losses 3,498 (1,600 ) 1,000 (4,000 ) 104 Charge Offs (4,941 ) (295 ) (24 ) (156 ) (215 ) Recoveries 783 178 399 4,677 112 Net Charge Offs (4,158 ) (117 ) 375 4,521 (103 ) Ending Balance $ 35,166 $ 33,449 $ 34,824 $ 35,345 $ 35,346 Period End Loan Balance $ 2,494,507 $ 2,516,523 $ 2,649,690 $ 2,687,281 $ 2,739,859 Average Loan Balance for the period $ 2,481,496 $ 2,510,592 $ 2,563,327 $ 2,652,270 $ 2,702,750 ASSET QUALITY INDICATORS Non-Performing Loans 16,188 14,979 12,157 3,951 9,041 OREO 3,000 - - 825 825 Total Non-Performing Assets (NPA) $ 19,188 $ 14,979 $ 12,157 $ 4,776 $ 9,866 Criticized Loan Totals $ 66,196 $ 25,893 $ 22,366 $ 26,954 $ 17,097 Loans and Leases 30 - 89 days past due 2,708 494 701 1,624 4,175 Loans and Leases >89 days past due 2 - - - - Total Delinquent Loans and Leases $ 2,710 $ 494 $ 701 $ 1,624 $ 4,175 Delinquent Loans and Leases to Total Loans 0.11 % 0.02 % 0.03 % 0.06 % 0.15 % Net Charge Offs to Avg Loans (Annualized) -0.67 % -0.02 % 0.06 % 0.68 % -0.02 % NPL as a % of Total Loans 0.65 % 0.60 % 0.46 % 0.15 % 0.33 % NPA as a % of Total Loans + OREO 0.77 % 0.60 % 0.46 % 0.18 % 0.36 % ALLL/Non Performing loans 217.2 % 223.3 % 286.5 % 894.6 % 391.0 % ALLL as a % of Total Loans 1.41 % 1.33 % 1.31 % 1.32 % 1.29 % COMMUNITY BANK\nStatement on Non-GAAP Measures\nGAAP to Non-GAAP Reconciliation and Calculation of Non-GAAP Performance Measures (unaudited)\n(Amounts in Thousands, except shares and per share data)\nCommunity Bank believes the presentation of the following non-GAAP financial measures provides useful supplemental information that is essential to an investor’s proper understanding of the results of operations and financial condition of the Bank. Management uses non-GAAP financial measures in its analysis of the Bank’s performance. These non-GAAP measures should not be viewed as substitutes for the financial measures determined in accordance with GAAP, nor are they necessarily comparable to non-GAAP performance measures that may be presented by other companies.\nFor the Quarters Ended For the Year Ended December 31, December 31, Dollar Percent Dollar Percent 2016 2017 Change Change 2016 2017 Change Change Selected Financial Data and Highlights Net income 4,228 442 (3,786 ) (89.5 %) 26,823 26,724 (99 ) (0.4 %) Effect of tax rate change - 6,771 6,771 - - 6,771 6,771 - Net income before effect of tax rate change $ 4,228 $ 7,213 $ 2,985 70.6 % $ 26,823 $ 33,495 $ 6,672 24.9 % Return on average equity 5.01 % 0.49 % 8.07 % 7.71 % Effect of tax rate change - 7.51 - 1.95 Return on average equity before effect of tax rate change 5.01 % 8.00 % 8.07 % 9.66 % Return on average assets 0.47 % 0.05 % 0.74 % 0.72 % Effect of tax rate change - 0.71 - 0.19 Return on average assets before the effect of tax rate change 0.47 % 0.76 % 0.74 % 0.91 % Earnings per share - basic $ 1.35 $ 0.14 $ (1.21 ) (89.6 %) $ 8.57 $ 8.53 $ (0.04 ) (0.5 %) Effect of tax rate change - 2.16 2.16 - - 2.16 2.16 - Earnings per share - basic before effect of tax rate change $ 1.35 $ 2.30 $ 0.95 70.4 % $ 8.57 $ 10.69 $ 2.12 24.7 % Earnings per share - diluted $ 1.35 $ 0.14 $ (1.21 ) (89.6 %) $ 8.57 $ 8.52 $ (0.05 ) (0.6 %) Effect of tax rate change - 2.15 2.15 - - 2.16 2.16 - Earnings per share - diluted before effect of tax rate change $ 1.35 $ 2.29 $ 0.94 69.6 % $ 8.57 $ 10.68 $ 2.11 24.6 % Weighted average shares outstanding - basic 3,128,266 3,134,095 3,128,266 3,133,472 Weighted average shares outstanding - dilutive 3,128,609 3,143,534 3,128,350 3,136,431\nView source version on businesswire.com: http://www.businesswire.com/news/home/20180126005717/en/\nCommunity Bank\nJ. Duncan Smith\nChief Financial Officer\n(626) 568-2009\nSource: Community Bank", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sandleroneill.com%2F&esheet=51749792&newsitemid=20180126005717&lan=en-US&anchor=http%3A%2F%2Fwww.sandleroneill.com%2F&index=4&md5=72506462df6969674b5eb22081dce89d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.kbw.com&esheet=51749792&newsitemid=20180126005717&lan=en-US&anchor=www.kbw.com&index=3&md5=1d5f056ac8854764f8ea0e9dfae7cbab", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.raymondjames.com&esheet=51749792&newsitemid=20180126005717&lan=en-US&anchor=http%3A%2F%2Fwww.raymondjames.com&index=1&md5=c1a6ae3828b1f9e9744ed43f2ecc6cab", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cbank.com&esheet=51749792&newsitemid=20180126005717&lan=en-US&anchor=www.cbank.com&index=6&md5=cb2fcf3b7b7534c5b2134cf91c9b9b0f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fdadavidson.com&esheet=51749792&newsitemid=20180126005717&lan=en-US&anchor=https%3A%2F%2Fdadavidson.com&index=2&md5=49b2bb684f8a1ce5556415f304b51441", "https://www.wedbush.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.wedbush.com%2F&esheet=51749792&newsitemid=20180126005717&lan=en-US&anchor=https%3A%2F%2Fwww.wedbush.com%2F&index=5&md5=c0d93ae7747889aac08c1cdcfd0c3ff9", "http://www.businesswire.com/news/home/20180126005717/en/", "http://www.sandleroneill.com/"], "published": "2018-01-27T03:16:00.000+02:00", "crawled": "2018-01-27T03:53:50.001+02:00", "highlightTitle": ""}