{"organizations": [], "uuid": "7dafeeeb6e79ad010bc20d486f97f280385bc988", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225761925&w=1200&r=LYNXMPEE0Q0DH", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-philippines-volcano/philippines-warns-of-volcanic-mudflows-from-heavy-rains-idUKKBN1FG0HD", "country": "US", "domain_rank": 408, "title": "Philippines warns of volcanic mudflows from heavy rains", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T14:19:00.000+02:00", "replies_count": 0, "uuid": "7dafeeeb6e79ad010bc20d486f97f280385bc988"}, "author": "", "url": "https://uk.reuters.com/article/uk-philippines-volcano/philippines-warns-of-volcanic-mudflows-from-heavy-rains-idUKKBN1FG0HD", "ord_in_thread": 0, "title": "Philippines warns of volcanic mudflows from heavy rains", "locations": [], "entities": {"persons": [{"name": "mariton b", "sentiment": "none"}, {"name": "ronn bautista", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "albay", "sentiment": "none"}, {"name": "legazpi city", "sentiment": "none"}, {"name": "mount mayon", "sentiment": "none"}], "organizations": [{"name": "philippines", "sentiment": "negative"}, {"name": "philippine institute of volcanology and seismology", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 12:19 PM / Updated 2 hours ago Philippines warns of volcanic mudflows from heavy rains Ronn Bautista 3 Min Read \nLEGAZPI CITY, Philippines (Reuters) - Residents around an erupting volcano in central Philippines have should prepare to flee to safer areas because of risks from huge debris that could be swept from slopes by heavy rains, state volcanologists said on Saturday. \nThe most active volcano in the poor Southeast Asian country has been spewing lava and ash for the last two weeks and may have a major eruption within days, the Philippine Institute of Volcanology and Seismology said. \nThe provincial government has expanded its danger zone to a 9 km (5.6 miles) radius of Mount Mayon in Albay province from the 8 km radius set by volcanologists. \nMore than 75,000 people had been moved out from the danger zone to sheltered areas but many farmers and quarry workers were defying evacuation orders to work in stone quarries, on farms, and to tend livestock. \n“It’s a real threat so we are urging everyone to prepare and evacuate when told by authorities,” said Mariton Bornas, head of the volcanology agency’s monitoring and eruption prediction, adding there are fresh lahar (mudflow) deposits in the 2,462 meter (8,977 feet) Mayon’s slopes. \n“It’s really a dangerous combination for the communities. Lahar from Mayon can carry huge boulder and it can bury communities, wash away people and everything in its path, but also because of impact.” Residents wade thorugh a river with lahar flow from Mount Mayon volcano in Daraga, Albay province, south of Manila, Philippines January 27, 2018. REUTERS/Romeo Ranoco \nShe said boulders as huge as cars and houses could roll down Mayon’s slopes swiftly in minutes. \nHeavy rains poured in central Philippines, flooding shelter areas and raising risks of lahar flows. Slideshow (8 Images) \nIn Salvacion village, many farmers were sneaking inside the danger zone to plant and look after farm animals saying they need to earn a living. \n“I don’t think the volcano will erupt,” Istong Jayvee told Reuters. “It already let out fire. It will quiet down soon.” \nFarm worker Edna Medina said they are ready anytime to flee when the volcano erupts. \n”When the volcano does erupt, we’ll get out of here using our motorcycle then head straight for the main road out,” she added. \nVolcanologists have raised Mayon’s alert to level 4, one notch below the highest level. Reporting by Ronn Bautista Writing by Manuel Mogato Editing by Jeremy Gaunt.", "external_links": [], "published": "2018-01-27T14:19:00.000+02:00", "crawled": "2018-01-27T14:43:58.070+02:00", "highlightTitle": ""}