{"organizations": [], "uuid": "51c908745ad14957a372d6c67a1433dddf03304c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-crown-castle-reports-fourth-quarter-and-full-year-2017-results-raises-outlook-for-full-year-2018.html", "country": "US", "domain_rank": 767, "title": "Crown Castle Reports Fourth Quarter and Full Year 2017 Results, Raises Outlook for Full Year 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:15:00.000+02:00", "replies_count": 0, "uuid": "51c908745ad14957a372d6c67a1433dddf03304c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-crown-castle-reports-fourth-quarter-and-full-year-2017-results-raises-outlook-for-full-year-2018.html", "ord_in_thread": 0, "title": "Crown Castle Reports Fourth Quarter and Full Year 2017 Results, Raises Outlook for Full Year 2018", "locations": [], "entities": {"persons": [{"name": "jay brown", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "castle international corp.", "sentiment": "negative"}, {"name": "cci", "sentiment": "negative"}, {"name": "globe newswire", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 24, 2018 (GLOBE NEWSWIRE) -- Crown Castle International Corp. (NYSE:CCI) (\"Crown Castle\") today reported results for the quarter and year ended December 31, 2017.\n2018 Outlook for Organic Contribution to Site Revenues, Growth in Site Rental Revenues\n2018 Outlook for AFFO Growth\n\"Our solid full year 2017 results and increased Outlook for 2018 reflect the strong fundamentals across our business as we remain focused on consistently delivering value to our customers and shareholders,\" stated Jay Brown, Crown Castle’s Chief Executive Officer. \"By all measures, 2017 was a tremendous year for Crown Castle. We delivered 8% growth in dividends per share, at the high end of our long-term annual dividend growth target, while making significant investments to strategically position Crown Castle to remain the leading shared infrastructure provider in the U.S. In the near-term, we remain excited by the increasing investment activity by our customers that is translating to an expected increase in new leasing activity across towers, small cells and fiber solutions in 2018. This level of leasing activity demonstrates the attractiveness of our unique portfolio of assets, which we believe are well positioned to benefit from the continued growth in demand for data. As a result, we remain confident in our ability to grow our cash flows and deliver on our 7% to 8% annual growth target in dividends per share.\"\nRESULTS FOR THE QUARTER\nThe table below sets forth select financial results for the three month period ended December 31, 2017 and December 31, 2016. For further information, refer to the financial statements and non-GAAP, segment and other calculation reconciliations included in this press release.\n(in millions) Actual Midpoint\nQ4 2017\nOutlook (b) Actual\nCompared to\nOutlook Q4 2017 Q4 2016 $ Change % Change Site rental revenues $ 1,051 $ 817 +$ 234 +29 % $ 907 +$ 144 Net income (loss) $ 98 $ 125 -$ 27 -22 % $ 104 -$ 6 Adjusted EBITDA (a) $ 707 $ 575 +$ 132 +23 % $ 627 +$ 81 AFFO (a)(c) $ 512 $ 406 +$ 106 +26 % $ 433 +$ 79 Weighted-average common shares outstanding - diluted 408 353 +55 +16 % 408 — Note: Figures may not tie due to rounding.\n(a) See reconciliation of this non-GAAP financial measure to net income (loss) and definition included herein.\n(b) As issued on October 18, 2017.\n(c) Attributable to CCIC common stockholders. HIGHLIGHTS FROM THE QUARTER\nLightower Acquisition. On November 1, 2017, Crown Castle completed its previously announced acquisition of LTS Group Holdings LLC (\"Lightower\"). When compared to the prior fourth quarter 2017 Outlook issued on October 18, 2017, which did not include any contribution from Lightower, the acquisition contributed approximately $140 million, $83 million, and $79 million to site rental revenues, Adjusted EBITDA and AFFO, respectively. Excluding these Lightower contributions, our results would have been within the ranges provided in the prior Outlook for site rental revenues, Adjusted EBITDA and AFFO. Site rental revenues. Site rental revenues grew approximately 29%, or $234 million, from fourth quarter 2016 to fourth quarter 2017, inclusive of approximately $44 million in Organic Contribution to Site Rental Revenues plus $192 million in contributions from acquisitions and other items, less a $2 million reduction in straight-lined revenues. The $44 million in Organic Contribution to Site Rental Revenues represents approximately 5.5% growth, comprised of approximately 8% growth from new leasing activity and contracted tenant escalations, net of approximately 2.5% from tenant non-renewals. Site rental revenues for fourth quarter 2017 benefited from approximately $5 million associated with certain long-term customer agreements signed during the period that include a combination of contracted new leasing activity and term extensions on existing leases. Net income. Net income for fourth quarter 2017 was $98 million. Adjusted EBITDA and AFFO. When compared to the prior fourth quarter 2017 Outlook, Adjusted EBITDA and AFFO for fourth quarter 2017 were impacted by approximately $10 million of higher costs associated with additional accruals for annual bonuses relating to full year 2017 results, and severance related expenses. Capital expenditures and acquisitions. Capital expenditures during the quarter were approximately $377 million, comprised of approximately $15 million of land purchases, approximately $25 million of sustaining capital expenditures and approximately $337 million of revenue generating capital expenditures. Common stock dividend. During the quarter, Crown Castle paid common stock dividends of approximately $427 million in the aggregate, or $1.05 per common share, an increase of approximately 11% on a per share basis compared to the same period a year ago.\nRESULTS FOR THE YEAR\nThe table below sets forth select financial results for the year ended December 31, 2017. For further information, refer to the financial statements and non-GAAP and other calculation reconciliations included in this press release.\n(in millions) Actual Midpoint\nFull Year\n2017\nOutlook (b) Actual\nCompared to\nOutlook 2017 2016 $ Change % Change Site rental revenues $ 3,669 $ 3,233 +$ 436 +13 % $ 3,525 +$ 144 Net income (loss) $ 445 $ 357 +$ 88 +25 % $ 451 -$ 6 Adjusted EBITDA (a) $ 2,482 $ 2,228 +$ 254 +11 % $ 2,402 +$ 81 AFFO (a)(c) $ 1,860 $ 1,610 +$ 250 +16 % $ 1,782 +$ 79 Weighted-average common shares outstanding - diluted 383 341 +42 +12 % 383 — Note: Figures may not tie due to rounding\n(a) See reconciliation of this non-GAAP financial measure to net income (loss) included herein.\n(b) As issued on October 18, 2017.\n(c) Attributable to CCIC common stockholders HIGHLIGHTS FROM THE YEAR\nSite rental revenues. Site rental revenues grew approximately 13%, or $436 million, from full year 2016 to full year 2017, inclusive of approximately $160 million in Organic Contribution to Site Rental Revenues plus $323 million in contributions from acquisitions and other items, less a $47 million reduction in straight-line revenues. The $160 million in Organic Contribution to Site Rental Revenues represents approximately 5% growth, comprised of approximately 8% growth from new leasing activity and contracted tenant escalations, net of approximately 3% from tenant non-renewals. Capital expenditures. Capital expenditures during the year were approximately $1.2 billion, comprised of approximately $81 million of land purchases, approximately $85 million of sustaining capital expenditures and approximately $1.1 billion of revenue generating capital expenditures. Common stock dividend. During the year, Crown Castle paid common stock dividends of approximately $1.5 billion in the aggregate, or $3.90 per common share, an increase of approximately 8% on a per share basis compared to the same period a year ago.\n\"Our positive 2017 results and increased full year 2018 Outlook are a result of great execution by our team as they continue to deliver for our customers who are utilizing our unique portfolio of infrastructure assets to meet the robust underlying growth in data,\" stated Dan Schlanger, Crown Castle's Chief Financial Officer. \"Looking back, we had a very successful 2017. We deployed approximately $9 billion of capital to secure premium metro fiber assets in top markets where we see the greatest long-term demand for small cells and fiber solutions, and improved our financial flexibility by increasing the average maturity of our debt and lowering our average interest rate, all while delivering an 8% increase in dividends per share. Looking forward, we are focused on successfully integrating our recent acquisitions and are excited by the long-term opportunity in front of Crown Castle to deliver on our 7% to 8% annual growth target in dividends per share.\"\nOUTLOOK\nThis Outlook section contains forward-looking statements, and actual results may differ materially. Information regarding potential risks which could cause actual results to differ from the forward-looking statements herein is set forth below and in Crown Castle's filings with the Securities and Exchange Commission (\"SEC\").\nThe following table sets forth Crown Castle's current Outlook for first quarter 2018 and full year 2018: (in millions) First Quarter 2018 Full Year 2018 Site rental revenues $ 1,132 to $ 1,142 $ 4,582 to $ 4,627 Site rental cost of operations (a) $ 341 to $ 351 $ 1,360 to $ 1,405 Net income (loss) $ 116 to $ 141 $ 511 to $ 591 Adjusted EBITDA (b) $ 745 to $ 755 $ 3,049 to $ 3,094 Interest expense and amortization of deferred financing costs (c) $ 157 to $ 167 $ 642 to $ 687 FFO (b)(d) $ 477 to $ 487 $ 1,965 to $ 2,010 AFFO (b)(d)(e) $ 538 to $ 548 $ 2,219 to $ 2,264 Weighted-average common shares outstanding - diluted (f) 408 408 (a) Exclusive of depreciation, amortization and accretion.\n(b) See reconciliation of this non-GAAP financial measure to net income (loss) and definition included herein.\n(c) See reconciliation of \"components of interest expense and amortization of deferred financing costs\" herein for a discussion of non-cash interest expense.\n(d) Attributable to CCIC common stockholders.\n(e) Our AFFO for historical periods may not be comparable to those periods presented prospectively from and after January 1, 2018, including our Outlook for first quarter 2018 and full year 2018 herein. See \"Sustaining capital expenditures\" and \"Integration capital expenditures\" within \" Non-GAAP Financial Measures, Segment Measures and Other Calculations\" for further information.\n(f) The assumption for first quarter 2018 and full year 2018 diluted weighted-average common shares outstanding is based on diluted common shares outstanding as of December 31, 2017. For all periods presented, the diluted weighted-average common shares outstanding does not include any assumed conversion of the 6.875% Mandatory Convertible Preferred Stock in the share count.\nFull Year 2018 Outlook\nThe table below compares the results for full year 2017, midpoint of the current full year 2018 Outlook and the midpoint of the previously provided full year 2018 Outlook for select metrics.\nMidpoint of FY 2018 Outlook to FY 2017 Actual Comparison (in millions) Current\nFull Year\n2018\nOutlook Full Year\n2017\nActual $ Change % Change Previous\nFull Year\n2018\nOutlook (e) Current\nCompared\nto\nPrevious\nOutlook Site rental revenues $ 4,605 $ 3,669 +$ 936 +26 % $ 4,569 +$ 36 Net income (loss) $ 551 $ 445 +$ 106 +24 % $ 555 -$ 4 Adjusted EBITDA (a) $ 3,072 $ 2,482 +$ 590 +24 % $ 3,036 +$ 36 AFFO (a)(b)(c) $ 2,242 $ 1,860 +$ 382 +21 % $ 2,242 — Weighted-average common shares outstanding - diluted (d) 408 383 +25 +7 % 408 — (a) See reconciliation of this non-GAAP financial measure to net income (loss) and definition included herein.\n(b) Our AFFO for historical periods may not be comparable to those periods presented prospectively from and after January 1, 2018, including our Outlook for first quarter 2018 and full year 2018 herein. See \"Sustaining capital expenditures\" and \"Integration capital expenditures\" within \" Non-GAAP Financial Measures, Segment Measures and Other Calculations\" for further information.\n(c) Attributable to CCIC common stockholders.\n(d) The assumption for full year 2018 diluted weighted-average common shares outstanding is based on diluted common shares outstanding as of December 31, 2017. For all periods presented, the diluted weighted-average common shares outstanding does not include any assumed conversion of the 6.875% Mandatory Convertible Preferred Stock in the share count.\n(e) As issued on October 18, 2017. Consistent with the prior full year 2018 Outlook, the current Outlook does not include any anticipated contribution from the deployment of FirstNet. The increase in full year 2018 Outlook reflects an expected increase in site rental revenues associated with certain long-term customer agreements signed during fourth quarter 2017 that include a combination of contracted new leasing activity and term extensions on existing leases. The prior full year 2018 Outlook included the expected increase in new leasing activity, but not the straight-line impact resulting from these agreements. As a result, the signing of these agreements is expected to impact site rental revenues, Adjusted EBITDA and net income. The expected contribution from Lightower for full year 2018 remains unchanged, including $850 million to $870 million in site rental revenues, $510 million to $530 million in Adjusted EBITDA, and $465 million to $485 million in AFFO before financing costs. The chart below reconciles the components of expected growth in site rental revenues from 2017 to 2018 of $910 million to $955 million, inclusive of expected Organic Contribution to Site Rental Revenues during 2018 of $185 million to $225 million.\nA photo accompanying this announcement is available at: http://www.globenewswire.com/NewsRoom/AttachmentNg/987fa22d-d9d6-4922-81b5-381f87e5a469\nFor the above chart, the entire expected contribution to full year 2018 Outlook for growth in site rental revenues from Lightower is included within acquisitions, tower builds and other. The chart below reconciles the components of expected growth in AFFO from 2017 to 2018 of between $360 million and $400 million.\nA photo accompanying this announcement is available at: http://www.globenewswire.com/NewsRoom/AttachmentNg/be1c4894-2e27-4063-b08d-e267d05c5e95\nAdditional information is available in Crown Castle's quarterly Supplemental Information Package posted in the Investors section of its website.\nCONFERENCE CALL DETAILS\nCrown Castle has scheduled a conference call for Thursday, January 25, 2018, at 10:30 a.m. Eastern time to discuss its fourth quarter 2017 results. The conference call may be accessed by dialing 800-239-9838 and asking for the Crown Castle call (access code 3593733) at least 30 minutes prior to the start time. The conference call may also be accessed live over the Internet at http://investor.crowncastle.com . Supplemental materials for the call have been posted on the Crown Castle website at http://investor.crowncastle.com .\nA telephonic replay of the conference call will be available from 1:30 p.m. Eastern time on Thursday, January 25, 2018, through 1:30 p.m. Eastern time on Wednesday, April 25, 2018, and may be accessed by dialing 888-203-1112 and using access code 3593733. An audio archive will also be available on the company's website at http://investor.crowncastle.com shortly after the call and will be accessible for approximately 90 days.\nABOUT CROWN CASTLE\nCrown Castle owns, operates and leases more than 40,000 cell towers and approximately 60,000 route miles of fiber supporting small cells and fiber solutions across every major U.S. market. This nationwide portfolio of communications infrastructure connects cities and communities to essential data, technology and wireless service - bringing information, ideas and innovations to the people and businesses that need them. For more information on Crown Castle, please visit www.crowncastle.com .\nNon-GAAP Financial Measures, Segment Measures and Other Calculations\nThis press release includes presentations of Adjusted EBITDA, Adjusted Funds from Operations (\"AFFO\"), Funds from Operations (\"FFO\") and Organic Contribution to Site Rental Revenues, which are non-GAAP financial measures. These non-GAAP financial measures are not intended as alternative measures of operating results or cash flow from operations (as determined in accordance with Generally Accepted Accounting Principles (\"GAAP\")).\nOur measures of Adjusted EBITDA, AFFO, FFO and Organic Contribution to Site Rental Revenues may not be comparable to similarly titled measures of other companies, including other companies in the communications infrastructure sector or other real estate investment trusts (\"REITs\"). Our definition of FFO is consistent with guidelines from the National Association of Real Estate Investment Trusts with the exception of the impact of income taxes in periods prior to our REIT conversion in 2014.\nIn addition to the non-GAAP financial measures used herein, we also provide Segment Site Rental Gross Margin, Segment Network Services and Other Gross Margin and Segment Operating Profit, which are key measures used by management to evaluate our operating segments for purposes of making decisions about allocating capital and assessing performance. These segment measures are provided pursuant to GAAP requirements related to segment reporting. In addition, we provide the components of certain GAAP measures, such as capital expenditures.\nAdjusted EBITDA, AFFO, FFO and Organic Contribution to Site Rental Revenues are presented as additional information because management believes these measures are useful indicators of the financial performance of our business. Among other things, management believes that:\nAdjusted EBITDA is useful to investors or other interested parties in evaluating our financial performance. Adjusted EBITDA is the primary measure used by management (1) to evaluate the economic productivity of our operations and (2) for purposes of making decisions about allocating resources to, and assessing the performance of, our operations. Management believes that Adjusted EBITDA helps investors or other interested parties meaningfully evaluate and compare the results of our operations (1) from period to period and (2) to our competitors, by removing the impact of our capital structure (primarily interest charges from our outstanding debt) and asset base (primarily depreciation, amortization and accretion) from our financial results. Management also believes Adjusted EBITDA is frequently used by investors or other interested parties in the evaluation of the communications infrastructure sector and other REITs to measure financial performance without regard to items such as depreciation, amortization and accretion which can vary depending upon accounting methods and the book value of assets. In addition, Adjusted EBITDA is similar to the measure of current financial performance generally used in our debt covenant calculations. Adjusted EBITDA should be considered only as a supplement to net income computed in accordance with GAAP as a measure of our performance.\nAFFO is useful to investors or other interested parties in evaluating our financial performance. Management believes that AFFO helps investors or other interested parties meaningfully evaluate our financial performance as it includes (1) the impact of our capital structure (primarily interest expense on our outstanding debt and dividends on our preferred stock) and (2) sustaining capital expenditures, and excludes the impact of our (a) asset base (primarily depreciation, amortization and accretion) and (b) certain non-cash items, including straight-lined revenues and expenses related to fixed escalations and rent free periods. GAAP requires rental revenues and expenses related to leases that contain specified rental increases over the life of the lease to be recognized evenly over the life of the lease. In accordance with GAAP, if payment terms call for fixed escalations, or rent free periods, the revenue or expense is recognized on a straight-lined basis over the fixed, non-cancelable term of the contract. Management notes that Crown Castle uses AFFO only as a performance measure. AFFO should be considered only as a supplement to net income computed in accordance with GAAP as a measure of our performance and should not be considered as an alternative to cash flows from operations or as residual cash flow available for discretionary investment.\nFFO is useful to investors or other interested parties in evaluating our financial performance. Management believes that FFO may be used by investors or other interested parties as a basis to compare our financial performance with that of other REITs. FFO helps investors or other interested parties meaningfully evaluate financial performance by excluding the impact of our asset base (primarily depreciation, amortization and accretion). FFO is not a key performance indicator used by Crown Castle. FFO should be considered only as a supplement to net income computed in accordance with GAAP as a measure of our performance and should not be considered as an alternative to cash flow from operations.\nOrganic Contribution to Site Rental Revenues is useful to investors or other interested parties in understanding the components of the year-over-year changes in our site rental revenues computed in accordance with GAAP. Management uses the Organic Contribution to Site Rental Revenues to assess year-over-year growth rates for our rental activities, to evaluate current performance, to capture trends in rental rates, new leasing activities and customer non-renewals in our core business, as well to forecast future results. Organic Contribution to Site Rental Revenues is not meant as an alternative measure of revenue and should be considered only as a supplement in understanding and assessing the performance of our site rental revenues computed in accordance with GAAP.\nWe define our non-GAAP financial measures, segment measures and other calculations as follows:\nNon-GAAP Financial Measures\nAdjusted EBITDA . We define Adjusted EBITDA as net income (loss) plus restructuring charges (credits), asset write-down charges, acquisition and integration costs, depreciation, amortization and accretion, amortization of prepaid lease purchase price adjustments, interest expense and amortization of deferred financing costs, (gains) losses on retirement of long-term obligations, net (gain) loss on interest rate swaps, (gains) losses on foreign currency swaps, impairment of available-for-sale securities, interest income, other (income) expense, (benefit) provision for income taxes, cumulative effect of a change in accounting principle, (income) loss from discontinued operations and stock-based compensation expense.\nAdjusted Funds from Operations . We define Adjusted Funds from Operations as FFO before straight-lined revenue, straight-lined expense, stock-based compensation expense, non-cash portion of tax provision, non-real estate related depreciation, amortization and accretion, amortization of non-cash interest expense, other (income) expense, (gains) losses on retirement of long-term obligations, net (gain) loss on interest rate swaps, (gains) losses on foreign currency swaps, acquisition and integration costs, and adjustments for noncontrolling interests, and less capital improvement capital expenditures and corporate capital expenditures (i.e., sustaining capital expenditures). See \"Sustaining capital expenditures\" and \"Integration capital expenditures\" below for further information regarding our calculation of certain components of AFFO.\nFunds from Operations. We define Funds from Operations as net income plus real estate related depreciation, amortization and accretion and asset write-down charges, less noncontrolling interest and cash paid for preferred stock dividends, and is a measure of funds from operations attributable to CCIC common stockholders.\nOrganic Contribution to Site Rental Revenues. We define the Organic Contribution to Site Rental Revenues as the sum of the change in GAAP site rental revenues related to (1) new leasing activity, including revenues from the construction of small cells and the impact of prepaid rent, (2) escalators and less (3) non-renewals of customer contracts.\nSegment Measures\nSegment Site Rental Gross Margin. We define Segment Site Rental Gross Margin as segment site rental revenues less segment site rental cost of operations, excluding stock-based compensation expense and prepaid lease purchase price adjustments recorded in consolidated site rental cost of operations.\nSegment Network Services and Other Gross Margin. We define Segment Network Services and Other Gross Margin as segment network services and other revenues less segment network services and other cost of operations, excluding stock-based compensation expense recorded in consolidated network services and other cost of operations.\nSegment Operating Profit. We define Segment Operating Profit as segment revenues less segment cost of operations and segment general and administrative expenses, excluding stock-based compensation expense and prepaid lease purchase price adjustments recorded in cost of operations.\nAs a result of our 2017 acquisitions of fiber assets, we have changed the name of our \"Small Cells\" operating segment to \"Fiber\". The change did not impact the composition of the aforementioned segment.\nOther Calculations\nDiscretionary capital expenditures. We define discretionary capital expenditures as those capital expenditures made with respect to activities which we believe exhibit sufficient potential to enhance long-term stockholder value. They consist of (1) improvements to existing communications infrastructure and construction of new communications infrastructure (collectively referred to as \"revenue generating\") and (2) purchases of land assets under towers as we seek to manage our interests in the land beneath our towers.\nSustaining capital expenditures. We define sustaining capital expenditures as those capital expenditures made with respect to either (1) corporate capital expenditures, such as buildings, information technology equipment and office equipment or (2) capital improvement capital expenditures to our communications infrastructure assets that enable our customers' ongoing quiet enjoyment of the communications infrastructure. For periods presented prior to 2018, integration capital expenditures are included within sustaining capital expenditures, as discussed in \"Integration capital expenditures\" below.\nIntegration capital expenditures. We anticipate incurring initial capital expenditures related to integrating Lightower into our existing business. We anticipate that the majority of these expected capital expenditures will be incurred beginning in 2018 and will primarily relate to the overall integration of Lightower’s information technology assets into our business. We believe these expenditures are not indicative of our ongoing financial performance, and therefore their inclusion in our AFFO may hinder usefulness to investors and other interested parties. Moreover, integration capital expenditures were approximately $3.6 million and $0.1 million for the years ended December 31, 2017 and 2016, respectively, and as such, we believe that these costs have not previously been significant enough to warrant separate consideration with regard to the impact to AFFO.\nAs such, for periods presented prior to 2018, integration capital expenditures were included as a component within sustaining capital expenditures. For periods presented beginning January 1, 2018, including our Outlook for first quarter 2018 and full year 2018 included herein, we no longer reflect integration capital expenditures within sustaining capital expenditures and consider integration capital expenditures as its own component of our capital expenditures.\nBecause of our reclassification of integration capital expenditures, our AFFO for historical periods may not be comparable to those periods presented prospectively from and after January 1, 2018, including our Outlook for first quarter 2018 and full year 2018 included herein.\nWe define integration capital expenditures as those capital expenditures made specifically with respect to recent acquisitions that are essential to integrating acquired companies into our business.\nThe tables set forth below reconcile the non-GAAP financial measures used herein to comparable GAAP financial measures. The components in these tables may not sum to the total due to rounding.\nReconciliations of Non-GAAP Financial Measures, Segment Measures and Other Calculations to Comparable GAAP Financial Measures:\nReconciliation of Historical Adjusted EBITDA:\nFor the Three Months Ended For the Twelve Months Ended December 31,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 (in millions) Net income (loss) $ 98.1 $ 124.7 $ 444.6 $ 357.0 Adjustments to increase (decrease) net income (loss): Asset write-down charges 7.0 6.2 17.3 34.5 Acquisition and integration costs 34.4 6.0 61.4 17.5 Depreciation, amortization and accretion 362.2 273.8 1,242.4 1,108.6 Amortization of prepaid lease purchase price adjustments 5.0 5.3 20.1 21.3 Interest expense and amortization of deferred financing costs (a) 160.3 129.4 590.7 515.0 (Gains) losses on retirement of long-term obligations — — 3.5 52.3 Interest income (6.2 ) (0.3 ) (18.8 ) (0.8 ) Other (income) expense 1.5 4.2 (2.0 ) 8.8 (Benefit) provision for income taxes 14.8 4.1 26.0 16.9 Stock-based compensation expense 30.0 21.2 96.4 96.5 Adjusted EBITDA (b)(c) $ 707.0 $ 574.6 $ 2,481.8 $ 2,227.5 (a) See the reconciliation of \"components of interest expense and amortization of deferred financing costs\" herein for a discussion of non-cash interest expense.\n(b) See \" Non-GAAP Financial Measures, Segment Measures and Other Calculations \" herein for a discussion of our definition of Adjusted EBITDA.\n(c) The above reconciliation excludes line items included in our definition which are not applicable for the periods shown. Reconciliation of Current Outlook for Adjusted EBITDA:\nQ1 2018 Full Year 2018 (in millions) Outlook Outlook Net income (loss) $116 to $141 $511 to $591 Adjustments to increase (decrease) net income (loss): Asset write-down charges $9 to $11 $35 to $45 Acquisition and integration costs $13 to $17 $45 to $55 Depreciation, amortization and accretion $380 to $400 $1,566 to $1,601 Amortization of prepaid lease purchase price adjustments $4 to $6 $19 to $21 Interest expense and amortization of deferred financing costs (a) $157 to $167 $642 to $687 (Gains) losses on retirement of long-term obligations $0 to $0 $0 to $0 Interest income $(1 ) to $1 $(2 ) to $2 Other (income) expense $(1 ) to $3 $3 to $5 (Benefit) provision for income taxes $8 to $12 $34 to $42 Stock-based compensation expense $27 to $31 $116 to $124 Adjusted EBITDA (b)(c) $ 745 to $ 755 $ 3,049 to $ 3,094 (a) See the reconciliation of \"components of historical interest expense and amortization of deferred financing costs\" herein for a discussion of non-cash interest expense.\n(b) See \" Non-GAAP Financial Measures, Segment Measures and Other Calculations \" herein for a discussion of our definition of Adjusted EBITDA.\n(c) The above reconciliation excludes line items included in our definition which are not applicable for the periods shown.\nReconciliation of Historical FFO and AFFO:\nFor the Three Months Ended For the Twelve Months Ended (in millions) December 31,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 Net income (loss) $ 98.1 $ 124.7 $ 444.6 $ 357.0 Real estate related depreciation, amortization and accretion 354.1 267.0 1,211.4 1,082.1 Asset write-down charges 7.0 6.2 17.3 34.5 Dividends on preferred stock (29.9 ) (11.0 ) (29.9 ) (44.0 ) FFO (a)(b)(c)(d)(e) $ 429.3 $ 386.9 $ 1,643.3 $ 1,429.5 FFO (from above) $ 429.3 $ 386.9 $ 1,643.3 $ 1,429.5 Adjustments to increase (decrease) FFO: Straight-lined revenue (2.6 ) (5.0 ) 0.3 (47.4 ) Straight-lined expense 22.7 23.1 92.6 94.2 Stock-based compensation expense 30.0 21.2 96.4 96.5 Non-cash portion of tax provision 11.9 2.1 9.2 7.3 Non-real estate related depreciation, amortization and accretion 8.1 6.9 31.0 26.5 Amortization of non-cash interest expense 1.7 3.0 9.4 14.3 Other (income) expense 1.5 4.2 (2.0 ) 8.8 (Gains) losses on retirement of long-term obligations — — 3.5 52.3 Acquisition and integration costs 34.4 6.0 61.4 17.5 Capital improvement capital expenditures (13.5 ) (17.5 ) (40.8 ) (42.8 ) Corporate capital expenditures (11.6 ) (24.6 ) (44.0 ) (46.9 ) AFFO (a)(b)(c)(d)(e) $ 511.8 $ 406.4 $ 1,860.4 $ 1,609.9 (a) See \"Non-GAAP Financial Measures, Segment Measures and Other Calculations\" herein for a discussion of our definitions of FFO and AFFO.\n(b) FFO and AFFO are reduced by cash paid for preferred stock dividends during the period in which they are paid.\n(c) Diluted weighted-average common shares outstanding were 408.1 million, 352.9 million, 383.2 million and 340.9 million for the three months ended December 31, 2017 and 2016 and the twelve months ended December 31, 2017 and 2016, respectively. For all periods presented, the diluted weighted-average common shares outstanding does not include any assumed conversion of the 6.875% Mandatory Convertible Preferred Stock in the share count.\n(d) The above reconciliation excludes line items included in our definition which are not applicable for the periods shown.\n(e) Attributable to CCIC common stockholders.\nReconciliation of Current Outlook for FFO and AFFO:\nQ1 2018 Full Year 2018 (in millions) Outlook Outlook Net income (loss) $116 to $141 $511 to $591 Real estate related depreciation, amortization and accretion $367 to $377 $1,500 to $1,520 Asset write-down charges $9 to $11 $35 to $45 Dividends on preferred stock $(28 ) to $(28) $(113 ) to $(113) FFO (a)(b)(c)(d)(e) $ 477 to $ 487 $ 1,965 to $ 2,010 FFO (from above) $477 to $487 $1,965 to $2,010 Adjustments to increase (decrease) FFO: Straight-lined revenue $(7 ) to $3 $21 to $41 Straight-lined expense $17 to $27 $72 to $92 Stock-based compensation expense $27 to $31 $116 to $124 Non-cash portion of tax provision $3 to $13 $(8 ) to $7 Non-real estate related depreciation, amortization and accretion $13 to $23 $66 to $81 Amortization of non-cash interest expense $0 to $5 $5 to $15 Other (income) expense $(1 ) to $3 $3 to $5 (Gains) losses on retirement of long-term obligations $0 to $0 $0 to $0 Acquisition and integration costs $13 to $17 $45 to $55 Capital improvement capital expenditures $(22 ) to $(12) $(76 ) to $(61) Corporate capital expenditures $(21 ) to $(11) $(56 ) to $(41) AFFO (a)(b)(c)(d)(e)(f) $ 538 to $ 548 $ 2,219 to $ 2,264 (a) The assumption for first quarter 2018 and full year 2018 diluted weighted-average common shares outstanding is 408.1 million based on diluted common shares outstanding as of December 31, 2017. For all periods presented, the diluted weighted-average common shares outstanding does not include any assumed conversion of the 6.875% Mandatory Convertible Preferred Stock in the share count.\n(b) See \" Non-GAAP Financial Measures, Segment Measures and Other Calculations \" herein for a discussion for our definitions of FFO and AFFO.\n(c) FFO and AFFO are reduced by cash paid for preferred stock dividends during the period in which they are paid.\n(d) The above reconciliation excludes line items included in our definition which are not applicable for the periods shown.\n(e) Attributable to CCIC common stockholders.\n(f) Our AFFO for historical periods may not be comparable to those periods presented prospectively from and after January 1, 2018, including our Outlook for first quarter 2018 and full year 2018 herein. See \"Sustaining capital expenditures\" and \"Integration capital expenditures\" within \" Non-GAAP Financial Measures, Segment Measures and Other Calculations\" for further information.\nFor Comparative Purposes - Reconciliation of Previous Outlook for Adjusted EBITDA:\nPreviously Issued Previously Issued Previously Issued Q4 2017 Full Year 2017 Full Year 2018 (in millions) Outlook Outlook Outlook Net income (loss) $91 to $116 $438 to $463 $515 to $595 Adjustments to increase (decrease) net income (loss): Asset write-down charges $9 to $11 $19 to $21 $35 to $45 Acquisition and integration costs $11 to $15 $38 to $42 $64 to $74 Depreciation, amortization and accretion $296 to $310 $1,176 to $1,190 $1,508 to $1,544 Amortization of prepaid lease purchase price adjustments $4 to $6 $19 to $21 $19 to $21 Interest expense and amortization of deferred financing costs $159 to $164 $590 to $595 $644 to $689 (Gains) losses on retirement of long-term obligations $0 to $0 $4 to $4 $0 to $0 Interest income $(1 ) to $1 $(14 ) to $(12) $(2 ) to $2 Other (income) expense $(1 ) to $3 $(4 ) to $0 $3 to $5 (Benefit) provision for income taxes $3 to $7 $14 to $18 $32 to $40 Stock-based compensation expense $23 to $25 $89 to $91 $115 to $120 Adjusted EBITDA (a)(b) $ 624 to $ 629 $ 2,399 to $ 2,404 $ 3,013 to $ 3,058 (a) See \" Non-GAAP Financial Measures, Segment Measures and Other Calculations \" herein for a discussion of our definition of Adjusted EBITDA.\n(b) The above reconciliation excludes line items included in our definition which are not applicable for the periods shown.\nFor Comparative Purposes - Reconciliation of Previous Outlook for FFO and AFFO:\nPreviously Issued Previously Issued Previously Issued Q4 2017 Full Year 2017 Full Year 2018 (in millions) Outlook Outlook Outlook Net income (loss) $91 to $116 $438 to $463 $515\nto $595 Real estate related depreciation, amortization and accretion $290 to $300 $1,147 to $1,157 $1,442\nto $1,463 Asset write-down charges $9 to $11 $19 to $21 $35\nto $45 Dividends on preferred stock $(30 ) to $(30) $(30 ) to $(30) $(113\n) to $(113) FFO (a)(b)(c)(d) $ 376 to $ 381 $ 1,590 to $ 1,595 $1,910 to $ 1,955 FFO (from above) $376 to $381 $1,590 to $1,595 $1,910\nto $1,955 Adjustments to increase (decrease) FFO: Straight-lined revenue $5 to $10 $8 to $13 $57\nto $77 Straight-lined expense $20 to $25 $90 to $95 $70\nto $90 Stock-based compensation expense $23 to $25 $89 to $91 $115\nto $120 Non-cash portion of tax provision $(2 ) to $3 $(4 ) to $1 $(7\n) to $8 Non-real estate related depreciation, amortization and accretion $6 to $10 $29 to $33 $66\nto $81 Amortization of non-cash interest expense $1 to $6 $9 to $14 $6\nto $16 Other (income) expense $(1 ) to $3 $(4 ) to $0 $3\nto $5 (Gains) losses on retirement of long-term obligations $0 to $0 $4 to $4 $0\nto $0 Acquisition and integration costs $11 to $15 $38 to $42 $64\nto $74 Capital improvement capital expenditures $(11 ) to $(6) $(39 ) to $(34) $(73\n) to $(63) Corporate capital expenditures $(19 ) to $(14) $(52 ) to $(47) $(53\n) to $(43) AFFO (a)(b)(c)(d) $ 430 to $ 435 $ 1,779 to $ 1,784 $ 2,219\nto $ 2,264 (a) Previously issued fourth quarter 2017, full year 2017 and full year 2018 Outlook assumes diluted common shares outstanding as of September 30, 2017 of approximately 408.0 million, 383.4 million and 408.0 million, respectively. For all periods presented, the diluted weighted-average common shares outstanding does not include any assumed conversion of the 6.875% Mandatory Convertible Preferred Stock in the share count.\n(b) See \" Non-GAAP Financial Measures, Segment Measures and Other Calculations \" herein for a discussion for our definitions of FFO and AFFO.\n(c) The above reconciliation excludes line items included in our definition which are not applicable for the periods shown.\n(d) Attributable to CCIC common stockholders.\nThe components of changes in site rental revenues for the quarters ended December 31, 2017 and 2016 are as follows:\nThree Months Ended\nDecember 31, (in millions) 2017 2016 Components of changes in site rental revenues (a) : Prior year site rental revenues exclusive of straight-lined revenues associated with fixed escalators (b)(c) $ 812 $ 763 New leasing activity (b)(c) 42 38 Escalators 20 22 Non-renewals (18 ) (21 ) Organic Contribution to Site Rental Revenues (d) 44 39 Straight-lined revenues associated with fixed escalators 3 5 Acquisitions and builds (e) 192 10 Other — — Total GAAP site rental revenues $ 1,051 $ 817 Year-over-year changes in revenue: Reported GAAP site rental revenues 28.6 % Organic Contribution to Site Rental Revenues (d)(f) 5.5 % (a) Additional information regarding Crown Castle's site rental revenues, including projected revenue from customer licenses, tenant non-renewals, straight-lined revenues and prepaid rent is available in Crown Castle's quarterly Supplemental Information Package posted in the Investors section of its website.\n(b) Includes revenues from amortization of prepaid rent in accordance with GAAP.\n(c) Includes revenues from the construction of new small cell nodes, exclusive of straight-lined revenues related to fixed escalators.\n(d) See \"Non-GAAP Financial Measures, Segment Measures and Other Calculations\" herein.\n(e) The financial impact of acquisitions, as measured by the initial contribution, and tower builds is excluded from Organic Contribution to Site Rental Revenues until the one-year anniversary of the acquisition or build.\n(f) Calculated as the percentage change from prior year site rental revenues, exclusive of straight-lined revenues associated with fixed escalations compared to Organic Contribution to Site Rental Revenues for the current period.\nThe components of the changes in site rental revenues for the year ending December 31, 2018 are forecasted as follows:\n(in millions) Full Year\n2017 Full Year\n2018 Outlook Components of changes in site rental revenues (a) : Prior year site rental revenues exclusive of straight-lined revenues associated with fixed escalators (b)(c) $3,186 $3,670 New leasing activity (b)(c) 166 190-220 Escalators 84 80-90 Non-renewals (90) (95)-(75) Organic Contribution to Site Rental Revenues (d) 160 185-225 Straight-lined revenues associated with fixed escalators — (40)-(20) Acquisitions and builds (e) 323 745-765 Other — — Total GAAP site rental revenues $3,669 $4,582-$4,627 Year-over-year changes in revenue: Reported GAAP site rental revenues 13.5% 25.5% (f) Organic Contribution to Site Rental Revenues (d)(g) 5.1% 5.6% (f) (a) Additional information regarding Crown Castle's site rental revenues, including projected revenue from customer licenses, tenant non-renewals, straight-lined revenues and prepaid rent is available in Crown Castle's quarterly Supplemental Information Package posted in the Investors section of its website.\n(b) Includes revenues from amortization of prepaid rent in accordance with GAAP.\n(c) Includes revenues from the construction of new small cell nodes, exclusive of straight-lined revenues related to fixed escalators.\n(d) See \" Non-GAAP Financial Measures, Segment Measures and Other Calculations \" herein.\n(e) The financial impact of acquisitions, as measured by the initial contribution, and tower builds is excluded from Organic Contribution to Site Rental Revenues until the one-year anniversary of the acquisition or build.\n(f) Calculated based on midpoint of Full Year 2018 Outlook.\n(g) Calculated as the percentage change from prior year site rental revenues, exclusive of straight-lined revenues associated with fixed escalations compared to Organic Contribution to Site Rental Revenues for the current period.\nComponents of Historical Interest Expense and Amortization of Deferred Financing Costs:\nFor the Three Months Ended (in millions) December 31,\n2017 December 31,\n2016 Interest expense on debt obligations $ 158.5 $ 126.3 Amortization of deferred financing costs and adjustments on long-term debt, net 5.1 4.6 Other, net (3.3 ) (1.5 ) Interest expense and amortization of deferred financing costs $ 160.3 $ 129.4 Components of Current Outlook for Interest Expense and Amortization of Deferred Financing Costs:\nQ1 2018 Full Year 2018 (in millions) Outlook Outlook Interest expense on debt obligations $157 to $162 $ 645 to $665 Amortization of deferred financing costs and adjustments on long-term debt, net $4 to $7 $ 18 to $23 Other, net $(4 ) to $(2) $ (13 ) to $(8) Interest expense and amortization of deferred financing costs $ 157 to $ 167 $ 642 to $ 687 Debt balances and maturity dates as of December 31, 2017 are as follows:\n(in millions) Face Value Final Maturity Bank debt - variable rate: 2016 Revolver (a) $ 980.0 Aug. 2022 2016 Term Loan A 2,400.9 Aug. 2022 Total bank debt 3,380.9 Securitized debt - fixed rate: Secured Notes, Series 2009-1, Class A-1 (b) 33.1 Aug. 2019 Secured Notes, Series 2009-1, Class A-2 (b) 70.0 Aug. 2029 Tower Revenue Notes, Series 2010-3 (a) 1,250.0 Jan. 2040 Tower Revenue Notes, Series 2010-6 (a) 1,000.0 Aug. 2040 Tower Revenue Notes, Series 2015-1 (a) 300.0 May 2042 Tower Revenue Notes, Series 2015-2 (a) 700.0 May 2045 Total securitized debt 3,353.1 Bonds - fixed rate: 5.250% Senior Notes 1,650.0 Jan. 2023 3.849% Secured Notes 1,000.0 Apr. 2023 4.875% Senior Notes 850.0 Apr. 2022 3.400% Senior Notes 850.0 Feb. 2021 4.450% Senior Notes 900.0 Feb. 2026 3.700% Senior Notes 750.0 June 2026 2.250% Senior Notes 700.0 Sept. 2021 4.000% Senior Notes 500.0 Mar. 2027 4.750% Senior Notes 350.0 May 2047 3.200% Senior Notes 750.0 Sept. 2024 3.650% Senior Notes 1,000.0 Sept. 2027 Total bonds 9,300.0 Capital leases and other obligations 227.8 Various Total Debt $ 16,261.8 Less: Cash and Cash Equivalents (c) $ 314.1 Net Debt $ 15,947.7 ﻿\n(a) The Senior Secured Tower Revenue Notes, Series 2010-3 and 2010-6 have anticipated repayment dates in 2020. The Senior Secured Tower Revenue Notes, Series 2015-1 and 2015-2 have anticipated repayment dates in 2022 and 2025, respectively. In January 2018, the Company issued $750.0 million aggregate principal amount of 3.150% senior unsecured notes due July 2023 and $1.0 billion aggregate principal amount of 3.800% senior unsecured notes due February 2028 and used the net proceeds of such offering to repay (1) in full the Senior Secured Tower Revenue Notes, Series 2010-3 and (2) a portion of the outstanding borrowings under the 2016 Revolver.\n(b) The Senior Secured Notes, Series 2009-1, Class A-1 principal amortizes during the period beginning in January 2010 and ending in 2019 and the Senior Secured Notes, 2009-1, Class A-2 principal amortizes during the period beginning in 2019 and ending in 2029.\n(c) Excludes restricted cash.\nNet Debt to Last Quarter Annualized Adjusted EBITDA is computed as follows:\n(in millions) For the Three Months\nEnded December 31, 2017 Total face value of debt $ 16,261.8 Ending cash and cash equivalents (a) 314.1 Total Net Debt $ 15,947.7 Adjusted EBITDA for the three months ended December 31, 2017 $ 707.0 Last quarter annualized Adjusted EBITDA 2,828.0 Net Debt to Last Quarter Annualized Adjusted EBITDA 5.6 x (b) (a) Excludes restricted cash.\n(b) The Net Debt to Last Quarter Annualized Adjusted EBITDA calculation does not give effect to a full quarter ownership of Lightower, as this acquisition closed on November 1, 2017. For the quarter ended December 31, 2017, Lightower contribution to the Company's Adjusted EBITDA was $83 million.\nComponents of Capital Expenditures:\nFor the Three Months Ended (in millions) December 31, 2017 December 31, 2016 Towers Fiber Other Total Towers Fiber Other Total Discretionary: Purchases of land interests $ 14.6 $ — $ — $ 14.6 $ 16.7 $ — $ — $ 16.7 Communications infrastructure\nconstruction and improvements 76.2 260.6 — 336.8 77.0 123.9 — 200.9 Sustaining: Capital improvement and corporate 10.6 7.8 6.7 25.1 16.9 6.3 18.9 42.1 Total $ 101.4 $ 268.4 $ 6.7 $ 376.5 $ 110.6 $ 130.2 $ 18.9 $ 259.7 Note: See \"Non-GAAP Financial Measures, Segment Measures and Other Calculations\" herein for further discussion of our components of capital expenditures.\nCautionary Language Regarding Forward-Looking Statements\nThis press release contains forward-looking statements and information that are based on our management's current expectations. Such statements include our Outlook and plans, projections, and estimates regarding (1) potential benefits, returns, opportunities and customer and shareholder value which may be derived from our business, assets, investments, acquisitions and dividends, including on a long-term basis, (2) our strategy, strategic position, business model and capabilities and the strength of our business, (3) our customers' investments and the demand from our customers, and the benefits which may be derived therefrom, (4) growth in demand for data and the benefits which may be derived therefrom, (5) our growth, including our revenue growth, long-term prospects and the trends impacting our business, (6) our ability to successfully integrate our recent acquisitions, including Lightower, and the potential benefits and contributions which may be derived from such acquisitions, including (a) our ability to deliver on our dividend growth target and (b) the contribution to or impact on our financial or operating results, including site rental revenues, Adjusted EBITDA, net income, AFFO and Organic Contribution to Site Rental Revenues, (7) leasing environment and activity, (8) our investments, including in towers, small cells and fiber, and the potential growth, returns and benefits therefrom, (9) our dividends, including our dividend plans and the amount of our dividends and dividend growth rate and targets, (10) strategic position of and demand for our communications infrastructure (including fiber solutions and small cells) and services and the geographic location of such demand, (11) cash flows, (12) potential contribution from the deployment of FirstNet, (13) tenant non-renewals, including the impact thereof, (14) capital expenditures, including sustaining capital expenditures and integration capital expenditures and the timing thereof, (15) straight-line adjustments, (16) site rental revenues and estimated growth thereof, (17) site rental cost of operations, (18) net income (loss), (19) Adjusted EBITDA, (20) expenses, including interest expense and amortization of deferred financing costs, (21) FFO, (22) AFFO and estimated growth thereof, (23) Organic Contribution to Site Rental Revenues, (24) our weighted-average common shares outstanding, including on a diluted basis, (25) network services contribution and (26) the utility of certain financial measures, including non-GAAP financial measures. Such forward-looking statements are subject to certain risks, uncertainties and assumptions prevailing market conditions and the following:\nOur business depends on the demand for our communications infrastructure, driven primarily by demand for wireless connectivity, and we may be adversely affected by any slowdown in such demand. Additionally, a reduction in the amount or change in the mix of carrier network investment may materially and adversely affect our business (including reducing demand for tenant additions and network services). A substantial portion of our revenues is derived from a small number of customers, and the loss, consolidation or financial instability of any of our limited number of customers may materially decrease revenues or reduce demand for our communications infrastructure and network services. The business model for small cells contains certain differences from our traditional site rental business, resulting in different operational risks. If we do not successfully operate that business model or identify or manage those operational risks, such operations may produce results that are less than anticipated. Our substantial level of indebtedness could adversely affect our ability to react to changes in our business, and the terms of our debt instruments limit our ability to take a number of actions that our management might otherwise believe to be in our best interests. In addition, if we fail to comply with our covenants, our debt could be accelerated. We have a substantial amount of indebtedness. In the event we do not repay or refinance such indebtedness, we could face substantial liquidity issues and might be required to issue equity securities or securities convertible into equity securities, or sell some of our assets to meet our debt payment obligations. Sales or issuances of a substantial number of shares of our common stock may adversely affect the market price of our common stock. As a result of competition in our industry, we may find it more difficult to achieve favorable rental rates on our new or renewing tenant leases. New technologies may reduce demand for our communications infrastructure or negatively impact our revenues. The expansion or development of our business, including through acquisitions, increased product offerings or other strategic growth opportunities, may cause disruptions in our business, which may have an adverse effect on our business, operations or financial results. We may fail to realize all of the anticipated benefits of the Lightower acquisition or those benefits may take longer to realize than expected. We may also encounter significant difficulties in integrating Lightower’s business. If we fail to retain rights to our communications infrastructure, including the land interests under our towers, our business may be adversely affected. Our network services business has historically experienced significant volatility in demand, which reduces the predictability of our results. New wireless technologies may not deploy or be adopted by customers as rapidly or in the manner projected. If we fail to comply with laws or regulations which regulate our business and which may change at any time, we may be fined or even lose our right to conduct some of our business. If radio frequency emissions from wireless handsets or equipment on our communications infrastructure are demonstrated to cause negative health effects, potential future claims could adversely affect our operations, costs or revenues. Certain provisions of our restated certificate of incorporation, amended and restated by-laws and operative agreements, and domestic and international competition laws may make it more difficult for a third party to acquire control of us or for us to acquire control of a third party, even if such a change in control would be beneficial to our stockholders. We may be vulnerable to security breaches that could adversely affect our business, operations, and reputation. Future dividend payments to our stockholders will reduce the availability of our cash on hand available to fund future discretionary investments, and may result in a need to incur indebtedness or issue equity securities to fund growth opportunities. In such event, the then current economic, credit market or equity market conditions will impact the availability or cost of such financing, which may hinder our ability to grow our per share results of operations. Remaining qualified to be taxed as a REIT involves highly technical and complex provisions of the U.S. Internal Revenue Code. Failure to remain qualified as a REIT would result in our inability to deduct dividends to stockholders when computing our taxable income, which would reduce our available cash. Complying with REIT requirements, including the 90% distribution requirement, may limit our flexibility or cause us to forgo otherwise attractive opportunities, including certain discretionary investments and potential financing alternatives. REIT related ownership limitations and transfer restrictions may prevent or restrict certain transfers of our capital stock. If we fail to pay scheduled dividends on the 6.875% Mandatory Convertible Preferred Stock, in cash, common stock, or any combination of cash and common stock, we will be prohibited from paying dividends on our common stock, which may jeopardize our status as a REIT.\nShould one or more of these or other risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those expected. More information about potential risk factors which could affect our results is included in our filings with the Securities and Exchange Commission. As used in this release, the term \"including,\" and any variation thereof, means \"including without limitation.\"\nCROWN CASTLE INTERNATIONAL CORP.\nCONDENSED CONSOLIDATED BALANCE SHEET (UNAUDITED)\n(in thousands, except share amounts)\nDecember 31,\n2017 December 31,\n2016 ASSETS Current assets: Cash and cash equivalents $ 314,094 $ 567,599 Restricted cash 121,065 124,547 Receivables, net 397,585 373,532 Prepaid expenses 162,366 128,721 Other current assets 138,670 130,362 Total current assets 1,133,780 1,324,761 Deferred site rental receivables 1,300,338 1,317,658 Property and equipment, net 12,932,885 9,805,315 Goodwill 10,021,468 5,757,676 Other intangible assets, net 5,961,759 3,650,072 Long-term prepaid rent and other assets, net 879,340 819,610 Total assets $ 32,229,570 $ 22,675,092 LIABILITIES AND EQUITY Current liabilities: Accounts payable $ 230,279 $ 188,516 Accrued interest 131,790 97,019 Deferred revenues 457,116 353,005 Other accrued liabilities 357,646 221,066 Current maturities of debt and other obligations 115,251 101,749 Total current liabilities 1,292,082 961,355 Debt and other long-term obligations 16,044,369 12,069,393 Other long-term liabilities 2,554,037 2,087,229 Total liabilities 19,890,488 15,117,977 Commitments and contingencies CCIC stockholders' equity: Common stock, $0.01 par value; 600,000,000 shares authorized; shares issued and outstanding: December 31,\n2017—406,280,673 and December 31, 2016—360,536,659 4,063 3,605 6.875% Mandatory Convertible Preferred Stock, Series A, $0.01 par value; 20,000,000 shares authorized; shares\nissued and outstanding: December 31, 2017—1,649,998 and December 31, 2016—0; aggregate liquidation value:\nDecember 31, 2017—$1,649,998 and December 31, 2016—$0\n17 — Additional paid-in capital 16,843,607 10,938,236 Accumulated other comprehensive income (loss) (3,989 ) (5,888 ) Dividends/distributions in excess of earnings\n(4,504,616 ) (3,378,838 ) Total equity 12,339,082 7,557,115 Total liabilities and equity $ 32,229,570 $ 22,675,092\nCROWN CASTLE INTERNATIONAL CORP.\nCONDENSED CONSOLIDATED STATEMENT OF OPERATIONS (UNAUDITED)\n(in thousands, except share and per share amounts)\nThree Months Ended\nDecember 31, Twelve Months Ended\nDecember 31, 2017 2016 2017 2016 Net revenues: Site rental $ 1,050,686 $ 817,381 $ 3,669,191 $ 3,233,307 Network services and other 187,404 215,035 686,414 687,918 Net revenues 1,238,090 1,032,416 4,355,605 3,921,225 Operating expenses: Costs of operations (exclusive of depreciation, amortization and accretion): Site rental 328,945 261,127 1,143,914 1,023,350 Network services and other 109,650 131,105 419,787 417,171 General and administrative 127,466 92,122 426,698 371,031 Asset write-down charges 7,038 6,202 17,322 34,453 Acquisition and integration costs 34,351 5,994 61,431 17,453 Depreciation, amortization and accretion 362,211 273,826 1,242,408 1,108,551 Total operating expenses 969,661 770,376 3,311,560 2,972,009 Operating income (loss) 268,429 262,040 1,044,045 949,216 Interest expense and amortization of deferred financing costs (160,280 ) (129,376 ) (590,682 ) (515,032 ) Gains (losses) on retirement of long-term obligations — — (3,525 ) (52,291 ) Interest income 6,176 342 18,761 796 Other income (expense) (1,468 ) (4,212 ) 1,994 (8,835 ) Income (loss) from continuing operations before income taxes 112,857 128,794 470,593 373,854 Benefit (provision) for income taxes (14,753 ) (4,084 ) (26,043 ) (16,881 ) Net income (loss) 98,104 124,710 444,550 356,973 Dividends on preferred stock (28,359 ) — (58,294 ) (32,991 ) Net income (loss) attributable to CCIC common stockholders $ 69,745 $ 124,710 $ 386,256 $ 323,982 Net income (loss) attributable to CCIC common stockholders, per common share: Net income (loss) attributable to CCIC common stockholders, basic $ 0.17 $ 0.35 $ 1.01 $ 0.95 Net income (loss) attributable to CCIC common stockholders, diluted $ 0.17 $ 0.35 $ 1.01 $ 0.95 Weighted-average common shares outstanding (in thousands): Basic 406,278 352,116 381,740 340,349 Diluted 408,130 352,878 383,221 340,879\nCROWN CASTLE INTERNATIONAL CORP.\nCONDENSED CONSOLIDATED STATEMENT OF CASH FLOWS (UNAUDITED)\n(in thousands)\nTwelve Months Ended December 31, 2017 2016 Cash flows from operating activities: Net income (loss) $ 444,550 $ 356,973 Adjustments to reconcile net income (loss) to net cash provided by (used for) operating activities: Depreciation, amortization and accretion 1,242,408 1,108,551 (Gains) losses on retirement of long-term obligations 3,525 52,291 Amortization of deferred financing costs and other non-cash interest 9,368 14,333 Stock-based compensation expense 91,647 79,338 Asset write-down charges 17,322 34,453 Deferred income tax (benefit) provision 14,888 8,603 Other non-cash adjustments, net (1,320 ) 5,059 Changes in assets and liabilities, excluding the effects of acquisitions: Increase (decrease) in liabilities 176,226 236,642 Decrease (increase) in assets 45,572 (113,979 ) Net cash provided by (used for) operating activities 2,044,186 1,782,264 Cash flows from investing activities: Payments for acquisition of businesses, net of cash acquired (9,260,135 ) (556,854 ) Capital expenditures (1,228,071 ) (873,883 ) Net (payments) receipts from settled swaps (328 ) 8,141 Other investing activities, net (5,487 ) 12,364 Net cash provided by (used for) investing activities (10,494,021 ) (1,410,232 ) Cash flows from financing activities: Proceeds from issuance of long-term debt 3,092,323 5,201,010 Principal payments on debt and other long-term obligations (118,880 ) (95,787 ) Purchases and redemptions of long-term debt — (4,044,834 ) Borrowings under revolving credit facility 2,820,000 3,440,000 Payments under revolving credit facility (1,840,000 ) (4,565,000 ) Payments for financing costs (29,240 ) (41,533 ) Net proceeds from issuance of common stock 4,221,329 1,325,865 Net proceeds from issuance of preferred stock 1,607,759 — Purchases of capital stock (23,307 ) (24,936 ) Dividends/distributions paid on common stock (1,508,705 ) (1,239,158 ) Dividends paid on preferred stock (29,935 ) (43,988 ) Net (increase) decrease in restricted cash 3,808 (7,931 ) Net cash provided by (used for) financing activities 8,195,152 (96,292 ) Net increase (decrease) in cash and cash equivalents - continuing operations (254,683 ) 275,740 Discontinued operations: Net cash provided by (used for) investing activities — 113,150 Net increase (decrease) in cash and cash equivalents - discontinued operations — 113,150 Effect of exchange rate changes 1,178 (101 ) Cash and cash equivalents at beginning of period 567,599 178,810 Cash and cash equivalents at end of period $ 314,094 $ 567,599 Supplemental disclosure of cash flow information: Interest paid 546,543 470,655 Income taxes paid 16,427 13,821\nCROWN CASTLE INTERNATIONAL CORP.\nSEGMENT OPERATING RESULTS (UNAUDITED)\n(in thousands)\nSEGMENT OPERATING RESULTS Three Months Ended December 31, 2017 Three Months Ended December 31, 2016 Towers Fiber Other Consolidated\nTotal Towers Fiber Other Consolidated\nTotal Segment site rental revenues $ 740,560 $ 310,126 $ 1,050,686 $ 712,549 $ 104,832 $ 817,381 Segment network services and other revenue 175,939 11,465 187,404 169,647 45,388 215,035 Segment revenues 916,499 321,591 1,238,090 882,196 150,220 1,032,416 Segment site rental cost of operations 212,090 105,633 317,723 214,878 38,057 252,935 Segment network services and other cost of operations 98,516 9,613 108,129 95,289 34,207 129,496 Segment cost of operations (a) 310,606 115,246 425,852 310,167 72,264 382,431 Segment site rental gross margin (b) 528,470 204,493 732,963 497,671 66,775 564,446 Segment network services and other gross margin (b) 77,423 1,852 79,275 74,358 11,181 85,539 Segment general and administrative expenses (a) 24,537 34,278 46,411 105,226 24,574 14,956 35,838 75,368 Segment operating profit (b) 581,356 172,067 (46,411 ) 707,012 547,455 63,000 (35,838 ) 574,617 Stock-based compensation expense 29,976 29,976 21,241 21,241 Depreciation, amortization and accretion 362,211 362,211 273,826 273,826 Interest expense and amortization of deferred financing costs 160,280 160,280 129,376 129,376 Other income (expenses) to reconcile to income (loss) from continuing operations before income taxes (c) 41,688 41,688 21,380 21,380 Income (loss) from continuing operations before income taxes $ 112,857 $ 128,794 (a) Segment cost of operations excludes (1) stock-based compensation expense of $7.7 million and $4.5 million for the three months ended December 31, 2017 and 2016, respectively and (2) prepaid lease purchase price adjustments of $5.0 million and $5.3 million for the three months ended December 31, 2017 and 2016, respectively. Segment general and administrative expenses exclude stock-based compensation expense of $22.3 million and $16.8 million for the three months ended December 31, 2017 and 2016, respectively.\n(b) See \" Non-GAAP Financial Measures, Segment Measures and Other Calculations \" herein for a discussion of our definitions of segment site rental gross margin, segment network services and other gross margin and segment operating profit.\n(c) See condensed consolidated statement of operations for further information.\nSEGMENT OPERATING RESULTS Twelve Months Ended December 31, 2017 Twelve Months Ended December 31, 2016 Towers Fiber Other Consolidated\nTotal Towers Fiber Other Consolidated\nTotal Segment site rental revenues $ 2,899,554 $ 769,637 $ 3,669,191 $ 2,830,708 $ 402,599 $ 3,233,307 Segment network services and other revenue 636,532 49,882 686,414 603,689 84,229 687,918 Segment revenues 3,536,086 819,519 4,355,605 3,434,397 486,828 3,921,225 Segment site rental cost of operations 844,795 264,059 1,108,854 840,209 147,459 987,668 Segment network services and other cost of operations 374,134 40,691 414,825 344,595 64,859 409,454 Segment cost of operations (a) 1,218,929 304,750 1,523,679 1,184,804 212,318 1,397,122 Segment site rental gross margin (b) 2,054,759 505,578 2,560,337 1,990,499 255,140 2,245,639 Segment network services and other gross margin (b) 262,398 9,191 271,589 259,094 19,370 278,464 Segment general and administrative expenses (a) 93,662 89,048 167,455 350,165 92,903 60,676 143,001 296,580 Segment operating profit (b) 2,223,495 425,721 (167,455 ) 2,481,761 2,156,690 213,834 (143,001 ) 2,227,523 Stock-based compensation expense 96,435 96,435 96,538 96,538 Depreciation, amortization and accretion 1,242,408 1,242,408 1,108,551 1,108,551 Interest expense and amortization of deferred financing costs 590,682 590,682 515,032 515,032 Other income (expenses) to reconcile to income (loss) from continuing operations before income taxes (c) 81,643 81,643 133,548 133,548 Income (loss) from continuing operations before income taxes $ 470,593 $ 373,854 (a) Segment cost of operations excludes (1) stock-based compensation expense of $19.9 million and $22.1 million for the twelve months ended December 31, 2017 and 2016, respectively and (2) prepaid lease purchase price adjustments of $20.1 million and $21.3 million for the twelve months ended December 31, 2017 and 2016, respectively. Segment general and administrative expenses exclude stock-based compensation expense of $76.5 million and $74.5 million for the twelve months ended December 31, 2017 and 2016, respectively.\n(b) See \"Non-GAAP Financial Measures, Segment Measures and Other Calculations\" herein for a discussion of our definitions of segment site rental gross margin, segment network services and other gross margin and segment operating profit.\n(c) See condensed consolidated statement of operations for further information.\nContacts:\nDan Schlanger, CFO\nBen Lowe, VP Corporate Finance\nCrown Castle International Corp.\n713-570-3050\nSource:Crown Castle International Corporation", "external_links": ["http://www.globenewswire.com/NewsRoom/AttachmentNg/be1c4894-2e27-4063-b08d-e267d05c5e95", "https://www.globenewswire.com/Tracker?data=SiiLSs6AMfnFWR-i3JeERrZdDjnnVXwpsegDa4k4rOaGycBCD0vJXbRLqX-PYZ-P4rolPc5FBynS7iuMBnX_0Xhor1yNayXf6mqkltAAtFiCujkh55k9itWnP_Pv-1LL", "https://www.globenewswire.com/NewsRoom/AttachmentNg/987fa22d-d9d6-4922-81b5-381f87e5a469/en", "https://www.globenewswire.com/NewsRoom/AttachmentNg/be1c4894-2e27-4063-b08d-e267d05c5e95/en", "https://www.globenewswire.com/Tracker?data=SiiLSs6AMfnFWR-i3JeERrZdDjnnVXwpsegDa4k4rOYho3NzagWww9e4N_HBN9tj7dxKu31mfQZXxfG-mPmQ1JgXdQVeXL3Lei1bVejwk-bQe4IT5rv5lbyK1gjBR2Bh", "https://www.globenewswire.com/Tracker?data=Dgme5XjKPciQgtyp4UXy8UThN0sFlmcroJ8X1yixi3Xlgf5WRgqvJxo5C5T0_7i5FcX1lL2Ljkju8136biGbEeGPCk0utRwj8a3PXYNxLUY=", "https://www.globenewswire.com/Tracker?data=SiiLSs6AMfnFWR-i3JeERhI6nLXl5JsOSaIQ0sNPZAi0QHGGWwkc6ENfSN1zzpyKBCqYTColjmNocvoNZwWV0Mm9cJIlcuGUK0Zt_OjsCukyNg6S6ZbH6JJA3HXViu1dGgQaeztY0gaKmTtWN85UO1rGXFhP-kBRWGY22-gORxIt1PhhGDIwn6k5TKLh8WM0_mRiOb5Q6Cul-hiueJFMGhTy-Yn02tcxBJ5ktY4pPqvUKOp8Dacgi-ce7EO7jxWtd1flf5cw60bp3loukwuiKw==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0e7e143e-5cbc-4415-b7a0-15149bad28b9", "https://www.globenewswire.com/Tracker?data=SiiLSs6AMfnFWR-i3JeERhI6nLXl5JsOSaIQ0sNPZAi0QHGGWwkc6ENfSN1zzpyKAGuYPGBMWxdqSBGix7N_i6ElvL95yeEmXO2g-UtZEef5qXpk6HiLpYUgWpADPBZJgPb4TFKOJEuJmGEFea2CD3_vLlGT5X5ZNMQBWPdSYgHIksd6AnPrnvZtXd7qTObV2DoNZLYFQukE5t4gINyjhUQIvO5Chj502JXKG3Cu82GcXHfDrdym3WHEtKriGG29GnV7k_lbw8VxnWqJFbTVvA==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/987fa22d-d9d6-4922-81b5-381f87e5a469", "https://www.globenewswire.com/Tracker?data=SiiLSs6AMfnFWR-i3JeERrZdDjnnVXwpsegDa4k4rOYhd2ZG_m4sjdgGs6D_beenjXFiD2NKvnqckhv-xTLy9987viJ5FEhtMR3tc1u9fixOjD87v6Ke7lq0TDDyNyPb"], "published": "2018-01-25T00:15:00.000+02:00", "crawled": "2018-01-25T01:36:48.000+02:00", "highlightTitle": ""}