{"organizations": [], "uuid": "28ad999224a32523aae7d81776b9cf7dd64b16f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-bitauto-announces-appointment-of-president-andy-zhang-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Bitauto Announces Appointment of President Andy Zhang as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:02:00.000+02:00", "replies_count": 0, "uuid": "28ad999224a32523aae7d81776b9cf7dd64b16f6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-bitauto-announces-appointment-of-president-andy-zhang-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "Bitauto Announces Appointment of President Andy Zhang as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "william li", "sentiment": "negative"}, {"name": "andy zhang", "sentiment": "negative"}, {"name": "bitauto", "sentiment": "none"}, {"name": "zhang", "sentiment": "none"}, {"name": "andy", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "sehk", "sentiment": "none"}, {"name": "yixin group limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mr. William Li to continue as Bitauto chairman\nBEIJING, Jan. 12, 2018 /PRNewswire/ -- Bitauto Holdings Limited (\"Bitauto\" or the \"Company\") (NYSE: BITA), a leading provider of internet content & marketing services, and transaction services for China's fast-growing automotive industry, today announced the appointment of Bitauto's President Mr. Andy Zhang to the position of chief executive officer (CEO), effective immediately. Mr. Zhang will remain in his current roles as chairman of the board of directors and CEO of Bitauto's controlled subsidiary Yixin Group Limited (\"Yixin\") (SEHK: 2858), a leading online automobile retail transaction platform in China. Mr. William Li will continue to serve as chairman of Bitauto's board of directors.\nMr. William Li, chairman of Bitauto said, \"Since joining Bitauto in 2006, Andy has built an outstanding track record in his roles as chief financial officer, chief operating officer, and president, and has been core to our success in building and expanding our offerings along China's online automotive value-chain. With his industry expertise and execution capability, Andy is the best candidate to carry out Bitauto's strategies for next-stage growth.\"\n\"Moreover, as the chairman and CEO of Bitauto's subsidiary, Yixin, Andy is ideally positioned to drive synergies between our enhanced media and fast-growing transaction services businesses. I look forward to continuing to work closely with Andy.\"\nMr. Andy Zhang, chief executive officer of Bitauto, said, \"I am honored to take responsibility as Bitauto's chief executive officer. Under William's leadership, Bitauto has achieved great success in building out a robust online media platform serving automakers, dealers and car buyers in China. Through the recent launch of big data and AI-enabled products, such as our upgraded dealer platform Easy Partners, we are able to more efficiently connect China's over 200 million car owners and 5 million auto professionals.\n\"Going forward, we will work on deepening the synergetic collaboration between Bitauto and Yixin to further enhance value offered to our clients, users and investors. We will enable crossover between Bitauto and Yixin user accounts, aggregate data such as trends in automobile functionalities and transactions as well as demographics and preferences of existing and potential car owners, and allow automakers and dealers to offer sales and marketing activities across multiple Bitauto and Yixin channels. I am confident that these initiatives will drive cost efficiencies and further enhance Bitauto and Yixin's market competitiveness.\"\nAbout Bitauto Holdings Limited\nBitauto Holdings Limited (NYSE: BITA) is a leading provider of internet content & marketing services, and transaction services for China's fast-growing automotive industry. Bitauto manages its businesses in three segments: its advertising and subscription business, transaction services business and digital marketing solutions business.\nBitauto's advertising and subscription business provides a variety of advertising services mainly to automakers through its Bitauto.com website as well as corresponding mobile applications, which provide consumers with up-to-date automobile pricing and promotional information, specifications, reviews and consumer feedback. Bitauto also offers subscription services via its SaaS platform, which provides web-based and mobile-based integrated digital marketing solutions to automobile dealers in China. The platform enables dealer subscribers to create their own online showrooms, list pricing and promotional information, provide dealer contact information, place advertisements and manage customer relationships to help them reach a broad set of purchase-minded customers and effectively market their automobiles to consumers online.\nBitauto's transaction services business is primarily conducted by its controlled subsidiary, Yixin Group Limited (SEHK: 2858), a leading online automobile retail transaction platform in China, which provides transaction platform services as well as self-operated financing services.\nBitauto's digital marketing solutions business provides automakers with one-stop digital marketing solutions, including website creation and maintenance, online public relations, online marketing campaigns and advertising.\nFor more information, please visit ir.bitauto.com .\nFor investor and media inquiries, please contact:\nSuki Li\nBitauto Holdings Limited\nPhone: +86-10-6849-2145\nir@Bitauto.com\nClarisse Pan\nFoote Group\nPhone: +86-10-8429-9544\nBitauto@thefootegroup.com\nView original content: http://www.prnewswire.com/news-releases/bitauto-announces-appointment-of-president-andy-zhang-as-chief-executive-officer-300581903.html\nSOURCE Bitauto Holdings Limited", "external_links": ["http://www.prnewswire.com/news-releases/bitauto-announces-appointment-of-president-andy-zhang-as-chief-executive-officer-300581903.html", "http://bitauto.com/", "http://ir.bitauto.com/"], "published": "2018-01-12T13:02:00.000+02:00", "crawled": "2018-01-12T13:14:10.000+02:00", "highlightTitle": ""}