{"organizations": [], "uuid": "c72724a658f4fec1a980b90c200a9660c2af5515", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221345618&w=1200&r=LYNXMPEE0B06X", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-golf-sonyopen/spieth-undone-by-quadruple-bogey-at-waialae-idUSKBN1F10ED", "country": "US", "domain_rank": 408, "title": "Spieth undone by quadruple-bogey at Waialae", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T07:21:00.000+02:00", "replies_count": 0, "uuid": "c72724a658f4fec1a980b90c200a9660c2af5515"}, "author": "", "url": "https://www.reuters.com/article/us-golf-sonyopen/spieth-undone-by-quadruple-bogey-at-waialae-idUSKBN1F10ED", "ord_in_thread": 0, "title": "Spieth undone by quadruple-bogey at Waialae", "locations": [], "entities": {"persons": [{"name": "thomas", "sentiment": "none"}, {"name": "phil mickelson", "sentiment": "none"}, {"name": "justin thomas", "sentiment": "none"}, {"name": "zach johnson", "sentiment": "none"}, {"name": "jordan spieth", "sentiment": "none"}, {"name": "chris kirk", "sentiment": "none"}, {"name": "mackay", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "locations": [], "organizations": [{"name": "spieth", "sentiment": "negative"}, {"name": "waialae frank", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "pingue", "sentiment": "none"}, {"name": "waialae country club", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 5:26 AM / Updated 8 hours ago Spieth undone by quadruple-bogey at Waialae Frank Pingue 3 Min Read \n(Reuters) - Jordan Spieth was basking in the Hawaiian sun until his day fell apart in stunning fashion with a late quadruple-bogey to finish six shots back of first round Sony Open leaders Zach Johnson and Chris Kirk on Thursday. \nDefending champion Justin Thomas, who last year opened with a 59 before going on to set the tour’s all-time scoring record in a 72-hole event at 253, could not conjure up that same magic as he carded a three-under 67, four back of the leaders. \nThomas had five-times major champion Phil Mickelson’s former caddie, Jim ‘Bones’ Mackay, on his bag since his usual looper is unavailable due to injury. \nWorld number two Spieth, the highest ranked player at the Waialae Country Club, overcame a rocky start and was inside the top five when he reached his penultimate hole, the par-four eighth, where disaster struck and he fell back to even par. \nThe British Open champion birdied his final hole for a one-under-par 69 that left him tied for 65th on the Hawaiian island of Oahu, but it did little to ease the sting of the quadruple-bogey eight. \nSpieth’s tee shot at the eighth hole clipped a tree on the left side of the fairway, and his second shot barely advanced after it caromed off another branch. He hit a tree with his next two shots before finally finding a greenside bunker. \nThe three-times major champion, who is riding a string of six consecutive top-10 finishes and had been installed as the favorite a week after a ninth place finish at Kapalua, declined to speak with the media following his round. \nTwice major winner Johnson carded a bogey-free seven-under 63 in the afternoon wave that included a birdie at 18 to grab a share of the lead with early starter Kirk, who stormed into the clubhouse with four birdies over the final six holes. \nThe duo were one shot ahead of Vaughn Taylor, Kyle Stanley, Talor Gooch and Brian Harman. \n“It felt really good, it was nice to get a good start in under my belt,” said Kirk, who hit 11 of 14 fairways and 15 greens in regulation. \n“My swing kind of felt better and better as the day went on. Hit a few loose shots in the front but really kind’ve tightened it up as the round progressed.” Reporting by Frank Pingue in Toronto;  ", "external_links": [], "published": "2018-01-12T07:21:00.000+02:00", "crawled": "2018-01-12T07:31:55.009+02:00", "highlightTitle": ""}