{"organizations": [], "uuid": "bb82939712a27a3274d423d6148b2187330ca5be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-credit-suisse-group-a-g-of-class.html", "country": "US", "domain_rank": 767, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with Losses on their Investment in Credit Suisse Group A.G. of Class Action Lawsuit and Upcoming Deadline - CS", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T21:49:00.000+02:00", "replies_count": 0, "uuid": "bb82939712a27a3274d423d6148b2187330ca5be"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-credit-suisse-group-a-g-of-class.html", "ord_in_thread": 0, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with Losses on their Investment in Credit Suisse Group A.G. of Class Action Lawsuit and Upcoming Deadline - CS", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "united states district court", "sentiment": "none"}], "organizations": [{"name": "credit suisse group a.g. of class action lawsuit", "sentiment": "neutral"}, {"name": "pomerantz llp", "sentiment": "neutral"}, {"name": "credit suisse's american depositary", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "credit suisse", "sentiment": "none"}, {"name": "credit suisse group a.g.", "sentiment": "none"}, {"name": "southern district of new york", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 19, 2018 /PRNewswire/ -- Pomerantz LLP announces that a class action lawsuit has been filed against Credit Suisse Group A.G. (\"Credit Suisse\" or the \"Company\") (NYSE: CS) and certain of its officers. The class action, filed in United States District Court, for the Southern District of New York, is on behalf of a class consisting of investors who purchased or otherwise acquired Credit Suisse's American Depositary Receipts (\"ADRs\") between March 20, 2015 and February 3, 2016, both dates inclusive (the \"Class Period\"), seeking to recover damages caused by defendants' violations of the federal securities laws and to pursue remedies under Sections 10(b) and 20(a) of the Securities Exchange Act of 1934 (the \"Exchange Act\") and Rule 10b-5 promulgated thereunder, against the Company and certain of its top officials.\nIf you are a shareholder who purchased Credit Suisse securities between March 20, 2015, and February 3, 2016, both dates inclusive, you have until February 20, 2018, to ask the Court to appoint you as Lead Plaintiff for the class. To discuss this action, contact Robert S. Willoughby at rswilloughby@pomlaw.com or 888.476.6529 (or 888.4-POMLAW), toll-free, Ext. 9980. Those who inquire by e-mail are encouraged to include their mailing address, telephone number, and the number of shares purchased.\n[Click here to join this class action]\nCredit Suisse is a Swiss multinational financial services holding company, with one of its four primary divisions focused on investment banking. Throughout the Class Period, Defendants repeatedly touted in SEC filings that Credit Suisse maintained \"comprehensive risk management processes and sophisticated control systems\" governing its investment operations. A notable component of the Bank's risk management structure was its high-level Capital Allocation and Risk Management Committee (\"CARMC\"), which was responsible for, among other obligations, establishing and allocating appropriate trading and risk limits for the Bank's various businesses. Significantly, Credit Suisse represented in its Class Period filings that the trading and risk limits set by the CARMC were \"binding\" on the Bank's businesses and trading desks. In addition, only senior management had the authority to temporarily increase a divisional risk committee limit and, even in those cases, such authority was limited to an \"approved percentage for a period not to exceed 90 days.\nContrary to Defendants' representations, however, Credit Suisse's trading and risk limits were not actually binding, and were routinely increased to allow the Bank to accumulate billions of dollars in extremely risky, highly illiquid investments. Indeed, Defendants' scheme enabled the Bank to surreptitiously accumulate nearly $3 billion in distressed debt and U.S. collateralized loan obligations (\"CLOs\"), which were notoriously difficult to liquidate and required significant capital investments. This outsized investment position—which was undisclosed to shareholders—violated Credit Suisse's purported risk protocols and rendered the Bank highly susceptible to losses when credit markets contracted.\nThe Complaint alleges that throughout the Class Period, Defendants made materially false and misleading statements regarding the Company's business, operational and compliance policies. Specifically, Defendants made false and/or misleading statements and/or failed to disclose that: (i) Credit Suisse's risk protocols and control systems were routinely disregarded; (ii) Credit Suisse was amassing billions of dollars of risky, highly illiquid securities, in violation of those risk protocols; and (iii) as a result, Credit Suisse's statements about Credit Suisse's business, operations, and risk controls were false and misleading and/or lacked a reasonable basis.\nBy the beginning of 2016, with credit markets tightening, Defendants could no longer hide the truth. On February 4, 2016, Credit Suisse announced its Fourth Quarter and Full Year 2015 financial results, which included a massive $633 million write-down from the sale of the Bank's outsized, illiquid distressed debt and CLO positions—an incredible loss that would swell to nearly $1 billion in the ensuing weeks. Even worse, Defendant Tidjane Thiam, Credit Suisse's recently-appointed CEO, explicitly admitted that these risky and outsized investments were only allowed because trading limits were continuously raised, which enabled traders take larger and larger positions in violation of the Bank's publicly-touted risk policies. In addition, Thiam acknowledged that Credit Suisse's investment bank had acquired these securities over the years as it was \"trying to generate revenue at all costs.\nIn the wake of Credit Suisse's revelations, the price of the Bank's ADRs declined from a close of $16.69 on February 3, 2016 to a close of $14.89 on February 4, 2016—an 11% drop that wiped out approximately $230 million in market capitalization.\nThe Pomerantz Firm, with offices in New York, Chicago, Los Angeles, and Paris, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, the Pomerantz Firm pioneered the field of securities class actions. Today, more than 80 years later, the Pomerantz Firm continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomerantzlaw.com\nCONTACT:\nRobert S. Willoughby\nPomerantz LLP\nrswilloughby@pomlaw.com\nView original content: http://www.prnewswire.com/news-releases/shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-credit-suisse-group-ag-of-class-action-lawsuit-and-upcoming-deadline--cs-300585377.html\nSOURCE Pomerantz LLP", "external_links": ["https://form.jotformpro.com/pomerantzllp2/creditsuisse", "http://www.prnewswire.com/news-releases/shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-credit-suisse-group-ag-of-class-action-lawsuit-and-upcoming-deadline--cs-300585377.html", "http://www.pomerantzlaw.com/"], "published": "2018-01-19T21:49:00.000+02:00", "crawled": "2018-01-19T22:39:16.011+02:00", "highlightTitle": ""}