{"organizations": [], "uuid": "e1650986049e5b9e7d73e457ae02ac42720b3abe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-chatham-lodging-trust-announces-2017-distribution-characterization.html", "country": "US", "domain_rank": 767, "title": "Chatham Lodging Trust Announces 2017 Distribution Characterization", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.075, "site_type": "news", "published": "2018-01-27T00:15:00.000+02:00", "replies_count": 0, "uuid": "e1650986049e5b9e7d73e457ae02ac42720b3abe"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-chatham-lodging-trust-announces-2017-distribution-characterization.html", "ord_in_thread": 0, "title": "Chatham Lodging Trust Announces 2017 Distribution Characterization", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}], "organizations": [{"name": "chatham lodging trust", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WEST PALM BEACH, Fla.--(BUSINESS WIRE)-- Chatham Lodging Trust (NYSE: CLDT), a lodging real estate investment trust (REIT) that invests in upscale extended-stay hotels and premium-branded, select-service hotels, today announced the characterization of dividends declared in 2017 on its common shares for federal income tax reporting purposes.\nType of\nDividend\nRecord\nDate\nPayment\nDate\nDividend\nPer\nCommon\nShare\nTaxable\nOrdinary\nIncome\nUnrecap.\nSec. 1250\nGain\nReturn of\nCapital\nRegular 1/31/17 2/24/17 0.110 0.094 0.006 0.010 Regular 2/28/17 3/31/17 0.110 0.094 0.006 0.010 Regular 3/31/17 4/28/17 0.110 0.094 0.006 0.010 Regular 4/28/17 5/26/17 0.110 0.094 0.006 0.010 Regular 5/31/17 6/30/17 0.110 0.094 0.006 0.010 Regular 6/30/17 7/28/17 0.110 0.094 0.006 0.010 Regular 7/31/17 8/25/17 0.110 0.094 0.006 0.010 Regular 8/31/17 9/29/17 0.110 0.094 0.006 0.010 Regular 9/29/17 10/27/17 0.110 0.094 0.006 0.010 Regular 10/31/17 11/24/17 0.110 0.094 0.006 0.010 Regular 11/30/17 12/29/17 0.110 0.094 0.006 0.010 Regular 12/29/17 1/26/18 0.110 0.094\n0.006\n0.010\n$1.320 $1.128 $0.072 $0.12 No portion of the dividends declared in 2017 represented foreign taxes or qualified dividend income. The CUSIP number for Chatham Lodging Trust common shares is 16208T102.\nRecord holders of Chatham Lodging Trust common shares who received any of the dividends specified in the table above will receive an Internal Revenue Service (IRS) Form 1099-DIV from Wells Fargo Bank, N.A., the company’s dividend paying agent. The Form 1099-DIV will report the dividends paid with respect to 2017. Shareholders whose shares are held in “street name” will receive an IRS Form 1099 from the bank, brokerage firm or other nominee holding their shares.\nThe regular common share dividend declared for shareholders of record as of December 29, 2017, and payable on January 26, 2018, will be reported on shareholders’ IRS Form 1099 for the 2017 tax year.\nThe information in the table above is based on the preliminary results of work on the tax filings of Chatham Lodging Trust and is subject to correction or adjustment when the filings are completed. No material change in these classifications is expected. The tax information above should not be construed as tax advice and is not a substitute for careful tax planning and analysis. Shareholders are encouraged to consult with their own tax advisors regarding the specific federal, state, local, foreign and other tax consequences of ownership of Chatham Lodging Trust’s common shares and the specific tax treatment of distributions on Chatham Lodging Trust’s common shares.\nAbout Chatham Lodging Trust\nChatham Lodging Trust is a self-advised, publicly-traded real estate investment trust focused primarily on investing in upscale, extended-stay hotels and premium-branded, select-service hotels. The company owns interests in 135 hotels totaling 18,516 rooms/suites, comprised of 40 properties it wholly owns with an aggregate of 6,018 rooms/suites in 16 states and the District of Columbia and a minority investment in two joint ventures that own 95 hotels with an aggregate of 12,498 rooms/suites. Additional information about Chatham may be found at chathamlodgingtrust.com .\nSafe Harbor Statement under the Private Securities Litigation Reform Act of 1995\nStatements about the company's business that are not historical facts are \"forward-looking statements.\" Forward-looking statements are based on current expectations. You should not rely on our forward-looking statements because the matters they describe are subject to known and unknown risks and uncertainties that could cause the company's future results, performance, or achievements to differ significantly from the results, performance, or achievements expressed or implied by such statements. Such risks are set forth under the captions \"Item 1A. Risk Factors\" and \"Forward-Looking Statements\" in our annual report on Form 10-K and under the caption \"Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\" (or similar captions) in our quarterly reports on Form 10-Q, and as described in our other filings with the Securities and Exchange Commission. Forward-looking statements speak only as of the dates on which they are made, and the company undertakes no obligation to update publicly or revise any guidance or other forward-looking statement, whether as a result of new information, future developments, or otherwise, unless required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005582/en/\nChatham Lodging Trust\nDennis Craven, 561-227-1386\ndcraven@cl-trust.com\nSource: Chatham Lodging Trust", "external_links": ["http://www.businesswire.com/news/home/20180126005582/en/"], "published": "2018-01-27T00:15:00.000+02:00", "crawled": "2018-01-27T02:25:27.028+02:00", "highlightTitle": ""}