{"organizations": [], "uuid": "c5bcc3f8262059ce92bac87f9da73671920f0c83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226913577&w=1200&r=LYNXMPEE0U0P2", "site_section": "http://feeds.reuters.com/reuters/topNews\r", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-gymnastics-usa-nassar/ex-usa-gymnastics-doctor-faces-second-sentencing-idUSKBN1FK1CS", "country": "US", "domain_rank": 408, "title": "Ex-USA Gymnastics doctor faces second sentencing", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T13:04:00.000+02:00", "replies_count": 0, "uuid": "c5bcc3f8262059ce92bac87f9da73671920f0c83"}, "author": "", "url": "https://www.reuters.com/article/us-gymnastics-usa-nassar/ex-usa-gymnastics-doctor-faces-second-sentencing-idUSKBN1FK1CS", "ord_in_thread": 0, "title": "Ex-USA Gymnastics doctor faces second sentencing", "locations": [], "entities": {"persons": [{"name": "stev", "sentiment": "negative"}, {"name": "nassar", "sentiment": "none"}, {"name": "michiga", "sentiment": "none"}, {"name": "larry nassar", "sentiment": "none"}], "locations": [{"name": "usa gymnastics", "sentiment": "none"}, {"name": "lansing", "sentiment": "none"}, {"name": "eaton county", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "friess", "sentiment": "none"}, {"name": "usa gymnastics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLOTTE, Mich. (Reuters) - Jessica Thomashow was a 9-year-old gymnast who still liked playing with American Girl dolls when USA Gymnastics doctor Larry Nassar first molested her, she said in a Michigan courtroom on Wednesday.\n“You took advantage of my innocence and trust,” the 17-year-old high school student told Nassar, as he sat, eyes cast downward, in an orange prison jumpsuit. “Why? I ask myself that question all the time, especially when I am lying in bed, crying myself to sleep.”\nOver and over, women and teenagers stood on Wednesday to recount similar stories of abuse: Nassar, the famous physician who treated Olympic stars, played the role of caring doctor before sexually assaulting them in his exam room under the guise of medical treatment, sometimes with their own parents present.\nNassar, 54, previously pleaded guilty to two sets of abuse charges in Michigan’s Ingham and Eaton counties. He was sentenced last week to 40 to 175 years in prison in the Ingham County case after more than 150 victims including Olympic gold medalists recounted abuse at his hands in an emotionally wrenching week-long hearing.\nThe current Eaton County hearing is expected to last days, as at least 65 victims plan to make statements in court. There are 265 victims in total, according to Michigan Circuit Court Judge Janice Cunningham who is presiding over the hearing.\nNassar faces a minimum of 25 years in prison in Eaton County, though he is already assured of spending the rest of his life in prison. He is also serving a 60-year federal prison term for a child pornography conviction.\nThe case has already had ramifications far beyond the courtroom.\nDozens of victims, including international stars like the gold medalist Simone Biles, have accused the U.S. Olympic Committee (USOC), USA Gymnastics (USAG) and Michigan State University (MSU) - where Nassar also worked - of failing to investigate complaints about Nassar stretching back decades.\nLarry Nassar, a former team USA Gymnastics doctor who pleaded guilty in November 2017 to sexual assault charges, sits with his attorneys Matt Newburg and Molly Blythe as victim Jessica Thomashow gives her impact statement during Nassar's second sentencing in the Eaton County Circuit Court in Charlotte, Michigan, U.S., January 31, 2018. REUTERS/Rebecca Cook NO RESALES. NO ARCHIVES. USAG’s entire board of directors has stepped down after U.S. Olympic officials threatened to decertify the governing body. The USOC has announced an independent investigation into its own conduct and that of USA Gymnastics.\nThe U.S. Congress, which is also investigating the USOC, MSU and USAG, has passed legislation to require USOC officials to immediately report any allegations of abuse to law enforcement.\nMichigan’s attorney general has launched a criminal investigation into Michigan State, and the university’s president and top sports official resigned last week following Nassar’s sentencing.\nSlideshow (6 Images) The Michigan State University board of trustees voted unanimously to make John Engler, a former Michigan governor, the school’s interim president on Wednesday, according to reporters in the room.\nAt least two students interrupted the trustees’ meeting to complain that students were being insufficiently consulted. Some faculty members said they would push for a vote of no confidence against the board of trustees over Engler’s appointment, citing his lack of academic experience.\nAt Wednesday’s hearing, several victims who had previously been unidentified stepped forward to make statements, saying they had drawn strength from the scores of women who spoke at Nassar’s first sentencing.\n“Without them, I would not be speaking up and be admitting for the first time to my family and friends and most importantly to myself that I am a survivor of abuse,” Chandler Lynn wrote in a statement read aloud by her mother. “I wish every day that I had the courage to speak up sooner, but all that matters is that I have now, and I‘m not ashamed or scared anymore.”\nMany of the women said they remained traumatized even years later, plagued by nightmares and reluctant to place any trust in others. In some cases, they held onto the fiction that the doctor’s actions were part of legitimate medical treatment until the unfolding scandal made them realize the truth.\n“I used to be excited to meet new people,” said Erin Blayer, 17, a high school soccer player. “And now, quite frankly, I‘m scared. You have destroyed the way I look at male role models in my life.”\nReporting by Steve Friess; Additional reporting by Jonathan Allen; Writing by Joseph Ax; Editing by Will Dunham and Cynthia Osterman\n ", "external_links": [], "published": "2018-01-31T13:04:00.000+02:00", "crawled": "2018-01-31T13:13:48.012+02:00", "highlightTitle": ""}