{"organizations": [], "uuid": "a16509eff53933c8632787dea04333edd23c48db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/22/103572119-GettyImages-119271262.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/12/nordstrom-expected-to-resume-take-private-efforts-but-challenges-remain.html", "country": "US", "domain_rank": 767, "title": "Nordstrom expected to resume take-private efforts, but challenges remain", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T17:02:00.000+02:00", "replies_count": 0, "uuid": "a16509eff53933c8632787dea04333edd23c48db"}, "author": "Lauren Hirsch", "url": "https://www.cnbc.com/2018/01/12/nordstrom-expected-to-resume-take-private-efforts-but-challenges-remain.html", "ord_in_thread": 0, "title": "Nordstrom expected to resume take-private efforts, but challenges remain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "nordstrom", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}, {"name": "leonard green & partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nordstrom family members expect to resume their efforts to take the department store private later this year, but challenges to locate the necessary financing still lie ahead, sources tell CNBC.\nThe family group, which owns 31.2 percent of the retailer, last year linked up with private equity firm Leonard Green & Partners to help fund their efforts to take it private. Those effort stalled over financing skittishness , amid a bubbling number of bankrupt leveraged buyouts and general uncertainty over the future of retail.\nThe family group in October announced it was putting its take-private plans on hold until after the holidays.\nGoing private remains a desirable course for at least some of the family members. The public market has been punishing to all retailers, hindering them from making many of the moves necessary to readjust to the changing retail landscape. For Nordstrom and others, these include costly e-commerce investments and the need to realign stores.\nAs the family members seek to cobble together financing, they may still find themselves short. Family members must grapple with how much equity they want to roll over into a potential deal, rather than reducing their exposure to retail by selling a portion of their stake. Leonard Green, likewise, has limits to the amount it is willing to put in.\nMeantime, it remains unclear lenders will be able to assemble the roughly $7 billion to $8 billion in debt needed get a deal done. To fill the gap, they may look for a third party to contribute roughly $1 billion in junior capital, some of the sources said. Such a party would likely be an investor like a family office or mezzanine fund, they added.\nLeonard Green remains in close contact with Nordstrom, but has not formally resumed its efforts yet, sources say.\nNordstrom shares were recently trading up more than 3 percent on the news.\nNordstrom reported its holiday results for the first time in its history this week. The holiday season, as with many retailers, was relatively strong, with same-store sales rising 1.2 percent. It reported an increase of 1 percent in comparable sales at its full-line stores, while Nordstrom Rack and Hautelook had an increase of 2.9 percent. Overall, net sales were up 2.5 percent .\nWhile solid, sources familiar with its take-private efforts don't view those sales as a clear home run, they told CNBC. The results beat Macy's , but were weaker than both Kohl's and J.C. Penney .\nNordstrom has long been viewed as best-in-class among department stores, due to its strong customer service, real estate and affordable high-end price point.\nThe sources declined to be named because the information is confidential. Nordstrom and Leonard Green did not respond to requests for comment.\nMeantime, a relatively strong holiday shopping season across the board has not alleviated long-term concerns about the future of the retail industry. Public and private investors alike are concerned that as department stores downsize, some of that business will go away, not shift to their competitors.\nAt ICR's retail conference in Orlando, Florida, this week, several industry sources noted that private equity firms are still fearful of investing in retail . Many have been burned by big bets on leveraged buyouts that resulted in restructuring or bankruptcy.\nOthers noted the conference felt relatively quiet compared with last year.", "external_links": [], "published": "2018-01-12T17:02:00.000+02:00", "crawled": "2018-01-12T17:08:03.003+02:00", "highlightTitle": ""}