{"organizations": [], "uuid": "d0d8981dc4e5b7bd64c32633908340638b16c3ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-oil/oil-markets-near-three-year-highs-supported-by-healthy-demand-idUSL3N1PB1AB", "country": "US", "domain_rank": 408, "title": "Oil markets near three-year highs, supported by healthy demand", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.548, "site_type": "news", "published": "2018-01-16T10:17:00.000+02:00", "replies_count": 0, "uuid": "d0d8981dc4e5b7bd64c32633908340638b16c3ee"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-oil/oil-markets-near-three-year-highs-supported-by-healthy-demand-idUSL3N1PB1AB", "ord_in_thread": 0, "title": "Oil markets near three-year highs, supported by healthy demand", "locations": [], "entities": {"persons": [], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE, Jan 16 (Reuters) - Brent crude prices were on Tuesday settling in around $70 per barrel, levels last seen before the start of an oil market slump in late 2014.\nPrices have been driven up by production curbs in OPEC nations and Russia, as well as by robust demand on the back of healthy global economic growth.\nBrent crude futures, the international benchmark for oil prices, had dipped 22 cents to $70.04 per barrel by 0213 GMT on Tuesday from the previous day’s close. But traders said Brent was well supported overall around this level.\nBrent hit $70.37 a barrel on Monday, its strongest since December, 2014, which was at the beginning of a three year oil price slump.\nU.S. West Texas Intermediate (WTI) crude futures were at $64.53 a barrel, up 23 cents, or 0.36 percent from their last settlement. WTI hit a December-2014 peak of $64.89 a barrel in early trading.\n“We have updated our supply/demand balances to reflect a faster-than-expected tightening in the global oil market due to improving cyclical conditions, cold winter weather, and higher than expected OPEC compliance,” Bank of America Merrill Lynch said.\nIn an effort to tighten markets and prop up prices, the Organization of the Petroleum Exporting Countries (OPEC) and Russia started to withhold production in January last year, and the cuts are set to last through 2018.\nThis restraint has coincided with healthy oil demand and economic growth, pushing up crude prices by more than 13 percent since early December.\n“We now see a deficit of 430,000 barrels per day (bpd) in 2018 compared to 100,000 bpd prior, and thus see Brent crude oil prices averaging $64 per barrel in 2018 compared to $56 prior. Our WTI projection also moves up from $52 per barrel to $60 per barrel for the same reasons,” Bank of America Merrill Lynch said.\nCrude futures have also been supported by a weak dollar, which fell to its lowest level in three years late on Monday against a basket of other leading currencies.\nA weakening dollar often triggers investment into liquid commodity futures like gold and crude oil.\nThe major factor that in late 2017 held back crude prices, the surge in U.S. production, has stalled at least temporarily as icy winter weather in North America has shut down some facilities.\nInstead of hitting 10 million bpd this month, as widely expected, U.S. production C-OUT-T-EIA fell from 9.8 million bpd in December to 9.5 million bpd currently.\nDespite this, most analysts still expect U.S. production to break through 10 million bpd soon.\nReporting by Henning Gloystein; Editing by Joseph Radford\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T10:17:00.000+02:00", "crawled": "2018-01-16T13:29:19.013+02:00", "highlightTitle": ""}