{"organizations": [], "uuid": "93346c62a28f2f7a7e59db2bdf8efb81904a5eab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/25/104048061-GettyImages-145544923.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/mortgage-processing-delays-expected-with-government-shutdown.html", "country": "US", "domain_rank": 767, "title": "Mortgage-processing delays expected with government shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-22T18:58:00.000+02:00", "replies_count": 0, "uuid": "93346c62a28f2f7a7e59db2bdf8efb81904a5eab"}, "author": "Sarah O'Brien", "url": "https://www.cnbc.com/2018/01/22/mortgage-processing-delays-expected-with-government-shutdown.html", "ord_in_thread": 0, "title": "Mortgage-processing delays expected with government shutdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "fannie mae", "sentiment": "none"}, {"name": "freddie mac", "sentiment": "none"}, {"name": "federal housing administration", "sentiment": "none"}, {"name": "zillow research", "sentiment": "none"}, {"name": "rural housing service", "sentiment": "none"}, {"name": "u.s. department of veterans affairs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Homebuyers waiting on news about their mortgage applications might have to sit tight, thanks to the federal government shutdown now in its third day.\nAbout 3,500 federally backed mortgage loans per business day could face processing delays due to the legislative impasse in efforts to fund the federal government, according to Zillow Research.\nThe Senate reached a deal mid-Monday to end the government shutdown until Feb. 8, with a House vote expected later in the afternoon.\nIf the shutdown ends, it would be good news for mortgage applicants. A shutdown lasting as long as the last one — Oct. 1 to Oct. 16, 2013, covering 12 business days — would mean that upwards of 42,000 would-be buyers would see their mortgage applications take longer to process, Zillow said.\nGetty Images A couple sits with a mortgage consultant in Miami. \"The government shutdown will have an impact on real estate transactions should it continue for an extended period of time,\" said Elizabeth Mendenhall, president of the National Association of Realtors, in a statement to CNBC.\nThe shutdown, which began Saturday after congressional leaders failed to reach a spending agreement to keep the government funded, means that many federal functions are shuttered.\nWith hundreds of thousands of government workers furloughed — excluding those considered essential employees — paperwork backups are likely to occur in the mortgage-approval process.\nBorrowers with loans from the U.S. Department of Veterans Affairs, the Federal Housing Administration or the Rural Housing Service will feel the most direct impact because furloughed workers are involved in processing those loans. However, those loans comprise a small fraction of mortgage loans processed nationwide, according to Zillow.\nshow chapters Government shutdown hits IRS hard as 57% of its workers are furloughed      6 Hours Ago | 01:31 Loans backed by Fannie Mae and Freddie Mac — which are government-sponsored agencies — are unaffected by the shutdown. These mortgages represent about two-thirds of all federally backed loans nationwide.\nAdditionally, if your lender is in the process of verifying all of your documents, there could be delays in income verification with the Internal Revenue Service. About 57 percent of the IRS's 80,000 employees are furloughed.\nDuring the 2013 government shutdown, about 17 percent of closings were delayed, according to a survey done by National Association of Realtors. The group attributed most of those delays to an income-verification backlog at the IRS.\nMore from Investor Toolkit: \nWhy some fear is good for investors \nAdvisors turn to life coaches and counselors \nRetirees leave $100B in Social Security benefits on table", "external_links": [], "published": "2018-01-22T18:58:00.000+02:00", "crawled": "2018-01-22T18:58:22.000+02:00", "highlightTitle": ""}