{"organizations": [], "uuid": "32815af2e32fa2fa89ee9ea4575010f987762bce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220622776&w=1200&r=LYNXMPEE081E8", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-energy-grid-murray-energy/coal-mining-executive-blasts-u-s-regulators-for-rejecting-subsidies-idUSKBN1EY2EP", "country": "US", "domain_rank": 408, "title": "Coal mining executive blasts U.S. regulators for rejecting subsidies", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T21:37:00.000+02:00", "replies_count": 0, "uuid": "32815af2e32fa2fa89ee9ea4575010f987762bce"}, "author": "", "url": "https://www.reuters.com/article/us-usa-energy-grid-murray-energy/coal-mining-executive-blasts-u-s-regulators-for-rejecting-subsidies-idUSKBN1EY2EP", "ord_in_thread": 0, "title": "Coal mining executive blasts U.S. regulators for rejecting subsidies", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "robert murray", "sentiment": "none"}, {"name": "valerie volcovici", "sentiment": "none"}, {"name": "murray", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "coal", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "murray energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 7:46 PM / Updated 40 minutes ago Coal mining executive blasts U.S. regulators for rejecting subsidies Valerie Volcovici 3 Min Read \nWASHINGTON (Reuters) - Robert Murray, the chief executive one of America’s largest coal mining companies, criticized U.S. regulators on Tuesday for rejecting the Trump administration’s proposed subsidies for aging coal and nuclear power plants - saying the decision could lead to higher electricity costs for consumers. \nThe backlash from one of President Donald Trump’s big supporters reflects frustration in the coal industry as the White House struggles to deliver on a promise to revive the coal sector, which has been in decline for years due to competition from cheaper natural gas. \n“This is a bureaucratic cop-out,” Murray, CEO of privately-held Murray Energy [MUYEY.UL], said in a statement. “I fear that we will now immediately observe the announcement of further decommissioning of nuclear and coal-fired electricity generation that will further exacerbate this critical situation,” he said, warning that power prices could rise as a result. \nEnergy Secretary Rick Perry had proposed the idea of allowing coal and nuclear power plants to recoup their operating costs through regulated pricing in September, saying the perk was needed to stem a string of plant closures in recent years and shore up grid resilience. \nThe Federal Energy Regulatory Commission (FERC) on Monday rejected the proposal saying it was not needed, may not be fair to competing generators using natural gas, solar energy or wind, and was beyond the commission’s responsibilities. \nThe decision by the five-person commission - which includes four Trump administration nominees - was a setback for Trump’s pro-coal agenda, but cheered an unusual alliance of natural gas drillers, environmentalists, and renewable energy advocates that either compete with coal or oppose its emissions. \nMurray vigorously lobbied the Trump and the Energy Department last year to help the coal industry, saying he handed the administration a three-page list of suggestions to do so. \nIn his statement Tuesday, he said the recent bout of cold weather across the United States underscored the need to keep coal and nuclear plants functioning. \nBut FERC commissioner Richard Glick said Monday that coal and nuclear plants had been unreliable. \n“Many coal and nuclear plants with significant on-site fuel supplies have failed to function during extreme weather events because those fuel supplies froze, flooded or were otherwise unavailable,” Glick wrote. \nAnother Trump ally, former campaign manager Corey Lewandowski, also blasted the FERC decision on Tuesday, saying the commissioners had failed to carry out the president’s agenda. Reporting By Valerie Volcovici", "external_links": [], "published": "2018-01-09T21:37:00.000+02:00", "crawled": "2018-01-09T22:37:14.023+02:00", "highlightTitle": ""}