{"organizations": [], "uuid": "e5d0e0c0cbfb54fc3cd667e0a1d8b63291d16875", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/thyssenkrupp-agm/update-1-thyssenkrupp-pledges-to-refine-strategy-amid-investor-concerns-idUSL8N1PE1PS", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Facing investor pressure, Thyssenkrupp pledges to refine strategy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:23:00.000+02:00", "replies_count": 0, "uuid": "e5d0e0c0cbfb54fc3cd667e0a1d8b63291d16875"}, "author": "", "url": "https://www.reuters.com/article/thyssenkrupp-agm/update-1-thyssenkrupp-pledges-to-refine-strategy-amid-investor-concerns-idUSL8N1PE1PS", "ord_in_thread": 0, "title": "UPDATE 2-Facing investor pressure, Thyssenkrupp pledges to refine strategy", "locations": [], "entities": {"persons": [{"name": "tom käckenhoff  frankfurt/bochum", "sentiment": "none"}, {"name": "heinrich hiesinger", "sentiment": "none"}, {"name": "hiesinger", "sentiment": "none"}, {"name": "cevian", "sentiment": "none"}, {"name": "christoph steitz", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "thyssenkrupp", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "tata steel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 9:42 AM / Updated an hour ago UPDATE 3-Facing investor pressure, Thyssenkrupp pledges to refine strategy Reuters Staff \n* Thyssenkrupp to hold strategy discussion in May \n* Will adapt financial targets after Tata deal \n* Major investor Cevian abstains from endorsing management \n* Shares hit 4-month high on hopes for change (Adds Cevian comment, updates shares) \nBy Christoph Steitz and Tom Käckenhoff \nFRANKFURT/BOCHUM, Germany Jan 19 (Reuters) - Thyssenkrupp will review its strategy after a planned tie-up with India’s Tata Steel, its chief executive said on Friday, fuelling investor hopes for further steps to make the sprawling industrial group more focused. \nShares in the German elevators-to-submarines maker rose as much as 4.9 percent to a four month high of 26.41 euros. \nFrustrated shareholders, led by activist Cevian, have been putting pressure on Thyssenkrupp boss Heinrich Hiesinger, saying the company was too unwieldy and should be broken up further. \nHiesinger, at the helm since 2011, has already cut the number of business units, slashed debt and embarked on a mission to transform Thyssenkrupp into a group focused on technology and less on the steel business for which it is famous. \nIt agreed to merge its European steel business with that of Tata Steel in September, saying global overcapacity had made a restructuring of the mainstay business necessary. That has not stopped investors from asking for more changes. \n“Naturally Thyssenkrupp will look different with the establishment of the joint venture in the steel area,” Hiesinger said at the group’s annual general meeting. \n“We will hone our strategic vision and also adapt our financial targets accordingly.” \nThe management and supervisory boards will hold an annual strategy discussion in May and more changes to the group’s structure could follow if they made sense. \n“If we can improve a business ourselves within the group, we will do it. Wherever we see a better future for a business outside the group, we pursue this solution consistently.” \nOf the shareholders that cast a vote to ratify actions of management in the financial year 2016/2017, 96.32 percent endorsed the board. Cevian abstained from the vote, a spokesman for the investor said, highlighting its support for more change. \nShares in Thyssenkrupp closed 4.45 percent higher, helped also by comments that dividends could rise again in the future. \nCevian, Thyssenkrupp’s second-largest shareholder with an 18 percent stake, has been the most vocal supporter of a further break-up of the group, saying it had underperformed the market and should be worth twice its current share price. \nIts co-founder Lars Foerberg this week told Reuters that Thyssenkrupp’s complex structure was the “root cause” of its underperformance, suggesting spin-offs, listings and joint venture for the other business areas. \n“Hiesinger has said that he cannot rule out changes in the company’s structure. Activist investor Cevian is raising the pressure in this area,” said Frederik Altmann, equity trader at Frankfurt-based Alpha. \n“And the reiteration that Foerberg sees potential for the share price to double if Thyssen breaks up the overly complex structure fuels speculation.” Additional reporting by Patricia Uhlig; Editing by Keith Weir and Mark Potter", "external_links": [], "published": "2018-01-19T15:23:00.000+02:00", "crawled": "2018-01-19T16:23:31.008+02:00", "highlightTitle": ""}