{"organizations": [], "uuid": "4099e7ea269a9aeaa2a21dd9f676e3dd6dcf3167", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-rise-on-china-growth-us-govt-funding-woes-dent-dollar-idUSL3N1PE21R", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Asia stocks rise on China growth, US govt funding woes dent dollar", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T13:45:00.000+02:00", "replies_count": 0, "uuid": "4099e7ea269a9aeaa2a21dd9f676e3dd6dcf3167"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-rise-on-china-growth-us-govt-funding-woes-dent-dollar-idUSL3N1PE21R", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asia stocks rise on China growth, US govt funding woes dent dollar", "locations": [], "entities": {"persons": [{"name": "hong", "sentiment": "none"}, {"name": "shinichi saoshiro", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "msci asia-pacific", "sentiment": "negative"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* MSCI Asia-Pacific index up 0.4 pct, Nikkei rises 0.1 pct\n* Evidence of accelerated Chinese econ growth support sentiment\n* Worries over possible US government shutdown weigh on dollar\n* US lawmakers try to cobble together deal to avert shutdown\n* Uptick in U.S. production drags crude prices down\nBy Shinichi Saoshiro\nTOKYO, Jan 19 (Reuters) - Asia stocks shook off losses on Wall Street and edged up to record highs on Friday following China’s announcement of faster-than-expected fourth quarter growth, while worries over a possible U.S. government shutdown weighed on the dollar.\nMSCI’s broadest index of Asia-Pacific shares outside Japan added 0.4 percent to a record top. The index had climbed 1.3 percent on the week, during which it rode a surge in global equities.\nOptimism over the global economic growth outlook and improved corporate earnings have helped share markets rally at the start of 2018. Supporting economic confidence was data on Thursday that showed China’s growth in 2017 accelerated for the first time in seven years.\nShanghai advanced 0.5 percent to two-year peaks and Hong Kong’s Hang Seng reached a record high.\nSouth Korea’s KOSPI gained 0.1 percent, as did Japan’s Nikkei.\n“We are likely to see equity markets go through temporary adjustment phases. But in the longer term, it looks to be a good year for global markets,” said Soichiro Monji, chief strategist at Daiwa SB Investments in Tokyo.\n“It is no longer about other markets following gains by U.S. equities. Fundamentals are strong globally, backed by major positive changes, such as the digital revolution we are currently witnessing,” he said.\nWall Street fell on Thursday as losses in industrials and interest-rate sensitive sectors offset marginal gains in tech stocks. The Dow slipped 0.37 percent, dipping from record highs.\nAgainst the yen, the dollar was 0.25 percent lower at 110.840. It rose to 111.480 on Thursday before slipping on concerns over a possible U.S. government shutdown as lawmakers struggled to cobble a federal budget deal.\nThe focus was on whether lawmakers can reach at least a temporary agreement to fund government operations by a deadline on Friday.\nThe U.S. House of Representatives on Thursday passed a bill to fund government operations through Feb. 16 and avoid agency shutdowns this weekend when existing funding expires. However, a bitter fight broke out in the Senate after the House passage, leaving the legislation hanging in the balance.\n“There is a good chance the negotiations will take place until the last minute and keep the dollar on the defensive. That said, both the Republicans and Democrats want to avert a shutdown, especially with the U.S. midterm elections looming,” said Masafumi Yamamoto, chief forex strategist at Mizuho Securities in Tokyo.\nThe euro rose 0.2 percent to $1.2260 after gaining about 0.45 percent overnight.\nThe common currency advanced to a three-year peak above $1.2300 earlier this week on expectations that the European Central Bank would take steps towards winding back on stimulus measures to normalise monetary policy. The euro’s rally was tempered later as some ECB officials voiced worries about the currency’s strength.\nThe dollar index against a basket of six major currencies lost 0.1 percent to 90.378. It had fallen to a three-year trough of 90.113 on Thursday and was poised to shed 0.65 percent on the week.\nChina’s yuan breached the psychologically important 6.4 dollar level for the first time in more than two years the day after Beijing said annual growth was 6.8 percent in October-December, slightly above forecasts.\nThe Australian dollar rose 0.2 percent to $0.8017, crawling back toward a four-month high of $0.8023 set on Wednesday and the New Zealand dollar was little changed at $0.7301.\nBrent crude futures lost 1 percent to $68.62 per barrel following data showing an uptick in U.S. production. U.S. crude oil futures slipped 1.2 percent to $63.19 per barrel.\nU.S. crude soared to a three-year peak near $65.00 on Tuesday, supported by supply cuts led by the Organization of the Petroleum Exporting Countries and a weaker dollar. But the advance has stalled as the market remains wary that output cuts will eventually trigger price hikes and lead to increased supply from shale-rich United States.\nSpot gold gained 0.3 percent to $1,331.26 an ounce as the dollar eased. The precious metal had risen to a four-month top of $1,344.43 on Monday on the back of the dollar’s sharp downturn. (Reporting by Shinichi Saoshiro; Editing by Sam Holmes and Richard Borsuk)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T13:45:00.000+02:00", "crawled": "2018-01-19T14:24:32.002+02:00", "highlightTitle": ""}