{"organizations": [], "uuid": "555324b8063efd842f77249c4370bd013386a27a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218763990&w=1200&r=LYNXMPEE0109B", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-saudi-oil-prices/saudi-arabia-may-keep-february-arab-light-crude-to-asia-near-three-year-high-idUSKBN1ER0HL", "country": "US", "domain_rank": 408, "title": "Saudi Arabia may keep February Arab Light crude to Asia near three-year high", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-02T16:44:00.000+02:00", "replies_count": 0, "uuid": "555324b8063efd842f77249c4370bd013386a27a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-saudi-oil-prices/saudi-arabia-may-keep-february-arab-light-crude-to-asia-near-three-year-high-idUSKBN1ER0HL", "ord_in_thread": 0, "title": "Saudi Arabia may keep February Arab Light crude to Asia near three-year high", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE (Reuters) - Top oil exporter Saudi Arabia is expected to keep the February price for Arab Light crude steady, close to the highest in more than three years, while lowering prices for medium and heavy grades, a survey by Reuters showed on Tuesday.\nRobust spot crude demand and stronger margins for middle distillates will underpin Saudi crude prices, but the producer was unlikely to raise prices further as Asia’s “demand is expected to fall because of spring maintenance”, one of the four respondents said in the survey.\nThe official selling price (OSP) for Saudi’s flagship Arab Light crude could pause in February, after rising in January for the fifth straight month to its highest since September 2014, the survey showed.\nBackwardation between first and third month cash Dubai was relatively unchanged in December from the previous month, the respondents said. In a backwardated market, prompt prices are higher than those in future months, indicating strong demand for immediate supplies.\nA widening of Brent’s premium to Dubai reduced arbitrage supplies from the Atlantic Basin and spurred Asia’s demand for Middle East and Russian crude, pushing spot premiums for these grades in February to multi-month highs.\nStill, Saudi Aramco could trim February prices for Arab Medium and Arab Heavy on weaker returns from fuel oil production, the respondents said. The average fuel oil margins in Asia fell about 50 percent in December from the previous month, Reuters data showed. Saudi crude OSPs are usually released around the fifth of each month, and set the trend for Iranian, Kuwaiti and Iraqi prices, affecting more than 12 million barrels per day (bpd) of crude bound for Asia.\nSaudi Aramco sets its crude prices based on recommendations from customers and after calculating the change in the value of its oil over the past month, based on yields and product prices.\nSaudi Aramco officials as a matter of policy do not comment on the kingdom’s monthly OSPs.\nReporting by Florence Tan; Editing by Tom Hogue\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-02T16:44:00.000+02:00", "crawled": "2018-01-02T18:15:05.002+02:00", "highlightTitle": ""}