{"organizations": [], "uuid": "b97f1ec68f2a079b706973359dc87680cb9619e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226108729&w=1200&r=LYNXMPEE0R0VL", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-jordan-military/u-s-delivers-helicopters-to-bolster-jordans-border-defences-idUKKBN1FH0XK", "country": "US", "domain_rank": 408, "title": "U.S. delivers helicopters to bolster Jordan's border defences", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T23:20:00.000+02:00", "replies_count": 0, "uuid": "b97f1ec68f2a079b706973359dc87680cb9619e4"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-jordan-military/u-s-delivers-helicopters-to-bolster-jordans-border-defences-idUKKBN1FH0XK", "ord_in_thread": 0, "title": "U.S. delivers helicopters to bolster Jordan's border defences", "locations": [], "entities": {"persons": [{"name": "suleiman al-khalidi", "sentiment": "none"}, {"name": "joseph votel", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "zarqa", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "isis", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. central command", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 9:22 PM / Updated 18 minutes ago U.S. delivers helicopters to bolster Jordan's border defences Suleiman Al-Khalidi 3 Min Read \nZARQA, Jordan (Reuters) - The United States has delivered the last batch of Black Hawk helicopters for Jordan’s rapid deployment force to bolster border defences and engage in cross-border operations against Islamic militants. \nU.S. officials say that military aid to Jordan, one of the largest recipients of its foreign military financing, helps to build the kingdom’s military capabilities as part of a wider regional strategy \nWashington has announced it plans to stay in Syria long after Islamic State has been defeated and has military bases in the northeastern part of the war-torn country. \nIn a handover ceremony attended by U.S. Central Command chief General Joseph Votel and Jordan’s Chief of Staff, the helicopters landed in a mock hostage rescue by special forces. \n“The United States remains committed to supporting the Jordanian air force efforts to protect Jordan’s borders and deter counter acts of terror and contribute to defeat ISIS coalition operations,” said Henry Wooster, Charge d‘Affaires of the U.S. Embassy in Jordan, during the ceremony at the King Abdullah air base 35 km northeast of the capital. (R-L) Commander of the U.S. Central Command General Joseph Votel, acting U.S. Ambassador to Jordan Henry Wooster, Jordanian Prince Faisal bin Hussein, and Jordanian Chairman of the Joints Chief of Staff Mahmoud Freihat attend the ceremony during which Black Hawk helicopters will be delivered to Jordan from the U.S. government, at a Jordanian military base near the town of Zarqa, Jordan, January 28, 2018.REUTERS/Stringer \nThe Black Hawk helicopters are central to the U.S.-funded quick reaction force set up by Jordan to counter Islamic State, which remains a threat despite having been driven out of large areas of neighbouring Iraq and Syria. \n“The force is capable of moving troops and supplies anywhere in Jordan on short notice to reinforce border security and repel potential incursions,” Wooster said. Slideshow (3 Images) \nU.S. Patriot missiles are stationed in the kingdom and the U.S. army has hundreds of trainers in the country. \nJordan’s location makes it an ideal logistics and supply hub for the Unites States, including its Tanf garrison in the southeastern Syrian desert. \n“U.S. Jordanian military cooperation is very strong and a key component in our joint effort to defeat Daesh,” said Brigadier General Jaber al-Abbadi, Jordan’s air force commander. \nSince the start of the Syrian conflict in 2011, Washington has spent millions of dollars to help Amman set up an elaborate surveillance system known as the Border Security Programme to stem infiltration by militants from Syria and Iraq. Reporting by Suleiman Al-Khalidi; Editing by David Goodman", "external_links": [], "published": "2018-01-28T23:20:00.000+02:00", "crawled": "2018-01-28T23:47:15.045+02:00", "highlightTitle": ""}