{"organizations": [], "uuid": "fff45fd69afb3282cd3c5a8bd4dc1f2626e85361", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-hirerightas-jurgen-leijdekker-appointed-to-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "HireRight’s Jurgen Leijdekker Appointed to Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-01-24T19:15:00.000+02:00", "replies_count": 0, "uuid": "fff45fd69afb3282cd3c5a8bd4dc1f2626e85361"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-hirerightas-jurgen-leijdekker-appointed-to-chief-executive-officer.html", "ord_in_thread": 0, "title": "HireRight’s Jurgen Leijdekker Appointed to Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "leijdekker", "sentiment": "negative"}, {"name": "jurgen leijdekker", "sentiment": "negative"}, {"name": "cal", "sentiment": "negative"}, {"name": "jurgen", "sentiment": "none"}, {"name": "david r. fontaine", "sentiment": "none"}], "locations": [{"name": "irvine", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "none"}, {"name": "corporate risk holdings", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leijdekker to lead company through advancements in customer experience, global expansion\nIRVINE, Calif.--(BUSINESS WIRE)-- HireRight , a leading provider of global employment background checks, drug and health screening, education verification, and electronic Form I-9 and E-Verify solutions, today announced that Jurgen Leijdekker has been appointed to the position of chief executive officer, effective immediately. Leijdekker joined HireRight a year ago as president and chief operating officer and during his tenure the Company has made substantial investments in world-class innovative technology and products. HireRight plans to continue its commitment to developing technology solutions that will better enable all aspects of the background screening process, including the candidate experience.\n“HireRight excelled under Jurgen’s leadership in 2017,” said David R. Fontaine, CEO of HireRight’s parent company Corporate Risk Holdings, LLC, and the former CEO of HireRight. “We saw record revenue growth, and our U.S. Net Promoter Score reached an all-time high. This year will be truly transformational for HireRight, and I have the utmost confidence in Jurgen’s ability to lead the strategic direction of the company going forward.”\nEarlier this year, HireRight announced the enhancement of its market-leading drug and health screening service offering, which now features more than 22,000 collection facilities—the largest in the background screening industry—and a more expansive suite of mobile-enabled electronic scheduling services.\nHireRight, in the coming months, plans to implement new advancements and enhancements to its platform and infrastructure designed to ensure an unrivaled customer and candidate experience, prioritizing the security and privacy of customer and applicant data, while expanding and streamlining its global capabilities.\n“The global developments we have in store this year will create an unmatched background screening experience for both our customers and their candidates,” said Leijdekker. “I’m honored to have the opportunity to lead HireRight through this exciting time in its history, and look forward to enabling our customers to make the best hiring decisions.”\nAbout HireRight\nHireRight delivers global employment background checks, drug testing, education verification, and electronic Form I-9 and E-Verify solutions through an innovative platform to help companies hire the right candidates, so they can grow successfully, and efficiently—no matter their size or where they operate. HireRight offers extensive screening solutions that can be tailored to the unique needs of the organization, giving employers additional peace of mind about their people and vetting processes. HireRight’s platform can be integrated with existing HR platforms, making it easy to use and giving candidates the best possible experience.\nHireRight is headquartered in Irvine, CA, with offices across the globe. Learn more at www.HireRight.com .\nAbout Corporate Risk Holdings, LLC\nCorporate Risk Holdings is headquartered in New York, NY and is the parent company of two separately managed businesses, each a leading global provider of risk and information services: HireRight, specializing in employment background screening and eligibility solutions; and Kroll, recognized worldwide for risk management services spanning cyber security, investigations, due diligence, compliance and security risk management. Additional information about Corporate Risk Holdings is available at www.corprisk.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005250/en/\nInfinite Global\nKelsey Eidbo, 415-732-7804\nKelseyE@infiniteglobal.com\nSource: HireRight", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hireright.com%2F&esheet=51747847&newsitemid=20180124005250&lan=en-US&anchor=HireRight%C2%A0&index=2&md5=cea8b145bbd7da9ad6368fdf7c81bf54", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hireright.com%2F&esheet=51747847&newsitemid=20180124005250&lan=en-US&anchor=www.HireRight.com&index=3&md5=30810f9f47531cf582dab10459f47df7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.corprisk.com&esheet=51747847&newsitemid=20180124005250&lan=en-US&anchor=www.corprisk.com&index=4&md5=c0ffa73519269d7f0cae9e206c435a5e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hireright.com%2F&esheet=51747847&newsitemid=20180124005250&lan=en-US&anchor=HireRight&index=1&md5=5017a8671e7437f601abebea0d9892b2", "http://www.businesswire.com/news/home/20180124005250/en/"], "published": "2018-01-24T19:15:00.000+02:00", "crawled": "2018-01-24T19:31:48.012+02:00", "highlightTitle": ""}