{"organizations": [], "uuid": "6a45df532881c2adbf45c10721e14384acc08e98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-britain-environment-plastic/britains-plastic-waste-measures-dont-go-far-enough-say-campaigners-idUSKBN1F11XO", "country": "US", "domain_rank": 408, "title": "Britain's plastic waste measures don't go far enough, say campaigners", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T23:39:00.000+02:00", "replies_count": 0, "uuid": "6a45df532881c2adbf45c10721e14384acc08e98"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-environment-plastic/britains-plastic-waste-measures-dont-go-far-enough-say-campaigners-idUSKBN1F11XO", "ord_in_thread": 0, "title": "Britain's plastic waste measures don't go far enough, say campaigners", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "leonie cooper", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "assembly", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - New measures by Britain to turn the tide on plastic waste do not go far enough, environmentalists said on Friday.\nUnveiling a new environmental agenda, British Prime Minister Theresa May said on Thursday Britain would eradicate avoidable plastic waste in the next quarter century.\nThe moves - including extending a 5 pence (7 cents) charge for a single-use plastic bag to all retailers and introducing packaging-free aisles in supermarkets - were welcomed by campaigners but also criticized for missing an opportunity to do more to protect the planet.\n“What we need is serious action immediately. Whether it’s ocean plastics, air pollution or climate change, there’s a huge price to pay for every day that goes by without progress,” said Leonie Cooper on the environment committee of the London Assembly - a body elected to hold the mayor’s office to account.\nAt current rates, in 25 years’ time, British people would have used 192.5 billion plastic bottles, she said.\nTwo-thirds of all plastic packaging in Britain ends up being landfilled or burned, according to research by the Ellen MacArthur Foundation.\n“There must be better recycling systems, which avoid confusion for citizens and have better economies of scale,” said Rob Opsomer of the Ellen MacArthur Foundation.\nEight million tonnes of plastic - bottles, packaging and other waste - are dumped into the ocean every year, killing marine life and entering the human food chain, says the United Nations Environment Programme (UNEP).\nIf current pollution rates continue, there will be more plastic in the sea than fish by 2050.\nEnvironment groups said the most glaring omission in May’s scheme was the lack of support for deposit return schemes that pay consumers to return plastic bottles after use and are common in many parts of the world including Denmark, Germany and Australia.\nOn this issue, Scotland has taken the lead.\n“The Scottish Government has committed to a deposit return scheme covering plastic bottles, and now it is proposing a ban on the manufacture of plastic-stemmed cotton buds,” said Iain Gulland, chief executive of Zero Waste Scotland in an email.\nMay said she would look at plastic bottle deposits and would launch a call for evidence next month on whether to impose taxes or charges on single use plastics.\nThis week Britain banned the use of plastic microbeads, common in body scrubs and shower gels that end up in oceans.\nThe Environmental Audit Committee, a cross-party green watchdog, has also recommended a 25 pence “latte levy” to be charged on top of the price of a beverage to combat the overuse of plastic-lined disposable coffee cups.\nReporting by Varsha Saraogi; Editing by Ros Russell; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, corruption and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T23:39:00.000+02:00", "crawled": "2018-01-13T14:35:21.027+02:00", "highlightTitle": ""}