{"organizations": [], "uuid": "1effc5c30b04802e7bf7e8148315ec1b980397f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104974098-GettyImages-905759476.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/shark-tank-corcoran-invests-300000-in-the-dough-bar-doughnuts.html", "country": "US", "domain_rank": 767, "title": "'Shark Tank': Corcoran invests $300,000 in The Dough Bar doughnuts", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-29T19:35:00.000+02:00", "replies_count": 0, "uuid": "1effc5c30b04802e7bf7e8148315ec1b980397f1"}, "author": "Ali Montag", "url": "https://www.cnbc.com/2018/01/29/shark-tank-corcoran-invests-300000-in-the-dough-bar-doughnuts.html", "ord_in_thread": 0, "title": "'Shark Tank': Corcoran invests $300,000 in The Dough Bar doughnuts", "locations": [], "entities": {"persons": [{"name": "eddy chen", "sentiment": "negative"}, {"name": "corcoran", "sentiment": "negative"}, {"name": "ondrea", "sentiment": "negative"}, {"name": "marquez", "sentiment": "negative"}, {"name": "daniel zigler", "sentiment": "none"}, {"name": "fernandez", "sentiment": "none"}, {"name": "ondreaand marquez fernandez", "sentiment": "none"}], "locations": [], "organizations": [{"name": "abc", "sentiment": "negative"}, {"name": "shark tank", "sentiment": "none"}, {"name": "dough bar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "While exercising at the gym with his wife Ondrea , Marquez Fernandez found himself scrolling through his phone, looking at pictures of food.\nThe couple was struck with inspiration to take something generally laden with fat and sugar — a doughnut — and try to recreate it as a health food.\n\"A light bulb just went off, 'Hey what if we make healthy doughnuts?\" Marquez says on ABC's \"Shark Tank.\" \"The next day we went out and bought all this stuff, and we were acting like mad scientists making doughnuts.\"\nThat idea led to over $1.2 million worth sales for their business, The Dough Bar, which ships baked doughnuts with 11 grams of protein in flavors like \"cookie monster\" and \"apple pie\" directly to consumers. \nOndrea and Marquez Fernandez came on \"Shark Tank\" seeking $300,000 for a 15 percent stake in their business. To help demonstrate their product, they brought along professional body builder Daniel Zigler, a spokesman for the product.\n\nThe business launched in April of 2015 , and has since sold over 280,000 doughnuts, Marquez says on the show. The doughnuts are packaged and sent plain, and customers can frost and decorate the snack themselves. A plain doughnut is 150 calories , and with toppings, it is about 200 calories. \n\"Our average price for one box of four [doughnuts] is $15.50,\" Ondrea says on the show. \"The box actually costs us about $7.30, we make about a 53 percent margin right now.\"\n\nFor Marquez, who left a job as a nurse and respiratory therapist for the family upstart, The Dough Bar is a way to build something to support his family, and set an example for his young son Mason. \nIt was a mindset he learned from his own father. \n\"I grew up in a pretty rough neighborhood, my father was a single parent and worked really hard to just really grind and put food on the table for us,\" Marquez says. \"I've always known that I wanted to be an entrepreneur and take care of my family.\"\n\nSo far, the dedication to the business has paid off: The Dough Bar has a 31 percent customer return rate, he explains on the show. And Marquez's father is a full-time employee.\n\"The fact that you have a 30 percent re-order rate, that is phenomenal in the online food business,\" investor Barbara Corcoran says. \"It means that people really like it.\"\nThat number, along with the entrepreneurs themselves, was enough to convince her to make an offer to invest $300,000 for a 30 percent stake in the company.\n\"I love the fact that you bootstrapped your business,\" Corcoran says. \"We don't hear it enough anymore. You have such a happy relationship, it is bouncing off your skin. Happy partners make money together.\" \nThe Fernandez family's story also resonated with guest shark and former MLB baseball player Alex Rodriguez. \n\"I love to do business with people who have a 'PhD,'\" Rodriguez says. \"I don't mean from Harvard or Yale, I mean poor, hungry and driven. And both of you have that.\"\nTweet \nTweet \nRodriguez made an offer together with investor Lori Greiner to invest a combined $400,000 for 30 percent of the business, but Corcoran was quick to negotiate.\nShe outbid Greiner and Rodriguez, agreeing to drop the amount of equity she would take and invest $300,000 for a 20 percent stake in the business. \n\"Happy to do it,\" Corcoran says on the show.\nTweet \n\"This means the world,\" Marquez says about the investment. \"We started the business really about family, and I think about my father ... we're excited to get this thing going.\"\nDon't miss: Daymond John broke his 'Red Lobster' rule to do these 'Shark Tank' deals—now they're his top 2 companies, making millions \nshow chapters How to get on 'Shark Tank,' according to those who have been there      12:50 PM ET Fri, 17 March 2017 | 00:50 Like this story? Like CNBC Make It on Facebook ! \nDisclaimer: CNBC owns the exclusive off-network cable rights to \"Shark Tank.\"", "external_links": [], "published": "2018-01-29T19:35:00.000+02:00", "crawled": "2018-01-29T19:37:57.006+02:00", "highlightTitle": ""}