{"organizations": [], "uuid": "eff538b36b267d7a4df4c1dd45d1ca8a730fafb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223332960&w=1200&r=LYNXMPEE0I0RE", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-refinery-biofuels-bankruptcy/philadelphia-refiners-woes-pose-test-for-u-s-biofuel-policy-idUSKBN1F81AE", "country": "US", "domain_rank": 408, "title": "Philadelphia refiner's woes pose test for U.S. biofuel policy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T14:43:00.000+02:00", "replies_count": 0, "uuid": "eff538b36b267d7a4df4c1dd45d1ca8a730fafb6"}, "author": "", "url": "https://www.reuters.com/article/us-refinery-biofuels-bankruptcy/philadelphia-refiners-woes-pose-test-for-u-s-biofuel-policy-idUSKBN1F81AE", "ord_in_thread": 0, "title": "Philadelphia refiner's woes pose test for U.S. biofuel policy", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "min read  new york", "sentiment": "none"}, {"name": "jarrett renshaw", "sentiment": "none"}, {"name": "epa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "philadelphia energy solutions", "sentiment": "none"}, {"name": "environmental protection agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - The worsening financial condition of East Coast oil refiner Philadelphia Energy Solutions will present a new test for America’s controversial biofuels policy, legal experts say, revealing whether the government can collect a massive biofuels-related debt from a company in distress.\nThe outcome could have implications for other refiners struggling to cope with the Renewable Fuels Standard, a law administered by the Environmental Protection Agency that requires refiners to blend biofuels into the nation’s fuel supply every year, or buy credits from those who do.\nPES, the oldest and largest refiner on the East Coast, is carrying a shortfall of such credits owed to the EPA likely worth over $100 million, while its management also considers filing for bankruptcy ahead of a separate $550 million short-term loan that comes due in March.\nIf the company goes bust, it would be the first test of how courts and the EPA treat the outstanding credit obligations of a bankrupt company under the RFS.\nAn EPA official did not say if the agency would pursue the credits, saying “EPA cannot comment on potential future bankruptcy proceedings.”\nPES also declined to comment.\nRobin Phelan, a veteran bankruptcy attorney and head of Dallas-based Phelan Law, said the answer may come down to the discretion of the EPA, which he said would be legally permitted to pursue the claim in court but which has in the past shown flexibility in collecting from distressed companies.\n“In my experience, sometimes they are totally inflexible and other times they will work with you,” Phelan said.\nThe administration of President Donald Trump has already demonstrated a willingness to consider the concerns of the refining industry, and is mediating talks between representatives of the refiners and ethanol producers aimed at coming up with tweaks acceptable to both sides.\nThe political stakes are high, observers say. PES employs thousands of blue-collar workers from various trades, such as pipefitters and sheet metal workers, and sits in the key electoral state of Pennsylvania.\nChris Ward, chair of the Polsinelli law firm’s bankruptcy group, said EPA is likely to deal with a biofuel credit situation less aggressively than it would, say, an urgent waste cleanup or some other threat to public safety, but said there was no clear precedent to look at either.\nManny Grillo, chair of the financial restructuring practice at the Houston-based Baker Botts law firm, said that whatever the outcome, it would be widely watched, as other refining companies like PBF Energy ( PBF.N ) and Valero ( VLO.N ) also gripe about the financial strains of the RFS.\n“The government could... allow the cost to be discharged. The question is how the government treats the compliance issues moving forward,” he said.\n“The EPA could be violating the Equal Protection clause if they grant relief to one refiner without giving it to all of them. It’s a slippery slope,” said Ed Hirs, an energy economist at the University of Houston.\nPES, majority owned by the Carlyle Group ( CG.O ), entered 2017 with a $111.4 million short position in the biofuels credit market, federal filings show. In recent months, it has been adding to that short position by selling credits, two sources say.\nThe Philadelphia refinery’s struggles have emerged as a potential flashpoint in the ongoing debate between Big Oil and Big Corn over the future of the RFS.\nCritics have argued the company’s woes are an example of what is wrong with the program, while supporters say the company’s troubles are more closely related to its lack of access to cheaper crude oil supplies.\nWriting by Richard Valdmanis; Editing by Bernadette Baum\n ", "external_links": [], "published": "2018-01-19T14:43:00.000+02:00", "crawled": "2018-01-19T16:12:05.002+02:00", "highlightTitle": ""}