{"organizations": [], "uuid": "b762269e0a970496ba84cef7de1de2929a02f615", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218786523&w=1200&r=LYNXMPEE010DI", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-global-economy/euro-zone-factory-growth-surges-to-record-more-uneven-in-asia-idINKBN1ER0QL", "country": "US", "domain_rank": 408, "title": "Euro zone factory growth surges to record; more uneven in Asia", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T13:02:00.000+02:00", "replies_count": 0, "uuid": "b762269e0a970496ba84cef7de1de2929a02f615"}, "author": "", "url": "https://in.reuters.com/article/us-global-economy/euro-zone-factory-growth-surges-to-record-more-uneven-in-asia-idINKBN1ER0QL", "ord_in_thread": 0, "title": "Euro zone factory growth surges to record; more uneven in Asia", "locations": [], "entities": {"persons": [{"name": "marius zaharia", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "hamburg", "sentiment": "none"}, {"name": "elbe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "jonathan cable", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON/HONG KONG (Reuters) - Euro zone factories ended 2017 growing at their fastest pace in more than two decades while performance in Asia was more uneven, with its third-largest economy India leading the field and manufacturing giant China unexpectedly resilient.\nFILE PHOTO: A container ship is seen at the shipping terminal Eurokai in the Port of Hamburg, Germany November 6, 2017. REUTERS/Fabian Bimmer/File Photo With a similar business survey covering the United States forecast to be strong, the synchronized global growth that took hold last year looks set to continue based on the first major economic data releases of 2018.\nEuro zone factory activity is handily outpacing its peers, including Britain. That has added to expectations that the European Central Bank, which this month will halve its monthly bond purchases, will shutter the program later this year.\n“The euro zone manufacturing boom gained further momentum in December, rounding off the best year on record and setting the scene for a strong start to 2018,” said Chris Williamson, chief business economist at IHS Markit, which compiles the surveys.\nThe December euro zone final manufacturing Purchasing Managers’ Index (PMI) was 60.6, matching an earlier preliminary reading, the highest since the survey began in June 1997. Any figure above 50 represents growth.\nThe euro rose to a three-month high above $1.20.\nThe factory output index, which feeds into a broader set of data including services due on Thursday, rose to 62.2 from 61.0 in November. That was its highest in over 17 years and a reading exceeded only once in the survey’s more than two decades of history.\nGermany and France, the euro zone’s two largest economies look to be expanding in tandem, striking their highest manufacturing PMI numbers on record and for 17 years, respectively. But growth slowed in Italy, the bloc’s third largest economy.\nIn Britain, which is in the process of negotiating a withdrawal from the European Union, growth tailed off sharply from a four-year high the previous month.\n“Strong growth will be hard to sustain in 2018,” noted Samuel Tombs, UK economist at consultancy Pantheon Macroeconomics. He pointed out that the UK PMI had underperformed the euro zone’s by the most since June 2008.\n“British manufacturers ... are failing to make the most of the rebound in global trade,” Tombs wrote.\nUNEVEN PERFORMANCE IN ASIA Factory activity hit a five-year high in India and the best in 6-1/2 years in Taiwan, and also picked up in China. But activity contracted in South Korea, Malaysia and Indonesia, a sign that regional interest rate hikes are likely to be gradual.\n“Robust external demand and accommodative domestic monetary policy should help keep Asian manufacturing sectors in good shape,” said Krystal Tan, Asia economist at Capital Economics.\nIn China, manufacturing growth unexpectedly picked up to a four-month high in December amid a surge in new orders, suggesting continued strength in global trade.\nThe Caixin/Markit Manufacturing Purchasing Managers’ Index (PMI) rose to 51.5 from 50.8 in November, and far outpaced expectations in a Reuters poll for a dip to 50.6.\nThe China PMI, which pushed Asian shares .MIAPJ0000PUS to their highest in a decade, was somewhat at odds with a much larger official China PMI survey on Sunday. It showed a slowdown in growth amid a crackdown on pollution and measures to curb risky financing and cool the housing market.\nThe difference, analysts say, stems from the fact that the Caixin/PMI index tracks smaller, private firms, more sensitive to exports.\nChina is expected to have grown by close to 7 percent in 2017, but the world’s second largest economy is likely to slow in the new year on the back of those measures, highlighted as policy priorities at October’s key Communist Party congress.\nBeijing is expected to target 2018 growth of around 6.5 percent.\n“We believe a moderate growth slowdown to be more visible in the first half of 2018, especially on the investment front, due mainly to the tight financial conditions and a cool down of the property market,” BofA Merrill Lynch economists said.\nChina’s slowdown means that for the rest of Asia, the pace of rate increases is unlikely to match that of the U.S. Federal Reserve, which is likely to raise interest rates three times this year, and possibly more.\nThere will likely be “only a few rate hikes here and there across the region over the coming two years,” HSBC analysts wrote in a note, even as they expect Asian economies to keep chugging along in 2018, led by tech and trade.\nIndia’s PMI showed factory activity expanding at the fastest pace in five years, buoyed by a rise in output and new orders, which allowed firms to raise prices. The data firmed up views that interest rates in Asia’s third-largest economy have probably bottomed.\nPMIs for Japan, which surpassed growth expectations in 2017 on the back of the surging tech and trade cycle globally, will be released on Thursday.\nThe U.S. manufacturing PMI is due later on Tuesday.\nReporting by Jonathan Cable and Marius Zaharia; Editing by Ross Finley and Catherine Evans\n ", "external_links": [], "published": "2018-01-02T13:02:00.000+02:00", "crawled": "2018-01-02T13:24:50.021+02:00", "highlightTitle": ""}