{"organizations": [], "uuid": "0e75ee81dad4948fb6f02d8b99a21522cc07f5ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-trump-carrier/more-layoffs-at-indiana-factory-trump-made-deal-to-keep-open-idUSL1N1P6071", "country": "US", "domain_rank": 408, "title": "More layoffs at Indiana factory Trump made deal to keep open", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.061, "site_type": "news", "published": "2018-01-12T04:32:00.000+02:00", "replies_count": 0, "uuid": "0e75ee81dad4948fb6f02d8b99a21522cc07f5ae"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-trump-carrier/more-layoffs-at-indiana-factory-trump-made-deal-to-keep-open-idUSL1N1P6071", "ord_in_thread": 0, "title": "More layoffs at Indiana factory Trump made deal to keep open", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "indiana", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "carrier corp.", "sentiment": "none"}, {"name": "carrier", "sentiment": "none"}, {"name": "united technologies corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "INDIANAPOLIS, Jan 11 (Reuters) - More than 200 workers clocked in for their final shifts on Thursday at Carrier Corp. in Indianapolis in the latest round of layoffs at a plant President Donald Trump toured in December 2016 to trumpet a deal to save jobs and prevent its closure.\nUnder pressure from the newly-elected Trump, Carrier and its parent company United Technologies Corp, dropped its plan in late 2016 to close the plant and move 1,400 factory jobs to Mexico. In return, the company received $7 million in state tax breaks to stay in Indiana.\nTrump praised the deal, under which he said 1,100 jobs would be saved, as a model of how he would push American companies to keep jobs in the country.\nIt undoubtedly saved hundreds of positions at Carrier, but manufacturing workers who now face unemployment say they feel let down by a deal that started out as a presidential campaign rallying cry but turned out to be less than it appeared.\nCarrier said this week that 1,100 workers will remain at the factory, upholding its deal with Trump. They include 730 manufacturing jobs and about 300 engineering and administrative positions that were never slated to move.\nBut Carrier also laid off 338 manufacturing workers in July and another 215 this week. Those jobs are going to the company’s plant in Monterrey, Mexico, where workers make about $3 an hour, according to Indiana union officials.\n“Yes he (Trump) saved jobs, yes he did. But he didn’t save mine, he didn’t save manufacturing jobs. He saved office personnel, okay?” said Renee Elliott, 45, who supported Trump in the 2016 election and was among those being laid off on Thursday.\nElliott began working at Carrier in 2013 as a seasonal employee making $13 per hour. She currently makes $18 per hour, taking advantage of overtime shifts, and sometimes works seven days a week.\nDISAPPOINTED BY DEAL She does not know what she will do next and said she is disappointed that Trump did not make a better deal for factory-floor workers.\nDuring his visit, Trump strode through the furnace factory, with TV cameras rolling, and shook hands with workers, telling them the deal with the company was “very exciting.”\n“Companies are not going to leave the United States any more without consequences. Not going to happen,” Trump said.\nElliott said Trump’s visit raised hopes among the entire workforce but it became clear later that some workers would lose their jobs anyway.\n“It was like royalty coming here, we knew the world was watching,” Elliott said. “He’s walking through and we’re in awe, like ‘Savior!'. That’s the way we’re looking at it. He led us to believe that we were all going to be saved.”\nTrump repeatedly criticized Carrier during the presidential campaign, as he pledged to rip up bad trade deals and save American jobs.\nCarrier workers now also question why their factory, which will continue making furnaces after fan coil operations move to Monterrey, was singled out by Trump when hundreds of steelworkers in Indiana are in a similar predicament.\nUnited Technologies Electronic Controls, another United Technologies facility two hours away in Huntington, Indiana, is closing in 2018, also sending its operations to Monterrey.\nAbout 400 workers were laid off in 2017 and another 230 will be this year, a company spokeswoman said.\nRexnord Corp., just down the road from Carrier, closed in November, laying off 300 workers represented by the same local steelworkers union as the Carrier employees.\nTrump wrote on Twitter shortly after touring Carrier that Rexnord, which also relocated operations to Mexico, was “rather viciously firing” its workers. “This is happening all over our country. No more!” Trump wrote.\n“Don’t get me wrong, me and the people here that work for Carrier are very grateful for it but when he was running during the election he stated that these things wouldn’t happen anymore,” said Robert James, president of the local United Steelworkers union.\n“How do you save 730 jobs at Carrier and not give a damn about the 700 jobs in Huntington? Both owned by the same company. Why would you leave them out of the equation?” James asked.\nIndiana’s unemployment rate was 3.7 percent in November 2017, lower than the national rate of 4.1 percent.\nBut the U.S. steel industry, in particular, has struggled over the past decade.\nChuck Jones, the former president of the local United Steelworkers union, said that while some laid-off Rexnord and Carrier workers have been able to find comparable union jobs, others are in warehouse jobs paying about half the $25 per hour they used to make. (Reporting by Amanda Becker; Editing by Kevin Drawbaugh and Alistair Bell)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T04:32:00.000+02:00", "crawled": "2018-01-12T18:30:06.000+02:00", "highlightTitle": ""}