{"organizations": [], "uuid": "11c70bb1705b1e36701f3efe7d0ec65ed93fa6cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/01_e-palette-concept.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/toyota-amazon-uber-pizza-hut-self-driving-shuttle/", "country": "US", "domain_rank": 1196, "title": "Toyota Working With Amazon, Uber to Develop Self-Driving Shuttle | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.933, "site_type": "news", "published": "2018-01-01T02:00:00.000+02:00", "replies_count": 0, "uuid": "11c70bb1705b1e36701f3efe7d0ec65ed93fa6cd"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/08/toyota-amazon-uber-pizza-hut-self-driving-shuttle/", "ord_in_thread": 0, "title": "Toyota Working With Amazon, Uber to Develop Self-Driving Shuttle | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec January 8, 2018 \nToyota is working with Amazon , ride-hailing companies Uber and Didi, automaker Mazda, and Pizza Hut to develop an electric autonomous shuttle that can be used to deliver people—or the packages they’ve ordered—to their destination. And it might just make it to the Olympics in 2020. \nToyota Motor President Akio Toyoda revealed the so-called e-Palette concept vehicle and announced the business alliance Monday at CES, the annual tech trade show in Las Vegas. The alliance will focus on the development of the new e-Palette Concept Vehicle in the near term. But the idea is to seek input from these various partners as Toyota develops its mobility business model. \nThis isn’t just about building an autonomous shuttle. Instead, Toyoda laid out a vision for a larger mobility ecosystem that aims to transition from a company that just produces and sells cars to one that handles all aspects of moving people and things from point A to point B. These shuttles could be used as mobile shops, roving around a business campus, for instance. It could also be used to deliver products to customers or as a way to move people around urban centers. Courtesy of Toyota \nToyota plans to test the e-Palette in several regions, including the United States in the early 2020s. It also plans to be at the Olympic and Paralympic Games in Tokyo in 2020. The company didn’t provide further details about its plans for the Olympics and whether the shuttle would be a commercial operation or merely a demonstration. \nThe all-electric autonomous vehicle—if ever produced—would used Toyota’s “guardian” and “chauffeur” technologies . The company is taking a dual approach to autonomy that it calls “guardian” and “chauffeur,” both of which use the same technology stack. \nToyota has been working to develop fully autonomous cars to serve an aging population and the disabled, and technology for regular production cars that could switch between assisted and full autonomy. Unlike other automakers that might have drivers hit a button to switch in and out of full autonomous mode, Toyota would have it operate silently in the background. \nUnder “guardian” mode, the human driver maintains vehicle control and the automated system would step in and take control of the car to avoid an accident. “Chauffeur” mode would take over the driving and the vehicle’s occupants would be passengers. Photo by Kirsten Korosec \nIn theory, partners would be able to buy the autonomous e-Palette vehicle with the complete chauffeur technology, or they could opt to use their own automated driving system. Either way, the vehicle would come equipped with the guardian tech to act as a safety net. \nThe e-Palette is still just a concept. But the company envisions offering three sizes of the automated vehicle with an underlying open software platform that would let companies tweak and customize it to meet their business needs. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-01T02:00:00.000+02:00", "crawled": "2018-01-09T09:40:54.315+02:00", "highlightTitle": ""}