{"organizations": [], "uuid": "9a3de2582278c71f533416521380f417824e9106", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-agiloft-marks-record-year-by-achieving-45-percent-year-over-year-growth-in-2017.html", "country": "US", "domain_rank": 767, "title": "Agiloft Marks Record Year by Achieving 45 Percent Year-over-Year Growth in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:30:00.000+02:00", "replies_count": 0, "uuid": "9a3de2582278c71f533416521380f417824e9106"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-agiloft-marks-record-year-by-achieving-45-percent-year-over-year-growth-in-2017.html", "ord_in_thread": 0, "title": "Agiloft Marks Record Year by Achieving 45 Percent Year-over-Year Growth in 2017", "locations": [], "entities": {"persons": [{"name": "colin earl", "sentiment": "none"}], "locations": [{"name": "redwood city", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "agiloft, inc.", "sentiment": "neutral"}, {"name": "agiloft", "sentiment": "none"}, {"name": "life sciences sectors agiloft", "sentiment": "none"}, {"name": "contract management customer wins", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "REDWOOD CITY, Calif., Jan. 10, 2018 /PRNewswire/ -- Agiloft, Inc. , a trusted provider of agile business process software, today announced a landmark year of business growth, achieving 45 percent year-over-year revenue growth and a 200-percent increase in channel sales in 2017. The company also grew its headcount by 30 percent during the year. Agiloft expects to continue its strong growth trajectory in 2018; Agiloft doubled in size in 2015 and 2016 and grew by more than 40 percent in 2014.\nContract Management Customer Wins in Non-Profit and Life Sciences Sectors\nAgiloft saw a major uptick in demand for its contract management software in 2017, with the life sciences and non-profit sectors leading the way.\n\"With a myriad of suppliers and customers and an exacting regulatory environment, contract management in life sciences tends to be a highly complex and specific undertaking, which makes it ideal for Agiloft's deeply configurable software,\" said Colin Earl, CEO of Agiloft. \"We owe a large part of our growth in this and the non-profit market to old-fashioned word of mouth.\"\nExamples of wins in life sciences include : American Chemistry Council , Atreca , Acucela, Inc. , Illumina , Codexis , Sutro as well as additional orders from established clients like Roche and Genentech. Recent non-profit wins include Boys Town , Hope Community Resources and Safe Horizon .\nPlatinum-level Channel Sales Partners\nAgiloft's impressive channel sales growth in 2017 was driven by new Platinum-level partners: Collins Technology Consulting , Saasam , and Spectrum Mobility . Each company achieved the highest level of partnership with Agiloft through successful sales and implementation projects. All have been certified to implement Agiloft independently, increasing Agiloft's footprint in the UK, Asia, Australia, New Zealand, and North America.\nNew Tiered Pricing Model\nAgiloft expanded its pricing model in 2017, offering more flexible and transparent options for organizations and budgets of all sizes. In addition to Hosted Service, Agiloft now offers On-Premise Subscription Service. The company also expanded its levels of service to include Professional and Professional Unlimited tiers giving customers much more freedom to use Agiloft.\n\"The value of Agiloft's applications is that they can be configured to the specific needs of clients quickly, efficiently and without having to write a line of code,\" noted Earl. \"Flexible and easy-to-understand pricing matches the product and makes it that much easier to select Agiloft.\"\nIndustry Awards and Recognition\nAgiloft's strong year was validated by a slew of industry awards and recognition. In 2017, PC Mag named Agiloft Editors' Choice for Contract Management Software for the third year in a row ; Spend Matters listed it as one of its 50 Providers to Watch for in Procurement Software ; Capterra recognized it as Top Three for Contract Management Software and the American Business Awards awarded it a Gold Stevie for Product or Service of the Year - Platform as a Service .\nGrowing Team\nIn 2017, Agiloft increased its headcount in all functional areas including development, sales, services, operations, and marketing. Key executive hires were Richard Morgan, a luminary in the AI space, who was appointed VP of engineering and market-building veteran Hiro Notaney, who joined as VP of marketing.\nThe company continues to actively recruit for additional talent. To learn more about open positions at Agiloft, visit: https://www.agiloft.com/jobs.htm\nAbout Agiloft\nOver three million users at organizations ranging from small enterprises to U.S. Government agencies and Fortune 100 companies depend on Agiloft's top rated product suites for Contract Management Software , Service Desk, Custom Workflow, and more. Agiloft specializes in automating processes that are too complex for competing vendors. Our best practice templates and agile technology ensure rapid deployment and a fully extensible system. For more information, visit https://www.agiloft.com/ .\nMedia Contact:\nAlastar Kerpel\n188511@email4pr.com\n650-587-8615 ext. 741\nView original content: http://www.prnewswire.com/news-releases/agiloft-marks-record-year-by-achieving-45-percent-year-over-year-growth-in-2017-300580231.html\nSOURCE Agiloft", "external_links": ["https://www.acucela.com/", "https://www.agiloft.com/news/20170503.htm", "https://www.agiloft.com/contract-management.htm", "https://www.codexis.com/", "https://www.illumina.com/", "https://www.agiloft.com/news/20170510.htm", "https://www.americanchemistry.com/", "https://www.atreca.com/", "https://www.agiloft.com/jobs.htm", "https://colltech.uk/", "https://mysutro.com/", "http://www.prnewswire.com/news-releases/agiloft-marks-record-year-by-achieving-45-percent-year-over-year-growth-in-2017-300580231.html", "https://www.hopealaska.org/", "http://www.boystown.org/Pages/default.aspx", "http://www.prnewswire.com/news-releases/agiloft-contract-management-suite-wins-pc-magazines-editors-choice-for-best-contract-management-system-of-2017-300534622.html", "https://www.agiloft.com/", "http://spectrum-mobility.com/", "https://www.safehorizon.org/", "https://www.agiloft.com/news/20170523.htm", "https://www.agiloft.com/pricing-clm.htm", "https://www.saasam.co/"], "published": "2018-01-10T16:30:00.000+02:00", "crawled": "2018-01-10T18:36:06.019+02:00", "highlightTitle": ""}