{"organizations": [], "uuid": "f35e40e8c0de1de4f5da0be1d72b775d18a0c9cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-nortech-systems-names-connie-beck-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Nortech Systems Names Connie Beck Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T00:10:00.000+02:00", "replies_count": 0, "uuid": "f35e40e8c0de1de4f5da0be1d72b775d18a0c9cf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-nortech-systems-names-connie-beck-chief-financial-officer.html", "ord_in_thread": 0, "title": "Nortech Systems Names Connie Beck Chief Financial Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS--(BUSINESS WIRE)-- Nortech Systems (Nasdaq: NSYS), a leading provider of full-service electronics manufacturing services (EMS), has named Connie Beck as vice president and chief financial officer. Along with directing all financial planning and accounting practices, she will oversee Nortech’s relationships with its business partners, the financial community and shareholders.\n“Connie brings many strengths to our senior management team with her varied experience and talents, including global operations,” says Rich Wasielewski, president and CEO of Nortech Systems. “Her proven financial and operations leadership will make her a valuable contributor to Nortech’s future.”\nBeck was vice president of finance and controller for MOCON, Inc., a publicly traded provider of measurement instruments and services, from 2013 to 2017. She was a member of MOCON’s senior leadership team, supporting strategic planning and international multi-site operations. (MOCON was acquired by AMETEK in June 2017.)\nPrior to MOCON, Beck held director-level financial reporting positions with public companies Navarre Corporation and Lakes Entertainment, Inc. She also has over 10 years of public accounting experience with Grant Thornton, McGladrey & Pullen and Protiviti. Beck is a CPA and earned a bachelor of science degree in accounting from Northern Illinois University.\nConcluded Wasielewski, “As Paula Graff retires as Nortech’s CFO, we thank her for her dedicated service and wish her all the best in her future endeavors.”\nAbout Nortech Systems Incorporated\nNortech Systems Incorporated ( www.nortechsys.com ), based in Maple Grove, Minn., is a full-service electronics manufacturing services (EMS) provider of wire and cable assemblies, printed circuit board assemblies and higher-level complete box build assemblies for a wide range of industries. Markets served include industrial, medical and aerospace/defense. The company has operations in the U.S., Mexico and China. Nortech Systems Incorporated is traded on the NASDAQ Stock Market under the symbol NSYS.\nForward-Looking Statements\nThis press release contains forward-looking statements made pursuant to the safe harbor provision of the Private Securities Litigation Reform Act of 1995. While this release is based on management’s best judgment and current expectations, actual results may differ and involve a number of risks and uncertainties. Important factors that could cause actual results to differ materially from the forward-looking statements include, without limitation: volatility in market conditions which may affect market supply of and demand for the company’s products; increased competition; changes in the reliability and efficiency of operating facilities or those of third parties; risks related to availability of labor; commodity and energy cost instability; general economic, financial and business conditions that could affect the company’s financial condition and results of operations; as well as risk factors listed from time to time in the company’s filings with the SEC.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006801/en/\nFor Nortech Systems Incorporated\nWarren Djerf, 952-920-3908\nBrookside Communications Group\nwarren@brookcomm.net\nSource: Nortech Systems Incorporated", "external_links": ["http://www.businesswire.com/news/home/20180108006801/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.nortechsys.com&esheet=51739863&newsitemid=20180108006801&lan=en-US&anchor=www.nortechsys.com&index=1&md5=ff73384185e3ff2e94454ee19929c9da"], "published": "2018-01-09T00:10:00.000+02:00", "crawled": "2018-01-09T09:40:22.069+02:00", "highlightTitle": ""}