{"organizations": [], "uuid": "f66e975075afaba15090cb2c414561c3f095ce8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-bond-yields-inch-down-hefty-week-of-new-issuance-ahead-idUSL8N1P321H", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Euro zone bond yields inch down, hefty week of new issuance ahead", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T19:35:00.000+02:00", "replies_count": 0, "uuid": "f66e975075afaba15090cb2c414561c3f095ce8e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-bond-yields-inch-down-hefty-week-of-new-issuance-ahead-idUSL8N1P321H", "ord_in_thread": 0, "title": "UPDATE 1-Euro zone bond yields inch down, hefty week of new issuance ahead", "locations": [], "entities": {"persons": [{"name": "dhara ranasinghe", "sentiment": "none"}, {"name": "sebastian fellechner", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* First full trading week of 2018\n* Euro zone business climate index hits highest since 1985\n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Updates prices, adds new Quote: )\nBy Dhara Ranasinghe\nLONDON, Jan 8 (Reuters) - Borrowing costs in the euro area inched lower on Monday ahead of a heavy week of new bond supply across the bloc in the first full trading week of the year.\nGermany, Austria, the Netherlands and Italy are expected to sell almost 12 billion euros of bonds this week, while analysts say Portugal could also come to the market with a syndicated bond deal.\n“Supply is a strong factor this week,” said DZ Bank rates strategist Sebastian Fellechner. “We think Portugal will announce a new 10-year benchmark this week.”\nJanuary is typically one of the busiest months for new bond supply and that tends to put upward pressure on bond yields as investors cheapen existing bonds to make way for new issues.\nBut analysts said a still benign inflation environment and reinvestments from maturing bonds meant the markets should absorb the new supply with few problems, helping explain why bond markets appear well supported.\nData on Friday showed inflation in the euro area at 1.4 percent year-on-year in December, well below the ECB’s near 2 percent target. The core measure of inflation, which strips out food and energy prices, was 1.1 percent.\n“We do not think this (new issuance) will be particularly challenging for the market to absorb given the cash inflows from German (last week) and Dutch redemptions,” said Antoine Bouvet, a rates strategist at Mizuho.\n“The weaker-than-expected core euro zone inflation print on Friday added to our conviction.”\nMost 10-year bond yields in the euro area were 1-2 basis points lower, having trading a touch higher in early trade.\nGermany’s 10-year Bund yield fell 1 bps to 0.43 percent , off two-month highs hit last week.\nData showing further signs of strength in the euro zone economy may have helped sentiment, especially towards peripheral bond markets, analysts said.\nEuropean Commission data on Monday showed the euro zone business climate index hit its highest since 1985. Euro zone retail sales rose a higher-than-expected 2.8 percent year-on-year in November.\nThe European Central Bank should set a date to end its asset-buying programme, the head of Germany’s Bundesbank, Jens Weidmann, told Spanish newspaper El Mundo.\nIn recent weeks, hawkish comments from a few ECB policymakers has stoked speculation that the ECB’s bond-buying stimulus may well end sooner than expected.\nThe ECB has pledged to continue buying bonds at least until September. But with economic growth in the euro zone on its best run in a decade and inflation comfortably above 1 percent, it is widely expected to wind down the programme after that.\nReporting by Dhara Ranasinghe, Additional Reporting by Fanny Potkin; Editing by Robin Pomeroy\n ", "external_links": ["http://tmsnrt.rs/2ii2Bqr", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T19:35:00.000+02:00", "crawled": "2018-01-08T14:01:54.042+02:00", "highlightTitle": ""}