{"organizations": [], "uuid": "d258d2ef3ac0f9599839312fce21f3f84e43cd3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-walgreens-boots-alliance-reports-fiscal-2018-first-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Walgreens Boots Alliance Reports Fiscal 2018 First Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.692, "site_type": "news", "published": "2018-01-04T15:00:00.000+02:00", "replies_count": 0, "uuid": "d258d2ef3ac0f9599839312fce21f3f84e43cd3d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-walgreens-boots-alliance-reports-fiscal-2018-first-quarter-results.html", "ord_in_thread": 0, "title": "Walgreens Boots Alliance Reports Fiscal 2018 First Quarter Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "gaap", "sentiment": "negative"}, {"name": "walgreens boots alliance reports fiscal", "sentiment": "negative"}, {"name": "amerisourcebergen", "sentiment": "none"}, {"name": "guangzhou pharmaceuticals corporation", "sentiment": "none"}, {"name": "walgreens boots alliance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "First quarter highlights\nGAAP diluted net earnings per share were $0.81, down 16.5 percent from the year-ago quarter mainly due to impairment of the company's equity method investment in Guangzhou Pharmaceuticals Corporation; Adjusted diluted net earnings per share were $1.28, an increase of 16.4 percent, up 15.5 percent on a constant currency basis GAAP net earnings attributable to Walgreens Boots Alliance decrease 22.1 percent, to $821 million; Adjusted net earnings attributable to Walgreens Boots Alliance increase 7.8 percent to $1.3 billion, up 7.2 percent on a constant currency basis Sales increase 7.9 percent to $30.7 billion, an increase of 7.2 percent on a constant currency basis GAAP operating income decreases 8.6 percent to $1.3 billion due to a loss from the company's equity earnings in AmerisourceBergen; Adjusted operating income increases 4.8 percent to $1.8 billion, up 4.4 percent on a constant currency basis GAAP net cash provided by operating activities was $961 million; Free cash flow was $583 million\nFiscal 2018 guidance\nCompany raises the lower end of its guidance for fiscal year 2018 by 5 cents per share and now anticipates adjusted diluted net earnings per share of $5.45 to $5.70\nDEERFIELD, Ill.--(BUSINESS WIRE)-- Walgreens Boots Alliance, Inc. (Nasdaq: WBA) today announced financial results for the first quarter of fiscal 2018 which ended 30 November 2017.\nExecutive Vice Chairman and CEO Stefano Pessina said, “I am pleased that we delivered another strong performance in the first quarter, led by continued prescription volume and market share growth in Retail Pharmacy USA. At the same time, we continue to position our company for future growth with the acquisition of the first Rite Aid stores following regulatory clearance for the transaction in September. Since the end of the quarter, we announced an agreement to acquire 40 percent of Sinopharm Holding Guoda Drugstores Co., Ltd., a leading retail pharmacy chain in China, where regulatory changes have allowed us to prioritize retail opportunities. We also have accepted an offer to sell part of our investment in our Chinese wholesale partner Guangzhou Pharmaceuticals Corporation for a substantial cash return.” Both transactions in China are subject to regulatory review and approval, and other customary closing conditions.\nOverview of First Quarter Results\nFiscal 2018 first quarter net earnings attributable to Walgreens Boots Alliance determined in accordance with GAAP decreased 22.1 percent to $821 million compared with the same quarter a year ago, while GAAP diluted net earnings per share decreased 16.5 percent to $0.81 compared with the same quarter a year ago. The decreases in GAAP net earnings and GAAP net earnings per share were mainly due to impairment of the company's equity method investment in Guangzhou Pharmaceuticals. In addition, these decreases reflect a loss from the company's equity earnings in AmerisourceBergen and benefits from the UK tax rate reduction recorded in the same quarter a year ago.\nAdjusted fiscal 2018 first quarter net earnings attributable to Walgreens Boots Alliance 1 increased 7.8 percent to $1.3 billion, up 7.2 percent on a constant currency basis, compared with the same quarter a year ago. Adjusted diluted net earnings per share for the quarter increased 16.4 percent to $1.28, up 15.5 percent on a constant currency basis, compared with the same quarter a year ago.\nSales in the first quarter were $30.7 billion, an increase of 7.9 percent from the year-ago quarter, and an increase of 7.2 percent on a constant currency basis.\nGAAP operating income in the first quarter was $1.3 billion, a decrease of 8.6 percent from the same quarter a year ago due to a loss from the company's equity earnings in AmerisourceBergen, which primarily reflects the company's share of the litigation accrual reported in AmerisourceBergen's last quarter results. Adjusted operating income in the first quarter was $1.8 billion, an increase of 4.8 percent from the same quarter a year ago, and an increase of 4.4 percent on a constant currency basis.\nGAAP net cash provided by operating activities was $961 million in the first quarter, and free cash flow was $583 million.\nShare Repurchase Program\nDuring the quarter, the company completed its $5 billion share repurchase program announced in June 2017 and the $1 billion expansion of that program announced in October 2017.\nCompany Outlook\nThe company raised the lower end of its guidance for fiscal year 2018 by 5 cents per share and now anticipates adjusted diluted net earnings per share of $5.45 to $5.70.\nThis guidance does not take into account any impact from the recent U.S. tax legislation, and assumes current exchange rates for the rest of the fiscal year.\nFirst Quarter Business Division Highlights\nRetail Pharmacy USA:\nRetail Pharmacy USA had first quarter sales of $22.5 billion, an increase of 8.9 percent over the year-ago quarter. Sales in comparable stores increased 4.7 percent compared with the same quarter a year ago.\nPharmacy sales, which accounted for 72.4 percent of the division’s sales in the quarter, increased 14.1 percent compared with the year-ago quarter, primarily due to higher prescription volumes, including mail and central specialty following the formation of AllianceRx Walgreens Prime. Comparable pharmacy sales increased 7.4 percent, primarily due to higher volume. Reimbursement pressure and generics had negative impacts on comparable pharmacy sales growth, which was partially offset by brand inflation. The division filled 260.2 million prescriptions (including immunizations) adjusted to 30-day equivalents in the quarter, an increase of 9.5 percent over the year-ago quarter. Prescriptions filled in comparable stores increased 8.9 percent compared with the same quarter a year ago, primarily due to Medicare Part D growth and volume growth from previously announced strategic pharmacy partnerships. The division’s retail prescription market share on a 30-day adjusted basis in the first quarter increased approximately 110 basis points over the year-ago quarter to 20.6 percent, as reported by IMS Health.\nRetail sales decreased 2.8 percent in the first quarter compared with the year-ago period. Comparable retail sales were down 0.9 percent in the quarter, with declines in the consumables and general merchandise category and in the personal care category partially offset by growth in the health and wellness category and in the beauty category.\nGAAP gross profit increased 3.0 percent compared with the same quarter a year ago and adjusted gross profit increased 3.7 percent.\nGAAP first quarter selling, general and administrative expenses (SG&A) as a percentage of sales decreased 1.1 percentage points compared with the year-ago quarter, primarily due to sales mix and higher sales. On an adjusted basis, SG&A as a percentage of sales decreased 1.2 percentage points in the same period, for similar reasons.\nGAAP operating income in the first quarter increased 1.9 percent from the year-ago quarter to $1.1 billion. Adjusted operating income in the first quarter increased 6.8 percent from the year-ago quarter to $1.4 billion.\nOn 19 September 2017 the company announced it had secured regulatory clearance for an amended and restated asset purchase agreement to purchase 1,932 stores, three distribution c", "external_links": ["http://www.businesswire.com/news/home/20180104005525/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.walgreensbootsalliance.com&esheet=51737755&newsitemid=20180104005525&lan=en-US&anchor=http%3A%2F%2Finvestor.walgreensbootsalliance.com&index=1&md5=ebfb9d8ab12c9d3a65a7db2638e3868a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.walgreensbootsalliance.com&esheet=51737755&newsitemid=20180104005525&lan=en-US&anchor=www.walgreensbootsalliance.com&index=2&md5=fce553823e16cdc7d310e81abf892341"], "published": "2018-01-04T15:00:00.000+02:00", "crawled": "2018-01-04T17:11:58.000+02:00", "highlightTitle": ""}