{"organizations": [], "uuid": "5ce121837211df96960676c423204a702f879d47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/04/104877968-RTX3KFD4-donald-trump.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/01/trump-welcomes-new-year-with-a-lavish-party-at-private-club.html", "country": "US", "domain_rank": 767, "title": "Trump welcomes new year with a lavish party at private club", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.194, "site_type": "news", "published": "2018-01-01T14:51:00.000+02:00", "replies_count": 0, "uuid": "5ce121837211df96960676c423204a702f879d47"}, "author": "Kevin Lamarque", "url": "https://www.cnbc.com/2018/01/01/trump-welcomes-new-year-with-a-lavish-party-at-private-club.html", "ord_in_thread": 0, "title": "Trump welcomes new year with a lavish party at private club", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "positive"}, {"name": "barron", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "melania trump", "sentiment": "none"}, {"name": "kevin lamarque", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "mar-a-lago", "sentiment": "none"}], "organizations": [{"name": "u.s. news trump", "sentiment": "positive"}, {"name": "trump", "sentiment": "positive"}, {"name": "reuters donald trump  bidding", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bidding farewell to 2017 with a lavish party at his private club, President Donald Trump predicted 2018 will be a \"tremendous year.\"\nTrump said Sunday that the stock market will continue to rise and that companies are going to continue to come into the U.S., at \"a rapid clip.\" He also cited several accomplishments, including the tax overhaul, opening the Arctic National Wildlife Refuge to oil drilling, and repealing the individual mandate from the national health care law.\n\"It will be a fantastic 2018,\" a tuxedoed Trump said, as he entered the gilded ballroom at Mar-a-Lago, accompanied by first lady Melania Trump and son Barron.\nAsked for his reaction to North Korea leader Kim Jon Un's remarks about having a nuclear button on his desk, Trump responded by saying, \"We'll see.\"\nGuests gathered in the decorated ballroom included senior White House advisers Ivanka Trump and Jared Kushner, Trump's sons Eric Trump and Donald Trump Jr. and Treasury Secretary Steven Mnuchin.\nSince taking office, President Trump has made frequent visits to his for-profit properties. He has refused to divest from his real estate and hotel empire, drawing criticism from ethics experts.\nEarlier in the day, Trump capped 2017 with a video self-tribute touching on what he sees as the high points of his achievements and rhetoric from his first year in office. He gave a plug to American exceptionalism, too.\nIn the video running 3½ minutes, scenes of Trump with military personnel, Border Patrol agents and other world leaders are set to a stirring soundtrack as he declares of his country: \"We gave birth to the modern world and we will shape tomorrow's world with the strength and skill of American hands.\"\nTrump cited his success in placing a justice on the Supreme Court, his efforts to cut regulations and his big win on overhauling taxes, which he falsely described as the \"largest tax cut in the history of our country.\"\nTrump offered the video with a New Year's Eve message: \"What a year it's been, and we're just getting started. Together, we are MAKING AMERICA GREAT AGAIN! Happy New Year!!\"\nHe later offered another Twitter message, loaded with his signature bombast: \"As our Country rapidly grows stronger and smarter, I want to wish all of my friends, supporters, enemies, haters, and even the very dishonest Fake News Media, a Happy and Healthy New Year. 2018 will be a great year for America!\"\nThe White House said Trump been briefed on New Year's Eve security precautions around the country and will continue to monitor those efforts.\nTrump offered his condolences Sunday to the victims of a shooting in suburban Denver that killed one sheriff's deputy and wounded six other people, including four deputies. He tweeted: \"We love our police and law enforcement - God Bless them all!\"", "external_links": [], "published": "2018-01-01T14:51:00.000+02:00", "crawled": "2018-01-01T14:51:59.015+02:00", "highlightTitle": ""}