{"organizations": [], "uuid": "b7b3f8ee100bdff602eb854c4e089b8892c61807", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 41, "shares": 41, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221697047&w=1200&r=LYNXMPEE0C0A8", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey/erdogan-says-turkey-will-crush-kurdish-militia-in-afrin-idUSKBN1F20G4", "country": "US", "domain_rank": 408, "title": "Erdogan says Turkey will crush Kurdish militia in Afrin", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T14:39:00.000+02:00", "replies_count": 0, "uuid": "b7b3f8ee100bdff602eb854c4e089b8892c61807"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey/erdogan-says-turkey-will-crush-kurdish-militia-in-afrin-idUSKBN1F20G4", "ord_in_thread": 0, "title": "Erdogan says Turkey will crush Kurdish militia in Afrin", "locations": [], "entities": {"persons": [{"name": "erdogan", "sentiment": "negative"}, {"name": "tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "elazig", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "istanbul", "sentiment": "none"}, {"name": "idlib", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "afrin", "sentiment": "none"}, {"name": "afrin reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ak party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISTANBUL (Reuters) - President Tayyip Erdogan said on Saturday that Turkey’s military incursion in northern Syria’s Idlib province would crush Kurdish militia forces that control the neighboring region of Afrin.\nThe Kurdish YPG militia said Turkish forces inside Syria fired shells into Afrin on Saturday, but no one was wounded.\nTurkish troops entered Idlib three months ago after an agreement with Russia and Iran for the three countries to try to reduce fighting between pro-Syrian government forces and rebel fighters in the largest remaining insurgent-held part of Syria.\nBut the few observation posts which the Turkish army says it has established are close to the dividing line between Arab rebel-held land and the Kurdish-controlled region of Afrin.\n“If the terrorists in Afrin don’t surrender we will tear them down,” Erdogan told a congress of his ruling AK Party in the eastern Turkish city of Elazig.\nThe Kurdish YPG militia said Turkish forces stationed in Syria shelled several Kurdish villages in the Afrin region on Saturday, without causing casualties.\nRojhat Roj, the YPG spokesman in Afrin, told Reuters the shelling was carried out by Turkish forces in Dar Taizaah and Qalat Seman - areas where he said Turkish forces had deployed as part of the agreement with Russia and Iran.\n“From our side, there is no shelling at present,” he added.\nFILE PHOTO - A general view shows the Kurdish city of Afrin, in Aleppo's countryside March 18, 2015. REUTERS/Mahmoud Hebbo Erdogan has said the Kurdish YPG militia is trying to establish a “terror corridor” on Turkey’s southern border, linking Afrin with a large Kurdish-controlled area to the east.\nIn 2016 Turkey launched its Euphrates Shield military offensive in northern Syria to push back Islamic State from the border and drive a wedge between the Kurdish controlled regions.\n“With the Euphrates Shield operation we cut the terror corridor right in the middle. We hit them one night suddenly. With the İdlib operation, we are collapsing the western wing,” Erdogan said, referring to Afrin.\nHe also said Turkey could drive YPG forces out of Manbij. The mainly Arab town lies west of the Euphrates, and Turkey has long demanded that Kurdish fighters pull back east of the river.\n“In Manbij, if they break the promises, we will take the matter in our own hands until there are no terrorists left. They will see what we’ll do in about a week,” Erdogan said.\nTurkey was a major supporter of rebels fighting to overthrow Syria’s President Bashar al-Assad, but is alarmed by the strength of Kurdish forces - which Ankara says are linked to Kurdish militants fighting in southeast Turkey.\nIt has criticized the United States for arming YPG and Arab fighters in the Syrian Democratic Forces, which drove Islamic State out of Raqqa and other parts of Syria.\n“The U.S. sent 4,900 trucks of weapons in Syria. We know this. This is not what allies do,” Erdogan said. “We know they sent 2,000 planes full of weapons.”\nReporting by Irem Koca in Istanbul and Tom Perry in Beirut; Writing by Dominic Evans; Editing by Alexander Smith\n ", "external_links": [], "published": "2018-01-13T14:39:00.000+02:00", "crawled": "2018-01-13T15:01:51.004+02:00", "highlightTitle": ""}