{"organizations": [], "uuid": "89a73d19e6486581d1189083c61d986c23aca4c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-605-names-sal-romanello-general-counsel.html", "country": "US", "domain_rank": 767, "title": "605 Names Sal Romanello General Counsel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:30:00.000+02:00", "replies_count": 0, "uuid": "89a73d19e6486581d1189083c61d986c23aca4c4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-605-names-sal-romanello-general-counsel.html", "ord_in_thread": 0, "title": "605 Names Sal Romanello General Counsel", "locations": [], "entities": {"persons": [{"name": "romanello", "sentiment": "negative"}, {"name": "sal romanello", "sentiment": "negative"}, {"name": "kristin dolan", "sentiment": "none"}, {"name": "sal", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Romanello brings over 20 years of experience to the new position\nNEW YORK--(BUSINESS WIRE)-- 605, an advanced data and analytics company focused on the media and entertainment industries, today announced the appointment of Sal Romanello as General Counsel at 605. Romanello brings over twenty years of legal experience to his role, having represented numerous companies in a wide range of commercial disputes, including trade secret, insurance, employment, financial services, licensing and intellectual property matters. In his position at 605, Romanello will be focused on drafting and negotiation of client and vendor agreements relating to data and information licensing, and professional service agreements, as well as providing general legal support and counsel to the entire organization.\n“The needs and the complexity of our business are growing rapidly and it is therefore important to have counsel with deep expertise across legal, compliance, regulatory and business strategy,” said Kristin Dolan, Founder and CEO of 605. “Sal is someone who is passionate about pioneering a new field, partnering with stakeholders across our organization, and growing as our company grows and we are thrilled he is bringing his 20+ years of experience to 605.”\n“605 has very quickly built an impressive organization which operates in the ever-changing – and thus ever-complicated – world of media and entertainment,” said Romanello. “I am excited to offer my legal counsel to this thriving group of talented people and to work across the organization to maintain a culture of regulatory compliance.”\nPrior to joining 605, Romanello was a partner in the Complex Commercial Litigation Practice Group at the international law firm of Weil, Gotshal & Manges, LLP, where he started his legal career in 1996. Romanello is a member of the Board of Directors of the Fordham Law Alumni Association, and Chair of its Engagement Committee. He also serves as a member of the Rockville Centre Zoning Board of Appeals. Romanello previously served for nearly ten years as the Pro Bono General Counsel to the St. Baldrick’s Foundation, the world’s largest non-governmental funder of childhood cancer research grants. He has been recognized as a leader in Business Litigation by SuperLawyers Magazine.\nRomanello has a B.A. in Political Science from Yale University, and received his J.D. from the Fordham University School of Law, where he was a member of the Fordham Law Review. After graduating from law school, he served as a law clerk to the Honorable Richard M. Berman, United States District Court Judge for the Southern District of New York. He is admitted to practice in New York State, and in various federal courts throughout the country.\n605 focuses on the simplification of complex data, using an optimizer to deliver deeper and more certain business insights to clients in the media and entertainment industries. 605 performs sales conversion and attribution analysis for clients’ television advertising campaigns—directly linking purchase activity to television ad exposure at the household level. Unlike traditional ratings, 605 measurement solutions are calculated and analyzed at the census-level to deliver accurate, actionable, verifiable results.\nAbout 605\n605 is a newly created fully-operational and well-financed company that offers unique, independent audience measurement and analytics that optimize programming and marketing initiatives within the media, sports, and entertainment industries. The company was created by Dolan Family Ventures through its acquisition of Analytics Media Group and access to set-top box data from an extensive network of partners across the country. To learn more, visit our website at 605.tv .\nAbout Dolan Family Ventures, LLC.\nFounded by James L. Dolan and Kristin Dolan, Dolan Family Ventures is a company making strategic investments in advanced data, analytics and technology-based businesses and talent with a focus on the media, entertainment and sports industries.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005257/en/\n605\nCharlstie Veith, 516-300-3569\nSenior Vice President\nMarketing & Communications\ncharlstie@605.tv\nSource: 605", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2F605.tv&esheet=51747097&newsitemid=20180123005257&lan=en-US&anchor=605.tv&index=1&md5=8dec13acc7dde3f913b230971f107503", "http://www.businesswire.com/news/home/20180123005257/en/"], "published": "2018-01-23T17:30:00.000+02:00", "crawled": "2018-01-23T17:36:15.001+02:00", "highlightTitle": ""}