{"organizations": [], "uuid": "9a42af465e9e21ed9a988c38c3169f1c780c72ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews/", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/cricket-test-zaf-ind-amla/cricket-amla-backs-south-africa-to-chase-270-in-third-test-v-india-idUKL8N1PK6DL", "country": "US", "domain_rank": 408, "title": "Cricket-Amla backs South Africa to chase 270 in third test v India", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:34:00.000+02:00", "replies_count": 0, "uuid": "9a42af465e9e21ed9a988c38c3169f1c780c72ac"}, "author": "", "url": "https://uk.reuters.com/article/cricket-test-zaf-ind-amla/cricket-amla-backs-south-africa-to-chase-270-in-third-test-v-india-idUKL8N1PK6DL", "ord_in_thread": 0, "title": "Cricket-Amla backs South Africa to chase 270 in third test v India", "locations": [], "entities": {"persons": [{"name": "hashim amla", "sentiment": "none"}, {"name": "amla", "sentiment": "none"}], "locations": [{"name": "cricket-amla", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}], "organizations": [{"name": "india reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 4:37 PM / Updated 18 hours ago Cricket-Amla backs South Africa to chase 270 in third test v India Reuters Staff 3 Min Read \nJOHANNESBURG, Jan 25 (Reuters) - South Africa’s Hashim Amla says they could chase down 270 in the final innings of the third and final test against India, but they will need some luck on a wicket that has considerable pace, bounce and lateral movement. \nAmla led the way for South Africa with 61 in their first innings score of 194 at the Wanderers, but India have an overall lead of 42 with nine wickets remaining in their second innings and seem to have seized control of the game after day two. \n“It’s quite difficult, there are a few cracks in good areas and once the ball lands there it is shooting up quite alarmingly. You have to get in line and take it on,” Amla told SuperSport after Thursday’s play. \n“If you are not in line with the ball you might glove it. There is a lot in it for the seamers, you almost feel like you can get out any ball.” \nAmla tried to nullify the prodigious seam movement from the Indian bowlers by shuffling across to outside off-stump, an attempt to get in line with the ball to ensure that if he missed it, he could take a blow to the body rather than edge to the slip cordon. \n“Before I went out to bat I had the idea that I would try and get into the channel and play as straight as possible,” Amla said. \n”It’s just about trying to hit it. If you miss it, so be it, but on a wicket like this you have to have a plan and some days those plans work out. \n“AB (De Villiers) joked with me when he walked out (to bat) and said, ”that’s like scoring 150“, but I wish it was! You have to grind it out and get whatever runs you can. The element of fortune is quite big in situations like this.” \nNeither team has managed to top 200 in the test yet, but Amla believes his side could chase down more than that in the fourth innings. \n”I think about 250 ... even if it gets to 270,“ he said when asked what target South Africa could manage. ”You don’t know how the wicket is going to play, it hasn’t got significantly worse over the last two days. \n“If it gets to 250, as a batting unit you always feel like you have a chance.” \nSouth Africa have an unassailable 2-0 lead in the three-match series, but are seeking a first ever clean-sweep over India. (Reporting by Nick Said; Editing by Toby Davis)", "external_links": [], "published": "2018-01-25T18:34:00.000+02:00", "crawled": "2018-01-26T12:39:37.007+02:00", "highlightTitle": ""}