{"organizations": [], "uuid": "044f514cf19a6c05774cb20ba8d74caa510454b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 46, "shares": 46, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/16/104346324-GettyImages-588691030.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/12/cramer-you-wouldve-missed-fang-if-you-thought-this-time.html", "country": "US", "domain_rank": 767, "title": "Cramer: Thanks to FANG, 'this time it's different' is no longer risky", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T01:21:00.000+02:00", "replies_count": 0, "uuid": "044f514cf19a6c05774cb20ba8d74caa510454b7"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/12/cramer-you-wouldve-missed-fang-if-you-thought-this-time.html", "ord_in_thread": 0, "title": "Cramer: Thanks to FANG, 'this time it's different' is no longer risky", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "negative"}], "locations": [{"name": "engli", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "netflix", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Back in the day, CNBC's Jim Cramer would always hear that the four most dangerous words in the English language were \"this time it's different.\"\nAnd when it came to market-rattling events like the dotcom bubble burst — when investors chased internet stocks to artificial highs hoping to catch the \"next big thing\" — that idea usually proved right.\n\"But honestly, I've now been at this business a pretty long time, and I'm beginning to wonder if the four most dangerous words about stock investing are 'this time it's the same,'\" the \" Mad Money \" host said on Friday.\nAfter watching big-cap tech stocks like Facebook , Amazon , Netflix , and Alphabet drive the market to new heights, Cramer argued that a \"this-time-it's-different\" mentality could've cost investors fortunes if they had applied it to the FANG names.\nInvestors would've kicked themselves if they were so shaken by the dotcom bubble that they avoided getting in on the Harvard-born craze that became the $521 billion Facebook, he said.\n\"You really had to believe this time it's different if you were going to buy some shares in some online retailer where you gave them your credit card information and actually trusted that they'd send you [product] overnight,\" Cramer said. \"But Amazon did become a $629 billion profitable company.\"\n\"This time it's different\" would've made you rich if you believed in a money-losing company that rented out DVDs, because that company became the $95 billion giant that is Netflix, Cramer said.\n\"This time it's the same\" would've kept you from investing in a website that provides information based on anything you type, yet another dotcom name that eventually became Alphabet, the $782 billion parent of Google.\n\"The graybeards missed all of these stories because of their old saw,\" Cramer said. \"It stopped them from taking what turned out to be a calculated gamble on four companies that would have made fortunes for those who believed things really would be different this time.\"\nWATCH: Cramer on Buffett, bitcoin and why 'this time it's different' works show chapters Cramer: 'This time it's different' can actually make you money 21 Hours Ago | 05:14 Questions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-13T01:21:00.000+02:00", "crawled": "2018-01-13T02:15:51.011+02:00", "highlightTitle": ""}