{"organizations": [], "uuid": "90b25f838a02d57ea39d0712eb439d4939f939d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-serco-completes-acquisition-of-btp-systems.html", "country": "US", "domain_rank": 767, "title": "Serco Completes Acquisition of BTP Systems", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T16:00:00.000+02:00", "replies_count": 0, "uuid": "90b25f838a02d57ea39d0712eb439d4939f939d3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-serco-completes-acquisition-of-btp-systems.html", "ord_in_thread": 0, "title": "Serco Completes Acquisition of BTP Systems", "locations": [], "entities": {"persons": [], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "reston", "sentiment": "none"}], "organizations": [{"name": "serco", "sentiment": "negative"}, {"name": "serco inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "btp systems", "sentiment": "none"}, {"name": "intelligence", "sentiment": "none"}, {"name": "command", "sentiment": "none"}, {"name": "satcom", "sentiment": "none"}, {"name": "control, communications", "sentiment": "none"}, {"name": "btp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RESTON, Va., Jan. 26, 2018 /PRNewswire/ -- Serco Inc., a provider of professional, technology, and management services, announced today that the Company has completed the acquisition of BTP Systems, LLC (\"BTP\") following the receipt of all regulatory approvals and satisfaction of customary closing conditions.\nThe acquisition supports Serco's strategic growth plan in the defense sector by enhancing its portfolio of Command, Control, Communications, Computers, Combat Systems, Intelligence, Surveillance and Reconnaissance (C5ISR) service offerings and broadening its Federal government client base. Serco intends to fully integrate BTP Systems' operations within Serco's C5ISR Business Unit.\nBTP provides satellite communications (SATCOM), radar modernization, operations and maintenance, and sustainment services that enable customers to extend the lives of existing systems and achieve phased upgrades with new technology to enhance operational capability. BTP specializes in areas including obsolescence engineering, systems engineering services, test equipment design and build, and field engineering services, and maintains a near-field and compact antenna test range at Ludlow, MA. The company's expertise spans shipboard and submarine SATCOM antenna systems, MILSTAR command post antennas, and radar antennas. Operations and personnel are located in Newport RI, Reno NV, San Diego CA, Charleston SC, Groton CT, Norfolk, VA, Chesapeake VA, and Mayport FL.\n\"We welcome the highly-talented BTP Systems team into the Serco organization,\" said Dave Dacquino, Chairman and CEO of Serco Inc. \"This acquisition is about building on the scope, breadth, and scale of work that our company can now offer and support in the growing C5ISR market. By combining the skills of Serco and BTP Systems, we now deliver expanded C5ISR services supporting naval modernization and sustainment for ship, shore, and hardware integration projects.\"\nAbout Serco Inc.\nSerco Inc. is a leading provider of professional, technology, and management services. We advise, design, integrate, and deliver solutions that transform how clients achieve their missions. Our customer-first approach, robust portfolio of services, and global experience enable us to respond with solutions that achieve outcomes with value. Headquartered in Reston, Virginia, Serco Inc. has approximately 8,000 employees and annual revenue of $1 billion. Serco Inc. is a wholly-owned subsidiary of Serco Group plc, a $5 billion international business that helps transform government and public services around the world. More information about Serco Inc. can be found at www.serco-na.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/serco-completes-acquisition-of-btp-systems-300588230.html\nSOURCE Serco Inc.", "external_links": ["http://www.prnewswire.com/news-releases/serco-completes-acquisition-of-btp-systems-300588230.html", "http://www.serco-na.com/"], "published": "2018-01-26T16:00:00.000+02:00", "crawled": "2018-01-26T17:57:14.014+02:00", "highlightTitle": ""}