{"organizations": [], "uuid": "0cc4dff99bd1e7ac1c7eaf4ec6f0ed7dc13fb020", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220357111&w=1200&r=LYNXMPEE0712V", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-britain-politics-factbox/factbox-whos-in-whos-out-uk-pm-may-reshuffles-her-ministerial-team-idUSKBN1EX1R5", "country": "US", "domain_rank": 408, "title": "Factbox: Who's in, who's out? UK PM May reshuffles her ministerial team", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T00:08:00.000+02:00", "replies_count": 0, "uuid": "0cc4dff99bd1e7ac1c7eaf4ec6f0ed7dc13fb020"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-politics-factbox/factbox-whos-in-whos-out-uk-pm-may-reshuffles-her-ministerial-team-idUSKBN1EX1R5", "ord_in_thread": 0, "title": "Factbox: Who's in, who's out? UK PM May reshuffles her ministerial team", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - British Prime Minister Theresa May made changes to her ministerial team on Monday, hoping to re-energize a party damaged by divisions over Brexit and still smarting from an ill-judged election last year.\nBelow is a list of the main new appointments, and senior ministers confirmed in their roles. Changes are ongoing.\n- Brandon Lewis appointed as Conservative Party Chairman making him responsible for the day-to-day running of the political party and its campaigns. He replaces Patrick McLoughlin.\nLewis was previously the government’s immigration minister.\n- David Lidington appointed as Cabinet Office minister, a largely behind-the-scenes role supporting the prime minister and responsible for making sure the government runs smoothly.\nHe replaces Damian Green, who was forced to resign in December, but does not take on the additional title of First Secretary of State which made Green the de facto deputy to May.\nLidington was previously justice minister.\n- Brexit minister David Davis, foreign minister Boris Johnson, finance minister Philip Hammond and interior minister Amber Rudd all kept their positions. Business minister Greg Clark, trade minister Liam Fox, and defense minister Gavin Williamson were also among those continuing in their current roles.\n- David Gauke appointed justice minister. He was previously work and pensions minister.\n- Karen Bradley appointed as minister for Northern Ireland, replacing James Brokenshire who resigned for health reasons. Bradley was previously digital, culture, media and sport minister.\n- Sajid Javid given an expanded role, adding housing to his existing communities and local government brief.\n- Health minister Jeremy Hunt became minister for health and social care.\n- Education minister Justine Greening quit the government and was replaced by Damian Hinds, who previously held the more junior role of employment minister.\n- Esther McVey named as work and pensions minister.\n- Matthew Hancock was appointed as minister for digital, culture, media and sport.\nReporting by William James; Editing by Catherine Evans\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T00:08:00.000+02:00", "crawled": "2018-01-09T09:40:36.443+02:00", "highlightTitle": ""}