{"organizations": [], "uuid": "c672d3d9c8eef939b45902b0c11335023e7a83af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-college-ave-student-loans-names-new-chief-legal-officer-and-chief-marketing-officer.html", "country": "US", "domain_rank": 767, "title": "College Ave Student Loans Names New Chief Legal Officer and Chief Marketing Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.982, "site_type": "news", "published": "2018-01-29T18:00:00.000+02:00", "replies_count": 0, "uuid": "c672d3d9c8eef939b45902b0c11335023e7a83af"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-college-ave-student-loans-names-new-chief-legal-officer-and-chief-marketing-officer.html", "ord_in_thread": 0, "title": "College Ave Student Loans Names New Chief Legal Officer and Chief Marketing Officer", "locations": [], "entities": {"persons": [{"name": "lisa strauch eggers", "sentiment": "negative"}, {"name": "angela colatriano", "sentiment": "negative"}, {"name": "joe depaulo", "sentiment": "none"}, {"name": "angela", "sentiment": "none"}, {"name": "strauch eggers", "sentiment": "none"}, {"name": "lisa", "sentiment": "none"}], "locations": [{"name": "del.", "sentiment": "none"}, {"name": "wilmington", "sentiment": "none"}], "organizations": [{"name": "college ave", "sentiment": "none"}, {"name": "department of state", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lisa Strauch Eggers joins team as Chief Legal Officer, as Angela Colatriano is named Chief Marketing Officer\nWILMINGTON, Del.--(BUSINESS WIRE)-- College Ave Student Loans, a leading provider of private student loans, announced today two key appointments to its leadership team: Lisa Strauch Eggers has joined the team as Chief Legal Officer, and Angela Colatriano has been named Chief Marketing Officer.\n“We are thrilled with these exceptional additions to the College Ave Student Loans leadership team,\" said CEO and Co-Founder Joe DePaulo. “Lisa’s years as a General Counsel, plus her extensive experience as in-house counsel, will be invaluable as we look to grow and pursue new avenues in higher education financing. Angela is a key member of College Ave’s leadership, and much of our success is due to her expertise in defining College Ave’s brand, product set and customer experience. In her new position as Chief Marketing Officer, she will bring her background and vision to our future initiatives.”\nStrauch Eggers most recently served in the Department of State as a Foreign Service Officer based in Paris. Prior to that, she was the Interim General Counsel and Chief Ethics Officer for Eddie Bauer, where she led their legal team in all domestic and international legal matters. She also served as the first-ever Chief Legal Officer and Corporate Secretary for Callison, a private equity-backed international professional services firm, where she was responsible for establishing the legal department and leading the company through its sale to a publicly-traded company. She was the first international lawyer for Starbucks. Strauch Eggers earned a Juris Doctor degree from Georgetown University Law Center, and a Bachelor of Arts degree from The Johns Hopkins University.\n“It's an exciting time at College Ave Student Loans, and I am looking forward to helping them navigate the evolving fintech lending industry with my legal and corporate expertise,” said Strauch Eggers.\nAs Chief Marketing Officer, Colatriano is responsible for driving College Ave’s product platform and strategies, acquisition investments, customer experience and brand. Before being named Chief Marketing Officer, Colatriano served as Director of Product & Brand Management for the company. She is a founding member of College Ave’s leadership team, having joined the company for its launch in 2014. Prior to joining College Ave, Colatriano was a Senior Director at Sallie Mae, as well as Upromise by Sallie Mae, where she was responsible for enrollment and member engagement through the Upromise Rewards platform. Colatriano graduated summa cum laude from Towson University in Maryland with a Bachelor of Science degree.\n“As Chief Marketing Officer, I look forward to applying my industry knowledge and strategic insights to help College Ave succeed in 2018 and beyond,” said Colatriano. “Both online lending and higher education are undergoing important changes, and I am excited to continue with College Ave in my new capacity as we navigate our next phase of growth.”\nAbout College Ave Student Loans\nCollege Ave Student Loans is simplifying the student loan experience so students can get on with what matters most: preparing for a bright future. As a fintech lending company with a sole focus on private student loans, we’re using technology and our deep industry expertise to connect families who need to cover education costs with lenders who can provide that funding. By specializing in student loans, we are able to give our customers the attention they deserve and deliver loans that are simple, clear, and personalized for the individual: we help you find your perfect fit. We offer competitive rates, a wide range of repayment options, and a customer-friendly experience from application through repayment. Visit: www.collegeavestudentloans.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005008/en/\nCollege Ave Student Loans\nAngela Colatriano, 302-684-6066\nacolatriano@collegeave.com\nor\nDuffy & Shanley, Inc.\nEmily Hollenbeck, 401-278-4432\nehollenbeck@duffyshanley.com\nSource: College Ave Student Loans", "external_links": ["http://www.businesswire.com/news/home/20180129005008/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.collegeavestudentloans.com&esheet=51748480&newsitemid=20180129005008&lan=en-US&anchor=www.collegeavestudentloans.com&index=1&md5=bdf99130c7c97e62d89913b6d4ab273f"], "published": "2018-01-29T18:00:00.000+02:00", "crawled": "2018-01-29T19:28:01.001+02:00", "highlightTitle": ""}