{"organizations": [], "uuid": "c7f8dc5ad57b6bed29f002ad008a9c59fb2c0318", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/01/104923081-GettyImages-200275642-001.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/02/asian-currencies-off-to-strong-start-for-2018-sing-dollar-at-1-12-year-high.html", "country": "US", "domain_rank": 767, "title": "Dollar on defensive at start of 2018; Asian currencies shine", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-02T08:51:00.000+02:00", "replies_count": 0, "uuid": "c7f8dc5ad57b6bed29f002ad008a9c59fb2c0318"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/asian-currencies-off-to-strong-start-for-2018-sing-dollar-at-1-12-year-high.html", "ord_in_thread": 0, "title": "Dollar on defensive at start of 2018; Asian currencies shine", "locations": [], "entities": {"persons": [], "locations": [{"name": "united states", "sentiment": "none"}], "organizations": [{"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The dollar sank on Tuesday to its lowest in more than three months, weighed down on the first trading day of 2018 by expectations of a slower pace of interest rate increases by the Federal Reserve amid a tepid U.S. inflation picture.\nThe dollar's decline continued the momentum of 2017, the greenback's weakest annual performance in 14 years.\n\"Investors remain skeptical about the Fed's outlook for three additional interest rate increases this year, especially given the extremely benign inflation backdrop in the U.S.,\" said Omer Esiner, chief market analyst, at Commonwealth Foreign Exchange in Washington.\nshow chapters How to play a weak dollar in 2018: Pro 5:09 PM ET Thu, 28 Dec 2017 | 01:12 The dollar's upside was also capped as many of the world's major central banks such as the Bank of England and European Central Bank are moving toward normalizing their own monetary policies.\nThe dollar index hit a 3-1/2-month trough of 91.751 and was last down 0.29 percent at 91.85. For 2017, the dollar index slid more than 9.8 percent, its weakest year since 2003.\n\"Any further drop below 91.00 would confirm a continuation of the dollar's bearish trend from the beginning of 2017, with the next major downside target around the 90.00 psychological support level,\" said James Chen, head of research at Forex.com in Bedminster, New Jersey.\nThe euro, meanwhile, has been on a tear especially since the second half of last year, on optimism over a brightening economic picture in the euro zone. In 2017, the single currency posted its strongest year against the dollar since 2003 as European economies strengthened and expectations grew that the ECB will wind down monetary stimulus.\nThe euro rose to start the new year, climbing to a nearly four-month high of $1.2082. It was last up 0.39 percent at $1.2055.\nEuro zone manufacturers ended 2017 by ramping up activity at the fastest pace in more than two decades, a survey showed on Tuesday, and rising demand suggests they will start the new year on a high.\nAlso boosting the euro was a comment from an ECB official over the weekend. The ECB's Benoit Coeure said on the weekend he saw a \"reasonable chance\" the bank's bond purchases would not be extended beyond September.\nAgainst the yen , the dollar fell 0.35 percent to 112.25. The yen continues to benefit from last week's release of the Bank of Japan 's minutes of its meeting.\nThe minutes showed some members are considering tightening monetary policy if the economy continues to improve next year, which would be a significant shift in strategy for a central bank thought to be the last to exit easier monetary policies.", "external_links": [], "published": "2018-01-02T08:51:00.000+02:00", "crawled": "2018-01-02T08:34:41.003+02:00", "highlightTitle": ""}