{"organizations": [], "uuid": "aed0add335ac6272ff995eca31b95909801e703e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-heartland-financial-usa-inc-increases-quarterly-cash-dividend.html", "country": "US", "domain_rank": 767, "title": "Heartland Financial USA, Inc. Increases Quarterly Cash Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:30:00.000+02:00", "replies_count": 0, "uuid": "aed0add335ac6272ff995eca31b95909801e703e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-heartland-financial-usa-inc-increases-quarterly-cash-dividend.html", "ord_in_thread": 0, "title": "Heartland Financial USA, Inc. Increases Quarterly Cash Dividend", "locations": [], "entities": {"persons": [{"name": "lynn b. fuller", "sentiment": "none"}], "locations": [{"name": "dubuque", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "heartland financial usa", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "negative"}, {"name": "heartland financial usa, inc", "sentiment": "neutral"}, {"name": "heartland", "sentiment": "none"}, {"name": "about heartland financial usa, inc", "sentiment": "none"}, {"name": "heartland financial usa, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBUQUE, Iowa, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Heartland Financial USA, Inc. (NASDAQ:HTLF), announced that its board of directors approved an eighteen percent increase in its regular quarterly cash dividend to $0.13 per share on the company's common stock. The dividend is payable March 2, 2018, to stockholders of record at the close of business on February 16, 2018.\nLynn B. Fuller, Heartland’s Chairman and Chief Executive Officer said, “For 37 years, Heartland has rewarded our shareholders with level or increasing dividends. Last month, we announced a special dividend and today, we are very proud to announce an increased dividend. Our solid performance in 2017 delivered strong net interest margin and continued growth in core earnings. As we enter 2018, we have momentum and are well positioned for continued growth.”\nAt December 31, 2017, there were 29,953,356 common shares outstanding listed on the NASDAQ Global Select Market under the symbol HTLF.\nAbout Heartland Financial USA, Inc.\nHeartland Financial USA, Inc. is a diversified financial services company with assets exceeding $9.7 billion. The company provides banking, mortgage, private client, investment, insurance and consumer finance services to individuals and businesses. Heartland currently has 117 banking locations serving 88 communities in Iowa, Illinois, Wisconsin, New Mexico, Arizona, Montana, Colorado, Minnesota, Kansas, Missouri, Texas and California. Additional information about Heartland Financial USA, Inc. is available at www.htlf.com .\nSafe Harbor Statement\nThis release, and future oral and written statements of Heartland and its management, may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 about Heartland’s financial condition, results of operations, plans, objectives, future performance and business. Although these forward-looking statements are based upon the beliefs, expectations and assumptions of Heartland’s management, there are a number of factors, many of which are beyond the ability of management to control or predict, that could cause actual results to differ materially from those in its forward-looking statements. These factors, which are detailed in the risk factors included in Heartland’s Annual Report on Form 10-K filed with the Securities and Exchange Commission, include, among others: (i) the strength of the local and national economy; (ii) the economic impact of past and any future terrorist threats and attacks and any acts of war, (iii) changes in state and federal laws, regulations and governmental policies concerning the Company’s general business; (iv) changes in interest rates and prepayment rates of the Company’s assets; (v) increased competition in the financial services sector and the inability to attract new customers; (vi) changes in technology and the ability to develop and maintain secure and reliable electronic systems; (vii) the loss of key executives or employees; (viii) changes in consumer spending; (ix) unexpected results of acquisitions; (x) unexpected outcomes of existing or new litigation involving the Company; and (xi) changes in accounting policies and practices. All statements in this release, including forward-looking statements, speak only as of the date they are made, and Heartland undertakes no obligation to update any statement in light of new information or future events.\nCONTACT: Bryan R. McKeag Executive Vice President Chief Financial Officer (563) 589-1994 bmckeag@htlf.com\nSource:Heartland Financial USA, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=zW06uDKTudG2Td5DdrzX_9GTivcH2dbrhdmQ0eMcHqiwSFXtrE0TMMbjCMVhmKIpdXSXHAtuDVi4gCR8Zmz0DA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2d639be0-004e-4872-986c-299ab66a5b78"], "published": "2018-01-18T19:30:00.000+02:00", "crawled": "2018-01-18T22:05:19.000+02:00", "highlightTitle": ""}