{"organizations": [], "uuid": "f2b61ba4cc26ccf289c6de51eb19034259666fdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC193_3l9hn_TOP_20180121055322.jpg", "site_section": "https://www.wsj.com/news/business/energy-oil-gas", "section_title": "Energy News, Oil News, Gas News, Nuclear &amp; Wind Industry, Gasoline at WSJ.com", "url": "https://www.wsj.com/articles/saudis-push-for-opec-oil-efforts-into-2019-1516532595", "country": "US", "domain_rank": 387, "title": "Saudis Push for OPEC Oil Efforts Into 2019", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T14:03:00.000+02:00", "replies_count": 0, "uuid": "f2b61ba4cc26ccf289c6de51eb19034259666fdb"}, "author": "Summer Said", "url": "https://www.wsj.com/articles/saudis-push-for-opec-oil-efforts-into-2019-1516532595", "ord_in_thread": 0, "title": "Saudis Push for OPEC Oil Efforts Into 2019", "locations": [], "entities": {"persons": [{"name": "khalid al-falih", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "muscat", "sentiment": "none"}, {"name": "oman", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "negative"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS MUSCAT, Oman—Saudi Arabia’s energy minister said Sunday that OPEC and other big-oil producing allies like Russia should find ways to cooperate beyond their petroleum-production limits this year.\n“We should not limit our efforts to 2018. We need to be talking about a longer framework for our cooperation,” Saudi Arabia’s top oil official Khalid al-Falih told reporters ahead of a meeting of the Organization of the Petroleum Exporting Countries’ committee here in Oman’s capital. OPEC’s message to the world, he said, should be “this is something that is here to stay.”\nMr. Falih—the de facto leader of OPEC—gave the most explicit call for the 14-nation cartel and 10 nonmember allies to keep supporting the oil market into 2019. Oil prices have risen from around $45 a barrel in June to over $70 a barrel this month in part because of the group’s agreement to reduce the world’s oil production by about 1.8 million barrels a day, or nearly 2% of global output.\nMr. Falih pointed to weaknesses in the deal, saying the first OPEC-led output cuts in almost a decade had yet to instill enough confidence in the oil industry for investment in expensive projects. He said he wanted to make investors and companies comfortable with the “long-term prospects of the market” beyond the recent rally.\nMr. Falih also said the production cuts aren’t close to achieving their goal of forcing enough oil out of storage to bring supply and demand into balance. He said that balance may not happen until early 2019, the first time he has pushed the time frame beyond 2018.\nMr. Falih’s comments highlighted the challenge OPEC faces in the second year of its efforts to prop up oil prices after a historic price crash caused by the American oil boom.\nThe cartel faces a wave of new oil from U.S. producers who are capitalizing on rising prices and are project to pump more oil than Saudi Arabia this year for the first time since the early 1990s. OPEC and its allies also want to find a way to wind down their limits on production— which are costing these nation’s millions of dollars every day as prices rise—without spooking investors.\nMr. Falih dismissed shale producers as a threat, saying investments in their business in recent months were “hyped.” Shale’s rise in production will simply provide supply to meet growing demand, without affecting OPEC’s plans, he said.\n“Shale will grow but I think it is a big market,” he said.\nMr. Falih said cooperating beyond the current agreement’s ending in December 2018 “doesn’t necessarily mean sticking barrel by barrel to the same to the same limits or caps or targets of production country by country that we signed up to in 2016.”\nMr. Falih will need to secure a cooperation commitment from Russia, which isn’t an OPEC member but, as the world’s largest oil producer, has helped the cartel’s efforts with significant output cuts in the past year.\nRussian energy minister Alexander Novak on Sunday sounded a more optimistic note, saying “we think that the market should rebalance this year.”\nOPEC members met Sunday in Muscat to discuss the compliance levels of countries that agreed to cut oil production. Mr. Falih said the group was cutting more oil than agreed—though its efforts have been helped along by the collapse of OPEC member Venezuela’s economy and energy industry.\nThe producers already see merit in maintaining the cuts into 2019 and will probably not discuss an exit strategy from the deal before the end of this year, Oman Oil Minister Mohammed Al Rumhy told reporters.\nWrite to Summer Said at summer.said@wsj.com", "external_links": [], "published": "2018-01-21T14:03:00.000+02:00", "crawled": "2018-01-21T15:35:49.012+02:00", "highlightTitle": ""}