{"organizations": [], "uuid": "1d034bb62f2f82d450855772cf6203f7501f8469", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-matthews-international-declares-quarterly-dividend.html", "country": "US", "domain_rank": 767, "title": "Matthews International Declares Quarterly Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T22:00:00.000+02:00", "replies_count": 0, "uuid": "1d034bb62f2f82d450855772cf6203f7501f8469"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-matthews-international-declares-quarterly-dividend.html", "ord_in_thread": 0, "title": "Matthews International Declares Quarterly Dividend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Matthews International Corporation (NASDAQ:MATW) announced that its Board of Directors declared, at its regularly scheduled meeting today, a dividend of $0.19 per share on the Company’s common stock. The dividend is payable February 19, 2018 to stockholders of record February 5, 2018.\nMatthews International Corporation is a global provider of brand solutions, memorialization products and industrial technologies. The SGK Brand Solutions segment is a leader in providing brand development, deployment and delivery services that help build our clients’ brands and consumers’ desire for them. The Memorialization segment is a leading provider of memorialization products, including memorials, caskets and cremation equipment, primarily to cemetery and funeral home customers that help families move from grief to remembrance. The Industrial Technologies segment designs, manufactures and distributes marking, coding and industrial automation technologies and solutions. We have approximately 11,000 employees in more than 25 countries on six continents that are committed to delivering the highest quality products and services.\nAny forward-looking statements contained in this release are included pursuant to the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements involve known and unknown risks and uncertainties that may cause the Company’s actual results in future periods to be materially different from management’s expectations. Although the Company believes that the expectations reflected in such forward-looking statements are reasonable, no assurance can be given that such expectations will prove correct. Factors that could cause the Company’s results to differ materially from the results discussed in such forward-looking statements principally include changes in economic conditions, competitive environment, death rate, foreign currency exchange rates, technological factors beyond the Company’s control, and other factors described in the Company’s Annual Report on Form 10-K and other periodic filings with the U.S. Securities and Exchange Commission.\nContact: Steven F. Nicola,\nChief Financial Officer\nMatthews International Corporation\nCorporate Office\nTwo NorthShore Center\nPittsburgh, PA 15212-5851\nPhone: (412) 442-8200\nFax: (412) 442-8290\nSource:Matthews International Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/08d14724-d159-49fc-a2ea-72a8f1ca1661"], "published": "2018-01-25T22:00:00.000+02:00", "crawled": "2018-01-26T00:06:52.006+02:00", "highlightTitle": ""}