{"organizations": [], "uuid": "36e1e9dacbc148db8cd22084541d7a7d6cd6602c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/10/rts1h73n1.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/tesla-trip-planner-model-3/", "country": "US", "domain_rank": 1196, "title": "Tesla’s New Trip Planner Offers Free Insight to the Model 3 Experience | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.197, "site_type": "news", "published": "2018-01-04T15:21:00.000+02:00", "replies_count": 0, "uuid": "36e1e9dacbc148db8cd22084541d7a7d6cd6602c"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/04/tesla-trip-planner-model-3/", "ord_in_thread": 0, "title": "Tesla’s New Trip Planner Offers Free Insight to the Model 3 Experience | Fortune", "locations": [], "entities": {"persons": [{"name": "kirsten korosec", "sentiment": "negative"}, {"name": "tesla", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "est  tesla", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec 1:21 PM EST \nTesla has launched a trip planner on its website as it aims to give prospective buyers—and those with reservations for the new Model 3—better insight into what it means to drive and charge their electric vehicles. \nIt’s a small improvement, but a notable one. Until now, only Tesla (tsla) owners had access (via their car’s central screen) to plan trips between locations. The trip planning tool was built into the car’s navigation. But outsiders, including prospective buyers, had no access to that information. That might have worked in the early days of the company, when buyers tended to be early adopters of technology and that new Tesla was often their third car. \nBut with the Model 3, that demographic should change. At least, that’s what Tesla is counting on. \nThe point of the trip planner is to help prospective buyers get a better sense of the benefits and challenges to owning a Tesla electric vehicle. Screenshot of Tesla Trip Planner \nThe website lets users pick the Tesla model as well as a starting and end point. The map shows the route, where and how long the vehicle would need to stop, and gas savings. The estimated gas savings stat assumes free Supercharging for Model S and Model X, which are available to new customers via referral codes , or pay per use for Model 3 at a cost of $0.20 per kilowatt hour, according to Tesla. Gasoline cost assumes 21 miles per gallon at $2.73 per gallon. \nUsers are also shown nearby “destination charging” locations, which are dedicated Tesla chargers located at hotels and restaurants. Depending on which model is chosen, users will also be shown an “order” option. \nThe in-car navigation is still the better option for Tesla owners. It’s a more robust system that gives drivers greater detail. \nEven as Tesla prepares for a new customer base, it’s still grappling with production problems. \nTesla reported Wednesday it produced 2,425 of its new Model 3 electric car in the fourth quarter and delivered 1,550, missing Wall Street expectations as the company led by Elon Musk tries to solve production bottlenecks that have forced it to dial back its own mass manufacturing goals. \nDespite making “major progress” addressing Model 3 production bottlenecks, the company has pushed back its target of producing 5,000 Model 3 sedans per week to the end of the second quarter. This is the second time Tesla has punted on its 5,000-per-week milestone. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-04T15:21:00.000+02:00", "crawled": "2018-01-04T21:35:12.001+02:00", "highlightTitle": ""}