{"organizations": [], "uuid": "c8ab698ca83330c576de76ee9beb12edbed10f22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-shiftpixy-to-announce-fiscal-first-quarter-2018-results.html", "country": "US", "domain_rank": 767, "title": "ShiftPixy to Announce Fiscal First Quarter 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:00:00.000+02:00", "replies_count": 0, "uuid": "c8ab698ca83330c576de76ee9beb12edbed10f22"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-shiftpixy-to-announce-fiscal-first-quarter-2018-results.html", "ord_in_thread": 0, "title": "ShiftPixy to Announce Fiscal First Quarter 2018 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}, {"name": "hcm", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif., Jan. 19, 2018 (GLOBE NEWSWIRE) -- ShiftPixy, Inc. (NASDAQ:PIXY), an on-demand human capital platform that syncs work opportunities from shift-based employers with ready-for-hire workers, will release its fiscal first quarter 2018 earnings results after the market close on Monday, January 22, 2018.\nManagement will host a webcast to discuss the results at 2:00 p.m. Pacific Time (5:00 p.m. Eastern Time) on Monday, January 22, 2018. To access the webcast, please visit the investor relations section of the Company's website at www.shiftpixy.com . The on-line replay will be available for one month after conclusion of the call.\nAbout ShiftPixy\nShiftPixy is a disruptive human capital management (HCM) services provider, revolutionizing employment in the Gig Economy by delivering a next-gen platform for workforce management that helps businesses with shift-based employees navigate regulatory mandates, minimize administrative burdens and better connect with a ready-for-hire workforce. With expertise rooted in management’s nearly 25 years of workers’ compensation and compliance programs experience, ShiftPixy adds a needed layer for addressing compliance and continued demands for equitable employment practices in the growing Gig Economy. ShiftPixy’s complete HCM ecosystem is designed to manage regulatory requirements and compliance in such required areas as paid time off (PTO) laws, insurance and workers’ compensation, minimum wage increases, and Affordable Care Act (ACA) compliance.\nShiftPixy Cautionary Statement\nThe information provided in this release includes forward-looking statements, the achievement or success of which involves risks, uncertainties, and assumptions. Although such forward-looking statements are based upon what management of the Company believes are reasonable assumptions, there can be no assurance that forward-looking statements will prove to be accurate. If any of the risks or uncertainties, including those set forth below, materialize or if any of the assumptions prove incorrect, the results of ShiftPixy, Inc., could differ materially from the results expressed or implied by the forward-looking statements we make. The risks and uncertainties include, but are not limited to, risks associated with the nature of our business model; our ability to execute the Company's vision and growth strategy; our ability to attract and retain clients; our ability to assess and manage risks; changes in the law that affect our business and our ability to respond to such changes and incorporate them into our business model, as necessary; our ability to insure against and otherwise effectively manage risks that affect our business; competition; reliance on third-party systems and software; our ability to protect and maintain our intellectual property; and general developments in the economy and financial markets. The Company undertakes no obligation to update forward-looking statements if circumstances or management's estimates or opinions should change, except as required by applicable securities laws. The information in this press release shall not be deemed to be \"filed\" for the purpose of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section, and will not be deemed an admission as to the materiality of any information that is required to be disclosed solely by Regulation FD. Further information on these and other factors that could affect the financial results of ShiftPixy, Inc., is included in the filings on Forms 1-A and 10-K and in other filings we make with the Securities and Exchange Commission from time to time. These documents are available on the \"SEC Filings\" subsection of the \"Investor Information\" section of our website at https://ir.shiftpixy.com/financial-information/sec-filings .\nConsistent with the SEC’s April 2013 guidance on using social media outlets like Facebook and Twitter to make corporate disclosures and announce key information in compliance with Regulation FD, ShiftPixy is alerting investors and other members of the general public that ShiftPixy will provide updates on operations and progress required to be disclosed under Regulation FD through its social media on Facebook, Twitter, LinkedIn and YouTube. Investors, potential investors, shareholders and individuals interested in our Company are encouraged to keep informed by following us on Facebook, Twitter, LinkedIn and YouTube.\nContact:\nInvestor Relations\nInvestorRelations@shiftpixy.com\n800.475.3655\nSource:ShiftPixy, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=0FldzXEqflNvSat1_869CnvuTcHIT8BzyJW9o7b8aoYdeLXgAfLpS_PG-u5eU0xH5rkCmGf2C44mEa83jEMlZg==", "https://www.globenewswire.com/Tracker?data=AqOlCdCz7is33axgJ7Vh29TRl2XqUyOkN5WqlSMW46LEvjjTRKjjSo1J3KKOAzuAuCG8UNsd9Ur3nNJbEFHXQb15ZJVDhWeLSzcppT40BJ2G0lMFW6cdyVhuKtRweqGo9vilO_4ecIScdVzMoPRv7iNjNT25XiIeLEk_QrBFMJVdkCkKAcV8Nz7mrV7IqsNeH_at8zj9QYWa75Q2M4g-hw==", "https://www.globenewswire.com/Tracker?data=pKnsGN48O9XCWxyny0HLgmq_IXzra970LYZCaii--uPT-1UEc0zqAwxwB0ls15O1Q673quzlx0UbFMCICcZljQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/77aa1d32-3462-4abd-975a-4862aa143847", "https://www.globenewswire.com/Tracker?data=p7lAKeqsifULaiCNatal5fCiKULbPfk_Q74J9l5POp42AqZnd1F9yMecuMGNaWBikzj6XyYnm8xvFQorDEwB9wTKFoakVM-N8uE4iVWPT006i3fUdrbkYb4JdhVpc_7R", "https://ir.shiftpixy.com/financial-information/sec-filings", "https://www.globenewswire.com/Tracker?data=ccTIxSCj-2QUXx7D0Dr0EbU8aMyne74P1xDSsUlq06KeHcgRBCOSgGoq-rGvdDdxJ1Pu-A0hQ9AFcz82WCLGjQ=="], "published": "2018-01-19T16:00:00.000+02:00", "crawled": "2018-01-19T16:05:53.011+02:00", "highlightTitle": ""}