{"organizations": [], "uuid": "bdda5366812d900a829f2fd04ab48e47d4635884", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-wheeler-real-estate-investment-trust-inc-announces-contract-to-acquire-janaf-shopping-yard-in-norfolk-virginia.html", "country": "US", "domain_rank": 767, "title": "Wheeler Real Estate Investment Trust, Inc. Announces Contract to Acquire JANAF Shopping Yard in Norfolk, Virginia", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-09T16:20:00.000+02:00", "replies_count": 0, "uuid": "bdda5366812d900a829f2fd04ab48e47d4635884"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-wheeler-real-estate-investment-trust-inc-announces-contract-to-acquire-janaf-shopping-yard-in-norfolk-virginia.html", "ord_in_thread": 0, "title": "Wheeler Real Estate Investment Trust, Inc. Announces Contract to Acquire JANAF Shopping Yard in Norfolk, Virginia", "locations": [], "entities": {"persons": [{"name": "t.j. maxx", "sentiment": "none"}, {"name": "wawa", "sentiment": "none"}], "locations": [{"name": "virginia virginia beach", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}, {"name": "norfolk", "sentiment": "none"}, {"name": "virginia beach", "sentiment": "none"}, {"name": "petco", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "wheeler real estate investment trust, inc", "sentiment": "neutral"}, {"name": "wheeler real estate investment trust, inc.", "sentiment": "neutral"}, {"name": "llc", "sentiment": "none"}, {"name": "bj", "sentiment": "none"}, {"name": "wholesale club", "sentiment": "none"}, {"name": "janaf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VIRGINIA BEACH, Va., Jan. 09, 2018 (GLOBE NEWSWIRE) -- Wheeler Real Estate Investment Trust, Inc. (NASDAQ:WHLR) (“Wheeler” or the “Company”), a fully-integrated, self-managed commercial real estate investment company focused on acquiring and managing income-producing retail properties with a primary focus on grocery-anchored centers, today reported that the Company, through WHLR-JANAF, LLC, a wholly-owned subsidiary, has entered into a purchase and sale agreement (as amended) with JANAF Shopping Center, LLC, JANAF Shops, LLC, JANAF HQ, LLC and JANAF Crossings, LLC to acquire JANAF Shopping Yard (“JANAF”), an 887,917 rentable square foot shopping center located in Norfolk, Virginia.\nJANAF is located approximately 9 miles from the Wheeler corporate office in Virginia Beach, Virginia and, as of September 30, 2017, was 94% occupied and anchored by prominent retailers including BJ’s Wholesale Club and Fuel Center (151,345 square feet in total); T.J. Maxx (37,383 square feet); Petco (17,000 square feet); Wawa (7,240 square feet); and Big Lots (42,500 square feet). Service and necessity providers such as the United States Postal Service, SunTrust Bank and others are also tenants of JANAF and serve the surrounding community. JANAF encompasses approximately 92 acres and includes 850,683 square feet of retail space in multiple buildings and 37,234 square feet of office space in one building. Originally built in 1959, JANAF has undergone several renovations, the last being in 2006.\nThe expected purchase price of the acquisition of $85.65 million, or approximately $96 per leasable square foot, includes the assumption of approximately $58.4 million of mortgage loans secured by the property. The primary loan that the Company is assuming has a $53.3 million balance, bears interest at a fixed rate of 4.49%, matures in July 2023 and is pre-payable 90 days prior to its maturity. The Company will also assume a separate loan with a $5.1 million balance that bears interest at a rate of 4.95%, matures in January 2026 and is pre-payable six months prior to its maturity.\nJon S. Wheeler, Chairman and Chief Executive Officer of Wheeler, stated, “JANAF is an iconic property located right here in our back yard in Virginia. The asset is centric to our business strategy of owning the dominant center in secondary and tertiary markets. We expect JANAF to be a long-term play for WHLR as we believe there is tremendous value in the underlying real estate. ”\nAbout Wheeler Real Estate Investment Trust, Inc.\nHeadquartered in Virginia Beach, VA, Wheeler Real Estate Investment Trust, Inc. is a fully-integrated, self-managed commercial real estate investment company focused on acquiring and managing income-producing retail properties with a primary focus on grocery-anchored centers. Wheeler’s portfolio contains well-located, potentially dominant retail properties in secondary and tertiary markets that generate attractive risk-adjusted returns, with a particular emphasis on grocery-anchored retail centers.\nAdditional information about Wheeler Real Estate Investment Trust, Inc. can be found at the Company’s corporate website: www.whlr.us .\nForward-looking Statement\nThis press release may contain “forward-looking” statements as defined in the Private Securities Litigation Reform Act of 1995. When the Company uses words such as “may,” “will,” “intend,” “should,” “believe,” “expect,” “anticipate,” “project,” “estimate” or similar expressions that do not relate solely to historical matters, it is making forward-looking statements. Forward-looking statements are not guarantees of future performance and involve risks and uncertainties that may cause the actual results to differ materially from the Company’s expectations discussed in the forward-looking statements. The Company’s expected results may not be achieved, and actual results may differ materially from expectations. Specifically, the Company’s statements regarding (a) the Company’s ability to complete the JANAF acquisition, (b) the Company’s willingness to retain the JANAF property for a significant period of time and (c) the value of real property underlying the JANAF investment are forward-looking statements. These statements are not guarantees of future performance and are subject to risks, uncertainties and other factors, some of which are beyond our control, are difficult to predict and could cause actual results to differ materially from those expressed or forecasted in the forward-looking statements. For these reasons, among others, investors are cautioned not to place undue reliance upon any forward-looking statements in this press release. Additional factors are discussed in the Company's filings with the U.S. Securities and Exchange Commission, which are available for review at www.sec.gov . The Company undertakes no obligation to publicly revise these forward‐looking statements to reflect events or circumstances that arise after the date hereof.\nCONTACT:\nWheeler Real Estate Investment Trust, Inc.\nWilkes Graham\nChief Financial Officer\n(757) 627-9088\nwilkes@whlr.us\nLaura Nguyen\nDirector of Investor Relations\n(757) 627-9088\nlaura@whlr.us\nSource:Wheeler Real Estate Investment Trust, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/ff2a7382-3289-4942-8a44-a5adfe2c37df", "https://www.globenewswire.com/Tracker?data=C-4kzcZy75nwgnuON0OULFKKeq7mAgLyACg6e-z6M8GozTQVfjHdAo0VryuzQGcpqvB8NExmmyDD7RCeDp3tlw==", "https://www.globenewswire.com/Tracker?data=KKcdQWGQ0feIr5tVQazc_ed-hUmzfOuo15LvLs6egE1wA7K8MbyV0LM6us_ziFXOxa5L9bIwYmGJPEB3PArLew==", "https://www.globenewswire.com/Tracker?data=icvBty2wkOBeHREC4OaaUUjhBB3pmqyf0i2mX5iXxcGlJ6seTHB7geaP_4XX0lMlKKCdu_suE3mxbmbmdDp88w=="], "published": "2018-01-09T16:20:00.000+02:00", "crawled": "2018-01-09T17:38:50.034+02:00", "highlightTitle": ""}