{"organizations": [], "uuid": "85dc0d575849438ea45a0e837a5657ceab4dccfd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225802941&w=1200&r=LYNXMPEE0Q0KL", "site_section": "http://www.reuters.com/resources/archive/us/20180128.html", "section_title": "Archive News &amp; Video for Sunday, 28 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-tennis-ausopen-wozniacki-quotes/i-didnt-want-to-think-about-winning-says-champion-wozniacki-idUSKBN1FG0PV", "country": "US", "domain_rank": 408, "title": "I didn't want to think about winning, says champion Wozniacki", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-28T00:13:00.000+02:00", "replies_count": 0, "uuid": "85dc0d575849438ea45a0e837a5657ceab4dccfd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tennis-ausopen-wozniacki-quotes/i-didnt-want-to-think-about-winning-says-champion-wozniacki-idUSKBN1FG0PV", "ord_in_thread": 0, "title": "I didn't want to think about winning, says champion Wozniacki", "locations": [], "entities": {"persons": [{"name": "wozniacki", "sentiment": "negative"}, {"name": "caroline wozniacki", "sentiment": "negative"}, {"name": "dane", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "halep", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - Caroline Wozniacki said she stopped herself thinking about what it would feel like to win a first grand slam title in case Saturday’s Australian Open final against Simona Halep did not go to plan.\nWozniacki finally added her name to the grand slam winners’ list at the 43rd time of asking after outlasting Halep 7-6(2) 3-6 6-4 on a sweltering Rod Laver Arena, becoming the first Dane to win one of tennis’s four biggest prizes.\nNot only that but her triumph lifted her back to the top of the world rankings for the first time in six years -- a period during which life had thrown her several “curve balls”.\n“I didn’t want to think too much about how it would feel to win before the match because that’s like in case I don‘t, it’s going to hurt even more,” the 27-year-old, less than two years after being ranked in the 70s after a career slide, told reporters with the Daphne Akhurst Memorial Cup at her side.\n”But now I‘m just so happy to have the trophy. As athletes we don’t enjoy the moments very long and I want to enjoy this one because it’s very special.\n”I‘m a grand slam champion, and that still seems crazy to say, but I‘m also back to number one.\n“I couldn’t have scripted it any better.”\nAfter two U.S. Open final defeats, many thought Wozniacki might never get another chance to win a grand slam, let alone return to the top of the WTA standings.\n“Lots of ups and downs. But one thing that remained consistent was my fighting spirit and never giving up,” Wozniacki, who now holds the record for length of time between stints at world number one, said.\n“Life sometimes throws curve balls at you and you have to deal with it. Tonight is such a special moment.”\nThe fact that she could share that moment with her father Piotr, her coach since she was seven, added to the occasion.\n“My dad has been there from the start and we took the journey together,” she said.\n“To have him in my corner on a night like tonight, holding the trophy and sharing this means a lot.”\nWozniacki trailed 4-3 in a see-sawing final set in which both players seemed close to exhaustion.\nBut she found some last reserves of energy to reel off three games and leave Halep sucking up a third grand slam final loss.\n“I obviously feel very sad for her, but at the same time I‘m very happy for myself,” she said.\nReporting by Martyn Herman, editing by Pritha Sarkar\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-28T00:13:00.000+02:00", "crawled": "2018-01-29T11:47:48.008+02:00", "highlightTitle": ""}