{"organizations": [], "uuid": "9a3a8dfdb1697f100543001503ecf03f799f8d8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222875093&w=1200&r=LYNXMPEE0H00A", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-houseprices-rics/uk-rics-house-price-gauge-unexpectedly-picks-up-from-four-year-low-idUKKBN1F700P", "country": "US", "domain_rank": 408, "title": "UK RICS house price gauge unexpectedly picks up from four-year low", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T02:26:00.000+02:00", "replies_count": 0, "uuid": "9a3a8dfdb1697f100543001503ecf03f799f8d8c"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-houseprices-rics/uk-rics-house-price-gauge-unexpectedly-picks-up-from-four-year-low-idUKKBN1F700P", "ord_in_thread": 0, "title": "UK RICS house price gauge unexpectedly picks up from four-year low", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "royal institution of chartered surveyors", "sentiment": "none"}, {"name": "rics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:09 AM / Updated 4 hours ago UK RICS house price gauge unexpectedly picks up from four-year low Reuters Staff 3 Min Read \nLONDON (Reuters) - A key gauge of British house prices unexpectedly picked up last month from its lowest level in more than four years, helped by a less negative tone in London and neighbouring areas. \nThe Royal Institution of Chartered Surveyors (RICS) said on Thursday that its monthly house price index rose to +8 in December from zero in November, which had been its lowest reading since March 2013. \nEconomists polled by Reuters had on average expected the reading to stay unchanged, and none had forecast this big a rebound. \nBritish house price growth has slowed over the past year to between 2 and 5 percent, depending on the measure. This largely reflects weakness in London and surrounding areas, with bigger price rises in most of the rest of the United Kingdom. \nLondon’s housing market has suffered since mid-2016, beset both by June 2016’s Brexit vote which dented international investor demand, and a steep rise in purchase taxes for rental investments and property costing more than 1 million pounds. \nWeak wage growth and a jump in inflation since the Brexit vote have also squeezed potential home-buyers’ spare income. FILE PHOTO: A couple view properties for sale in an estate agents window in London, Britain August 22, 2016. Picture taken August 22, 2016. REUTERS/Peter Nicholls/File Photo \n“Challenges over affordability may have grown across the UK but they are clearly having a bigger impact in some parts of the country than others,” said RICS’s chief economist, Simon Rubinsohn. \nDecember’s RICS index showed surveyors reported the biggest price fall over the past three months in London - but less of a decline than in previous months. Price growth almost everywhere else remained solid and in line with its recent average. \nOver the next 12 months, property prices are expected to rise everywhere except London, and expectations for sales over the coming year are more bullish in all regions. \nSurveyors gave little credit to finance minister Philip Hammond’s flagship measure in his annual budget in November, which scrapped the property purchase tax known as stamp duty for almost all first-time home-buyers. \nSome 86 percent of RICS members said the measure had not led to any boost to the number of first-time buyers so far, and two thirds thought there would be no boost in future. \nInstead, existing home-owners were capturing much of the benefit by raising selling prices. \n“The risk was always that a good portion of the benefit would be capitalised in the price, therefore limiting the benefit for the first-time buyer,” Rubinsohn said. Reporting by David Milliken, editing by Andy Bruce", "external_links": [], "published": "2018-01-18T02:26:00.000+02:00", "crawled": "2018-01-18T02:38:32.021+02:00", "highlightTitle": ""}