{"organizations": [], "uuid": "1045837018e0ee24abde573b4466deefd22e47ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/11/the-associated-press-coal-executives-wish-list-finds-success-under-trump.html", "country": "US", "domain_rank": 767, "title": "Coal executive's 'wish list' finds success under Trump", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T07:24:00.000+02:00", "replies_count": 0, "uuid": "1045837018e0ee24abde573b4466deefd22e47ce"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/11/the-associated-press-coal-executives-wish-list-finds-success-under-trump.html", "ord_in_thread": 0, "title": "Coal executive's 'wish list' finds success under Trump", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "murray", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "robert \"bob\" murray", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "trump washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "associated press", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "murray energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — In the early days of the Trump administration, the head of one of America's largest coal companies sent a four-page \"action plan\" to the White House calling for rollbacks of Obama-era environmental and mine safety regulations.\n\"We have listed our suggested actions in order of priority,\" Robert \"Bob\" Murray, the chairman and CEO of Ohio-based Murray Energy, wrote in his March 1 letter addressed to Vice President Mike Pence. \"We are available to assist you and your administration in any way that you request.\"\nA review of the memo by The Associated Press shows Murray, an early campaign supporter of President Donald Trump and major GOP political donor, has gotten about half the items on his wish list. They include pulling the United States out of the Paris climate accords and revoking the Clean Power Plan, President Barack Obama's signature effort to limit planet-warming emissions from coal-fired power plants.\nMurray has spoken widely about his policy priorities in the intervening months, but a copy of his four-page plan became public this week after it was obtained by Democratic Sen. Sheldon Whitehouse of Rhode Island and first reported by The New York Times.\nUnder Trump, the Mine Safety and Health Administration has also moved to reconsider rules meant to protect miners from breathing coal and rock dust — the primary cause of black lung — and diesel exhaust, which can cause cancer.\nOther Murray priorities, such as eliminating federal tax credits for wind turbines and solar panels, have floundered, however. The renewable energy tax breaks were largely retained in the final Republican-drafted tax plan signed by Trump last month.\nAnd despite Trump's campaign pledges to put scores of coal back to work by ending what he and Murray have derided as Obama's \"War on Coal,\" the administration's regulatory rollback has thus far had modest economic benefits.\nOnly about 500 coal mining jobs were added in Trump's first year, bringing the total to about 50,900 nationally, according to the federal Bureau of Labor Statistics. The nation's utilities have also continued to shutter coal-fired plants in favor of those burning natural gas made cheaper and more abundant by new drilling technologies.\nIn an interview with AP on Wednesday, Murray said Trump and his appointees have overall done a great job helping his industry, rating them \"nearly a 10\" in the first year. He specifically credited Environmental Protection Administrator Scott Pruitt and Energy Secretary Rick Perry with being \"stars.\"\nMurray said he had private meetings with both Pruitt and Perry last year to discuss his policy goals.\n\"President Trump has done a wonderful job in addressing what is needed to improve the cost of electricity in America and to improve the reliability, security and resilience of the electric power grid,\" Murray said. \"I give him very high marks.\"\nSpokespeople for Pruitt and Perry did not immediately respond to questions Wednesday about Murray's action plan.\nMurray said he is still hopeful that Pruitt will follow through on the second-highest priority item on his 2017 action plan, revoking EPA's 2009 finding that emitting greenhouse gases in the atmosphere threatens public health and welfare. The finding provided the legal underpinnings for Obama's efforts to regulate carbon emissions as pollutants under the Clean Air Act.\nMurray also expressed disappointment that Trump appointees on the Federal Energy Regulatory Commission voted Monday to reject a proposal by Perry to make coal and nuclear power plants eligible for billions of dollars in government subsidies.\nAP reported last year that Murray had asked the Trump administration to issue an emergency order protecting coal-fired power plants from closing. Murray warned that failure to act could cause thousands of coal miners to be laid off and force his largest customer, Ohio-based FirstEnergy Solutions, into bankruptcy.\nPerry ultimately rejected Murray's request, but later asked FERC to boost coal and nuclear plants by subsidizing their continued operation.\nThe Republican-controlled commission voted unanimously to reject Perry's claim that further retirements of coal-fired power plants pose a threat to reliability of the nation's electric grid.\n\"There's no question about it, there are folks in the administration that have their own agenda, rather than President Trump's,\" Murray said. \"There are some staffers who have gone contrary to the wishes of our president.\"\nFollow Associated Press environmental writer Michael Biesecker at http://twitter.com/mbieseck", "external_links": [], "published": "2018-01-11T07:24:00.000+02:00", "crawled": "2018-01-12T03:54:35.015+02:00", "highlightTitle": ""}