{"organizations": [], "uuid": "848f6ccc90ec3611986b900f049d830932ee42e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-usa-compression-partners-to-acquire-compression-business-from-energy-transfer-partners.html", "country": "US", "domain_rank": 767, "title": "USA Compression Partners to Acquire Compression Business from Energy Transfer Partners", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.305, "site_type": "news", "published": "2018-01-16T14:55:00.000+02:00", "replies_count": 0, "uuid": "848f6ccc90ec3611986b900f049d830932ee42e1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-usa-compression-partners-to-acquire-compression-business-from-energy-transfer-partners.html", "ord_in_thread": 0, "title": "USA Compression Partners to Acquire Compression Business from Energy Transfer Partners", "locations": [], "entities": {"persons": [], "locations": [{"name": "gulf coast", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "rockies", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "usa compression", "sentiment": "negative"}, {"name": "usa compression partners to acquire compression business", "sentiment": "negative"}, {"name": "energy transfer partners acquisition", "sentiment": "negative"}, {"name": "etp", "sentiment": "none"}, {"name": "energy transfer partners", "sentiment": "none"}, {"name": "usa compression austin", "sentiment": "none"}, {"name": "usa compression partners", "sentiment": "none"}, {"name": "usac", "sentiment": "none"}, {"name": "cdm resource management llc", "sentiment": "none"}, {"name": "cdm environmental & technical services llc", "sentiment": "none"}, {"name": "permian basin essentially", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "eagle ford shale", "sentiment": "none"}, {"name": "energy transfer equity", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acquisition by USA Compression of 1.6 million horsepower expands USA Compression’s geographic reach into active basins, including Eagle Ford Shale, Gulf Coast, Rockies and Permian Basin Essentially doubles USA Compression’s fleet to 3.4 million horsepower; enhancing USA Compression’s focus on large horsepower installations Transaction structure strengthens USA Compression’s balance sheet and distribution coverage levels Enables ETP to reduce leverage with $1.225 billion in cash consideration, strengthening ETP’s balance sheet Energy Transfer Equity to acquire the general partner interest in USA Compression\nAUSTIN, Texas & DALLAS--(BUSINESS WIRE)-- USA Compression Partners, LP (NYSE: USAC) (“USA Compression” or “USAC”), Energy Transfer Partners, L.P. (NYSE: ETP) (“ETP”) and Energy Transfer Equity, L.P. (NYSE: ETE) (“ETE”) today announced a transaction valued at approximately $1.8 billion, providing for (i) the contribution of ETP’s subsidiaries, CDM Resource Management LLC and CDM Environmental & Technical Services LLC (collectively, “CDM”), to USAC (the “Contribution”) and (ii) the cancellation of the incentive distribution rights (“IDRs”) in USAC and conversion of the general partner interest in USAC into a non-economic general partner interest (the “IDR/GP Restructuring”). As part of the transaction, ETE will acquire the ownership interests in the general partner of USAC (the “GP Acquisition”) and approximately 12.5 million USAC common units from USA Compression Holdings.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180116005771/en/\nTransaction Impact\nThe transaction is expected to be accretive to USAC’s distributable cash flow in 2018. In addition, as discussed in more detail below, ETP’s receipt of a special class of common equity that will not pay distributions for the first year will provide for increased USAC LP coverage, which is expected to be in excess of 1.0x in 2018 and increase over time. In addition, USAC’s leverage is expected to decrease to mid-4x by the end of 2018.\nThe transaction is also expected to strengthen ETP’s balance sheet by allowing ETP to use the approximately $1.225 billion in cash proceeds that it will receive in connection with the transactions to reduce leverage.\nCDM currently owns and operates approximately 1.6 million horsepower of natural gas compression and is focused primarily on large horsepower applications. The acquisition of CDM is expected to provide significant benefits for USAC unitholders as the combined business will have increased geographic coverage and will be one of the leading domestic compression providers. The acquisition will further expand USAC’s geographic presence into regions where USAC is currently underrepresented and will result in USAC having broad coverage across U.S. regions. As part of its overall service offerings, CDM also provides a full range of gas treating and emissions testing services. CDM’s treating activities will also complement USAC’s growing station services offerings, in which USAC provides turnkey gas handling solutions for customers. With over 70% of horsepower greater than 1,000 horsepower and an average unit size of approximately 700 horsepower, the CDM fleet has an average age of approximately 7 years and a current operating utilization rate of 87%. On a pro forma combined basis, USAC will own and operate a compression fleet of approximately 3.4 million HP.\nFor 2018, CDM’s EBITDA is estimated to be in the range of $160 - $170 million, not including the benefit of synergies, which are expected to be at least $20 million on a run-rate basis. Consistent with past practice, USAC expects to provide full-year 2018 guidance at the time of its fourth-quarter earnings call.\nManagement Commentary\nEric Long, President & CEO of USAC, commented, “This is an exciting day for USA Compression to be able to announce this strategic transaction with Energy Transfer. USAC’s acquisition of CDM is a logical combination of two leading compression service providers – each with nearly two decades of delivering exemplary levels of customer service. Operating in different areas of geographic focus with nominal overlap, CDM brings to USAC a complementary and standardized fleet of large horsepower, infrastructure-oriented equipment, a customer-focused operating philosophy and a strong employee base consistent with those of USAC’s. CDM has been very successful building its compression and treating business; we are excited about the possibilities that the combined partnership will continue to grow and deliver on the exceptional customer service on which our customers depend.\n\"In addition to bringing on the compression and treating assets, we look forward to welcoming talented and skilled CDM employees, who have built the company into a strong market participant, into the USAC organization. This transaction gives USAC the geographic reach to compete in all the active producing regions.”\nTransaction Details\nThe terms of the Contribution are governed by a contribution agreement, pursuant to which ETP will contribute the CDM business to USAC in exchange for (i) $1.225 billion in cash, (ii) approximately 19.2 million USAC common units and (iii) approximately 6.4 million USAC Class B units. The Class B units will not pay quarterly cash distributions for the first four quarters following closing and will convert into USAC common units on a one-for-one basis after such time.\nThe terms of the GP Acquisition are governed by a purchase agreement, pursuant to which ETE will acquire (i) all of the equity interests in USAC’s general partner, USA Compression Partners GP, LLC (“USAC GP”) and (ii) approximately 12.5 million USAC common units from USA Compression Holdings in exchange for $250 million in cash. Following the closing, USA Compression Holdings will continue to own approximately 12.5 million USAC common units.\nThe terms of the IDR/GP Restructuring are governed by an equity restructuring agreement, pursuant to which ETE will cause USAC GP to cancel the IDRs and convert USAC GP’s general partner interest in USAC into a non-economic general partner interest (the “General Partner Interest”) . In exchange for the IDR cancellation and the conversion of the General Partner Interest, USAC will issue 8.0 million USAC common units to USAC GP.\nUSAC has obtained, subject to customary closing conditions, committed financing for the $1.225 billion cash consideration payable to ETP through a $500 million perpetual preferred units offering to investment funds managed or sub-advised by EIG Global Energy Partners (“EIG”) and other investment vehicles unaffiliated with EIG, as well as $725 million in committed debt financing from JPMorgan and Barclays. The preferred units will pay a 9.75% dividend and are redeemable after 10 years.\nThe Contribution, the GP Acquisition and the IDR/GP Restructuring are expected to close during the first half of 2018, subject to customary closing conditions, including approval pursuant to the Hart-Scott-Rodino Antitrust Improvements Act of 1976.\nAdvisors", "external_links": ["http://www.businesswire.com/news/home/20180116005771/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.usacpartners.com&esheet=51743515&newsitemid=20180116005771&lan=en-US&anchor=http%3A%2F%2Finvestors.usacpartners.com&index=1&md5=6ed41be8eb7f80710be5f882c59b5337", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.usacompression.com&esheet=51743515&newsitemid=20180116005771&lan=en-US&anchor=www.usacompression.com&index=6&md5=e2e23265b6acf98d8c0a7587149bf45a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.usacpartners.com&esheet=51743515&newsitemid=20180116005771&lan=en-US&anchor=www.usacpartners.com&index=2&md5=e8cdbad67e3778a6bf1b75dd87a824c9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.energytransfer.com&esheet=51743515&newsitemid=20180116005771&lan=en-US&anchor=www.energytransfer.com&index=5&md5=e77427849c7b1093daf5587413ee396b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.energytransfer.com&esheet=51743515&newsitemid=20180116005771&lan=en-US&anchor=www.energytransfer.com&index=3&md5=baa2ecdf52e464491e4a2c425f988eb4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.energytransfer.com&esheet=51743515&newsitemid=20180116005771&lan=en-US&anchor=www.energytransfer.com&index=4&md5=50acd85c9a5cb31090cc556067160756"], "published": "2018-01-16T14:55:00.000+02:00", "crawled": "2018-01-16T17:09:26.000+02:00", "highlightTitle": ""}