{"organizations": [], "uuid": "32e9611d2ea7df180543d6a08ac38a22738643d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-amarin-provides-preliminary-2017-results-and-provides-2018-outlook.html", "country": "US", "domain_rank": 767, "title": "Amarin Provides Preliminary 2017 Results and Provides 2018 Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.985, "site_type": "news", "published": "2018-01-05T00:30:00.000+02:00", "replies_count": 0, "uuid": "32e9611d2ea7df180543d6a08ac38a22738643d3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-amarin-provides-preliminary-2017-results-and-provides-2018-outlook.html", "ord_in_thread": 0, "title": "Amarin Provides Preliminary 2017 Results and Provides 2018 Outlook", "locations": [], "entities": {"persons": [{"name": "amarin", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "bedminster", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "amarin corporation", "sentiment": "none"}, {"name": "j.p. morgan healthcare conference", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Unaudited Full-Year 2017 Net Product Revenue Estimated Between\n$177 and $180 Million, Exceeding Upper End of Previously Provided Guidance,\nwith Fourth Quarter Estimate Between $51 and $54 Million\nAnticipate 2018 Net Product Revenue Growth of Approximately\n$50 Million or $230 Million for Full-Year 2018 Net Product Revenue with Guidance\nto Be Updated After REDUCE-IT Results, Expected Before End of Q3 2018\nBEDMINSTER, N.J. and DUBLIN, Ireland, Jan. 04, 2018 (GLOBE NEWSWIRE) -- Amarin Corporation plc (NASDAQ:AMRN), today provided a business update, including an update on 2017 revenue guidance, 2018 revenue forecast and potential 2018 milestones. Amarin plans to discuss these results and expectations with investors in connection with the 36 th Annual J.P. Morgan Healthcare Conference in San Francisco, California, at which Amarin will be presenting.\nPreliminary (unaudited) 2017 Financial Results\nRecord Revenue Levels: Net product revenue for 2017 are estimated to have reached between $177 million and $180 million, including estimated net revenues of $51 million to $54 million in Q4 2017. Both the full year and Q4 2017 results represent record revenue levels for Amarin. These results, which are subject to audit, are estimated to have exceeded the upper end of the company’s previously reported guidance for 2017 net product revenue and represent an increase of approximately $48 million to $51 million (approximately 37% to 40%) over full year 2016 results. Both full year and Q4 2017 net revenue growth were driven by increased prescriptions for Vascepa® (icosapent ethyl) capsules. Wholesaler inventory levels of Vascepa were within normal industry ranges at the end of 2017.\nBalance Sheet: Amarin ended 2017 with approximately $73.6 million in cash, approximately $44 million in net accounts receivable and approximately $29 million in inventory. During 2017, the company’s net cash outflows, excluding the $13.7 million net proceeds of exchangeable debt transactions disclosed in Q1 2017, were approximately $38.4 million, comprised of net cash outflow in Q1, Q2, Q3 and Q4 of approximately $15.9, $10.6, $6.4 and $5.5 million, respectively. The company believes that it was effective in 2017 in controlling its cash expenditures to achieve greater contribution from the growing revenues of its commercial operations. The company achieved its stated objective of being net cash flow positive in 2017 after excluding, on a non-GAAP basis, the net proceeds of the Q1 2017 exchangeable debt transactions and excluding greater than $40 million of payments for R&D (primarily REDUCE-IT related) and approximately $17 million of payments for financing-type costs (e.g., interest and royalties).\nThe company’s accounts receivable were all current as of year-end and the company has not factored or otherwise borrowed against accounts receivable, inventory or other assets. Due in part to recent U.S. tax reform, Amarin anticipates further increasing its valuation allowance against deferred tax assets in Q4 2017, which will result in a non-cash charge for income taxes of as much as $11.1 million. The deferred tax assets relate to the company’s U.S. subsidiary. The valuation allowance does not change the amount the company pays in income taxes and does not have any impact on the company’s tax loss carryforwards, primarily in Ireland, which are estimated at over $570 million at the end of 2017. At the end of 2017, the company’s debt consisted of $30 million face value of exchangeable debt, which cannot be put to the company before 2022, and the continuing 10% royalty-like obligation on Vascepa net revenue.\nGross Margin: In addition to the company’s increased revenues and improved cash flow, in 2017 Amarin also increased its gross margin on product sales to approximately 75% while taking steps to ensure that it has capacity to support a broad-range of potential revenue scenarios following REDUCE-IT results, including capacity to provide supply to support the potential of over $1 billion in product revenues in 2019. These steps to expand supply capacity are intended to provide the company with flexibility to support business growth. At this time, the company is not providing guidance regarding projected Vascepa net revenue levels after REDUCE-IT results and does not plan to provide such guidance until after the results of this important study are known.\nMore than 150,000 patients currently benefit from Vascepa prescriptions.\n2018 Financial and Operational Guidance\nAmarin's core strategy entering 2018 remains unchanged. Its primary objectives are as follows:\n1) Continue to aggressively grow revenues;\n2) Complete the REDUCE-IT study on a timely basis while maximizing the likelihood of success; and\n3) Operate in a cost-effective, opportunistic manner.\nThe company’s outlook for 2018 is divided between the timeframes before and after anticipated results of the REDUCE-IT cardiovascular outcomes study. REDUCE-IT, which has been the centerpiece of the company’s strategy, is expected to be completed in 2018 with top-line results reported before the end of Q3 2018. The degree of cardiovascular relative risk reduction achieved in this study will impact future levels of Vascepa promotion and revenues. Assuming that statistically significant relative risk reduction of at least 15% is achieved and, as expected, there is no major negative safety issue, the company intends to expand its U.S.-based sales force promptly after the outcomes study results. As previously disclosed, Amarin is planning to grow from its current level of approximately 150 sales representatives calling on targeted physicians in limited geographies, to more than 400 sales representatives with considerably broader reach and increased frequency of sales calls. Amarin plans to support this sales force growth with increased promotional outreach to consumers and other expanded promotion of Vascepa.\nThe financial guidance described below reflects expectations prior to the impact of REDUCE-IT results. The company intends to update guidance after such outcomes study results are known. The company begins 2018 expecting to achieve the following results:\nU.S. Product Revenue : Without adjustment for the impact of REDUCE-IT results, the company estimates full year 2018 net product revenue from Vascepa will grow approximately $50 million to approximately $230 million. Amarin estimates in each quarter of 2018 net product revenue should grow approximately 30% or more as compared to the same quarter in 2017. This guidance for 2018 will be updated after REDUCE-IT results. The company anticipates quarterly variability to continue with respect to net product revenue. For example, seasonal factors associated with large beginning of the year insurance deductibles for patients under certain of their medical insurance plans has historically slowed prescription rates in the first quarter of each year. Amarin estimates that its net product revenue in Q1 2018 will be between $45 and $48 million, representing significant growth ov", "external_links": ["http://www.amarincorp.com/", "https://www.globenewswire.com/Tracker?data=A2a5N8C0IwBiwP2lFU60onHByYKLRXiUmv2V-LP9A3pb1-_1uFji7MWOvVHzWZ1aDK2uSdy2LdUWmhbcmsLIYkqNLNOsJvHl7VWKbw7olOI=", "https://www.globenewswire.com/Tracker?data=f24HteaA3fDLZKbfob78_zhSPePxnXRiu-DmlgEQIraH1Y8RGELnfcyTKBdpTBncnR5OF542P7QpcVBWNqhvAaT0Z3qhYzmacJHLL-4HDqM=", "http://investor.amarincorp.com/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/4e9ba297-8a1c-40bf-a8e8-4e7147b9d5de", "https://www.globenewswire.com/Tracker?data=XgvcBkjZP5waMjTGMr1I7ORIUu2QNjwoYR1ZJaEHWEzNSOpWkSYplNnQylbL--cL4Y9xwm1cg5hEycZ8zzNAAoJnDdm9t_n936V6k7rbLr-jMe2qnFkPZ8ScliCehsj6", "https://www.globenewswire.com/Tracker?data=A2a5N8C0IwBiwP2lFU60oktlOwc_GatNvwXBaDEy5ko_b4Jt2Nf5PhStDiyR8vwxQMDz_ZVHS7iY_H_Wle7Dkw6OWnrU0bDza1hxDQZv7a8ED0mrlOC5HyCcqUt6DNcc", "https://www.globenewswire.com/Tracker?data=bgZ1RGAHa1qWg0idorMtQYkAd4_AxDErrdW2R_Xd56Adt_n_sgm9pMJTPbFhmiHpVU68b_zGIF3CggSa-YcrIYouoX1rAnzqZPzGu7F8xmQQ-UgiS2uC-LjVK38X14qU", "https://www.globenewswire.com/Tracker?data=m-lKzAQs9eaRwkf9z6PRXeHc3dvmGn6i8p5Ar-rPKnHlvZoaT8R6KbiUUcJrvbxmV4yDvgaCtS2AGgi-STxpUSI3itEdpJk26C_b9z5Ng0U=", "https://www.globenewswire.com/Tracker?data=2Zn7CkYLQ5b1dzxsJW_3MoZDTHHMocVuPd56GkNuaUkIgBxigx7cyNph_rghVrvS97j9ot5Bugu8k3tLBd9fVW7-kqMqsKXHKTXMj5udRA4="], "published": "2018-01-05T00:30:00.000+02:00", "crawled": "2018-01-05T01:21:46.013+02:00", "highlightTitle": ""}