{"organizations": [], "uuid": "11e4aaf2ba296cfbc608dd3e1507afb87af2fe07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222571377&w=1200&r=LYNXMPEE0G00A", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-britain-eu-lawmaking/back-brexit-law-or-risk-chaos-mays-conservatives-tell-lawmakers-idUKKBN1F600N", "country": "US", "domain_rank": 408, "title": "Back Brexit law or risk chaos, May's Conservatives tell lawmakers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T02:11:00.000+02:00", "replies_count": 0, "uuid": "11e4aaf2ba296cfbc608dd3e1507afb87af2fe07"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-lawmaking/back-brexit-law-or-risk-chaos-mays-conservatives-tell-lawmakers-idUKKBN1F600N", "ord_in_thread": 0, "title": "Back Brexit law or risk chaos, May's Conservatives tell lawmakers", "locations": [], "entities": {"persons": [{"name": "william james", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "sutton", "sentiment": "none"}, {"name": "paul scully", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south west london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "cheam member of parliament", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:11 AM / Updated 23 minutes ago British lawmakers back Brexit legislation, stiffer tests yet to come William James 4 Min Read \nLONDON (Reuters) - British lawmakers voted in favour of the government’s legislative blueprint for Brexit on Wednesday, marking a victory for Prime Minister Theresa May over political opponents who want a softer approach to leaving the European Union. \nBut the legislation will now face scrutiny from parliament’s largely pro-EU upper house, where May’s party does not have a majority, which will intensify efforts to force a re-run of a 2016 referendum, and water down or even stop the divorce. \nThe European Union (Withdrawal) Bill was approved by a 324 to 295 vote in the lower house - a milestone on the long road towards cementing the legal foundations of Britain’s departure from the bloc. \nThe bill repeals the 1972 law that made Britain a member of the EU, and transfers EU laws into British ones. \n“This bill is essential for preparing the country for the historic milestone of withdrawing from the European Union,” Brexit minister David Davis told parliament before the vote. \n“It ensures that on day one we will have a statute book that works, delivering the smooth and orderly exit desired by people and businesses across the United Kingdom and being delivered by this government.” \nThe bill has become the focal point for months of divisive debate about what type of EU divorce Britain should seek, severely testing May’s ability to deliver on her exit strategy without a parliamentary majority. \nBut despite one embarrassing parliamentary defeat, several government concessions and rebellion from within her own party, May’s Conservative lawmakers overcame opposition from the Labour Party and others. \nLabour leader Jeremy Corbyn instructed his lawmakers to vote against passage of the bill because the government had not met conditions set out by the party, demanding safeguards on a range of issues including workers and consumer rights. \n“This bill has never been fit for purpose,” said Labour’s Brexit policy chief, Keir Starmer, describing any attempt to persuade the government that the legislation needed to change as “talking to a brick wall”. LORDS SCRUTINY \nThe upper house, the House of Lords, will now begin months of scrutiny of the bill before it can become law. Any changes made by the lords will require approval from the lower house, and the whole process could take until May to complete. \nThe House of Lords contains a diverse, largely unelected, mix of political appointees, experts, and members who inherited their positions. Many lords are opposed to Brexit. \nSome of those figures are expected to try to soften the Brexit approach to include remaining in the EU’s single market or a second public vote, but the most likely areas for changes involve technical and constitutional issues. \nMay has ruled out a second vote and says Britain will be leaving. Labour’s Corbyn is also committed to following through with Brexit, albeit pushing for different priorities and aims. \nNevertheless, calls for a second referendum are expected to persist, particularly as both pro- and anti-EU politicians have mooted the possibility recently. \nEU officials and some member states have said they would welcome a change of heart from Britain. \nBut, barring a major change of policy from one of the country’s two largest political parties, Britain remains on course to leave the bloc in March 2019. Reporting by William James; Editing by Richard Balmforth", "external_links": [], "published": "2018-01-17T02:11:00.000+02:00", "crawled": "2018-01-17T02:39:55.006+02:00", "highlightTitle": ""}