{"organizations": [], "uuid": "8f1b00b44eb3a2652e01a9ef0c348904370403dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 14}, "facebook": {"likes": 23, "shares": 23, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/kilopower_1.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/nasa-space-travel-kilopower-reactor/", "country": "US", "domain_rank": 1196, "title": "NASA Testing Mini Nuclear Reactors to Sustain Life on Moon, Mars | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.947, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "8f1b00b44eb3a2652e01a9ef0c348904370403dc"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/19/nasa-space-travel-kilopower-reactor/", "ord_in_thread": 0, "title": "NASA Testing Mini Nuclear Reactors to Sustain Life on Moon, Mars | Fortune", "locations": [], "entities": {"persons": [{"name": "kirsten korosec", "sentiment": "none"}], "locations": [{"name": "mars", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}], "organizations": [{"name": "nasa", "sentiment": "negative"}, {"name": "glenn research center", "sentiment": "none"}, {"name": "u.s. department of ener", "sentiment": "none"}, {"name": "marshall space flight center", "sentiment": "none"}, {"name": "nevada national security site", "sentiment": "none"}, {"name": "los alamos national laboratory", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NASA How NASA Might Sustain Life on Mars and the Moon Using Mini Nuclear Reactors NASA is working on a nuclear reactor project that would help provide power for space explorers on the moon or Mars. Courtesy of NASA By Kirsten Korosec January 19, 2018 \nGetting to Mars is one challenge, but figuring out how to live there, even for a little while, is another massive hurdle. \nBut NASA is on the case. The organization is experimenting with a new power source—called the Kilopower reactor —that it says could provide safe, efficient, and plentiful energy needed for future robotic and human space exploration missions. Think of it as a tiny nuclear reactor available in two sizes: one kilowatt or 10 kilowatts. \nThis week, NASA provided an update on the project, which kicked off in 2015 as part of the Game Changing Development program. It’s led by the agency’s Glenn Research Center, in partnership with NASA’s Marshall Space Flight Center in Alabama, the Los Alamos National Laboratory, the Nevada National Security Site, and the Y-12 National Security Complex. \nNASA and the U.S. Department of Energy (DOE) said initial tests on the prototype system, which began in November at the DOE’s Nevada National Security Site, have been successful. \nKilopower, according to NASA, is a space fission power system that could provide up to 10 kilowatts of electrical power continuously for at least 10 years. That’s about enough power to enough to run two average households. \nThat might not seem like a lot of power here on Earth, but it’s actually a huge amount for NASA. For instance, the agency’s New Horizons mission , which uses nuclear batteries, has a maximum power of 240 watts. The smallest Kilopower reactor would need almost five times as much power. \nThe nuclear batteries that are found in New Horizons harnesses heat from the natural radioactive decay of plutonium-238 oxide. Kilopower reactors are designed to split uranium atoms to release heat energy and then convert it into electricity. Uranium is vastly more abundant than plutonium-238. And about one pound of uranium fuel can produce as much energy as about three million pounds of burnable coal, according to NASA. In other words, a little goes a long way. \n“We want a power source that can handle extreme environments,” Lee Mason, NASA’s principal technologist for power and energy storage said in a statement. “Kilopower opens up the full surface of Mars, including the northern latitudes where water may reside. On the moon, Kilopower could be deployed to help search for resources in permanently shadowed craters.” \nThis is not like the traditional nuclear reactors here on Earth. The fission reactor doesn’t present the same risks—like a meltdown and massive radiation—that a traditional reactor might. \nAccording to Marc Gibson of the NASA Glenn Research Center, the experiments should conclude with a full-power test lasting about 28 hours in late March. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T22:02:41.010+02:00", "highlightTitle": ""}