{"organizations": [], "uuid": "c06f9a62a7dbf89fe6545358c032b7a4cd96fe74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224243683&w=1200&r=LYNXMPEE0L1WJ", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-canada-marijuana-brokers/canadas-small-financial-firms-get-buzz-from-weed-stocks-idUSKBN1FB2PA", "country": "US", "domain_rank": 408, "title": "Canada's small financial firms get buzz from weed stocks", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.205, "site_type": "news", "published": "2018-01-23T03:22:00.000+02:00", "replies_count": 0, "uuid": "c06f9a62a7dbf89fe6545358c032b7a4cd96fe74"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-canada-marijuana-brokers/canadas-small-financial-firms-get-buzz-from-weed-stocks-idUSKBN1FB2PA", "ord_in_thread": 0, "title": "Canada's small financial firms get buzz from weed stocks", "locations": [], "entities": {"persons": [], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bmo capital markets", "sentiment": "none"}, {"name": "canaccord genuity group inc", "sentiment": "none"}, {"name": "canopy growth corp", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO (Reuters) - Investors are betting Canada’s smaller financial firms could see a jump in revenues after they helped fund marijuana companies ahead of the country’s planned legalization of the drug this year.\nEquity offerings by Canadian weed companies tripled to a record high of nearly $1 billion in 2017, with nearly two-thirds of that in the final quarter, data from Thomson Reuters showed.\nMuch of the issuance for pot producers has been led by small independent brokers, such as Canaccord Genuity Group Inc ( CF.TO ).\nIn addition to being paid underwriting fees, the brokers can sometimes receive warrants, which could have become significantly more valuable after a surge in the marijuana companies’ stock, market players said.\nBMO Capital Markets’ move last week to help Canopy Growth Corp ( WEED.TO ), Canada’s biggest cannabis producer, raise C$200.7 million ($161.3 million) was a sign that established brokers were likely to take some market share away from the smaller brokers.\nBut smaller players have an early lead in funding research and banking relationships with marijuana companies after bigger, bank-owned rivals saw the industry as too risky or bad for their reputations, market players said.\n“The smaller independent brokers are fairly opportunistic and good at jumping on trends, so crazed market activity in anything to do with cryptocurrency and marijuana plays right into that ability,” said Matt Skipp, president of SW8 Asset Management.\nPOT KICK Canada’s plans to legalize pot for recreational use in mid 2018 would make it the first Group of Seven country to allow the drug nationwide and the second in the world after Uruguay.\nShares of Canaccord and another small cap broker GMP Capital Inc ( GMP.TO ) have surged as much as 67 percent and 110 percent respectively since November, when marijuana stocks started to take off. GMP has also helped raise money for miners of digital currencies, which have also soared in recent months.\nIn addition to increased underwriting in the most recent quarter, small brokers could also have benefited from the investor trading of pot stocks in the secondary market as well as the potential increase in value of any warrants they hold.\nCompensating the underwriters with warrants can help lower the cost of financing for some pot companies who are growing and short of cash, said Skipp.\nAn underwriting agreement for Aurora Cannabis Inc ( ACB.TO ) from October shows that Canaccord, the lead underwriter, and other participating brokers were granted options that would give them the right for a period of three years to purchase the shares of the company at the transaction’s offering price, which was C$3. Shares of Aurora were trading at around C$14 on Monday.\n“To the extent that you want to buy a business that is pretty transparent, with proper cash flows and a business that you understand and like, some of these independent brokers could be a play on the kind of activity that has been going on,” said Diana Avigdor, head of trading at Barometer Capital Management.\nIt remains unclear how many of Canada’s biggest banks will eventually participate in the market. Those that do could target the more established producers, rather than the many smaller, potentially riskier ones.\nThe 2018 financing pipeline has already got off to a brisk start, including the equity offering from Canopy Growth and a C$200 million issue of convertible debentures by Aurora Cannabis, that was led by Canaccord.\n“Obviously there is a healthy market here for companies that raise money,” said Vahan Ajamian, an equity research analyst covering the cannabis sector at Beacon Securities Ltd. “I don’t see that shrinking any time soon.”\nReporting by Fergal Smith; Editing by Denny Thomas and Andrew Hay\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T03:22:00.000+02:00", "crawled": "2018-01-23T17:54:05.065+02:00", "highlightTitle": ""}