{"organizations": [], "uuid": "9ee11b65c321ad5a2178a3e59c192c8ec1c6885a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-eurozone-economy/euro-zone-growth-at-10-year-high-in-2017-january-sentiment-dips-idUSKBN1FJ1A6", "country": "US", "domain_rank": 408, "title": "Euro zone growth at 10-year high in 2017, January sentiment dips", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:19:00.000+02:00", "replies_count": 0, "uuid": "9ee11b65c321ad5a2178a3e59c192c8ec1c6885a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-eurozone-economy/euro-zone-growth-at-10-year-high-in-2017-january-sentiment-dips-idUSKBN1FJ1A6", "ord_in_thread": 0, "title": "Euro zone growth at 10-year high in 2017, January sentiment dips", "locations": [], "entities": {"persons": [{"name": "bert colijn", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ing", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eurostat", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - The euro zone economy expanded at its fastest rate in a decade in 2017, preliminary data showed on Tuesday, and sentiment remained high at the start of 2018 despite a slight dip from a 17-year peak, signaling a strong start to the year.\nThe European Union’s statistics office Eurostat estimated gross domestic product in the 19 countries sharing the euro rose 0.6 percent quarter-on-quarter in the last three months of 2017, as expected by economists polled by Reuters, for a 2.7 percent year-on-year gain.\nOverall in 2017, euro zone GDP rose 2.5 percent, Eurostat said, the fastest growth rate since a 3.0 percent rise in 2007.\n“It seems that the euro zone economy continues to fire on all cylinders. Investment has yet to fully recover from the crisis but has been an essential contributor to growth during the year,” said Bert Colijn, economist at ING bank.\n“However, the big question for 2018 is whether the stronger euro will offset the effects of improving external demand. The high growth in Q4 means that the carry-over effect for 2018 is very favorable. We expect euro zone GDP growth to come in at 2.4 percent again this year.”\nEurostat also revised upwards growth data for the third quarter to 0.7 percent quarter-on-quarter from the previously reported 0.6 percent, and to 2.8 percent year-on-year from 2.6 percent.\nSeparately, European Commission data showed economic sentiment in the euro zone eased slightly in January to 114.7 from a 17-year high of 115.1 reached in December.\nThis was a result of a slight decline in sentiment in the retail trade sector, where the mood declined to 5.0 from 6.0 in December and in services, where it declined to 16.7 from 18.0.\nBut optimism in industry remained steady at the December new high of 8.8 and consumers were more upbeat at 1.3 points in January against 0.5 in December, signaling the positive trends from late 2017 were continuing.\n“This confirms our view of a strong start to the year although downside risks to the outlook deserve mention,” Colijn said.\n“Political risk like the German coalition talks and Italian elections could have a significant impact on the economic outlook, and at the same time, optimism about growth could tighten financial conditions further,” he said.\n“Still, with businesses indicating that new orders continue to increase, it seems to be a safe bet that the euro zone economy will continue to perform well in the months ahead.”\nReporting by Jan Strupczewski and Philip Blenkinsop; editing by Mark Heinrich\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T18:19:00.000+02:00", "crawled": "2018-01-30T16:31:36.007+02:00", "highlightTitle": ""}