{"organizations": [], "uuid": "3cb6cb32853b218128b9d00c7ff3d655591105ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221167888&w=1200&r=LYNXMPEE0A1AB", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-chevron-m-a-sinopec-corp-safrica/sinopec-says-south-africa-gives-it-conditional-approval-for-chevron-assets-idUSKBN1F022O", "country": "US", "domain_rank": 408, "title": "Sinopec says South Africa gives it conditional approval for Chevron assets", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:23:00.000+02:00", "replies_count": 0, "uuid": "3cb6cb32853b218128b9d00c7ff3d655591105ae"}, "author": "", "url": "https://www.reuters.com/article/us-chevron-m-a-sinopec-corp-safrica/sinopec-says-south-africa-gives-it-conditional-approval-for-chevron-assets-idUSKBN1F022O", "ord_in_thread": 0, "title": "Sinopec says South Africa gives it conditional approval for Chevron assets", "locations": [], "entities": {"persons": [{"name": "chen aizhu", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "hk", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "botswana", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "sinopec", "sentiment": "negative"}, {"name": "chevron", "sentiment": "negative"}, {"name": "edd", "sentiment": "none"}, {"name": "economic development department", "sentiment": "none"}, {"name": "glencore", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "competition commission", "sentiment": "none"}, {"name": "sinopec corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 3:32 PM / in 20 minutes Sinopec moves closer to winning Chevron's South Africa assets Chen Aizhu , Julia Payne 3 Min Read \nBEIJING/LONDON (Reuters) - China’s Sinopec Corp inched closer on Thursday to victory over Glencore in their battle for Chevron’s South Africa and Botswana assets, saying the South African government favoured its bid. \nSouth Africa’s Competition Commission recommended the roughly $900 million transaction with Sinopec be approved with certain conditions, Asia’s largest refiner said in a statement. \nSouth Africa’s government later announced that it had reached an agreement with Sinopec on public interest issues and that the transaction was pending final approval. \nHowever, Sinopec could still lose out. \n“Implementation of the transaction is conditional on approval by the competition authorities of South Africa, and will be concluded unless the minority shareholders in Chevron South Africa successfully implement their right of first refusal,” Sinopec’s statement said. \nIn October, the minority shareholders in Chevron’s South African subsidiary exercised pre-emption rights following delays to the Sinopec deal and brought in Glencore, which placed a $937 million bid. \nAt stake is a 75 percent share in Chevron’s South African subsidiary that runs a 100,000-barrels-per-day oil refinery in Cape Town, a lubricants plant in Durban and 820 petrol stations and other oil storage facilities. \nThe sale also includes 220 convenience stores across South Africa and Botswana. \nA Glencore spokesman said there was “no change to the position of Glencore or Off The Shelf Investments Fifty Six (OTS, the minority shareholders) relating to the proposed acquisition... Good progress is being made in satisfying OTS’ conditions to complete the transaction.” \nA final decision from South Africa’s Competition Tribunal is expected in March or April, a Beijing-based source with direct knowledge of the matter said. \n“Sinopec was thrown into confusion after local shareholders exercised pre-emptive rights ... but then the company was advised by the government to proceed with regulatory procedures,” the source said. \nSinopec has given additional commitments to the government, including investments over five years post-acquisition to upgrade the Cape Town refinery into a world-class plant. \nThe Chinese firm also pledged to develop the fuel marketing business by introducing small and black-owned businesses as fuel retailers. \nSinopec said it would establish a development fund targeted at small and black-owned businesses, thus increasing local procurement of goods and services. \nGlencore’s bid was aimed at securing the trader its first refining asset since it ventured into downstream investments. \nThe remaining 25 percent stake will stay with a consortium of black economic empowerment shareholders and an employee trust. \nWinning the deal would mark a second major refinery investment for Sinopec as the state oil major looks to expand overseas amid a saturated domestic market. Sinopec owns a stake in the Yanbu refinery in Saudi Arabia controlled by Saudi Aramco. Reporting by Chen Aizhu and Julia Payne; Additional reporting by Justin George Varghese in Bengaluru; Editing by Dale Hudson and Richard Pullin", "external_links": [], "published": "2018-01-11T17:23:00.000+02:00", "crawled": "2018-01-11T17:45:27.000+02:00", "highlightTitle": ""}