{"organizations": [], "uuid": "72f0740b3a69482c6a56fa8f4626bfa94c29237f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-463023679.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/intel-corp-patching-faulty-chips/", "country": "US", "domain_rank": 1196, "title": "Intel Corp Tells Customers to Halt Patching With Faulty Chips | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-23T23:35:00.000+02:00", "replies_count": 0, "uuid": "72f0740b3a69482c6a56fa8f4626bfa94c29237f"}, "author": "Reuters", "url": "http://fortune.com/2018/01/22/intel-corp-patching-faulty-chips/", "ord_in_thread": 0, "title": "Intel Corp Tells Customers to Halt Patching With Faulty Chips | Fortune", "locations": [], "entities": {"persons": [{"name": "shenoy", "sentiment": "none"}, {"name": "navin shenoy", "sentiment": "none"}, {"name": "justin sullivan", "sentiment": "none"}], "locations": [{"name": "santa clara", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "intel corp tells customers", "sentiment": "negative"}, {"name": "fortune security intel", "sentiment": "negative"}, {"name": "intel", "sentiment": "negative"}, {"name": "intel corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Security Intel Says the Patch Designed to Fix Flawed Chips Is Faulty The Intel logo is displayed outside of the Intel headquarters in Santa Clara, California on January 16, 2014. Justin Sullivan—Getty Images By Reuters 9:35 PM EST \nIntel Corp (intc) said on Monday that patches it released to address two high-profile security vulnerabilities in its chips are faulty, advising customers, computer makers and cloud providers to stop installing them. \nIntel Executive Vice President Navin Shenoy disclosed the problem in a statement on the chipmaker’s website, saying that patches released after months of development caused computers to reboot more often than normal and other “unpredictable” behavior. \n“I apologize for any disruption this change in guidance may cause,” Shenoy said. “I assure you we are working around the clock to ensure we are addressing these issues.” \nThe issue of the faulty patches is separate from complaints by customers for weeks that the patches slow computer performance. Intel has said a typical home and business PC user should not see significant slowdowns. \nIntel‘s failure to provide a usable patch could cause businesses to postpone purchasing new computers, said IDC analyst Mario Morales. \nIntel is “still trying to get a handle on what’s really happening. They haven’t resolved the matter,” he said. \nIntel asked technology providers to start testing a new version of the patches, which it began distributing on Saturday. \nFor more on the chip security flaw, watch Fortune’s video: \nThe warning came nearly three weeks after Intel confirmed on Jan. 3 that its chips were impacted by vulnerabilities known as Spectre and Meltdown, which make data on affected computers vulnerable to espionage. \nMeltdown was specific to chips from Intel, as well as one from SoftBank Group’s ARM Holdings. Spectre affected nearly every modern computing device, including ones with chips fromIntel, ARM and Advanced Micro Devices. \nProblems with the patches have been growing since Intel on Jan. 11 said they were causing higher reboot rates in its older chips and then last week that the problem was affecting newer processors. \nThe Wall Street Journal first reported Intel asking customers to halt using the patches. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T23:35:00.000+02:00", "crawled": "2018-01-23T05:15:30.004+02:00", "highlightTitle": ""}