{"organizations": [], "uuid": "e0f1778db4f4f0c17a462605f94f24f876b6ee7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-denmark-politics-tax/danish-government-trims-tax-cut-plan-to-avoid-allys-demand-for-refugee-legislation-idUSKBN1EY1OB", "country": "US", "domain_rank": 408, "title": "Danish government trims tax-cut plan to avoid ally's demand for refugee legislation", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:36:00.000+02:00", "replies_count": 0, "uuid": "e0f1778db4f4f0c17a462605f94f24f876b6ee7b"}, "author": "", "url": "https://www.reuters.com/article/us-denmark-politics-tax/danish-government-trims-tax-cut-plan-to-avoid-allys-demand-for-refugee-legislation-idUSKBN1EY1OB", "ord_in_thread": 0, "title": "Danish government trims tax-cut plan to avoid ally's demand for refugee legislation", "locations": [], "entities": {"persons": [{"name": "teis jensen", "sentiment": "none"}, {"name": "erik matzen", "sentiment": "none"}, {"name": "lars lokke rasmussen", "sentiment": "none"}], "locations": [{"name": "denmark", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "danish people’s party", "sentiment": "none"}, {"name": "min read  copenhagen", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COPENHAGEN (Reuters) - Denmark’s center-right coalition government will scale back its tax-cut plan to get it through parliament rather than link it to legislation on revoking refugees’ residence rights, as sought by its nationalist ally the Danish People’s Party (DF). \nThe move is another reminder of the minority government’s difficulties in pushing through its economic agenda in a parliament dominated by parties, including DF, that support the welfare state and its high taxes. \nIn return for the proposed tax cuts, DF had demanded new legislation that would make it easier to revoke residence permits for refugees from nations such as Syria once peace is restored in their home countries. \nBut Prime Minister Lars Lokke Rasmussen said at a press conference on Tuesday that he saw no reason why the two subjects should be linked. \n“The government would very much like to discuss immigration policy with DF. But it should be on the immigration policy’s own terms ... not to get tax cuts,” he said. \nRasmussen, who heads the Liberal Party, said he would therefore only continue tax negotiations in areas where DF and the government have already agreed to proceed. \nHe said he hoped to be able to “rather quickly” reach a deal on the tax policy for the next four years but not for the years through to 2025 as he had first intended. \n“I bet there will be other opportunities before we get there, so it’s not that the government is giving up on its ambitions,” Rasmussen said. \nHis junior coalition partner Liberal Alliance (LA) had said before Christmas that the coming tax cuts would be “historically big”. \nThe anti-immigration DF is not part of the three-way coalition, but the government depends on it for a majority in parliament. \nDF leader Kristian Thulesen Dahl said Rasmussen’s decision on Tuesday made it possible for the parties to move on despite the rather “locked” political situation in parliament. \nDahl said DF would continue to work for its tighter immigration proposals regarding war refugees. \nReporting by Teis Jensen and Erik Matzen; Editing by Hugh Lawson\n ", "external_links": [], "published": "2018-01-09T16:36:00.000+02:00", "crawled": "2018-01-09T16:45:31.021+02:00", "highlightTitle": ""}