{"organizations": [], "uuid": "68b5bfbbbafdb019e9991bf9bc0a4fb430d998c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220941983&w=1200&r=LYNXMPEE091I2", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-bonds-china-explainer/explainer-could-china-tame-its-appetite-for-u-s-treasuries-idUSKBN1EZ2TN", "country": "US", "domain_rank": 408, "title": "Explainer: Could China tame its appetite for U.S. Treasuries?", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.431, "site_type": "news", "published": "2018-01-11T05:51:00.000+02:00", "replies_count": 0, "uuid": "68b5bfbbbafdb019e9991bf9bc0a4fb430d998c6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-bonds-china-explainer/explainer-could-china-tame-its-appetite-for-u-s-treasuries-idUSKBN1EZ2TN", "ord_in_thread": 0, "title": "Explainer: Could China tame its appetite for U.S. Treasuries?", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "u.s. treasuries", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "treasuries", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}, {"name": "people’s bank of china", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - China is the world’s biggest foreign holder of U.S. Treasuries, which it uses to manage the value of its currency and park its massive foreign exchange reserves. But a Bloomberg report on Wednesday suggested that China may be reviewing its vast holdings, sending Treasury yields to 10-month highs.\nStill, many factors limit China’s room for maneuver when it comes to Treasuries.\nWhy does China own $1.2 trillion of Treasuries in the first place?\nIn part because Treasuries are the only instruments seen as liquid enough to park part of China’s massive foreign exchange reserves, which have surged thanks to years of export surpluses.\nChina also fixes its exchange rate against the dollar, so its buying and selling of dollar assets is largely aimed at managing the value of its currency. Data from the U.S. Treasury shows that, over time, Chinese holdings of Treasuries have been relatively stable.\nCould China really dump, or at least pare, those holdings?\nThe People’s Bank of China would trigger a selloff if market participants believed it has truly soured on Treasuries, which would cause the value of its own reserves to fall. That is not an outcome that would appear to be palatable politically or for economic reasons.\nAnd even if the PBOC, China’s central bank, were to dial back its Treasuries holdings, there appear to be few options to replace them. Ten-year U.S. Treasuries yields are more than 200 basis higher than those on comparable German Bunds. Japanese 10-year government bonds yield about zero.\nStill, some analysts said China could move investments to other dollar denominated debt such as mortgages or deposits, reallocate investments to euro, yen or other currency-based assets or buy debt from emerging countries.\nIs China just sending a signal to the United States?\nChina has been discomfited by U.S. President Donald Trump’s tough talk on trade. Some economists and China followers believe the report, which cited people familiar with the matter, could have been intended as a warning shot to the U.S. administration.\nDespite Trump’s tough rhetoric, little progress has been made on aluminum and steel tariffs. And under Trump the U.S. trade deficit with China has actually risen, thanks to a steadily growing U.S. economy and buoyant jobs growth.\nThe U.S trade deficit with China rose to $344.4 million in January-November last year from $319.3 million in the same period in 2016.\nWhat does this all mean for Treasury yields?\nDeclining participation by China could reduce overall demand for U.S. government debt, and the Treasury Department would need to pay higher yields to sell its bonds.\nThe United States will be raising debt issuance to make up for declining bond purchases by the Federal Reserve and ongoing strains on the U.S. budget.\nThe Fed has started shrinking its $2.5 trillion Treasuries portfolio as it seeks to normalize monetary policy. U.S. interest costs rose to a record $274 billion in fiscal 2017, according to the government’s fiscal 2018 budget, and are projected to increase to $528 billion by 2022. [L1N1O428Z]\nIf China retreats, would other buyers step in?\nIf China reduces it bond purchases, buyers that could step in include other sovereigns, banks, large asset managers and insurance companies.\nTreasuries benefit from their relative safety and liquidity compared with other assets. They are also in demand by banks to meet regulatory requirements relating to liquid asset holdings, and they can be used as collateral to back trades including derivatives positions.\nU.S. Treasuries owned by China and Japan Reporting by David Lawder, additional reporting by Karen Brettell; Writing by David Chance; Editing by Megan Davies and Meredith Mazzilli\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T05:51:00.000+02:00", "crawled": "2018-01-11T00:19:17.006+02:00", "highlightTitle": ""}