{"organizations": [], "uuid": "e6d281c52ed6fab6a6c7d8b39ffda57a9a3bb94c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-capstone-turbine-reports-select-preliminary-q3-fiscal-2018-financial-results.html", "country": "US", "domain_rank": 767, "title": "Capstone Turbine Reports Select Preliminary Q3 Fiscal 2018 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "e6d281c52ed6fab6a6c7d8b39ffda57a9a3bb94c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-capstone-turbine-reports-select-preliminary-q3-fiscal-2018-financial-results.html", "ord_in_thread": 0, "title": "Capstone Turbine Reports Select Preliminary Q3 Fiscal 2018 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "van nuys", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "capstone turbine corporation", "sentiment": "none"}, {"name": "capstone", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Quarterly Revenue Was Approximately 91% of Target Adjusted EBITDA Breakeven Revenue Goal\nYear-over-Year Quarterly Revenue Increases Approximately 12%\nCash Usage Declines 33% Year-over-Year on Improved Operating Efficiencies\nQ3 Fiscal 2018 Financial Results Webcast to be Held February 5, 2018, at 1:45 PM PT, 4:45 PM ET\nVAN NUYS, Calif., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Capstone Turbine Corporation ( www.capstoneturbine.com ) (NASDAQ:CPST), the world’s leading clean technology manufacturer of microturbine energy systems, continues to provide increased transparency by announcing select preliminary financial results for its fiscal third quarter ended December 31, 2017.\nCapstone’s preliminary third quarter results reflect management’s continued execution of the initiatives to diversify and increase revenue, increase service gross margin and further reduce operating expenses to achieve Adjusted EBITDA breakeven as quickly as possible. Capstone’s preliminary third quarter revenue was approximately 91% of its $25 million Adjusted EBITDA breakeven quarterly revenue target compared to 79% in the second quarter of fiscal 2018.\nTotal revenue for the third quarter of fiscal 2018 increased 15% to approximately $22.7 million from $19.8 million in the second quarter of fiscal 2018 and increased 12% from $20.2 million in the same period last year. Total revenue for the nine months of fiscal 2018 increased 14% to approximately $61.8 million from $54.2 million in the same period last year, indicating a meaningful rebound in revenue.\nCash usage during the first nine months of fiscal 2018, excluding net proceeds from equity transactions, was $5.6 million lower compared to the same period last year, representing a 33% reduction. This reflects management’s tight cost control initiatives. Total cash, cash equivalents and restricted cash as of December 31, 2017, were approximately $16.5 million, compared to $15.2 million as of September 30, 2017, and $19.4 million as of December 31, 2016.\n“Our select preliminary third quarter and nine-month year-to-date results are in line with our internal plans and represent a substantial improvement over last year. These results signify that we are making noteworthy progress towards our Adjusted EBITDA breakeven milestone for the first time in our company’s history,” said Darren Jamison, President and Chief Executive Officer of Capstone.\n“When our actual third quarter results are announced, we anticipate that they will show significant progress towards our stated profitability goals as a result of higher service margins; increased bad debt collections; the recent reduction in force and the successful completion of our field reliability retrofit program during the quarter. We believe these strategic initiatives, when combined with our double-digit revenue growth for the quarter, will yield significantly improved results over the same period last year,” added Mr. Jamison.\nCapstone also announced that borrowings on the line of credit facility were at $11.0 million as of December 31, 2017, compared to $9.6 million at the end of the prior quarter and that it received approximately $4.4 million from financing activities during the third quarter of fiscal 2018.\nCapstone’s preliminary results show new product orders of approximately $10.2 million during the fiscal third quarter, for a 0.7:1 book-to-bill ratio, compared to $11.5 million of new product orders received and booked during the year-ago third quarter, which was a 0.9:1 book-to-bill ratio. Total book-to-bill ratio on nine months fiscal 2018 year-to-date basis was 0.8:1 compared to 0.9:1 for the same period last year.\nThe select financial results presented in this press release are preliminary and may change. This preliminary financial information includes calculations or figures that have been prepared internally by management and have not been reviewed or audited by our independent registered public accounting firm. There can be no assurance that the company’s actual results for the period presented herein will not differ from the preliminary financial data presented herein and such changes could be material. This preliminary financial data should not be viewed as a substitute for full financial statements prepared in accordance with GAAP and is not necessarily indicative of the results to be achieved for any future periods.\nAdjusted EBITDA is defined as net income before interest, provision for income taxes, depreciation and amortization expense, stock-based compensation expense, the change in warrant valuation and restructuring charges. Adjusted EBITDA is not a measure of our liquidity or financial performance under GAAP and should not be considered as an alternative to net income or any other performance measure derived in accordance with GAAP, or as an alternative to cash flows from operating activities as a measure of our liquidity.\nConference Call and Webcast\nCapstone will host a live webcast February 5, 2018, at 1:45 PM Pacific Time (4:45 PM Eastern Time) to provide the results of the third quarter fiscal 2018 ended December 31, 2017. Capstone will discuss its financial results and will provide an update on its business activities. At the end of the conference call, Capstone will host a question-and-answer session to provide an opportunity for financial analysts to ask questions. Investors and interested individuals are invited to listen to the webcast by logging on to Capstone’s investor relation’s webpage at www.capstoneturbine.com . A replay of the webcast will be available on the website for 30 days.\nAbout Capstone Turbine Corporation\nCapstone Turbine Corporation ( www.capstoneturbine.com ) (NASDAQ:CPST) is the world’s leading producer of low-emission microturbine systems and was the first to market commercially viable microturbine energy products. Capstone has shipped over 9,000 Capstone Microturbine systems to customers worldwide. These award-winning systems have logged millions of documented runtime operating hours. Capstone is a member of the U.S. Environmental Protection Agency's Combined Heat and Power Partnership, which is committed to improving the efficiency of the nation's energy infrastructure and reducing emissions of pollutants and greenhouse gases. A UL-Certified ISO 9001:2015 and ISO 14001:2015 certified company, Capstone is headquartered in the Los Angeles area with sales and/or service centers in the United States, Latin America, Europe, Middle East and Asia.\nForward-Looking Statements\nThis press release contains “forward-looking statements,” as that term is used in the federal securities laws, about the rebound in business, profitability, lowering our expenses, growth in our revenues, progress towards our Adjusted EBITDA breakeven milestone, and tightly managing our balance sheet. Forward-looking statements may be identified by words such as “expects,” “objective,” “intend,” “targeted,” “plan” and similar phrases. These forward-looking statements are subject to numerous assumptions, risks and uncertainties described in Capstone’s filings with the Securities and Exchange Commission that may cause Capstone’s actual results to be materially different from any future results expressed or implied in such statements. Capstone cautions readers not to place undue reliance on these forward-looking statements, which speak only as of the date of this release. Capstone undertakes no obligation, and specifically disclaims any obligation, to ", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/9883a516-c333-47bd-9396-692cdc239545", "https://www.globenewswire.com/Tracker?data=pVzI_XyCAPDtie2hXqu15ARINjWpJ1aCOazuRlO6P9VaFfmDh8X1ebaECfoYU3hMz-QVNG_r7PUK3RSwI5fu5nSglXodRVxcy6XT9Fjl1_U="], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T18:51:31.023+02:00", "highlightTitle": ""}