{"organizations": [], "uuid": "bb1cbe23c9af37e38af146a892d6e0336faefd2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-energy-transfer-partners-announces-quarterly-cash-distribution.html", "country": "US", "domain_rank": 767, "title": "Energy Transfer Partners Announces Quarterly Cash Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-30T00:15:00.000+02:00", "replies_count": 0, "uuid": "bb1cbe23c9af37e38af146a892d6e0336faefd2e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-energy-transfer-partners-announces-quarterly-cash-distribution.html", "ord_in_thread": 0, "title": "Energy Transfer Partners Announces Quarterly Cash Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "energy transfer partners", "sentiment": "negative"}, {"name": "etp", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "energy transfer equity", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Earnings Release and Earnings Call Dates Also Announced\nDALLAS--(BUSINESS WIRE)-- Energy Transfer Partners, L.P. (NYSE: ETP) today announced a quarterly cash distribution of $0.565 per ETP common unit ($2.26 on an annualized basis) for the fourth quarter ended December 31, 2017. This cash distribution is the same as the distribution for the third quarter of 2017 and will be paid on February 14, 2018 to unitholders of record as of the close of business on February 8, 2018.\nThe Partnership’s quarterly distributable cash flow (DCF) continued to increase as its existing asset base provided solid DCF. The Partnership’s decision to keep the quarterly cash distribution flat reflects its commitment to deleveraging and prudently managing its balance sheet.\nETP plans to release earnings for the fourth quarter of 2017 on Wednesday, February 21, 2018, after the market closes. ETP and Energy Transfer Equity, L.P. (NYSE: ETE), which owns the general partner of ETP, will conduct a joint conference call on Thursday, February 22, 2018 at 8:00 a.m. Central Time to discuss quarterly results. The conference call will be broadcast live via an internet webcast, which can be accessed through energytransfer.com . The call will also be available for replay on Energy Transfer’s website for a limited time.\nEnergy Transfer Partners, L.P. (NYSE: ETP) is a master limited partnership that owns and operates one of the largest and most diversified portfolios of energy assets in the United States. Strategically positioned in all of the major U.S. production basins, ETP owns and operates a geographically diverse portfolio of complementary natural gas midstream, intrastate and interstate transportation and storage assets; crude oil, natural gas liquids (NGL) and refined product transportation and terminalling assets; NGL fractionation; and various acquisition and marketing assets. ETP’s general partner is owned by Energy Transfer Equity, L.P. (NYSE: ETE). For more information, visit the Energy Transfer Partners, L.P. website at energytransfer.com .\nEnergy Transfer Equity, L.P. (NYSE:ETE) is a master limited partnership that owns the general partner and 100% of the incentive distribution rights (IDRs) of Energy Transfer Partners, L.P. (NYSE: ETP) and Sunoco LP (NYSE: SUN). ETE also owns Lake Charles LNG Company. On a consolidated basis, ETE’s family of companies owns and operates a diverse portfolio of natural gas, natural gas liquids, crude oil and refined products assets, as well as retail and wholesale motor fuel operations and LNG terminalling. For more information, visit the Energy Transfer Equity, L.P. website at energytransfer.com .\nForward-Looking Statements\nThis press release may include certain statements concerning expectations for the future that are forward-looking statements as defined by federal law. Such forward-looking statements are subject to a variety of known and unknown risks, uncertainties, and other factors that are difficult to predict and many of which are beyond management’s control. An extensive list of factors that can affect future results are discussed in the Partnership’s Annual Report on Form 10-K and other documents filed from time to time with the Securities and Exchange Commission. The Partnership undertakes no obligation to update or revise any forward-looking statement to reflect new information or events.\nThis release serves as qualified notice to nominees as provided for under Treasury Regulation section 1.1446-4(b)(4) and (d). Please note that 100 percent of Energy Transfer Partners, L.P.’s distributions to foreign investors are attributable to income that is effectively connected with a United States trade or business. Accordingly, all of Energy Transfer Partners, L.P.’s distributions to foreign investors are subject to federal tax withholding at the highest applicable effective tax rate. Nominees are treated as withholding agents responsible for withholding distributions received by them on behalf of foreign investors.\nThe information contained in this press release is available on our website at energytransfer.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129006133/en/\nEnergy Transfer Partners\nInvestor Relations:\nHelen Ryoo, Lyndsay Hannah, Brent Ratliff, 214-981-0795\nor\nMedia Relations:\nVicki Granado, 214-840-5820\nSource: Energy Transfer Partners, L.P.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.energytransfer.com&esheet=51750428&newsitemid=20180129006133&lan=en-US&anchor=energytransfer.com&index=1&md5=77c8b62e60aa6fb509767d8fd4f4fbd7", "http://www.businesswire.com/news/home/20180129006133/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.energytransfer.com&esheet=51750428&newsitemid=20180129006133&lan=en-US&anchor=energytransfer.com&index=4&md5=81b626e7af12672b177b8d4ec42109a8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.energytransfer.com&esheet=51750428&newsitemid=20180129006133&lan=en-US&anchor=energytransfer.com&index=2&md5=2777b4c8626a8df0218b2e8e1c8edd72", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.energytransfer.com&esheet=51750428&newsitemid=20180129006133&lan=en-US&anchor=energytransfer.com&index=3&md5=69a77c58e0d690bd37f26c361d4acf81"], "published": "2018-01-30T00:15:00.000+02:00", "crawled": "2018-01-30T04:47:20.003+02:00", "highlightTitle": ""}