{"organizations": [], "uuid": "0f27c6f7396e6f5ac7d2014fc9fbb18261ebd06b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-veritas-names-greg-hughes-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Veritas Names Greg Hughes as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T23:30:00.000+02:00", "replies_count": 0, "uuid": "0f27c6f7396e6f5ac7d2014fc9fbb18261ebd06b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-veritas-names-greg-hughes-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "Veritas Names Greg Hughes as Chief Executive Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "- New CEO brings decades of enterprise software expertise, a proven track record of strategic and operational excellence and extensive data management experience with Veritas and its blue-chip customers\n- Bill Coleman to remain on Veritas Board of Directors, named as operating executive at The Carlyle Group\nMOUNTAIN VIEW, Calif., Jan. 8, 2018 /PRNewswire/ -- Veritas Technologies , a leader in multi-cloud data management, today announced that its board of directors (the \"board\") has appointed Greg Hughes as chief executive officer, part of a planned succession strategy to lead the next phase of the company's evolution. Hughes will also join the Veritas board. Bill Coleman, Veritas' previous CEO, will remain a member of the Veritas board, continuing to serve as a trusted advisor to the company. He will also join The Carlyle Group as an operating executive. These appointments are effective immediately.\nHughes is an experienced enterprise software executive who most recently served as CEO of Serena Software, a leading enterprise application lifecycle management software company. Previously, he joined Veritas in 2003 and held various executive roles for the next seven years through the merger with Symantec. He rose to president of Enterprise Products at Symantec, which included responsibility for all Veritas products.\nUnder Hughes' leadership, Veritas will continue to focus on ensuring customer success while sustaining a rapid pace of innovation with both existing and new solutions that can help organizations solve their most complex data management challenges in a multi-cloud world.\n\"After a thorough search, we are confident that Greg is the right leader for Veritas moving forward,\" said Bill Krause, chairman of the board for Veritas. \"Greg has a proven track record of strategic and operational success in enterprise software, knows the company well from his previous work with Veritas and Symantec, and understands the data management demands and challenges facing Veritas' large customer base around the world.\"\n\"I am excited to return to Veritas at a time when data management has never been more critical for our customers globally,\" said Greg Hughes, chief executive officer, Veritas. \"I look forward to continuing the company's evolution and am confident, working with Veritas' strong executive management, that we have the right global team, product set and expertise in place to enable Veritas to capitalize on existing and future growth opportunities.\"\n\"We are grateful for Bill's leadership over the past two years,\" said Patrick McCarter, managing director and co-head of Global Technology, Media, and Telecommunications at The Carlyle Group. \"Under his direction, Veritas transitioned from an on-premises backup and recovery company to a leading multi-cloud data management company, all while delivering significant value for customers and creating meaningful opportunities for Veritas employees.\"\n\"I believe that Greg is the ideal leader to transition Veritas to the next phase of its evolution,\" said Bill Coleman. \"This planned succession ensures a seamless transition for the company and its customers, employees and partners.\"\nDuring his tenure as CEO, Coleman successfully steered Veritas' strategy as a privately held company and oversaw the diligence process around the company's separation from Symantec in 2015. Coleman also led a team of more than 7,000 employees around the world as the company overhauled its portfolio, developed a successful cloud platform strategy and delivered exceptional products and value to customers.\nAbout Veritas\nVeritas Technologies empowers businesses of all sizes to discover the truth in information—their most important digital asset. Using the Veritas platform, customers can accelerate their digital transformation and solve pressing IT and business challenges including multi-cloud data management, data protection, storage optimization, compliance readiness and workload portability—with no cloud vendor lock-in. Eighty-six percent of Fortune 500 companies rely on Veritas today to reveal data insights that drive competitive advantage. Learn more at www.veritas.com or follow us on Twitter at @veritastechllc .\nForward-Looking Statements\nThis press release may contain \"forward-looking statements\" within the meaning of securities laws. Any forward-looking statements involve risks, uncertainties and assumptions. Although we believe that the assumptions and analysis underlying these statements are reasonable as of the date hereof, investors are cautioned not to place undue reliance on these statements. Forward-looking statements include information concerning our liquidity and our possible future results of operations, including descriptions of our business strategies. These statements often include words such as \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"estimate,\" \"target,\" \"project,\" \"forecast,\" \"seek,\" \"will,\" \"may,\" \"should,\" \"could,\" \"would,\" or similar expressions. These statements are based on certain assumptions that we have made in light of our experience in the industry and our perceptions of historical trends, current conditions, expected future developments and other factors we believe are appropriate under the circumstances as of the date hereof. We do not have any obligation to and do not intend to update any forward-looking statements included herein. You should understand that these statements are not guarantees of future performance or results. Actual results could differ materially from those described in any forward-looking statements contained herein as a result of a variety of factors, including known and unknown risks and uncertainties, many of which are beyond our control.\nVeritas, the Veritas Logo, and NetBackup are trademarks or registered trademarks of Veritas Technologies LLC or its affiliates in the U.S. and other countries. Other names may be trademarks of their respective owners.\nPR Contacts\nUS Contact\nVeritas Technologies\nDayna Fried +1 925 493 9020\ndayna.fried@veritas.com\nEMEA Contact\nVeritas Technologies\nBrooke Hamilton +44 (0) 7713697268\nbrooke.hamilton@veritas.com\nAPJ Contact\nVeritas Technologies\nBelinda Lim +65 64275564\nbelinda.lim@veritas.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/veritas-names-greg-hughes-as-chief-executive-officer-300579200.html\nSOURCE Veritas Technologies", "external_links": ["http://www.prnewswire.com/news-releases/veritas-names-greg-hughes-as-chief-executive-officer-300579200.html", "https://www.veritas.com/", "https://www.veritas.com/content/veritas/english/en", "https://twitter.com/veritastechllc"], "published": "2018-01-08T23:30:00.000+02:00", "crawled": "2018-01-09T09:36:42.429+02:00", "highlightTitle": ""}