{"organizations": [], "uuid": "f09714407c6547e6d94501676155a79e09253406", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-downstream-development-authority-announces-its-cash-tender-offer-and-consent-solicitations-for-its-10-point-5-percent-senior.html", "country": "US", "domain_rank": 767, "title": "Downstream Development Authority Announces its Cash Tender Offer and Consent Solicitations for its 10.5% Senior Secured Notes Due 2019", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.635, "site_type": "news", "published": "2018-01-19T00:53:00.000+02:00", "replies_count": 0, "uuid": "f09714407c6547e6d94501676155a79e09253406"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-downstream-development-authority-announces-its-cash-tender-offer-and-consent-solicitations-for-its-10-point-5-percent-senior.html", "ord_in_thread": 0, "title": "Downstream Development Authority Announces its Cash Tender Offer and Consent Solicitations for its 10.5% Senior Secured Notes Due 2019", "locations": [], "entities": {"persons": [{"name": "ja", "sentiment": "none"}], "locations": [{"name": "okla.", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}], "organizations": [{"name": "downstream development authority", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "QUAPAW, Okla., Jan. 18, 2018 /PRNewswire/ -- Downstream Development Authority of the Quapaw Tribe of Oklahoma (O-Gah-Pah) (\"Downstream\") today announced that it has commenced a cash tender offer to purchase any and all of its outstanding 10.5% Senior Secured Notes due 2019 (CUSIP Nos. 26112TAE6, 26112TAF3, and U25409AC4) (the \"Notes\"). As of January 18, 2018, the aggregate outstanding principal amount of the Notes is $264,896,000. The tender offer and consent solicitation will expire at 11:59 p.m., New York City time, on February 14, 2018, unless extended or earlier terminated (such date and time, as the same may be extended or earlier terminated, the \"Expiration Date\"). In conjunction with the tender offer, Downstream is soliciting consents from holders of the Notes to effect certain proposed amendments to the indenture governing the Notes. The tender offer and consent solicitation are being made on the terms and subject to the conditions set forth in the Offer to Purchase and Consent Solicitation Statement (the \"Offer to Purchase\") and a related Letter of Transmittal, each dated January 18, 2018. Holders that tender their Notes in the tender offer will be deemed to have consented to the proposed amendments to the indenture governing the Notes owned by such holder.\nThe tender offer and consent solicitation are subject to the satisfaction or waiver of certain conditions, as described in the Offer to Purchase, including the condition that Downstream shall have received net proceeds from a contemporaneous notes offering and debt refinancing sufficient to repurchase all of the Notes tendered, including the payment of all premiums, if any, consent payments, accrued interest and fees, costs and expenses incurred in connection with the tender offer and consent solicitation, as described in more detail in the Offer to Purchase.\nDownstream is offering to purchase the Notes for a total consideration of $1,023.75 for each $1,000 in principal amount of Notes validly tendered (and not validly withdrawn) and accepted for purchase pursuant to the tender offer. The total consideration includes a consent payment of $30.00 for each $1,000 in principal of Notes validly tendered payable to holders who validly tender (and do not validly withdraw) their Notes and validly deliver (and do not validly revoke) their consents to the proposed amendments at or prior to 5:00 p.m., New York City time, on January 31, 2018, unless extended (such date and time, as extended, the \"Consent Date\"). Upon the terms and conditions set forth in the Offer to Purchase, the Authority will pay the total consideration for all Notes validly tendered (and not validly withdrawn) on or prior to the Consent Date if such Notes are accepted for payment (the \"Initial Acceptance Date\") and expects the payment date (the \"Initial Payment Date\") to be on or promptly after the Initial Acceptance Date. The Initial Payment Date is currently expected to be February 1, 2018. Holders that validly tender their Notes after the Consent Date and at or prior to the Expiration Date will be eligible to receive only the total consideration payable upon the tender of such holders' Notes, less the consent payment. In addition, holders that validly tender (and do not validly withdraw) Notes that are accepted for purchase by Downstream will receive a cash payment representing the accrued and unpaid interest on such Notes from the last interest payment date to, but not including, the initial payment date or final payment date, as applicable, for such Notes purchased by Downstream pursuant to the tender offer.\nThe proposed amendments to the indenture governing the Notes would eliminate substantially all of the restrictive covenants, certain affirmative covenants, certain events of default and substantially all of the restrictions contained in the indenture and the Notes. Holders may not deliver consents to the proposed amendments without validly tendering the related Notes in the tender offer and may not revoke their consents without withdrawing the previously tendered Notes to which they relate.\nNotes validly tendered at or prior to 5:00 p.m., New York City time, on January 31, 2018 (the \"Withdrawal Date\"), may be validly withdrawn and the related consents may be validly revoked at any time prior to the Withdrawal Date. Tendered notes and delivered consents may not be validly withdrawn or revoked after the Withdrawal Date, except under certain limited circumstances as described in the Offer to Purchase.\nCredit Suisse Securities (USA) LLC is acting as the Dealer Manager and Solicitation Agent for the tender offer and consent solicitation. Questions regarding the tender offer and consent solicitation may be directed to Credit Suisse Securities (USA) LLC at (800) 820-1653 (U.S. toll free) or (212) 538-2147 (collect).\nThe complete terms and conditions of the tender offer and consent solicitation are set forth in the Offer to Purchase. Holders of Notes are urged to read the tender offer documents carefully before making any decision with respect to the tender offer. Holders may obtain copies of the Offer to Purchase and the Letter of Transmittal from D.F. King & Co., Inc., the Information Agent for the tender offer and consent solicitation, by telephone at (212) 269-5550 (banks and brokers) or toll free at (866) 356-7813 (all others) or by email at quapaw@dfking.com .\nThis press release is for information purposes only and is not an offer to purchase, a solicitation of an offer to purchase or a solicitation of a consent with respect to any of the Notes. The tender offer and consent solicitation are being made solely pursuant to the tender offer and consent solicitation documents, including the Offer to Purchase that Downstream is distributing to holders of the Notes. The tender offer and consent solicitation are not being made to holders of Notes in any jurisdiction in which the making or acceptance thereof would not be in compliance with the securities, blue sky or other laws of such jurisdiction.\nNeither Downstream, the Dealer Manager and Solicitation Agent nor the Information Agent and Tender Agent, nor any other person makes any recommendation as to whether holders of Notes should tender their Notes, and no one has been authorized to make such a recommendation.\nAbout Downstream\nDownstream is a wholly owned, unincorporated instrumentality of the Quapaw Tribe of Oklahoma (O-Gah-Pah), a federally recognized tribe. Downstream was established in 2007 by the Tribe for the purpose of developing, constructing, operating, and managing the Downstream Casino Resort, which is a full- service destination casino resort located in northeast Oklahoma at the three-corner border of Oklahoma, Missouri and Kansas at Interstate 44, Missouri Exit 1, near Joplin, Missouri. The casino resort features a two tower hotel with 374 guestrooms and suites, approximately 70,000 square feet of gaming space with approximately 1,382 Class III and 608 Class II slot machines, 35 table games, 14 poker tables, 33,700 square feet of meeting and event space, including an indoor 29,000 square-foot events pavilion, five restaurants, a health club, and a h", "external_links": ["http://www.prnewswire.com/news-releases/downstream-development-authority-announces-its-cash-tender-offer-and-consent-solicitations-for-its-105-senior-secured-notes-due-2019-300584987.html"], "published": "2018-01-19T00:53:00.000+02:00", "crawled": "2018-01-19T05:27:07.003+02:00", "highlightTitle": ""}