{"organizations": [], "uuid": "418c38fcd349410effd76d97f1c3188ef673be85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-masimo-announces-fda-clearance-for-home-use-of-rad-97a.html", "country": "US", "domain_rank": 767, "title": "Masimo Announces FDA Clearance for Home Use of Rad-97™", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.045, "site_type": "news", "published": "2018-01-09T16:00:00.000+02:00", "replies_count": 0, "uuid": "418c38fcd349410effd76d97f1c3188ef673be85"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-masimo-announces-fda-clearance-for-home-use-of-rad-97a.html", "ord_in_thread": 0, "title": "Masimo Announces FDA Clearance for Home Use of Rad-97™", "locations": [], "entities": {"persons": [{"name": "busi", "sentiment": "negative"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "masimo", "sentiment": "negative"}, {"name": "fda", "sentiment": "negative"}, {"name": "advanced communication capabilities", "sentiment": "negative"}, {"name": "optional integrated camera", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rad-97 Comes with Advanced Communication Capabilities to Facilitate Telehealth\nIRVINE, Calif.--(BUSINESS WIRE)-- Masimo (NASDAQ: MASI) announced today FDA clearance for home use of the Rad-97™ Pulse CO-Oximeter ® . Rad-97 offers Masimo noninvasive and continuous monitoring, through Measure-through Motion and Low Perfusion™ SET ® pulse oximetry and upgradeable rainbow ® technologies, in a compact, standalone monitor that combines advanced connectivity and communication capabilities for telehealth with an interface easily customized for use at home.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180109005756/en/\nMasimo Rad-97™ Pulse CO-Oximeter® with Optional Integrated Camera (Photo: Business Wire)\nWith an ever increasing number of patients receiving care at home, there is a growing need for high-quality home monitoring and telehealth equipment. Rad-97, in addition to SET ® pulse oximetry and advanced parameter monitoring technology through rainbow ® noninvasive monitoring, is available with optional integrated blood pressure and capnography measurements. Its innovative communication capabilities allow monitoring data from a variety of third-party Bluetooth ® -enabled devices used at home, including thermometers, weight scales, and glucometers, to seamlessly transfer to Rad-97 – and from there to anywhere in the world, in real time. The optional integrated camera allows remote clinicians to interact with patients over live audio and video. Rad-97 brings hospital-grade technology to the home in a single, integrated device that is a monitoring, connectivity, and telecommunications hub.\nWith its built-in enterprise WiFi capability, Rad-97 has the ability to connect wirelessly from the home to supplemental patient monitoring systems in the hospital, including Masimo Patient SafetyNet™*, allowing clinicians to remotely observe patient status while facilitating automatic data transfer to hospital electronic medical record (EMR) systems. Rad-97 can trend and store data for up to 96 hours.\nWith its intuitive touchscreen interface, Rad-97 is easy to use for clinicians and non-clinicians alike, and can be easily customized to meet the needs of home users. The device can be configured in Home mode, which streamlines basic utility, giving home users access to applicable settings and messages, while hiding others and locking alarm settings, minimizing the chances of inadvertent interaction.\nJoe Kiani, Founder and CEO of Masimo, said, “Rad-97 is well-suited for a variety of care settings, now including home. Facilitated by its powerful connectivity and telehealth capabilities, Rad-97 allows clinicians to remotely interact with patients, as well as monitor their status and spot trends from afar through automated data collection and transfer.”\n@MasimoInnovates | #Masimo\n*The use of the trademark Patient SafetyNet is under license from University HealthSystem Consortium.\nAbout Masimo\nMasimo (NASDAQ: MASI) is a global leader in innovative noninvasive monitoring technologies. Our mission is to improve patient outcomes and reduce the cost of care. In 1995, the company debuted Masimo SET ® Measure-through Motion and Low Perfusion™ pulse oximetry, which has been shown in multiple studies to significantly reduce false alarms and accurately monitor for true alarms. Masimo SET ® has also been shown to help clinicians reduce severe retinopathy of prematurity in neonates, 1 improve CCHD screening in newborns, 2 and, when used for continuous monitoring with Masimo Patient SafetyNet™* in post-surgical wards, reduce rapid response activations and costs. 3,4,5 Masimo SET ® is estimated to be used on more than 100 million patients in leading hospitals and other healthcare settings around the world, 6 and is the primary pulse oximetry at 17 of the top 20 hospitals listed in the 2017-18 U.S. News and World Report Best Hospitals Honor Roll. 7 In 2005, Masimo introduced rainbow ® Pulse CO-Oximetry technology, allowing noninvasive and continuous monitoring of blood constituents that previously could only be measured invasively, including total hemoglobin (SpHb ® ), oxygen content (SpOC™), carboxyhemoglobin (SpCO ® ), methemoglobin (SpMet ® ), Pleth Variability Index (PVi ® ), and more recently, Oxygen Reserve Index ™ (ORi™), in addition to SpO 2 , pulse rate, and perfusion index (Pi). In 2014, Masimo introduced Root ® , an intuitive patient monitoring and connectivity platform with the Masimo Open Connect™ (MOC-9™) interface, enabling other companies to augment Root with new features and measurement capabilities. Masimo is also taking an active leadership role in mHealth with products such as the Radius-7™ wearable patient monitor, iSpO 2 ® pulse oximeter for smartphones, and the MightySat™ fingertip pulse oximeter. Additional information about Masimo and its products may be found at www.masimo.com . Published clinical studies on Masimo products can be found at http://www.masimo.com/cpub/clinical-evidence.htm .\nORi has not received FDA 510(k) clearance and is not available for sale in the United States.\n*The use of the trademark Patient SafetyNet is under license from University HealthSystem Consortium.\nReferences\n1. Castillo A et al. Prevention of Retinopathy of Prematurity in Preterm Infants through Changes in Clinical Practice and SpO 2 Technology. Acta Paediatr. 2011 Feb;100(2):188-92.\n2. de-Wahl Granelli A et al. Impact of pulse oximetry screening on the detection of duct dependent congenital heart disease: a Swedish prospective screening study in 39,821 newborns. BMJ. 2009;Jan 8;338.\n3. Taenzer AH et al. Impact of Pulse Oximetry Surveillance on Rescue Events and Intensive Care Unit Transfers: A Before-And-After Concurrence Study. Anesthesiology. 2010; 112(2):282-287.\n4. Taenzer AH et al. Postoperative Monitoring – The Dartmouth Experience. Anesthesia Patient Safety Foundation Newsletter. Spring-Summer 2012.\n5. McGrath SP et al. Surveillance Monitoring Management for General Care Units: Strategy, Design, and Implementation. The Joint Commission Journal on Quality and Patient Safety. 2016 Jul;42(7):293-302.\n6. Estimate: Masimo data on file.\n7. http://health.usnews.com/health-care/best-hospitals/articles/best-hospitals-honor-roll-and-overview .\nForward-Looking Statements\nThis press release includes forward-looking statements as defined in Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, in connection with the Private Securities Litigation Reform Act of 1995. These forward-looking statements include, among others, statements regarding the potential effectiveness of Masimo Rad-97™. These forward-looking statements are based on current expectations about future events affecting us and are subject to risks and uncertainties, all of which are difficult to predict and many of which are beyond our control and could cause our actual results to differ materially and adversely from those expressed in our forward-looking statements as a result of various risk factors, including, but", "external_links": ["http://www.businesswire.com/news/home/20180109005756/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.masimo.com&esheet=51740167&newsitemid=20180109005756&lan=en-US&anchor=www.masimo.com&index=3&md5=c15978d842a3b4c8fbee4ad1003754a0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51740167&newsitemid=20180109005756&lan=en-US&anchor=www.sec.gov&index=6&md5=73e7463b218750e32e124cd4d099a6a0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fhealth.usnews.com%2Fhealth-care%2Fbest-hospitals%2Farticles%2Fbest-hospitals-honor-roll-and-overview&esheet=51740167&newsitemid=20180109005756&lan=en-US&anchor=http%3A%2F%2Fhealth.usnews.com%2Fhealth-care%2Fbest-hospitals%2Farticles%2Fbest-hospitals-honor-roll-and-overview&index=5&md5=e56acf6e9bf0879cf0b0b240b7da121d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.masimo.com&esheet=51740167&newsitemid=20180109005756&lan=en-US&anchor=Masimo&index=1&md5=ef7304d908b25811ba29a3dae66d92e9", "http://www.masimo.com/cpub/clinical-evidence.htm", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftrk.cp20.com%2FTracking%2Ft.c%3F90nmq-y44q7-lent0i5%26_v%3D2&esheet=51740167&newsitemid=20180109005756&lan=en-US&anchor=%40MasimoInnovates&index=2&md5=6f317a4027c0ce21b3a30dc4f196d651", "http://health.usnews.com/health-care/best-hospitals/articles/best-hospitals-honor-roll-and-overview", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.masimo.com%2Fcpub%2Fclinical-evidence.htm&esheet=51740167&newsitemid=20180109005756&lan=en-US&anchor=http%3A%2F%2Fwww.masimo.com%2Fcpub%2Fclinical-evidence.htm&index=4&md5=acfbdc3266b8f93f13e674be0fe9f4f4"], "published": "2018-01-09T16:00:00.000+02:00", "crawled": "2018-01-09T17:53:19.008+02:00", "highlightTitle": ""}