{"organizations": [], "uuid": "27215ab211d3091ff774bda0de5b308ecc3a8ac9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-sabic-acquires-strategic-stake-in-clariant-from-40-north-and-corvex.html", "country": "US", "domain_rank": 767, "title": "SABIC acquires strategic stake in Clariant from 40 North and Corvex", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.05, "site_type": "news", "published": "2018-01-25T09:22:00.000+02:00", "replies_count": 0, "uuid": "27215ab211d3091ff774bda0de5b308ecc3a8ac9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-sabic-acquires-strategic-stake-in-clariant-from-40-north-and-corvex.html", "ord_in_thread": 0, "title": "SABIC acquires strategic stake in Clariant from 40 North and Corvex", "locations": [], "entities": {"persons": [], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "corvex riyadh", "sentiment": "none"}], "organizations": [{"name": "clariant", "sentiment": "negative"}, {"name": "sabic", "sentiment": "negative"}, {"name": "scientific design", "sentiment": "none"}, {"name": "corvex management", "sentiment": "none"}, {"name": "vtx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RIYADH, Saudi Arabia, Jan. 25, 2018 /PRNewswire/ -- SABIC (SABIC: AB), a world leader in chemicals, has agreed to acquire approximately 83 million shares in Clariant (VTX: CLN), a global specialty chemicals company, from 40 North and Corvex Management. The acquisition of this approximately 24.9% stake in Clariant will make SABIC the largest Clariant shareholder and represents another key milestone in SABIC's growth and diversification strategy to become the preferred world leader in chemicals.\nThis acquisition is part of SABIC's long-term growth strategy to remain committed to product differentiation and creating value for its customers. Clariant is complementary to SABIC's existing specialties business and is well in line with SABIC's strategy of opening up new growth opportunities in specialty chemicals.\nSABIC currently has no plans to launch or otherwise effect a full takeover of Clariant.\nSABIC and Clariant have already had a successful relationship in their joint venture, Scientific Design, a process technology and catalyst development company. SABIC is looking forward to engaging in discussions with the company.\nDavid Winter, Co-CEO of Standard Industries and Co-CIO of 40 North, said, \"SABIC is an established global leader in the chemicals industry with a world-class management team and a long-term, sophisticated vision for the future. We are confident that this transaction allows Clariant to continue on its path to becoming a global specialty chemicals leader.\"\nDavid Millstone, Co-CEO of Standard Industries and Co-CIO of 40 North commented, \"We have been significant shareholders of Clariant since 2016. SABIC's strategic investment in Clariant is a successful outcome and we are pleased to have played a role in making it possible.\"\nThe closing of the transaction is subject to completing regulatory approvals.\nABOUT SABIC\nSABIC is a global leader in diversified chemicals headquartered in Riyadh, Saudi Arabia. We manufacture on a global scale in the Americas, Europe, Middle East and Asia Pacific, making distinctly different kinds of products: chemicals, commodity and high performance plastics, agri-nutrients and metals. We support our customers by identifying and developing opportunities in key end markets such as construction, medical devices, packaging, agri-nutrients, electrical and electronics, transportation and clean energy. SABIC has more than 35,000 employees worldwide and operates in more than 50 countries. Fostering innovation and a spirit of ingenuity, we have 12,191 global patent filings, and have significant research resources with innovation hubs in five key geographies – USA, Europe, Middle East, South Asia and North Asia. The Saudi Arabian government owns 70 percent of SABIC shares with the remaining 30 percent publicly traded on the Saudi stock exchange.\nSABIC Media Contact in Saudi Arabia\nRiyad Al-Faiz\nSABIC\nalfaiz@sabic.com\n+966 11 225 9453\nABOUT Standard Industries\nStandard Industries is a privately-held, global, diversified holding company with interests in building materials, aggregates, and related investment businesses in public equities and real estate. With over 15,000 employees and operations in more than 80 countries, Standard's businesses include: GAF, the leading roofing and waterproofing manufacturer in North America; BMI Group, the leading manufacturer and supplier of flat and pitched roofing systems for the residential and non-residential markets in Europe, parts of Asia, and South Africa; Siplast, a leader in the development and manufacture of the world's most advanced roofing and waterproofing systems; SGI, a leading North American aggregates and mining company; 40 North, a fundamentally-based investment fund focused on both public equities and third-party managed alternative investments; and Winter Properties, a vertically integrated real estate investment management and development enterprise. To learn more about Standard Industries, visit www.standardindustries.com .\nABOUT 40 North\n40 North is a fundamentally-based investment fund focused on both public equities and third-party managed alternative investments.\nStandard Media Contact in Switzerland\nStandard Media Contact in U.S.\nEdwin van der Geest\nCalvin Mitchell\nDynamics Group\nStandard Industries\nvdg@dynamicsgroup.ch\ncalvin.mitchell@standardindustries.com\n+41 43 268 32 30\n+1 212 821 1594\nView original content: http://www.prnewswire.com/news-releases/sabic-acquires-strategic-stake-in-clariant-from-40-north-and-corvex-300588055.html\nSOURCE Standard Industries", "external_links": ["http://www.prnewswire.com/news-releases/sabic-acquires-strategic-stake-in-clariant-from-40-north-and-corvex-300588055.html", "http://www.standardindustries.com/"], "published": "2018-01-25T09:22:00.000+02:00", "crawled": "2018-01-25T09:09:06.032+02:00", "highlightTitle": ""}