{"organizations": [], "uuid": "58f3afc7b8391ef5ece7c9d482a14786c0d534d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221258811&w=1200&r=LYNXMPEE0A1WX", "site_section": "http://feeds.reuters.com/reuters/politicsNews/", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-pakistan-aid/a-mad-scramble-how-trump-tweet-on-pakistan-blindsided-u-s-officials-idUSKBN1F030Q", "country": "US", "domain_rank": 408, "title": "`A mad scramble': How Trump tweet on Pakistan blindsided U.S. officials", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T00:15:00.000+02:00", "replies_count": 0, "uuid": "58f3afc7b8391ef5ece7c9d482a14786c0d534d1"}, "author": "", "url": "https://www.reuters.com/article/us-usa-pakistan-aid/a-mad-scramble-how-trump-tweet-on-pakistan-blindsided-u-s-officials-idUSKBN1F030Q", "ord_in_thread": 0, "title": "`A mad scramble': How Trump tweet on Pakistan blindsided U.S. officials", "locations": [], "entities": {"persons": [{"name": "john walcott", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jonathan landay", "sentiment": "none"}, {"name": "arshad mohammed", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "taliban", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 10:15 PM / Updated 4 hours ago 'A mad scramble': How Trump tweet on Pakistan blindsided U.S. officials Jonathan Landay , Arshad Mohammed , John Walcott 6 Min Read \nWASHINGTON (Reuters) - A surprise New Year’s Day tweet by President Donald Trump in which he appeared to decree an end to U.S. aid for Pakistan, sent U.S. officials scrambling to suspend security assistance without even knowing how much aid they were freezing, four U.S. officials said. \nThe decision to freeze up to about $2 billion in security aid, according to a later estimate by U.S. officials, to a nuclear-armed ally is the latest example of how, nearly a year into Trump’s presidency, U.S. officials sometimes have to scurry to turn his tweets into policy. \nThe Trump administration had been weighing an aid freeze for months, including in a meeting of top national security advisers before Christmas. Washington has for years demanded that Islamabad stop providing sanctuary and other support for the Afghan Taliban and the allied Haqqani network. \n(For a graphic of historical U.S. aid to Pakistan, click here: tmsnrt.rs/2DbVEyQ ) \nAt the time of Trump’s tweet, a U.S. assessment of Pakistani compliance with those demands was still under way. A cohesive U.S. policy - including preparations for possible Pakistani reaction - was not expected to be completed until March or April, three U.S. officials interviewed said. \n“None of the elements of a coherent policy was in place, or even close at hand, when the president, in effect, made a policy announcement,” said one U.S. official, who like others spoke on condition of anonymity. “Despite a mad scramble to backfill a tweet, we still don’t have ... an effective policy in place.” \nMichael Anton, a spokesman for the National Security Council, did not address whether the tweet had sped up the policy process, saying Trump had made clear his intent to take a new, tougher stance toward Pakistan as part of the Afghanistan war strategy he unveiled in August. \n“This action is being taken after months of careful interagency review. Any suggestion to the contrary is false,” he said. \nThe State Department declined to comment. \nTrump was at his Mar-a-Lago resort in Florida when he posted his tweet at 7:12 a.m. on Jan. 1, after hosting a lavish New Year’s Eve party. Until then he had kept a relatively low public profile while he mostly golfed. \nThe United States, he tweeted, had “foolishly” given Pakistan more than $33 billion in aid and “they have given us nothing but lies and deceit, thinking our leaders as fools. They give safe haven to the terrorists we hunt in Afghanistan, with little help. No more!” \nIt is not clear what prompted Trump to issue the tweet, which infuriated Pakistani officials. Pakistan’s National Security Committee of senior civilian and military chiefs denounced it as “completely incomprehensible.” U.S. Ambassador David Hale was summoned to the foreign ministry for an explanation. People chant slogans as they take part in an anti-U.S. rally in Chaman, Pakistan, January 5, 2018. REUTERS/Saeed Ali Achakzai \nCaught by surprise on their New Year’s Day holiday, a small group of White House aides and other top officials scrambled to make good on the president’s unexpected statement, said a senior U.S. official who was part of the consultations. \nThere was no time to issue a formal White House policy directive outlining the amount of frozen funds, four officials said. \nWhen the administration confirmed that it was suspending security aid to Pakistan four days after Trump’s tweet, the State Department was still not able to quantify how much aid was at stake, underscoring how far U.S. officials had been from implementing any policy before the president’s statement. \nU.S. officials later said the decision could affect about $1 billion in planned security assistance and $900 million to reimburse Pakistan for counter-terrorism operations. FILE PHOTO:   Trump speaks to the media after the Congressional Republican Leadership retreat at Camp David, Maryland, U.S., January 6, 2018. REUTERS/Yuri Gripas/File Photo \nAnother sign of the haste was the failure to give Pakistan the usual diplomatic courtesy of a warning before the president’s tweet, U.S. officials said. \nPerhaps most seriously, they said, there was no time to prepare for possible retaliation. TWEET IN SEARCH OF STRATEGY \nThe Pentagon and State Department were especially concerned that the Pakistani army, which effectively runs foreign policy, might close the air and land corridors on which U.S.-led troops and Afghan forces in landlocked Afghanistan depend for supplies, the officials said. So far, Pakistan has not done so. \nAt the time the decision was made, there was no agreement with neighboring countries for alternative routes, five U.S. officials said. \n“It appeared to be a tweet in search of a strategy,” said Dan Feldman, a former U.S. special representative for Afghanistan and Pakistan. \n“There seemed to be a flurry of inter-agency activity after that tweet to arrive at some sort of policy to frame it ... to prove it wasn’t just an impulsive tweet.” \nIt was not the first time that U.S. officials have been caught off guard by Trump’s fondness for formulating policy by tweet. \nLast year, Trump tweeted that the U.S. government would not accept transgender people to serve in the military, catching the Pentagon leadership by surprise. His statement eventually had to be walked back. Editing by Yara Bayoumy and Ross Colvin", "external_links": [], "published": "2018-01-12T00:15:00.000+02:00", "crawled": "2018-01-12T00:31:43.000+02:00", "highlightTitle": ""}