{"organizations": [], "uuid": "a1d6631b95ca2486204486cb1578c5f258dcf81b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-sailpoint-announces-industry-veteran-michael-j-sullivan-has-joined-board-of-directors-and-serves-as-chairperson-of-audit.html", "country": "US", "domain_rank": 767, "title": "SailPoint Announces Industry Veteran Michael J. Sullivan Has Joined Board of Directors and Serves as Chairperson of Audit Committee", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-16T16:00:00.000+02:00", "replies_count": 0, "uuid": "a1d6631b95ca2486204486cb1578c5f258dcf81b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-sailpoint-announces-industry-veteran-michael-j-sullivan-has-joined-board-of-directors-and-serves-as-chairperson-of-audit.html", "ord_in_thread": 0, "title": "SailPoint Announces Industry Veteran Michael J. Sullivan Has Joined Board of Directors and Serves as Chairperson of Audit Committee", "locations": [], "entities": {"persons": [{"name": "michael j. sullivan", "sentiment": "neutral"}, {"name": "mike", "sentiment": "none"}, {"name": "sullivan", "sentiment": "none"}, {"name": "mark mcclain", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "sailpoint technologies holdings, inc.", "sentiment": "neutral"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "sailpoint", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas--(BUSINESS WIRE)-- SailPoint Technologies Holdings, Inc. (NYSE: SAIL), the leader in enterprise identity management, today announced the appointment of Michael J. Sullivan to the board of directors and as chairperson of the audit committee effective November 2017. In this role, Mr. Sullivan will oversee SailPoint’s financial reporting processes and provide oversight of SailPoint’s independent registered accounting firm. The board has determined that Mr. Sullivan is “independent” as that term is defined under the listing standards of the New York Stock Exchange.\n“Mike joins the SailPoint board during an exciting time in the company’s history. As we concentrate on the performance of the business, the guidance and leadership he provides will be instrumental to our continued success,” said Mark McClain, CEO and Co-founder of SailPoint. “With his significant experience in the identity industry combined with his financial and public company expertise, Mike is a key addition to our board of directors.”\nMr. Sullivan previously served as Chief Financial Officer at Ping Identity, an identity security company, and his tenure there culminated in the successful sale of Ping to Vista Equity Partners. Prior to that, he served on the boards and chaired the audit committees of two private equity-backed portfolio companies, Vertafore and SNL Financial. Previously, Mr. Sullivan spent 12 years as the Executive Vice President and Chief Financial Officer of IHS Inc., which he helped take public, and also worked closely with the audit committee of its board of directors. Other leadership experience includes three years at Coors Brewing Company directing the corporate accounting function and leading corporate planning and analysis efforts. Mr. Sullivan began his career with Price Waterhouse, LLP in New York and Denver.\n“SailPoint’s track record of leadership in identity governance is unparalleled in the industry, and I look forward to providing strategic financial insight as a board member and chairperson of the audit committee,” said Mr. Sullivan. “It’s a pivotal time to be joining SailPoint as they build upon the momentum from their recent IPO, and I’m excited to make a positive impact along with the other board members and executive leadership.”\nSailPoint: The Power of Identity™\nSailPoint, the leader in enterprise identity management, brings the Power of Identity to customers around the world. SailPoint’s open identity platform gives organizations the power to enter new markets, scale their workforces, embrace new technologies, innovate faster and compete on a global basis. As both an industry pioneer and market leader in identity governance, SailPoint delivers security, operational efficiency and compliance to enterprises with complex IT environments. SailPoint's customers are among the world’s largest companies in a wide range of industries, including: 6 of the top 15 banks, 4 of the top 6 healthcare insurance and managed care providers, 8 of the top 15 property and casualty insurance providers, 5 of the top 15 pharmaceutical companies, and 6 of the largest 15 federal agencies.\nStay up-to-date on SailPoint by following us on Twitter and LinkedIn and by subscribing to the SailPoint blog .\nSailPoint, the SailPoint logo, IdentityIQ, IdentityNow, IdentityAI, SecurityIQ and all techniques are trademarks or registered trademarks of SailPoint Technologies Holdings, Inc. in the U.S. and/or other countries. All other products or services are trademarks of their respective companies.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005279/en/\nSailPoint\nJessica Sutera, 978-278-5411\nJessica.Sutera@sailpoint.com\nSource: SailPoint Technologies Holdings, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.sailpoint.com%2F&esheet=51742812&newsitemid=20180116005279&lan=en-US&anchor=SailPoint+Technologies+Holdings%2C+Inc.&index=1&md5=38de3614cd7ae14b5270e6c1c6c4b5cc", "http://www.businesswire.com/news/home/20180116005279/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fsailpoint&esheet=51742812&newsitemid=20180116005279&lan=en-US&anchor=Twitter&index=2&md5=4844fbe4237466082650e11344307a2b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fsailpoint-technologies%2F&esheet=51742812&newsitemid=20180116005279&lan=en-US&anchor=LinkedIn&index=3&md5=1fd5edc421c99a7760047a2f0c3b9c1d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.sailpoint.com%2Fblog%2F&esheet=51742812&newsitemid=20180116005279&lan=en-US&anchor=SailPoint+blog&index=4&md5=99fdc2b2b6e3e695670f0cf44c438819"], "published": "2018-01-16T16:00:00.000+02:00", "crawled": "2018-01-16T16:26:28.004+02:00", "highlightTitle": ""}