{"organizations": [], "uuid": "7cdae987fba7403c58f8fb2f2dddf2dfc01bcac5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223386109&w=1200&r=LYNXMPEE0I182", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/bc-finreg-aml-updating-regime/u-s-senate-panel-members-urge-changes-to-out-of-date-anti-laundering-regime-idUSKBN1F821F", "country": "US", "domain_rank": 408, "title": "U.S. Senate panel members urge changes to 'out of date' anti-laundering regime", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:36:00.000+02:00", "replies_count": 0, "uuid": "7cdae987fba7403c58f8fb2f2dddf2dfc01bcac5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/bc-finreg-aml-updating-regime/u-s-senate-panel-members-urge-changes-to-out-of-date-anti-laundering-regime-idUSKBN1F821F", "ord_in_thread": 0, "title": "U.S. Senate panel members urge changes to 'out of date' anti-laundering regime", "locations": [], "entities": {"persons": [{"name": "elizabeth warren", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}], "organizations": [{"name": "u.s. senate", "sentiment": "negative"}, {"name": "congress", "sentiment": "negative"}, {"name": "thomson reuters regulatory intelligence", "sentiment": "negative"}, {"name": "new york", "sentiment": "negative"}, {"name": "senate banking committee", "sentiment": "none"}, {"name": "banking committee", "sentiment": "none"}, {"name": "clearing house association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Thomson Reuters Regulatory Intelligence) - The U.S. Congress should mandate the collection of information about the true owners of corporations, law enforcement should share more information with banks to help spot criminals and artificial intelligence should be considered as a means to lower bank anti-laundering costs, members of the Senate Banking Committee urged last week.\n“It seems to me we need to re-think a lot of our money-laundering laws, some of which … were written back in the 1970s and are badly out of date. That makes it hard for law enforcement trying to stop money laundering and bad for financial institutions trying to comply with these laws,” Senator Elizabeth Warren, a Democrat from Massachusetts, said at a Banking Committee hearing.\nThe hearing focused on ways the U.S. anti-money laundering regime could be made more effective and efficient( here ). Its emphasis was in line with an industry push that began in earnest early last year when the Clearing House Association, a trade group representing the largest U.S. banks, issued a report( bit.ly/2BhBAc8 ) calling for change.\n“It’s not an ‘Oh, we don’t want to spend the money anymore,’ it’s ‘We’re spending it on the wrong things,'” Greg Baer, president of the Clearing House, told the hearing.\nThere are signs of a growing consensus on Capitol Hill that the U.S. anti-money laundering (AML) regime needs significant revisions, according banking industry sources and public comments by members of relevant House and Senate committees.\nBanking Committee Chairman Mike Crapo of Idaho said the “sophistication, types and numbers of threats” have increased since the Bank Secrecy Act was passed as the foundation of U.S. anti-money laundering law 50 years ago. The government and industry are both devoting more resources to protecting the financial system from illicit transactions. “It is incumbent on this committee to then ensure that all of this work and the resources involved result in a high degree of usefulness in protecting this nation as intended by the BSA itself,” he said.\nA stumbling block seems to be where to begin.\n“When we come into committees like this, we tend to have a ‘solve-world-hunger’ scope to our discussion, and if we we’re just going to cook a good meal and make progress what sorts of quick hits … should we look at to improve the system?” asked Senator Thom Tillis, a Republican from North Carolina.\nTestimony from Baer, Dennis Lormel, a former head of the FBI’s Financial Crimes Program, and Heather Lowe, a lawyer with Global Financial Integrity, a group that advocates for greater financial transparency, suggested that addressing the issue of beneficial ownership of legal entities would be a good starting point.\nIn May 2016, the U.S. Treasury Department’s AML unit, the Financial Crimes Enforcement Network (FinCEN), issued a rule requiring banks to begin collecting information about beneficial owners. The goal was address longstanding international criticism of the opaqueness of U.S. corporations and their abuse by criminals.\nBut even as Treasury announced that rule( here ), which comes into force in May, it called on Congress \"to pass meaningful legislation that would require companies to know and report adequate and accurate beneficial ownership information\" to Treasury at the time of a company's creation.\nDue to resistance from some states to collecting such information, the latest plan is for Congress to require corporations to provide the information to FinCEN for dissemination to law enforcement and banks. The latter then could meaningfully and efficiently verify the information they collect from customers.\nTo date, Congress has not enacted such a law. However, that may change in the near future, said banking industry sources who suggested there is strong momentum on Capitol Hill to address the issue.\nThe Senate Banking Committee also heard that banks need more latitude to share information, both with one another and internally across borders, and that there must be a better way for law enforcement authorities to share information with banks to allow them to better target criminal activity.\nBy sharing information regarding what criminals are doing, law enforcement can allow the banks to conduct “targeted monitoring for a specific crime problem,” Lormel said. One approach would be to provide security clearance to certain bankers, he said.\n“I’d like to see us carry that over to terrorist financing if we can,” he said.\nEuropean Union privacy laws may, however, stifle any effort to share information across borders, Lowe told the committee.\nThere also was discussion of the need to replace current, rule-based transaction monitoring systems – which generate many so-called “false positive” alerts that waste analysts’ time – with more sophisticated artificial intelligence and machine learning tools that can spot transaction anomalies.\nBut it was clear that while financial institutions are eyeing the new technology both to reduce false positives and avoid filing useless Suspicious Activity Reports, concern about a lack of support from regulators is stifling innovation.\n“There really is a brake on the system in that there is no sense from the bank regulatory agencies that banks are going to be allowed to shift from the old rules-based system… to a new, smarter system,” Baer said.\nDemocratic Senator Mark Warner also called on the committee to take a closer look at the implications of the rise of anonymous digital currencies such as bitcoin for combating money laundering, noting lawmakers needed to “get ahead” of the issue.\n(This article includes material from Reuters News)\n(Brett Wolf is the Senior AML Correspondent for Thomson Reuters Regulatory Intelligence based in St. Louis.)\nThis article was produced by Thomson Reuters Regulatory Intelligence and initially posted on Jan. 10. Regulatory Intelligence provides a single source for regulatory news, analysis, rules and developments, with global coverage of more than 400 regulators and exchanges. Follow Regulatory Intelligence compliance news on Twitter: @thomsonreuters\n ", "external_links": ["https://www.banking.senate.gov/public/index.cfm/hearings?ID=777CC448-B8D5-4DC4-A421-2334AE9A61FD", "http://bit.ly/2BhBAc8", "http://thomsonreuters.com/en/about-us/trust-principles.html", "https://www.treasury.gov/press-center/press-releases/Pages/jl0451.aspx"], "published": "2018-01-20T00:36:00.000+02:00", "crawled": "2018-01-20T17:46:40.000+02:00", "highlightTitle": ""}