{"organizations": [], "uuid": "b6b59b38c6a896ff481d1186509cea6f81be8ddc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104941916-Screen-Shot-2018-01-11-at-5.50.38-PM.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/13/gamer-who-made-swatting-call-over-video-game-dispute-now-facing-manslaughter-charges.html", "country": "US", "domain_rank": 767, "title": "Gamer who made “swatting” call over video game dispute now facing manslaughter charges", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T03:23:00.000+02:00", "replies_count": 0, "uuid": "b6b59b38c6a896ff481d1186509cea6f81be8ddc"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/13/gamer-who-made-swatting-call-over-video-game-dispute-now-facing-manslaughter-charges.html", "ord_in_thread": 0, "title": "Gamer who made “swatting” call over video game dispute now facing manslaughter charges", "locations": [], "entities": {"persons": [{"name": "andrew finch", "sentiment": "none"}, {"name": "barriss", "sentiment": "none"}, {"name": "tyler barriss", "sentiment": "none"}, {"name": "finch", "sentiment": "none"}], "locations": [{"name": "wichita", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "kansas", "sentiment": "none"}], "organizations": [{"name": "washington post", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Source: Call of Duty A man accused of initiating a \" swatting \" incident that resulted in the death of another man halfway across the country has been charged with involuntary manslaughter and interference with law enforcement according to court records made public on Friday. He was also charged accused of making a false alarm, which carries a felony charge.\nOn December 28, 25-year-old Tyler Barriss called police in Wichita, Kansas, falsely claiming he'd shot his father during an argument and was holding two other people hostage in a home there. Barriss, however, was in Los Angeles, and the home he sent the police to in Wichita was where 28-year-old Andrew Finch's mother lived.\nWhen Finch walked out the door to see why the police had shown up, he was shot and killed by an officer. According to the Washington Post , two unnamed gamers were playing Call of Duty: WWII and got into a dispute — one dared the other to swat him, and for some reason provided Finch's address. That gamer contacted Barriss, who made the false call that sent police to Finch, a father of two.\nRead more:\nWhat Serena Williams's scary childbirth story says about medical treatment of black women\nTrump's first full presidential physical exam, explained\n\"Climate change\" and \"global warming\" are disappearing from government websites\nAccording to the Los Angeles Times, police have said they though Finch was armed when he moved his hands toward his waistband and then motioned toward the officers. Barriss has been extradited to Kansas, and his bond has been set at $500,000.\nSwatting is a cruel and dangerous game\nSwatting is a high-stakes prank where someone makes a false police report with the intention of luring law enforcement to the residence of a person who's done something to anger them. The goal is to get police officers and, particularly, a SWAT team, to respond. At best, swatting leads to both law enforcement and intended victim scratching their heads; at worst, innocent people like Finch — who didn't even play video games — die.\nAs streaming has taken off, swatting has become an increasingly common practice among online gamers and internet trolls, with several high profile incidents over the last few years. (In one 2014 episode, a SWAT team entered, raided, and searched a man's office while his webcam was streaming — the camera caught and broadcast the officers throwing the man down to the ground as the room he was in was searched. The footage, predictably, went viral.) Some celebrities have been swatting targets, including Tom Cruise, Justin Bieber, and Chris Brown.\nSource: CNBC Officers ride to a training site near LAX. A couple years ago, Vox's German Lopez explained the rise of swatting in terms of the internet's broader trolling culture:\n…[L]ive streamers have become the main victims of swatting. These are people who stream themselves engaging in some sort of activity, typically a video game, to an online audience. Some people do this as a job: They can collect donations or charge for a subscription. And many do it for fun: They want to show off their gaming skills to others.\nBecause of swatting, though, the fun and games can end with heavily armed police in your living room.\n\"A lot of this swatting stuff happened when it became feasible for people to get paid playing video games,\" Brian Krebs, a longtime cybersecurity journalist, recently told Rolling Stone .\nMashable's Peter Allen Clark wrote in December that Finch's death is a \"terrible, predictable culmination\" of the swatting phenomenon:\nEver since swatting began, it has caused an escalation of violence. We have seen the \"Damn, Daniel\" dude get swatted . A streamer broke down in tears on a livestream after his 10-year-old brother opened the door to a SWAT team. Another man was shot in the face with rubber bullets after getting swatted.\nFinch's death also says something about the dangers of police violence. Lisa Finch, the victim's mother, told a local news outlet soon after her son's death that the police did not give him any warnings. And even if they had, how could anyone anticipate opening the front door and being met with multiple armed officers for no reason?\nSedgwick County District Attorney Marc Bennett told the Los Angeles Times that Barriss' preliminary hearing is tentatively scheduled for January 25 and that other \"potential suspects\" have been identified in the case. He also said prosecutors are reviewing the police officer's decision to shoot Finch. The officer, identified as a seven-year veteran of the department, was placed on leave after the shooting.", "external_links": ["http://fox6now.com/2017/12/31/mother-of-man-shot-killed-by-police-in-swatting-incident-speaks-out-shouldnt-have-happened/", "https://en.wikipedia.org/wiki/Swatting#Other_notable_cases", "http://www.latimes.com/local/lanow/la-me-ln-kansas-swatting-20180112-story.html", "https://www.gamespot.com/articles/swat-team-raids-gamer-s-home-during-twitch-stream/1100-6425178/", "https://www.rollingstone.com/glixel/features/examining-the-spectacle-of-video-games-and-swatting-w515382", "https://www.vox.com/2018/1/11/16863254/trump-physical-exam-mental-health", "http://www.independent.co.uk/news/uk/home-news/robert-mcdaid-charged-tyran-dobbs-swatting-hoax-call-swat-terrorism-maryland-shot-gun-explosives-a7677071.html", "http://mashable.com/2016/02/24/damn-daniel-swatted/", "http://mashable.com/2017/12/29/swatting-death-andrew-finch/#t0Kja3zhEsqr", "https://www.policeone.com/legal/articles/6100791-Lawmakers-to-call-for-stiffer-penalties-to-stop-swatting/", "https://www.vox.com/energy-and-environment/2017/11/9/16619120/trump-administration-removing-climate-change-epa-online-website", "https://www.vox.com/2016/3/11/11196282/what-is-swatting-video", "https://www.washingtonpost.com/news/post-nation/wp/2017/12/30/why-a-twitter-user-claims-to-have-made-the-swatting-call-that-led-police-to-kill-a-man/?utm_term=.849b7ab12dba", "https://www.vox.com/identities/2018/1/11/16879984/serena-williams-childbirth-scare-black-women"], "published": "2018-01-14T03:23:00.000+02:00", "crawled": "2018-01-14T07:25:07.002+02:00", "highlightTitle": ""}