{"organizations": [], "uuid": "b7668465a8f9aaaec0b99f506e513c1a60c171d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219013269&w=1200&r=LYNXMPEE020EO", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/moneygram-intl-m-a/analysis-ants-moneygram-failure-casts-pall-over-chinese-dealmaking-idINKBN1ES0MO", "country": "US", "domain_rank": 408, "title": "Analysis: Ant's MoneyGram failure casts pall over Chinese dealmaking", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T12:02:00.000+02:00", "replies_count": 0, "uuid": "b7668465a8f9aaaec0b99f506e513c1a60c171d6"}, "author": "", "url": "https://in.reuters.com/article/moneygram-intl-m-a/analysis-ants-moneygram-failure-casts-pall-over-chinese-dealmaking-idINKBN1ES0MO", "ord_in_thread": 0, "title": "Analysis: Ant's MoneyGram failure casts pall over Chinese dealmaking", "locations": [], "entities": {"persons": [{"name": "jack ma", "sentiment": "none"}, {"name": "kane wu", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ma", "sentiment": "none"}, {"name": "reuters/heinz-peter bader/files  trump", "sentiment": "none"}, {"name": "jennifer hughes", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "moneygram", "sentiment": "negative"}, {"name": "cfius", "sentiment": "none"}, {"name": "moneygram international inc", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "committee on foreign investment", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG (Reuters) - Last January, Alibaba founder Jack Ma met with Donald Trump, then the U.S. president-elect, to discuss helping one million small U.S businesses access Chinese consumers through the e-commerce giant’s online platform.\nA Moneygram logo is seen outside a bank in Vienna, Austria, June 28, 2016. REUTERS/Heinz-Peter Bader/Files Trump told reporters that he and Ma had a “great meeting” and would do great things together.\nOne year on, however, U.S. security concerns have torpedoed Ma’s plans for a $1.2 billion takeover of the Dallas-based MoneyGram International Inc (MGI.O) by Ant Financial, an Alibaba affiliate.\nIt was the most high-profile Chinese deal yet to fall foul of the Committee on Foreign Investment in the United States (CFIUS) under the Trump administration.\nThe failure has prompted the question among dealmakers: If a Jack Ma-linked company cannot buy a U.S. company, is there hope for other Chinese companies - or should they turn their sights elsewhere?\n“The regulatory uncertainty will certainly make Chinese buyers further head for other countries such as Germany, the UK and Israel for foreign assets,” said one China-focused M&A lawyer at a global law firm, who did not wish to be named because he was not authorised to speak with the media.\nOver the past decade, a quarter of all Chinese bids for U.S. companies by value have been withdrawn, according to Thomson Reuters data. That compares with 15 percent for Asia-Pacific-focused deals and 8 percent in Europe.\nNot all of the withdrawals were due to regulatory factors.\nThe largest was the dropping by the Chinese insurer Anbang of a surprise $15 billion bid for Starwood Hotels in 2016.\nBut U.S. lawmakers - whose biggest rebuff to China was delivered in 2005, when congressional opposition derailed a $19.5 billion bid for Unocal by the Chinese state-owned oil major CNOOC - have once more become an increasing concern for dealmakers.\nA bipartisan group of lawmakers in the U.S. Senate and House of Representatives introduced bills in November to broaden the government’s power to stop foreign purchases of U.S. companies by strengthening CFIUS, amid growing concerns about Chinese efforts to buy U.S. high-tech companies.\nLawmakers are expected to present a new draft of the bills in March or April and “people are pretty confident” that some form of the bills will be passed, according to a China-based lawyer familiar with CFIUS matters.\nA logo of Ant Financial is displayed at the Ant Financial event in Hong Kong, China November 1, 2016. REUTERS/Bobby Yip/Files Rod Hunter, a partner with the Baker McKenzie law firm and a former official with oversight of CFIUS cases under the last Bush administration, said companies needed to take account of the evolving nature of security concerns and the increasing focus on personal data and emerging technologies.\n“CFIUS, by statute, focuses only on national security when reviewing proposed foreign investments, but notions of national security have evolved substantially in recent years,” he said.\nHe added: “From the U.S. government perspective, Chinese investment in the United States is made sensitive by the extensive involvement of the Chinese Communist Party and Chinese government in the economy.”\nAnt and MoneyGram terminated their deal after CFIUS rejected their proposals to address data safety concerns, according to sources familiar with the confidential discussions.\nCHINA ADAPTS The United States has typically attracted relatively little Chinese dealmaking due to a mix of regulatory factors and the fierce competition that foreign buyers face from local players.\nJust 18 percent of Chinese cross-border deals by value over the past decade have had a U.S. target, compared with 36 percent for Europe and 46 percent for Asia-Pacific.\nWhile China dealmakers acknowledged the signal sent by Ant’s MoneyGram failure, most viewed it as a one-off situation.\n“Lots of China’s companies underestimate compliance risk and the complexity of operating in highly regulated U.S. markets, particularly in the finance and fin tech sectors,” said Jeffrey Sun, partner at law firm Orrick, based in Shanghai.\nChinese groups have already begun adapting to the difficulty in getting deals passed. In November, the buyout firm Orient Hontai Capital dropped a $1.4 billion bid for AppLovin, a U.S. mobile marketing group, because of push back from CFIUS. Instead of equity, it opted to lend the group $841 million.\nStill-pending deals include the $2.7 billion bid by Oceanwide Holdings for the insurer Genworth Financial Inc, first announced in October 2016. In November last year the pair agreed to extend the deadline for a second time to April 2018 to allow them to amend the deal terms further to satisfy CFIUS.\nAnother high-profile deal before CFIUS is the purchase by HNA Group of SkyBridge Capital LLC, a hedge fund of funds firm, from Anthony Scaramucci, the Trump administration’s former communications director.\nOthers have begun to focus on smaller minority investments - a route taken by Tencent, Alibaba’s fiercest Chinese rival. The Shenzhen-based group last year bought a 5 percent stake in the U.S. electric car maker Tesla for $1.8 billion.\nReporting by Kane Wu and Jennifer Hughes in Hong Kong; additional reporting by Julie Zhu in Hong Kong and Matthew Miller in Beijing\n ", "external_links": [], "published": "2018-01-03T12:02:00.000+02:00", "crawled": "2018-01-03T12:19:32.012+02:00", "highlightTitle": ""}