{"organizations": [], "uuid": "986acbf7ffbb629e661e924dd05b0b9ef18ac866", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-136799229.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/recession-ai-metoo-ceo-daily-for-january-2-2017/", "country": "US", "domain_rank": 1196, "title": "CEO Daily for January 2, 2017: Recession, AI, #MeToo | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-02T03:17:00.000+02:00", "replies_count": 0, "uuid": "986acbf7ffbb629e661e924dd05b0b9ef18ac866"}, "author": "Alan Murray", "url": "http://fortune.com/2018/01/02/recession-ai-metoo-ceo-daily-for-january-2-2017/", "ord_in_thread": 0, "title": "CEO Daily for January 2, 2017: Recession, AI, #MeToo | Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "golden gate bridge", "sentiment": "none"}, {"name": "american midwest", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "fortune top news", "sentiment": "negative"}, {"name": "wall street journal  oil", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "new york times  caterpillar", "sentiment": "none"}, {"name": "irs", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Top News \nWhen it comes to regulation, no news is good news. \nAt least for U.S. business leaders, who are growing confident in a Trump administration that has pulled back on regulation. Though the link between regulation and positive economic effects is murky at best, a stable business environment is beginning to translate into corporate spending. The New York Times \nCaterpillar is in a $2 billion tax fight with the U.S. \nThe iconic manufacturing company—it had roles in the building of the Hoover Dam and Golden Gate Bridge, among others—ships parts from the American Midwest but lets sales flow through a subsidiary in Geneva, an arrangement in place since 1999. The IRS is investigating and its findings could influence how U.S. companies structure their businesses to lower tax bills. The Wall Street Journal \nOil prices are up, but unrest in Iran grows. \nOil prices posted their strongest opening to a year since 2014. The price of crude rose to mid-2015 highs (above $60 per barrel), driven by anti-government rallies in Iran and supply cuts led by OPEC and Russia. Strong economic growth and falling inventories are expected to support continued strength in the market. Reuters \nNorth Korean hackers are hijacking computers to mine cryptocurrency. \nHow do you find money when the international community won’t let you have it? Take matters into your own hands. A hacking group called Andariel, reportedly acting on behalf of the North Korean government, is believed to have seized a South Korean server to mine Monero, a kind of digital currency. Bloomberg Around the Water Cooler \nGame over in China? \nThe fast-growing mobile games industry has created a lot of wealth—$18 billion in 2017 alone—in a very short time, benefiting major players like Tencent. But industry observers are concerned that this virtual ship is running out of steam after years of extraordinary expansion. The Wall Street Journal \nBitcoin: A bust in its first hours of 2018. \nFor the first time since 2015, the cryptocurrency began a new year sliding rather than soaring—a continuation, to be fair, of a pattern seen since hitting a $19,511 peak on Dec. 18. It’s now trading around $13,624—a sign of, well, who knows for this highly volatile phenomenon. Bloomberg \nTechnology makes it easier for employees to sexually harass each other. \nIn the modern workplace you have access to more details, in real time, about your colleagues’ lives than ever before. That transparency and immediacy is helping companies operate better and faster. It’s also creating new, often mandatory avenues for would-be harassers to work their toxic magic. Financial Times \nAmazon: Everything store, or everything company? \nAre there limits to the number and kind of businesses that Amazon could enter? At its heart the company is a marketplace—a platform for commerce—with a “one size fits all” approach that serves most people. It won’t specialize in a given market, and that’s a hint as to where Amazon might go next. The Wall Street Journal \nThis edition of CEO Daily was edited by Andrew Nusca . Find previous editions here , and sign up for other Fortune newsletters here . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-02T03:17:00.000+02:00", "crawled": "2018-01-02T08:46:57.029+02:00", "highlightTitle": ""}