{"organizations": [], "uuid": "cf32fb0251f8909988cae8f5b986bdff018f1f70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-publicly-funded-new-mexico-spaceport-seeks-confidentiality.html", "country": "US", "domain_rank": 767, "title": "Publicly funded New Mexico spaceport seeks confidentiality", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:35:00.000+02:00", "replies_count": 0, "uuid": "cf32fb0251f8909988cae8f5b986bdff018f1f70"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-publicly-funded-new-mexico-spaceport-seeks-confidentiality.html", "ord_in_thread": 0, "title": "Publicly funded New Mexico spaceport seeks confidentiality", "locations": [], "entities": {"persons": [{"name": "bill richardson", "sentiment": "none"}, {"name": "daniel hicks", "sentiment": "none"}, {"name": "richard branson", "sentiment": "none"}], "locations": [{"name": "new mexico", "sentiment": "none"}, {"name": "spaceport america", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "virgin galactic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA FE, N.M. (AP) — Operators of a taxpayer-funded spacecraft launch facility in New Mexico are seeking greater confidentiality for tenants that include aspiring commercial spaceflight company Virgin Galactic, urging lawmakers to enact exemptions to state open-records laws.\nManagers of the Spaceport America hangar, testing facilities, rocket launch pad and two-mile (3.2-kilometer) runway say greater secrecy provisions are needed to compete for new aerospace-industry tenants against competition from a growing list of government-subsidized launch facilities, from Virginia to Alaska.\nTaxpayers paid for the state-of-the-art, $220 million spaceport after British billionaire Richard Branson and former New Mexico Gov. Bill Richardson, a Democrat, pitched the plan.\nNearly a decade later, unmanned rocket launches are routine at the facility that has yet to live up to full expectations as a hub for human space travel. The Virgin Galactic program was set back years by a midflight failure over California in 2014 that left a test pilot dead.\nDaniel Hicks, state-employed CEO of Spaceport America, said the need for secrecy goes beyond highly technical trade secrets to information about flight dates or infrastructure upgrades that might tip-off competitors. He said two prospective tenants walked away in the past because of privacy concerns. He declined to name the companies.\n\"They want to protect their intellectual capital and some of them have shareholders who are watching,\" Hicks said.\nHe stressed that companies that rely on taxpayer-subsidized infrastructure don't deserve the same scrutiny as government agencies or directly subsidized businesses.\nA bill backed by Republican Gov. Susana Martinez and Democratic Senate President Mary Kay Papen would exempt a variety of spaceport records from the state's Inspection of Public Records Act. An initial committee hearing is scheduled Tuesday.\nUnder the bill as written, any information related to security — such as video footage or visitor logs — would be confidential and exempt from public disclosure. Information about \"cyber-infrastructure\" including data systems also could be withheld.\nSpaceport tenants or \"customers\" would have discretion over any release of information that would affect trade secrets \"or adversely affect proprietary interests of the authority or its customers.\"\nNew Mexico Foundation for Open Government Executive Director Peter St. Cyr says the bill could interfere with appropriate public scrutiny of management and operations at the New Mexico Spaceport Authority that oversees Spaceport America, with implications for public safety and the environment.\n\"We understand the concerns about economic development and making sure the spaceport is competitive,\" he said. \"The bill is too broad. They need to narrow it to trade secrets that would reveal technology or research that gets their booster rockets into space.\"\nHicks said his office is not attempting to escape any public scrutiny. The Spaceport Authority that he runs is seeking a $620,000 increase in state general fund spending for the coming fiscal year, over its current $375,000 allotment.\nLawmakers also are being asked to fund a three-year, $46 million capital outlay project to expand fueling infrastructure, add a processing center for space payloads, create a new aircraft taxiway and more.\nVirgin Galactic Executive Vice President Jonathan Firth said Monday his company is supporting the secrecy bill in the interest of helping the Spaceport Authority attract customers but has no direct stake in the outcome.\n\"We also realize that it has to be done in a responsible way that ensures the spaceport is accountable to New Mexico taxpayers,\" he said.", "external_links": [], "published": "2018-01-29T16:35:00.000+02:00", "crawled": "2018-01-30T08:20:14.009+02:00", "highlightTitle": ""}