{"organizations": [], "uuid": "8691b128acec8f525b148fe4bca171ed72e2de85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223340885&w=1200&r=LYNXMPEE0I0TQ", "site_section": "http://www.whatreallyhappened.com/rss.xml", "section_title": "WHAT REALLY HAPPENED", "url": "https://uk.reuters.com/article/uk-mideast-crisis-iraq-children/1-3-million-children-displaced-by-iraqs-war-with-islamic-state-unicef-idUKKBN1F81GZ", "country": "US", "domain_rank": 408, "title": "1.3 million children displaced by Iraq's war with Islamic State - UNICEF", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T17:07:00.000+02:00", "replies_count": 0, "uuid": "8691b128acec8f525b148fe4bca171ed72e2de85"}, "author": "ladylove", "url": "https://uk.reuters.com/article/uk-mideast-crisis-iraq-children/1-3-million-children-displaced-by-iraqs-war-with-islamic-state-unicef-idUKKBN1F81GZ", "ord_in_thread": 0, "title": "1.3 million children displaced by Iraq's war with Islamic State - UNICEF", "locations": [], "entities": {"persons": [{"name": "islamic sta", "sentiment": "negative"}, {"name": "peter hawkins", "sentiment": "none"}], "locations": [{"name": "iraq", "sentiment": "none"}, {"name": "baghdad", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}], "organizations": [{"name": "unicef", "sentiment": "negative"}, {"name": "islamic state", "sentiment": "negative"}, {"name": "unicef reuters staff", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:20 PM / a day ago 1.3 million children displaced by Iraq's war with Islamic State - UNICEF Reuters Staff 3 Min Read \nGENEVA (Reuters) - About half the 2.6 million people displaced in Iraq after a three-year war with Islamic State militants are children and persisting violence hampers efforts to ease their suffering, the United Nations said on Friday. \nWhile the Baghdad government last month declared victory over Islamic State after wresting back almost all the territory IS seized in 2014, persistent bombing and shooting attacks make it difficult to rebuild the lives of displaced people, according to UNICEF, the U.N. children’s agency. \n“We believe that as a result of the conflict, a lack of investment over the years, and the poverty ... that there are 4 million children now in need across Iraq,” said Peter Hawkins, UNICEF chief representative in the country. \nHe told a Geneva news briefing by telephone from Baghdad that 1.3 million of the 2.6 million displaced by the often devastating fighting with Islamic State were children. \n“While the fighting has come to an end in several areas, spikes of violence continue in others - just this week, three bombings went off in Baghdad,” UNICEF Regional Director Geert Cappelaere said in a statement. \n“Violence is not only killing and maiming children; it is destroying schools, hospitals, homes and roads. It is tearing apart the diverse social fabric and the culture of tolerance that hold communities together.” \nHawkins said UNICEF was also helping children of alleged IS militants now in detention by providing comfort and legal aid, and is trying to reunite those separated from their families, including those abroad. \nThe issue of civilians uprooted from Sunni Muslim areas previously under control of Sunni IS jihadists has become the latest bone of sectarian-tinged political contention in Iraq. \nSunni politicians are lobbying for postponing parliamentary elections due in May to allow the displaced to return to their hometowns to cast their ballots there. \nShi‘ite Muslim politicians including Prime Minister Haider al-Abadi insist on the vote taking place as planned on May 12. \nThe United States called on Thursday for the elections to be held on time, saying that delaying them “set a dangerous precedent, undermining the constitution and damaging Iraq’s long-term democratic development”. Reporting by Stephanie Nebehay in Geneva; writing by Maher Chmaytelli in Baghdad; editing by Mark Heinrich", "external_links": [], "published": "2018-01-20T17:07:00.000+02:00", "crawled": "2018-01-20T17:17:36.026+02:00", "highlightTitle": ""}