{"organizations": [], "uuid": "c34498a04401607e2e6e353950f220867d544d6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-sunbelt-business-advisors-expands-ma-services.html", "country": "US", "domain_rank": 767, "title": "Sunbelt Business Advisors Expands M&A Services", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.091, "site_type": "news", "published": "2018-01-09T16:10:00.000+02:00", "replies_count": 0, "uuid": "c34498a04401607e2e6e353950f220867d544d6d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-sunbelt-business-advisors-expands-ma-services.html", "ord_in_thread": 0, "title": "Sunbelt Business Advisors Expands M&A Services", "locations": [], "entities": {"persons": [{"name": "dawn clarke", "sentiment": "none"}, {"name": "william ludwig", "sentiment": "none"}], "locations": [{"name": "acquirea", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "sunbelt business advisors", "sentiment": "negative"}, {"name": "sunbelt business advisors expands m&a services", "sentiment": "negative"}, {"name": "acquireandgrow.com", "sentiment": "none"}, {"name": "sunbelt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 9, 2018 /PRNewswire/ -- Sunbelt Business Advisors announced the launch of AcquireandGrow.com , a new site dedicated to serve the firm's increased demand for growth through acquisition services. AcquireandGrow.com is part of a major new initiative to expand services for companies pursuing growth through acquisition. As part of this initiative, Sunbelt has named executives Dawn Clarke and William Ludwig as Directors of Strategic Acquisitions to help drive the company's focus on buy-side transactions.\n\"Designing and orchestrating a strategy that helps you determine what to buy, how much to pay and how to structure the transaction requires a significant time commitment and a disciplined approach,\" says Dawn Clarke of Sunbelt. \"We conduct market research, identify and contact the decision makers from a list of the highest fit acquisition candidates, which we develop on our client's behalf that fit their specified acquisition criteria. We develop all necessary materials in connection with executing the search, court all interested sellers, assist negotiations, help structure offers, facilitate due diligence, and quarterback the closing process alongside our client's leadership team and legal advisors.\"\nBoth Clarke and Ludwig have led and played integral roles in both sell- and buy-side acquisition engagements and have a history of successfully closing transactions for clients within a variety of industries. Clarke and Ludwig will collaborate with an experienced Sunbelt team to help identify and close strategic acquisitions for their clients.\nSunbelt Business Advisors recently reported a record-breaking year in 2017, including the highest volume of acquisition inquiries and buy-side engagements in the history of the firm, aligning with national trends in small to mid-market mergers and acquisition activity. According to a 2017 second quarter MarketPulse report, more than 60% of firms with revenues between and five and fifty million are growing primarily through acquisition.\n\"It is important to make sure strategy drives your acquisition as opposed to the acquisition driving your strategy,\" says Sunbelt's William Ludwig.\nSunbelt Business Advisors recently acted as the advisor for Smead Manufacturing Company, a global leader in office products based in Hastings, Minnesota, with a strategic investment in California-based innovator U-Brands.\nAbout Acquire and Grow: Acquire and Grow is a major new initiative of Sunbelt Business Advisors to help companies define their acquisition strategies, and to manage all the intricacies of the growth through acquisition process, from search to close.\nFor more information visit http://www.acquireandgrow.com /\nAbout Sunbelt ® - Sunbelt ® is the world's largest business brokerage company and sells more companies than any other firm in the world. Founded in 1978 Sunbelt now has 200 offices worldwide helping people buy and sell businesses.\nFor more information visit http://www.sunbeltmidwest.com/\nView original content: http://www.prnewswire.com/news-releases/sunbelt-business-advisors-expands-ma-services-300579468.html\nSOURCE Sunbelt Business Advisors", "external_links": ["http://www.prnewswire.com/news-releases/sunbelt-business-advisors-expands-ma-services-300579468.html", "http://www.sunbeltmidwest.com/", "http://www.acquireandgrow.com/"], "published": "2018-01-09T16:10:00.000+02:00", "crawled": "2018-01-09T17:55:40.000+02:00", "highlightTitle": ""}