{"organizations": [], "uuid": "6014f90644b00aaa6461579b45ba92db5f30879b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/13/103937601-20160913-9014-2265.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19794221/device/rss/rss.html", "section_title": "Europe News", "url": "https://www.cnbc.com/2018/01/25/blackstone-ceo-schwarzman-saudi-arabia-reforms-are-extraordinary.html", "country": "US", "domain_rank": 767, "title": "Blackstone CEO Schwarzman: Saudi Arabia reforms are 'extraordinary'", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:20:00.000+02:00", "replies_count": 0, "uuid": "6014f90644b00aaa6461579b45ba92db5f30879b"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/25/blackstone-ceo-schwarzman-saudi-arabia-reforms-are-extraordinary.html", "ord_in_thread": 0, "title": "Blackstone CEO Schwarzman: Saudi Arabia reforms are 'extraordinary'", "locations": [], "entities": {"persons": [{"name": "schwarzman", "sentiment": "negative"}, {"name": "stephen sch", "sentiment": "negative"}, {"name": "mohamed bin salman", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "blackstone group", "sentiment": "negative"}, {"name": "blackstone", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The reform efforts underway in Saudi Arabia are extremely positive, Blackstone Group CEO Stephen Schwarzman said Thursday.\nSpeaking at a CNBC-hosted panel at the World Economic Forum (WEF) in Davos, Switzerland, Schwarzman added that change in the kingdom is occuring at a rapid rate.\n\"It's sort of extraordinary what's going on in Saudi Arabia... you see economic growth and other good things happen when you have intelligent, informed, reform-oriented governments,\" he said. \"As an outsider, this is like a case study. And it's happening so fast and is so bold.\"\nThe private equity billionaire was referencing Vision 2030, the Saudi government's state-led initiative to diversify its economy away from oil, invest in innovative industries and create new jobs for a fast-growing youth population. Its details were first announced by Prince Mohamed Bin Salman, the 32-year-old defacto leader who has pledged to transform his conservative kingdom's culture and economy.\nThe extent to which efforts to attract foreign investment and create private sector jobs will be successful has yet to be seen. Vision 2030 encourages growth in sectors like entertainment and tourism, which could prove challenging given the society's highly conservative Islamic laws and values. Its implementation has \"repeatedly fallen short\" of ambitious targets, according to Chatham House, a London-based international affairs think-tank.\nStill, for Schwarzman, the fact that there are targets at all is promising.\n\"All the things being put in place are things that you find in best practices in other parts of the world that weren't here at all. All of a sudden, they'll be there,\" he said.\n\"It's orderly, but it is a rush to enter the 21st century and position the country to diversify away from oil. And we've got a population where 70 percent of it is below the age of 30. This is a massive challenge.\"\n\"So the government push to diversify its economy... they're going for it.\"\nReza | Getty Images An worker on offshore oil rig 'Marjan 2' in March 2003, located in the Persian Gulf, Saudi Arabia. Oil accounts for around 92 percent of Saudi government revenues, 97 percent of export earnings and just over half of GDP.\n\"On the other hand, they have to provide a livelihood for that 70 percent of the people and it's not sitting around and watching somebody pump something,\" Schwarzman said. \"So part of the 2030 vision is developing industries, broadening an economic base, and making sure that younger people have confidence in the future and a place to go.\"\nThe traditionally predictable kingdom is increasingly in the international spotlight. Bin Salman's decisions, often described by outsiders as impulsive and unpredictable, have already rocked parts of the country and region.\nLifting the driving ban on women, arresting wealthy Saudis in an anti-corruption campaign, and leading a brutal bombing campaign against rebels in Yemen are just a few of the moves that have garnered him both praise and revilement around the world.", "external_links": [], "published": "2018-01-25T17:20:00.000+02:00", "crawled": "2018-01-25T18:00:30.005+02:00", "highlightTitle": ""}