{"organizations": [], "uuid": "b625d8a55dbbb387121adef9c0de9367ae605422", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-youcaring-enters-exclusive-long-term-partnership-with-indiegogo-for-charitable-fundraising-and-acquires-generosity-com.html", "country": "US", "domain_rank": 767, "title": "YouCaring Enters Exclusive Long-Term Partnership with Indiegogo for Charitable Fundraising and Acquires Generosity.com", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T18:34:00.000+02:00", "replies_count": 0, "uuid": "b625d8a55dbbb387121adef9c0de9367ae605422"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-youcaring-enters-exclusive-long-term-partnership-with-indiegogo-for-charitable-fundraising-and-acquires-generosity-com.html", "ord_in_thread": 0, "title": "YouCaring Enters Exclusive Long-Term Partnership with Indiegogo for Charitable Fundraising and Acquires Generosity.com", "locations": [], "entities": {"persons": [{"name": "dan saper", "sentiment": "none"}, {"name": "indiegogo", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "indiegogo", "sentiment": "none"}], "organizations": [{"name": "indiegogo life", "sentiment": "none"}, {"name": "indiegogo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 25, 2018 /PRNewswire/ -- YouCaring , the world's trusted leader in free crowdfunding for personal, medical, and charitable causes, and Indiegogo, entrepreneurs to move their ideas quickly from concept to market, today announced that they have entered a long-term agreement for YouCaring to become the company's exclusive charitable crowdfunding partner. As part of the partnership, YouCaring has acquired Indiegogo's personal crowdfunding service, Generosity.com , and Indiegogo will become YouCaring's partner for entrepreneurial fundraising.\nYouCaring also announced that it has raised over $1 billion to date for medical and charitable causes from more than ten million donors around the world, to which it now adds the almost $100 million raised by Generosity.com (known as Indiegogo Life when it launched in 2014).\n\"With this partnership, YouCaring is becoming the go-to platform for personal, medical, and charitable crowdfunding,\" said, YouCaring CEO Dan Saper. \"We pioneered free online crowdfunding for personal causes when we launched in 2011, and we will always be free for our members. Our core focus is providing financial, social, and emotional relief to people facing hardship.\"\nIn 2017, YouCaring acquired GiveForward , one of the top crowdfunding platforms for medical causes. YouCaring's exponential growth this past year was fueled by Americans' increasing need for financial support from their communities. Squeezed between ballooning medical costs and reduced government support for healthcare, Americans rely more than ever on crowdfunding to cover expenses for unexpected life events and illnesses. Campaigns that raise money to cover medical expenses make up the largest and fastest-growing category of fundraisers on YouCaring.\n\"We're thrilled to partner with YouCaring and we think this is a great solution for our users who are looking to fundraise for a personal cause,\" said David Mandelbrot, Indiegogo's CEO. \"We're proud to join forces with such a trusted brand in charitable crowdfunding, while enabling us to continue to focus on best serving the rapidly growing number of entrepreneurs that use Indiegogo to launch a business.\"\nBeginning February 1, Indiegogo and YouCaring will integrate their charitable crowdfunding experiences. New fundraisers will launch on YouCaring and benefit from YouCaring's real-time support, while existing Generosity.com fundraisers will be able to continue collecting donations on the platform through March 2018.\nAbout YouCaring\nYouCaring, currently the home of the largest crowdfunding campaign in history, JJ Watt's Houston Relief Fund, has been the trusted leader in free online crowdfunding since 2011. With a focus on Compassionate Crowdfunding™, YouCaring believes no one should have to face hardship alone. Our members have raised over $1 billion in support of personal, medical, and charitable causes. Unlike other crowdfunding sites, YouCaring does not charge fundraisers a fee and relies on voluntary contributions from donors to fund operations. As a Certified B Corporation ® , YouCaring is committed to consumer advocacy and advancing social good.\nAbout Indiegogo\nIndiegogo was created to empower people to unite around the innovative ideas that inspire them, and together make those ideas come to life. It is the place to discover clever and unique innovations in tech and design before they go mainstream, including hundreds of products shipping right away. With thousands of campaigns launching every week, there's ingenious tech, creative design, and much more around every corner —often with special pricing for early backers as well as investment opportunities. The company was launched in 2008 and is headquartered in San Francisco, with offices in New York and Los Angeles. For more information, visit Indiegogo.com and follow us at Twitter.com/indiegogo and Facebook.com/indiegogo .\nPress Contact:\nCamelia Gendreau\ncamelia@youcaring.com\n415 686 2120\nView original content with multimedia: http://www.prnewswire.com/news-releases/youcaring-enters-exclusive-long-term-partnership-with-indiegogo-for-charitable-fundraising-and-acquires-generositycom-300588296.html\nSOURCE YouCaring", "external_links": ["http://Twitter.com/indiegogo", "http://Facebook.com/indiegogo", "http://www.youcaring.com/", "http://www.prnewswire.com/news-releases/youcaring-enters-exclusive-long-term-partnership-with-indiegogo-for-charitable-fundraising-and-acquires-generositycom-300588296.html", "https://www.prnewswire.com/news-releases/youcaring-acquires-giveforward-to-expand-the-reach-of-the-worlds-leading-free-crowdfunding-platform-300430871.html", "http://go.youcaring.com/2017-state-of-compassion/?utm_source=prnewswire&utm_medium=referral&utm_content=press-release&utm_campaign=state-of-compassion"], "published": "2018-01-25T18:34:00.000+02:00", "crawled": "2018-01-25T20:50:20.010+02:00", "highlightTitle": ""}