{"organizations": [], "uuid": "df222537997fa7038e9a68dd80f91d5691016bd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-peoples-bancorp-inc-announces-4th-quarter-earnings-and-record-full-year-net-income-for-2017.html", "country": "US", "domain_rank": 767, "title": "Peoples Bancorp Inc. Announces 4th Quarter Earnings And Record Full Year Net Income For 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.903, "site_type": "news", "published": "2018-01-23T16:02:00.000+02:00", "replies_count": 0, "uuid": "df222537997fa7038e9a68dd80f91d5691016bd1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-peoples-bancorp-inc-announces-4th-quarter-earnings-and-record-full-year-net-income-for-2017.html", "ord_in_thread": 0, "title": "Peoples Bancorp Inc. Announces 4th Quarter Earnings And Record Full Year Net Income For 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "marietta", "sentiment": "negative"}, {"name": "peoples bancorp inc.", "sentiment": "negative"}, {"name": "peoples bancorp inc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MARIETTA, Ohio, Jan. 23, 2018 /PRNewswire/ -- Peoples Bancorp Inc. (\"Peoples\") (NASDAQ: PEBO) today announced results for the quarter and year ended December 31, 2017. Net income totaled $9.0 million for the fourth quarter of 2017, representing earnings per diluted common share of $0.49. During the fourth quarter of 2017, certain non-recurring items impacted earnings per diluted common share. Earnings per diluted common share for the fourth quarter of 2017 were positively impacted by $0.03 due to a gain on the sale of bank equity investment securities, and negatively impacted by $0.02 due to non-core charges and $0.05 due to the recently enacted Tax Cuts and Jobs Act. In comparison, earnings per diluted common share were $0.60 for the third quarter of 2017 and $0.41 for the fourth quarter of 2016. For the full year, net income was $38.5 million in 2017 versus $31.2 million in 2016, representing earnings per diluted common share of $2.10 and $1.71, respectively. Earnings per diluted common share for the full year of 2017 were positively impacted by $0.10 due to gains on sales of bank equity investment securities, and negatively impacted by $0.02 due to non-core charges and $0.05 due to the recently enacted Tax Cuts and Jobs Act.\n\"We continued to build on the momentum from 2016. We were able to generate positive operating leverage, loan growth, and improved asset quality metrics, while achieving an efficiency ratio below 63% during 2017, an improvement of nearly 300 basis points from the prior year,\" said Chuck Sulerzyski, President and Chief Executive Officer. \"We were able to reap the benefits of our prior investments in people, facilities and systems. We completed the acquisition of a property and casualty focused independent insurance agency during 2017 and announced a pending bank merger that is expected to close during the second quarter of 2018. We are pleased with our accomplishments for the year, and will continue to focus on our clients and communities, while remaining committed to continual improvement throughout 2018.\"\nAs previously announced, on October 23, 2017, Peoples entered into a merger agreement with ASB Financial Corp. (\"ASB\") that calls for ASB to merge into Peoples, and for ASB's wholly-owned subsidiary, American Savings Bank, fsb, which operates six full service bank branches and two loan production offices located in southern Ohio and northern Kentucky, to merge into Peoples Bank. This transaction is expected to close during the second quarter of 2018, subject to the satisfaction of customary closing conditions, including regulatory approvals and the approval of the shareholders of ASB. As of September 30, 2017, ASB had approximately $292.6 million in total assets, which included approximately $247.5 million in net loans, and approximately $205.9 million in total deposits.\nStatement of Operations Highlights:\nNet interest income for the fourth quarter of 2017 was essentially flat compared to the third quarter of 2017, and grew 9% compared to the fourth quarter of 2016, while increasing 8% for the full year of 2017. Net interest margin was 3.63% for the fourth quarter of 2017, compared to 3.67% for the linked quarter, and 3.54% for the fourth quarter of 2016. The third quarter of 2017 benefited from proceeds received on an investment security that had previously been written down due to an other-than-temporary impairment, which added 8 basis points to net interest margin. Provision for loan losses was $1.1 million for the fourth quarter and $3.8 million for the full year of 2017. Total fee-based income increased 4% during the fourth quarter of 2017 compared to the third quarter of 2017 and 8% compared to the fourth quarter of 2016, while increasing 3% for the full year of 2017. Fee-based income benefited from growth in trust and investment income throughout the year, which was up 8% for the fourth quarter of 2017 compared to the linked quarter, 12% compared to the fourth quarter of 2016 and 9% for the full year of 2017 compared to the full year of 2016. For the full year of 2017, fee-based income was 32% of total revenue, down from 33% for the full year of 2016, primarily due to increased net interest income, driven by loan growth and increasing interest rates. Total non-interest expense for the fourth quarter of 2017 was up 3% compared to the linked quarter and relatively flat compared to the fourth quarter of 2016, while increasing 1% for the full year of 2017. The increase compared to the third quarter of 2017 was primarily attributable to $583,000 of non-core charges that were recognized during the fourth quarter of 2017, including acquisition-related costs and a pension settlement charge. The efficiency ratio was 62.1% for the fourth quarter of 2017, compared to 60.7% for the third quarter of 2017 and 66.9% for the fourth quarter of 2016. For the full year, the efficiency ratio was 62.2% in 2017 compared to 65.1% in 2016. Operating leverage was positive for the fourth quarter of 2017 compared to the fourth quarter of 2016, and for the full year of 2017 compared to the full year of 2016. Compared to the full year of 2016, revenue for 2017 was up 6%, while expenses grew 1%. Income tax expense during the fourth quarter of 2017 was impacted by an $897,000 write down of net deferred tax assets in connection with recent tax law changes. The write down of net deferred tax assets was within the range previously disclosed on January 9, 2018.\nBalance Sheet Highlights:\nAverage loan balances for the full year of 2017 grew 8% from 2016, while period-end loan balances grew 5% on an annualized basis compared to the end of the linked quarter. Commercial loan balances grew $37.5 million, or 11% annualized, during the fourth quarter of 2017, and $95.5 million, or 8%, for the full year of 2017. Indirect consumer loans grew $4.9 million, or 6% annualized, during the fourth quarter of 2017, and $87.9 million, or 35%, for the full year of 2017. Asset quality metrics improved during the quarter and for the full year. Nonperforming assets decreased to 0.74% of total loans and other real estate owned (\"OREO\") at December 31, 2017, compared to 0.86% at September 30, 2017, and 1.16% at December 31, 2016. Nonperforming assets at December 31, 2017 decreased 13%, compared to September 30, 2017, and were down 32% compared to December 31, 2016. Allowance for loan losses as a percent of total loans was 0.80% at December 31, 2017, compared to 0.82% at September 30, 2017 and 0.83% at December 31, 2016. Period-end total deposit balances at December 31, 2017 increased $65.6 million compared to September 30, 2017, or 10% on an annualized basis, and $220.6 million, or 9%, compared to December 31, 2016. Average deposits for the full year of 2017 grew 4% from 2016. Total demand deposit balances were 42% of total deposits at December 31, 2017 and September 30, 2017, compared to 40% at December 31, 2016.\nNet Interest Income\nNet interest income was $29.1 million for the fourth quarter of 2017, essentially flat compared to the linked quarter, and up 9% from the fourth quarter of 2016. Net interest margin was 3.63% for the fourth quarter of 2017, compared to 3.67% for the third quarter of 2017, and 3.54% for the fourth quarter of 2016. Net interest income increased 8% to $113.4 million for the year, while net interest margin grew from 3.54% to 3.62%. The increases in net interest income compared to the prior year quarterly period and the full year were largely attributable to loan growth and increasing interest rates. The linked quarter benefited from proceeds of $611,000 received on an investment security that had been previously written down due to an other-than-temporary impairment, which added 8 basis points to the net interest margin for the third quarter of 2017. For the full year of 2017, proceeds received on investment securities that had previously been written down totaled $814,000, adding 3 basis points to net interest margin.\nThe accretion income, net of amortization expense, from acquisitions was $715,000 for the fourth quarter of 2017, compared to $816,000 for the third quarter of 2017 and $874,000 for the fourth quarter of 2016, which added 8 basis points, 10 basis points and 11 basis points, respectively, to net interest margin. For the full year of 2017, accretion income, net of amortization expense, from acquisitions was $3.1 million, compared to $3.5 million in 2016, and added 10 basis points and 11 basis points, respectively, to net interest margin.\nProvision for Loan Losses:\nThe provision for loan losses was $1.1 million for both the fourth quarter and the third quarter of 2017, compared to $0.7 million for the fourth quarter of 2016. Loan growth was the primary contributor to the increase in the provision for loan losses, and was offset by improvements in asset quality metrics compared to the third quarter of 2017. For the full year of 2017, provision for loan losses was $3.8 million, compared to $3.5 million for 2016, and was driven by loan growth.\nTotal Fee-Based Income:\nTotal fee-based income for the fourth quarter of 2017 increased $0.5 million, or 4%, compared to the linked quarter, and $1.0 million, or 8%, compared to the fourth quarter of 2016. The increase compared to the third quarter of 2017 was primarily attributable to increases in trust and investment income, commercial loan swap fee income, and electronic banking income. The increase compared to the fourth quarter of 2016 was largely due to higher insurance income, trust and investment income, electronic banking income, and commercial loan swap fee income. Trust and investment income benefited from increased fiduciary and brokerage income during the quarter due largely to growth in assets under administration and management, as well as annual fees received for the administration of employee benefit plans. Commercial loan swap fee income is dependent upon customer demand, and was up $161,000 in the fourth quarter of 2017 compared to the linked quarter, and $158,000 compared to the fourth quarter of 2016. Insurance income was up compared to the fourth quarter of 2016 primarily due to increased property and casualty insurance commission income.\nFor the full year of 2017, total fee-based income increased $1.6 million, or 3%, compared to 2016. The increase was primarily attributable to increases in trust and investment income, mortgage banking income, and bank owned life insurance income, partially offset by a decrease in deposit account service charges. The increase in trust and investment income was due largely to growth in assets under administration and management. Mortgage banking income increased due to customer demand. The increase in bank owned life insurance income was the result of the additional $35 million of bank owned life insurance policies that were purchased late in the second quarter of 2016, for which a full year of income was recognized in 2017.\nTotal Non-interest Expense:\nTotal non-interest expense for the fourth quarter of 2017 was $27.4 million, compared to $26.6 million for the third quarter of 2017, and $27.3 million for the fourth quarter of 2016. The increase compared to the linked quarter was due primarily to non-core charges and an increase in professional fees. Compared to the fourth quarter of 2016, total non-interest expense was relatively flat in the fourth quarter of 2017, as increases in Federal Deposit Insurance Corporation (\"FDIC\") insurance expense and marketing expense were offset by decreases in communications expense, professional fees, and data processing and software expense.\nTotal non-interest expense, adjusted for non-core charges, was up $265,000 compared to the linked quarter and $287,000 compared to the fourth quarter of 2016. In the fourth quarter of 2017, Peoples recognized $341,000 of acquisition-related costs and a $242,000 pension settlement charge. In the fourth quarter of 2016, Peoples incurred $746,000 of non-core charges related to the upgrade of Peoples' core banking systems.\nFor the full year of 2017, total non-interest expense was up $1.0 million, or 1%, compared to 2016, primarily due to higher salaries and employee benefits costs, and data processing and software costs. The increase in salaries and employee benefits costs was largely due to higher incentive compensation, which was tied to corporate performance for 2017, coupled with increased medical insurance costs and pension settlement charges recognized. These increases were partially offset by declines in professional fees, communications expense, and amortization of other intangible assets.\nTotal non-interest expense, adjusted for non-core charges, was up $1.7 million for the full year of 2017 compared to the full year of 2016 as charges related to the upgrade of Peoples' core banking system of $1.3 million in 2016 exceeded aggregate non-core charges of $583,000 in 2017, all of which were recognized during the fourth quarter of 2017.\nThe efficiency ratio for the fourth quarter of 2017 was 62.1%, compared to 60.7% for the linked quarter and 66.9% for the fourth quarter of 2016. The increase in the efficiency ratio compared to the linked quarter was largely the result of non-core charges. The efficiency ratio, when adjusted for non-core items, was 60.7% for both the fourth quarter and third quarter of 2017, and was 64.8% for the fourth quarter of 2016.\nFor the full year of 2017, the efficiency ratio was 62.2% compared to 65.1% in 2016. The decrease in the efficiency ratio in 2017 compared to 2016 was the result of increases in both net interest income and fee-based income, as well as continued control over expenses. When adjusted for non-core items, the efficiency ratio for the full year of 2017 was 61.9%, compared to 64.3% in 2016.\nLoans:\nPeriod-end total loan balances at December 31, 2017 increased $30.1 million, or 5% annualized, compared to September 30, 2017. Commercial lending was a key component of loan growth, as commercial loan balances increased $37.5 million, or 11% annualized, during the quarter, with commercial and industrial loans growing $28.6 million, or 26% annualized. Indirect consumer lending also contributed to the increase, as indirect consumer loan balances grew $4.9 million, or 6% annualized, during the quarter, which partially offset decreases in other consumer lending categories. During the fourth quarter of 2017, growth in loan balances was partially offset by payoffs of certain criticized loans.\nCompared to December 31, 2016, period-end loan balances at December 31, 2017 increased $132.2 million, or 6%. The increase was primarily the result of commercial loan growth of $95.5 million, or 8%, which was almost evenly split between commercial real estate and commercial and industrial loan balances. From a bank regulatory perspective, non-owner-occupied commercial real estate loan balances as of December 31, 2017 remained well below the financial institutions regulators' guidance of 300% of total risk-based capital. The ratio at December 31, 2017 of non-owner-occupied commercial real estate loans to total risk-based capital was 159%, compared to 161% at September 30, 2017, and 155% at December 31, 2016. Indirect consumer lending also contributed loan growth of $87.9 million, or 35%, compared to December 31, 2016, and was partially offset by reductions in residential real estate loans. At December 31, 2017 and September 30, 2017, indirect consumer loan balances comprised 14% of the total loan portfolio, compared to 11% at December 31, 2016.\nQuarterly average gross loan balances increased $22.7 million, or 4% annualized, compared to the linked quarter. Commercial loans provided $18.3 million of growth compared to the third quarter of 2017, while consumer indirect loans grew $16.5 million, partially offset by an $11.6 million decline in residential real estate loans. Quarterly average gross loan balances for the three months ended December 31, 2017 increased 7% compared to the same period in 2016, with commercial loan growth of $114.6 million, and consumer indirect loan growth of $97.3 million. For the full year of 2017, average gross loan balances increased 8% compared to the full year of 2016, with the growth being almost evenly divided between commercial loans and consumer indirect loans.\nAsset Quality:\nAsset quality metrics improved during the fourth quarter of 2017. Nonperforming assets as a percent of total loans and OREO was 0.74% at December 31, 2017, compared to 0.86% at September 30, 2017 and 1.16% at December 31, 2016. At December 31, 2017, nonperforming assets had declined 13% from September 30, 2017, and 32% from December 31, 2016.\nAnnualized net charge-offs were 0.22% of average gross loans during the fourth quarter of 2017, compared to 0.16% in the linked quarter and 0.09% in the fourth quarter of 2016. The higher net charge-off rate during the fourth quarter of 2017 was primarily related to the partial charge-off of a single commercial real estate loan relationship. For the full year of 2017, net charge-offs were 0.15% of average gross loans, compared to 0.09% for the full year of 2016.\nCriticized loans, which are those categorized as special mention, substandard or doubtful, decreased $6.3 million, or 7%, compared to September 30, 2017, and $8.8 million, or 9%, compared to December 31, 2016. Classified loans, which are those categorized as substandard or doubtful, increased $5.1 million, or 12%, compared to September 30, 2017 and declined $11.4 million, or 20%, compared to December 31, 2016. The increase in classified loans compared to the end of the linked quarter was mostly due to one large commercial loan relationship that was downgraded during the fourth quarter. As a percent of total loans, classified loans were 1.97% at December 31, 2017, compared to 1.77% at September 30, 2017, and 2.59% at December 31, 2016. Criticized loans were 3.83% of total loans at December 31, 2017, compared to 4.15% at September 30, 2017 and 4.46% at December 31, 2016.\nAt December 31, 2017, the allowance for loan losses was $18.8 million, compared to $19.0 million at September 30, 2017, and $18.4 million at December 31, 2016. The ratio of the allowance for loan losses as a percent of total loans was 0.80% at December 31, 2017, compared to 0.82% at September 30, 2017, and 0.83% at December 31, 2016. The ratio includes total acquired loans of $414.8 million and allowance for acquired loan losses of $0.1 million at December 31, 2017. The reductions in the ratio were due largely to continued improvement in asset quality metrics.\nDeposits:\nIn the third quarter of 2017, Peoples announced a new consumer checking account product suite to its customers. The migration of customer accounts began late in the third quarter of 2017 and was completed early in the fourth quarter, creating a shift of accounts from non-interest-bearing to interest-bearing demand deposit accounts.\nAs of December 31, 2017, period-end deposits increased $65.6 million, or 10% annualized, compared to September 30, 2017, and increased $220.6 million, or 9%, compared to December 31, 2016. The increase compared to September 30, 2017 was primarily attributable to a $66.6 million increase in brokered certificates of deposit, and a $40.3 million increase in demand deposit accounts, partially offset by a $25.4 million decrease in governmental deposit accounts and a $17.5 million decrease in money market deposit accounts. The increase compared to December 31, 2016 was largely due to a $119.5 million increase in brokered certificates of deposit, and a $136.0 million increase in demand deposit accounts.\nAverage deposits for the fourth quarter of 2017 increased $44.2 million, or 2%, compared to the linked quarter, which was largely attributable to increases of $58.8 million in demand deposit accounts and $31.6 million in brokered certificates of deposit, offset by reductions of $28.2 million in governmental deposit accounts and $11.5 million in money market deposit accounts. Compared to the fourth quarter of 2016, average deposits increased $168.7 million, or 7%, largely due to increases of $116.6 million in demand deposit accounts and $100.2 million in brokered certificates of deposit, offset by reductions of $33.2 million in retail certificates of deposit and $29.3 million in money market deposit accounts.\nFor the full year of 2017, average deposits increased $101.0 million, or 4%, compared to the full year of 2016. The increase was largely attributable to increases of $106.9 million in interest-bearing demand deposits and $57.2 million in brokered certificates of deposit, offset by decreases of $48.0 million in retail certificates of deposit and $11.8 million in money market deposit accounts.\nTotal demand deposit accounts comprised 42% of total deposits at both December 31, 2017 and September 30, 2017, compared to 40% at December 31, 2016.\nStockholders' Equity:\nAt December 31, 2017, the tier 1 risk-based capital ratio was 13.70%, compared to 13.60% at September 30, 2017 and 13.21% at December 31, 2016. The common equity tier 1 risk-based capital ratio was 13.41% at December 31, 2017, compared to 13.31% at September 30, 2017 and 12.91% at December 31, 2016. The total risk-based capital ratio was 14.58% at December 31, 2017, compared to 14.49% at September 30, 2017 and 14.11% at December 31, 2016. The improvement in these capital ratios compared to the end of the linked quarter was due primarily to increased earnings, which was largely driven by loan growth.\nPeoples' capital position remained strong at December 31, 2017. The book value per share was $25.08 at December 31, 2017, compared to $25.02 at September 30, 2017 and $23.92 at December 31, 2016. The tangible book value per share was $17.17 at December 31, 2017, compared to $17.15 at September 30, 2017 and $15.89 at December 31, 2016. The tangible equity to tangible assets ratio was 9.14% at December 31, 2017, compared to 9.20% at September 30, 2017 and 8.80% at December 31, 2016.\nPeoples Bancorp Inc. is a diversified financial services holding company with $3.6 billion in total assets, 74 locations, including 65 full-service bank branches, and 71 ATMs in Ohio, West Virginia and Kentucky. Peoples makes available a complete line of banking, investment, insurance and trust solutions through its subsidiaries - Peoples Bank and Peoples Insurance Agency, LLC. Peoples' common shares are traded on the NASDAQ Global Select Market® under the symbol \"PEBO\", and Peoples is a member of the Russell 3000 index of U.S. publicly-traded companies. Learn more about Peoples at www.peoplesbancorp.com .\nConference Call to Discuss Earnings:\nPeoples will conduct a facilitated conference call to discuss fourth quarter and full year 2017 results of operations today at 11:00 a.m., Eastern Standard Time, with members of Peoples' executive management participating. Analysts, media and individual investors are invited to participate in the conference call by calling (866) 890-9285. A simultaneous webcast of the conference call audio will be available online via the \"Investor Relations\" section of Peoples' website, www.peoplesbancorp.com . Participants are encouraged to call or sign in at least 15 minutes prior to the scheduled conference call time to ensure participation and, if required, to download and install the necessary software. A replay of the call will be available on Peoples' website in the \"Investor Relations\" section for one year.\nUse of Non-GAAP Financial Measures:\nThis news release contains financial information and performance measures determined by methods other than in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"). Management uses these \"non-GAAP\" financial measures in its analysis of Peoples' performance and the efficiency of its operations. Management believes that these non-GAAP measures provide a greater understanding of ongoing operations and enhance comparability of results with prior periods and peers. These disclosures should not be viewed as substitutes for financial measures determined in accordance with GAAP, nor are they necessarily comparable to non-GAAP performance measures that may be presented by other companies. Below is a listing of the non-GAAP measures used in this news release:\nCore non-interest income is non-GAAP since it excludes the impact of revenue waived related to the system upgrade of Peoples' core banking system. Core non-interest expenses are non-GAAP since they exclude the impact of items such as costs associated with the system upgrade of Peoples core banking system, acquisition-related costs and pension settlement charges. Efficiency ratio is calculated as total non-interest expense (less amortization of other intangible assets) as a percentage of fully tax-equivalent net interest income plus total fee-based income. This measure is non-GAAP since it excludes amortization of other intangible assets and all gains and/or losses included in earnings (which are excluded from total fee-based income), and uses fully tax-equivalent net interest income. Tangible assets, tangible equity and tangible book value per common share measures are non-GAAP since they exclude the impact of goodwill and other intangible assets acquired through acquisitions on both total stockholders' equity and total assets. Pre-provision net revenue is defined as net interest income plus total fee-based income minus total non-interest expense. This measure is non-GAAP since it excludes provision for loan losses and all gains and/or losses included in earnings, which are excluded from total fee-based income. Return on tangible stockholders' equity is calculated as net income (less after-tax impact of amortization of other intangible assets) divided by tangible stockholders' equity. This measure is non-GAAP since it excludes the after-tax impact of amortization of other intangible assets from earnings and the balance sheet impact of goodwill and other intangible assets acquired through acquisitions on total stockholders' equity.\nA reconciliation of these non-GAAP financial measures to the most directly comparable GAAP financial measures is included at the end of this news release under the caption of \"Non-GAAP Financial Measures\".\nImportant Information for Investors and Shareholders:\nThis news release does not constitute an offer to sell or the solicitation of an offer to buy securities of Peoples. Peoples has filed a registration statement on Form S-4 and will file other documents regarding the proposed merger with ASB referenced in this news release with the Securities and Exchange Commission (\"SEC\") to register the common shares of Peoples to be issued to the shareholders of ASB. The registration statement includes a proxy statement/prospectus, which will be sent to the shareholders of ASB after the registration statement has been declared effective by the SEC and in advance of ASB's special meeting of shareholders to be held to consider the proposed merger. Investors and security holders are urged to read the proxy statement/prospectus and any other relevant documents to be filed with the SEC in connection with the proposed transaction because they contain important information about Peoples, ASB and the proposed merger. Investors and security holders may obtain a free copy of these documents (when available) through the website maintained by the SEC at www.sec.gov . These documents may also be obtained, free of charge, on Peoples' website at www.peoplesbancorp.com under the tab \"Investor Relations\" or by contacting Peoples' Investor Relations Department at: Peoples Bancorp Inc., 138 Putnam Street, PO Box 738, Marietta, Ohio 45750, Attn: Investor Relations.\nPeoples, ASB, and certain of their directors and executive officers may be deemed to be participants in the solicitation of proxies from the shareholders of ASB in connection with the proposed merger. Information about the directors and executive officers of Peoples is set forth in the proxy statement for Peoples' 2017 annual meeting of shareholders, as filed with the SEC on Schedule 14A on March 8, 2017. Additional information regarding the interests of those participants and other persons who may be deemed participants in the transaction may be obtained by reading the proxy statement/prospectus regarding the proposed merger when it becomes available. Free copies of this document may be obtained as described in the preceding paragraph, when it becomes available.\nSafe Harbor Statement:\nCertain statements made in this news release regarding Peoples' financial condition, results of operations, plans, objectives, future performance and business, are \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, Section 21E of the Securities Exchange Act of 1934, as amended, and the Private Securities Litigation Reform Act of 1995. These forward-looking statements are identified by the fact they are not historical facts and include words such as \"anticipate\", \"estimate\", \"may\", \"feel\", \"expect\", \"believe\", \"plan\", \"will\", \"would\", \"should\", \"could\" and similar expressions.\nThese forward-looking statements reflect management's current expectations based on all information available to management and its knowledge of Peoples' business and operations. Additionally, Peoples' financial condition, results of operations, plans, objectives, future performance and business are subject to risks and uncertainties that may cause actual results to differ materially. These factors include, but are not limited to:\n(1) the success, impact, and timing of the implementation of Peoples' business strategies, including the successful integration of acquisitions and the expansion of consumer lending activity;\n(2) Peoples' ability to integrate future acquisitions, including the pending merger with ASB, may be unsuccessful, or may be more difficult, time-consuming or costly than expected;\n(3) Peoples' ability to obtain regulatory approvals of the proposed merger of Peoples with ASB on the proposed terms and schedule, and approval of the merger by the shareholders of ASB may be unsuccessful;\n(4) competitive pressures among financial institutions or from non-financial institutions which may increase significantly, including product and pricing pressures, changes to third-party relationships and revenues, and Peoples' ability to attract, develop and retain qualified professionals;\n(5) changes in the interest rate environment due to economic conditions and/or the fiscal policies of the United States (\"U.S.\") government and the Board of Governors of the Federal Reserve System (the \"Federal Reserve Board\"), which may adversely impact interest rates, interest margins, loan demand and interest rate sensitivity;\n(6) uncertainty regarding the nature, timing and effect of legislative or regulatory changes or actions, promulgated and to be promulgated by governmental and regulatory agencies in the State of Ohio, the Federal Deposit Insurance Corporation, the Federal Reserve Board and the Consumer Financial Protection Bureau, which may subject Peoples, its subsidiaries, or one or more acquired companies to a variety of new and more stringent legal and regulatory requirements which adversely affect their respective businesses, including in particular the rules and regulations promulgated and to be promulgated under the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010, and the Basel III regulatory capital reform;\n(7) changes in policy and other regulatory and legal developments accompanying the current presidential administration, including the recently enacted Tax Cuts and Jobs Act, and uncertainty or speculation pending the enactment of such changes;\n(8) uncertainties in Peoples' preliminary review of, and additional analysis of, the Tax Cuts and Jobs Act;\n(9) local, regional, national and international economic conditions and the impact these conditions may have on Peoples, its customers and its counterparties, and Peoples' assessment of the impact, which may be different than anticipated;\n(10) Peoples may issue equity securities in connection with future acquisitions, which could cause ownership and economic dilution to Peoples' current shareholders;\n(11) changes in prepayment speeds, loan originations, levels of nonperforming assets, delinquent loans and charge-offs, which may be less favorable than expected and adversely impact the amount of interest income generated;\n(12) adverse changes in the economic conditions and/or activities, including, but not limited to, continued economic uncertainty in the U.S., the European Union (including the uncertainty surrounding the actions to be taken to implement the referendum by British voters to exit the European Union), Asia, and other areas, which could decrease sales volumes, add volatility to the global stock markets, and increase loan delinquencies and defaults;\n(13) deterioration in the credit quality of Peoples' loan portfolio, which may adversely impact the provision for loan losses;\n(14) changes in accounting standards, policies, estimates or procedures which may adversely affect Peoples' reported financial condition or results of operations;\n(15) Peoples' assumptions and estimates used in applying critical accounting policies, which may prove unreliable, inaccurate or not predictive of actual results;\n(16) adverse changes in the conditions and trends in the financial markets, including political developments, which may adversely affect the fair value of securities within Peoples' investment portfolio, the interest rate sensitivity of Peoples' consolidated balance sheet, and the income generated by Peoples' trust and investment activities;\n(17) Peoples' ability to receive dividends from its subsidiaries;\n(18) Peoples' ability to maintain required capital levels and adequate sources of funding and liquidity;\n(19) the impact of minimum capital thresholds established as a part of the implementation of Basel III;\n(20) the impact of larger or similar sized financial institutions encountering problems, which may adversely affect the banking industry and/or Peoples' business generation and retention, funding and liquidity;\n(21) the costs and effects of regulatory and legal developments, including the outcome of potential regulatory or other governmental inquiries and legal proceedings and results of regulatory examinations;\n(22) Peoples' ability to secure confidential information through the use of computer systems and telecommunications networks, including those of Peoples' third-party vendors and other service providers, may prove inadequate, which could adversely affect customer confidence in Peoples and/or result in Peoples incurring a financial loss;\n(23) ability to anticipate and respond to technological changes which can impact Peoples' ability to respond to customer needs and meet competitive demands;\n(24) changes in consumer spending, borrowing and saving habits, whether due to the newly enacted tax legislation, changes in business and economic conditions, legislative or regulatory initiatives, or other factors, which may be different than anticipated;\n(25) the overall adequacy of Peoples' risk management program;\n(26) the impact on Peoples' businesses, as well as on the risks described above, of various domestic or international widespread natural or other disasters, pandemics, cyber attacks, civil unrest, military or terrorist activities or international conflicts;\n(27) significant changes in the tax laws, which may adversely affect the fair values of deferred tax assets and obligations of states and political subdivisions held in Peoples' investment securities portfolio; and\n(28) other risk factors relating to the banking industry or Peoples as detailed from time to time in Peoples' reports filed with the SEC, including those risk factors included in the disclosures under the heading \"ITEM 1A. RISK FACTORS\" of Peoples' Annual Report on Form 10-K for the fiscal year ended December 31, 2016, and in Peoples' subsequent Quarterly Reports on Form 10-Q.\nPeoples encourages readers of this news release to understand forward-looking statements to be strategic objectives rather than absolute targets of future performance. Peoples undertakes no obligation to update these forward-looking statements to reflect events or circumstances after the date of this news release or to reflect the occurrence of unanticipated events, except as required by applicable legal requirements. Copies of documents filed with the SEC are available free of charge at the SEC's website at http://www.sec.gov and/or from Peoples' website.\nAs required by U.S. GAAP, Peoples is required to evaluate the impact of subsequent events through the issuance date of its December 31, 2017 consolidated financial statements as part of its Annual Report on Form 10-K to be filed with the SEC. Accordingly, subsequent events could occur that may cause Peoples to update its critical accounting estimates and to revise its financial information from that which is contained in this news release.\nPER COMMON SHARE DATA AND SELECTED RATIOS (Unaudited)\nThree Months Ended\nYear Ended\nDecember 31,\nSeptember 30,\nDecember 31,\nDecember 31,\n2017\n2017\n2016\n2017\n2016\nPER COMMON SHARE:\nEarnings per share:\nBasic\n$\n0.50\n$\n0.60\n$\n0.41\n$\n2.12\n$\n1.72\nDiluted\n0.49\n0.60\n0.41\n2.10\n1.71\nCash dividends declared per share\n0.22\n0.22\n0.17\n0.84\n0.64\nBook value per share\n25.08\n25.02\n23.92\n25.08\n23.92\nTangible book value per share (a)\n17.17\n17.15\n15.89\n17.17\n15.89\nClosing stock price at end of period\n$\n32.62\n$\n33.59\n$\n32.46\n$\n32.62\n$\n32.46\nSELECTED RATIOS:\nReturn on average equity (b)\n7.79\n%\n9.47\n%\n6.72\n%\n8.54\n%\n7.20\n%\nReturn on average tangible stockholders' equity (b)(c)\n12.09\n%\n14.58\n%\n10.99\n%\n13.33\n%\n11.86\n%\nReturn on average assets (b)\n1.00\n%\n1.22\n%\n0.87\n%\n1.10\n%\n0.94\n%\nEfficiency ratio (d)\n62.07\n%\n60.74\n%\n66.87\n%\n62.20\n%\n65.13\n%\nPre-provision net revenue to average assets (b)(e)\n1.65\n%\n1.71\n%\n1.35\n%\n1.65\n%\n1.48\n%\nNet interest margin (b)(f)\n3.63\n%\n3.67\n%\n3.54\n%\n3.62\n%\n3.54\n%\nDividend payout ratio (g)\n44.75\n%\n36.90\n%\n41.70\n%\n39.86\n%\n37.40\n%\n(a)\nThis amount represents a non-GAAP financial measure since it excludes the balance sheet impact of goodwill and other intangible assets acquired through acquisitions on stockholders' equity. Additional information regarding the calculation of this ratio is included at the end of this news release.\n(b)\nRatios are presented on an annualized basis.\n(c)\nThis amount represents a non-GAAP financial measure since it excludes the after-tax impact of amortization of other intangible assets from earnings and it excludes the balance sheet impact of goodwill and other intangible assets acquired through acquisitions on stockholders' equity. Additional information regarding the calculation of this ratio is included at the end of this news release.\n(d)\nTotal non-interest expense (less amortization of other intangible assets) as a percentage of fully tax-equivalent net interest income plus total fee-based income. This amount represents a non-GAAP financial measure since it excludes amortization of other intangible assets, and all gains and/or losses included in earnings (which are excluded from total fee-based income), and uses fully tax-equivalent net interest income. Additional information regarding the calculation of this ratio is included at the end of this news release.\n(e)\nThis ratio represents a non-GAAP financial measure since it excludes the provision for loan losses and all gains and/or losses included in earnings, which are excluded from total fee-based income. This measure is a key metric used by federal bank regulatory agencies in their evaluation of capital adequacy for financial institutions. Additional information regarding the calculation of this ratio is included at the end of this news release.\n(f)\nInformation presented on a fully tax-equivalent basis.\n(g)\nRatios are calculated based on dividends declared during the period divided by earnings for the period.\nCONSOLIDATED STATEMENTS OF OPERATIONS (Unaudited)\nThree Months Ended\nYear Ended\nDecember 31,\nSeptember 30,\nDecember 31,\nDecember 31,\n(in $000's)\n2017\n2017\n2016\n2017\n2016\nInterest income\n$\n32,772\n$\n32,728\n$\n29,350\n$\n126,525\n$\n115,444\nInterest expense\n3,650\n3,508\n2,683\n13,148\n10,579\nNet interest income\n29,122\n29,220\n26,667\n113,377\n104,865\nProvision for loan losses\n1,115\n1,086\n711\n3,772\n3,539\nNet interest income after provision for loan\nlosses\n28,007\n28,134\n25,956\n109,605\n101,326\nNet gain on investment securities\n764\n1,861\n68\n2,983\n930\nLoss on debt extinguishment\n—\n—\n—\n—\n(707)\nNet (loss) gain on loans held-for-sale and other\nreal estate owned\n(105)\n13\n(33)\n(116)\n(34)\nNet (loss) gain on other assets\n(39)\n(38)\n(76)\n53\n(392)\nFee-based income:\nInsurance income\n3,343\n3,345\n2,912\n14,204\n13,846\nTrust and investment income\n3,061\n2,838\n2,739\n11,558\n10,589\nElectronic banking income\n2,666\n2,544\n2,486\n10,358\n10,353\nDeposit account service charges\n2,484\n2,407\n2,663\n9,614\n10,662\nMortgage banking income\n483\n535\n452\n1,872\n1,304\nBank owned life insurance income\n479\n482\n503\n1,950\n1,414\nCommercial loan swap fee income\n237\n76\n79\n1,232\n1,076\nOther non-interest income\n366\n383\n277\n1,865\n1,826\nTotal fee-based income\n13,119\n12,610\n12,111\n52,653\n51,070\nNon-interest expense:\nSalaries and employee benefits costs\n14,590\n15,141\n14,552\n60,276\n57,433\nNet occupancy and equipment expense\n2,653\n2,619\n2,580\n10,633\n10,735\nProfessional fees\n2,043\n1,393\n2,193\n6,575\n7,436\nElectronic banking expense\n1,387\n1,448\n1,424\n5,874\n5,992\nData processing and software expense\n1,111\n1,092\n1,260\n4,441\n3,763\nAmortization of other intangible assets\n913\n869\n1,007\n3,516\n4,030\nMarketing expense\n592\n488\n402\n1,714\n1,594\nFranchise taxes\n496\n583\n642\n2,246\n2,192\nFDIC insurance expense\n477\n449\n193\n1,816\n1,899\nCommunication expense\n341\n334\n531\n1,475\n2,261\nForeclosed real estate and other loan expenses\n284\n214\n319\n873\n859\nOther non-interest expense\n2,519\n1,928\n2,179\n8,536\n8,717\nTotal non-interest expense\n27,406\n26,558\n27,282\n107,975\n106,911\nIncome before income taxes\n14,340\n16,022\n10,744\n57,203\n45,282\nIncome tax expense\n5,339\n5,127\n3,336\n18,732\n14,125\nNet income\n$\n9,001\n$\n10,895\n$\n7,408\n$\n38,471\n$\n31,157\nPER COMMON SHARE DATA:\nEarnings per share – Basic\n$\n0.50\n$\n0.60\n$\n0.41\n$\n2.12\n$\n1.72\nEarnings per share – Diluted\n$\n0.49\n$\n0.60\n$\n0.41\n$\n2.10\n$\n1.71\nCash dividends declared per share\n$\n0.22\n$\n0.22\n$\n0.17\n$\n0.84\n$\n0.64\nWeighted-average shares outstanding – Basic\n18,069,467\n18,056,202\n18,009,056\n18,050,189\n18,013,693\nWeighted-average shares outstanding – Diluted\n18,240,092\n18,213,533\n18,172,030\n18,208,684\n18,155,463\nActual shares outstanding (end of period)\n18,287,449\n18,281,194\n18,200,067\n18,287,449\n18,200,067\nCONSOLIDATED BALANCE SHEETS (Unaudited)\nDecember 31,\n(in $000's)\n2017\n2016\nAssets\nCash and cash equivalents:\nCash and due from banks\n$\n58,121\n$\n58,129\nInterest-bearing deposits in other banks\n14,073\n8,017\nTotal cash and cash equivalents\n72,194\n66,146\nAvailable-for-sale investment securities, at fair value (amortized cost of\n$797,732 at December 31, 2017 and $777,017 at December 31, 2016)\n795,187\n777,940\nHeld-to-maturity investment securities, at amortized cost (fair value of\n$41,213 at December 31, 2017 and $43,227 at December 31, 2016)\n40,928\n43,144\nOther investment securities, at cost\n38,371\n38,371\nTotal investment securities\n874,486\n859,455\nLoans, net of deferred fees and costs\n2,357,137\n2,224,936\nAllowance for loan losses\n(18,793)\n(18,429)\nNet loans\n2,338,344\n2,206,507\nLoans held-for-sale\n2,510\n4,022\nBank premises and equipment, net of accumulated depreciation\n52,510\n53,616\nBank owned life insurance\n62,176\n60,225\nGoodwill\n133,111\n132,631\nOther intangible assets\n11,465\n13,387\nOther assets\n34,890\n36,359\nTotal assets\n$\n3,581,686\n$\n3,432,348\nLiabilities\nDeposits:\nNon-interest-bearing deposits\n$\n556,010\n$\n734,421\nInterest-bearing deposits\n2,174,320\n1,775,301\nTotal deposits\n2,730,330\n2,509,722\nShort-term borrowings\n209,491\n305,607\nLong-term borrowings\n144,019\n145,155\nAccrued expenses and other liabilities\n39,254\n36,603\nTotal liabilities\n3,123,094\n2,997,087\nStockholders' Equity\nPreferred stock, no par value (50,000 shares authorized, no shares issued\nat December 31, 2017 and December 31, 2016)\n—\n—\nCommon stock, no par value, 24,000,000 shares authorized, 18,952,385 shares\nissued at December 31, 2017 and 18,939,091 shares issued at December 31,\n2016, including shares in treasury\n345,412\n344,404\nRetained earnings\n133,438\n110,294\nAccumulated comprehensive loss, net of deferred income taxes\n(4,291)\n(1,554)\nTreasury stock, at cost, 702,449 shares at December 31, 2017 and 795,758\nshares at December 31, 2016\n(15,967)\n(17,883)\nTotal stockholders' equity\n458,592\n435,261\nTotal liabilities and stockholders' equity\n$\n3,581,686\n$\n3,432,348\nSELECTED FINANCIAL INFORMATION (Unaudited)\nDecember 31,\nSeptember 30,\nJune 30,\nMarch 31,\nDecember 31,\n(in $000's, end of period)\n2017\n2017\n2017\n2017\n2016\nLoan Portfolio\nCommercial real estate, construction\n$\n115,437\n$\n119,752\n$\n112,169\n$\n103,317\n$\n94,726\nCommercial real estate, other\n760,567\n747,413\n750,219\n730,055\n736,023\nCommercial and industrial\n472,544\n443,930\n431,473\n428,737\n422,339\nResidential real estate\n489,387\n499,044\n512,887\n524,212\n535,925\nHome equity lines of credit\n109,477\n110,787\n111,710\n110,028\n111,492\nConsumer, indirect\n340,719\n335,844\n306,113\n283,762\n252,832\nConsumer, other\n68,157\n69,758\n69,267\n68,670\n70,519\nDeposit account overdrafts\n849\n507\n521\n721\n1,080\nTotal loans\n$\n2,357,137\n$\n2,327,035\n$\n2,294,359\n$\n2,249,502\n$\n2,224,936\nTotal acquired loans (a)\n$\n414,847\n$\n438,350\n$\n463,189\n$\n491,270\n$\n516,832\nTotal originated loans\n$\n1,942,290\n$\n1,888,685\n$\n1,831,170\n$\n1,758,232\n$\n1,708,104\nDeposit Balances\nNon-interest-bearing deposits (b)\n$\n556,010\n$\n724,846\n$\n772,061\n$\n785,047\n$\n734,421\nInterest-bearing deposits:\nInterest-bearing demand accounts (b)\n$\n593,415\n384,261\n303,501\n292,187\n$\n278,975\nRetail certificates of deposit (c)\n338,673\n343,122\n352,758\n353,918\n360,464\nMoney market deposit accounts\n371,376\n388,876\n397,211\n386,999\n407,754\nGovernmental deposit accounts\n264,524\n289,895\n297,560\n330,477\n251,671\nSavings accounts\n446,714\n440,633\n443,110\n445,720\n436,344\nBrokered certificates of deposits (c)\n159,618\n93,049\n110,943\n107,817\n40,093\nTotal interest-bearing deposits\n2,174,320\n1,939,836\n1,905,083\n1,917,118\n1,775,301\nTotal deposits\n$\n2,730,330\n$\n2,664,682\n$\n2,677,144\n$\n2,702,165\n$\n2,509,722\nAsset Quality\nNonperforming assets (NPAs):\nLoans 90+ days past due and accruing\n$\n1,626\n$\n3,542\n$\n2,583\n$\n3,006\n$\n3,771\nNonaccrual loans\n15,692\n16,219\n16,921\n18,293\n21,325\nTotal nonperforming loans (NPLs)\n17,318\n19,761\n19,504\n21,299\n25,096\nOther real estate owned (OREO)\n208\n276\n652\n677\n661\nTotal NPAs\n$\n17,526\n$\n20,037\n$\n20,156\n$\n21,976\n$\n25,757\nCriticized loans (d)\n90,381\n96,671\n111,480\n101,284\n99,182\nClassified loans (e)\n46,343\n41,233\n53,041\n56,503\n57,736\nAllowance for loan losses as a percent of NPLs (f)(g)\n108.52\n%\n96.11\n%\n96.47\n%\n86.71\n%\n73.43\n%\nNPLs as a percent of total loans (f)(g)\n0.73\n%\n0.85\n%\n0.85\n%\n0.95\n%\n1.13\n%\nNPAs as a percent of total assets (f)(g)\n0.49\n%\n0.56\n%\n0.57\n%\n0.64\n%\n0.75\n%\nNPAs as a percent of total loans and OREO (f)(g)\n0.74\n%\n0.86\n%\n0.88\n%\n0.98\n%\n1.16\n%\nCriticized loans as a percent of total loans (f)\n3.83\n%\n4.15\n%\n4.86\n%\n4.50\n%\n4.46\n%\nClassified loans as a percent of total loans (f)\n1.97\n%\n1.77\n%\n2.31\n%\n2.51\n%\n2.59\n%\nAllowance for loan losses as a percent of total loans (f)\n0.80\n%\n0.82\n%\n0.81\n%\n0.82\n%\n0.83\n%\nCapital Information (h)\nCommon Equity Tier 1 capital ratio\n13.41\n%\n13.31\n%\n13.18\n%\n13.05\n%\n12.91\n%\nTier 1 risk-based capital ratio\n13.70\n%\n13.60\n%\n13.47\n%\n13.34\n%\n13.21\n%\nTotal risk-based capital ratio (Tier 1 and Tier 2)\n14.58\n%\n14.49\n%\n14.40\n%\n14.27\n%\n14.11\n%\nLeverage ratio\n9.88\n%\n9.82\n%\n9.72\n%\n9.60\n%\n9.66\n%\nCommon Equity Tier 1 capital\n$\n331,921\n$\n326,966\n$\n318,849\n$\n310,856\n$\n306,506\nTier 1 capital\n339,028\n334,027\n325,865\n317,826\n313,430\nTotal capital (Tier 1 and Tier 2)\n360,806\n355,951\n348,309\n340,147\n334,957\nTotal risk-weighted assets\n$\n2,475,265\n2,456,797\n2,419,335\n2,382,874\n$\n2,373,359\nTangible equity to tangible assets (i)\n9.14\n%\n9.20\n%\n9.07\n%\n8.98\n%\n8.80\n%\n(a)\nIncludes all loans acquired in 2012 and thereafter.\n(b)\nThe sum of amounts presented is considered total demand deposits.\n(c)\nPrior periods reclassified.\n(d)\nIncludes loans categorized as special mention, substandard or doubtful.\n(e)\nIncludes loans categorized as substandard or doubtful.\n(f)\nData presented as of the end of the period indicated.\n(g)\nNonperforming loans include loans 90+ days past due and accruing, renegotiated loans and nonaccrual loans. Nonperforming assets include nonperforming loans and OREO.\n(h)\nDecember 31, 2017 data based on preliminary analysis and subject to revision.\n(i)\nThese ratios represent non-GAAP financial measures since they exclude the balance sheet impact of intangible assets acquired through acquisitions on both total stockholders' equity and total assets. Additional information regarding the calculation of this ratio is included at the end of this news release.\nPROVISION FOR LOAN LOSSES INFORMATION (Unaudited)\nThree Months Ended\nYear Ended\nDecember 31,\nSeptember 30,\nDecember 31,\nDecember 31,\n(in $000's)\n2017\n2017\n2016\n2017\n2016\nProvision for Loan Losses\nProvision for loan losses\n$\n900\n$\n900\n$\n480\n$\n3,050\n$\n2,890\nProvision for checking account overdrafts\n215\n186\n231\n722\n649\nTotal provision for loan losses\n$\n1,115\n$\n1,086\n$\n711\n$\n3,772\n$\n3,539\nNet Charge-Offs\nGross charge-offs\n1,602\n$\n1,219\n$\n1,076\n4,878\n$\n5,198\nRecoveries\n288\n310\n575\n1,470\n3,309\nNet charge-offs\n$\n1,314\n$\n909\n$\n501\n$\n3,408\n$\n1,889\nNet Charge-Offs (Recoveries) by Type\nCommercial real estate, other\n$\n372\n$\n(19)\n$\n3\n$\n262\n$\n(1,141)\nCommercial and industrial\n10\n47\n(56)\n174\n711\nResidential real estate\n162\n226\n(22)\n485\n333\nHome equity lines of credit\n27\n77\n(7)\n118\n17\nConsumer, indirect\n451\n319\n238\n1,346\n1,013\nConsumer, other\n77\n60\n143\n200\n357\nDeposit account overdrafts\n215\n199\n202\n823\n599\nTotal net charge-offs\n$\n1,314\n$\n909\n$\n501\n$\n3,408\n$\n1,889\nAs a percent of average gross loans (annualized)\n0.22\n%\n0.16\n%\n0.09\n%\n0.15\n%\n0.09\n%\nSUPPLEMENTAL INFORMATION (Unaudited)\nDecember 31,\nSeptember 30,\nJune 30,\nMarch 31,\nDecember 31,\n(in $000's, end of period)\n2017\n2017\n2017\n2017\n2016\nTrust assets under administration\nand management\n$\n1,452,959\n$\n1,418,360\n$\n1,393,435\n$\n1,362,243\n$\n1,301,509\nBrokerage assets under\nadministration and management\n887,303\n862,530\n836,192\n805,361\n777,771\nMortgage loans serviced for others\n$\n412,965\n$\n409,199\n$\n402,516\n$\n399,279\n$\n398,134\nEmployees (full-time equivalent)\n774\n778\n775\n776\n782\nCONSOLIDATED AVERAGE BALANCE SHEETS AND NET INTEREST INCOME (Unaudited)\nThree Months Ended\nDecember 31, 2017\nSeptember 30, 2017\nDecember 31, 2016\n(in $000's)\nBalance\nIncome/\nExpense\nYield/ Cost\nBalance\nIncome/\nExpense\nYield/ Cost\nBalance\nIncome/\nExpense\nYield/ Cost\nAssets\nShort-term investments\n$\n17,847\n$\n61\n1.36\n%\n$\n12,812\n$\n42\n1.30\n%\n$\n8,520\n$\n13\n0.61\n%\nInvestment securities (a)(b)\n875,653\n6,204\n2.83\n%\n885,744\n6,739\n3.04\n%\n862,355\n5,816\n2.70\n%\nLoans (b)(c):\nCommercial real estate,\nconstruction\n120,471\n1,312\n4.26\n%\n118,208\n1,337\n4.43\n%\n89,113\n889\n3.90\n%\nCommercial real estate, other\n753,172\n9,035\n4.69\n%\n750,260\n8,890\n4.64\n%\n722,003\n8,456\n4.58\n%\nCommercial and industrial\n451,647\n5,345\n4.63\n%\n438,524\n5,196\n4.64\n%\n399,614\n4,201\n4.11\n%\nResidential real estate (d)\n496,325\n5,455\n4.40\n%\n507,906\n5,468\n4.31\n%\n547,640\n5,938\n4.34\n%\nHome equity lines of credit\n110,610\n1,282\n4.60\n%\n110,741\n1,291\n4.63\n%\n111,417\n1,214\n4.33\n%\nConsumer, indirect\n338,615\n3,217\n3.77\n%\n322,072\n2,955\n3.64\n%\n241,290\n2,130\n3.51\n%\nConsumer, other\n69,815\n1,300\n7.39\n%\n70,204\n1,270\n7.18\n%\n73,321\n1,209\n6.76\n%\nTotal loans\n2,340,655\n26,946\n4.54\n%\n2,317,915\n26,407\n4.49\n%\n2,184,398\n24,037\n4.34\n%\nAllowance for loan losses\n(18,840)\n(18,869)\n(18,254)\nNet loans\n2,321,815\n2,299,046\n2,166,144\nTotal earning assets\n3,215,315\n33,211\n4.08\n%\n3,197,602\n33,188\n4.10\n%\n3,037,019\n29,866\n3.89\n%\nIntangible assets\n143,942\n144,267\n146,489\nOther assets\n203,010\n199,351\n203,011\nTotal assets\n$\n3,562,267\n$\n3,541,220\n$\n3,386,519\nLiabilities and Equity\nInterest-bearing deposits:\nSavings accounts\n$\n443,056\n$\n64\n0.06\n%\n$\n443,599\n$\n65\n0.06\n%\n$\n436,733\n$\n58\n0.05\n%\nGovernment deposit accounts\n281,389\n205\n0.29\n%\n309,623\n200\n0.26\n%\n273,263\n126\n0.18\n%\nInterest-bearing demand accounts\n565,885\n233\n0.16\n%\n320,788\n133\n0.16\n%\n275,653\n65\n0.09\n%\nMoney market deposit accounts\n377,839\n240\n0.25\n%\n389,292\n253\n0.26\n%\n407,171\n202\n0.20\n%\nRetail certificates of deposit\n342,165\n765\n0.89\n%\n348,047\n760\n0.87\n%\n375,347\n807\n0.86\n%\nBrokered certificates of deposits\n138,013\n566\n1.63\n%\n106,448\n454\n1.69\n%\n37,859\n151\n1.59\n%\nTotal interest-bearing deposits\n2,148,347\n2,073\n0.38\n%\n1,917,797\n1,865\n0.39\n%\n1,806,026\n1,409\n0.31\n%\nShort-term borrowings\n189,976\n680\n1.42\n%\n174,466\n369\n0.84\n%\n213,852\n207\n0.39\n%\nLong-term borrowings\n158,011\n896\n2.25\n%\n200,073\n1,274\n2.53\n%\n145,677\n1,066\n2.92\n%\nTotal borrowed funds\n347,987\n1,576\n1.80\n%\n374,539\n1,643\n1.74\n%\n359,529\n1,273\n1.41\n%\nTotal interest-bearing liabilities\n2,496,334\n3,649\n0.58\n%\n2,292,336\n3,508\n0.61\n%\n2,165,555\n2,682\n0.49\n%\nNon-interest-bearing deposits\n569,759\n756,098\n743,389\nOther liabilities\n37,526\n36,588\n39,337\nTotal liabilities\n3,103,619\n3,085,022\n2,948,281\nStockholders' equity\n458,648\n456,198\n438,238\nTotal liabilities and equity\n$\n3,562,267\n$\n3,541,220\n$\n3,386,519\nNet interest income/spread (b)\n$\n29,562\n3.50\n%\n$\n29,680\n3.49\n%\n$\n27,184\n3.40\n%\nNet interest margin (b)\n3.63\n%\n3.67\n%\n3.54\n%\nYear Ended\nDecember 31, 2017\nDecember 31, 2016\n(in $000's)\nBalance\nIncome/\nExpense\nYield/ Cost\nBalance\nIncome/\nExpense\nYield/ Cost\nAssets\nShort-term investments\n$\n12,616\n$\n144\n1.14\n%\n$\n9,667\n$\n50\n0.52\n%\nInvestment securities (a)(b)\n875,940\n25,095\n2.86\n%\n866,021\n23,416\n2.70\n%\nLoans (b)(c):\nCommercial real estate,\nconstruction\n110,124\n4,800\n4.30\n%\n88,559\n3,455\n3.84\n%\nCommercial real estate, other\n743,517\n35,240\n4.67\n%\n721,535\n33,651\n4.59\n%\nCommercial and industrial\n439,178\n19,944\n4.48\n%\n376,881\n15,769\n4.12\n%\nResidential real estate (d)\n514,024\n22,256\n4.33\n%\n557,537\n24,279\n4.35\n%\nHome equity lines of credit\n110,910\n4,965\n4.48\n%\n109,164\n4,853\n4.45\n%\nConsumer, indirect\n306,338\n10,975\n3.58\n%\n207,095\n7,432\n3.59\n%\nConsumer, other\n69,889\n5,018\n7.18\n%\n72,404\n4,566\n6.29\n%\nTotal loans\n2,293,980\n103,198\n4.50\n%\n2,133,175\n94,005\n4.41\n%\nAllowance for loan losses\n(18,713)\n(17,564)\nNet loans\n2,275,267\n2,115,611\nTotal earning assets\n3,163,823\n128,437\n4.03\n%\n2,991,299\n117,471\n3.90\n%\nIntangible assets\n144,696\n147,981\nOther assets\n201,769\n181,167\nTotal assets\n$\n3,510,288\n$\n3,320,447\nLiabilities and Equity\nInterest-bearing deposits:\nSavings accounts\n$\n442,684\n$\n249\n0.06\n%\n$\n434,140\n$\n231\n0.05\n%\nGovernment deposit accounts\n294,053\n704\n0.24\n%\n296,590\n570\n0.19\n%\nInterest-bearing demand accounts\n367,699\n543\n0.15\n%\n260,788\n217\n0.08\n%\nMoney market deposit accounts\n389,885\n877\n0.22\n%\n401,693\n702\n0.17\n%\nRetail certificates of deposit\n358,307\n2,997\n0.84\n%\n406,298\n3,181\n0.78\n%\nBrokered certificates of deposits\n98,793\n1,784\n1.81\n%\n41,613\n1,041\n2.50\n%\nTotal interest-bearing deposits\n1,951,421\n7,154\n0.37\n%\n1,841,122\n5,942\n0.32\n%\nShort-term borrowings\n182,247\n1,533\n0.84\n%\n159,169\n508\n0.32\n%\nLong-term borrowings\n177,091\n4,460\n2.52\n%\n131,386\n4,129\n3.14\n%\nTotal borrowed funds\n359,338\n5,993\n1.67\n%\n290,555\n4,637\n1.60\n%\nTotal interest-bearing liabilities\n2,310,759\n13,147\n0.57\n%\n2,131,677\n10,579\n0.50\n%\nNon-interest-bearing deposits\n713,027\n722,291\nOther liabilities\n36,123\n33,813\nTotal liabilities\n3,059,909\n2,887,781\nStockholders' equity\n450,379\n432,666\nTotal liabilities and equity\n$\n3,510,288\n$\n3,320,447\nNet interest income/spread (b)\n$\n115,290\n3.46\n%\n$\n106,892\n3.40\n%\nNet interest margin (b)\n3.62\n%\n3.54\n%\n(a)\nAverage balances are based on carrying value.\n(b)\nInterest income and yields are presented on a fully tax-equivalent basis using a 35% federal statutory tax rate.\n(c)\nAverage balances include nonaccrual and impaired loans. Interest income includes interest earned and received on nonaccrual loans prior to the loans being placed on nonaccrual status. Loan fees included in interest income were immaterial for all periods presented.\n(d)\nLoans held for sale are included in the average loan balance listed. Related interest income on loans originated for sale prior to the loan being sold is included in loan interest income.\nNON-GAAP FINANCIAL MEASURES (Unaudited)\nThe following non-GAAP financial measures used by Peoples provide information useful to investors in understanding Peoples' operating performance and trends, and facilitate comparisons with the performance of Peoples' peers. The following tables summarize the non-GAAP financial measures derived from amounts reported in Peoples' consolidated financial statements:\nThree Months Ended\nYear Ended\nDecember 31,\nSeptember 30,\nDecember 31,\nDecember 31,\n(in $000's)\n2017\n2017\n2016\n2017\n2016\nCore non-interest income:\nTotal non-interest income\n$\n13,119\n$\n12,610\n$\n12,111\n$\n52,653\n$\n51,070\nPlus: System upgrade revenue waived\n—\n—\n85\n—\n85\nCore non-interest income\n$\n13,119\n$\n12,610\n$\n12,196\n$\n52,653\n$\n51,155\nThree Months Ended\nYear Ended\nDecember 31,\nSeptember 30,\nDecember 31,\nDecember 31,\n(in $000's)\n2017\n2017\n2016\n2017\n2016\nCore non-interest expenses:\nTotal non-interest expense\n$\n27,406\n$\n26,558\n$\n27,282\n$\n107,975\n$\n106,911\nLess: system upgrade costs\n—\n—\n746\n—\n1,259\nLess: acquisition-related costs\n341\n—\n—\n341\n—\nLess: pension settlement charges\n242\n—\n—\n242\n—\nCore non-interest expenses\n$\n26,823\n$\n26,558\n$\n26,536\n$\n107,392\n$\n105,652\nThree Months Ended\nYear Ended\nDecember 31,\nSeptember 30,\nDecember 31,\nDecember 31,\n(in $000's)\n2017\n2017\n2016\n2017\n2016\nEfficiency ratio:\nTotal non-interest expense\n$\n27,406\n$\n26,558\n$\n27,282\n$\n107,975\n$\n106,911\nLess: Amortization of other intangible assets\n913\n869\n1,007\n3,516\n4,030\nAdjusted non-interest expense\n26,493\n25,689\n26,275\n104,459\n102,881\nTotal fee-based income\n13,119\n12,610\n12,111\n52,653\n51,070\nNet interest income\n29,122\n29,220\n26,667\n113,377\n104,865\nAdd: Fully tax-equivalent adjustment\n440\n460\n517\n1,913\n2,027\nNet interest income on a fully taxable-equivalent basis\n29,562\n29,680\n27,184\n115,290\n106,892\nAdjusted revenue\n$\n42,681\n$\n42,290\n$\n39,295\n$\n167,943\n$\n157,962\nEfficiency ratio\n62.07\n%\n60.74\n%\n66.87\n%\n62.20\n%\n65.13\n%\nEfficiency ratio adjusted for non-core items:\nCore non-interest expenses\n$\n26,823\n$\n26,558\n$\n26,536\n$\n107,392\n$\n105,652\nLess: Amortization of other intangible assets\n913\n869\n1,007\n3,516\n4,030\nAdjusted non-interest expense\n25,910\n25,689\n25,529\n103,876\n101,622\nTotal fee-based income\n$\n13,119\n$\n12,610\n$\n12,196\n$\n52,653\n$\n51,155\nNet interest income on a fully taxable-equivalent basis\n29,562\n29,680\n27,184\n115,290\n106,892\nAdjusted revenue\n$\n42,681\n$\n42,290\n$\n39,380\n$\n167,943\n$\n158,047\nEfficiency ratio adjusted for non-core items\n60.71\n%\n60.74\n%\n64.83\n%\n61.85\n%\n64.30\n%\nAt or For the Three Months Ended\nDecember 31,\nSeptember 30,\nJune 30,\nMarch 31,\nDecember 31,\n(in $000's)\n2017\n2017\n2017\n2017\n2016\nTangible Equity:\nTotal stockholders' equity, as reported\n$\n458,592\n$\n457,386\n$\n451,353\n$\n443,009\n$\n435,261\nLess: goodwill and other intangible assets\n144,576\n143,859\n144,692\n145,505\n146,018\nTangible equity\n$\n314,016\n$\n313,527\n$\n306,661\n$\n297,504\n$\n289,243\nTangible Assets:\nTotal assets, as reported\n$\n3,581,686\n$\n3,552,412\n$\n3,525,126\n$\n3,459,276\n$\n3,432,348\nLess: goodwill and other intangible assets\n144,576\n143,859\n144,692\n145,505\n146,018\nTangible assets\n$\n3,437,110\n$\n3,408,553\n$\n3,380,434\n$\n3,313,771\n$\n3,286,330\nTangible Book Value per Common Share:\nTangible equity\n$\n314,016\n$\n313,527\n$\n306,661\n$\n297,504\n$\n289,243\nCommon shares outstanding\n18,287,449\n18,281,194\n18,279,036\n18,270,508\n18,200,067\nTangible book value per common share\n$\n17.17\n$\n17.15\n$\n16.78\n$\n16.28\n$\n15.89\nTangible Equity to Tangible Assets Ratio:\nTangible equity\n$\n314,016\n$\n313,527\n$\n306,661\n$\n297,504\n$\n289,243\nTangible assets\n$\n3,437,110\n$\n3,408,553\n$\n3,380,434\n$\n3,313,771\n$\n3,286,330\nTangible equity to tangible assets\n9.14\n%\n9.20\n%\n9.07\n%\n8.98\n%\n8.80\n%\nThree Months Ended\nYear Ended\nDecember 31,\nSeptember 30,\nDecember 31,\nDecember 31,\n(in $000's)\n2017\n2017\n2016\n2017\n2016\nPre-Provision Net Revenue:\nIncome before income taxes\n$\n14,340\n$\n16,022\n$\n10,744\n$\n57,203\n$\n45,282\nAdd: provision for loan losses\n1,115\n1,086\n711\n3,772\n3,539\nAdd: loss on debt extinguishment\n—\n—\n—\n—\n707\nAdd: net loss on OREO\n105\n—\n33\n129\n34\nAdd: net loss on other assets\n39\n38\n76\n105\n392\nLess: net gain on OREO\n—\n13\n—\n13\n—\nLess: net gain on investment securities\n764\n1,861\n68\n2,983\n930\nLess: net gain on other assets\n—\n—\n—\n158\n—\nPre-provision net revenue\n$\n14,835\n$\n15,272\n$\n11,496\n$\n58,055\n$\n49,024\nPre-provision net revenue\n$\n14,835\n$\n15,272\n$\n11,496\n$\n58,055\n$\n49,024\nTotal average assets\n3,562,267\n3,541,220\n3,386,519\n3,510,288\n3,320,447\nPre-provision net revenue to total average assets\n(annualized)\n1.65\n%\n1.71\n%\n1.35\n%\n1.65\n%\n1.48\n%\nAt or For the Three Months Ended\nYear Ended\nDecember 31,\nSeptember 30,\nDecember 31,\nDecember 31,\n(in $000's)\n2017\n2017\n2016\n2017\n2016\nAnnualized Net Income Excluding Amortization of Other Intangible Assets:\nNet income\n$\n9,001\n$\n10,895\n$\n7,408\n$\n38,471\n$\n31,157\nAdd: amortization of other intangible assets\n913\n869\n1,007\n3,516\n4,030\nLess: tax effect (at 35% tax rate) of\namortization of other intangible assets\n320\n304\n352\n1,231\n1,411\nNet income excluding amortization of other\nintangible assets\n$\n9,594\n$\n11,460\n$\n8,063\n$\n40,756\n$\n33,776\nDays in the period\n92\n92\n92\n365\n366\nDays in the year\n365\n365\n366\n365\n366\nAnnualized net income\n$\n35,710\n$\n43,225\n$\n29,471\n$\n38,471\n$\n31,157\nAnnualized net income excluding\namortization of other intangible assets\n$\n38,063\n$\n45,466\n$\n32,077\n$\n40,756\n$\n33,776\nAverage Tangible Stockholders' Equity:\nTotal average stockholders' equity\n$\n458,648\n$\n456,198\n$\n438,238\n$\n450,379\n$\n432,666\nLess: average goodwill and other intangible\nassets\n143,942\n144,267\n146,489\n144,696\n147,981\nAverage tangible stockholders' equity\n$\n314,706\n$\n311,931\n$\n291,749\n$\n305,683\n$\n284,685\nReturn on Average Stockholders' Equity Ratio:\nAnnualized net income\n$\n35,710\n$\n43,225\n$\n29,471\n$\n38,471\n$\n31,157\nAverage stockholders' equity\n$\n458,648\n$\n456,198\n$\n438,238\n$\n450,379\n$\n432,666\nReturn on average stockholders' equity\n7.79\n%\n9.47\n%\n6.72\n%\n8.54\n%\n7.20\n%\nReturn on Average Tangible Stockholders' Equity Ratio:\nAnnualized net income excluding\namortization of other intangible assets\n$\n38,063\n$\n45,466\n$\n32,077\n$\n40,756\n$\n33,776\nAverage tangible stockholders' equity\n$\n314,706\n$\n311,931\n$\n291,749\n$\n305,683\n$\n284,685\nReturn on average tangible stockholders'\nequity\n12.09\n%\n14.58\n%\n10.99\n%\n13.33\n%\n11.86\n%\nFiled by Peoples Bancorp Inc.\nPursuant to Rule 425 under the Securities Act of 1933\nand deemed filed pursuant to Rule 14a-12\nunder the Securities Exchange Act of 1934\nIssuing Company: Peoples Bancorp Inc.\nRegistration Statement on Form S-4 File No. 333-222054\nSubject Company: ASB Financial Corp.\nView original content: http://www.prnewswire.com/news-releases/peoples-bancorp-inc-announces-4th-quarter-earnings-and-record-full-year-net-income-for-2017-300586605.html\nSOURCE Peoples Bancorp Inc.", "external_links": ["http://www.prnewswire.com/news-releases/peoples-bancorp-inc-announces-4th-quarter-earnings-and-record-full-year-net-income-for-2017-300586605.html"], "published": "2018-01-23T16:02:00.000+02:00", "crawled": "2018-01-23T18:25:01.021+02:00", "highlightTitle": ""}