{"organizations": [], "uuid": "6ab397056f54a626f38677e11fcc1b220584e758", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-scf-partners-announces-nine-energy-service-nyse-nine-successfully-completes-an-initial-public-offering.html", "country": "US", "domain_rank": 767, "title": "SCF Partners Announces Nine Energy Service (NYSE: NINE) Successfully Completes an Initial Public Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.305, "site_type": "news", "published": "2018-01-24T02:06:00.000+02:00", "replies_count": 0, "uuid": "6ab397056f54a626f38677e11fcc1b220584e758"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-scf-partners-announces-nine-energy-service-nyse-nine-successfully-completes-an-initial-public-offering.html", "ord_in_thread": 0, "title": "SCF Partners Announces Nine Energy Service (NYSE: NINE) Successfully Completes an Initial Public Offering", "locations": [], "entities": {"persons": [{"name": "inc", "sentiment": "negative"}, {"name": "andy waite", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "scf partners announces nine energy service", "sentiment": "negative"}, {"name": "nine energy service", "sentiment": "negative"}, {"name": "scf partners", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "nine energy service, inc.", "sentiment": "none"}, {"name": "nine", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- SCF Partners (“SCF”) is pleased to announce that Nine Energy Service, Inc. (NYSE: NINE) (“Nine” or the “Company”) successfully completed an initial public offering of 7,000,000 shares of its common stock at $23.00 per share. In addition, the underwriters have exercised in full their option to purchase up to an additional 1,050,000 shares of Nine’s common stock. Nine’s shares trade on the New York Stock Exchange under the ticker symbol “NINE.”\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180123006606/en/\n“Nine’s entrance into the public markets represents a critical step in the evolution of the company as a leader in the North American completions sector. The IPO strengthens the company’s balance sheet and positions the Company to take advantage of future growth opportunities. We are incredibly proud of and thankful for the Nine team and all they have done to build the Company. We look forward to their journey ahead as a public company,” said Co-President, Andy Waite.\nNine Energy Service, Inc. is a leading North American onshore completion and production services provider that targets unconventional oil and gas resource development. Nine provides services to exploration and production customers across all major onshore basins in both the U.S. and Canada to design and deploy downhole solutions and technology to prepare horizontal, multistage wells for production. Nine is headquartered in Houston, Texas with operating facilities in the Permian, Eagle Ford, MidCon, Barnett, Bakken, Rockies, Marcellus, Utica and throughout Canada.\nSCF Partners, headquartered in Houston, Texas, with offices in Aberdeen, Singapore, Calgary and Houston, is a private equity firm focused solely on building energy services and equipment companies. SCF has completed more than 400 energy services investments and helped build 16 public companies in its nearly 30 year history. SCF partners with experienced operational management, assists with additional growth through acquisitions and geographic expansion initiatives to build longstanding companies within the energy services and equipment industries across the globe.\nJ.P. Morgan, Goldman Sachs & Co. LLC and Wells Fargo Securities are acting as joint book-running managers and as representatives of the underwriters for the offering. BofA Merrill Lynch and Credit Suisse are also acting as joint book-running managers for the offering. The offering of these securities will be made only by means of a prospectus that meets the requirements of Section 10 of the Securities Act of 1933. Copies of the written prospectus for the offering may be obtained, when available, from:\nJ.P. Morgan Securities LLC\nc/o Broadridge Financial Solutions\n1155 Long Island Avenue\nEdgewood, New York 11717\nTelephone: (866) 803-9204\nprospectus-eq_fi@jpmchase.com\nGoldman Sachs & Co. LLC\nAttention: Prospectus Department\n200 West Street\nNew York, New York 10282\nTelephone: (866) 471-2526\nprospectus-ny@ny.email.gs.com\nWells Fargo Securities, LLC\nAttention: Equity Syndicate Department\n375 Park Avenue\nNew York, New York 10152\nTelephone: (800) 326-5897\ncmclientsupport@wellsfargo.com\nImportant Information\nA registration statement relating to these securities has been filed with, and been declared effective by, the Securities and Exchange Commission (the “SEC”). The registration statement may be obtained free of charge at the SEC’s website at www.sec.gov under “Nine Energy Service, Inc.” This press release shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or jurisdiction.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006606/en/\nSCF Partners\nTheresa Eaton, 713-227-7888\nManaging Director\nteaton@scfpartners.com\nSource: SCF Partners", "external_links": ["http://www.businesswire.com/news/home/20180123006606/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov%2F&esheet=51747865&newsitemid=20180123006606&lan=en-US&anchor=www.sec.gov&index=1&md5=d06e411e59608d50cdafe0bfda404b3a"], "published": "2018-01-24T02:06:00.000+02:00", "crawled": "2018-01-24T03:28:20.000+02:00", "highlightTitle": ""}