{"organizations": [], "uuid": "b537cafc15c64114d63e4d288c80f9e79740bc67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-validant-names-brian-burns-as-ceo.html", "country": "US", "domain_rank": 767, "title": "Validant Names Brian Burns as CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.093, "site_type": "news", "published": "2018-01-09T16:05:00.000+02:00", "replies_count": 0, "uuid": "b537cafc15c64114d63e4d288c80f9e79740bc67"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-validant-names-brian-burns-as-ceo.html", "ord_in_thread": 0, "title": "Validant Names Brian Burns as CEO", "locations": [], "entities": {"persons": [{"name": "brian burns", "sentiment": "negative"}, {"name": "healy", "sentiment": "none"}, {"name": "validant", "sentiment": "none"}, {"name": "brian healy", "sentiment": "none"}, {"name": "burns", "sentiment": "none"}], "locations": [{"name": "validant", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "validant", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 9, 2018 /PRNewswire/ -- Today, Validant, the leading quality and regulatory services firm to global biotech, pharma and medical device companies, announced the appointment of Brian Burns as Chief Executive Officer. For the past two years, Burns has been Validant's President of Client Services, personally leading the company's Medical Device Portfolio with oversight of the entire client portfolio. In his new role, Burns will further develop Validant's service offerings for clients and will expand the company's global reach. Burns' appointment was effective January 4, 2018.\nBurns succeeds Brian Healy, who founded Validant in 2005. Under Healy's leadership, Validant established a top-tier client base and a highly effective service model leveraging the best of professional services and consulting. Healy becomes Chairman of the company's Board of Directors with immediate effect.\n\"Brian Burns' leadership skills, his track record of running quality and regulatory organizations for large public companies and his business acumen will allow Validant to further build on our record of unrivaled experience, skilled execution, and demonstrated results,\" Healy said. \"Under Brian's leadership, we will continue to grow as a global services provider, addressing the quality and regulatory needs of our clients.\" Burns' appointment was unanimously approved by the Board.\n\"I greatly appreciate the Board's confidence, and am delighted to take over as CEO and continue to drive Validant's excellence in the growing marketplace for our services,\" said Burns. \"This is an exciting time for the company, and I look forward to leading our talented management team, and to ensuring the growth of our enhanced services around the globe.\"\nIn his new role, Burns will continue working closely with Validant's seasoned team of Managing Partners. Representing an important element in Validant's evolution, this distinguished group includes: Bob Rhoades, who joined Validant in January 2017 to lead the Channel Partner Portfolio, following quality and compliance leadership roles at IQVIA (formerly Quintiles and QuintilesIMS), Solvay Pharmaceuticals, Bausch & Lomb and Baxter Healthcare; and John McShane, who joined Validant in August 2016 to lead the BioPharma Portfolio, following senior quality roles with Roche, Genentech and Abbott. Both Rhoades and McShane bring deep industry knowledge, and unmatched leadership and problem-solving acumen to Validant's organization and clients.\nPrior to joining Validant in January 2016, Burns, 53, spent 30 years in the Medical Industry. He served as an Executive Vice President of Global Quality and Regulatory Affairs at Haemonetics Corporation and Fresenius Medical Care, and as Executive Vice President of Global Quality, Medical Safety & Regulatory Affairs at Boston Scientific Corporation. He has also held senior positions with Cardinal Healthcare, Allegiance Healthcare, and Baxter Healthcare. Educated at the University of Arkansas, Burns has a Bachelor of Science degree in Chemical Engineering.\nAbout Validant\nAt Validant, our vision is to ensure safe and reliable access to the world's life-saving healthcare products. As the leading Quality, Compliance, and Regulatory consulting firm, we blend industry expertise with innovation to create custom solutions for companies at the frontiers of healthcare. The Validant network is the largest assembly of leading engineers, scientists, clinicians, and specialists in the field. With deep experience working within and alongside the U.S. Food and Drug Administration and health authorities around the world, we fully understand how to navigate the complexities facing today's healthcare industry. We have the proven capacity to handle any level of project, integrating seamlessly with your team to ensure that your product gets into the hands of the people who need it most, as soon as possible. We can rapidly deploy and scale for any project, anywhere.\nwww.validant.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/validant-names-brian-burns-as-ceo-300578516.html\nSOURCE Validant", "external_links": ["http://www.validant.com/", "http://www.prnewswire.com/news-releases/validant-names-brian-burns-as-ceo-300578516.html"], "published": "2018-01-09T16:05:00.000+02:00", "crawled": "2018-01-09T17:53:23.010+02:00", "highlightTitle": ""}