{"organizations": [], "uuid": "57db8693955e638b8798047c7770dd0c4d24e044", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225823132&w=1200&r=LYNXMPEE0Q0NF", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-gymnastics-usa-nassar-ag/michigan-ag-names-leaders-of-nassar-investigation-into-university-idUSKBN1FG0TF", "country": "US", "domain_rank": 408, "title": "Michigan AG names leaders of Nassar investigation into university", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T19:56:00.000+02:00", "replies_count": 0, "uuid": "57db8693955e638b8798047c7770dd0c4d24e044"}, "author": "", "url": "https://www.reuters.com/article/us-gymnastics-usa-nassar-ag/michigan-ag-names-leaders-of-nassar-investigation-into-university-idUSKBN1FG0TF", "ord_in_thread": 0, "title": "Michigan AG names leaders of Nassar investigation into university", "locations": [], "entities": {"persons": [{"name": "nassar", "sentiment": "negative"}, {"name": "william forsyth", "sentiment": "none"}, {"name": "bill shuette", "sentiment": "none"}, {"name": "daniel trotta", "sentiment": "none"}, {"name": "kriste kibbey etue", "sentiment": "none"}, {"name": "lisa von ahn", "sentiment": "none"}, {"name": "larry nassar", "sentiment": "none"}], "locations": [{"name": "kent county", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "michigan ag", "sentiment": "negative"}, {"name": "usa gymnastics", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "michigan state university", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 5:56 PM / in an hour Michigan special prosecutor to probe university in Nassar case Daniel Trotta 4 Min Read \n(Reuters) - Michigan’s attorney general on Saturday named a special prosecutor to lead an “open and ongoing” investigation of Michigan State University after campus sports doctor Larry Nassar sexually assaulted athletes over nearly 20 years. \nRetired Kent County Prosecutor William Forsyth was named independent special prosecutor and will produce a public report on his findings. He will work closely with Michigan State Police Director Kriste Kibbey Etue, Attorney General Bill Schuette said. \n“My department and this investigation will find out who knew what, and when,” said Schuette, who promised the probe would speak with each of the 156 known victims. \nThe case of Nassar, 54, has rocked Michigan State University, where he was a faculty member and physician at an on-campus clinic. He also worked for USA Gymnastics as a doctor to Olympic athletes, leading to the resignation of the entire board of the sport’s governing body. \nMichigan State University President Lou Anna Simon stepped down under pressure on Wednesday, and Athletic Director Mark Hollis announced his retirement on Friday. Both said they were unaware of Nassar’s abuse until it was reported publicly. \nCongress and the U.S. Olympic Committee are also investigating the Nassar case, with the U.S. House of Representatives examining allegations of sexual harassment by officials in other sports, including swimming and taekwondo. \nIngham County Judge Rosemarie Aquilina sentenced Nassar to 40 to 175 years in prison on Wednesday after he had pleaded guilty to sexual assault charges and some 150 victims told their stories in raw and unflinching terms. FILE PHOTO: Larry Nassar, a former team USA Gymnastics doctor, who pleaded guilty in November 2017 to sexual assault charges, returns from a break to listen to victim testimony in the courtroom during his sentencing hearing in Lansing, Michigan, U.S., January 23, 2018. REUTERS/Brendan McDermid/File Photo \nMany described how he penetrated their bodies with his fingers without permission, gloves or lubrication, claiming it was treatment for sports injuries.Nassar’s sentencing came amid a wave of sexual abuse and harassment allegations leveled against powerful men during the past year. Changing attitudes have led more women to denounce their abusers and be believed. \nAt Michigan State, athletes had been complaining about Nassar since the 1990s, but the university did not open an investigation until 2014. FILE PHOTO: Larry Nassar, a former team USA Gymnastics doctor, who pleaded guilty in November 2017 to sexual assault charges, is led from the courtroom after listening to victim testimony during his sentencing hearing in Lansing, Michigan, U.S., January 23, 2018. REUTERS/Brendan McDermid/File Photo \n“Let’s be very clear. No individual and no department at Michigan State University is off limits,” Schuette said on Saturday, without commenting on whether he expected the probe to produce more criminal charges. \nHe did not take questions from reporters at the televised address, during which he was flanked by Forsyth and Etue.Forsyth served as Kent County prosecutor for 40 years and chose not to seek re-election in 2016. \nHe had overseen more than 40 murder trials and occasionally handled high-profile prosecutions himself, such as the 2008 murder conviction of a man who shot and killed a Grand Rapids police officer, according to the Grand Rapids Press. \nForsyth said he was “outraged” by the Nassar case and wanted to know why nobody stopped his “predatory conduct” for almost 20 years. \n“Who at Michigan State knew and was aware of what he was doing because they had been told by some of these victims? And once told what did employees of Michigan State University do with that information?” Forsyth said. Reporting by Daniel Trotta in New York; Editing by Lisa Von Ahn and Daniel Wallis", "external_links": [], "published": "2018-01-27T19:56:00.000+02:00", "crawled": "2018-01-27T20:07:13.016+02:00", "highlightTitle": ""}