{"organizations": [], "uuid": "911ace9db2c36f2dbbad914db3ab8b3e8321ff52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/space-nuclear/u-s-tests-nuclear-power-system-to-sustain-astronauts-on-mars-idUSL1N1PC17M", "country": "US", "domain_rank": 408, "title": "U.S. tests nuclear power system to sustain astronauts on Mars", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.047, "site_type": "news", "published": "2018-01-19T03:14:00.000+02:00", "replies_count": 0, "uuid": "911ace9db2c36f2dbbad914db3ab8b3e8321ff52"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/space-nuclear/u-s-tests-nuclear-power-system-to-sustain-astronauts-on-mars-idUSL1N1PC17M", "ord_in_thread": 0, "title": "U.S. tests nuclear power system to sustain astronauts on Mars", "locations": [], "entities": {"persons": [], "locations": [{"name": "mars washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "mars", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. department of energy", "sentiment": "none"}, {"name": "nasa", "sentiment": "none"}, {"name": "national aeronautics and space administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan 18 (Reuters) - Initial tests in Nevada on a compact nuclear power system designed to sustain a long-duration NASA human mission on the inhospitable surface of Mars have been successful and a full-power run is scheduled for March, officials said on Thursday.\nOfficials from the National Aeronautics and Space Administration and U.S. Department of Energy, at a news conference in Las Vegas, detailed the development of the nuclear fission system under NASA’s Kilopower project.\nMonths-long testing of the system began in November at the energy department’s Nevada National Security Site, with an eye toward providing energy for future human and robotic missions in space and on the surface of Mars, the moon or other solar system destinations.\nA key hurdle for any lengthy human mission on the surface of a planet or moon, as opposed to NASA’s six short lunar surface visits from 1969 to 1972, is possessing a power source strong enough to meet the various energy needs to sustain a base but small and light enough to allow for transport through space.\n“Mars is a very difficult environment for power systems, with less sunlight than Earth or the moon, very cold nighttime temperatures, very interesting dust storms that can last weeks and months that engulf the entire planet,” said Steve Jurczyk, associate administrator of NASA’s Space Technology Mission Directorate.\n“So Kilopower’s compact size and robustness allows us to deliver multiple units on a single lander to the surface that provides tens of kilowatts of power,” Jurczyk added.\nTesting that has been completed on components of the system, dubbed KRUSTY, has been “greatly successful -- the models have predicted very well what has happened, and operations have gone smoothly,” said Dave Poston, chief reactor designer at the Los Alamos National Laboratory.\nOfficials said a full-power test will be conducted near the middle or end of March, a bit later than originally planned.\nPresident Donald Trump in December signed a directive intended to pave the way for a return to the moon, with an eye toward an eventual mission to Mars.\nThe new system could potentially supply the power human crews on the Martian surface would need to energize habitats and run processing equipment to transform resources such as ice on the planet into oxygen, water and fuel, NASA said.\nNASA’s prototype power system uses a uranium-235 reactor core described as roughly the size of a paper towel roll.\nReporting by Will Dunham; Editing by Tom Brown\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T03:14:00.000+02:00", "crawled": "2018-01-19T12:43:20.017+02:00", "highlightTitle": ""}