{"organizations": [], "uuid": "fa1281535e7e3bc024a28d1d3e47eaddc46afa10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-sharing-economy-international-enters-into-agreement-with-imusictech-regarding-potential-acquisition-to-implement-secured-music.html", "country": "US", "domain_rank": 767, "title": "Sharing Economy International Enters into Agreement with iMusicTech Regarding Potential Acquisition to Implement Secured Music Social Commerce Platform", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-18T14:30:00.000+02:00", "replies_count": 0, "uuid": "fa1281535e7e3bc024a28d1d3e47eaddc46afa10"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-sharing-economy-international-enters-into-agreement-with-imusictech-regarding-potential-acquisition-to-implement-secured-music.html", "ord_in_thread": 0, "title": "Sharing Economy International Enters into Agreement with iMusicTech Regarding Potential Acquisition to Implement Secured Music Social Commerce Platform", "locations": [], "entities": {"persons": [{"name": "parkson yip", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "sharing economy international, inc.", "sentiment": "neutral"}, {"name": "ec technology", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "ec technology & innovations ltd.", "sentiment": "none"}, {"name": "the company", "sentiment": "none"}, {"name": "ec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG, Jan. 18, 2018 /PRNewswire/ -- Sharing Economy International, Inc. (\"SEII\" or \"the Company\") (NASDAQ: SEII) today announced that its wholly-owned subsidiary, EC Technology & Innovations Ltd. (\"EC Technology\"), has entered into a non-binding memorandum of understanding with the shareholders of iMusicTech Limited (\"iMusicTech\"), regarding a potential acquisition by EC Technology of not less than 51% of iMusicTech.\niMusicTech develops music and sound hardware and software technologies. The iMusicTech team has extensive experience in sound engineering and mobile application development. iMusicTech is one of the early Licensed Software and Hardware developers to support Apple smart devices, and was the first Hong Kong IT company to implement ISO20000 and ISO2700I international standards.\n\"The Company's new strategy is to build sharing economy and commerce models across different vertical markets,\" said Parkson Yip, COO of SEII. \"Our new technology teams have a shared vision of building a secured transaction and application platform that provides an easy plug-and-play model for sharing economy application developers, where they do not have to worry about secured transaction handling. This transaction and application platform will facilitate the sharing of common transaction tokens, common user IDs, and a rich database of user sharing behaviors and interests across different sharing applications. With information provided by artificial intelligence engines, sharing applications that build on top of our Sharing Blocks can provide more targeted and personalized services to the users.\"\n\"The development of a music sharing platform extends our vision of sharing from commonly known workspaces, cars, tools, bicycles and personal trips further into intellectual property businesses. The iMusicShare platform and application allow musical artists and performers to monetize their work on this social commerce application. Through our secured transaction platform, which will be developed under our recent cooperation agreement with CoAssets, anyone can compose and perform music. According to Statista, the global online digital music market was approximately $7.8 billion in 2016. At the same time, China's social live video streaming market reached $3 billion in 2016. By combining both models, sharing music and performances on a social live streaming platform with music intellectual property commerce, we believe SEII can establish a new, large global market beyond these two existing markets.\"\n\"We are moving aggressively and rapidly in executing our sharing economy verticals. In order to achieve our goals in the most efficient way, we will continue to seek sharing platforms and technology partners with acquisition opportunities or forming new strategic cooperation partnerships.\"\nThere can be no assurances that the parties may enter into any agreement to do a transaction, and even if an agreement is entered into, there can be no assurances that such transaction will be consummated.\nAbout Sharing Economy International Inc.\nSharing Economy International Inc., through its affiliated companies, designs, manufactures and distributes a line of proprietary high and low temperature dyeing and finishing machinery to the textile industry. The Company's latest business initiatives are focused on targeting the technology and global sharing economy markets, by developing online platforms and rental business partnerships that will drive the global development of sharing through economical rental business models. Moreover, the Company will actively pursue blockchain technology in its existing and to-be-acquired business, enabling the general public to realize the beauty of resource sharing.\nAbout iMusicTech Limited\niMusicTech Limited was founded in 2008 and is an information technology company in Hong Kong. iMusicTech has strived to develop innovative technology in both hardware and software development of music and sound products and services. iMusicTech is the first IT company in Hong Kong implementing ISO20000 and ISO2700 international standard for IT Service Management and Security Award.\nSafe Harbor Statement\nThis release contains certain \"forward-looking statements\" relating to the business of the Company and its subsidiary and affiliated companies and certain potential transactions that they may enter into. These forward looking statements are often identified by the use of forward looking terminology such as \"believes,\" \"expects\" or similar expressions. Such forward looking statements involve known and unknown risks and uncertainties that may cause actual results to be materially different from those described herein as anticipated, believed, estimated or expected. The Company's actual results could differ materially from those anticipated in these forward-looking statements as a result of a variety of factors, including those discussed in the Company's periodic reports that are filed with the Securities and Exchange Commission and available on its website, including factors described in \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Form 10-K for the year ended December 31, 2016 and in our Form 10-Q for the quarter ended September 30, 2017. All forward-looking statements attributable to the Company or to persons acting on its behalf are expressly qualified in their entirety by these factors other than as required under the securities laws. The Company does not assume a duty to update these forward-looking statements.\nView original content:", "external_links": [], "published": "2018-01-18T14:30:00.000+02:00", "crawled": "2018-01-18T17:09:56.019+02:00", "highlightTitle": ""}