{"organizations": [], "uuid": "e360210c623d31198b42c2783e5de2decbb5add3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955387-GettyImages-506209662.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/why-fixing-the-arab-worlds-education-crisis-is-queen-ranias-top-priority.html", "country": "US", "domain_rank": 767, "title": "Why fixing the Arab world's education crisis is Queen Rania’s top priority", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.318, "site_type": "news", "published": "2018-01-26T17:46:00.000+02:00", "replies_count": 0, "uuid": "e360210c623d31198b42c2783e5de2decbb5add3"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/26/why-fixing-the-arab-worlds-education-crisis-is-queen-ranias-top-priority.html", "ord_in_thread": 0, "title": "Why fixing the Arab world's education crisis is Queen Rania’s top priority", "locations": [], "entities": {"persons": [{"name": "rania", "sentiment": "negative"}, {"name": "rania al abdullah", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "queen rania foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Urgent action needs to be taken to fix the education crisis afflicting the Arab region, Queen Rania Al Abdullah of Jordan told CNBC on Thursday.\nThe Jordanian royal highlighted how over 15 million children in the region don't go to school and that providing them with access to quality education could improve their lives.\n\"Our region has had its fair share of headline-grabbing crises, but I think one crisis that hasn't made it to the headlines is the education crisis,\" she said at \" The Sanctuary \" at the World Economic Forum (WEF) in Davos, Switzerland.\n\"We have over 15 million children, in my part of the world, who don't attend school, because of conflict and displacement. And even those who attend school will tell you that access doesn't necessarily ensure quality. So, they're getting an education that's not relevant for today's job market, let alone preparing them for the future. And that is really a crisis for us.\"\nQueen Rania told CNBC that there was no time to wait on fixing the crisis, as education ministries in the Arab region were \"already overwhelmed, under-resourced and bureaucratic\" to take the necessary actions.\n\"We really need to take urgent action, because we can't wait. We need to look at some of the tools that are available today. So, applying innovation to education is something that I am very much focused on in my foundation,\" she said.\nshow chapters International response to refugee crisis has been 'lacking': Queen Rania 10:05 AM ET Thu, 25 Jan 2018 | 03:33 In 2013, she established the Queen Rania Foundation (QRF), which aims to become the leading resource on key issues surrounding education in Jordan and the Arab region.\nThe foundation is behind such initiatives as Edraak , a massive open online course (MOOC) platform, while it has also having been affiliated with other organizations including the Queen Rania Teacher Academy (QRTA) and Madrasati, both of which provide resources and support in the education field.\nAt present, Edraak is being developed to become a platform that offers children access to free, quality world-class education from a young age, rather than just focus on adult learners.\nWhile Queen Rania places education at the top of her priority list, she sees education being potentially sidelined as ministries deal with pressing issues such as war, politics and conflict.\nThe royal said, however, that while education may reap benefits in the long-term, if it isn't prioritized now, children's future prospects will continue to be affected.\nWho said what at Davos 2018 FABRICE COFFRINI | AFP | Getty Images \"For me, it is the most important thing. It is the game changer. It is the thing that can, sort of change the trajectory for the Arab world, and tip the scales towards a more hopeful future for us all,\" she said.\n\"I always say, a child that's denied an education isn't just a tragedy for that child. It leaves the rest of us vulnerable, because, as you know now, conflict is mobile. A problem, anywhere in the world, can reach our doorstep.\n\"So in order to protect ourselves, we really need to empower (children) with the right kind of skills and knowledge, so that they're not vulnerable to extremists who feed on the hopeless. So, education, I think, is the strongest intervention that we can make.\"\nLike this story? Like CNBC Make It on Facebook .\nDon't miss:\nWWE's Stephanie McMahon: It's OK to make mistakes — as long as you learn from them\nWhy taking care of the 'human capital' of your employees is vital: Arianna Huffington\nHow Melinda Gates went from 'behind the scenes' to fronting the Gates Foundation\nshow chapters Women take center stage at Davos 2018 6:49 AM ET Wed, 24 Jan 2018 | 02:59", "external_links": [], "published": "2018-01-26T17:46:00.000+02:00", "crawled": "2018-01-26T17:46:54.010+02:00", "highlightTitle": ""}