{"organizations": [], "uuid": "f13948ca9d67d3e5a254cb0daf5e9b34fd76dddf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-southern-land-company-completes-national-search-hires-marty-posthauer-as-president-of-commercial-construction.html", "country": "US", "domain_rank": 767, "title": "Southern Land Company Completes National Search, Hires Marty Posthauer as President of Commercial Construction", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:57:00.000+02:00", "replies_count": 0, "uuid": "f13948ca9d67d3e5a254cb0daf5e9b34fd76dddf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-southern-land-company-completes-national-search-hires-marty-posthauer-as-president-of-commercial-construction.html", "ord_in_thread": 0, "title": "Southern Land Company Completes National Search, Hires Marty Posthauer as President of Commercial Construction", "locations": [], "entities": {"persons": [{"name": "marty posthauer", "sentiment": "neutral"}, {"name": "tim downey", "sentiment": "none"}, {"name": "posthauer", "sentiment": "none"}, {"name": "marty", "sentiment": "none"}], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}], "organizations": [{"name": "southern land company completes national search", "sentiment": "neutral"}, {"name": "southern land company", "sentiment": "none"}, {"name": "southern land co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Posthauer brings more than 30 years’ experience to Southern Land, having managed the delivery of billions of dollars in significant projects in commercial and residential sectors; He will oversee the execution and construction of projects nationwide for Southern Land\nNASHVILLE, Tenn.--(BUSINESS WIRE)-- Southern Land Company , a national real estate developer of mixed-use developments and master planned communities, today announces the hiring of Marty Posthauer as President of Commercial Construction.\nPosthauer was identified after a national search to fill the strategically important role for the company during a time where it has increased development and expanded its national project footprint. In the role, Posthauer will oversee all construction operations for each project including, project executives, construction managers, engineers and estimators specializing in high-rise and mixed-use development.\n“We’re thrilled to have added Marty to the Southern Land family during a time of increased scope and expansion for our company,” said Tim Downey, founder and CEO of Southern Land Company. “Marty delivers a wealth of knowledge and experience to our construction and development process. At Southern Land, we strive to create unique and beautiful environments that enhance people’s lives and the communities they live in. Marty will play the leading role in taking our dreams and making them reality.”\nSouthern Land Company, based in Nashville, Tenn., stands out in its ability to execute in-house disciplines at all stages of the development cycle of new commercial, single-family, and multifamily communities. Posthauer will work to ensure the company’s high-end internal capabilities shine bright through the construction process and in the completed product.\nPosthauer brings with him more than 30 years of experience to the position, including management of significant projects in the commercial and residential sectors. Before joining Southern Land Company, he was a Senior Vice President of Construction focused on mixed-use residential developments, completing numerous projects valued at over $400 million in this position. He also previously served as President and CEO of Tauer, LLC and TCR SE construction.\nNotably, throughout his career he has been integrally involved in the construction of numerous high rise buildings, including:\n2500 Peachtree, Atlanta, GA The Wakefield, Atlanta, GA The Ovation, Atlanta, GA The Luxe, Atlanta, GA Vinings Mountain Condominiums, Atlanta, GA St. Regis Hotel and Condominiums, Atlanta, GA The Hue, Raleigh, NC 222 Glenwood, Raleigh, NC The Phoenix, Sarasota, FL The Standard, Gainesville, FL The Metropolitan, Happy Valley, PA\nBeyond high-rises, he has managed construction of more than $3 billion in multifamily, midrise and mixed-use projects throughout the country. This equates to over 100 projects and 30,000 living units in total.\nPosthauer graduated with honors from Purdue University with a Bachelor of Science degree in Building Construction Technology.\nAcross its footprint nationwide, Southern Land Company employs approximately 300 individuals. It has executed 22 large scale projects across the country and is actively acquiring more land and planning more activity.\nFor more information, visit: www.southernland.com .\nAbout Southern Land Company\nSouthern Land Company builds quality communities that enhance the lives of residents and tenants across the United States. With a comprehensive set of services that span the entire development cycle, Southern Land Company delivers distinctive settings where people want to live, work and shop. By upholding stringent standards for single-family, multifamily and mixed-use developments, the company creates projects with long-term viability that investors, residents, employees and partners can rely on. Founded in 1986, Southern Land Company is headquartered in Nashville, TN and develops properties in several key U.S. markets. www.southernland.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109006169/en/\nFor Southern Land Company\nJustin Wilson, 615-242-8856\njustin@hallstrategies.com\nSource: Southern Land Company", "external_links": ["http://www.businesswire.com/news/home/20180109006169/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.southernland.com&esheet=51740334&newsitemid=20180109006169&lan=en-US&anchor=www.southernland.com&index=3&md5=faa16b6449d9968f629740350dce692a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fsouthernland.com%2F&esheet=51740334&newsitemid=20180109006169&lan=en-US&anchor=Southern+Land+Company&index=1&md5=2d63178c79ac46d159291e008e31a6ef", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.southernland.com&esheet=51740334&newsitemid=20180109006169&lan=en-US&anchor=www.southernland.com&index=2&md5=57bdf325385c12f55d35a4076c1cbd1d"], "published": "2018-01-09T17:57:00.000+02:00", "crawled": "2018-01-09T18:53:06.017+02:00", "highlightTitle": ""}