{"organizations": [], "uuid": "d1e0b46d56bfb3fdc431c94bf12ac5899ca72e0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219278226&w=1200&r=LYNXMPEE030HV", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-economy-pmi/uk-services-survey-points-to-stronger-fourth-quarter-growth-ihs-markit-idUKKBN1ET0XT", "country": "US", "domain_rank": 408, "title": "UK services survey points to stronger fourth quarter growth - IHS Markit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T11:48:00.000+02:00", "replies_count": 0, "uuid": "d1e0b46d56bfb3fdc431c94bf12ac5899ca72e0d"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-economy-pmi/uk-services-survey-points-to-stronger-fourth-quarter-growth-ihs-markit-idUKKBN1ET0XT", "ord_in_thread": 0, "title": "UK services survey points to stronger fourth quarter growth - IHS Markit", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "canary wharf", "sentiment": "none"}], "organizations": [{"name": "ihs", "sentiment": "negative"}, {"name": "ihs markit david milliken   britain", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ihs markit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 9:37 AM / Updated 20 minutes ago UK firms report brighter Q4, consumers slow borrowing David Milliken , Andy Bruce 4 Min Read \nLONDON (Reuters) - Britain’s economy appears to have picked up some speed in late 2017 and businesses grew more upbeat about 2018, a closely watched survey showed on Thursday, little more than a year before the country is due to exit the European Union. The Canary Wharf financial district is seen at dusk in London, Britain, November 17, 2017. REUTERS/Toby Melville \nSeparate data showed consumers reined in their borrowing - welcome news for the Bank of England, which has leaned on banks to reduce risky lending. \nThe monthly IHS Markit/CIPS surveys of businesses signalled Britain’s economy probably grew 0.4 to 0.5 percent in the fourth quarter, slightly faster than official growth data for the previous quarter. \nBut there were signs that Brexit is weighing on businesses’ investment plans, a “health warning” for the sustainability of Britain’s economy, data company IHS Markit said. \nThe survey also suggested growth in Britain’s economy in December lagged that of the euro zone by some margin. \nThe economy largely withstood the immediate shock of the referendum decision in 2016 to leave the EU. But it felt more of an impact in 2017 due to higher inflation - caused by the post-referendum fall in the pound that hurt consumers - and uncertainty among businesses about what Brexit means for them. \nSeparately on Thursday, the Bank of England said consumers increased their borrowing by the smallest amount since mid-2015 in the three months to November. This reinforced official data last month which showed household spending rose in the third quarter at the slowest pace since 2012. \nKallum Pickering, an economist at Berenberg, said the IHS Markit/CIPS survey put the economy on course for growth of around 1.8 percent for 2017 as a whole - better than most forecasters expected. \n“(But) the uncertainty from Brexit prevented the UK from fully enjoying the tailwind from the synchronised global upswing,” he said. “Without Brexit, the UK economy would have expanded by at least 2.5 percent last year.” LENDING SURGE SLOWS AGAIN \nThe IHS Markit/CIPS services Purchasing Managers’ Index (PMI) rose to 54.2 in December, its second-highest reading since April, beating forecasts in a Reuters poll that it would remain at November’s 53.8. \nThe PMI survey was conducted from Dec. 5 to Dec. 19, so included responses both before and after Prime Minister Theresa May gained agreement from the EU to move Brexit talks on to discuss transitional arrangements and a longer-term trade deal. \nHowever, British retailers - who are not included in the PMI - have reported mixed fortunes over the Christmas period. \nMajor clothing chain Next ( NXT.L ) said on Wednesday that colder-than-usual weather had given an extra boost to demand, but department store operator Debenhams ( DEB.L ) issued a profit warning. \nSome consumers have relied on borrowing to keep up their spending, something many economists say looks likely to slow as wage growth remains weak. \nThe Bank of England said unsecured consumer lending in the three months to November grew at its weakest pace since June 2015, up by an annualised 8.5 percent. That was down from 9.3 percent in the three months to October. \nThe BoE has played down any suggestion of a debt bubble, though it has acknowledged pockets of risk and required banks to set aside more money against the risk of bad loans. \nBusiness lending showed the weakest growth since May 2016, an echo of the caution shown in the PMI survey. \nNet mortgage approvals for house purchase were at the higher end of economist forecasts at 65,139 in November compared with 64,887 in October, after a run of three monthly declines. \nEarlier on Thursday, mortgage lender Nationwide said house prices overall last year grew at their slowest pace since 2012, and fell in London for the first time since 2009. Editing by William Schomberg/Mark Heinrich", "external_links": [], "published": "2018-01-04T11:48:00.000+02:00", "crawled": "2018-01-04T12:00:37.028+02:00", "highlightTitle": ""}