{"organizations": [], "uuid": "3f0ca3f25bd683bb81e659054cdb9e8fc224217c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226625774&w=1200&r=LYNXMPEE0T10O", "site_section": "https://www.reuters.com/home", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-germany-wages/german-industrial-strikes-to-hit-daimler-porsche-idUSKBN1FJ20K", "country": "US", "domain_rank": 408, "title": "German industrial strikes to hit Daimler, Porsche", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T22:39:00.000+02:00", "replies_count": 0, "uuid": "3f0ca3f25bd683bb81e659054cdb9e8fc224217c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-wages/german-industrial-strikes-to-hit-daimler-porsche-idUSKBN1FJ20K", "ord_in_thread": 0, "title": "German industrial strikes to hit Daimler, Porsche", "locations": [], "entities": {"persons": [{"name": "porsc", "sentiment": "negative"}, {"name": "bosch", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "porsche frankfurt", "sentiment": "negative"}, {"name": "daimler", "sentiment": "negative"}, {"name": "ig metall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 2:39 PM / in 2 minutes German industrial strikes to hit Daimler, Porsche Reuters Staff 3 Min Read \nFRANKFURT (Reuters) - Workers at German companies including carmakers Daimler ( DAIGn.DE ) and Porsche ( VOWG_p.DE ) and automotive supplier Bosch are set to stage strikes over the coming days amid a row over wages and working hours, union IG Metall said. \nWalkouts lasting 24 hours at a time will begin late on Tuesday and run until Friday, the union has said, after its members voted overwhelmingly in favor of action after last-ditch regional talks over wages and working hours failed to reach a deal at the weekend. \nEmboldened by the fastest economic growth in six years and record low unemployment, the union is demanding an 8 percent pay rise over 27 months for 3.9 million metals and engineering workers across Germany. \nThe union has also asked for workers to be given the right to reduce their weekly hours to 28 from 35 to care for children, elderly or sick relatives, and return to full time after two years. \nEmployers have offered a 6.8 percent increase but have rejected the demand for shorter hours unless they can also increase workers’ hours when necessary. \nNearly a million workers have already taken part in short walkouts lasting no more than a few hours at a time across the country this month to support IG Metall’s demands. Slideshow (2 Images) \nAn escalation to 24-hour strikes is the union’s last warning shot before it ballots for extended industrial action that could be crippling to companies reliant on a well-oiled supply chain of car parts and other components. \nAcross Germany, around 260 companies are expected to be affected by walkouts this week. \nWorkers at automotive supplier ZF Friedrichshafen in the southwestern state of Baden-Wuerttemberg will go on strike from 5 am local time (0400 GMT) on Wednesday, while staff at Mercedes-Benz maker Daimler and sportscar firm Porsche will walk out on Friday, IG Metall said. \n“The employers haven’t sufficiently budged in negotiations, now we are going to push them into action with full-day warning strikes,” said Roman Zitzelsberger, head of IG Metall in Baden-Wuerttemberg, where 16 hours of negotiations failed to yield a deal. \nTo the north, workers at Kion’s ( KGX.DE ) Still brand of forklift trucks in Hamburg and at valve maker Gestra in Bremen will down their tools. \nBoth the union and the employers have left the door open to resuming talks after the planned strikes end on Friday but each said they demanded more willingness to make concessions. Reporting by Maria Sheahan; Editing by Gareth Jones", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T22:39:00.000+02:00", "crawled": "2018-01-30T16:45:14.000+02:00", "highlightTitle": ""}