{"organizations": [], "uuid": "832fc00673d52fc99b92108c1c1605e7296710d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-precious-investments-inc-announces-acquisition-of-american-freight-xchange-inc.html", "country": "US", "domain_rank": 767, "title": "Precious Investments, Inc. Announces Acquisition of American Freight Xchange, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:27:00.000+02:00", "replies_count": 0, "uuid": "832fc00673d52fc99b92108c1c1605e7296710d3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-precious-investments-inc-announces-acquisition-of-american-freight-xchange-inc.html", "ord_in_thread": 0, "title": "Precious Investments, Inc. Announces Acquisition of American Freight Xchange, Inc.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mississauga, Ontario, Canada, Jan. 31, 2018 (GLOBE NEWSWIRE) -- Precious Investments, Inc. (OTC Markets “PNIK”) (the “Company” or “Precious”) announces that it completed the acquisition of American Freight Xchange, Inc., and American Freight Xchange, Inc.’s wholly owned subsidiary, KRG Logistics, Inc., of Mississauga, Ontario, Canada, a third-party logistics provider focusing on e-commerce fulfillment and transportation for over twenty years.\nRonald Schapps, our Chairman, stated, “We are very excited about our change in direction for the Company. This is step one in building a fully integrated end-to-end logistics and fulfillment company.”\nThe new Corporate offices for Precious are located at 170 Trader Blvd. East, Mississauga, Ontario, Canada L4Z 1W7.\nIn addition, Precious has retained new Independent Auditors, the firm of BMKR, LLP, of Hauppauge, NY, a PCOAB member firm, as described in the Company’s 8-K filing, of January 12, 2018, with the Securities and Exchange Commission. Precious is working aggressively with the Auditor to complete the Company’s missing filings, including the audit for the fiscal year 2107, and get the Company current as quickly as possible.\nAmerican Freight Xchange, Inc.’s subsidiary, KRG Logistics, is an integrated 3PO and logistics company. KRG Logistics is engaged in the business of the fulfillment of e-commerce transportation and logistics for third parties. American Freight Xchange, Inc. manages the entire “logistics process”. The Company’s freight management program obtains the most effective combination of rates, carriers, tracking and service points to pick up returned products from store and distribution center levels with centralized billing, auditing and claims capabilities.\nAmerican Freight Xchange, Inc., through our wholly owned subsidiary KRG Logistics, Inc. ( www.krglogistics.com ) has the expertise to manage and provide North American Manufacturers and Retailers a true SINGLE SOURCE Supply Chain Solution. Due to our strategic placement in the supply chain relative to the manufacturers, retailers and distributors position, the Company is best suited to provide these services. American Freight Xchange, Inc. customizes freight management and fulfillment programs that provide manufacturers and retailers with the most cost-effective end-to-end services from the moment the shipment authorization is issued to the time the product is shipped and received.\nFORWARD LOOKING STATEMENTS\nThe information contained herein includes forward-looking statements. These statements relate to future events or to our future financial performance, and involve known and unknown risks, uncertainties and other factors that may cause our actual results, levels of activity, performance, or achievements to be materially different from any future results, levels of activity, performance or achievements expressed or implied by these forward-looking statements. You should not place undue reliance on forward-looking statements since they involve known and unknown risks, uncertainties and other factors which are, in some cases, beyond our control and which could, and likely will, materially affect actual results, levels of activity, performance or achievements. Any forward-looking statement reflects our current views with respect to future events and is subject to these and other risks, uncertainties and assumptions relating to our operations, results of operations, growth strategy and liquidity. We assume no obligation to publicly update or revise these forward-looking statements for any reason, or to update the reasons actual results could differ materially from those anticipated in these forward-looking statements, even if new information becomes available in the future.\nContact: Precious Investments, Inc. 631-994-3242 info@preciousinvestments.net\nSource: Precious Investments, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=Kh-V6rERTRLvhXcL5Tbg_eSrU20tUz7Va69GT3VUswsMhYi3s5Xs9kKI6iPRHsQGwH776EGh8WtsCPST6cIfjQqe0dcei9Wk0Mp46eDotBE="], "published": "2018-01-31T19:27:00.000+02:00", "crawled": "2018-01-31T20:34:08.007+02:00", "highlightTitle": ""}