{"organizations": [], "uuid": "aaa867dbdd905bfb48d5fc5fbf6cc3174ec96c87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-celestica-announces-fourth-quarter-and-full-year-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Celestica Announces Fourth Quarter and Full Year 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:16:00.000+02:00", "replies_count": 0, "uuid": "aaa867dbdd905bfb48d5fc5fbf6cc3174ec96c87"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-celestica-announces-fourth-quarter-and-full-year-2017-financial-results.html", "ord_in_thread": 0, "title": "Celestica Announces Fourth Quarter and Full Year 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "celestica inc.", "sentiment": "negative"}, {"name": "celestica", "sentiment": "negative"}, {"name": "globe newswire", "sentiment": "negative"}, {"name": "advanced technology solutions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 24, 2018 (GLOBE NEWSWIRE) -- Celestica Inc. (TSX:CLS) (NYSE:CLS), a leader in design, manufacturing and supply chain solutions for the world's most innovative companies, today announced financial results for the fourth quarter and year ended December 31, 2017.\nFourth Quarter 2017 Highlights\nRevenue: $1.55 billion, compared to our previously provided guidance range of $1.5 to $1.6 billion, decreased 4% compared to the fourth quarter of 2016 Revenue dollars from our Advanced Technology Solutions (ATS)* end market increased 6% compared to the fourth quarter of 2016, and represented 33% of total revenue, compared to 29% of total revenue for the fourth quarter of 2016 Revenue dollars from our Communications end market decreased 12% compared to the fourth quarter of 2016, and represented 40% of total revenue, compared to 44% of total revenue for the fourth quarter of 2016 Revenue dollars from our Enterprise* end market decreased 4% compared to the fourth quarter of 2016, and represented 27% of total revenue for both the fourth quarter of 2016 and 2017 IFRS EPS: $0.10 per share, compared to $0.15 per share for the fourth quarter of 2016. IFRS EPS for the fourth quarter of 2016 included a net benefit of $0.07 per share related to income taxes (Tax Benefit) (discussed below) Adjusted EPS (non-IFRS)**: $0.27 per share, compared to our previously provided guidance range of $0.27 to $0.33 per share, and $0.41 per share for the fourth quarter of 2016. Adjusted EPS for the fourth quarter of 2016 included the $0.07 per share Tax Benefit Operating margin (non-IFRS)**: 3.3%, compared to 3.6% at the mid-point of our expectations, and 3.8% for the fourth quarter of 2016 Adjusted ROIC (non-IFRS)**: 17.0%, compared to 22.7% for the fourth quarter of 2016 Free cash flow (non-IFRS)**: $18.8 million, compared to $69.3 million for the fourth quarter of 2016 Recorded restructuring charges of $13.2 million ($0.09 per share negative impact on IFRS EPS), compared to $24.4 million ($0.17 per share negative impact on IFRS EPS) for the fourth quarter of 2016 (discussed below) Launched a new normal course issuer bid (NCIB) in November 2017, pursuant to which we repurchased and cancelled 1.9 million subordinate voting shares for $19.9 million (including transaction fees)\n* Our Advanced Technology Solutions (ATS) end market is comprised of our aerospace and defense, industrial, smart energy, healthcare, semiconductor equipment, and consumer businesses. Our Enterprise end market is comprised of our servers and storage businesses.\n** See “Non-IFRS Supplementary Information” below for information on our rationale for the use of non-IFRS measures, and Schedule 1 for, among other items, non-IFRS measures included in this press release, as well as their definitions, uses, and a reconciliation of non-IFRS to IFRS measures.\nFull Year 2017 Highlights\nRevenue: $6.1 billion, increased 2% compared to $6.0 billion for 2016 Revenue of $1.95 billion from our ATS* end market was relatively flat compared to 2016, as growth from strong demand and new programs offset the 7% revenue decline due to our exit from the solar panel business. ATS represented 32% of total revenue for both 2016 and 2017 Revenue from our Communications end market increased 4%, and represented 43% of total revenue, compared to 42% of total revenue for 2016 Revenue from our Enterprise* end market was relatively flat compared to 2016, and represented 25% of total revenue, compared to 26% of total revenue for 2016 IFRS EPS: $0.72 per share, compared to $0.95 per share for 2016. IFRS EPS for 2016 included a Tax Benefit of $0.22 per share (discussed below) Adjusted EPS (non-IFRS)**: $1.19 per share, compared to $1.40 per share in 2016. Adjusted EPS for 2016 included the $0.22 per share Tax Benefit Operating margin (non-IFRS)**: 3.5%, compared to 3.7% for 2016 Adjusted ROIC (non-IFRS)**: 19.1%, compared to 20.8% for 2016 Free cash flow (non-IFRS)**: $21.0 million, compared to $110.2 million for 2016 Recorded restructuring charges of $28.9 million ($0.20 per share negative impact on IFRS EPS), compared to $31.9 million ($0.22 per share negative impact on IFRS EPS) for 2016 (discussed below)\n“Our fourth quarter results reflect continued progress in diversifying and growing our ATS revenue base, offset by lower revenues and adverse mix impacts from some of our communications and enterprise programs,” said Rob Mionis, President and CEO, Celestica. “Over the past two years, our strategic focus has been to diversify our revenue base by growing our ATS product portfolios, specifically in the aerospace and defense market, and we are seeing some positive and consistent results. While we still have more work to do, we are entering 2018 with more than $2 billion in sales from a growing and attractive ATS portfolio mix. We will look to grow that business through new program wins and targeted acquisitions that support our longer-term goals of having a highly diversified revenue stream, underpinned by industry leading returns.”\n“The company’s balance sheet remains strong. As we continue to execute on our diversification plans, in part through targeted acquisitions intended to increase both our scale and capabilities in our ATS businesses, we expect to complement those investments by continuing to return cash to our shareholders through repurchases under our NCIB.”\n* Our Advanced Technology Solutions (ATS) end market is comprised of our aerospace and defense, industrial, smart energy, healthcare, semiconductor equipment, and consumer businesses. Our Enterprise end market is comprised of our servers and storage businesses.\n** See “Non-IFRS Supplementary Information” below for information on our rationale for the use of non-IFRS measures, and Schedule 1 for, among other items, non-IFRS measures included in this press release, as well as their definitions, uses, and a reconciliation of non-IFRS to IFRS measures.\nFourth Quarter and Full Year Summary\nThree months ended Year ended December 31 December 31 2016 2017 2016 2017 Revenue (in millions) $ 1,623.7 $ 1,553.9 $ 6,016.5 $ 6,110.5 IFRS net earnings (in millions) $ 20.9 $ 14.4 $ 136.3 $ 105.0 IFRS EPS $ 0.15 $ 0.10 $ 0.95 $ 0.72 Non-IFRS adjusted net earnings (in millions) $ 59.5 $ 39.7 $ 200.9 $ 172.3 Non-IFRS adjusted EPS $ 0.41 $ 0.27 $ 1.40 $ 1.19 Non-IFRS adjusted return on invested capital (adjusted ROIC) 22.7 % 17.0 % 20.8 % 19.1 % Non-IFRS operating margin 3.8 % 3.3 % 3.7 % 3.5 % Notes to Table\nInternational Financial Reporting Standards (IFRS) earnings per share (EPS) for the fourth quarter of 2017 included an aggregate charge of $0.15 (pre-tax) per share for employee stock-based compensation expense, amortization of intangible assets (excluding computer software) and restructuring charges. We provided a range on October 26, 2017 of between $0.09 to $0.15 per share for these items (see the tables in Schedule 1 attached hereto for per-item charges).\nIFRS EPS for the fourth quarter of 2017 included a $0.09 per share negative impact resulting from restructuring charges related to the completion of actions previously identified as part of our organizational design (OD) and global business services (GBS) initiatives, as well as restructuring charges incurred in connection with our new cost efficiency initiative discussed under \"Restructuring Update\" below. IFRS EPS for the fourth quarter of 2016 included a $0.17 per share negative impact resulting from restructuring charges related to our OD and GBS initiatives, and our exit from the solar panel manufacturing business. We recorded restructuring charges totaling approximately $21 million in the fourth quarter of 2016 related to the closure of our solar panel manufacturing operations at our two locations, including a $19 million impairment charge to write down the carrying value of our solar manufacturing equipment to recoverable amounts. IFRS EPS for the year ended December 31, 2017 (FY 2017) included a $0.20 per share negative impact resulting from restructuring activities relating primarily to our OD and GBS initiatives, the rationalization of our operations in the third quarter of 2017, the write down of the carrying value of our solar panel manufacturing equipment to recoverable amounts, and our cost efficiency initiative in the fourth quarter of 2017. IFRS EPS for the year ended December 31, 2016 (FY 2016) included a $0.22 per share negative impact resulting from restructuring charges primarily related to our OD and GBS initiatives, and our exit from the solar panel manufacturing business. See note 12 to our December 31, 2017 unaudited interim condensed consolidated financial statements (Interim Financial Statements).\nAs a result of certain immaterial offsetting items, there was no significant net impact to our tax expense on IFRS EPS and adjusted EPS (non-IFRS) for the fourth quarter of 2017 and FY 2017. IFRS EPS and adjusted EPS (non-IFRS) for the fourth quarter of 2016 were favorably impacted by a $0.07 per share net benefit related to income taxes, comprised of a $0.10 per share income tax recovery attributable to the resolution of certain previously disputed tax matters in Canada, (including related refund interest income), and a $0.03 per share favorable deferred tax recovery, offset in part by a $0.06 per share income tax expense related to taxable foreign exchange resulting from the weakening of the Malaysian ringgit and Chinese renminbi relative to the U.S. dollar (Currency Expense). IFRS EPS and adjusted EPS (non-IFRS) for FY 2016 were favorably impacted by an aggregate $0.22 per share net benefit related to income taxes, comprised of a $0.34 per share income tax recovery attributable to the resolution in the second half of 2016 of certain previously disputed tax matters in Canada (including related refund interest income), offset in part by an aggregate $0.07 per share negative impact from current and deferred withholding taxes, as well as a $0.05 per share Currency Expense. See note 13 to our Interim Financial Statements.\nOur non-IFRS operating margin of 3.3% for the fourth quarter of 2017 was negatively impacted by late demand changes from certain customers, the timing of which prevented us from reducing certain variable production costs in light of the lower volumes.\nNon-IFRS measures do not have any standardized meaning prescribed by IFRS and therefore may not be comparable to similar measures presented by other public companies that use IFRS or other generally accepted accounting principles (GAAP). See “Non-IFRS Supplementary Information” below for information on our rationale for the use of non-IFRS measures, and Schedule 1 for, among other items, non-IFRS measures included in this press release, as well as their definitions, uses, and a reconciliation of non-IFRS to IFRS measures.\nEnd Markets by Quarter as a Percentage of Total Revenue\nAs previously disclosed, commencing in the first quarter of 2017, we aligned our end markets into two customer focused areas: Advanced Technology Solutions (ATS) and Connectivity & Cloud Solutions (CCS). Our ATS end market consists of our former Diversified and Consumer end markets, and is comprised of our aerospace and defense, industrial, smart energy, healthcare, semiconductor equipment, and consumer businesses. CCS consists of our Communications and Enterprise end markets. Our Enterprise end market is comprised of our servers and storage businesses, which were combined into one end market as a result of their converging technologies. All period percentages herein reflect these changes.\n2016 2017 Q1 Q2 Q3 Q4 FY Q1 Q2 Q3 Q4 FY ATS 37 % 33 % 32 % 29 % 32 % 34 % 31 % 31 % 33 % 32 % Communications 38 % 41 % 43 % 44 % 42 % 42 % 44 % 45 % 40 % 43 % Enterprise 25 % 26 % 25 % 27 % 26 % 24 % 25 % 24 % 27 % 25 % Revenue (in billions) $1.35 $1.49 $1.55 $1.62 $6.02 $1.47 $1.56 $1.53 $1.55\n$6.11 Anticipated Acquisition to Broaden Capabilities in the Aerospace and Defense Market\nWe announced today that we entered into a definitive agreement to acquire U.S.-based Atrenne Integrated Solutions, Inc. (Atrenne), a leading designer and manufacturer of ruggedized electromechanical solutions, primarily for military and commercial aerospace applications. This acquisition is intended to advance our strategic direction to expand our capabilities, improve our diversification, and bolster our leadership position within the aerospace and defense market. The purchase price for Atrenne is approximately $139 million (subject to specific adjustments as set forth in the definitive agreement), which we intend to finance with a combination of cash on hand and our Revolving Facility (as defined herein). The transaction is expected to close in the second quarter of 2018, subject to receipt of applicable regulatory approvals and satisfaction of other customary closing conditions. However, there can be no assurance that this acquisition will be consummated in a timely manner, or at all.\nRestructuring Update\nWe recorded $6.6 million of restructuring charges during the fourth quarter of 2017 to complete actions previously identified as part of our OD and GBS initiatives, and an additional $8.0 million of restructuring charges in connection with our new cost efficiency initiative (described below). We also recorded non-cash impairment recoveries of $1.4 million (through restructuring charges) to write up the carrying value of our solar panel manufacturing equipment based on executed sale agreements (previous write downs during 2017 were based on then-broker estimates).\nIn response to challenging markets and continued margin pressures, we announced in October 2017 our intention to implement additional restructuring actions in the near term to further streamline our business and improve our margin performance, and engaged an outside consultant to identify cost reduction opportunities throughout our network, including through increased operational efficiencies and productivity improvements. In connection therewith, we have commenced the implementation of additional restructuring actions under a new cost efficiency initiative. Such initiative will include reductions to our workforce, as well as potential consolidation of certain sites to better align capacity and infrastructure with current and anticipated customer demand. We currently estimate that we will incur aggregate restructuring charges of between $50 million and $75 million with respect to our cost efficiency initiative, including $8.0 million in restructuring charges that we recorded in connection therewith in the fourth quarter of 2017. We currently expect the restructuring charges under this initiative to continue through mid-2019.\nToronto Transition Matters\nSee Schedule 1 hereto for a discussion of expected transition matters in connection with the anticipated sale of our Toronto real property.\nFirst Quarter 2018 Outlook\nFor the quarter ending March 31, 2018, we anticipate revenue to be in the range of $1.425 billion to $1.525 billion, non-IFRS selling, general and administrative expenses (SG&A) to be in the range of $45 million to $47 million, non-IFRS operating margin to be 3.0% at the mid-point of our expectations, non-IFRS adjusted annual effective tax rate of between 17% and 19%, and non-IFRS adjusted earnings per share to be in the range of $0.20 to $0.26. We expect a negative $0.14 to $0.20 per share (pre-tax) aggregate impact on net earnings on an IFRS basis for employee stock-based compensation expense, amortization of intangible assets (excluding computer software), Toronto transition costs (described on Schedule 1 hereto) and restructuring charges. We cannot predict changes in currency exchange rates, the impact of such changes on our operating results, or the degree to which we will be able to manage such impacts. See “Non-IFRS Supplementary Information” below for information on our rationale for the use of non-IFRS measures, and Schedule 1 for, among other items, non-IFRS measures included in this press release, as well as their definitions, uses, and a reconciliation of non-IFRS to IFRS measures.\nNon-IFRS Operating Margin Goal\nOur goal is for non-IFRS operating margin to be back into the 3.5% range in the second half of 2018, as we anticipate realization of cost efficiencies and benefits from higher ATS revenue mix.\nWe do not provide reconciliations for forward-looking non-IFRS financial measures, as we are unable to provide a meaningful or accurate calculation or estimation of reconciling items and the information is not available without unreasonable effort. This is due to the inherent difficulty of forecasting the timing or amount of various events that have not yet occurred, are out of our control and/or cannot be reasonably predicted, and that would impact the most directly comparable forward-looking IFRS financial measure. For these same reasons, we are unable to address the probable significance of the unavailable information. Forward-looking non-IFRS financial measures may vary materially from the corresponding IFRS financial measures.\nFourth Quarter 2017 Webcast\nManagement will host its fourth quarter 2017 results conference call today at 5:00 p.m. Eastern Standard Time. The webcast can be accessed at www.celestica.com .\nNon-IFRS Supplementary Information\nIn addition to disclosing detailed operating results in accordance with IFRS, Celestica provides supplementary non-IFRS measures to consider in evaluating the company’s operating performance. Management uses adjusted net earnings and other non-IFRS measures to assess operating performance and the effective use and allocation of resources; to provide more meaningful period-to-period comparisons of operating results; to enhance investors’ understanding of the core operating results of Celestica’s business; and to set management incentive targets. We believe investors use both IFRS and non-IFRS measures to assess management's past, current and future decisions associated with our priorities and our allocation of capital, as well as to analyze how our business operates in, or responds to, swings in economic cycles or to other events that impact our core operations. See Schedule 1 - Supplementary Non-IFRS Measures for, among other items, non-IFRS measures provided herein, non-IFRS definitions, and a reconciliation of non-IFRS to IFRS measures.\nAbout Celestica\nCelestica enables the world's best brands. Through our recognized customer-centric approach, we partner with leading companies in aerospace and defense, communications, enterprise, healthtech, industrial, semiconductor capital equipment, and smart energy to deliver solutions for their most complex challenges. A leader in design, manufacturing, hardware platform and supply chain solutions, Celestica brings global expertise and insight at every stage of product development - from the drawing board to full-scale production and after-market services. With talented teams across North America, Europe and Asia, we imagine, develop and deliver a better future with our customers.\nFor more information, visit http://www.celestica.com .\nOur securities filings can also be accessed at www.sedar.com and www.sec.gov .\nCautionary Note Regarding Forward-looking Statements\nThis news release contains forward-looking statements, including, without limitation, those related to our future growth; trends in the electronics manufacturing services (EMS) industry; our anticipated financial and/or operational results, including our quarterly revenue, non-IFRS adjusted SG&A, non-IFRS operating margin, non-IFRS adjusted tax expense, non-IFRS adjusted effective tax rate, and earnings guidance; our non-IFRS operating margin goals; our anticipated acquisition of Atrenne, the expected timing, cost, terms and funding thereof, the expected impact of such acquisition, if consummated, on our position in the aerospace and defense market; our goals with respect to broadening our portfolio of ATS products and services and growing our ATS business; our diversification plans; the impact of acquisitions and program wins or losses on our financial results and working capital requirements; anticipated expenses, restructuring actions and charges, and capital expenditures, including the anticipated timing and funding thereof and other anticipated working capital requirements; the timing and terms of the sale of our real property in Toronto and related transactions, including the expected lease of our new corporate headquarters; the costs, timing and execution of relocating our existing Toronto manufacturing operations and the anticipated temporary relocation of our corporate headquarters while space in a new office building is under construction; the impact of tax and litigation outcomes; our cash flows, financial targets and priorities; intended investments in our business; changes in our mix of revenue by end market; our ability to diversify and grow our customer base and develop new capabilities; the impact of increased competition and pricing pressures on our financial results; the possibility of future write-downs on unrecovered amounts from solar receivables; the expected timing of the sale of our solar panel manufacturing equipment; our intention to settle outstanding equity awards with subordinate voting shares; the potential impact of new accounting standards on our consolidated financial statements and the timing of related transition activities; our intention to make repurchases under our current NCIB; and our intentions with respect to our U.K. Supplementary pension plan. Such forward-looking statements may, without limitation, be preceded by, followed by, or include words such as “believes”, “expects”, “anticipates”, “estimates”, “intends”, “plans”, “continues”, “project ” , “potential ” , “ possible ” , “ contemplate ” , “ seek ”, or similar expressions, or may employ such future or conditional verbs as “may”, “might”, “will”, “could”, “should” or “would”, or may otherwise be indicated as forward-looking statements by grammatical construction, phrasing or context. For those statements, we claim the protection of the safe harbor for forward-looking statements contained in the U.S. Private Securities Litigation Reform Act of 1995, where applicable, and applicable Canadian securities laws.\nForward-looking statements are provided for the purpose of assisting readers in understanding management’s current expectations and plans relating to the future. Readers are cautioned that such information may not be appropriate for other purposes. Forward-looking statements are not guarantees of future performance and are subject to risks that could cause actual results to differ materially from conclusions, forecasts or projections expressed in such forward-looking statements, including, among others, risks related to: our customers’ ability to compete and succeed in the marketplace with the services we provide and the products we manufacture; changes in our mix of customers and/or the types of products or services we provide; seasonality impacting the quarterly revenue of some portions of our business; price, margin pressures, and other competitive factors generally affecting, and the highly competitive nature of, the EMS industry; price and other competitive factors affecting our Communications and Enterprise end markets; higher concentration of fulfillment services and/or other lower margin programs impacting gross profit; managing our operations and our working capital performance during uncertain market and economic conditions; responding to changes in demand, rapidly evolving and changing technologies, and changes in our customers’ business and outsourcing strategies, including the insourcing of programs; customer concentration and the challenges of diversifying our customer base and replacing revenue from completed or lost programs, or customer disengagements; customer, competitor and/or supplier consolidation; changing commodity, material and component costs, as well as labor costs and conditions; disruptions to our operations, or those of our customers, component suppliers and/or logistics partners, including as a result of global or local events outside our control, including as a result of Britain's intention to leave the European Union (Brexit) and/or policies or legislation proposed or instituted by the current administration in the U.S.; retaining or expanding our business due to execution issues relating to the ramping of new or existing programs or new offerings; the incurrence of future impairment charges or other write-downs of assets; recruiting or retaining skilled talent; the potential negative impact of transitions resulting from restructuring actions on our operations; current or future litigation, governmental actions and/or changes in legislation; our ability to recover accounts receivable outstanding from a former solar supplier; delays in the delivery and availability of components, services and materials, including from suppliers upon which we are dependent for certain components; non-performance by counterparties; our financial exposure to foreign currency volatility, including fluctuations that may result from Brexit and/or policies or legislation proposed or instituted by the current administration in the U.S.; our dependence on industries affected by rapid technological change; the variability of our revenue and operating results; managing our global operations and supply chain; increasing income and other taxes, tax audits, and challenges of defending our tax positions, and obtaining, renewing or meeting the conditions of tax incentives and credits; completing restructuring actions, including achieving the anticipated benefits therefrom, and integrating any acquisitions; defects or deficiencies in our products, services or designs; computer viruses, malware, hacking attempts or outages that may disrupt our operations; any failure to adequately protect our intellectual property or the intellectual property of others; compliance with applicable laws, regulations and social responsibility initiatives; our having sufficient financial resources and working capital to fund currently anticipated financial obligations and to pursue desirable business opportunities; the potential that conditions to closing the sale of our real property in Toronto and related transactions may not be satisfied on a timely basis or at all; the costs, timing and/or execution of relocating our existing Toronto manufacturing operations and/or corporate headquarters proving to be other than anticipated; the failure to obtain the necessary regulatory approvals or satisfy other closing conditions required for our purchase of Atrenne; a delay in the regulatory review of our proposed Atrenne acquisition as a result of a shutdown of the U.S. government; a material adverse change at Atrenne; a failure of Atrenne to obtain requisite shareholder approval for the transaction; the failure to consummate our purchase of Atrenne in a timely manner or at all; our failure to obtain adequate funding for the acquisition on acceptable terms; stockholders of Atrenne exercising dissent rights; the Atrenne purchase price varying from the expected amount; and if the acquisition is consummated, a failure to achieve the anticipated benefits therefrom, to successfully integrate the acquisition, and/or to further develop our capabilities in the aerospace and defense market. The foregoing and other material risks and uncertainties are discussed in our public filings at www.sedar.com and www.sec.gov , including in our most recent MD&A, our most recent Annual Report on Form 20-F filed with, and subsequent reports on Form 6-K furnished to, the U.S. Securities and Exchange Commission, and as applicable, the Canadian Securities Administrators.\nOur revenue, earnings and other financial guidance contained in this press release is based on various assumptions, many of which involve factors that are beyond our control. Our material assumptions include those related to the following: production schedules from our customers, which generally range from 30 days to 90 days and can fluctuate significantly in terms of volume and mix of products or services; the timing and execution of, and investments associated with, ramping new business; the success in the marketplace of our customers’ products; the pace of change in our traditional end markets and our ability to retain programs and customers; the stability of general economic and market conditions, currency exchange rates, and interest rates; our pricing, the competitive environment and contract terms and conditions; supplier performance, pricing and terms; compliance by third parties with their contractual obligations, the accuracy of their representations and warranties, and the performance of their covenants; the costs and availability of components, materials, services, plant and capital equipment, labor, energy and transportation; operational and financial matters including the extent, timing and costs of replacing revenue from completed or lost programs, or customer disengagements; technological developments; our ability to recover accounts receivable outstanding from a former solar supplier; the timing, execution and effect of restructuring actions; our having sufficient financial resources and working capital to fund currently anticipated financial obligations and to pursue desirable business opportunities; our ability to diversify our customer base and develop new capabilities; the availability of cash for repurchases of outstanding subordinate voting shares under our current NCIB; compliance with applicable laws and regulations pertaining to NCIBs; applicable regulatory approvals will be obtained and other closing conditions to our purchase of Atrenne will be satisfied; a shutdown of the U.S. government will not delay the regulatory review of our proposed acquisition of Atrenne; that our purchase of Atrenne will be consummated in a timely manner and on anticipated terms; that internal cash flow projections and our ability to incur further indebtedness under our Revolving Facility will be as expected in order to finance the Atrenne acquisition as anticipated; and that, once acquired, we are able to successfully integrate Atrenne, expand our portfolio of solutions, and achieve the other expected benefits from the acquisition. While management believes these assumptions to be reasonable under the current circumstances, they may prove to be inaccurate. Forward-looking statements speak only as of the date on which they are made, and we disclaim any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable law.\nAll forward-looking statements attributable to us are expressly qualified by these cautionary statements.\nSupplementary Non-IFRS Measures Schedule 1\nOur non-IFRS measures herein include adjusted gross profit, adjusted gross margin (adjusted gross profit as a percentage of revenue), adjusted selling, general and administrative expenses (SG&A), adjusted SG&A as a percentage of revenue, operating earnings (adjusted EBIAT), operating margin (adjusted EBIAT as a percentage of revenue), adjusted net earnings, adjusted earnings per share, adjusted return on invested capital (adjusted ROIC), free cash flow, adjusted tax expense and adjusted effective tax rate. Adjusted EBIAT, adjusted ROIC, free cash flow, adjusted tax expense and adjusted effective tax rate are further described in the tables below. In calculating these non-IFRS financial measures, management excludes the following items, where applicable: employee stock-based compensation expense, amortization of intangible assets (excluding computer software), restructuring and other charges, net of recoveries (including Toronto transition costs (recoveries), described below), other solar charges (described below), the write-down of goodwill, intangible assets and property, plant and equipment, all net of the associated tax adjustments (which are set forth in the table below), and deferred tax write-offs/costs or recoveries associated with restructuring actions or restructured sites.\nWe believe the non-IFRS measures we present herein are useful, as they enable investors to evaluate and compare our results from operations and cash resources generated from our business in a more consistent manner (by excluding specific items that we do not consider to be reflective of our ongoing operating results) and provide an analysis of operating results using the same measures our chief operating decision makers use to measure performance. In addition, management believes that the use of a non-IFRS adjusted effective tax expense and a non-IFRS adjusted effective tax rate provides improved insight into the tax effects of our ongoing business operations, and is useful to management and investors for historical comparisons and forecasting. These non-IFRS financial measures result largely from management’s determination that the facts and circumstances surrounding the excluded charges or recoveries are not indicative of the ordinary course of the ongoing operation of our business.\nNon-IFRS measures do not have any standardized meaning prescribed by IFRS and may not be comparable to similar measures presented by other public companies that use IFRS, or who report under U.S. GAAP and use non-U.S. GAAP measures to describe similar operating metrics. Non-IFRS measures are not measures of performance under IFRS and should not be considered in isolation or as a substitute for any standardized measure under IFRS. The most significant limitation to management’s use of non-IFRS financial measures is that the charges or credits excluded from the non-IFRS measures are nonetheless charges or credits that are recognized under IFRS and that have an economic impact on the company. Management compensates for these limitations primarily by issuing IFRS results to show a complete picture of the company’s performance, and reconciling non-IFRS results back to IFRS results.\nThe economic substance of these exclusions and management’s rationale for excluding them from non-IFRS financial measures is provided below:\nEmployee stock-based compensation expense, which represents the estimated fair value of stock options, restricted share units and performance share units granted to employees, is excluded because grant activities vary significantly from quarter-to-quarter in both quantity and fair value. In addition, excluding this expense allows us to better compare core operating results with those of our competitors who also generally exclude employee stock-based compensation expense in assessing operating performance, who may have different granting patterns and types of equity awards, and who may use different valuation assumptions than we do, including those competitors who report under U.S. GAAP and use non-U.S. GAAP measures to present similar metrics.\nAmortization charges (excluding computer software) consist of non-cash charges against intangible assets that are impacted by the timing and magnitude of acquired businesses. Amortization of intangible assets varies among our competitors, and we believe that excluding these charges permits a better comparison of core operating results with those of our competitors who also generally exclude amortization charges in assessing operating performance.\nRestructuring and other charges, net of recoveries, include costs relating to employee severance, lease terminations, site closings and consolidations, write-downs of owned property and equipment which are no longer used and are available for sale, reductions in infrastructure, Toronto transition costs (recoveries) (discussed below), acquisition-related consulting, transaction and integration costs, and legal settlements (recoveries). We exclude restructuring and other charges, net of recoveries, because we believe that they are not directly related to ongoing operating results and do not reflect expected future operating expenses after completion of these activities. We believe these exclusions permit a better comparison of our core operating results with those of our competitors who also generally exclude these charges, net of recoveries, in assessing operating performance.\nRestructuring and other charges, net of recoveries, includes Toronto transition costs (recoveries), which are costs (recoveries) recorded in connection with the sale of our Toronto real property, the relocation of our existing Toronto manufacturing operations, the move of our corporate headquarters to a temporary location while space in a new office building for such headquarters (to be built by, and which we intend to lease from, the purchasers of our Toronto real property on the site of our current location) is under construction, as well as the move to such new office space upon its completion. Toronto transition costs consist of direct relocation costs, duplicate costs (such as rent expense, utility costs, depreciation charges, and personnel costs) incurred during the transition period, as well as cease-use costs incurred in connection with idle or vacated portions of the relevant premises that we would not have incurred but for these relocations. Toronto transition recoveries will consist of amounts received from the purchasers of the Toronto real property or gains we record in connection with its sale, if consummated. We believe that excluding these costs and recoveries permits a better comparison of our core operating results from period-to-period, as these costs will not reflect our ongoing operations once these relocations are complete.\nOther solar charges, consisting of non-cash charges to further write down the carrying value of our then-remaining solar panel inventory and the write-down of solar accounts receivable (A/R) (primarily as a result of a solar customer's bankruptcy) to estimated recoverable amounts, were recorded in the second quarter of 2017 through cost of sales and SG&A expenses, respectively. Both of these impairment charges, which were identified during the wind down phase of our solar operations after our decision to exit the solar panel manufacturing business, are excluded as they pertain to a business we have exited, and we therefore believe they are no longer directly related to our ongoing core operating results. Although we recorded significant impairment charges to write down our solar panel inventory in the third quarter of 2016, those charges were not excluded in the determination of our non-IFRS financial measures for such period, as we were then still engaged in the solar panel manufacturing business. In connection with this wind down, we also recorded net non-cash impairment charges to write down the carrying value of our solar panel manufacturing equipment held for sale to its estimated sales value less costs to sell, which we recorded through other charges during 2017.\nImpairment charges, which consist of non-cash charges against goodwill, intangible assets and property, plant and equipment, result primarily when the carrying value of these assets exceeds their recoverable amount. Our competitors may record impairment charges at different times, and we believe that excluding these charges permits a better comparison of our core operating results with those of our competitors who also generally exclude these charges in assessing operating performance.\nDeferred tax write-offs/costs or recoveries associated with restructuring actions or restructured sites are excluded, as we believe that these write-offs/costs or recoveries do not reflect core operating performance and vary significantly among those of our competitors who also generally exclude these charges or recoveries in assessing operating performance.\nThe following table sets forth, for the periods indicated, the various non-IFRS measures discussed above, and a reconciliation of IFRS to non-IFRS measures (in millions, except percentages and per share amounts):\nThree months ended December 31 Year ended December 31 2016 2017 2016 2017 % of revenue % of revenue % of revenue % of revenue IFRS revenue $ 1,623.7 $ 1,553.9 $ 6,016.5 $ 6,110.5 IFRS gross profit $ 111.9 6.9 % $ 102.4 6.6 % $ 427.6 7.1 % $ 417.8 6.8 % Employee stock-based compensation expense 4.6 3.2 15.0 14.6 Other solar charges (inventory write-down) — — — 0.9 Non-IFRS adjusted gross profit $ 116.5 7.2 % $ 105.6 6.8 % $ 442.6 7.4 % $ 433.3 7.1 % IFRS SG&A $ 53.2 3.3 % $ 51.1 3.3 % $ 211.1 3.5 % $ 203.2 3.3 % Employee stock-based compensation expense (5.8 ) (4.2 ) (18.0 ) (15.5 ) Other solar charges (A/R write-down) — — — (0.5 ) Non-IFRS adjusted SG&A $ 47.4 2.9 % $ 46.9 3.0 % $ 193.1 3.2 % $ 187.2 3.1 % IFRS earnings before income taxes $ 29.3 1.8 % $ 22.1 1.4 % $ 161.0 2.7 % $ 132.4 2.2 % Finance costs 2.7 2.6 10.0 10.1 Refund interest income (8.3 ) — (14.3 ) — Employee stock-based compensation expense 10.4 7.4 33.0 30.1 Amortization of intangible assets (excluding computer software) 1.5 1.1 6.0 5.5 Net restructuring, impairment and other charges (recoveries) (1) 25.8 17.5 25.5 37.0 Other solar charges (inventory and A/R write-down) — — — 1.4 Non-IFRS operating earnings (adjusted EBIAT) (1) $ 61.4 3.8 % $ 50.7 3.3 % $ 221.2 3.7 % $ 216.5 3.5 % IFRS net earnings $ 20.9 1.3 % $ 14.4 0.9 % $ 136.3 2.3 % $ 105.0 1.7 % Employee stock-based compensation expense 10.4 7.4 33.0 30.1 Amortization of intangible assets (excluding computer software) 1.5 1.1 6.0 5.5 Net restructuring, impairment and other charges (recoveries) (1) 25.8 17.5 25.5 37.0 Other solar charges (inventory and A/R write-down) — — — 1.4 Adjustments for taxes (2) 0.9 (0.7 ) 0.1 (6.7 ) Non-IFRS adjusted net earnings $ 59.5 $ 39.7 $ 200.9 $ 172.3 Diluted EPS Weighted average # of shares (in millions) 143.4 145.5 143.9 145.2 IFRS earnings per share $ 0.15 $ 0.10 $ 0.95 $ 0.72 Non-IFRS adjusted earnings per share $ 0.41 $ 0.27 $ 1.40 $ 1.19 # of shares outstanding at period end (in millions) 140.9 141.8 140.9 141.8 IFRS cash provided by (used in) operations $ 87.5 $ 43.7 $ 173.3 $ 127.0 Purchase of property, plant and equipment, net of sales proceeds (17.8 ) (20.6 ) (63.1 ) (101.8 ) Finance lease payments (1.0 ) (1.7 ) (4.5 ) (6.5 ) Repayments from former solar supplier 3.0 — 14.0 12.5 Finance costs paid (2.4 ) (2.6 ) (9.5 ) (10.2 ) Non-IFRS free cash flow (3) $ 69.3 $ 18.8 $ 110.2 $ 21.0 IFRS ROIC % (4) 10.8 % 7.4 % 15.2 % 11.7 % Non-IFRS adjusted ROIC % (4) 22.7 % 17.0 % 20.8 % 19.1 % (1) Management uses non-IFRS operating earnings (adjusted EBIAT) as a measure to assess our operational performance related to our core operations. Non-IFRS adjusted EBIAT is defined as earnings before finance costs (consisting of interest and fees related to our credit facility, our accounts receivable sales program and a customer's supplier financing program), amortization of intangible assets (excluding computer software) and income taxes. Non-IFRS adjusted EBIAT also excludes, in periods where such charges have been recorded, employee stock-based compensation expense, restructuring and other charges, including acquisition-related consulting, transaction and integration costs (net of recoveries) and Toronto transition costs (recoveries), impairment charges, other solar charges, and refund interest income with respect to amounts previously held on account with Canadian tax authorities. During the fourth quarter of 2017, we recorded $1.6 million of Toronto transition costs. We expect these costs to continue into 2019. The Toronto transition costs are reported as other charges. See note 12 to the Interim Financial Statements.\n(2) The adjustments for taxes, as applicable, represent the tax effects on our non-IFRS adjustments and tax write-offs/costs or recoveries related to restructured sites (described below).\nThe following table sets forth a reconciliation of our IFRS tax expense and IFRS effective tax rate to our non-IFRS adjusted tax expense and our non-IFRS adjusted effective tax rate for the periods indicated, in each case determined by excluding the tax benefits or costs associated with the listed items (in millions, except percentages) from our IFRS tax expense for such periods:\nThree months ended Year ended December 31 December 31 2016 Effective tax rate 2017 Effective tax rate 2016 Effective tax rate 2017 Effective tax rate IFRS tax expense/IFRS effective tax rate $ 8.4 29 % $ 7.7 35 % $ 24.7 15 % $ 27.4 21 % Tax costs (benefits) of the following items excluded from IFRS tax expense: Employee stock-based compensation (0.5 ) 0.9 0.9 1.7 Amortization of Intangible assets (excluding computer software) — — — — Net restructuring, impairment and other charges 0.1 (0.2 ) 0.4 1.2 Other solar charges (inventory and A/R write-down) — — — 0.4 Other charges related to restructured sites (0.5 ) — (1.4 ) 3.4 Non-IFRS adjusted tax expense/Non-IFRS adjusted effective tax rate $ 7.5 11 % $ 8.4 17 % $ 24.6 11 % $ 34.1 17 % (3) Management uses non-IFRS free cash flow as a measure, in addition to IFRS cash flow provided by (used in) operations, to assess our operational cash flow performance. We believe non-IFRS free cash flow provides another level of transparency to our liquidity. Non-IFRS free cash flow is defined as cash provided by (used in) operations after the purchase of property, plant and equipment (net of proceeds from the sale of certain surplus equipment and property), finance lease payments, repayments from a former solar supplier, and finance costs paid. As a measure of liquidity, in periods when it is relevant (third quarter of 2015), non-IFRS free cash flow also included deposits received on the anticipated sale of real property (see note 18 to our 2016 annual audited consolidated financial statements). Similarly, it is our intention to include any amounts received from the purchasers of our Toronto real property (should the sale be consummated) in non-IFRS free cash flow in the period of receipt. Note that non-IFRS free cash flow, however, does not represent residual cash flow available to Celestica for discretionary expenditures.\n(4) Management uses non-IFRS adjusted ROIC as a measure to assess the effectiveness of the invested capital we use to build products or provide services to our customers, by quantifying how well we generate earnings relative to the capital we have invested in our business. Our non-IFRS adjusted ROIC measure reflects non-IFRS operating earnings, working capital management and asset utilization. Non-IFRS adjusted ROIC is calculated by dividing non-IFRS adjusted EBIAT by average net invested capital. Net invested capital (calculated in the table below) consists of the following IFRS measures: total assets less cash, accounts payable, accrued and other current liabilities and provisions, and income taxes payable. We use a two-point average to calculate average net invested capital for the quarter and a five-point average to calculate average net invested capital for the year. A comparable measure under IFRS would be determined by dividing IFRS earnings before income taxes by net invested capital (which we have set forth in the charts above and below), however, this measure (which we have called IFRS ROIC), is not a measure defined under IFRS.\nThe following table sets forth, for the periods indicated, our calculation of IFRS ROIC % and non-IFRS adjusted ROIC % (in millions, except IFRS ROIC % and non-IFRS adjusted ROIC %):\nThree months ended Year ended December 31 December 31 2016 2017 2016 2017 IFRS earnings before income taxes $ 29.3 $ 22.1 $ 161.0 $ 132.4 Multiplier to annualize earnings 4 4 1 1 Annualized IFRS earnings before income taxes $ 117.2 $ 88.4 $ 161.0 $ 132.4 Average net invested capital for the period $ 1,083.8 $ 1,196.3 $ 1,062.3 $ 1,133.1 IFRS ROIC % (1) 10.8 % 7.4 % 15.2 % 11.7 % Three months ended Year ended December 31 December 31 2016 2017 2016 2017 Non-IFRS operating earnings (adjusted EBIAT) $ 61.4 $ 50.7 $ 221.2 $ 216.5 Multiplier to annualize earnings 4 4 1 1 Annualized non-IFRS adjusted EBIAT $ 245.6 $ 202.8 $ 221.2 $ 216.5 Average net invested capital for the period $ 1,083.8 $ 1,196.3 $ 1,062.3 $ 1,133.1 Non-IFRS adjusted ROIC % (1) 22.7 % 17.0 % 20.8 % 19.1 % December 31\n2016 March 31\n2017 June 30\n2017 September 30\n2017 December 31\n2017 Net invested capital consists of: Total assets $ 2,822.3 $ 2,814.6 $ 2,857.7 $ 2,871.7 $ 2,944.7 Less: cash 557.2 558.0 582.7 527.0 515.2 Less: accounts payable, accrued and other current liabilities, provisions and income taxes payable 1,189.7 1,165.5 1,168.4 1,152.7 1,228.9 Net invested capital at period end (1) $ 1,075.4 $ 1,091.1 $ 1,106.6 $ 1,192.0 $ 1,200.6 December 31\n2015 March 31\n2016 June 30\n2016 September 30\n2016 December 31\n2016 Net invested capital consists of: Total assets $ 2,612.0 $ 2,621.9 $ 2,720.1 $ 2,813.7 $ 2,822.3 Less: cash 545.3 511.5 472.9 542.0 557.2 Less: accounts payable, accrued and other current liabilities, provisions and income taxes payable\n1,104.3 1,053.8 1,122.5 1,179.4 1,189.7 Net invested capital at period end (1) $ 962.4 $ 1,056.6 $ 1,124.7 $ 1,092.3 $ 1,075.4 (1) See footnote 4 of the previous table.\nGUIDANCE SUMMARY\nQ4 2017 Guidance (1) Q4 2017 Actual (1) Q1 2018 Guidance (2) IFRS revenue (in billions) $1.5 to $1.6 $1.55 $1.425 to $1.525 Non-IFRS operating margin 3.6% at the mid-point of expectations 3.3% 3.0% at the mid-point of expectations Non-IFRS adjusted EPS $0.27 to $0.33 $0.27 $0.20 to $0.26 (1) For the fourth quarter of 2017, revenue of $1.55 billion was at the mid-point of our guidance range, as demand strength from our Enterprise end market was offset by demand softness from our Communications end market. Our non-IFRS operating margin of 3.3% for the fourth quarter of 2017 was negatively impacted by late demand changes from certain customers, the timing of which prevented us from reducing certain variable production costs in light of the lower volumes. This also negatively impacted our non-IFRS adjusted EPS of $0.27 per share for the fourth quarter of 2017.\n(2) For the first quarter of 2018, we anticipate a negative $0.14 to $0.20 per share (pre-tax) aggregate impact on net earnings on an IFRS basis for employee stock-based compensation expense, amortization of intangible assets (excluding computer software), Toronto transition costs (described above), and restructuring charges. We cannot predict changes in currency exchange rates, the impact of such changes on our operating results, or the degree to which we will be able to manage such impacts. We anticipate non-IFRS adjusted SG&A to be between $45 million to $47 million for the first quarter of 2018, and a non-IFRS adjusted annual effective tax rate for 2018 of between 17% and 19%.\nCELESTICA INC.\nCONDENSED CONSOLIDATED BALANCE SHEET\n(in millions of U.S. dollars)\n(unaudited) December 31 2016 December 31 2017 Assets Current assets: Cash and cash equivalents $ 557.2 $ 515.2 Accounts receivable (note 6) 790.5 764.8 Inventories (note 7) 890.6 1,061.8 Income taxes receivable 5.4 1.6 Assets classified as held-for-sale (note 8) 28.9 30.1 Other current assets 73.9 82.0 Total current assets 2,346.5 2,455.5 Property, plant and equipment 302.7 323.9 Goodwill 23.2 23.2 Intangible assets 25.5 21.6 Deferred income taxes 36.4 39.2 Other non-current assets (note 9) 88.0 81.3 Total assets $ 2,822.3 $ 2,944.7 Liabilities and Equity Current liabilities: Current portion of borrowings under credit facility and finance lease obligations (notes 5 & 10) $ 56.0 $ 37.9 Accounts payable 876.9 931.1 Accrued and other current liabilities 261.7 233.5 Income taxes payable 32.4 37.7 Current portion of provisions 18.7 26.6 Total current liabilities 1,245.7 1,266.8 Long-term portion of borrowings under credit facility and finance lease obligations (notes 5 & 10) 188.7 166.5 Pension and non-pension post-employment benefit obligations 86.0 97.8 Provisions and other non-current liabilities 28.3 35.4 Deferred income taxes 34.8 27.5 Total liabilities 1,583.5 1,594.0 Equity: Capital stock (note 11) 2,048.2 2,048.3 Treasury stock (note 11) (15.3 ) (8.7 ) Contributed surplus 862.6 863.0 Deficit (1,632.0 ) (1,545.2 ) Accumulated other comprehensive loss (24.7 ) (6.7 ) Total equity 1,238.8 1,350.7 Total liabilities and equity $ 2,822.3 $ 2,944.7 Contingencies (note 15), Subsequent events (notes 5, 10 and 16)\nThe accompanying notes are an integral part of these unaudited interim condensed consolidated financial statements.\nCELESTICA INC.\nCONDENSED CONSOLIDATED STATEMENT OF OPERATIONS\n(in millions of U.S. dollars, except per share amounts)\n(unaudited) Three months ended Year ended December 31 December 31 2016 2017 2016 2017 Revenue $ 1,623.7 $ 1,553.9 $ 6,016.5 $ 6,110.5 Cost of sales (note 7) 1,511.8 1,451.5 5,588.9 5,692.7 Gross profit 111.9 102.4 427.6 417.8 Selling, general and administrative expenses (SG&A) 53.2 51.1 211.1 203.2 Research and development 6.7 6.9 24.9 26.2 Amortization of intangible assets 2.5 2.2 9.4 8.9 Other charges (recoveries) (note 12) 25.8 17.5 25.5 37.0 Earnings from operations 23.7 24.7 156.7 142.5 Refund interest income (note 13) (8.3 ) — (14.3 ) — Finance costs 2.7 2.6 10.0 10.1 Earnings before income taxes 29.3 22.1 161.0 132.4 Income tax expense (recovery) (note 13): Current 9.4 3.5 14.2 39.1 Deferred (1.0 ) 4.2 10.5 (11.7 ) 8.4 7.7 24.7 27.4 Net earnings for the period $ 20.9 $ 14.4 $ 136.3 $ 105.0 Basic earnings per share $ 0.15 $ 0.10 $ 0.96 $ 0.73 Diluted earnings per share $ 0.15 $ 0.10 $ 0.95 $ 0.72 Shares used in computing per share amounts (in millions): Basic 140.9 143.3 141.8 143.1 Diluted 143.4 145.5 143.9 145.2 The accompanying notes are an integral part of these unaudited interim condensed consolidated financial statements.\nCELESTICA INC.\nCONDENSED CONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME\n(in millions of U.S. dollars)\n(unaudited) Three months ended Year ended December 31 December 31 2016 2017 2016 2017 Net earnings for the period $ 20.9 $ 14.4 $ 136.3 $ 105.0 Other comprehensive income, net of tax: Items that will not be reclassified to net earnings: Gains (losses) on pension and non-pension post-employment benefit plans\n(note 9) 17.1 (1.2 ) 17.1 (18.2 ) Items that may be reclassified to net earnings: Currency translation differences for foreign operations (2.6 ) — — 0.7 Changes from derivatives designated as hedges (10.6 ) (3.3 ) 8.1 17.3 Total comprehensive income for the period $ 24.8 $ 9.9 $ 161.5 $ 104.8 The accompanying notes are an integral part of these unaudited interim condensed consolidated financial statements.\nCELESTICA INC.\nCONDENSED CONSOLIDATED STATEMENT OF CHANGES IN EQUITY\n(in millions of U.S. dollars)\n(unaudited) Capital stock\n(note 11) Treasury\nStock\n(note 11) Contributed\nsurplus Deficit Accumulated\nother\ncomprehensive\nloss (a) Total equity Balance -- January 1, 2016 $ 2,093.9 $ (31.4 ) $ 846.7 $ (1,785.4 ) $ (32.8 ) $ 1,091.0 Capital transactions (note 11): Issuance of capital stock 6.4 — (2.3 ) — — 4.1 Repurchase of capital stock for cancellation (52.1 ) — 17.8 — — (34.3 ) Purchase of treasury stock for stock-based plans — (18.2 ) — — — (18.2 ) Stock-based compensation and other — 34.3 0.4 — — 34.7 Total comprehensive income: Net earnings for the period — — — 136.3 — 136.3 Other comprehensive income, net of tax: Gains on pension and non-pension post-employment benefit plans (note 9) — — — 17.1 — 17.1 Changes from derivatives designated as hedges — — — — 8.1 8.1 Balance -- December 31, 2016 $ 2,048.2 $ (15.3 ) $ 862.6 $ (1,632.0 ) $ (24.7 ) $ 1,238.8 Capital transactions (note 11): Issuance of capital stock 30.4 — (16.8 ) — — 13.6 Repurchase of capital stock for cancellation (30.3 ) — 10.4 — — (19.9 ) Purchase of treasury stock for stock-based plans — (16.7 ) — — — (16.7 ) Stock-based compensation and other — 23.3 6.8 — — 30.1 Total comprehensive income: Net earnings for the period — — — 105.0 — 105.0 Other comprehensive income (loss), net of tax: Losses on pension and non-pension post-employment benefit plans (note 9) — — — (18.2 ) — (18.2 ) Currency translation differences for foreign operations — — — — 0.7 0.7 Changes from derivatives designated as hedges — — — — 17.3 17.3 Balance -- December 31, 2017 $ 2,048.3 $ (8.7 ) $ 863.0 $ (1,545.2 ) $ (6.7 ) $ 1,350.7 (a) Accumulated other comprehensive loss is net of tax.\nThe accompanying notes are an integral part of these unaudited interim condensed consolidated financial statements.\nCELESTICA INC.\nCONDENSED CONSOLIDATED STATEMENT OF CASH FLOWS\n(in millions of U.S. dollars)\n(unaudited) Three months ended Year ended December 31 December 31 2016 2017 2016 2017 Cash provided by (used in): Operating activities: Net earnings for the period $ 20.9 $ 14.4 $ 136.3 $ 105.0 Adjustments to net earnings for items not affecting cash: Depreciation and amortization 20.3 19.6 75.6 76.5 Equity-settled stock-based compensation 10.4 7.4 33.0 30.1 Other charges 19.0 (1.4 ) 21.2 5.7 Finance costs, net of refund interest income (5.6 ) 2.6 (4.3 ) 10.1 Income tax expense 8.4 7.7 24.7 27.4 Other (2.2 ) 2.3 (1.1 ) (1.6 ) Changes in non-cash working capital items: Accounts receivable (69.7 ) (32.5 ) (104.6 ) 25.7 Inventories 45.5 (38.1 ) (89.5 ) (171.2 ) Other current assets 7.5 (7.5 ) (5.3 ) (2.0 ) Accounts payable, accrued and other current liabilities and provisions (11.1 ) 75.6 75.4 52.1 Non-cash working capital changes (27.8 ) (2.5 ) (124.0 ) (95.4 ) Net income tax refund (paid), including refund interest income (note 13) 44.1 (6.4 ) 11.9 (30.8 ) Net cash provided by operating activities 87.5 43.7 173.3 127.0 Investing activities: Acquisition (note 4) (14.9 ) — (14.9 ) — Purchase of computer software and property, plant and equipment (a) (17.9 ) (20.8 ) (64.1 ) (102.6 ) Proceeds from sale of assets 0.1 0.2 1.0 0.8 Repayments from solar supplier (note 5) 3.0 — 14.0 12.5 Net cash used in investing activities (29.7 ) (20.6 ) (64.0 ) (89.3 ) Financing activities: Borrowings under credit facility (note 10) — — 40.0 — Repayments under credit facility (note 10) (31.3 ) (6.3 ) (75.0 ) (40.0 ) Finance lease payments (note 10) (1.0 ) (1.7 ) (4.5 ) (6.5 ) Issuance of capital stock (note 11) 0.8 0.1 4.1 13.6 Repurchase of capital stock for cancellation (note 11) — (19.9 ) (34.3 ) (19.9 ) Purchase of treasury stock for stock-based plans (note 11) (8.7 ) (4.5 ) (18.2 ) (16.7 ) Finance costs paid (2.4 ) (2.6 ) (9.5 ) (10.2 ) Net cash used in financing activities (42.6 ) (34.9 ) (97.4 ) (79.7 ) Net increase (decrease) in cash and cash equivalents 15.2 (11.8 ) 11.9 (42.0 ) Cash and cash equivalents, beginning of period 542.0 527.0 545.3 557.2 Cash and cash equivalents, end of period $ 557.2 $ 515.2 $ 557.2 $ 515.2 (a) Additional equipment of nil and $5.0 were acquired through a finance lease in the fourth quarter and FY 2017, respectively (fourth quarter and FY 2016 — $3.1 and $3.4, respectively).\nThe accompanying notes are an integral part of these unaudited interim condensed consolidated financial statements .\n1. REPORTING ENTITY\nCelestica Inc. (Celestica) is incorporated in Ontario with its corporate headquarters currently located at 844 Don Mills Road, Toronto, Ontario, M3C 1V7. Celestica’s subordinate voting shares are listed on the Toronto Stock Exchange (TSX) and the New York Stock Exchange (NYSE).\nCelestica delivers innovative supply chain solutions globally to customers in the following end markets: Advanced Technology Solutions (ATS) (consists of our former Diversified and Consumer end markets, and is comprised of our aerospace and defense, industrial, smart energy, healthcare, semiconductor equipment, and consumer businesses), Communications (consists of our enterprise communications and telecommunications businesses), and Enterprise (consists of our servers and storage businesses, which were combined into one end market as a result of their converging technologies). Our product lifecycle offerings include a range of services to our customers including design and development, engineering services, supply chain management, new product introduction, component sourcing, electronics manufacturing, assembly and test, complex mechanical assembly, systems integration, precision machining, order fulfillment, logistics and after-market repair and return services.\n2. BASIS OF PREPARATION AND SIGNIFICANT ACCOUNTING POLICIES\nStatement of compliance:\nThese unaudited interim condensed consolidated financial statements have been prepared in accordance with International Accounting Standard (IAS) 34, Interim Financial Reporting , as issued by the International Accounting Standards Board (IASB) and the accounting policies we have adopted in accordance with International Financial Reporting Standards (IFRS). These unaudited interim condensed consolidated financial statements should be read in conjunction with our 2016 annual audited consolidated financial statements and reflect all adjustments that are, in the opinion of management, necessary to present fairly our financial position as at December 31, 2017 and our financial performance, comprehensive income and cash flows for the three months ended December 31, 2017 and the year ended December 31, 2017 (FY 2017). These unaudited interim condensed consolidated financial statements are presented in U.S. dollars, which is also our functional currency. Unless otherwise noted, all financial information is presented in millions of U.S. dollars (except percentages and per share amounts).\nThese unaudited interim condensed consolidated financial statements were authorized for issuance by our board of directors on January 24, 2018.\nUse of estimates and judgments:\nThe preparation of financial statements in conformity with IFRS requires management to make judgments, estimates and assumptions that affect the application of accounting policies and the reported amounts of assets and liabilities, revenue and expenses, and the related disclosures of contingent assets and liabilities. We base these estimates and assumptions on current facts, historical experience and various other factors that we believe are reasonable under the circumstances. The near-term economic environment could also impact certain estimates necessary to prepare our consolidated financial statements, including the estimates related to the recoverable amounts used in our impairment testing of our non-financial assets, and the discount rates applied to our net pension and non-pension post-employment benefit assets or liabilities. Our assessment of these factors forms the basis for our judgments on the carrying values of our assets and liabilities, and the accrual of our costs and expenses. Actual results could differ materially from these estimates and assumptions. We review our estimates and underlying assumptions on an ongoing basis and make revisions as determined necessary by management. There have been no material changes to our significant accounting estimates and assumptions or the judgments affecting the application of such estimates and assumptions during FY 2017 from those described in the notes to our 2016 annual audited consolidated financial statements, except for changes in estimates and assumptions related to the recoverability of our remaining solar assets (see note 5). Revisions are recognized in the period in which the estimates are revised and may impact future periods as well.\nAccounting policies:\nThese unaudited interim condensed consolidated financial statements are based upon accounting policies consistent with those used and described in note 2 of our 2016 annual audited consolidated financial statements.\nRecently issued accounting pronouncements:\nIFRS 15, Revenue from Contracts with Customers:\nIn May 2014, the IASB issued this standard, which provides a single, principles-based five-step model for revenue recognition to be applied to all customer contracts, and requires enhanced disclosures. The new standard is effective for annual periods beginning on or after January 1, 2018, and allows for early adoption. We adopted this standard on January 1, 2018, and have elected to use the retrospective approach, pursuant to which we will restate each relevant comparative reporting period presented and recognize the transitional adjustments through equity at the start of the first comparative reporting period to be presented in our quarterly and annual financial statements. The new standard will change the timing of our revenue recognition for a significant portion of our business, resulting in the recognition of revenue for certain customer contracts earlier than under the previous recognition rules (which was generally upon delivery). The new standard will materially impact our consolidated financial statements, primarily in relation to inventory and accounts receivable balances. We are currently analyzing the extent of the financial impacts on our consolidated statement of operations and on key performance indicators for our FY 2017 results. Transition activities have been completed, and the necessary changes have been made to our business processes, systems and controls to support the recognition and disclosures required by the new standard.\nIFRS 9, Financial Instruments:\nIn July 2014, the IASB issued a final version of this standard, which replaces IAS 39, Financial Instruments: Recognition and Measurement, and is effective for annual periods beginning on or after January 1, 2018, with earlier adoption permitted. The standard introduces a new model for the classification and measurement of financial assets, a single expected credit loss model for the measurement of the impairment of financial assets, and a new model for hedge accounting that is aligned with a company’s risk management activities. We adopted this standard effective January 1, 2018. The adoption of this standard will not have a material impact on our consolidated financial statements.\nIFRS 16, Leases:\nIn January 2016, the IASB issued this standard, which brings most leases on-balance sheet for lessees under a single model, eliminating the distinction between operating and finance leases. IFRS 16 supersedes IAS 17, Leases , and related interpretations and is effective for periods beginning on or after January 1, 2019, with earlier adoption permitted. We do not intend to adopt this standard early. We have established a project team to evaluate the anticipated impact of this standard on our consolidated financial statements, as well as any changes to our business processes, systems and controls that may be required to support the recognition and disclosures required by the new standard. Transition efforts are currently underway, and are anticipated to be complete by January 1, 2019.\n3. SEGMENT AND CUSTOMER REPORTING\nEnd markets:\nThe following table indicates revenue by end market as a percentage of total revenue for the periods indicated.\nThree months ended Year ended December 31 December 31 2016 2017 2016 2017 Advanced Technology Solutions (ATS) 29 % 33 % 32 % 32 % Communications 44 % 40 % 42 % 43 % Enterprise 27 % 27 % 26 % 25 % For reporting purposes, commencing in the first quarter of 2017, we combined our previously-reported Diversified and Consumer end markets to form our ATS end market, and combined our Servers and Storage end markets into a single \"Enterprise\" end market. All period percentages herein reflect these changes.\nCustomers:\nFor the fourth quarter and FY 2017, we had three and two customers, respectively, that individually represented more than 10% of total revenue (fourth quarter and full year ended December 31, 2016 (FY 2016) — two customers).\nSeasonality:\nFrom time to time, we experience some level of seasonality in our quarterly revenue patterns across some of our businesses. However, numerous factors affecting our period-to-period results make it difficult to isolate the impact of seasonality and other external factors on our business. In the past, revenue from the storage component of our Enterprise business has increased in the fourth quarter of the year compared to the third quarter, and then decreased in the first quarter of the following year, reflecting the increase in customer demand we typically experience in this business in the fourth quarter. In addition, we typically experience our lowest overall revenue levels during the first quarter of each year. There is no assurance that these patterns will continue.\n4. ACQUISITIONS\nWe may, at any time, be engaged in ongoing discussions with respect to possible acquisitions that could expand our service offerings, increase our penetration in various industries, establish strategic relationships with new or existing customers and/or enhance our global supply chain network. We incur consulting, transaction and integration costs (Acquisition Costs) relating to potential and completed acquisitions. During the fourth quarter and FY 2017, we recorded Acquisition Costs of $2.7 and $4.5, respectively (fourth quarter and FY 2016 — $1.4) in other charges in our consolidated statement of operations.\nIn November 2016, we acquired the business assets of Lorenz, Inc. and Suntek Manufacturing Technologies, SA de CV, collectively known as Karel Manufacturing (Karel) for a cash purchase price of $14.9, and incurred Acquisition Costs of $1.4 in connection therewith. Karel is a manufacturing services company that specializes in complex wire harness assembly, systems integration, sheet metal fabrication, welding and machining, serving primarily aerospace and defense customers. Details of the purchase price allocation in the year of acquisition are as follows:\nKarel Current assets, net of cash acquired $ 11.5 Property, plant and equipment and other long-term assets 1.2 Goodwill 3.7 Current liabilities (1.0 ) Deferred income taxes and other-long-term liabilities (0.5 ) $ 14.9 As part of the acquisition, we acquired $3.7 of goodwill, representing the specialized knowledge of the acquired workforce and expected synergies. Approximately two-thirds of the goodwill was tax deductible.\nSee Note 16 for a discussion of our entry into a definitive agreement to acquire Atrenne Integrated Solutions, Inc.\n5. SOLAR PANEL MANUFACTURING BUSINESS\nDuring the fourth quarter of 2016, due to anticipated prolonged volatility in the solar panel market, we made the decision to exit the solar panel manufacturing business, and terminated (prior to its scheduled expiration) a supply agreement pursuant to which we had made specific cash advances to an Asia-based solar cell supplier. All such cash advances were repaid in full by the end of the second quarter of 2017 (cash advances outstanding at December 31, 2016 — $12.5). Under this supply agreement, we also manufactured and sold completed solar panels to this supplier as a customer (discussed below).\nIn connection with our exit from this business, we wrote down the carrying values of our inventories and our solar panel manufacturing equipment during 2016 to then-recoverable amounts (see notes 7 and 12, respectively), and completed production of the final solar panels during the first quarter of 2017. During the second quarter of 2017, we recorded: (i) additional provisions of $0.9 in cost of sales, to further write down the carrying value of our remaining solar panel inventory to reflect lower prices obtained in then-current purchase orders, (ii) a provision of $0.5 in SG&A, to write down the carrying value of solar accounts receivable, primarily as a result of a solar customer’s bankruptcy, and (iii) impairment charges of $5.2 in other charges (through restructuring) to further write down the carrying value of our solar panel manufacturing equipment to its estimated fair value less costs to sell, based on then-broker estimates (see note 12). During the third quarter of 2017, we shipped all of our remaining solar panel inventory to customers, including to the former solar supplier described above. As of December 31, 2017, we had $6.7 (December 31, 2016 — $13.1) of outstanding solar accounts receivable, all from such former solar supplier. We recorded impairment reversals of $1.4 with respect to our solar panel manufacturing equipment during the fourth quarter of 2017 in other charges (through restructuring), to reflect its increased estimated fair value less costs to sell based on executed sale agreements. Such equipment was valued at $2.6 as of December 31, 2017. We currently expect to consummate the sale of such equipment in February 2018. See note 8. A substantial portion of our solar panel manufacturing equipment was subject to finance lease agreements. As of December 31, 2017, our outstanding lease obligations for this equipment totaled $11.1 (December 31, 2016 — $15.3), which were recorded as current liabilities on our consolidated balance sheet. In anticipation of the sale, we terminated and settled these lease obligations in full in January 2018. See note 10.\n6. ACCOUNTS RECEIVABLE\nWe have an agreement to sell accounts receivable on an uncommitted basis (subject to pre-determined limits by customer) to two third-party banks. In March 2017, based on a review of our requirements, we amended this agreement to reduce its overall capacity from $250.0 to $200.0. The term of this agreement has been annually extended in recent years (including in November 2017) for additional one-year periods (and is currently extendable to November 2019 under specified circumstances) but may be terminated earlier as provided in the agreement. At December 31, 2017, $80.0 of accounts receivable had been sold under this program (December 31, 2016 — $50.0). We continue to collect cash from our customers and remit the cash to the banks once it is collected.\nAt December 31, 2017, we also sold $52.3 of accounts receivable under a customer's supplier financing program (December 31, 2016 — $51.4), pursuant to which participating suppliers may sell accounts receivable from such customer to a third-party bank on an uncommitted basis in order to receive earlier payment. We utilized this program to substantially offset the effect of extended payment terms required by such customer on our working capital for the period. The third-party bank collects the relevant receivables directly from the customer.\nThe accounts receivable sold under both of these programs are de-recognized from our accounts receivable balance and removed from our consolidated balance sheet, and the proceeds are reflected as cash provided by operating activities in our consolidated statement of cash flows. Upon sale, we assign the rights to the accounts receivable to the banks. We pay interest which we record in finance costs in our consolidated statement of operations.\n7. INVENTORIES\nWe record our inventory provisions, net of valuation recoveries, in cost of sales. We record inventory provisions to reflect write-downs in the value of our inventory to net realizable value, and valuation recoveries primarily to reflect realized gains on the disposition of inventory previously written-down to net realizable value. We recorded net inventory recoveries of $0.6 and net inventory provisions of $3.3, respectively, for the fourth quarter and FY 2017 (fourth quarter and FY 2016 — net inventory provisions of $2.1, and $12.0, respectively). We regularly review our estimates and assumptions used to value our inventory through analysis of historical performance. Our net inventory provisions for FY 2017 included inventory provisions of $0.9 that we recorded during the second quarter of 2017 to further write down the carrying amount of our remaining solar panel inventory to recoverable amounts. Our inventory provisions for FY 2016 consisted primarily of the write down of our solar panel inventory to then-lower net realizable values. Negative market factors at that time resulted in significant declines in the pricing for solar panels, which ultimately led to our decision to exit the solar panel manufacturing business. See note 5.\n8. ASSETS CLASSIFIED AS HELD-FOR-SALE\nAs a result of previously announced restructuring actions, we have reclassified certain assets as held for sale. These assets were reclassified at the lower of their carrying value and estimated fair value less costs to sell at the time of reclassification. We have programs underway to sell these assets. As a result of then-recent broker estimates, we recorded impairment charges of $5.2 in other charges (through restructuring) during the second quarter of 2017, to further write down the carrying value of our solar panel manufacturing equipment to its then-estimated fair value less costs to sell. During the fourth quarter of 2017, we recorded impairment reversals of $1.4 with respect to such equipment in other charges (through restructuring), to reflect its increased estimated fair value less costs to sell based on executed sale agreements. We currently expect to consummate the sale of such equipment in February 2018. At December 31, 2017, we had $30.1 (December 31, 2016 — $28.9) of assets classified as held for sale, which consisted primarily of land and buildings in Europe and North America and $2.6 of solar panel manufacturing equipment in Asia and North America.\n9. PENSION AND NON-PENSION POST-EMPLOYMENT BENEFIT PLANS\nWe provide pension and non-pension post-employment defined benefit plans for our employees. Such plans include defined benefit pension plans for our employees in the United Kingdom (U.K.) that generally provide them with stated benefits on retirement based on their pensionable service, either in annuities and/or lump sum payments. The U.K. defined benefit pension plans are comprised of a Main pension plan and a Supplementary pension plan, both of which are closed to new members. The U.K. Main pension plan is our largest defined benefit pension plan. The Supplementary pension plan does not have any active members.\nIn March 2017, the Trustees of our U.K. Main pension plan entered into an agreement with a third party insurance company to purchase an annuity for participants in such plan who have retired. The cost of the annuity was £123.7 million (approximately $154.3 at the exchange rate at the time of recording) and was funded with existing plan assets. The annuity is held as an asset of the Main plan. Although we retain ultimate responsibility for the payment of benefits to plan participants, the annuity substantially hedges the financial risk component of the associated pension obligations for such retired participants. The purchase of the annuity resulted in a non-cash loss of $17.0 which we recorded in other comprehensive income and simultaneously re-classified to deficit during the first quarter of 2017. We also reduced the value of our pension assets by $17.0 during the first quarter of 2017, which is recorded in other non-current assets on our consolidated balance sheet.\nIn April 2017, the Trustees of our U.K. Supplementary pension plan entered into an agreement with a third party insurance company to purchase an annuity for all participants of this plan. The cost of the annuity was £9.1 million (approximately $11.7 at the exchange rate at the time of recording) and was funded with existing plan assets. The annuity is held as an asset of such plan. For the Supplementary pension plan, we anticipate transferring the pension annuity to individual plan members and winding up the plan in 2018. Although we will retain responsibility for the payment of benefits to plan participants until such wind-up is complete, the annuity substantially hedges the financial risk component of the associated pension obligations for such participants. The purchase of the annuity resulted in a non-cash loss of $1.9 which we recorded during the second quarter of 2017 in other charges (see note 12) in our consolidated statement of operations, with a corresponding reduction in the value of our pension assets which we recorded in other non-current assets on our consolidated balance sheet.\nOur pension and post-employment defined benefit plan obligations are determined based on actuarial valuations. We recognize actuarial gains or losses arising from pension and non-pension post-employment defined benefit plans in other comprehensive income (loss) and we subsequently reclassify the amounts to deficit. During the fourth quarter and FY 2017, we recognized $1.2 of net actuarial losses, net of tax (fourth quarter and FY 2016 — $17.1 of net actuarial gains, net of tax). We used a measurement date of December 31, 2017 for the accounting valuation of our pension and non-pension post-employment defined benefit plans.\n10. CREDIT FACILITIES AND LONG-TERM DEBT\nOur credit facility consists of a $250.0 term loan (Term Loan) and a $300.0 revolving credit facility (Revolving Facility), each maturing in May 2020. See note 12 of our 2016 annual audited consolidated financial statements for further details regarding the terms of our credit facility.\nUnder the Term Loan, we made a scheduled quarterly principal repayment of $6.25 during the fourth quarters of each of 2016 and 2017 (each of FY 2016 and FY 2017 — $25.0). During the first quarter of 2016, we borrowed $40.0 under the Revolving Facility to fund the repurchase of shares under our then-current NCIB. During the fourth quarter of 2016, we made a repayment of $25.0 under the Revolving Facility (FY 2016 — $50.0). We made a $15.0 repayment under the Revolving Facility in the first quarter and FY 2017. As of December 31, 2017, there was $187.5 outstanding under the Term Loan and there were no amounts outstanding under the Revolving Facility.\nThe following table sets forth our borrowings under the Revolving Facility and Term Loan, and our finance lease obligations as of the period-ends indicated:\nDecember 31\n2016 December 31\n2017 Borrowings under the Revolving Facility $ 15.0 $ — Term Loan 212.5 187.5 Total borrowings under credit facility 227.5 187.5 Less: unamortized debt issuance costs (1) (1.2 ) (0.8 ) Finance lease obligations (2) 18.4 17.7 $ 244.7 $ 204.4 Comprised of: Current portion of borrowings under credit facility and finance lease obligations (2) $ 56.0 $ 37.9 Long-term portion of borrowings under credit facility and finance lease obligations 188.7 166.5 $ 244.7 $ 204.4 (1) Debt issuance costs were incurred in connection with the amendment of our credit facility in 2015, which we amortize over the term of the Term Loan using the effective interest rate method.\n(2) At December 31, 2017, $11.1 (December 31, 2016 — $15.3) of our finance lease obligations related to our solar panel manufacturing equipment. Such solar equipment lease obligations were recorded as current liabilities on our consolidated balance sheet as at December 31, 2017. In connection with the anticipated disposition of such equipment, we terminated and settled these lease obligations in full in January 2018 . See note 5.\nThe Term Loan requires quarterly principal repayments of $6.25, and a lump sum repayment of the remainder outstanding at maturity. Prepayments under our credit facility are required under specified circumstances. See note 12 of our 2016 annual audited consolidated financial statements.\nAt December 31, 2017, we were in compliance with all restrictive and financial covenants under our credit facility. Commitment fees paid in the fourth quarter and FY 2017 were $0.3 and $1.3, respectively (fourth quarter and FY 2016 — $0.4 and $1.4, respectively). At December 31, 2017, we had $23.2 (December 31, 2016 — $25.8) outstanding in letters of credit under this facility.\nWe also have a total of $73.5 (December 31, 2016 — $70.0) in uncommitted bank overdraft facilities available for intraday and overnight operating requirements. There were no amounts outstanding under these overdraft facilities at December 31, 2017 or December 31, 2016.\n11. CAPITAL STOCK\nShare repurchase plans:\nWe have repurchased subordinate voting shares in the open market and otherwise for cancellation in recent years pursuant to NCIBs and substantial issuer bids, which allow us to repurchase a limited number of subordinate voting shares during a specified period. The maximum number of subordinate voting shares we are permitted to repurchase for cancellation under each NCIB is reduced by the number of subordinate voting shares purchased in the open market during the term of such NCIB to satisfy obligations under our stock-based compensation plans. We enter into program share repurchases (PSRs) from time to time as part of the NCIB process (if permitted by the TSX), pursuant to which we make a prepayment to a broker for the right to receive a variable number of subordinate voting shares upon such PSR's completion. Under such PSRs, the price and number of subordinate voting shares to be repurchased by us is generally determined based on a discount to the volume weighted-average market price of such shares during the terms of the PSR, subject to certain terms and conditions. The subordinate voting shares repurchased under any PSR are cancelled upon such PSR's completion.\nIn February 2016, we launched an NCIB (2016 NCIB) which was completed in February 2017. The 2016 NCIB allowed us to repurchase, at our discretion, up to approximately 10.5 million subordinate voting shares in the open market, or as otherwise permitted. During the first quarter of 2016, we paid $34.3 (including transaction fees) to repurchase and cancel 3.2 million subordinate voting shares under the 2016 NCIB at a weighted average price of $10.69 per share, including 2.8 million subordinate voting shares repurchased under a $30.0 PSR we funded in March 2016 (and completed in May 2016) at a weighted average price of $10.69 per share. We did not repurchase any subordinate voting shares under the 2016 NCIB for cancellation during the remainder of 2016 or during 2017. However, prior to its expiry, we repurchased an aggregate of 1.6 million subordinate voting shares under the 2016 NCIB (FY 2016 —1.6 million; FY 2017 — nil) to satisfy delivery obligations under our stock-based compensation plans (see below).\nIn November 2017, the TSX accepted our notice to launch a new NCIB (2017 NCIB), which allows us to repurchase, at our discretion, until the earlier of November 12, 2018 or the completion of the purchases thereunder, up to approximately 10.5 million subordinate voting shares (representing approximately 7.3% of our total outstanding subordinate voting and multiple voting shares at the time of launch) in the open market, or as otherwise permitted. Since the commencement of this NCIB through December 31, 2017, we paid $19.9 (including transaction fees) to repurchase and cancel 1.9 million subordinate voting shares at a weighted average price of $10.58 per share. In addition, we repurchased 1.4 million subordinate voting shares during FY 2017 (0.3 million of which were repurchased under the 2017 NCIB) to satisfy delivery obligations under our stock-based compensation plans (see below).\nStock-based compensation:\nWe grant share unit awards to employees under our stock-based compensation plans. From time-to-time, we pay cash for the purchase by a broker of subordinate voting shares in the open market to satisfy the delivery of subordinate voting shares upon vesting of such awards. For accounting purposes, we classify these shares as treasury stock until they are delivered pursuant to the stock-based compensation plans. During the fourth quarter and FY 2017, we paid $4.5 and $16.7, respectively, (including transaction fees) for a broker to purchase 0.4 million and 1.4 million subordinate voting shares in the open market, respectively, to satisfy delivery requirements under our stock-based compensation plans. During the fourth quarter and FY 2016, we paid $8.7 and $18.2 (including transaction fees), respectively, for a broker to purchase 1.1 million and 1.6 million subordinate voting shares in the open market (under the 2016 NCIB), respectively, to satisfy delivery requirements under our stock-based compensation plans. At December 31, 2017, the broker held 0.8 million subordinate voting shares with a value of $8.7 (December 31, 2016 — 1.4 million subordinate voting shares with a value of $15.3).\nDuring FY 2017, we granted 1.9 million (FY 2016 — 2.3 million) restricted share units (RSUs), primarily granted in the first quarter of each such year, which vest one-third per year over a three-year period. The cost we record for RSUs is based on the market value of our subordinate voting shares at the time of grant. With respect to performance share units (PSUs), employees are granted a target number of PSUs. The number of PSUs that will actually vest will vary from 0 to 200% of the target amount granted depending on the level of achievement of the relevant performance conditions. During FY 2017, we granted 0.9 million (FY 2016 — 1.25 million) PSUs (representing 100% of target), primarily granted in the first quarter of each such year, of which 60% vest based on achievement of a market performance condition tied to Total Shareholder Return (TSR), and the balance vest based on a non-market performance condition based on pre-determined financial targets. See note 2(n) of our 2016 annual audited consolidated financial statements for a description of TSR. We estimated the grant date fair value of the TSR-based PSUs using a Monte Carlo simulation model and a premium of 143% (2016 grants — premium of 109%). The grant date fair value of the non TSR-based PSUs is determined by the market value of our subordinate voting shares at the time of grant and may be adjusted in subsequent periods to reflect a change in the estimated level of achievement related to the applicable performance condition. We amortize the cost of our awards to compensation expense in our consolidated statement of operations, with a corresponding charge to contributed surplus in our consolidated balance sheet, over the vesting period. We expect to settle these awards with subordinate voting shares purchased in the open market by a broker or issued from treasury.\nDuring the fourth quarter and FY 2017, we received cash proceeds of $0.1 and $13.6, respectively (fourth quarter and FY 2016 — $0.8 and $4.1, respectively) relating to the exercise of vested employee stock options.\nFor the fourth quarter and FY 2017, we recorded aggregate employee stock-based compensation expense (excluding deferred share units (DSU) expense) through cost of sales and SG&A of $7.4 and $30.1, respectively (fourth quarter and FY 2016 — $10.4 and $33.0, respectively). Employee stock-based compensation expense varies from period-to-period.\nDuring FY 2017, two of our directors resigned from the Board, and in connection therewith, we settled each of their outstanding DSUs in accordance with the provisions of the Directors' Share Compensation Plan. During the third quarter of 2017, we paid $1.7 in cash to Joseph M. Natale to settle his outstanding DSUs. During the fourth quarter of 2017, we settled the outstanding DSUs of Thomas S. Gross with 14,098 subordinate voting shares that we purchased in the open market. As Celestica is permitted to, and currently intends to, settle all other DSUs with shares purchased in the open market, we have accounted for these awards as equity-settled awards. For the fourth quarter and FY 2017, we recorded DSU expense (recorded through SG&A) of $0.5 and $2.2, respectively (fourth quarter and FY 2016 — $0.6 and $2.1, respectively). At December 31, 2017, 1.5 million (December 31, 2016 — 1.5 million) DSUs were outstanding.\n12. OTHER CHARGES (RECOVERIES)\nThree months ended December 31 Year ended December 31 2016 2017 2016 2017 Restructuring (a) $ 24.4 $ 13.2 $ 31.9 $ 28.9 Loss on pension annuity purchase (see note 9) — — — 1.9 Toronto transition costs (b) — 1.6 — 1.6 Other (c) 1.4 2.7 (6.4 ) 4.6 $ 25.8 $ 17.5 $ 25.5 $ 37.0 Annual impairment assessment:\nDuring the fourth quarters of each of 2016 and 2017, we performed our annual impairment assessment of goodwill, intangible assets and property, plant and equipment and determined that, other than the write down of our solar panel manufacturing equipment discussed in notes 5 and 12 (a) below (recorded through restructuring charges), there was no impairment, as the recoverable amount of our assets and cash generating units (CGUs) exceeded their respective carrying values.\n(a) Restructuring:\nOur restructuring charges are comprised of the following:\nThree months ended December 31 Year ended December 31 2016 2017 2016 2017 Cash charges $ 5.4 $ 14.6 $ 10.7 $ 25.1 Non-cash charges (recoveries) 19.0 (1.4 ) 21.2 3.8 $ 24.4 $ 13.2 $ 31.9 $ 28.9 We perform ongoing evaluations of our business, operational efficiency and cost structure, and implement restructuring actions as we deem necessary. In response to challenging markets and continued margin pressures, we announced in October 2017 our intention to implement additional restructuring actions in the near term to further streamline our business and improve our margin performance, and our related engagement of an outside consultant to identify cost reduction opportunities throughout our network, including through increased operational efficiencies and productivity improvements. In connection therewith, we have commenced the implementation of additional restructuring actions under a new cost efficiency initiative. Such initiative will include reductions to our workforce, as well as potential consolidation of certain sites, to better align capacity and infrastructure with current and anticipated customer demand, related transfers of customer programs and production, re-alignment of business processes, management reorganizations, and other associated activities. We currently estimate that that we will incur aggregate restructuring charges of between $50 and $75 with respect to our cost efficiency initiative, including $8.0 of the $14.6 in restructuring charges that we recorded in the fourth quarter of 2017. We currently expect restructuring charges under this initiative to continue through mid-2019.\nWe recorded net restructuring charges of $13.2 and $28.9 during the fourth quarter and FY 2017, respectively, consisting of cash charges of $14.6 and $25.1, respectively, primarily for employee termination costs resulting from our OD and GBS initiatives, the rationalization of certain operations in the third quarter of 2017, and $8.0 in connection with our new cost efficiency initiative in the fourth quarter of 2017, described in the preceding paragraph, and non-cash recoveries of $1.4 and net non-cash charges of $3.8, respectively, related to our solar panel manufacturing equipment (see note 5). We recorded restructuring charges of $24.4 and $31.9 during the fourth quarter and FY 2016, respectively, consisting of cash charges of $5.4 and $10.7, respectively, primarily for employee termination costs resulting from our OD and GBS initiatives, our solar panel manufacturing operations and other exited operations, and non-cash charges of $19.0 and $21.2, respectively, primarily to write down our solar panel manufacturing equipment at our two locations to recoverable amounts. Our restructuring provision at December 31, 2017 was $12.7 (December 31, 2016 — $6.6).\n(b) Toronto transition costs:\nIn connection with the anticipated sale of our Toronto real property, we entered into a long-term lease in November 2017 (in the Greater Toronto area) for the relocation of our Toronto manufacturing operations, with occupancy commencing in the first quarter of 2018. We currently expect to complete the transition to this new manufacturing location by the end of first quarter of 2019. In addition, should the sale be consummated, we will enter into a long-term lease with the purchasers of our Toronto real property for our new corporate headquarters. In connection therewith, we intend to move such headquarters to a temporary location while space in a new office building (to be built by such purchasers on the site of our current location) is under construction. The temporary office relocation is currently expected to occur by the end of the first quarter of 2019. We will incur significant costs throughout the transition period (which commenced in the fourth quarter of 2017) to relocate our corporate headquarters and to transfer our Toronto manufacturing operations to its new location, and as we prepare and customize the new site to meet our manufacturing needs. These costs will consist of building improvements and new equipment which we will capitalize, as well as transition-related costs which we will record in other charges. Transition costs are comprised of direct relocation costs, duplicate costs (such as rent expense, utility costs, depreciation charges, and personnel costs) incurred during the transition period, as well as cease-use costs incurred in connection with idle or vacated portions of the relevant premises that we would not have incurred but for these relocations. Any amounts received from the purchasers of our Toronto real property or gains recorded in connection with its sale will be recorded as recoveries through other charges (recoveries). During the fourth quarter of 2017, we recorded $1.6 of such transition costs, consisting of utility costs related to idle premises, depreciation charges, and personnel costs used in the operation of duplicate production lines in advance of the transition.\n(c) Other:\nDuring the fourth quarter and FY 2017, we recorded $2.7 and $4.5, respectively, for Acquisition Costs. During the fourth quarter and FY 2016, we recorded $1.4 of Acquisition Costs. See note 4. Additionally during FY 2016, we received recoveries of damages of $12.0 in connection with the settlement of class action lawsuits in which we were a plaintiff, related to certain purchases we made in prior periods. These recoveries were offset in part by the cost we recorded to settle an unrelated legal matter in the second quarter of 2016.\n13. INCOME TAXES\nOur effective income tax rate can vary significantly from quarter-to-quarter for various reasons, including as a result of the mix and volume of business in various tax jurisdictions within the Americas, Europe and Asia, in jurisdictions with tax holidays and tax incentives, and in jurisdictions for which no net deferred income tax assets have been recognized because management believed it was not probable that future taxable profit would be available against which tax losses and deductible temporary differences could be utilized. Our effective income tax rate can also vary due to the impact of restructuring charges, foreign exchange fluctuations, operating losses, cash repatriations, and changes in our provisions related to tax uncertainties.\nOur net income tax expense of $7.7 for the fourth quarter of 2017 was comprised of certain immaterial offsetting items, including a $2.0 deferred tax expense related to recently enacted U.S. Tax Reform (discussed below), offset by taxable foreign exchange benefits resulting from the strengthening of the Malaysian ringgit and Chinese renminbi relative to the U.S. dollar (our functional currency) (Currency Benefits). Our net income tax expense of $27.4 for FY 2017 was favorably impacted by the recognition of a $4.3 deferred income tax benefit related to our solar assets (described below), as well as by Currency Benefits, which was largely offset by deferred tax expense related to taxable temporary differences associated with the anticipated repatriation of undistributed earnings from certain of our Chinese subsidiaries, and the $2.0 deferred tax expense related to the recently enacted U.S. Tax Reform (see below).\nIn connection with our exit from the solar panel manufacturing business, we withdrew one of our tax incentives in Thailand (which related solely to such operations) during the second quarter of 2017. The withdrawal of this incentive allows us to apply future tax losses arising from the ultimate disposition of our solar assets against other fully taxable profits in Thailand, resulting in the recognition of the $4.3 deferred income tax benefit described above. The amount of the income tax benefit was adjusted (from $5.0) based on adjustments to the write-down and impairment charges we recorded for our solar assets during 2016 and 2017.\nThe United States of America’s Tax Cuts and Jobs Act (U.S. Tax Reform) was enacted on December 22, 2017 and is effective commencing on January 1, 2018. The legislative changes contained in the U.S. Tax Reform are extensive and the interpretation of several aspects of such U.S. Tax Reform is still unclear, however, we have recorded an income tax expense for all significant known and determinable impacts during the fourth quarter of 2017. In connection with the reduction in U.S. federal corporate tax rates from 35% to 21%, we recorded a one-time, non-cash increase to our deferred income tax expense of $2.0 million, or $0.01 per diluted share, to re-value our recognized net deferred tax assets. We believe we have recorded all significant one-time impacts resulting from the Tax Reform in the fourth quarter of 2017, but will continue to assess additional impacts, if any, throughout 2018 as they become known due to changes in our interpretations and assumptions, as well as additional regulatory guidance that may be issued.\nOur net income tax expense of $8.4 for the fourth quarter of 2016 was favorably impacted by the reversal of provisions previously recorded for tax uncertainties related to the resolution of a transfer pricing matter for one of our Canadian subsidiaries. In connection therewith, we received the final reassessments in the fourth quarter of 2016, and recorded an income tax recovery of $8 million Canadian dollars (approximately $6 at the exchange rate at the time of recording), as well as additional refund interest income of approximately $11 million Canadian dollars (approximately $8 at the exchange rate at the time of recording).\nWe received $70 million Canadian dollars (approximately $52 at settlement date exchange rates) during the fourth quarter of 2016, representing the refund of cash previously deposited on account with the Canadian tax authorities and related refund interest. We received $6 million Canadian dollars (approximately $4 at settlement date exchange rates) in January 2017, representing the return of all remaining deposits and related refund interest with respect to such matters. See note 24 to our 2016 annual audited consolidated financial statements. Our net income tax expense for the fourth quarter of 2016 was also favorably impacted by a deferred tax recovery of $3.8 related to a change in the recognition of the deferred tax assets in one of our U.S. subsidiaries. Our net income tax expense for the fourth quarter of 2016 was negatively affected by taxable foreign exchange impacts of $8.6 resulting from the weakening of the Malaysian ringgit and the Chinese renminbi relative to the U.S. dollar, our functional currency (Currency Tax Expense).\nOur net income tax expense of $24.7 for FY 2016 was favorably impacted by the reversal of provisions previously recorded for tax uncertainties related to the resolution of a transfer pricing matter for one of our Canadian subsidiaries. In connection therewith, we recorded aggregate income tax recoveries of $45 million Canadian dollars (approximately $34 at the exchange rates at the time of recording), as well as aggregate refund interest income of approximately $14.3. Our net income tax expense for FY 2016 was negatively impacted by withholding taxes of $1.5 pertaining to the repatriation of $50.0 from a U.S. subsidiary and deferred tax expense of $8.0 related to taxable temporary differences associated with the anticipated repatriation of undistributed earnings from certain of our Chinese subsidiaries. Our net income tax expense for FY 2016 was also negatively impacted by a Currency Tax Expense of $7.3. There was no tax impact recorded in 2016 associated with the $21.2 in non-cash impairment charges (recorded through restructuring), however, a deferred income tax benefit of $4.3 was recorded in 2017 pertaining to future tax losses arising from the ultimate disposition of our solar assets being applied against other fully taxable profits in Thailand, as discussed above.\nWe are subject to tax audits of historical information by tax authorities in various jurisdictions, which could result in additional tax expense in future periods relating to prior results. Reviews by tax authorities generally focus on, but are not limited to, the validity of our inter-company transactions, including financing and transfer pricing policies which generally involve subjective areas of taxation and a significant degree of judgment. If any of these tax authorities are successful with their challenges, our income tax expense may be adversely affected and we could also be subject to interest and penalty charges.\nThe successful pursuit of assertions made by any taxing authority could result in our owing significant amounts of tax, interest and possibly penalties. We believe we adequately accrue for any probable potential adverse tax ruling. However, there can be no assurance as to the final resolution of any claims and any resulting proceedings. If any claims and any ensuing proceedings are determined adversely to us, the amounts we may be required to pay could be material, and could be in excess of amounts accrued.\n14. FINANCIAL INSTRUMENTS AND RISK MANAGEMENT\nOur financial assets are comprised primarily of cash and cash equivalents, accounts receivable, and derivatives used for hedging purposes. Our financial liabilities are comprised primarily of accounts payable, certain accrued and other liabilities and provisions, the Term Loan, borrowings under the Revolving Facility (when applicable), and derivatives. There have been no significant changes to the classification or to the source of the inputs used to measure our financial assets or liabilities since December 31, 2016.\nCurrency risk:\nThe majority of our currency risk is driven by operational costs, including income tax expense, incurred in local currencies by our subsidiaries. As part of our risk management program, we attempt to mitigate currency risk through a hedging program using forecasts of our anticipated future cash flows and balance sheet exposures denominated in foreign currencies. We enter into foreign exchange forward contracts to lock in the exchange rates for future foreign currency transactions, which is intended to reduce the variability of our operating costs and future cash flows denominated in local currencies. While these contracts are intended to reduce the effects of fluctuations in foreign currency exchange rates, our hedging strategy does not mitigate the longer-term impacts of changes to foreign exchange rates. Our major currency exposures at December 31, 2017 are summarized in U.S. dollar equivalents in the following table. In the table below, in addition to our financial instruments, we have included certain monetary assets and liabilities, including pension and non-pension post-employment benefits and income taxes that were denominated in non-functional currencies, in order to better reflect our currency exposures. The local currency amounts have been converted to U.S. dollar equivalents using spot rates at December 31, 2017.\nCanadian dollar British\npound sterling Euro Thai baht Cash and cash equivalents $ 9.6 $ 0.3 $ 8.6 $ 1.3 Accounts receivable 0.6 — 28.5 1.5 Pension and non-pension post-employment assets — 55.0 — — Income taxes and value-added taxes receivable 16.3 — 18.5 6.3 Other financial assets 6.7 — 1.7 0.2 Pension and non-pension post-employment liabilities (74.2 ) — (0.5 ) (12.0 ) Income taxes and value-added taxes payable (2.6 ) — (1.2 ) (0.8 ) Accounts payable and certain accrued and other liabilities and provisions (55.8 ) (0.9 ) (33.0 ) (18.0 ) Net financial assets (liabilities) $ (99.4 ) $ 54.4 $ 22.6 $ (21.5 ) We enter into foreign exchange forward contracts to hedge our cash flow exposures and foreign currency swaps to hedge our balance sheet exposures. At December 31, 2017, we had foreign exchange forwards and swaps to trade U.S. dollars in exchange for the following currencies:\nCurrency Contract amount in\nU.S. dollars Weighted average\nexchange rate in\nU.S. dollars Maximum\nperiod in\nmonths Fair value\ngain (loss) Canadian dollar $ 204.8 $ 0.80 12 $ 4.1 Thai baht 79.0 0.03 12 2.2 Malaysian ringgit 48.4 0.23 12 2.6 Mexican peso 29.3 0.05 12 (0.9 ) British pound 56.4 1.34 3 (0.5 ) Chinese renminbi 71.6 0.15 12 1.5 Euro 28.7 1.19 12 0.1 Romanian leu 28.4 0.25 12 0.6 Singapore dollar 25.0 0.73 12 0.6 Other 4.5 — Total $ 576.1 $ 10.3 At December 31, 2017, the fair value of our outstanding contracts was a net unrealized gain of $10.3 (December 31, 2016 — net unrealized loss of $9.6). At December 31, 2017, we recorded $12.9 of derivative assets in other current assets and $2.6 of derivative liabilities in accrued and other current liabilities (December 31, 2016 — $5.9 of derivative assets in other current assets and $15.5 of derivative liabilities in accrued and other current liabilities). The unrealized gains or losses are a result of fluctuations in foreign exchange rates between the date the currency forward or swap contracts were entered into and the valuation date at period end.\n15. CONTINGENCIES\nLitigation:\nIn the normal course of our operations, we may be subject to lawsuits, investigations and other claims, including environmental, labor, product, customer disputes and other matters. Management believes that adequate provisions have been recorded where required. Although it is not always possible to estimate the extent of potential costs, if any, management believes that the ultimate resolution of all such pending matters will not have a material impact on our financial performance, financial position or liquidity.\nIn 2007, securities class action proceedings were initiated against us and our former Chief Executive and Chief Financial Officers in the Ontario Superior Court of Justice. The proceedings were dismissed on January 16, 2017 with no payments by the defendants.\nOther Matters:\nIn the third quarter of 2017, the Brazilian Ministry of Science, Technology, Innovation and Communications (MCTIC) issued assessments seeking to disqualify certain amounts of research and development (R&D) expenses for the years 2006 to 2009, which entitled our Brazilian subsidiary (which ceased operations in 2009) to charge reduced sales tax levies to its customers. The assessments against our Brazilian subsidiary (including interest and penalties) total approximately 39 million Brazilian real (approximately $12 at period-end exchange rates) for such years. Although we cannot predict the outcome of this matter, we believe that our R&D activities for the period are supportable, and it is probable that our position will be sustained upon full examination by the appropriate Brazilian authorities and, if necessary, upon consideration by the Brazilian judicial courts. Our position is supported by our Brazilian legal advisers.\n16. SUBSEQUENT EVENT\nOn January 24, 2018, we announced that we entered into a definitive agreement to acquire U.S.-based Atrenne Integrated Solutions, Inc. (Atrenne), a designer and manufacturer of ruggedized electromechanical solutions, primarily for military and commercial aerospace applications. The purchase price is approximately $139 (subject to specific adjustments as set forth in the definitive agreement), which we intend to finance using a combination of cash on hand and our Revolving Facility. The transaction is expected to close in the second quarter of 2018, subject to receipt of applicable regulatory approvals and satisfaction of other customary closing conditions. There can be no assurance that this transaction will be consummated in a timely manner, or at all.\nContacts: Celestica Communications (416) 448-2200 media@celestica.com Celestica Investor Relations (416) 448-2211 clsir@celestica.com\nSource:Celestica International Inc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/04eff7de-9506-43da-b145-51ad85b6ec99"], "published": "2018-01-25T00:16:00.000+02:00", "crawled": "2018-01-25T01:36:12.002+02:00", "highlightTitle": ""}