{"organizations": [], "uuid": "fc09652f7562bed717e163bcdc88fd02d4bf7a4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224478964&w=1200&r=LYNXMPEE0M120", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-denmark-submarine/danish-submarine-owner-charged-with-abusing-journalist-before-killing-her-idUSKBN1FC1RW", "country": "US", "domain_rank": 408, "title": "Danish submarine-owner charged with abusing journalist before killing her", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-23T21:40:00.000+02:00", "replies_count": 0, "uuid": "fc09652f7562bed717e163bcdc88fd02d4bf7a4b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-denmark-submarine/danish-submarine-owner-charged-with-abusing-journalist-before-killing-her-idUSKBN1FC1RW", "ord_in_thread": 0, "title": "Danish submarine-owner charged with abusing journalist before killing her", "locations": [], "entities": {"persons": [{"name": "kim wall", "sentiment": "neutral"}, {"name": "peter madsen", "sentiment": "neutral"}, {"name": "madsen", "sentiment": "none"}], "locations": [{"name": "copenhagen", "sentiment": "none"}, {"name": "copenhagen", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COPENHAGEN (Reuters) - Danish inventor Peter Madsen tied up and abused Swedish journalist Kim Wall before murdering her on board his home-built submarine, according to the indictment published on Tuesday.\nMadsen planned the murder by bringing items, including a saw and screwdrivers, which were used to hit, cut and stab Wall while she was alive, the prosecutors said.\nWall, a 30-year-old freelance journalist who was researching a story on the entrepreneur and aerospace engineer, went missing after Madsen took her out to sea in his 17-metre (56-foot) submarine in August last year.\nLater that month, police identified a headless female torso washed ashore in Copenhagen as Wall‘s.\nThe cause of her death is yet to be determined, but the prosecutors said she died by strangulation or cutting of her throat.\nMadsen has admitted dismembering Wall on board his submarine and dumping her body parts in the sea, but he denies murdering or sexually assaulting her.\nAccording to the indictment, Madsen has also been charged with endangering others’ lives, mobility and health around the time of the murder by sailing in the routes of a cruise ship and a cargo ship, along with deliberately sinking his submarine.\nOn Oct. 5, a police prosecutor said officers found images “which we presume to be real” of women being strangled and decapitated on the hard drive on Madsen’s computer in a laboratory he ran.\nLater that month, police also said investigators had found 14 interior and exterior stab wounds to the journalist’s genitals.\nMadsen was last week charged with the murder and dismembering of Wall along with a charge of sexual assault without intercourse of a particularly dangerous nature.\nProsecutors would seek a life sentence for Madsen, which in Denmark is typically around 15 years without parole, and asked for him to be held in custody until his trial begins on March 8. They also called for him to be held in “safe custody”, which can imply indefinite imprisonment.\nReporting by Julie Astrid Thomsen; Editing by Jacob Gronholt-Pedersen and Janet Lawrence\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T21:40:00.000+02:00", "crawled": "2018-01-23T17:42:56.008+02:00", "highlightTitle": ""}