{"organizations": [], "uuid": "661a7f22bb7ae1eecbcce987a369137945ad24b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-frailty-mediterranean-diet/mediterranean-diet-may-reduce-risk-of-frailty-in-old-age-idUSKBN1FJ329", "country": "US", "domain_rank": 408, "title": "Mediterranean diet may reduce risk of frailty in old age", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:41:00.000+02:00", "replies_count": 0, "uuid": "661a7f22bb7ae1eecbcce987a369137945ad24b2"}, "author": "", "url": "https://www.reuters.com/article/us-health-frailty-mediterranean-diet/mediterranean-diet-may-reduce-risk-of-frailty-in-old-age-idUSKBN1FJ329", "ord_in_thread": 0, "title": "Mediterranean diet may reduce risk of frailty in old age", "locations": [], "entities": {"persons": [], "locations": [{"name": "mediterranean", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "mediterranean sea", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "shereen lehman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - The more “Mediterranean” older adults’ diets are, the less likely they are to become frail over time, suggests an analysis of existing research.\nThe study team analyzed data on nearly 6,000 older adults who were part of four studies - three of them done in countries that actually border the Mediterranean Sea and one in Asia. No matter where they lived, people whose diets most closely followed Mediterranean diet principles were less than half as likely as those with the least-Mediterranean diets to become frail as they aged.\n“The world population is aging with increasing numbers of people living to their 80s and beyond, and there is a lot of attention on how people can stay healthy and independent as they age,” the study’s senior author told Reuters Health in an email.\n“Some people with accumulating health conditions and aging can become frail – that is, experience symptoms like lack of energy, muscle weakness, low appetite/losing weight and feel generally slowed up, and find it difficult to bounce back or recover when they become ill,” said Kate Walters, a researcher at University College London in the UK.\nThis, in turn, is associated with a risk of being admitted to hospital or becoming dependent on others for your care, Walters said. “We have been looking at ways that this can be prevented, including diet and exercise, amongst other things.”\nThere has been “a lot of research on types of exercise (which show this is good for you) but far less on the role of diet - for example, different types of diet such as the Mediterranean diet,” Walters added.\nThe Mediterranean diet is based on traditional food patterns typical of Greece and southern Italy and includes lots of plant-based foods like fresh vegetables, legumes and nuts, as well as fish and seafood. The primary source of fat is usually olive oil, rather than animal fat, and alcohol, usually wine, is included in low to moderate amounts, she and her coauthors write in Journal of the American Geriatrics Society.\nThe researchers reviewed and re-analyzed data from previously published studies conducted in China, France, Italy and Spain. All the studies had scored the participants’ diets according to how closely they adhered to Mediterranean principles, with a score of 6-9 representing the highest adherence and 0-3 representing the lowest. On average, participants were followed for about four years.\nPeople whose diets scored 4-5 had 38 percent lower risk of developing frailty during the follow up period compared to those who scored 0-3, while those with a diet score of 6-9 had 56 percent lower risk.\nThe average age of people in these studies was 70s-80s, so the findings suggest that following this diet as an older adult may have beneficial effects in maintaining health and independence, Walters said.\nThe study cannot prove, however, that adhering to a Mediterranean diet is what prevents frailty, she acknowledged.\n“The four included studies aren’t interventional studies (where people are assigned to eat a Mediterranean diet and some aren‘t); they’re observational studies comparing people who chose on their own to eat a certain way and their risk of frailty,” Dr. Michael Bogaisky of the Department of Medicine (Geriatrics) at Montefiore Health System in New York, who wasn’t involved in the study, said by email.\nAny differences seen in risk of frailty may be due to other factors associated with being the type of person who eats a Mediterranean diet rather than the diet itself, he noted.\n“For example, olive oil, fish, nuts, fresh fruits, and vegetables can be expensive. People who can afford these foods may also afford better access to healthcare, and that might explain why they’re more likely to have better outcomes,” Bogaisky said.\nThey may also be more educated or health conscious and thus more likely to eat healthier foods and more likely to exercise, all of which can influence their risk for becoming frail outside of what foods they eat, he added.\nNonetheless, he thinks it’s an “interesting finding” and that there’s strong evidence supporting eating a Mediterranean diet to prevent cardiovascular disease.\n“Preventing frailty may be another reason to eat this kind of a diet,” he said.\nSOURCE: bit.ly/2DJnxyF Journal of the American Geriatrics Society, online January 11, 2018.\n ", "external_links": [], "published": "2018-01-31T00:41:00.000+02:00", "crawled": "2018-01-31T00:59:03.003+02:00", "highlightTitle": ""}