{"organizations": [], "uuid": "8c2f90a1543eebbfc5b8d460c86c3b074cf4e5ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-patriot-transportation-holding-inc-announces-results-for-the-first-quarter-of-fiscal-year-2018.html", "country": "US", "domain_rank": 767, "title": "Patriot Transportation Holding, Inc. Announces Results for the First Quarter of Fiscal Year 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T20:28:00.000+02:00", "replies_count": 0, "uuid": "8c2f90a1543eebbfc5b8d460c86c3b074cf4e5ed"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-patriot-transportation-holding-inc-announces-results-for-the-first-quarter-of-fiscal-year-2018.html", "ord_in_thread": 0, "title": "Patriot Transportation Holding, Inc. Announces Results for the First Quarter of Fiscal Year 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "patriot transportation holding, inc", "sentiment": "neutral"}, {"name": "patriot transportation holding, inc.", "sentiment": "neutral"}, {"name": "ati", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JACKSONVILLE, Fla., Jan. 31, 2018 (GLOBE NEWSWIRE) -- Patriot Transportation Holding, Inc. (NASDAQ:PATI) –\nFirst Quarter Operating Results\nThe Company reported net income of $3,592,000, or $1.09 per share, compared to net income of $912,000, or $.28 per share, in the same quarter last year.\nFirst quarter 2018 net income included $3,041,000, or $.92 per share, due to a deferred tax benefit resulting from revaluing the company’s net deferred tax liabilities per the Tax Cuts and Jobs Act of 2017. The company’s net deferred tax liability was reduced as a result of the lower corporate income tax rates applicable to the Company going forward. As the Company has a September 30 fiscal year-end, the lower corporate income tax rate will be phased in, resulting in a U.S. statutory federal rate of approximately 24.28% for our fiscal year ending September 30, 2018, and 21% for subsequent fiscal years. The effective tax rate including the effect of state income taxes, but not including excess tax benefits from stock option exercises, is projected to decrease from 39.5% to 30.5% for fiscal 2018 and 27.5% for subsequent years.\nTotal revenues for the quarter were $27,901,000, down $857,000 from the same quarter last year. Transportation revenues (excluding fuel surcharges) were $25,570,000, down $1,689,000. Miles declined by 599,000, or 6%, to 9,252,000 versus 9,851,000 in the same quarter last year.\nThe lower revenues in the quarter resulted from the impact of the business lost during the second quarter of fiscal 2017. We have been successful at replacing some of this lost business by expanding business with existing customers and are focused on continuing to add business in markets where we can hire drivers.\nCompensation and benefits decreased $211,000 due to fewer miles driven but were 5.7 cents per mile higher as a result of the recent driver pay increase and higher training costs. Insurance and losses were only up $11,000 but were 1.9 cents per mile higher as last year’s costs were reduced by a favorable settlement of $152,000 of older insurance claims in the first quarter last year. SG&A was also only up $11,000 but was 1.6 cents higher on a per mile basis.\nNet fuel expense (i.e. gross fuel expenses less fuel surcharges) decreased by $614,000, or 5.1 cents per mile, due to fewer miles driven and higher fuel surcharges due to higher average diesel prices. Depreciation expense was down $132,000 as we sold excess equipment in our efforts to right size our fleet. Corporate expenses were down by $130,000 due mainly to the corporate management changes that occurred during fiscal 2017.\nAs a result, operating profit this quarter was $744,000 compared to $1,248,000 in the same quarter last year. Operating ratio was 97.3 this quarter versus a 95.7 in the same quarter last year.\nSummary and Outlook\nWe continue to focus on adding business to replace the loss of business that occurred last year. We recently entered into a new, three year agreement with one of our top five largest accounts that will significantly increase our business levels with this customer. This increased business is starting in February and should be fully integrated in our results beginning in the third quarter.\nThe driver market remains very tight. We implemented several hiring and retention enhancements during fiscal 2017, including a pay increase in June 2017. In the first quarter, the driver turnover rate was 62.0% versus 55.8% in the same quarter last year and 67.1% in the 4 th quarter of fiscal 2017. This quarter, our 3 rd party insurance broker will be performing a Safety and Culture perception survey throughout our organization in an effort to improve in these areas and positively impact our bottom line results.\nOur management team is committed to running the business efficiently, measuring ourselves on equipment utilization and driver productivity, while still maintaining a high level of safety and customer satisfaction. We have made significant reductions to overhead costs this fiscal year and are continuing the process of selling excess equipment to right-size the company for our current business levels. We expect to have fully accomplished this objective by the end of the 2 nd quarter.\nManagement is committed to investing in our technology in order to set ourselves apart from our competition and improve efficiencies. To date, we are roughly 90% complete on installing our new in-cab PeopleNet delivery system as well as our company-wide IT network upgrades. This quarter we will be focused on implementation of our new automated billing software and conversion of our servers and systems to a 3 rd party cloud services provider. These are being done with the focus of enhancing the employee experience, improving customer satisfaction and ultimately reducing expenses and improving our bottom line results.\nWe operate in many of the best markets in the country and are known as a top rated carrier in both safety and customer satisfaction. We are committed to focusing on safety, revenue growth, driver retention, equipment utilization and customer satisfaction. We are confident that execution of that focus will enable us to improve our profitability. We plan to maintain a strong balance sheet as we work to get to our operating ratio in the low to mid nineties.\nConference Call\nThe Company will host a conference call on January 31, 2017 at 3:00 PM (EST). Analysts, shareholders and other interested parties may access the teleconference live by calling 1-800-311-9408 domestic or international at 1-334-323-7224 then enter pass code 2365. Computer audio live streaming is available via the Internet through the Company’s website at www.patriottrans.com at the Investor Relations tab or at one of the following links (whichever is most compatible with your device or player) http://stream.conferenceamerica.com/pth013118 or http://stream.conferenceamerica.com/pth013118.m3u . An audio replay will be available for sixty (60) days following the conference call by dialing toll free 1-877-919-4059 domestic or international 1-334-323-0140 then enter pass code 39897760. An audio archive can be accessed via the internet at http://archive.conferenceamerica.com/archivestream/pth013118.mp3\nInvestors are cautioned that any statements in this press release which relate to the future are, by their nature, subject to risks and uncertainties that could cause actual results and events to differ materially from those indicated in such forward-looking statements. These include general economic conditions; competitive factors; political, economic, regulatory and climatic conditions; driver availability and cost; the impact of future regulations regarding the transportation industry; freight demand for petroleum product and levels of construction activity in the Company's markets; fuel costs; risk insurance markets; pricing; energy costs and technological changes. Additional information regarding these and other risk factors and uncertainties may be found in the Company’s filings with the Securities and Exchange Commission.\nPatriot Transportation Holding, Inc. is engaged in the transportation business. The Company’s transportation business is conducted through Florida Rock & Tank Lines, Inc. which is a Southeastern transportation company engaged in the hauling of liquid and dry bulk commodities.\nPATRIOT TRANSPORTATION HOLDING, INC. AND SUBSIDIARIES CONSOLIDATED STATEMENTS OF INCOME (In thousands) (Unaudited) THREE MONTHS ENDED DECEMBER 31, 2017 2016 Revenues: Transportation revenues $ 25,570 27,259 Fuel surcharges 2,331 1,499 Total revenues 27,901 28,758 Cost of operations: Compensation and benefits 11,873 12,084 Fuel expenses 4,122 3,904 Repairs & tires 1,573 1,638 Other operating 1,043 1,034 Insurance and losses 2,716 2,705 Depreciation expense 2,330 2,462 Rents, tags & utilities 855 863 Sales, general & administrative 2,322 2,311 Corporate expenses 487 617 Gain on equipment sales (164 ) (108 ) Total cost of operations 27,157 27,510 Total operating profit 744 1,248 Interest income and other 2 2 Interest expense (10 ) (32 ) Income before income taxes 736 1,218 Provision for income taxes (2,856 ) 306 Net income $ 3,592 912 Tax reform gain on retiree health 32 — Comprehensive Income $ 3,624 912 Earnings per common share: Net Income- Basic 1.09 0.28 Diluted 1.09 0.28 Number of shares (in thousands) used in computing: -basic earnings per common share 3,303 3,290 -diluted earnings per common share 3,304 3,294 Contact: Matt McNulty\nChief Financial Officer\n904/858-9100\nSource:Patriot Transportation Holding, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=LIsZf965-P2T427G2u_3xyXD9ghM1npkdG5GATP9ABJ7g_GTi9AsE3ExHd_I81XFSItxenTvcHGBotzhvbmGvXL2HWVYjlEDuC2RtuxqUBI=", "https://www.globenewswire.com/Tracker?data=6-lW_ko3ic5OCNUzaXdrL33BQoc4R98ChdWX0DOicNqwGzwH6PoYh7WHk-BBRoQsn_l8uNJk74soTRYeNhtP7ayw9vc9k2O9oAdj8H1qWdDkW3p-qndnx20nJaNTaqkjzk7FScK44IWXhMLM03UUTWSMfFBiSrLaeZ6-9yQSdoU=", "https://www.globenewswire.com/Tracker?data=6-lW_ko3ic5OCNUzaXdrL33BQoc4R98ChdWX0DOicNqwGzwH6PoYh7WHk-BBRoQsYXnuA4WWagfwJpjqJE2BEBcJYhpD6CsYgeWqduGaZJu7IXJSj4MgeRRgtV_-1LFVhwxG-78u9HnXx6SYtDkvQz2Addr2yh3wOLjOqVYLVrE=", "http://stream.conferenceamerica.com/pth013118.m3u", "http://archive.conferenceamerica.com/archivestream/pth013118.mp3", "https://www.globenewswire.com/Tracker?data=6-lW_ko3ic5OCNUzaXdrLxyUKVJ8pwU5EtzQhLZ9SSA3h7k7Tjwzt7jJ6u-K7-907lwvMRjweQyZinVujMa5czATaojsiXgFNVpYK-_cMGT4FMiEBFEzR8yqZyBUy1u4RWPfVTDBrCt5GIgytJ6pjLh1tDtmMNqrB4gIfSxVJTcFdxz3b7ibubcIEbaR6iV3Ur3q1T6RX7iFxOtpoKED3g==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e33cadb4-ae86-4fa1-b274-2c39a3f98466", "http://stream.conferenceamerica.com/pth013118"], "published": "2018-01-31T20:28:00.000+02:00", "crawled": "2018-01-31T22:52:23.011+02:00", "highlightTitle": ""}