{"organizations": [], "uuid": "282dbfc0861e83d149642079e7235a8c86035e72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-leandata-expands-executive-team-to-further-momentum-and-growth.html", "country": "US", "domain_rank": 767, "title": "LeanData Expands Executive Team to Further Momentum and Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:00:00.000+02:00", "replies_count": 0, "uuid": "282dbfc0861e83d149642079e7235a8c86035e72"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-leandata-expands-executive-team-to-further-momentum-and-growth.html", "ord_in_thread": 0, "title": "LeanData Expands Executive Team to Further Momentum and Growth", "locations": [], "entities": {"persons": [{"name": "karen steele", "sentiment": "none"}, {"name": "mathew", "sentiment": "none"}, {"name": "karen", "sentiment": "none"}, {"name": "asher mathew", "sentiment": "none"}, {"name": "steele", "sentiment": "none"}], "locations": [{"name": "sunnyvale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "leandata expands executive team", "sentiment": "negative"}, {"name": "vmware", "sentiment": "none"}, {"name": "leandata", "sentiment": "none"}, {"name": "informatica", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SUNNYVALE, Calif., Jan. 11, 2018 /PRNewswire/ -- LeanData , the leader in demand management for B2B organizations, announced the addition of two senior-level executives to the leadership team to further build on the company's growing momentum. The executives joining the LeanData team are:\nChief Marketing Officer Karen Steele, who will be responsible for overseeing all aspects of marketing, including the company's go-to-market strategy, demand generation, customer advocacy and branding strategies. Furthermore, Karen and her team will help LeanData drive the innovation agenda in the sales and marketing technology space. Steele brings over 25 years of B2B technology marketing experience to LeanData, having held executive roles at notable companies including VMware, Informatica, Xactly, and most recently Marketo. Vice President Business Development Asher Mathew, who will be responsible for leading all business development, channel, and M&A initiatives. Previously, Mathew led channel and partnership efforts for Avalara and Nodus Technologies.\n\"At LeanData we are passionate about helping customers accelerate time to revenue and focused on scaling our rapid growth,\" said Evan Liang, Chief Executive Officer and Co-Founder, LeanData. \"We are committed to building the strongest team in the industry and are thrilled to welcome Karen and Asher, reaffirming our commitment to our customers and partners.\"\nLeanData helps companies accelerate revenue growth by solving a costly problem facing every business: connecting the most relevant people in an organization to potential buyers. LeanData solutions help Sales and Marketing teams overcome that challenge by matching leads to accounts, and then routing them to the right sales rep, every time. LeanData's sophisticated workflow connects previously disconnected silos of information such as leads, contacts, and campaigns to opportunities across all the sales and marketing touchpoints while helping companies to strengthen sales and marketing alignment, improve the buyer experience and expedite time to revenue.\nOver the past year, LeanData has experienced significant growth, building the customer base to over 350 high-growth companies, adding several highly regarded business leaders including Chief Revenue Officer Mike D'Onofrio; growing the opportunity ecosystem and scaling sales teams. Steele and Mathew, along with the executive team, will lead LeanData into the company's next stage of growth.\n\"I am excited to join LeanData at an important inflection point for the company and the market as businesses of all sizes recognize the criticality of maximizing sales, and marketing alignment to accelerate their revenue growth,\" said Karen Steele, Chief Marketing Officer, LeanData. \"LeanData provides an incredibly strategic and invaluable solution that connects a myriad of sales and marketing touchpoints enabling revenue teams to get closer to buyers and increase the speed of sales. I look forward to broadening LeanData's reach and helping to scale and grow our business.\"\n\"I am delighted for LeanData to have the opportunity to leverage a large ecosystem to evangelize and deliver our services to help customers optimize revenue operations,\" said Asher Matthew, Vice President, Business Development, LeanData. \"Together, LeanData and our partners will be able to foster new market opportunities as the sales and marketing technology space continues to grow and evolve while focusing on the customer journey.\"\nAbout LeanData\nLeanData's intelligent Demand Management solution helps companies provide a frictionless B2B buying experience. Our lead-to-account matching and sophisticated routing deliver rich, real-time insights into accounts and help sales teams make the most of their demand. More than 350 high-growth businesses such as Nutanix, Palo Alto Networks, Marketo, and Cloudera rely on LeanData to increase pipeline, maximize marketing ROI and close more deals. Founded in 2012 by Evan Liang and Kelvin Cheung. LeanData is backed by Shasta Ventures, Sapphire Ventures, and Correlation Ventures.\nTo learn more, please visit leandatainc.com .\nCONTACT: Ashwath Kakhandiki, VP of Marketing, LeanData, ash@leandatainc.com\nView original content: http://www.prnewswire.com/news-releases/leandata-expands-executive-team-to-further-momentum-and-growth-300580987.html\nSOURCE LeanData", "external_links": ["http://www.prnewswire.com/news-releases/leandata-expands-executive-team-to-further-momentum-and-growth-300580987.html", "http://www.leandatainc.com/"], "published": "2018-01-11T17:00:00.000+02:00", "crawled": "2018-01-11T19:02:46.000+02:00", "highlightTitle": ""}