{"organizations": [], "uuid": "950f6aa48c18bb8c418f3954a7b4938905777845", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-ecosystm-onboards-ex-idc-svp-vernon-turner-to-fuel-global-expansion.html", "country": "US", "domain_rank": 767, "title": "Ecosystm onboards ex-IDC SVP Vernon Turner to fuel global expansion", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.277, "site_type": "news", "published": "2018-01-11T17:00:00.000+02:00", "replies_count": 0, "uuid": "950f6aa48c18bb8c418f3954a7b4938905777845"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-ecosystm-onboards-ex-idc-svp-vernon-turner-to-fuel-global-expansion.html", "ord_in_thread": 0, "title": "Ecosystm onboards ex-IDC SVP Vernon Turner to fuel global expansion", "locations": [], "entities": {"persons": [{"name": "vernon turner", "sentiment": "negative"}, {"name": "vernon", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "ecosystm", "sentiment": "none"}], "organizations": [{"name": "ecosystm", "sentiment": "none"}, {"name": "idc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE, Jan. 11, 2018 /PRNewswire/ -- Ecosystm , a disruptive technology research and advisory firm, has today announced the appointment of analyst industry heavyweight Vernon Turner as Executive Analyst.\nFounded in 2016, private equity backed Ecosystm promises to democratise data availability and accessibility for technology buyers, vendors and analysts globally using a 'research as a service' model. In his new role, Vernon will join the Ecosystm research leadership team, as well as support the firm's expansion into new markets.\nPrior to Ecosystm, Vernon spent the early years of his career managing IT departments at major global organisations in the banking and financial services sectors. This was followed by 18 years in senior leadership positions at global analyst firm IDC.\nInitially covering the ICT market – including Networking, Storage, Virtualisation, Data Centres and Servers – his remit later evolved to include disruptive technologies. In 2007, Vernon was appointed SVP, and in 2015, as IDC's first ever research fellow, heading up the firm's Internet of Things (IoT) practice. Vernon continues to sit on the IoT World Forum steering committee, and previously supported the governor for the state of Illinois to develop a Smart State Initiative.\nCommenting on the appointment, Amit Gupta, Founder and CEO at Ecosystm , said: \"We are delighted to have Vernon join Ecosystm and our wider network of analysts. A globally-recognised veteran of the industry, I think it's safe to say that few rival Vernon's insight into technology trends. We look forward to shaking up the tech research industry together, and making his expert analysis more widely available to the technology ecosystem.\"\nVernon Turner, Executive Analyst at Ecosystm added: \"The analyst industry is one that has remained untouched for a long time, so I'm excited at the prospect of contributing to a new way to do research. Ecosystm levels the playing field, enabling all organisations, technologies and geographies to join the mix without compromising on the quality or depth of insights. It flips the traditional model on its head and I'm eager to see where that takes us.\"\nThe appointment follows the recent additions of Ullrich Loeffler as Chief Commercial Officer and Letchmy Ganapathy as Chief Data Officer to the leadership team in October and April 2017 respectively. Ullrich is charged with driving the firm's growth strategy and optimising day-to-day operations. Meanwhile, Letchmy leads Ecosystm's data research strategy and operations. Both fellow IDC alumni, Ullrich most recently served as Managing Director for IDC South Pacific, while Letchmy was previously a Research Director for IDC Asia Pacific.\nVernon's appointment also adds to the rapid expansion of Ecosystm's global network of analyst thought leaders including:\nCharles Reed Anderson , Strategic Advisor, Internet of Things Claus Mortensen , Principal Analyst, Digital Transformation and Cloud Computing Dr. Kaushik Ghatak , Principal Advisor, Supply Chain and Operations Mike Ghasemi , Principal Advisor, Retail and Hospitality Sash Mukherjee , Principal Analyst\nThe announcement comes ahead of the launch of Ecosystm's new digital platform. For further information, please visit: http://www.ecosystm360.com/\nAbout Ecosystm\nEcosystm is a new age Technology Research and Advisory Firm that brings together tech buyers, vendors and analysts into one integrated platform. The firm moves away from the highly inefficient business models of traditional research firms and instead focuses on data democratisation, with an emphasis on accessibility, transparency and autonomy.\nWith technology becoming the number one source for innovation and differentiation, and global annual spending on technology due to exceed US$5 trillion by 2020, Ecosystm aims to enable all companies to harness the power of market data to make informed decisions. Offering data and research input, sourcing and subscription services, Ecosystm promises its users in-depth and relevant research by default.\n please visit http://www.ecosystm360.com .\nFor media enquiries, please contact:\nIsabelle Demaude\nThe Hoffman Agency\nEmail: ecosystm@hoffman.com\nContact: +65 6361 0250\nView original content: http://www.prnewswire.com/news-releases/ecosystm-onboards-ex-idc-svp-vernon-turner-to-fuel-global-expansion-300581267.html\nSOURCE Ecosystm", "external_links": ["https://www.linkedin.com/in/vernon-turner-40b4163/", "https://www.linkedin.com/in/kaushikghatak/", "http://www.ecosystm360.com/", "https://www.linkedin.com/in/clausbmortensen/", "http://www.prnewswire.com/news-releases/ecosystm-onboards-ex-idc-svp-vernon-turner-to-fuel-global-expansion-300581267.html", "https://www.linkedin.com/in/charlesreedanderson/", "https://www.linkedin.com/in/sash-mukherjee-1a77579/", "https://www.linkedin.com/in/mikeghasemi/"], "published": "2018-01-11T17:00:00.000+02:00", "crawled": "2018-01-11T19:03:26.000+02:00", "highlightTitle": ""}