{"organizations": [], "uuid": "fd0fbb2647174077ba6cc6a2398a8d23837f9556", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKhealth/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-clots-compression/after-a-clot-shorter-treatment-with-compression-stockings-may-be-ok-idUKKBN1F12JA", "country": "US", "domain_rank": 408, "title": "After a clot, shorter treatment with compression stockings may be OK", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T22:05:00.000+02:00", "replies_count": 0, "uuid": "fd0fbb2647174077ba6cc6a2398a8d23837f9556"}, "author": "", "url": "https://uk.reuters.com/article/us-health-clots-compression/after-a-clot-shorter-treatment-with-compression-stockings-may-be-ok-idUKKBN1F12JA", "ord_in_thread": 0, "title": "After a clot, shorter treatment with compression stockings may be OK", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 8:06 PM / Updated an hour ago After a clot, shorter treatment with compression stockings may be OK Lisa Rapaport 4 Min Read \n(Reuters Health) - - Even though many patients with blood clots in their veins are told to wear compression stockings for two years to prevent complications like pain and swelling, a new study suggests they may get the same results in half the time. \nAll of the patients in the study wore compression stockings for six months to treat what’s known as deep vein thrombosis, which is when clots develop in a major vein, usually in the lower leg or thigh. Patients often develop what’s known as post-thrombotic syndrome, a constellation of symptoms that include pain, swelling, sores and skin damage. \nAfter that initial six months of treatment, researchers randomly assigned 428 people to wear compression stockings for a total of two years, the current standard of care. Another 437 patients could stop wearing stockings sooner, often within just six months, based on doctors’ assessments of their risk of complications. \nOverall, 28 percent of the people assigned to wear compression stockings for two years developed post-thrombotic syndrome, as did 29 percent of the patients in the group that could halt treatment sooner. This difference was too small to rule out the possibility that it was due to chance. \n“It is possible to restrict compression to only six months on an individualized basis in those that do not experience complications,” said lead study author Dr. Arina J. ten Cate-Hoek of Maastricht University Medical Center in the Netherlands. \n“This is positive for patients because this means that only those who need compression for longer duration will prolong therapy,” ten Cate-Hoek said by email. “For the others, shorter duration of therapy means less hassles and less restrictions in their daily living.” \nOverall, two-thirds of the people in the individualized therapy group stopped wearing compression stockings before two years. About 55 percent of them stopped after six months, and another 11 percent stopped after one year. \nBy the end of the study, 125 people in the individualized therapy group developed post-thrombotic syndrome, as did 118 people in the standard two-year treatment group. \nA total of 24 patients died, including 17 on individualized therapy, but none of the fatalities were treatment-related, researchers report in The Lancet Hematology. \nThe study wasn’t designed to test whether compression stockings might work better than other interventions, and it’s not clear why more patients died in the individualized therapy group, the authors note. \nOnce patients develop post-thrombotic syndrome, however, treatment options are scarce, said Dr. Dinanda Kolbach, a researcher at Huidcentrum Limburg in Maastricht who wasn’t involved in the study. \n“Preventive therapy with elastic compression stockings has been the cornerstone of treatment for decades,” Kolbach said by email. “However, the optimum duration of treatment after the acute phase (beyond the first six months) of deep vein thrombosis was uncertain.” \nThe study results suggest that most patients can wear these for less than two years without an increased risk of complications, said Dr. Menno Huisman, a researcher at Leiden University Medical Center in the Netherlands. \n“This is very important for patients, because wearing compression stockings - which is unpractical, cumbersome and expensive - can be restricted to around 40 percent of patients needing this prolonged therapy,” Huisman, who wasn’t involved in the study, said by email. “For the other 60 percent a shorter duration means less restrictions.” \nSOURCE: bit.ly/2mmDRNy The Lancet Hematology, online December 4, 2017.", "external_links": [], "published": "2018-01-12T22:05:00.000+02:00", "crawled": "2018-01-12T22:44:28.018+02:00", "highlightTitle": ""}