{"organizations": [], "uuid": "0069c09f316152c579bac817a4cdf1b21cdd1792", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-financial-institutions-inc-announces-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Financial Institutions, Inc. Announces Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.275, "site_type": "news", "published": "2018-01-30T00:05:00.000+02:00", "replies_count": 0, "uuid": "0069c09f316152c579bac817a4cdf1b21cdd1792"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-financial-institutions-inc-announces-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Financial Institutions, Inc. Announces Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [{"name": "scott danahy naylon", "sentiment": "none"}], "locations": [{"name": "warsaw", "sentiment": "none"}, {"name": "n.y.", "sentiment": "none"}], "organizations": [{"name": "financial institutions, inc", "sentiment": "neutral"}, {"name": "five star bank", "sentiment": "none"}, {"name": "financial institutions, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WARSAW, N.Y., Jan. 29, 2018 (GLOBE NEWSWIRE) --\nFinancial Institutions, Inc. (NASDAQ:FISI), today reported financial and operational results for the fourth quarter and year ended December 31, 2017. Financial Institutions, Inc. (the “Company”) is the parent company of Five Star Bank (the “Bank”), Scott Danahy Naylon, LLC (“Scott Danahy Naylon” or “SDN”) and Courier Capital, LLC (“Courier Capital”).\nNet income for the quarter was $11.1 million compared to $8.3 million for the third quarter of 2017 and $8.7 million for the fourth quarter of 2016. After preferred dividends, net income available to common shareholders was $10.7 million, or $0.68 per diluted share, compared to $7.9 million, or $0.52 per diluted share, for the third quarter of 2017 and $8.3 million, or $0.57 per diluted share, for the fourth quarter of 2016.\nNet income for the full year 2017 was $33.5 million compared to $31.9 million for 2016. Net income available to common shareholders was $32.1 million, or $2.13 per diluted share, compared to $30.5 million, or $2.10 per diluted share, for the full year 2016.\nResults for the fourth quarter and full year were positively impacted by an estimated $2.9 million reduction in income tax expense due to the Tax Cuts and Jobs Act (the “TCJ Act”), primarily driven by a revaluation adjustment to the net deferred tax liability. On December 22, 2017, the TCJ Act was signed into law which, among other items, reduces the federal statutory corporate tax rate from 35 percent to 21 percent, effective January 1, 2018. The impact from tax reform may differ from this estimate due to, among other things, changes in interpretations and assumptions or further guidance that may be issued.\nPresident and Chief Executive Officer Martin K. Birmingham stated, “In 2017, we delivered solid financial results in a challenging interest rate environment and took several important actions that position us for continued growth and improved profitability in 2018. We completed an at-the-market equity offering (“ATM Offering”) that generated $38.3 million in net proceeds, positioning the Company for future growth; added eight mortgage loan officers plus underwriting and servicing support staff, significantly expanding our residential mortgage lending capacity; and acquired a Buffalo-area wealth management firm, furthering our strategy to increase fee-based noninterest income. We also surpassed $4 billion in total assets during the year, a significant milestone for us, achieved through collective teamwork and the successful execution of our long-term strategy.\n“We understand that our success is directly linked to the success of our communities. Accordingly, we are committed to investing in and supporting the communities we serve — through volunteer activities, charitable investments and product offerings. In furtherance of this commitment, in 2017 we added a Community Development Officer to coordinate and provide strategic direction for Five Star Bank’s Community Reinvestment Act initiatives and outreach programs throughout our footprint. In addition, two Community Development Loan Officers joined our organization last year to increase access to residential loans and low-cost deposit product opportunities in low-to-moderate income neighborhoods and promote financial literacy workshops.\n“Recent tax reform will reduce our federal income tax rate in 2018 and provide opportunities to strengthen relationships with our most valued partners ‒ our employees, our customers and the communities in which we operate. The first action taken was a one-time award of $500 to employees not covered by certain incentive programs. Approximately 70% of our employees will receive this award, and they will also be eligible to participate in a new profit-sharing program to be based on the Company’s 2018 performance.”\nFourth Quarter and Full Year 2017 Highlights:\nDiluted earnings per share (“EPS”) for the quarter of $0.68 was $0.11 higher than the fourth quarter of 2016\n- EPS for the year of $2.13 was $0.03 higher than 2016 Net interest income for the quarter of $29.8 million increased $3.0 million, or 11.4%, as compared to the fourth quarter of 2016\n- Net interest income for the year of $112.6 million increased $9.9 million, or 9.7%, as compared to 2016 Return on average common equity was 11.88% for the quarter and 9.68% for the year\n- Return on average tangible common equity was 15.03% for the quarter and 12.51% for the year ** Net interest margin was 3.25% for the quarter, an increase of three basis points from the fourth quarter of 2016\n- Net interest margin for the year was 3.21%, a decrease of three basis points from 2016 Total assets, interest-earning assets, loans and deposits reached record-high year-end levels:\n- Total assets increased $394.9 million in 2017, to $4.11 billion\n- Total interest-earning assets increased $354.1 million in 2017, to $3.78 billion\n- Total loans increased $394.9 million in 2017, to $2.74 billion\n- Total deposits increased $215.0 million in 2017, to $3.21 billion The Company declared a quarterly cash dividend of $0.22 per common share, a 5% increase from the most recent quarterly cash dividend. This dividend represented a 2.81% annualized dividend yield as of December 31, 2017, and a return of 32% of fourth quarter net income to common shareholders The Company completed its ATM Offering during the quarter and sold 294,329 shares of common stock, generating $9.0 million of gross proceeds ($8.6 million of net proceeds)\n- In 2017, approximately 1.4 million shares of common stock were sold under the ATM Offering, generating $40.0 million of gross proceeds ($38.3 million of net proceeds)\nChief Financial Officer Kevin B. Klotzbach said, “Key components of our long-term strategy are loan and deposit growth with continued expense discipline and a solid credit culture. We continued to deliver on these strategies in 2017 as demonstrated by total loan growth of 16.9%, non-public deposit growth of 8.6%, an efficiency ratio of 60.65%, a net charge-offs to average loans ratio of 0.38%, and a non-performing assets to total assets ratio of 0.31%.\n“Proceeds from the equity offering boosted our tangible common equity to tangible assets ratio to 7.17% ** at year-end. As a result, we are well-positioned to support loan growth for the foreseeable future.”\n“At-The-Market” Offering of Common Stock\nOn May 30, 2017, the Company announced an ATM Offering program under which it could sell up to $40.0 million of common stock. The program was completed in November 2017. The Company sold 1,363,964 shares of common stock under the program at a weighted average price of $29.33, representing gross proceeds of $40.0 million. Net proceeds received were $38.3 million. The Company expects to use these net proceeds to support organic growth and other general corporate purposes, including contributing capital to its banking subsidiary, Five Star Bank.\nNet Interest Income and Net Interest Margin\nNet interest income was $29.8 million in the fourth quarter of 2017, $1.3 million higher than the third quarter of 2017 and $3.0 million higher than the fourth quarter of 2016.\nAverage interest-earning assets for the quarter were $3.74 billion, $70.6 million higher than the third quarter of 2017 and $331.6 million higher than the fourth quarter of 2016. The primary driver of the increase was organic loan growth. Net interest margin was 3.25%, eight basis points higher than the third quarter of 2017 and three basis points higher than the fourth quarter of 2016. Net interest margin for the quarter was positively impacted by approximately $300 thousand of fee income comprised of yield maintenance fees relating to prepayment of mortgage-backed securities and payment deferral program fees.\nNet interest income was $112.6 million for the year 2017, $9.9 million higher than 2016. The increase was primarily the result of a $339.5 million, or 10.4%, increase in average interest-earning assets, partially offset by a three-basis-point narrowing of the net interest margin ‒ to 3.21% in 2017 from 3.24% in 2016.\nNoninterest Income\nNoninterest income was $9.0 million in the fourth quarter of 2017 as compared to $8.6 million in the third quarter of 2017 and $9.1 million in the fourth quarter of 2016.\nExcluding the net gain on investment securities from all periods, noninterest income was $8.3 million, $63 thousand lower than $8.4 million in the third quarter of 2017, and $492 thousand lower than $8.8 million in the fourth quarter of 2016. Investment advisory fees were $250 thousand higher than the third quarter of 2017 and $473 thousand higher than the fourth quarter of 2016 primarily because of the third quarter acquisition of the assets of Robshaw & Julian Associates, Inc., a Buffalo-area wealth management firm. Insurance income was $274 thousand lower than the third quarter of 2017, consistent with historic seasonality, and $80 thousand higher than the fourth quarter of 2016. Noninterest income in the fourth quarter of 2016 included a $1.2 million non-cash fair value adjustment of the contingent consideration liability relating to SDN.\nNoninterest income was $34.7 million for the year 2017 as compared to $35.8 million in 2016.\nExcluding the net gain on investment securities from both periods, noninterest income was $33.5 million in 2017, $405 thousand higher than 2016. The increase was primarily the result of an $896 thousand increase in investment advisory income, a $303 thousand increase in FHLB & FRB stock dividends, and the recognition of a $131 thousand fair value adjustment to derivative financial instruments, partially offset by $911 thousand of non-recurring death benefit proceeds from company owned life insurance in 2016.\nNoninterest Expense\nNoninterest expense was $23.2 million in the fourth quarter of 2017 as compared to $22.5 million in the third quarter of 2017 and $20.7 million in the fourth quarter of 2016.\nThe increase from the third quarter of 2017 was primarily the result of higher salaries related to organic growth initiatives and an increase in advertising and promotions expense related to development of a rebranding initiative to be launched in the first quarter of 2018. The increase from the fourth quarter of 2016 was the result of higher salaries and employee benefits related to organic growth initiatives, higher healthcare costs largely attributable to the high cost of specialty pharmaceuticals; higher occupancy and equipment expense related to 2016 and 2017 branch openings and relocation of the Rochester regional administration center; higher computer and data processing expense in connection with technology upgrades; and an increase in advertising and promotions expense as described above.\nNoninterest expense was $90.5 million for the year, a $5.8 million increase from $84.7 million in 2016. The increase was a result of the factors described above in addition to a $1.6 million non-cash goodwill impairment charge relating to SDN, partially offset by a $1.7 million decrease in professional services expense.\nIncome Taxes\nIncome tax expense was $580 thousand in the fourth quarter of 2017 as compared to $3.5 million in the third quarter of 2017 and $3.0 million in the fourth quarter of 2016. The effective tax rate was 5.0% for the quarter as compared to 29.5% in the third quarter of 2017 and 25.9% in the fourth quarter of 2016.\nThe decrease in income tax expense and lower effective tax rate was the result of an estimated $2.9 million reduction in income tax expense due to the TCJ Act, primarily driven by a revaluation adjustment to the net deferred tax liability.\nIncome tax expense for 2017 was $9.9 million, representing an effective tax rate of 22.9% as compared to the effective tax rate of 27.7% in 2016.\nEffective tax rates are impacted by items of income and expense not subject to federal or state taxation. The Company’s effective tax rates differ from statutory rates primarily because of interest income from tax-exempt securities, earnings on company owned life insurance, the non-cash fair value adjustment of the contingent consideration liability associated with the SDN acquisition, the 2017 non-cash goodwill impairment charge related to SDN and, in 2017, the net impact of the TCJ Act, as described above.\nBalance Sheet and Capital Management\nTotal assets were $4.11 billion at December 31, 2017, up $83.6 million from $4.02 billion at September 30, 2017, and up $394.9 million from $3.71 billion at December 31, 2016. The increases were the result of loan growth funded by deposit growth, short-term borrowings and proceeds from the ATM Offering.\nTotal loans were $2.74 billion at December 31, 2017, up $118.8 million, or 4.5%, from September 30, 2017, and up $394.9 million, or 16.9%, from December 31, 2016.\nCommercial business loans totaled $450.3 million, up $30.9 million, or 7.4%, from September 30, 2017, and up $100.8 million, or 28.8%, from December 31, 2016. Commercial mortgage loans totaled $808.9 million, up $50.9 million, or 6.7%, from September 30, 2017, and up $138.9 million, or 20.7%, from December 31, 2016. Residential real estate loans totaled $465.3 million, up $19.2 million, or 4.3%, from September 30, 2017, and up $37.3 million, or 8.7%, from December 31, 2016. Consumer indirect loans totaled $876.6 million, up $19.0 million, or 2.2%, from September 30, 2017, and up $124.1 million, or 16.5%, from December 31, 2016.\nTotal deposits were $3.21 billion at December 31, 2017, a decrease of $71.3 million from September 30, 2017, and an increase of $215.0 million from December 31, 2016. The decrease from September 30, 2017, was primarily due to public deposit seasonality. The increase from December 31, 2016, was primarily the result of successful business development efforts in both municipal and retail banking. Public deposit balances represented 26% of total deposits at December 31, 2017, compared to 28% at September 30, 2017 and 27% at December 31, 2016.\nShort-term borrowings were $446.2 million at December 31, 2017, up $135.4 million from September 30, 2017, and up $114.7 million from December 31, 2016. Short-term borrowings are typically utilized to manage the seasonality of public deposits; however, they were also a funding source for loans in 2017.\nShareholders’ equity was $381.2 million at December 31, 2017, compared to $366.0 million at September 30, 2017, and $320.1 million at December 31, 2016. Common book value per share was $22.85 at December 31, 2017, an increase of $0.54 or 2.4% from $22.31 at September 30, 2017, and an increase of $2.03 or 9.8% from $20.82 at December 31, 2016. The increases in shareholders’ equity and common book value per share are attributable to common stock issued through the ATM Offering plus net income less dividends paid, net of the change in unrealized gain (loss) on investment securities.\nDuring the fourth quarter of 2017, the Company declared a common stock dividend of $0.22 per common share, an increase of 5% from the most recent quarterly cash dividend. This dividend returned 32% of fourth quarter net income to common shareholders.\nMost of the Company’s regulatory capital ratios at December 31, 2017, were higher than the prior quarter and prior year as a result of capital raised in the 2017 ATM Offering:\nLeverage Ratio was 8.13%, compared to 7.91% and 7.36% at September 30, 2017, and December 31, 2016, respectively. Common Equity Tier 1 Ratio was 10.16%, compared to 10.09% and 9.59% at September 30, 2017, and December 31, 2016, respectively. Tier 1 Risk-Based Capital was 10.74%, compared to 10.69% and 10.26% at September 30, 2017, and December 31, 2016, respectively. Total Risk-Based Capital was 13.19%, compared to 13.24% and 12.97% at September 30, 2017, and December 31, 2016, respectively.\nCredit Quality\nNon-performing loans were $12.5 million at December 31, 2017, compared to $12.6 million at September 30, 2017, and $6.3 million at December 31, 2016. The ratio of non-performing loans to total loans was 0.46% at December 31, 2017; 0.48% at September 30, 2017; and 0.27% at December 31, 2016. The 2016 ratio of 0.27% was at the bottom of the Company’s 10-year historical range of 0.27% to 0.91%.\nProvision for loan losses was $3.9 million for the fourth quarter, an increase of $1.1 million from the third quarter of 2017 and an increase of $589 thousand from the fourth quarter of 2016. For the year 2017, provision for loan losses totaled $13.4 million, an increase of $3.7 million from 2016. Significant factors impacting the provision for loan losses:\nNet charge-offs were $3.6 million during the quarter, $2.0 million higher than the third quarter of 2017 and $1.8 million higher than the fourth quarter of 2016. The ratio of annualized net charge-offs to total average loans was 0.54% in the quarter; 0.25% in the third quarter of 2017; and 0.30% in the fourth quarter of 2016. For the year 2017, net charge-offs were 0.38% as compared to 0.26% in 2016. The Company’s ten-year average for net charge-offs was 0.39%. Allowances are established for loan losses on a portfolio basis, therefore, as the loan portfolio increases the allowance and provision increase. Approximately $1.5 million of the fourth quarter provision and $5.1 million of the full year provision relate to 2017 loan growth.\nThe ratio of allowance for loan losses to total loans was 1.27% at December 31, 2017; 1.31% at September 30, 2017; and 1.32% at December 31, 2016.\nConference Call\nThe Company will host an earnings conference call and audio webcast on January 30, 2018 at 8:30 a.m. Eastern Time. The call will be hosted by Martin K. Birmingham, President and Chief Executive Officer, and Kevin B. Klotzbach, Chief Financial Officer. The live webcast will be available in listen-only mode on the Company’s website at www.fiiwarsaw.com . Within the United States, listeners may also access the call by dialing 1-888-317-6016 and requesting the Financial Institutions, Inc. (FISI) call. The webcast replay will be available on the Company’s website for at least 30 days.\nAbout Financial Institutions, Inc.\nFinancial Institutions, Inc. provides diversified financial services through its subsidiaries, Five Star Bank, Scott Danahy Naylon and Courier Capital. Five Star Bank provides a wide range of consumer and commercial banking and lending services to individuals, municipalities and businesses through a network of more than 50 offices throughout Western and Central New York State. Scott Danahy Naylon provides a broad range of insurance services to personal and business clients across 45 states. Courier Capital provides customized investment management, investment consulting and retirement plan services to individuals, businesses, institutions, foundations and retirement plans. Financial Institutions, Inc. and its subsidiaries employ approximately 650 individuals. The Company’s stock is listed on the NASDAQ Global Select Market under the symbol FISI. Additional information is available at www.fiiwarsaw.com .\nNon-GAAP Financial Information\nThis news release contains disclosure regarding tangible assets, tangible common equity, tangible common equity to tangible assets, tangible common book value per share, average tangible assets, average tangible common equity, and return on average tangible common equity, which are determined by methods other than in accordance with U.S. generally accepted accounting principles (“GAAP”). The Company believes that these non-GAAP measures are useful to our investors as measures of the strength of the Company’s capital and ability to generate earnings on tangible common equity invested by our shareholders. These non-GAAP measures provide supplemental information that may help investors to analyze our capital position without regard to the effects of intangible assets. Non-GAAP financial measures have inherent limitations and are not uniformly applied by issuers. Therefore, these non-GAAP financial measures should not be considered in isolation, or as a substitute for comparable measures prepared in accordance with GAAP. The comparable GAAP financial measures and reconciliation to the comparable GAAP financial measures can be found in Appendix A to this document.\nSafe Harbor Statement\nThis press release may contain forward-looking statements as defined by Section 21E of the Securities Exchange Act of 1934, as amended, that involve significant risks and uncertainties. Statements herein are based on certain assumptions and analyses by the Company and are factors it believes are appropriate in the circumstances. Actual results could differ materially from those contained in or implied by such statements for a variety of reasons including, but not limited to: the Company’s ability to implement its strategic plan, the Company’s ability to redeploy investment assets into loan assets, whether the Company experiences greater credit losses than expected, whether the Company experiences breaches of its, or third party, information systems, the attitudes and preferences of the Company’s customers, the Company’s ability to successfully integrate and profitably operate Scott Danahy Naylon, Courier Capital and other acquisitions, the accuracy of estimates and assumptions used to revalue our deferred tax liability, the competitive environment, fluctuations in the fair value of securities in its investment portfolio, changes in the regulatory environment and the Company’s compliance with regulatory requirements, changes in interest rates, general economic and credit market conditions nationally and regionally. Consequently, all forward-looking statements made herein are qualified by these cautionary statements and the cautionary language in the Company’s Annual Report on Form 10-K, its Quarterly Reports on Form 10-Q and other documents filed with the SEC. Except as required by law, the Company undertakes no obligation to revise these statements following the date of this press release.\nFor additional information contact: Kevin B. Klotzbach Shelly J. Doran Chief Financial Officer & Treasurer Director − Investor & External Relations Phone: 585.786.1130 Phone: 585.627.1362 Email: KBKlotzbach@five-starbank.com Email: SJDoran@five-starbank.com ** See Appendix A – Reconciliation to Non-GAAP Financial Measures for the computation of this Non-GAAP measure.\nFINANCIAL INSTITUTIONS, INC. Selected Financial Information (Unaudited) (Amounts in thousands, except per share amounts) 2017\n2016\nDecember 31, September 30, June 30, March 31, December 31, SELECTED BALANCE SHEET DATA: Cash and cash equivalents $99,195 $97,838 $84,537 $149,699 $71,277 Investment securities: Available for sale 524,973 551,491 540,575 540,406 539,926 Held-to-maturity 516,466 538,332 533,471 545,381 543,338 Total investment securities 1,041,439 1,089,823 1,074,046 1,085,787 1,083,264 Loans held for sale 2,718 2,407 1,864 2,097 1,050 Loans: Commercial business 450,326 419,415 398,343 375,518 349,547 Commercial mortgage 808,908 757,987 724,064 675,007 670,058 Residential real estate loans 465,283 446,044 432,053 428,171 427,937 Residential real estate lines 116,309 117,621 118,611 120,874 122,555 Consumer indirect 876,570 857,528 826,708 786,120 752,421 Other consumer 17,621 17,640 17,093 16,937 17,643 Total loans 2,735,017 2,616,235 2,516,872 2,402,627 2,340,161 Allowance for loan losses 34,672 34,347 33,159 31,081 30,934 Total loans, net 2,700,345 2,581,888 2,483,713 2,371,546 2,309,227 Total interest-earning assets 3,782,659 3,708,385 3,593,106 3,523,613 3,428,541 Goodwill and other intangible assets, net 74,703 74,997 73,477 75,343 75,640 Total assets 4,105,210 4,021,591 3,891,538 3,859,865 3,710,340 Deposits: Noninterest-bearing demand 718,498 710,865 677,124 666,332 677,076 Interest-bearing demand 634,203 656,703 631,451 698,962 581,436 Savings and money market 1,005,317 1,050,487 999,125 1,069,901 1,034,194 Time deposits 852,156 863,453 824,786 734,464 702,516 Total deposits 3,210,174 3,281,508 3,132,486 3,169,659 2,995,222 Short-term borrowings 446,200 310,800 347,500 303,300 331,500 Long-term borrowings, net 39,131 39,114 39,096 39,078 39,061 Total interest-bearing liabilities 2,977,007 2,920,557 2,841,958 2,845,705 2,688,707 Shareholders’ equity 381,177 366,002 347,641 325,688 320,054 Common shareholders’ equity 363,848 348,668 330,301 308,348 302,714 Tangible common equity (1) 289,145 273,671 256,824 233,005 227,074 Unrealized (loss) gain on investment securities, net of tax $(2,173 ) $17 $(232 ) $(1,938 ) $(2,530 ) Common shares outstanding 15,925 15,626 15,127 14,536 14,538 Treasury shares 131 136 137 156 154 CAPITAL RATIOS AND PER SHARE DATA: Leverage ratio 8.13 % 7.91 % 7.70 % 7.30 % 7.36 % Common equity Tier 1 ratio 10.16 % 10.09 % 9.86 % 9.46 % 9.59 % Tier 1 risk-based capital 10.74 % 10.69 % 10.48 % 10.11 % 10.26 % Total risk-based capital 13.19 % 13.24 % 13.09 % 12.75 % 12.97 % Common equity to assets 8.86 % 8.67 % 8.49 % 7.99 % 8.16 % Tangible common equity to tangible assets (1) 7.17 % 6.93 % 6.73 % 6.16 % 6.25 % Common book value per share $22.85 $22.31 $21.84 $21.21 $20.82 Tangible common book value per share (1) $18.16 $17.51 $16.98 $16.03 $15.62 Stock price (Nasdaq: FISI): High $34.10 $31.15 $35.35 $35.40 $34.55 Low $28.70 $25.65 $29.09 $30.50 $25.98 Close $31.10 $28.80 $29.80 $32.95 $34.20\n(1) See Appendix A – Reconciliation to Non-GAAP Financial Measures for the computation of this Non-GAAP measure.\nFINANCIAL INSTITUTIONS, INC. Selected Financial Information (Unaudited) (Amounts in thousands, except per share amounts) Years ended 2017 2016 December 31, Fourth Third Second First Fourth 2017 2016 Quarter Quarter Quarter Quarter Quarter SELECTED INCOME STATEMENT DATA: Interest income $130,110 $115,231 $34,767 $33,396 $31,409 $30,538 $29,990 Interest expense 17,495 12,541 5,007 4,958 3,987 3,543 3,268 Net interest income 112,615 102,690 29,760 28,438 27,422 26,995 26,722 Provision for loan losses 13,361 9,638 3,946 2,802 3,832 2,781 3,357 Net interest income after provision for loan losses 99,254 93,052 25,814 25,636 23,590 24,214 23,365 Noninterest income: Service charges on deposits 7,391 7,280 1,905 1,901 1,840 1,745 1,888 Insurance income 5,266 5,396 1,214 1,488 1,133 1,431 1,134 ATM and debit card 5,721 5,687 1,491 1,445 1,456 1,329 1,500 Investment advisory 6,104 5,208 1,747 1,497 1,429 1,431 1,274 Company owned life insurance 1,781 2,808 414 449 473 445 468 Investments in limited partnerships 110 300 19 (14 ) 135 (30 ) 47 Loan servicing 439 436 91 105 123 120 104 Net gain on sale of loans held for sale 376 240 106 150 72 48 38 Net gain on investment securities 1,260 2,695 660 184 210 206 269 Net gain (loss) on other assets 37 313 12 21 6 (2 ) 28 Contingent consideration liability adjustment 1,200 1,170 - - 1,200 - 1,170 Other 5,045 4,227 1,328 1,348 1,256 1,113 1,168 Total noninterest income 34,730 35,760 8,987 8,574 9,333 7,836 9,088 Noninterest expense: Salaries and employee benefits 48,675 45,215 12,972 12,348 11,986 11,369 11,458 Occupancy and equipment 16,293 14,529 4,058 4,087 4,184 3,964 3,623 Professional services 4,083 5,782 854 1,157 1,057 1,015 844 Computer and data processing 4,935 4,451 1,244 1,208 1,312 1,171 1,116 Supplies and postage 2,003 2,047 507 492 467 537 499 FDIC assessments 1,817 1,735 451 440 469 457 452 Advertising and promotions 2,171 2,097 720 344 645 462 540 Amortization of intangibles 1,170 1,249 294 288 291 297 303 Goodwill impairment 1,575 - - - 1,575 - - Other 7,791 7,566 2,063 2,103 1,955 1,670 1,880 Total noninterest expense 90,513 84,671 23,163 22,467 23,941 20,942 20,715 Income before income taxes 43,471 44,141 11,638 11,743 8,982 11,108 11,738 Income tax expense 9,945 12,210 580 3,464 2,736 3,165 3,045 Net income 33,526 31,931 11,058 8,279 6,246 7,943 8,693 Preferred stock dividends 1,462 1,462 365 366 366 365 365 Net income available to common shareholders $32,064 $30,469 $10,693 $7,913 $5,880 $7,578 $8,328 FINANCIAL DATA AND RATIOS: Earnings per share – basic $2.13 $2.11 $0.68 $0.52 $0.40 $0.52 $0.58 Earnings per share – diluted $2.13 $2.10 $0.68 $0.52 $0.40 $0.52 $0.57 Cash dividends declared on common stock $0.85 $0.81 $0.22 $0.21 $0.21 $0.21 $0.21 Common dividend payout ratio 39.91 % 38.39 % 32.35 % 40.38 % 52.50 % 40.38 % 36.21 % Dividend yield (annualized) 2.73 % 2.37 % 2.81 % 2.89 % 2.83 % 2.58 % 2.44 % Return on average assets 0.86 % 0.90 % 1.09 % 0.83 % 0.65 % 0.86 % 0.94 % Return on average equity 9.62 % 10.01 % 11.72 % 9.17 % 7.44 % 9.94 % 10.68 % Return on average common equity 9.68 % 10.10 % 11.88 % 9.21 % 7.38 % 10.02 % 10.81 % Return on average tangible common equity (1) 12.51 % 13.51 % 15.03 % 11.76 % 9.65 % 13.30 % 14.37 % Efficiency ratio (2) 60.65 % 60.95 % 59.62 % 59.75 % 64.10 % 59.09 % 56.99 % Effective tax rate 22.9 % 27.7 % 5.0 % 29.5 % 30.5 % 28.5 % 25.9 %\n(1) See Appendix A – Reconciliation to Non-GAAP Financial Measures for the computation of this Non-GAAP measure.\n(2) The efficiency ratio is calculated by dividing noninterest expense by net revenue, i.e., the sum of net interest income (fully taxable equivalent) and noninterest income before net gains on investment securities. This is a banking industry measure not required by GAAP.\nFINANCIAL INSTITUTIONS, INC. Selected Financial Information (Unaudited) (Amounts in thousands) Years ended 2017\n2016 December 31, Fourth Third Second First Fourth 2017 2016 Quarter Quarter Quarter Quarter Quarter SELECTED AVERAGE BALANCES: Federal funds sold and interest-earning deposits $7,060 $3,116 $1,693 $- $16,639 $10,078 $12,011 Investment securities (1) 1,086,300 1,063,221 1,073,170 1,096,374 1,085,670 1,090,063 1,080,941 Loans: Commercial business 396,319 336,633 429,831 405,308 385,938 363,367 347,496 Commercial mortgage 727,849 618,436 778,765 752,634 700,010 678,613 659,713 Residential real estate loans 438,586 404,456 455,641 438,436 430,237 429,746 425,687 Residential real estate lines 118,797 124,635 116,731 117,597 119,333 121,594 122,734 Consumer indirect 819,598 703,975 865,735 841,081 802,379 767,887 741,598 Other consumer 17,111 17,620 17,618 17,184 16,680 16,956 17,448 Total loans 2,518,260 2,205,755 2,664,321 2,572,240 2,454,577 2,378,163 2,314,676 Total interest-earning assets 3,611,620 3,272,092 3,739,184 3,668,614 3,556,886 3,478,304 3,407,628 Goodwill and other intangible assets, net 74,818 76,170 74,866 73,960 74,954 75,508 75,807 Total assets 3,896,071 3,547,105 4,028,063 3,951,002 3,847,137 3,754,470 3,679,569 Interest-bearing liabilities: Interest-bearing demand 638,295 576,046 655,207 612,401 651,485 634,141 604,717 Savings and money market 1,033,836 1,010,510 1,051,367 998,769 1,054,997 1,030,363 1,076,884 Time deposits 801,394 697,654 863,770 855,371 762,874 721,404 711,061 Short-term borrowings 338,392 248,938 316,894 385,512 323,562 327,195 244,796 Long-term borrowings, net 39,094 39,023 39,121 39,103 39,085 39,067 39,050 Total interest-bearing liabilities 2,851,011 2,572,171 2,926,359 2,891,156 2,832,003 2,752,170 2,676,508 Noninterest-bearing demand deposits 674,884 633,416 703,560 679,303 658,926 657,190 655,445 Total deposits 3,148,409 2,917,626 3,273,904 3,145,844 3,128,282 3,043,098 3,048,107 Total liabilities 3,547,551 3,228,099 3,653,655 3,592,685 3,510,410 3,430,504 3,355,894 Shareholders’ equity 348,520 319,006 374,408 358,317 336,727 323,966 323,675 Common equity 331,184 301,666 357,079 340,981 319,387 306,626 306,335 Tangible common equity (2) $256,366 $225,496 $282,213 $267,021 $244,433 $231,118 $230,528 Common shares outstanding: Basic 15,044 14,436 15,749 15,268 14,664 14,479 14,459 Diluted 15,085 14,491 15,793 15,302 14,702 14,528 14,511 SELECTED AVERAGE YIELDS: (Tax equivalent basis) Investment securities 2.48 % 2.45 % 2.53 % 2.45 % 2.47 % 2.46 % 2.41 % Loans 4.22 % 4.18 % 4.29 % 4.24 % 4.16 % 4.19 % 4.17 % Total interest-earning assets 3.69 % 3.62 % 3.78 % 3.71 % 3.63 % 3.64 % 3.60 % Interest-bearing demand 0.14 % 0.14 % 0.14 % 0.14 % 0.14 % 0.14 % 0.14 % Savings and money market 0.14 % 0.13 % 0.16 % 0.15 % 0.14 % 0.13 % 0.13 % Time deposits 1.09 % 0.90 % 1.21 % 1.15 % 1.01 % 0.95 % 0.93 % Short-term borrowings 1.16 % 0.65 % 1.40 % 1.29 % 1.08 % 0.86 % 0.70 % Long-term borrowings, net 6.32 % 6.33 % 6.32 % 6.32 % 6.32 % 6.32 % 6.33 % Total interest-bearing liabilities 0.61 % 0.49 % 0.68 % 0.68 % 0.56 % 0.52 % 0.49 % Net interest spread 3.08 % 3.13 % 3.10 % 3.03 % 3.07 % 3.12 % 3.11 % Net interest margin 3.21 % 3.24 % 3.25 % 3.17 % 3.18 % 3.23 % 3.22 %\n(1) Includes investment securities at adjusted amortized cost.\n(2) See Appendix A – Reconciliation to Non-GAAP Financial Measures for the computation of this Non-GAAP measure.\nFINANCIAL INSTITUTIONS, INC. Selected Financial Information (Unaudited) (Amounts in thousands) Years ended\n2017\n2016 December 31,\nFourth\nThird\nSecond\nFirst\nFourth\n2017\n2016\nQuarter\nQuarter\nQuarter\nQuarter\nQuarter\nASSET QUALITY DATA: Allowance for Loan Losses Beginning balance $30,934 $27,085 $34,347 $33,159 $31,081 $30,934 $29,350 Net loan charge-offs (recoveries): Commercial business 3,198 496 1,622 44 568 964 52 Commercial mortgage (252 ) 340 (5 ) (5 ) (38 ) (204 ) 212 Residential real estate loans 301 115 88 161 78 (26 ) (1 ) Residential real estate lines 46 89 40 19 (46 ) 33 41 Consumer indirect 5,720 4,489 1,636 1,244 1,082 1,758 1,361 Other consumer 610 260 240 151 110 109 108 Total net charge-offs 9,623 5,789 3,621 1,614 1,754 2,634 1,773 Provision for loan losses 13,361 9,638 3,946 2,802 3,832 2,781 3,357 Ending balance $34,672 $30,934 $34,672 $34,347 $33,159 $31,081 $30,934 Net charge-offs (recoveries) to average loans (annualized): Commercial business 0.81 % 0.15 % 1.50 % 0.04 % 0.59 % 1.08 % 0.06 % Commercial mortgage -0.03 % 0.05 % -0.00 % -0.00 % -0.02 % -0.12 % 0.13 % Residential real estate loans 0.07 % 0.03 % 0.08 % 0.15 % 0.07 % -0.02 % -0.00 % Residential real estate lines 0.04 % 0.07 % 0.14 % 0.06 % -0.15 % 0.11 % 0.13 % Consumer indirect 0.70 % 0.64 % 0.75 % 0.59 % 0.54 % 0.93 % 0.73 % Other consumer 3.56 % 1.48 % 5.40 % 3.49 % 2.65 % 2.61 % 2.46 % Total loans 0.38 % 0.26 % 0.54 % 0.25 % 0.29 % 0.45 % 0.30 % Supplemental information (1) Non-performing loans: Commercial business $5,344 $2,151 $5,344 $7,182 $7,312 $3,753 $2,151 Commercial mortgage 2,623 1,025 2,623 2,539 2,189 1,267 1,025 Residential real estate loans 2,252 1,236 2,252 1,263 1,579 1,601 1,236 Residential real estate lines 404 372 404 325 379 336 372 Consumer indirect 1,895 1,526 1,895 1,250 1,149 1,040 1,526 Other consumer 13 16 13 26 22 23 16 Total non-performing loans 12,531 6,326 12,531 12,585 12,630 8,020 6,326 Foreclosed assets 148 107 148 281 154 58 107 Total non-performing assets $12,679 $6,433 $12,679 $12,866 $12,784 $8,078 $6,433 Total non-performing loans to total loans 0.46 % 0.27 % 0.46 % 0.48 % 0.50 % 0.33 % 0.27 % Total non-performing assets to total assets 0.31 % 0.17 % 0.31 % 0.32 % 0.33 % 0.21 % 0.17 % Allowance for loan losses to total loans 1.27 % 1.32 % 1.27 % 1.31 % 1.32 % 1.29 % 1.32 % Allowance for loan losses to non-performing loans 277 % 489 % 277 % 273 % 263 % 388 % 489 %\n___", "external_links": ["https://www.globenewswire.com/Tracker?data=788zsG5xeZVlFX2dWO9frL6QEsEhsU5W4nKC_nqAqmmcxPmrvd4zdrMvkfdUCHS2yhRy4kVwru5912_OyyAl0L3wHGfH8pZ1APlDRuDW9HkqsjuSqr_fQjz4NyjoC8PmxQSLhS1_nkP3hX0WR3htJYdzpwxyGLeENjuuIh8fEuSA6j5eZAReg6XauRKOqOD38bwjlrtmRaZJ1vEC2tc1YkLIF7a_YdCPHeoqvIlwfcc=", "https://www.globenewswire.com/Tracker?data=788zsG5xeZVlFX2dWO9frE1jmj2GD3JzdsLJ5JSRyB0EA8_RGkX6BD6EFqlfmYOScIVx67lBuL7q51BF9kj4oQ=="], "published": "2018-01-30T00:05:00.000+02:00", "crawled": "2018-01-30T01:33:07.011+02:00", "highlightTitle": ""}