{"organizations": [], "uuid": "d95e4d5cbc3c07c78e3e17ea680db7b0881ce2dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-aberdeen-chile-fund-inc-announces-results-of-annual-meeting-and-special-meeting-of-shareholders-retirement-of-enrique-arzac-as.html", "country": "US", "domain_rank": 767, "title": "Aberdeen Chile Fund, Inc. Announces Results Of Annual Meeting And Special Meeting Of Shareholders, Retirement Of Enrique Arzac As Chairman And Director Of The Board And Additional Information Regarding Tender Offer In Connection With Proposed Fund Consoli", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T02:12:00.000+02:00", "replies_count": 0, "uuid": "d95e4d5cbc3c07c78e3e17ea680db7b0881ce2dd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-aberdeen-chile-fund-inc-announces-results-of-annual-meeting-and-special-meeting-of-shareholders-retirement-of-enrique-arzac-as.html", "ord_in_thread": 0, "title": "Aberdeen Chile Fund, Inc. Announces Results Of Annual Meeting And Special Meeting Of Shareholders, Retirement Of Enrique Arzac As Chairman And Director Of The Board And Additional Information Regarding Tender Offer In Connection With Proposed Fund Consoli", "locations": [], "entities": {"persons": [{"name": "consoli", "sentiment": "neutral"}], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "retirement of enrique arzac", "sentiment": "neutral"}, {"name": "aberdeen chile fund, inc.", "sentiment": "neutral"}, {"name": "aberdeen chile fund, inc", "sentiment": "neutral"}, {"name": "fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Jan. 26, 2018 /PRNewswire/ -- Aberdeen Chile Fund, Inc. (the \"Fund\") (NYSE AMER: CH) announced today the results of its 2018 annual meeting of shareholders (the \"Annual Meeting\") and the special meeting of shareholders (the \"Special Meeting,\" and together with the Annual Meeting, the \"Meetings\"), both held on January 26, 2018.\nAt the Annual Meeting, shareholders of the Fund voted to approve the election of three Directors to the Board of Directors of the Fund (the \"Annual Meeting Proposal\"). At the Special Meeting, shareholders of the Fund voted to approve (i) an amendment to the Fund's Articles of Incorporation to increase the total number of shares of capital stock; (ii) the issuance of additional shares of common stock of the Fund in connection with the potential reorganizations of certain other closed-end funds into the Fund; (iii) the elimination of the Fund's fundamental investment policy to invest primarily in Chilean securities; (iv) an amendment to the Fund's fundamental investment restriction relating to borrowing; and (v) an amendment to the Fund's Investment Advisory Agreement to provide that fees payable thereunder will be calculated at a lower annual rate based solely on net assets (each, a \"Special Meeting Proposal\" and collectively with the \"Annual Meeting Proposal,\" the \"Proposals\").\nThe purpose of the Meetings was to seek shareholder approval of the Proposals in connection with the consolidation of up to eight closed-end funds, including the Fund. Contingent on the consolidation, the Fund's investment strategy would change to a multi-cap emerging markets equity income investment strategy. The consolidation would achieve certain economies of scale and other operational efficiencies.\nIn the consolidation, the Fund would consolidate with one or more of the following other closed-end funds: Aberdeen Emerging Markets Smaller Company Opportunities Fund, Inc. (\"ABE\"), Aberdeen Israel Fund, Inc. (\"ISL\"), Aberdeen Indonesia Fund, Inc. (\"IF\"), Aberdeen Latin America Equity Fund, Inc. (\"LAQ\"), Aberdeen Singapore Fund, Inc. (\"SGF\"), Aberdeen Greater China Fund, Inc. (\"GCH\") and The Asia Tigers Fund, Inc. (\"GRR\" and collectively with ABE, ISL, IF, LAQ, SGF and GCH, the \"Target Funds\" and each, a \"Target Fund\"). The consolidation of each Target Fund with the Fund would be effected pursuant to an Agreement and Plan of Reorganization between the Fund and the Target Fund, and would be subject to the approval of the Target Fund's shareholders and certain other conditions (each, a \"Reorganization\" and collectively, the \"Reorganizations\"). Shareholders of the Fund voted to approve the Proposals to enable the Fund to serve as the surviving fund (the \"Combined Fund\") following the Reorganizations and to allow the Fund to follow an emerging markets equity income investment strategy that utilizes leverage following the consolidation. The Reorganizations are expected to be voted on by the Target Fund's shareholders in the late first or early second quarter of 2018. Subject to the requisite approval of the shareholders of a Target Fund with regard to the applicable Reorganization, it is currently expected that the closing date will be prior to the end of April 2018; however, this is subject to change depending on the timing of each Target Fund shareholder approval.\nIf the Reorganizations are completed, the global emerging markets equity (GEM) investment team of the Fund's adviser and its affiliates would continue to be responsible for the day-to-day management of the Combined Fund following the consolidation. The GEM team has been investing in emerging market equities since the 1980s and has experience over many years managing listed closed-end funds with income or total return as an investment objective. The GEM team works in a collaborative fashion, with all team members having both portfolio management and research responsibilities. Devan Kaloo and Joanne Irvine will continue to lead the team that is jointly and primarily responsible for managing the Combined Fund following the consolidation. The proxy for the Meetings includes further details about the portfolio management team and is available on the Fund's website ( aberdeench.com ).\nIf the Reorganizations are completed, then the Combined Fund would follow a multi-cap emerging markets equity income investment strategy that utilizes leverage. The Combined Fund would seek to provide both current income and long-term capital appreciation by investing, under normal market conditions, at least 80% of its net assets, plus any borrowings for investment purposes, in emerging market equity securities. Additionally, it is anticipated that the Combined Fund would begin using leverage for investment purposes through borrowing in an amount currently estimated to be approximately 10% of total assets. The countries in which the GEM team currently expects to invest approximately 10% or more of the Combined Fund's assets are Brazil, China and India, and 5% or more in Indonesia, Mexico, South Africa, Taiwan and Thailand. The sectors in which the GEM team currently expects to invest approximately 10% or more of the Combined Fund's assets are Consumer Staples, Financials, IT and Telecom Service, and approximately 5% or more in Materials, Industrials, Consumer Discretionary and Real Estate. The GEM team's expectations with respect to the percentages of leverage, country allocation and sector allocation are based on current market conditions and could vary significantly under market conditions following the Reorganizations.\nThe election of each Director approved today (each a \"Post-Reorganization Director\") is contingent upon the Reorganization of the Target Fund for which such Post-Reorganization Director currently serves as a director into the Combined Fund. If such Target Fund's shareholders do not approve the Reorganization of their Target Fund, the term of the corresponding Post-Reorganization Director will not commence and the Board will be comprised of the Post-Reorganization Directors whose Target Fund's Reorganization has been approved by shareholders and closed, plus the remaining Fund Board members.\nThe Special Meeting Proposals would take effect immediately before or upon the first Reorganization closing. In addition, the Board has approved changes to the Fund's name, ticker symbol, investment objective, investment strategy, benchmark index and a new expense limitation agreement (\"Additional Fund Changes\"), which will also take effect upon the first Reorganization closing. If none of the Reorganizations are consummated because they either were not approved by Target Fund shareholders or the conditions for consummation are not met, none of the Special Meeting Proposals or Additional Fund Changes will take effect and the Fund will continue to operate as it does currently.\nAs of the record date for the Annual Meeting, November 7, 2017, there were 9,357,689 outstanding shares of the Fund. 86.38% of the outstanding shares were present at the Annual Meeting, representing a quorum.\nThe description of the Annual Meeting Proposal, the percentage of shareholders' votes cast for and against each Post-Reorganization Director and number of shares voted at the Meeting are as follows:\nTo elect two Class I Directors and one Class II Director to the Board of Directors:\nTarget Fund Currently\nOverseen by Nominee\nPercentage\nof Votes\nCast For\nVotes For\nPercentage\nof Votes\nCast\nAgainst\nVotes\nAgainst\nAbstained\nNancy Yao\nMaasbach 1\nThe Asia Tigers Fund,\nInc. (GRR)\n94.34%\n7,624,979\n3.46%\n279,534\n178,185\nC. William\nMaher 2\nAberdeen Greater\nChina Fund, Inc.\n(GCH)\n95.01%\n7,679,263\n2.81%\n226,873\n176,563\nRahn Porter 1\nAberdeen Singapore\nFund, Inc. (SGF)\n91.20%\n7,371,058\n2.86%\n230,790\n480,850\n1 Class I Director serving until 2021 Annual Meeting of Shareholders.\n2 Class II Director serving until 2019 Annual Meeting of Shareholders.\nEach Post-Reorganization Director in the table above received the requisite shareholder vote at the Annual Meeting. Under the Fund's retirement policy, the term of Mr. Enrique Arzac, the Fund's current Chairman expired at the Annual Meeting. The Board would like to extend its sincere gratitude to Mr. Arzac and acknowledge the invaluable contribution he has made to the Fund during his tenure and wish him the best of success in all his future endeavours.\nDirectors whose terms of office continued beyond the Meeting are as follows: James J. Cattano, Lawrence J. Fox and Steven N. Rappaport. Effective upon the retirement of Mr. Arzac, the Board appointed Mr. Rappaport, an Independent Director, to serve in the role of Chairman.\nAs of the record date for the Special Meeting, November 7, 2017, there were 9,357,689 outstanding shares of the Fund. 60.27% of the outstanding shares were present at the Special Meeting, representing a quorum.\nThe description of the Special Meeting Proposals, the percentage of shareholders' votes cast for and against each Special Meeting proposal and number of shares voted at the Meeting are as follows:\nPercentage\nof Votes\nCast For\nVotes For\nPercentage\nof Votes\nCast\nAgainst\nVotes\nAgainst\nAbstained\ni) an amendment to the\nFund's Articles of\nIncorporation to\nincrease the total\nnumber of\nshares of\ncapital stock\n90.02%\n5,076,435\n8.67%\n488,687\n74,341\nii) the issuance of\nadditional shares of\ncommon stock of the\nFund in connection\nwith the potential\nreorganizations\n89.94%\n5,071,878\n8.72%\n491,459\n76,127\niii) the elimination of\nthe Fund's fundamental\ninvestment policy to\ninvest primarily in\nChilean securities\n90.14%\n5,083,491\n8.54%\n481,739\n74,233\niv) an amendment to\nthe Fund's\nfundamental\ninvestment restriction\nrelating to borrowing\n89.22%\n5,031,456\n9.38%\n528,747\n79,260\nv) an amendment to the\nFund's Investment\nAdvisory Agreement\n94.45%\n5,326,645\n4.15%\n233,852\n78,967\nEach Special Meeting Proposal in the table above received the requisite shareholder vote at the Special Meeting.\nAdditional Information Regarding Tender Offer in Connection with Fund Consolidation\nFollowing the consolidation, the Combined Fund will commence a tender offer for its shares. It is expected that assets distributed in the tender offer, together with net realized capital gains, will aggregate up to a maximum distribution of 50%, and not less than 40%, of the net assets of the Combined Fund post-consolidation.\nThe Combined Fund will sell portfolio securities to realign the portfolio and raise cash to pay for shares tendered in the tender offer, which will result in portfolio transaction costs and possibly generate capital gains. The Combined Fund anticipates that it will pay a special distribution as soon as practicable following the consolidation to distribute most of the capital gains generated by the portfolio transactions effected to realign the portfolio or raise cash for the tender. The amount of the special distribution assuming that all Target Funds participate in the proposed Reorganizations cannot currently be estimated with an appropriate level of certainty. Additionally, the amount of the special distribution will impact the size of the tender offer. At a later date, as estimates become more clear, the Fund will issue more details regarding the estimated amount of the special distribution and tender offer. Barring exceptional or unforeseen circumstances, the Combined Fund anticipates announcing the amount of the tender offer and an estimate of the special capital gains distribution within approximately 10 business days after the closing of the consolidation, both of which are expected to be completed and paid within approximately 60 days following the closing of the consolidation. At the end of the Combined Fund's taxable year, any net capital gains realized from the portfolio realignment, tender offer and routine trading that have not previously been distributed would be distributed to shareholders at year end.\nAll U.S. shareholders (other than tax-exempt shareholders) who sell shares in the tender offer are expected to recognize gain or loss for U.S. federal income tax purposes equal to the difference between the cash they receive for the shares sold and their adjusted cost basis in the shares. The sale date for tax purposes will be the date the Fund accepts shares for purchase. Participating shareholders may also be subject to additional U.S. federal taxation under certain circumstances and should consult their tax adviser regarding specific tax consequences, including potential state, local and foreign tax consequences. Existing shareholders who choose not to tender will retain their investment in the Combined Fund and therefore would not trigger a taxable event at that time. The special distribution, along with any further distributions at year end, will be taxable to the Combined Fund's shareholders for U.S. federal income tax purposes.\nImportant Information\nThe information in this press release is for informational purposes only and shall not constitute an offer to sell or the solicitation of an offer to sell or the solicitation of an offer to buy any securities or the solicitation of any vote or approval in any jurisdiction pursuant to or in connection with the proposed transaction or otherwise, nor shall there be any sale, issuance or transfer of securities in any jurisdiction in contravention of applicable law. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended.\nFor more information about the consolidation and potential benefits, please review the Fund's proxy statement available at aberdeench.com .\nInternational investing entails special risk considerations, including currency fluctuations, lower liquidity, economic and political risks, and difference in accounting methods.\nClosed-end funds are traded on the secondary market through one of the stock exchanges. The Fund's investment return and principal value will fluctuate so that an investor's shares may be worth more or less than the original cost. Shares of closed-end funds may trade above (a premium) or below (a discount) the net asset value (NAV) of the fund's portfolio. There is no assurance that the Fund will achieve its investment objective.\nIf you wish to receive this information electronically, please contact InvestorRelations@aberdeenstandard.com\naberdeench.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/aberdeen-chile-fund-inc-announces-results-of-annual-meeting-and-special-meeting-of-shareholders-retirement-of-enrique-arzac-as-chairman-and-director-of-the-board-and-additional-information-regarding-tender-offer-in-connection-w-300589153.html\nSOURCE Aberdeen Chile Fund, Inc.", "external_links": ["http://www.aberdeench.com/aam.nsf/usClosedCh/announcements", "http://www.prnewswire.com/news-releases/aberdeen-chile-fund-inc-announces-results-of-annual-meeting-and-special-meeting-of-shareholders-retirement-of-enrique-arzac-as-chairman-and-director-of-the-board-and-additional-information-regarding-tender-offer-in-connection-w-300589153.html", "http://www.aberdeench.com/en/usclosedch/announcements"], "published": "2018-01-27T02:12:00.000+02:00", "crawled": "2018-01-27T03:53:21.002+02:00", "highlightTitle": ""}