{"organizations": [], "uuid": "57fad3f8a5117937c20219ac3cbf1119321c44da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF455_314ZP_TOP_20180129185858.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7455.xml", "section_title": "WSJ.com: WSJD", "url": "https://www.wsj.com/articles/how-the-tax-overhaul-will-affect-tech-companies-earnings-1517308201", "country": "US", "domain_rank": 387, "title": "How the Tax Overhaul Will Affect Tech Companies’ Earnings", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T12:30:00.000+02:00", "replies_count": 0, "uuid": "57fad3f8a5117937c20219ac3cbf1119321c44da"}, "author": "Douglas MacMillan", "url": "https://www.wsj.com/articles/how-the-tax-overhaul-will-affect-tech-companies-earnings-1517308201", "ord_in_thread": 0, "title": "How the Tax Overhaul Will Affect Tech Companies’ Earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "silicon valley", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4 COMMENTS Silicon Valley threw its support behind the congressional tax overhaul. How much will the new rules help their bottom line?\nInvestors will closely watch tech firms’ financial results over the next few weeks for clues on how the new U.S. tax system will affect profits. A drop in the corporate tax rate to 21% from 35% will boost earnings at most businesses, but for some tech giants, the benefit of the lower rate could be partially offset by one-time mandatory levies on their huge overseas cash stockpiles.\nThe exact impact of the new tax rules won’t be known for several months, as regulators spell out how they will enforce the changes and as companies make adjustments.\nBut executives are already dropping tax hints as they update investors on fourth-quarter results. Here are the four key areas to watch.\nOffshore profits The tax overhaul gave incentives for American businesses to bring their estimated $2.5 trillion in offshore profits back to the U.S. Where they once paid up to 35% on profits brought to the U.S., they will now generally pay no U.S. taxes on future overseas profits.\nBig Bills U.S. tech companies with the highest estimated taxes due on foreign profits Taxes on foreign profits \nApple*\n$38\nbillion\nMicrosoft\n$11.7\nIBM*\nCisco\n$6.1\n$5.5\nAlphabet\n$5.4\nOracle\n$5.2\nIntel*\nQualcomm\n$4.7\n$4.0\n*Companies that have already announced taxes on foreign profits \nSources: WSJ analysis of corporate filings; Calcbench\nBut there is a catch: All companies will be forced to pay a one-time tax on the overseas profits they have accumulated so far, at 15.5% on cash and liquid assets and 8% on other assets, including factories and equipment. The tax is due regardless of whether they bring it home or not, though companies may choose to pay it over eight years. Businesses must generally book this tax as a one-time charge in the final quarter of 2017. Apple said this month it would pay $38 billion in taxes and return the majority of its overseas cash to the U.S.\nThe taxes companies pay on these profits will vary somewhat, depending on both the size of the profits and how they have been invested. Companies must pay 15.5% on liquid assets, such as cash and a variety of marketable securities, and 8% on other assets. Technology companies tend to have a larger amount of liquid assets as a share of their overseas stockpile than other industries: For instance, 95% of networking giant Cisco Systems Inc.’s accumulated foreign profit last year was in cash and cash equivalents, versus 22% for retailer Wal-Mart Stores Inc. \nThe Wall Street Journal estimated that 311 large publicly traded companies could generate nearly $250 billion in these taxes , of which 38% could be paid by tech companies.\nTax rates Tech giants generally enjoy low effective tax rates because a portion of their profits accumulate in low-tax foreign jurisdictions. Tech firms paid an average tax rate of 24% over the 10-year period through 2016, below the 29% average tax rate for all companies in the S&P 500 for that period and lower than any other industry, according to an analysis of corporate filings by Zion Research Group.\nLow Rates Tech companies in S&P 500 with the lowest average tax rates over 10 years. Average tax rates\nFor 2007-2016\nAlphabet\n19.7%\nCisco\n18.5%\nQualcomm\n17.1%\nEbay\n13.1%\nHewlett-Packard Ent.\n12.6%\n21%\nFederal statutory tax rate\nSources: Zion Research Group analysis of company filings\nCompanies that pay the lowest effective rates may be punished by the new rules, which set a minimum 10.5% tax on wide swaths of future offshore profits. That means firms like Google parent Alphabet Inc. and Cisco Systems, which over the past decade have paid lower tax rates on average than the new statutory rate of 21%, may soon see their rates go up. International Business Machines Inc., which paid a tax rate of 12% last year excluding one-time benefits, said this month its rate will rise to as much as 18% in 2018.\nThe five biggest tech companies— Apple Inc., Alphabet, Microsoft Corp. , Amazon.com Inc. and Facebook Inc. —all report earnings this week and investors will be looking for guidance on tax rates.\nUse of capital Now that companies are free to bring foreign cash to the U.S. at no added cost, they will be dogged with the question of how they plan to spend it. Tech firms are already among the biggest spenders on research and development and on acquisitions. Adding to these budgets may not be the answer.\nSpending Habits Spending by tech companies in S&P 500 on research and development and capital expenditures as a share of revenue.* Research and Development\nEnhancing products and crafting new innovations.\nCapital Expenditures\nBuying and building physical assets like factories.\nAlphabet\nAlphabet\nS&P 500 Tech.\nMicrosoft\nMicrosoft\nS&P 500\nCisco\nApple\nS&P 500\nS&P 500 Tech.\nIBM\nIBM\nApple\nCisco\n16%\n4%\n8%\n0%\n12%\n0%\n16%\n4%\n8%\n12%\nResearch and Development\nEnhancing products and crafting new innovations.\nCapital Expenditures\nBuying and building physical assets like factories.\nAlphabet\nAlphabet\nS&P 500 Tech.\nMicrosoft\nMicrosoft\nS&P 500\nCisco\nApple\nS&P 500\nS&P 500 Tech.\nIBM\nIBM\nApple\nCisco\n0%\n16%\n4%\n8%\n12%\n12%\n8%\n4%\n0%\n16%\nCapital Expenditures\nBuying and building physical assets like factories.\nResearch and Development\nEnhancing products and crafting new innovations.\nAlphabet\nAlphabet\nS&P 500 Tech.\nMicrosoft\nMicrosoft\nS&P 500\nCisco\nApple\nS&P 500\nS&P 500 Tech.\nIBM\nIBM\nApple\nCisco\n4%\n8%\n12%\n0%\n16%\n12%\n8%\n4%\n16%\n0%\nResearch and Development\nEnhancing products and crafting new innovations.\nAlphabet\nS&P 500 Tech.\nMicrosoft\nCisco\nS&P 500\nIBM\nApple\n12%\n4%\n16%\n0%\n8%\nCapital Expenditures\nBuying and building physical assets like factories.\nAlphabet\nMicrosoft\nS&P 500\nApple\nS&P 500 Tech.\nIBM\nCisco\n16%\n0%\n4%\n8%\n12%\n*Latest annual filing available \nSources: WSJ analysis of corporate filings; S&P Capital IQ\nThe easiest solution strategically—to return cash to shareholders through buybacks and dividends—may be unwise politically. The Republicans sold the tax overhaul on the promise that it would return investment to the U.S., not to enrich shareholders.\n“It will be interesting to see what companies ultimately do with more unfettered access to their global cash,” said Kirsten Malm, a partner at law firm Baker McKenzie who advises tech firms on taxes. “Is this going to set off a new wave of M&A? Will we see share buybacks? Maybe not, because share prices are so high at the moment.”\nBorrowing With most of their cash sitting offshore, tech giants have increasingly issued debt to finance their growth and return money to shareholders. Tech firms in the S&P 500 collectively held nearly $566 billion in long-term debt in the most recent quarter, more than three times the amount they held just five years ago. That is a faster pace of growth than any other sector.\nRacking Up Debt Tech companies acquired debt at a faster pace than any other sector in the S&P 500 over the last five years. Selected sectors\nPct. \nchange\n2017\nInformation Technology\n235.1%\n2012\nTelecom.\n130.2\nHealthcare\n82.7\nEnergy\n42.2\nConsumer Staples\n41.8\nUtility\n38.2\nReal Estate\n32.2\nIndustrials\n3.9\n$0\n$600\n$200\n$400\nDEBT, IN BILLIONS\nSelected sectors\nPct. \nchange\n2017\nInformation Technology\n235.1%\n2012\nTelecom.\n130.2\nHealthcare\n82.7\nEnergy\n42.2\nConsumer Staples\n41.8\nUtility\n38.2\nReal Estate\n32.2\nIndustrials\n3.9\n$400\n$200\n$600\n$0\nDEBT, IN BILLIONS\nSelected sectors\nPct. \nchange\n2017\nInformation Technology\n235.1%\n2012\nTelecom.\n130.2\nHealthcare\n82.7\nEnergy\n42.2\nConsumer Staples\n41.8\nUtility\n38.2\nReal Estate\n32.2\nIndustrials\n3.9\n$200\n$600\n$0\n$400\nDEBT, IN BILLIONS\nSelected sectors\nPct. \nchange\n2017\nInformation Tech.\n235.1%\n2012\nTelecom.\n130.2\nHealthcare\n82.7\nEnergy\n42.2\nConsumer Staples\n41.8\nUtility\n38.2\nReal Estate\n32.2\nIndustrials\n3.9\n$600\n$200\n$400\n$0\nDEBT, IN BILLIONS\nSources: WSJ analysis of corporate filings; S&P Capital I.Q. \nNow that they can access their overseas cash, tech giants have less need for debt, said Jason Pompeii, senior director at Fitch Ratings. “We believe those companies borrow only because they don’t have access to their cash flow,” Mr. Pompeii said. “We would expect debt issuance in the technology sector to decrease.”\nInvestors will be asking the companies with the most debt whether they intend to pay it off ahead of schedule. That includes Apple, with long-term debt of $97 billion; Microsoft, with $76 billion; and Oracle Corp. , with $58 billion.\nWrite to Douglas MacMillan at douglas.macmillan@wsj.com", "external_links": [], "published": "2018-01-30T12:30:00.000+02:00", "crawled": "2018-01-30T16:13:30.003+02:00", "highlightTitle": ""}