{"organizations": [], "uuid": "3c84350e5d75dca7f22dcd2341cbe9db87acdbf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 309, "shares": 309, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222013550&w=1200&r=LYNXMPEE0E01E", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-missiles-falsealarm/hawaii-says-lack-of-adequate-fail-safe-measures-led-to-false-missile-alert-idUSKBN1F403A", "country": "US", "domain_rank": 408, "title": "Hawaii says lack of adequate fail-safe measures led to false missile alert", "performance_score": 3, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T02:55:00.000+02:00", "replies_count": 0, "uuid": "3c84350e5d75dca7f22dcd2341cbe9db87acdbf3"}, "author": "", "url": "https://www.reuters.com/article/us-usa-missiles-falsealarm/hawaii-says-lack-of-adequate-fail-safe-measures-led-to-false-missile-alert-idUSKBN1F403A", "ord_in_thread": 0, "title": "Hawaii says lack of adequate fail-safe measures led to false missile alert", "locations": [], "entities": {"persons": [{"name": "richard rapoza", "sentiment": "none"}, {"name": "rapoza", "sentiment": "none"}], "locations": [{"name": "hawaii", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "hawaii emergency management agency", "sentiment": "none"}, {"name": "federal communications commission", "sentiment": "none"}, {"name": "jolyn rosa 4 min read  honolulu", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 12:56 AM / Updated 15 hours ago Hawaii says lack of adequate fail-safe measures led to false missile alert Jolyn Rosa 5 Min Read \nHONOLULU (Reuters) - Human error and a lack of adequate fail-safe measures during a civil defense warning drill led to the false missile alert that stirred panic across Hawaii over the weekend, a state emergency management agency spokesman acknowledged on Sunday. \nElaborating on the origins of Saturday’s false alarm, which went uncorrected for nearly 40 minutes, spokesman Richard Rapoza said the employee who mistakenly sent the missile alert “has been temporarily reassigned” to other duties. \nRapoza said an internal investigation of the blunder would be completed by week’s end and that the Hawaii Emergency Management Agency welcomed outside review by the Federal Communications Commission, which has jurisdiction over wireless U.S. alert systems. \nRapoza also said that no further drills of the emergency alert system would be conducted until new measures were put in place to reduce the chance of future false alarms and to swiftly withdraw any warnings sent in error. \nFCC Chairman Ajit Pai said on Sunday that the agency’s probe of the incident so far suggested “reasonable safeguards or process controls” were lacking, a point that Rapoza said officials at the Hawaii Emergency Management Agency did not dispute. \nThe error occurred when, in the midst of a drill during a shift change at the agency, an employee made the wrong selection from a “drop-down” computer menu, choosing to activate a missile launch warning instead of the option for generating an internal test alert, Rapoza said. \nThe employee, believing the correct selection had been made, then went ahead and clicked “yes” when the system’s computer prompt asked whether to proceed, Rapoza said. \nGovernor David Ige initially said on Saturday that “an employee pushed the wrong button.” \nThe resulting message, issued amid heightened international strains over North Korea’s development of ballistic nuclear weapons, stated: “EMERGENCY ALERT BALLISTIC MISSILE THREAT INBOUND TO HAWAII. SEEK IMMEDIATE SHELTER. THIS IS NOT A DRILL.” \n‘NOT MAKING ANY EXCUSES’ \nIt was transmitted to mobile phones and broadcast on television and radio across the Pacific island state shortly after 8 a.m. on Saturday, and took 38 minutes to be retracted by an official all-clear message. An electronic sign reads \"There is no threat\" in Oahu, Hawaii, U.S., after a false emergency alert that said a ballistic missile was headed for Hawaii, in this January 13, 2018 photo obtained from social media. Instagram/@sighpoutshrug/via REUTERS \nThe mistake unleashed hysteria and confusion across the state, home to some 1.4 million people and a heavy concentration of U.S. military command structure. \nCivil defense officials have said that in the event of a real missile attack from North Korea, people in Hawaii would have only about 12 minutes to find shelter. \nIn November, Hawaii said it would resume monthly statewide testing of Cold War-era nuclear attack warning sirens for the first time in at least a quarter of a century, in preparation for a possible missile strike from North Korea. \nIge, who said he was “angry and disappointed” by Saturday’s incident, said some sirens went off after the false alarm. \nTo prevent a repeat, the Emergency Management Agency will now require two employees to activate the alert system - one to issue the warning and another to confirm it. The agency also has incorporated a way of issuing an immediate false-alarm notice in the event of an error. \n“That’s something we were lacking yesterday,” Rapoza told Reuters by telephone. “Our focus was on getting the message out quickly, and not enough attention was paid to what happens if there’s a mistake. And frankly, that was a failure of planning on our part. We’re not making any excuses for it.” \nU.S. President Donald Trump weighed in on Sunday during a visit to Florida and gave Hawaii state officials credit for admitting their mistake, saying: “I loved that they took responsibility.” \nHe added: “But we’re going to get involved,” an apparent reference to the FCC’s review of the incident. \nTrump, whose public war of words with North Korean leader Kim Jong Un, including a tweet boasting that he had a “much bigger” nuclear button than Kim, has widely been seen as stoking tensions, added: “But maybe eventually we’ll solve the problem” so people in Hawaii “don’t have to be so on edge.” \nCriticism of the state emergency management agency from other quarters was swift. \nLee Cataluna, a columnist for the state’s largest newspaper, the Honolulu Star-Advertiser, wrote in an opinion piece published on Sunday: “It’s the time for outrage. Somebody needs to get fired.” Additional reporting by Steve Gorman in Los Angeles, David Shephardson in Detroit and Steve Holland in West Palm Beach, Fla.; Writing by Steve Gorman; Editing by Peter Cooney", "external_links": [], "published": "2018-01-15T02:55:00.000+02:00", "crawled": "2018-01-15T03:08:05.000+02:00", "highlightTitle": ""}