{"organizations": [], "uuid": "418462ff09cb54f4eda76144011b2efc5ac9e8db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/02/104506176-GettyImages-130184285.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/massive-uncertainty-from-brexit-sees-uk-firms-falling-behind-their-european-peers-hays-cfo-says.html", "country": "US", "domain_rank": 767, "title": "'Massive uncertainty' from Brexit sees UK firms falling behind their European peers, Hays CFO says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.078, "site_type": "news", "published": "2018-01-11T16:35:00.000+02:00", "replies_count": 0, "uuid": "418462ff09cb54f4eda76144011b2efc5ac9e8db"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/11/massive-uncertainty-from-brexit-sees-uk-firms-falling-behind-their-european-peers-hays-cfo-says.html", "ord_in_thread": 0, "title": "'Massive uncertainty' from Brexit sees UK firms falling behind their European peers, Hays CFO says", "locations": [], "entities": {"persons": [{"name": "hays", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "paul venables.the", "sentiment": "none"}, {"name": "paul venables", "sentiment": "none"}, {"name": "venables", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit 'Massive uncertainty' from Brexit sees UK firms falling behind their European peers, Hays CFO says As Britain prepares to leave the EU next year, businesses based in the U.K. were seen to be struggling to attract investment, according to Hays's Paul Venables \"Universally, Europe is as strong as I've seen it since I joined (Hays) in 2006 and I have been through all of the cycles across the last 12 years,\" Venables told CNBC on Thursday Britain and the EU will soon begin efforts to try to define their future trading relationship after officials from both sides settled the broad terms of their divorce settlement in December 11 Hours Ago | 03:04 \nU.K. businesses continue to lag behind their European peers ahead of Britain's upcoming departure from the European Union (EU), according to the CFO of the U.K.'s biggest recruitment firm. \nAs Britain prepares to leave the EU next year, businesses based in the U.K. were seen to be struggling to attract investment, according to Hays 's Paul Venables.The chief financial officer said that while continental Europe's investment projects had increased by 17 percent in 2017, investment in British-based businesses was found to have been broadly flat over the same period. \n\"Universally, Europe is as strong as I've seen it since I joined (Hays) in 2006 and I have been through all of the cycles across the last 12 years,\" Venables told CNBC on Thursday. \nBritain and the EU will soon begin efforts to try to define their future trading relationship after officials from both sides settled the broad terms of their divorce settlement in December.Nonetheless, an impasse regarding Britain's access to the single market for London's substantial financial services industry is threatening to be one of the key Brexit battlegrounds before the U.K. is due to leave the bloc in March 2019. The EU's single market allows the free movement of goods, people, capital and services between EU nations. Simon Dawson | Bloomberg | Getty Images \n\"Unless you have got to invest, why would you invest (in Britain) now?\" Venables said. \nHe argued that companies from all over the world were \"much more likely\" to delay investments into the U.K. as a result of the \"massive uncertainty\" created by Brexit. 'Odd one out' \nGrowth in the U.S. and the euro zone — the U.K.'s major trading partners — is forecast to accelerate over the next few years to \"well above\" the averages of recent years, Kallum Pickering, senior U.K. economist at Berenberg Bank, said in a research note published Thursday. \nPickering said that while the U.S. and Europe were well-positioned to fully enjoy the tailwind from the synchronized global upswing in economic growth, the uncertainty from Brexit would likely leave Britain as the \"odd one out.\" Sam Meredith Digital Reporter, CNBC.com Playing", "external_links": [], "published": "2018-01-11T16:35:00.000+02:00", "crawled": "2018-01-11T16:36:15.016+02:00", "highlightTitle": ""}