{"organizations": [], "uuid": "e42b98786e49c197cfcdc266a245aba0e569c24b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-dnb-group-ceo-rune-bjerke-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with DNB Group CEO, Rune Bjerke from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-26T08:00:00.000+02:00", "replies_count": 0, "uuid": "e42b98786e49c197cfcdc266a245aba0e569c24b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-dnb-group-ceo-rune-bjerke-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with DNB Group CEO, Rune Bjerke from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "steve sedgwi", "sentiment": "negative"}, {"name": "rune bjerke", "sentiment": "negative"}, {"name": "geoff cutmore", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "dnb group", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "riksbank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with DNB Group CEO, Rune Bjerke and CNBC's Steve Sedgwick and Geoff Cutmore from the World Economic Forum 2018.\nSS: Rune Bjerke has joined us, who is the CEO of DNB Group. Look, I'm sorry to drag you in to my-, my-, my ruminations, but it does seem to me that central bankers, they want volatility when they want it, and other times they don't like it, because of the direction of travel.\nRB: That's-, that's true, central bankers, they like it very stable, and they like it to go in the direction they aim for, and that's, most often, the positive way.\nSS: Are the Norwegians worried about what the ECB is doing at the moment? Because the Swiss I've been speaking to have been very worried about it, and the Riksbank clearly is very worried about it. Everyone not in the Eurozone must be terrified, the fact that this goes on and on and on.\nRB: We are a little bit less dependent on the European Central Bank, due to the fact that we are producing oil and gas-,\nSS: Yes.\nRB: And we have a dependency on the dollar. So, we are in the middle, to put it that way.\nSS: Yes, so-, okay, so, net-net then, with the dollar trading multiyear lows, around about 89 on the Dollar Index, as well, and the euro at 1.25, and the oil price at $71, the Norwegians have got to be happy, yes?\nRB: It's significantly better now, than 12 months back in time, that's true.\nGC: Mm.\nSS: In terms of the issues that gives, for a bank your size, I mean, you are the largest bank in Norway, as well, what opportunities or challenges does that present?\nRB: For a bank in Norway, it's very much about digitalization-,\nSS: Right.\nRB: Because we have a very sophisticated public infrastructure, and we are in the forefront when it comes to new services, and also how we treat our clients. You can, for example, apply for a mortgage, we can process it within two minutes, and it's not touched by any humans, and you get the mortgage disbursed.\nSS: Just a quick question on that. I am sick of mortgage arrangement fees in the United Kingdom, it's a disgusting add-on, which, actually, I think it's all being done by computers, anyway, and algorithms, and everything. Do you charge horrendous mortgage arrangement fees, if the computer's doing all the work?\nRB: No, we don't.\nSS: Mm.\nRB: It's very tough competition in Norway, and it's competitive prices, even when it comes to fees.\nSS: I can only look on in envy, sir. Geoffrey?\nGC: Yes, I just wanted to-, to come on to the-, well, or just take that technology point forward here. It was very interesting on my panel, that I think you sat in on, yesterday, that the professor from the LSE was making a point about how the western financial community is just not waking up to China arriving on the banking scene in force. You, I think, are more aware of that, because you have looked at what Tencent is doing-,\nRB: Mm.\nGC: And you have your own mobile payments app now.\nRB: That-,\nGC: Just share some thoughts about that? Do you agree with that analysis?\nRB: It's a very valid point. I mean, I took the management group, and we went to Silicon Valley. The year after, we went to China, and we were amazed on how the Chinese had actually developed sophisticated technology to build ecosystems for all kinds of financial services. And we didn't understand, why isn't this spread out in Europe? And we have really good conditions in Norway, Sweden and Denmark, so I think we are catching up with the Chinese, and we will definitely do more on the digital scene.\nGC: Is the problem that we're still fighting the battle of the global financial crisis in Europe, rather than actually focusing on the next crisis, which could be that the Chinese just come and eat our lunch?\nRB: We are so conservative when it comes to distribution within banking. I mean, in any European country, you see way to many branches. In our bank, in DNB, we closed down 50% of the branches within 18 months, and still, we managed to increase the mortgage volumes. So, the young generations today, they do not ask for branches. They ask for sophisticated digital services.\nSS: But-, but, Rune, well, I mean, just give me an example of-, well, I mean, I haven't been in a branch for years, I mean, I did-, I do all my banking either on the phone, if I have to, but mostly through the computer-,\nRB: Yes.\nSS: Or-, or apps. So, what is it that Tencent, and the Chinese, are doing, that you're not doing, for instance? What's the best in class in Europe not doing still?\nRB: I mean, if you look at the Chinese, they have included other services in their apps.\nSS: Such as?\nRB: Such as, you can do your grocery shops, you can order from restaurants, you can even give feedback, after a job interview you've had, on-, on the app. So, you-, you simply build a full ecosystem-,\nSS: But why should that be in my banking app, though? Why can't that be in my-, well, I mean-, in my-, in my Tescos, or my Sainsbury's app, or-,\nRB: It could be Facebook. I mean, if we look at-, at the competitors out there-,\nSS: Mm.\nRB: We look at Facebook, Google-,\nSS: Yes.\nRB: And Amazon as the potential competitors going forward. It's not only the other banks, it's small fintech companies, and the global giants-,\nSS: Sure.\nRB: So, definitely, you will see Facebook, and others, trying to copy what the Chinese already have done.\nGC: I mean, this is-, to-, to-, not to put a fine a point on it, I mean, this is actually a competition for survival, isn't it? For the European banking sector?\nRB: Absolutely. You need to develop your value chain. You need to enter in to new businesses, and you need to build upon the components you have. So, I try to say to my communication department, 'You are not a communication department. You are a media company.'\nSS: What-, what does it mean for jobs? Because, I mean, Norway's at the front of this. It seems to me, no branches, computers and algorithms working out my creditworthiness, you don't need any employees.\nRB: So, that's why I am telling the employees, all the time, that if we manage to change more rapidly than our competitors, if we manage to build up new services, more frequent, and more fast than our competitors, then we have good job opportunities. If not, it will not look good going forward. On the other hand, we have so many new tasks being put on the banks, like compliance, you have AML, and you have GDPR, and a lot of other stuff, and you need manpower to handle that, at least in the transition period.\nGC: And just on the-, the broader issue that's come up a lot here, about how bankers feel about excesses in markets, and bubbles, share with us your view. Does this feel like 2006 all over again? Or have you got a different perspective?\nRB: It's very, very strange to be here. You hear so many positive views about the financial, and economical future. On the other hand, so many people are talking about a potential crack, and a potential bubble. So, I-, I try to say to my colleagues, back home in Norway, that it looks very good, and that's why we should prepare for other times, because it's what you do not know that is really frightening.\nGC: It's been a pleasure catching up with you, thanks so much for coming and seeing us here. Rune Bjerke, the CEO of DNB Group.\nENDS", "external_links": [], "published": "2018-01-26T08:00:00.000+02:00", "crawled": "2018-01-26T17:57:18.002+02:00", "highlightTitle": ""}