{"organizations": [], "uuid": "323b1bf036e6e8a0695800b592450d3ce5a0394a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-abattis-enters-into-definitive-agreement-to-acquire-green-tree-therapeutics.html", "country": "US", "domain_rank": 767, "title": "Abattis Enters Into Definitive Agreement to Acquire Green Tree Therapeutics", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.583, "site_type": "news", "published": "2018-01-11T16:28:00.000+02:00", "replies_count": 0, "uuid": "323b1bf036e6e8a0695800b592450d3ce5a0394a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-abattis-enters-into-definitive-agreement-to-acquire-green-tree-therapeutics.html", "ord_in_thread": 0, "title": "Abattis Enters Into Definitive Agreement to Acquire Green Tree Therapeutics", "locations": [], "entities": {"persons": [{"name": "rob abenante", "sentiment": "none"}, {"name": "abattis", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "abattis bioceuticals corp.", "sentiment": "negative"}, {"name": "green tree therapeutics corporation", "sentiment": "none"}, {"name": "vergence naturals ltd.", "sentiment": "none"}, {"name": "abattis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, British Columbia, Jan. 11, 2018 (GLOBE NEWSWIRE) -- Abattis Bioceuticals Corp. (the \"Company\" or \"Abattis\") (CSE:ATT) (OTC:ATTBF) is pleased to announce that, further to its news releases dated December 22, 2017, it has entered into a definitive agreement (the “Definitive Agreement”) to acquire (the “Acquisition”) Green Tree Therapeutics Corporation (“GTT”, “Green Tree” or “GT Therapeutics Corporation”).\nGTT’s brands are currently sold in a wide variety of brick and mortar locations across North America, including wholesale channels. The Green Tree acquisition will bring Abattis 10 unique branded SKUs and a series of marketing, licensing, and technology rights. Upon closing of the Acquisition, products within the Green Tree brand will made available through Abattis’s wholly-owned subsidiary Vergence Naturals Ltd. (“Vergence”).\n“Abattis has always seen Green Tree as a perfect fit to merge with existing products within our marketing wing in Vergence,” stated Rob Abenante, President and CEO of Abattis. “Acquiring GTT will complement our retail offerings through Vergence and provide a solid entry point into the vaporizers market.”\nMoving forward within Abattis, Green Tree will continue to be engaged in expanding its product offerings for alternate cannabis products, including capsules, and lotions.\n“The key to this deal is our gained access to retail through integrating GTT’s products, including the Green Tree brand of vaporizers, which are renowned for their ability to deliver the therapeutic benefits of CBD and THC extracts,” added Mr. Abenante. “In addition, Abattis is pleased to take on GTT’s sales and marketing staff that are trained with valuable cannabis knowledge and ancillary products.”\nConsidering the state of the capital markets and, in particular, the strength of the equity markets for cannabis companies, the parties decided to re-negotiate the terms of the Acquisition as previously disclosed. Accordingly, the parties have agreed that, pursuant to the Definitive Agreement, Abattis will issue an aggregate of 15,000,000 common shares of the Company (each, a “Share”) to the former shareholders of Green Tree. In addition, in exchange for the right to acquire Green Tree, which right was previously held by Winston Resources Inc. (“Winston”), Abattis will also issue 15,000,000 Shares to Winston upon closing of the Acquisition.\nNone of the securities issued pursuant to the Acquisition have been or will be registered under the United States Securities Act of 1933, or any state securities laws, and any securities issued pursuant to the Acquisition are anticipated to be issued in reliance upon available exemptions from such registration requirements and applicable exemptions under state securities laws. This news release does not constitute an offer to sell, or a solicitation of an offer to buy, any of the securities in the United States.\nAbout Abattis Bioceuticals Corp.\nAbattis is a life sciences and biotechnology company which aggregates, integrates, and invests in cannabis technologies and biotechnology services for the legal cannabis industry developing in Canada. The Company has successfully developed and licensed natural health products, medicines, extractions, and ingredients for the biologics, nutraceutical, bioceutical, and cosmetic markets. The Company is also seeking to acquire exclusive intellectual property rights to agricultural technologies to be employed in extraction and processing of botanical ingredients and compounds. The Company follows strict standard operating protocols, and adheres to the applicable laws of Canada and foreign jurisdictions. Further information can be found on Abattis’s website at www.abattis.com.\nAbout Vergence Naturals Ltd.\nVergence Naturals™ is a wholly-owned subsidiary of Abattis, based in Vancouver, B.C., Canada. The Vergence team are bioceutical marketing specialists focused on health products to penetrate the fast-growing market for natural, safe and effective natural products that meet unmet wellness needs. Further information can be found on Vergence’s website at www.vergencenaturals.com/.\nAbout Green Tree Therapeutics\nGTT owns a brand of vaporizers currently sold in a wide variety of brick and mortar locations, including medical and adult use dispensaries across North America, and it is also engaged in the expansion of its product offerings for alternate cannabis products, including capsules, oils, and lotions. GTT’s vaporizers are believed to provide therapeutic benefits through the delivery of beneficial CBD and THC extracts, and a system for rapid absorption for the quick delivery of cannabinoids. Further information can be found on GTT’s website at www.greentreetherapeutics.com.\nON BEHALF OF THE BOARD,\nABATTIS BIOCEUTICALS CORP,\n“Rob Abenante\"\nRobert Abenante, President & CEO\nFor more information, please visit the Company's website at: www.abattis.com or www.northernvinelabs.com\nFor inquiries, please contact the Company at (604) 674-8232 or at news@abattis.com.\nFORWARD LOOKING INFORMATION\nThis press release contains forward-looking statements. The use of any of the words \"anticipate\", \"continue\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", “intends”, \"should\", \"believe\" and similar expressions are intended to identify forward-looking statements. Forward-looking statements in this press release include statements regarding: the Acquisition, including as to the terms and expected benefits thereof; that the Acquisition will complement the Company’s retail offerings and provide a solid entry point into the vaporizers market; the expected integration of the Green Tree product line under Vergence and the Green Tree sales and marketing stuff under Abattis; and the expansion of Green Tree’s future product offerings. Although the Company believes that the expectations and assumptions on which the forward-looking statements are based are reasonable, undue reliance should not be placed on the forward-looking statements because the Company can give no assurance that they will prove to be correct. Since forward-looking statements address future events and conditions, by their very nature they involve inherent risks and uncertainties, including: that the Acquisition will not complete as contemplated or at all; that the expected benefits of the Acquisition will not be realized; that the Acquisition will not complement the Company’s retail offerings or provide a solid entry point into the vaporizers market; that Green Tree will not be integrated under Vergence as contemplated or at all; that Green Tree’s staff will not be integrated under Abattis as contemplated or at all; that Green Tree will not expand its future product offerings; that the Company will not be able to execute its proposed business plan in the time required or at all due to regulatory, financial or other issues; that the Company’s competitors may develop competing technologies; changes in regulatory requirements; and other factors beyond the Company’s control. Additional risk factors are included in the Company's Management's Discussion and Analysis, available under the Company's profile on www.sedar.com . The forward-looking statements are made as at the date hereof and the Company disclaims any intent or obligation to publicly update any forward-looking statements, where because of new information, future events or results, or otherwise, except as required by applicable securities laws.\nSource:Abattis Bioceuticals Corp.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/503a215a-6880-46e3-b00a-a2cfa9bb5765"], "published": "2018-01-11T16:28:00.000+02:00", "crawled": "2018-01-11T19:35:54.034+02:00", "highlightTitle": ""}