{"organizations": [], "uuid": "eb3c89dfa435571aff7deda73186a45238696c23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226913919&w=1200&r=LYNXMPEE0U0OW", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/alibaba-strategy-seniors/silver-lining-alibaba-lures-older-shoppers-as-market-slows-idINKBN1FK1BR", "country": "US", "domain_rank": 408, "title": "Silver (haired) lining? Alibaba lures older shoppers as market slows", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T13:02:00.000+02:00", "replies_count": 0, "uuid": "eb3c89dfa435571aff7deda73186a45238696c23"}, "author": "", "url": "https://in.reuters.com/article/alibaba-strategy-seniors/silver-lining-alibaba-lures-older-shoppers-as-market-slows-idINKBN1FK1BR", "ord_in_thread": 0, "title": "Silver (haired) lining? Alibaba lures older shoppers as market slows", "locations": [], "entities": {"persons": [{"name": "xiang", "sentiment": "none"}, {"name": "benjamin cavender", "sentiment": "none"}, {"name": "cate cadell", "sentiment": "none"}, {"name": "xiang jiang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "taobao", "sentiment": "none"}], "organizations": [{"name": "alibaba", "sentiment": "negative"}, {"name": "alibaba group holding ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  beijing", "sentiment": "none"}, {"name": "communist party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - Online shopping may not be the typical domain of the elderly, but when it comes to buying groceries with a smartphone, Xiang Jiang, 70, considers herself rather savvy.\nBorn a year before the Communist Party took control of China in 1949, Xiang has never had a bank account but she now has a wallet app that allows her to pay for items using her smartphone.\nXiang is part of an older generation in China that e-commerce giant Alibaba Group Holding Ltd is looking to tap as broader growth in online retail revenues slow. Xiang uses Alibaba’s Alipay online payment system on her phone.\nThe company on Wednesday announced the launch of an “elderly friendly” version of its shopping app Taobao after causing an online stir this month by posting job adverts for candidates over 60 to act as consultants to promote the app and provide feedback.\n“The big motivator here is that their revenue growth is slowing,” said Benjamin Cavender, Shanghai-based principal at China Market Research Group.\n“It’s easier now than it was in the past to get some of these older users to actually open up their wallets and spend.”\nTrying to appeal to the elderly fits in with Alibaba’s $10 billion-plus spending spree to raise its presence in brick-and-mortar stores, which are frequented more often by older shoppers.\nXiang, for example, shops at Hema Supermarket, a concept store launched by Alibaba that only accepts payments by mobile phone.\nTo check out, staff help Xiang scan a barcode on her smartphone at the counter and the payment is made automatically.\n“My children think I‘m too dull to shop online, so they do it for me” says Xiang. “But shopping with my phone (in the supermarket) is easy. I can pick for myself.”\nAlibaba’s marketing drive to attract more elderly shoppers comes as the revenue growth of the company, which has roared to a stock market valuation of more than $500 billion in just a few years, is slowing down.\nThe company’s third-quarter earnings, to be reported Thursday, are expected to show revenues for the period of close to 80 billion yuan ($12.7 billion). That would be a rise of almost 50 percent from a year earlier, but would still be the slowest growth since the fourth-quarter of 2015.\nSQUARE DANCING China’s young, smartphone-savvy urbanites are the big drivers of Alibaba and its main rival JD.com Inc.\nMostly young, urban users between the age of 18 and 34 fuelled a $25 billion binge on Alibaba’s during its 2017 Singles’ Day online sales event in November.\nBut the older generation’s purchasing power is rising.\nChina’s roughly 230 million people over the age of 60 make up more than 16 percent of the population and by the middle of the century that will rise to around a third.\nAlibaba’s app aimed at the older generation is much simpler than its mainstream app. It has a larger interface and can be linked to a relative’s account so that children, for example, can view and pay for their elderly parent’s products.\nConvincing older shoppers to spend with the same gusto as their younger peers may not be easy though and their presence on Taobao is relatively small anyhow. Currently, only 6 million of Taobao’s 468 million users are between the ages of 60 and 69.\nBut Alibaba hopes elderly consultants will help draw more of the older generation to the platform as its recent eye-catching online advertisement showed.\n“Square dancing” key opinion leaders are strongly preferred for the role, the ad read, referring to the Chinese exercise phenomenon that draws crowds of elderly dancers to local parks.\nXiang says the motivation for her to go digital was clear – her closest grocery store does not accept cash.\n“I‘m gradually practicing (using the payment app) because it’s the trend,” said Xiang. “If you don’t practice like this, you won’t be able to live in the future.”\nReporting by Cate Cadell; Editing by Neil Fullick\n ", "external_links": [], "published": "2018-01-31T13:02:00.000+02:00", "crawled": "2018-01-31T13:34:23.004+02:00", "highlightTitle": ""}