{"organizations": [], "uuid": "df1ab0227a6dadf0bf3f509b59b25defb14524ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222748459&w=1200&r=LYNXMPEE0G11Q", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-tiffany-outlook/tiffanys-americas-holiday-same-store-sales-up-6-percent-raises-fy-forecasts-idUSKBN1F61IE", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Tiffany's holiday season sales sparkle, lifts profit view", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T18:16:00.000+02:00", "replies_count": 0, "uuid": "df1ab0227a6dadf0bf3f509b59b25defb14524ec"}, "author": "", "url": "https://www.reuters.com/article/us-tiffany-outlook/tiffanys-americas-holiday-same-store-sales-up-6-percent-raises-fy-forecasts-idUSKBN1F61IE", "ord_in_thread": 0, "title": "UPDATE 2-Tiffany's holiday season sales sparkle, lifts profit view", "locations": [], "entities": {"persons": [{"name": "alessandro bogliolo", "sentiment": "none"}, {"name": "bogliolo", "sentiment": "none"}], "locations": [{"name": "americas", "sentiment": "none"}], "organizations": [{"name": "tiffany", "sentiment": "negative"}, {"name": "tiffany & co", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Tiffany & Co ( TIF.N ) posted strong same-store sales on Wednesday for the holiday period, putting it on track for its first quarterly increase in more than two years and prompting a rise in its full-year profit forecast.\nChief Executive Alessandro Bogliolo cautioned that the upscale jewelry chain still needed to invest more in its business to sustain the boost from what so far seems to have been a buoyant Christmas for retailers.\nShares of the company rose as much as 2.2 percent to a more than three-year high in morning trade.\n“We were pleased with the improvement in sales during the holiday period across regions and categories, both instore and online,” Bogliolo said.\n“However ... we believe that the preceding negative comparable store sales trend can only be reversed on a sustainable basis... by stepping up certain strategic spending in our business.”\nDuring November and December, same-store sales rose 6 percent in the Americas, as customers spent more on fine jewelry, solitaires and cheaper fashion items, Tiffany said.\nThat helped boost overall same-store sales, with some of that growth from customers in China, Hong Kong and Korea.\nTiffany, known for its diamond engagement rings and robin’s egg blue boxes, has been diversifying what it sells following a slump in comparable sales that dates back to the third quarter of fiscal 2015.\nIt started offering cheaper silver jewelry to price-conscious millennials as well as everyday home items such as paper clips, pocket diaries, mirrors and wine openers to reach more consumers especially in emerging markets, such as China.\nWorldwide same-store sales rose 5 percent in November and December, while overall sales increased 8 percent to $1.05 billion, the company said in a statement.\n“Tiffany turned in its strongest sales and earnings results in several years with strength across Europe, Asia-Pacifc and the Americas as well across sales categories,” founder of research firm Retail Metrics, Ken Perkins, told Reuters.\nTiffany raised its full-year 2017 forecast, now expecting adjusted earnings to rise in the high-single digit percentage range from its prior forecast of a mid-single digit rise.\nIt also said worldwide sales would increase 4 percent, or about $4.16 billion, for the year ending Jan. 31, beating the $4.11 billion analysts on an average were expecting.\nThe 2017 outlook does not include the $115 million-$165 million charge it expects to take in the fourth quarter for a reassessment of deferred tax assets and tax on foreign earnings to be repatriated as part of the new U.S. tax code.\nEarnings for fiscal 2018 would be flat to slightly down from estimated 2017 profits, the company said, as steps up investments in technology, marketing communications, visual merchandising, digital, and store presentations.\nReporting by Karina Dsouza and Vibhuti Sharma in Bengaluru; Editing by Arun Koyyur\n ", "external_links": [], "published": "2018-01-17T18:16:00.000+02:00", "crawled": "2018-01-17T18:38:13.000+02:00", "highlightTitle": ""}