{"organizations": [], "uuid": "e58fc635a0745cac63bd8281bfea2295df43ee8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-broward-health-expands-compliance-program-names-nicholas-hartfield-vice-president-chief-compliance-and-privacy-officer.html", "country": "US", "domain_rank": 767, "title": "Broward Health Expands Compliance Program; Names Nicholas Hartfield Vice President, Chief Compliance and Privacy Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-12T21:14:00.000+02:00", "replies_count": 0, "uuid": "e58fc635a0745cac63bd8281bfea2295df43ee8e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-broward-health-expands-compliance-program-names-nicholas-hartfield-vice-president-chief-compliance-and-privacy-officer.html", "ord_in_thread": 0, "title": "Broward Health Expands Compliance Program; Names Nicholas Hartfield Vice President, Chief Compliance and Privacy Officer", "locations": [], "entities": {"persons": [{"name": "nicholas hartfield", "sentiment": "negative"}, {"name": "beverly capasso", "sentiment": "none"}, {"name": "hartfield", "sentiment": "none"}, {"name": "nick hatfield", "sentiment": "none"}, {"name": "browa", "sentiment": "none"}, {"name": "capasso", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "fort lauderdale", "sentiment": "none"}, {"name": "broward health", "sentiment": "none"}], "organizations": [{"name": "broward health", "sentiment": "negative"}, {"name": "broward health expands compliance program", "sentiment": "negative"}, {"name": "board of commissioners of the north broward hospital district", "sentiment": "none"}, {"name": "broward health interim", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT LAUDERDALE, Fla.--(BUSINESS WIRE)-- Broward Health today announced the expansion of its Compliance Program and the promotion of Nicholas Hartfield to the position of Vice President, Chief Compliance and Privacy Officer. The announcement was made by Beverly Capasso, Broward Health Interim President/CEO, who said Hartfield will report directly to the Board of Commissioners of the North Broward Hospital District, which operates as Broward Health.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180112005544/en/\nNicholas Hartfield, Vice President, Chief Compliance and Privacy Officer (Photo: Business Wire)\n“Nick Hatfield is focused on enhancing every aspect of compliance, including contracting, patient care and confidentiality, billing and payments, written standards, training and corrective action,” Capasso said. “Since he came on board in October of 2015, he has worked hard to move Broward Health forward by meeting or exceeding all legal, professional and ethical compliance guidelines.”\nHartfield previously served as Broward Health’s director of focused arrangements, comprised mainly of Broward Health’s contracts with its physician providers. He also oversaw the review of all contracts as part of compliance with the Corporate Integrity Agreement. Prior to joining Broward Health, he was director of auditing, monitoring and investigations in the Office of Compliance & Ethics at Jackson Health System in Miami, Florida.\nHartfield’s experience includes the supervision and performance of audits of policies and procedures, departments, clinics, physician groups, hospitals, and vendors, as well as the supervision and performance of investigations of alleged violations of policies and procedures or local, state and federal regulations and laws.\nHartfield was also a special agent for the Jefferson Parish Office of Inspector General in Jefferson, La. His primary responsibility was performing criminal, civil, and administrative investigations of Jefferson Parish government officials, departments, agencies, special districts, and individuals or entities receiving funds from the Parish.\nHartfield was also a lead investigator with the Centers for Medicare & Medicaid Services, Zone 7 Program Integrity Contractor for the State of Florida, based in Miramar. His primary responsibility was to investigate potential fraud, waste, or abuse committed against the Medicare program in Florida. He was also a supervisor in the Special Investigations Unit for Humana, Inc., supervising 10 special investigators, four special investigator assistants, and one lead investigator who investigated potential fraud, waste, or abuse.\nHartfield graduated from Indiana University-Purdue University, Indianapolis, and received a bachelor’s degree in criminal justice. He is a certified fraud examiner through the Association of Certified Fraud Examiners and a health care anti-fraud associate through America’s Health Insurance Plans.\nAbout Broward Health\nBroward Health, providing service for more than 75 years, is a nationally recognized system in South Florida that offers world-class healthcare to all. The Broward Health system includes the statutory teaching hospital Broward Health Medical Center, Broward Health North, Broward Health Imperial Point, Broward Health Coral Springs, Salah Foundation Children’s Hospital, Broward Health Weston, Broward Health Community Health Services, Broward Health Physician Group, Broward Health Urgent Care, Broward Health International, and Broward Health Foundation. For more information, visit BrowardHealth.org .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180112005544/en/\nBroward Health\nMedia Contacts:\nDenise Moore, 954-634-2704\ndrmoore@browardhealth.org\nor\nGary Bitner, 954-849-9201\ngary@bitnergroup.com\nSource: Broward Health", "external_links": ["http://www.businesswire.com/news/home/20180112005544/en/"], "published": "2018-01-12T21:14:00.000+02:00", "crawled": "2018-01-12T20:42:40.016+02:00", "highlightTitle": ""}