{"organizations": [], "uuid": "93d10d8857be14cf47619f37d55214867247f615", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226892512&w=1200&r=LYNXMPEE0U0KO", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-france/frances-macron-warns-turkey-over-syrian-operation-le-figaro-interview-idUSKBN1FK12S", "country": "US", "domain_rank": 408, "title": "France's Macron warns Turkey over Syrian operation: Le Figaro interview", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T11:38:00.000+02:00", "replies_count": 0, "uuid": "93d10d8857be14cf47619f37d55214867247f615"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-france/frances-macron-warns-turkey-over-syrian-operation-le-figaro-interview-idUSKBN1FK12S", "ord_in_thread": 0, "title": "France's Macron warns Turkey over Syrian operation: Le Figaro interview", "locations": [], "entities": {"persons": [{"name": "john irish", "sentiment": "none"}, {"name": "richard lough", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "le figaro", "sentiment": "negative"}, {"name": "macron", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "macon", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - French President Emmanuel Macron warned Turkey that its operation against Kurdish militias in northern Syria should not become an excuse to invade the country and said he wanted Ankara to coordinate its action with its allies.\nTurkey last week launched an air and ground offensive in northwest Syria, targeting the Kurdish YPG militia in the Afrin region. That has opened a new front in the seven-year-old civil war and strained ties with Turkey’s NATO allies.\n“If it turns out that this operation takes a turn other than to fight a potential terrorist threat to the Turkish border and becomes an invasion operation, (then) this becomes a real problem for us,” Macon said in an interview with Le Figaro newspaper published on Wednesday.\nTurkey considers the YPG a terrorist organization and an extension of the outlawed Kurdistan Workers Party (PKK), which has waged a three-decade-long insurgency in Turkey’s largely Kurdish southeast.\nA Turkish soldier stands on top of a tank near the Turkish-Syrian border in Kilis province, Turkey January 31, 2018. REUTERS/Osman Orsal Turkish Prime Minister Binali Yildirim defended the operation saying it was solely aimed at securing his country’s security and protecting Arabs, Kurds and Turkmens from “terrorist organizations.”\n“If France is interpreting this issue as such (invasion operation), we need to assess what they have done in Syria accordingly,” Yildirum said at a news conference alongside Lebanese Prime Minister Saad al-Hariri in Ankara.\nSlideshow (3 Images) “This is a crooked idea from the start. The whole world knows that Turkey is not acting with an invasive mind. They should know it.”\nRelated Coverage Supplies dwindling in Syria's Afrin city hospital after attacks: director Russia says hundreds killed in Turkish operation in Syria's Afrin: Ifax Russia's Putin, Turkey's Erdogan say happy with Syria congress in Sochi The United States and France have armed and trained YPG-led militia in the fight against Islamic State in Syria.\nMacron said he would bring the issue up again with Turkish President Tayyip Erdogan and that the nature of the operation meant there should be discussions between Europeans, but also more widely among allies.\nReporting by John Irish in Paris and Ezgi Erkoyun in Ankara; Editing by Richard Lough and Peter Graff\n ", "external_links": [], "published": "2018-01-31T11:38:00.000+02:00", "crawled": "2018-01-31T11:51:09.000+02:00", "highlightTitle": ""}