{"organizations": [], "uuid": "0b98e4e960d9ab04319928825e22c1be105c3428", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-china-pollution-gas-heating/cold-comfort-chinese-city-eases-gas-rationing-as-snow-hits-idUSKBN1EU0A4", "country": "US", "domain_rank": 408, "title": "Cold comfort: Chinese city eases gas rationing as snow hits", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T05:32:00.000+02:00", "replies_count": 0, "uuid": "0b98e4e960d9ab04319928825e22c1be105c3428"}, "author": "", "url": "https://www.reuters.com/article/us-china-pollution-gas-heating/cold-comfort-chinese-city-eases-gas-rationing-as-snow-hits-idUSKBN1EU0A4", "ord_in_thread": 0, "title": "Cold comfort: Chinese city eases gas rationing as snow hits", "locations": [], "entities": {"persons": [{"name": "chen zhu", "sentiment": "none"}, {"name": "chen", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "wuhan", "sentiment": "none"}, {"name": "hubei province", "sentiment": "none"}], "organizations": [{"name": "reute", "sentiment": "negative"}, {"name": "sia energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 3:34 AM / Updated 15 hours ago Cold comfort: China's Wuhan eases gas rationing as snow hits Chen Aizhu , Meng Meng 3 Min Read \nBEIJING (Reuters) - The industrial city of Wuhan eased restrictions on gas use on Friday for residents facing freezing temperatures and heavy snow falls, as increased supplies offered some respite to China’s winter gas shortage. \nFrigid weather in northern and eastern parts of the country have stoked worries over a worsening crunch in gas supply as the government pushes millions of households and industrial plants to switch to the cleaner fuel for heating from coal. \nThe move by the central city of Wuhan to provide more gas for heating reflected improving supplies from state energy firms in recent weeks, although China’s overall shortage persisted, said Chen Zhu, managing director with Beijing-based consultancy SIA Energy. \n“The heavy snow boosted the demand for heating ... but improving supplies give the state firms more space to coordinate supplies between consumers,” said Chen. \n“This still comes at the expense of curbs to industrial firms and gas-fired power plants,” she added. \nWuhan, capital of Hubei province, will allow households to buy up to 220 cubic meters of natural gas a month, from 150 cubic meters previously, local media reported on Friday. \nThe city sits alongside the country’s two gas trunk lines, the West-to-East project that brings in fuel from Turkmenistan and Kazakhstan, and the Sichuan-East China line that carries gas from the top Chinese gas basin Sichuan. \nImproving gas supplies, due partly to record imports of both pipeline gas and tanker shipments of liquefied natural gas (LNG), have led to a 40 percent fall in domestic LNG prices over the past 10 days or so, giving some respite to industries grappling with record fuel costs. \nGas volumes from China’s largest supplier Turkmenistan have increased from late December after sliding to the lowest since December 2016 in November, according to SIA Energy’s Chen. \nState companies have also been diverting supplies from the south to north via pipeline grids, as well as turning to long-haul transport by trailers to increase supplies. \nSinopec said on Friday it has delivered its first truckload of LNG to the city of Zibo in Shandong province from its Beihai terminal in the southern province of Guangxi, some 2,000 kms (1,240 miles) away. \nThat followed a similar effort by CNOOC, which hired a convoy of 100 trucks to move LNG from its import terminals in the south to northern regions. \nChina’s weather bureau lifted a blizzard alert on Friday with fewer areas likely to face heavy snow, but it warned of a second wave of snow and sleet in parts of the country. Reporting by Chen Aizhu and Meng Meng; Editing by Joseph Radford and Richard Pullin", "external_links": [], "published": "2018-01-05T05:32:00.000+02:00", "crawled": "2018-01-05T05:52:58.000+02:00", "highlightTitle": ""}