{"organizations": [], "uuid": "0ac601762327777db36762329e3a0b09ea773f74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-caesarstone-announces-date-for-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Caesarstone Announces Date for Fourth Quarter and Full 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:30:00.000+02:00", "replies_count": 0, "uuid": "0ac601762327777db36762329e3a0b09ea773f74"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-caesarstone-announces-date-for-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Caesarstone Announces Date for Fourth Quarter and Full 2017", "locations": [], "entities": {"persons": [{"name": "raanan zilberman", "sentiment": "none"}, {"name": "yair averbuch", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}], "organizations": [{"name": "caesarstone ltd.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MP MENASHE, Israel--(BUSINESS WIRE)-- Caesarstone Ltd. (NASDAQ:CSTE), a manufacturer of high quality engineered quartz surfaces, today announced that it will release its earnings results and full year ended December 31, 2017 on Wednesday, February 7, 2018 before the market opens.\nRaanan Zilberman, the Company’s chief executive officer, and Yair Averbuch, the Company’s chief financial officer, will host a conference call on the same day at 8:30 a.m. ET to discuss the results, followed by a question and answer session for the investment community. A live webcast of the call can be accessed at ir.caesarstone.com . To access the call, dial toll-free 1-877-407-4018 or +1-201-689-8471 (international). The toll-free Israeli number is 1 80 940 6247. Upon dialing in, please request to join the Caesarstone Fourth Quarter Earnings Call.\nTo listen to a telephonic replay of the conference call, dial toll-free 1-844-512-2921 or +1-412-317-6671 (international) and enter pass code 13675687. The replay will be available beginning at 11:30 a.m. ET on Wednesday, February 7, 2018 and will last through 11:59 p.m. ET on Wednesday, February 14, 2018.\nAbout Caesarstone\nCaesarstone manufactures high quality engineered quartz surfaces, which are used in both residential and commercial buildings as countertops, vanities, wall cladding, floors and other interior surfaces. The wide variety of colors, styles, designs and textures of Caesarstone® products, along with Caesarstone's inherent characteristics such as hardness, non-porous, scratch and stain resistance and durability, provide consumers with excellent surfaces for their internal spaces which are highly competitive to granite, manufactured solid surfaces and laminate, as well as to other engineered quartz surfaces. Caesarstone's four collections of products — Classico, Supernatural, Motivo and Concetto — are available in over 50 countries around the world. For more information about the Company, please visit our website www.caesarstone.com . (CSTE-E)\nForward-Looking Statements\nInformation provided in this press release may contain statements relating to current expectations, estimates, forecasts and projections about future events that are \"forward-looking statements\" as defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements generally relate to the Company's plans, objectives and expectations for future operations, including its projected results of operations and the expected timing of expanding its manufacturing facilities. These forward-looking statements are based upon management's current estimates and projections of future results or trends. Actual results may differ materially from those projected as a result of certain risks and uncertainties. These factors include, but are not limited to: the strength of the home renovation and construction sectors; economic conditions within any of our key existing markets; actions by our competitors; changes in raw material prices, particularly polymer resins and pigments; fluctuations in currency exchange rates; the success of our expansion efforts in the United States; the operation of our U.S. plant; the outcome of silicosis claims and the claim by our former quartz processor; unpredictability of seasonal fluctuations in revenues; delays in manufacturing and other factors discussed under the heading \"Risk Factors\" in our most recent annual report on Form 20-F and other documents filed with the Securities and Exchange Commission. These forward-looking statements are made only as of the date hereof, and the Company undertakes no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006235/en/\nFor Caesarstone Ltd.\nJames Palczynski, +1 203-682-8229\nInvestor Relations\njp@icrinc.com\nSource: Caesarstone Ltd.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.caesarstone.com&esheet=51748586&newsitemid=20180124006235&lan=en-US&anchor=www.caesarstone.com&index=2&md5=3341cb138f6b139e12f8531f86bcb235", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.caesarstone.com%2F&esheet=51748586&newsitemid=20180124006235&lan=en-US&anchor=ir.caesarstone.com&index=1&md5=5e0a05a4f8481ed4dd79df15644ca4f7", "http://www.businesswire.com/news/home/20180124006235/en/"], "published": "2018-01-25T00:30:00.000+02:00", "crawled": "2018-01-25T01:47:53.007+02:00", "highlightTitle": ""}