{"organizations": [], "uuid": "f0573e2a5e9fc975249d3fc618f9f33ef08fd149", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/gm-electric/rpt-insight-gm-races-to-build-a-formula-for-profitable-electric-cars-idUSL1N1P4045", "country": "US", "domain_rank": 408, "title": "RPT-INSIGHT-GM races to build a formula for profitable electric cars", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:00:00.000+02:00", "replies_count": 0, "uuid": "f0573e2a5e9fc975249d3fc618f9f33ef08fd149"}, "author": "", "url": "https://www.reuters.com/article/gm-electric/rpt-insight-gm-races-to-build-a-formula-for-profitable-electric-cars-idUSL1N1P4045", "ord_in_thread": 0, "title": "RPT-INSIGHT-GM races to build a formula for profitable electric cars", "locations": [], "entities": {"persons": [{"name": "paul lienert", "sentiment": "none"}, {"name": "mary barra", "sentiment": "none"}, {"name": "joseph white", "sentiment": "none"}, {"name": "barra", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "general motors co", "sentiment": "none"}, {"name": "gm", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 12:00 PM / Updated 8 minutes ago RPT-INSIGHT-GM races to build a formula for profitable electric cars Reuters Staff \n(Repeats to additional customers with no changes to text) \nBy Paul Lienert and Joseph White \nDETROIT, Jan 9 (Reuters) - General Motors Co Chief Executive Mary Barra has made a bold promise to investors that the Detroit automaker will make money selling electric cars by 2021. \nWhat Barra has not explained in detail is how GM intends to do what, so far, no major automaker has done. \nThe answer is a big bet on combining proprietary battery technology, a low-cost, flexible vehicle design and high-volume production mainly in China, according to six current and former GM and supplier executives and six industry experts interviewed by Reuters. \nIf GM can meet Barra’s ambitious profitability target, then it will house two different businesses by the mid-2020s: A traditional focus in North America on trucks, sport utility vehicles and cars fueled with petroleum, and a global electric car company centered in China, branching into pay-per-use services such as robotaxis. \nBarra’s promise to turn a profit is a bold claim in a market segment that has been driven more by government policy than consumer demand, and where Tesla Inc - the world’s largest electric-vehicle manufacturer - is burning through more than $1 billion in cash each quarter selling premium-priced vehicles. \nBarra and GM have invested heavily in the electrification strategy, and worked during the past year to persuade investors that GM can compete with Tesla by building on the success of the automaker’s latest electric vehicle, the Chevrolet Bolt EV, and cutting costs along the way. \nA key element of the plan, according to two people familiar with the company’s strategy, is slashing the amount of cobalt in GM’s new EMC 1.0 battery system. The price of cobalt – the single most costly ingredient in current lithium-ion battery cells - has soared in the past two years in expectation of a surge in demand from automakers. Cobalt prices hit a record high this month on the London Metal Exchange. \nGM’s new battery design increases the amount of nickel, which enables batteries to store and produce more energy, these people told Reuters. \nGM engineers are also working on other design and technological advances, according to executives and company patent filings, including more efficient packaging of batteries in vehicles and improved systems for managing energy flow and cooling the battery cells. \nWithout providing details, GM has said it expects these changes to cut the cost of battery cells by more than 30 percent, from $145 per kilowatt-hour to less than $100 by 2021. \nBattery experts said the full cost of a GM battery pack, such as the one used now in the Bolt EV, is $10,000-$12,000, or nearly one-third of the car’s $36,000 sticker price. \nBy 2021, however, that price could drop to $6,000, according to consultant Jon Bereisa, a former GM engineering director who helped develop the Chevrolet Volt hybrid and spearheaded much of the automaker’s early lithium-ion battery development. \nWith improvements in battery chemistry and packaging, Bereisa said, the next-generation Bolt “could deliver a 45-percent increase in range for about the same (battery) pack cost, or the same range at 45 percent less pack cost.” \nPam Fletcher, vice president in charge of GM’s global electric vehicle programs, and other GM executives would not comment on specifics of the new battery system, which is slated to be introduced in 2020-2021. \nTo be sure, electric vehicles account for only a small fraction of global auto sales. Like other manufacturers, GM is banking not only on reducing its own costs and improving vehicle performance, but also on increased demand driven by higher government-mandated electric vehicle quotas in China that are intended to help reduce pollution and the country’s dependence on petroleum. \nIn addition to improving battery and vehicle design and performance, GM is working with Chinese partner SAIC to reduce the cost of assembling electric cars. Sources said GM and SAIC are designing dedicated electric vehicle factories in China that are far smaller, less complex and more efficient than a conventional car plant. \nBARRA‘S BOLD CLAIM \nGM has more capital for electric vehicle development because of Barra’s decisions to sell money-losing European operations, exit other unprofitable markets and invest in a new generation of highly profitable, petroleum-fueled large pickup trucks, launching later in 2018. \nThe automaker now has more than 1,700 engineers, designers and researchers working on batteries and electric vehicles, many of them at the GM Technical Center in Warren, Michigan, where the company opened a dedicated battery research center in 2009, a week after it filed for bankruptcy reorganization. \nAutomotive experts say GM’s battery and EV group is one of the largest in the world, rivaled only by Toyota Motor Corp in Japan and Daimler AG in Germany. \nToyota has patented more battery technology in recent years than GM, although its focus has been mainly the Prius family of hybrid gasoline-electric vehicles, rather than on pure battery-powered cars like GM’s Bolt EV. \nGM was issued 661 U.S. patents on battery technology from 2010 through 2015, the latest that such data is available from the United States Patent and Trademark Office, trailing only Toyota’s 762 battery patents among global automakers. \nFor a graphic, click tmsnrt.rs/2CHPWnx \nIn addition to the battery work, GM engineers are developing a new dedicated “plug and play” structure for its next-generation electric vehicles that is flexible and modular, meaning it will be able to accommodate battery systems of different sizes, as well as hydrogen fuel cells, one of the sources said. \nIn an interview, Mark Reuss, head of global product development, said GM’s strategy to reduce battery cost is not tied to a single improvement such as a change in battery chemistry, but rather a series of continuous enhancements in battery technology and packaging. \n“There are no silver bullets here,” Reuss said. GM also has not solved all the problems required to achieve its goal, he said. “It’s called ‘product development’ for a reason,” he said. \nThe most recent developments and enhancements in battery technology have not been made public, according to GM’s Fletcher. \n“There’s a lot of stuff that we choose not to patent because we don’t want to make it visible” before the new technology goes into production, Fletcher told Reuters. LESSONS OF BOLT \nGM’s patent history since 2010 shows a focus on improvements in battery technology, packaging and processing, some of them designed to help boost the battery’s energy and extend vehicle range between charges, according to company filings. \nGM jointly developed its current battery know-how with Korea’s LG Group, which makes batteries and electronic components for the Bolt. Introduced in October 2016, Bolt was the first mass-produced electric vehicle to go more than 200 miles between charges, and sell at a s", "external_links": [], "published": "2018-01-09T14:00:00.000+02:00", "crawled": "2018-01-09T14:10:29.009+02:00", "highlightTitle": ""}