{"organizations": [], "uuid": "eca9a9adbf7d19dbcbf9208bf0cc5a7e80420dff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-investar-holding-corporation-announces-record-revenues-following-second-acquisition-in-2017.html", "country": "US", "domain_rank": 767, "title": "Investar Holding Corporation Announces Record Revenues Following Second Acquisition in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T03:00:00.000+02:00", "replies_count": 0, "uuid": "eca9a9adbf7d19dbcbf9208bf0cc5a7e80420dff"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-investar-holding-corporation-announces-record-revenues-following-second-acquisition-in-2017.html", "ord_in_thread": 0, "title": "Investar Holding Corporation Announces Record Revenues Following Second Acquisition in 2017", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}], "locations": [{"name": "la.", "sentiment": "none"}, {"name": "baton rouge", "sentiment": "none"}], "organizations": [{"name": "investar holding corporation", "sentiment": "negative"}, {"name": "investar holding corporation announces record revenues following second acquisition", "sentiment": "negative"}, {"name": "investar bank", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BATON ROUGE, La., Jan. 25, 2018 (GLOBE NEWSWIRE) -- Investar Holding Corporation (NASDAQ:ISTR) (the “Company”), the holding company for Investar Bank (the “Bank”), today announced financial results for the quarter ended December 31, 2017. The Company reported net income of $2.3 million, or $0.25 per diluted common share, for the fourth quarter of 2017, compared to $2.1 million, or $0.24 per diluted common share, for the quarter ended September 30, 2017, and $1.8 million, or $0.26 per diluted common share, for the quarter ended December 31, 2016.\nOn a non-GAAP basis, core earnings per share in the fourth quarter of 2017 were $0.35 and $0.34 per basic and diluted common share, respectively (refer to the Reconciliation of Non-GAAP Financial Measures table for a reconciliation of GAAP to non-GAAP metrics).\nOn December 22, 2017, President Trump signed “H.R.1,” referred to as the Tax Cuts and Jobs Act, which, among other items, reduces the federal corporate tax rate to 21% effective January 1, 2018. As a result, the Company was required to revalue its deferred tax assets and liabilities to account for the future impact of a lower corporate tax rate. The revaluation of the Company’s deferred tax assets and liabilities resulted in a one-time charge to income tax expense of approximately $0.3 million, which resulted in a reduction in diluted earnings per share for the fourth quarter of 2017 of approximately $0.03. The Company’s final analysis and write-down will be based on a number of factors, including completion of the Company’s 2017 consolidated tax return.\nThe Company’s balance sheet and statement of income as of and for the three and twelve months ended December 31, 2017 include the impact of the Company’s acquisition of BOJ Bancshares, Inc. and its wholly-owned subsidiary, The Highlands Bank (together “BOJ”), which was completed on December 1, 2017 and the acquisition of Citizens Bancshares, Inc. and its wholly-owned subsidiary, Citizens Bank (together “Citizens”), which was completed on July 1, 2017. As of the acquisition date, BOJ operated five branch locations and had approximately $152 million in total assets, including approximately $104 million in loans, and approximately $126 million in deposits. As of the acquisition date, Citizens operated three branch locations and had approximately $250 million in total assets, including approximately $130 million in loans, and approximately $212 million in deposits. The assets acquired and liabilities assumed have been recorded at fair value and are subject to refinement for up to one year after the closing date of the acquisition as additional information becomes available.\nInvestar Holding Corporation President and Chief Executive Officer John D’Angelo said:\n“The fourth quarter was another exciting quarter for Investar. We completed the acquisition of BOJ Bancshares, Inc. and its wholly-owned subsidiary, The Highlands Bank, on December 1, 2017, which was our second acquisition in 2017. We expect to complete the integration of the branch and operating systems in the first quarter of 2018.\nDespite the effects of the Tax Cuts and Jobs Act on the fourth quarter results, we believe the Company, as well as its shareholders, will benefit from lower corporate tax rates in 2018 and beyond. Additionally, with the completion of two acquisitions in 2017, our results are strong as we head into 2018, and we look forward to recognizing the benefits of the acquisitions in the coming year. We have built a great team of experienced members focused on growing relationships with our customers and look forward to 2018 as the opportunities to continue to grow revenues and expand our customer base remain strong.”\nFourth Quarter Highlights\nTotal revenues, or interest and noninterest income, for the quarter ended December 31, 2017 totaled $16.9 million, an increase of $1.3 million, or 8.5%, compared to September 30, 2017, and an increase of $5.0 million, or 41.6%, compared to December 31, 2016.\nTotal loans increased $148.3 million, or 13.4%, to $1.3 billion at December 31, 2017, compared to $1.1 billion at September 30, 2017, and increased $365.4 million, or 40.9%, compared to $893.4 million at December 31, 2016. Excluding loans acquired in the BOJ acquisition, or $100.0 million, total loans increased $48.2 million, or 4.3%, to $1.2 billion at December 31, 2017, compared to $1.1 billion at September 30, 2017. Excluding loans acquired in both the BOJ and Citizens acquisitions, or $217.5 million, total loans increased $147.9 million, or 16.6%, to $1.0 billion at December 31, 2017, compared to $893.4 million at December 31, 2016.\nThe business lending portfolio, which consists of loans secured by owner-occupied commercial real estate properties and commercial and industrial loans, was $407.8 million at December 31, 2017, an increase of $65.2 million, or 19.0%, compared to the business lending portfolio of $342.6 million at September 30, 2017, and an increase of $142.0 million, or 53.4%, compared to the business lending portfolio of $265.8 million at December 31, 2016.\nNoninterest-bearing deposits increased $41.5 million, or 23.7%, to $216.6 million at December 31, 2017, compared to $175.1 million at September 30, 2017, and increased $108.2 million, or 99.8%, compared to $108.4 million at December 31, 2016. Excluding noninterest-bearing deposits acquired in the BOJ acquisition, or $34.0 million, noninterest-bearing deposits increased $7.4 million, or 4.2%, to $182.6 million at December 31, 2017 compared to $175.1 million at September 30, 2017. Excluding noninterest-bearing deposits acquired in both the BOJ and Citizens acquisitions, or $77.5 million, noninterest-bearing deposits increased $30.7 million, or 28.3%, to $139.1 million at December 31, 2017, compared to $108.4 million at December 31, 2016.\nNet interest margin increased fifteen basis points to 3.55% for the quarter ended December 31, 2017, compared to 3.40% for the quarter ended September 30, 2017, and increased thirty-five basis points from 3.20% for the quarter ended December 31, 2016. Exclusive of interest income accretion of $0.2 million in both the quarters ended December 31, 2017 and September 30, 2017, and a $40,000 interest recovery in the quarter ended December 31, 2017, net interest margin increased fourteen basis points to 3.48% for the quarter ended December 31, 2017 compared to 3.34% for the quarter ended September 30, 2017, and increased twenty-eight basis points from 3.20% for the quarter ended December 31, 2016.\nCost of deposits increased one basis point to 0.92% for the quarter ended December 31, 2017, compared to 0.91% for the quarter ended September 30, 2017, but decreased six basis points compared to 0.98% for the quarter ended December 31, 2016.\nThe Company completed the acquisition of BOJ on December 1, 2017. The conversion of branch and operating systems is expected to be completed during the first quarter of 2018.\nThe Company repurchased 10,463 shares of its common stock through its stock repurchase program at an average price of $23.08 during the quarter ended December 31, 2017.\nLoans\nTotal loans were $1.3 billion at December 31, 2017, an increase of $148.3 million, or 13.4%, compared to September 30, 2017, and an increase of $365.4 million, or 40.9%, compared to December 31, 2016. Included in total loans at December 31, 2017 is $100.0 million, or 7.9% of the total loan portfolio, of loans acquired from BOJ. Exclusive of loans acquired from BOJ, total loans at December 31, 2017 increased $48.2 million, or 4.3%, compared to $1.1 billion at September 30, 2017. Exclusive of loans acquired from BOJ and Citizens, or $217.5 million, total loans increased $147.9 million, or 16.6%, compared to December 31, 2016.\nThe following table sets forth the composition of the Company’s loan portfolio as of the dates indicated (dollars in thousands).\nLinked Quarter Change Year/Year Change Percentage of Total Loans 12/31/2017 9/30/2017 12/31/2016 $ % $ % 12/31/2017 12/31/2016 Mortgage loans on real estate Construction and development $ 157,667 $ 122,501 $ 90,737 $ 35,166 28.7 % $ 66,930 73.8 % 12.5 % 10.2 % 1-4 Family 276,922 252,003 177,205 24,919 9.9 99,717 56.3 22.0 19.8 Multifamily 51,283 50,770 42,759 513 1.0 8,524 19.9 4.1 4.8 Farmland 23,838 14,130 8,207 9,708 68.7 15,631 190.5 1.9 0.9 Commercial real estate Owner-occupied 272,433 217,369 180,458 55,064 25.3 91,975 51.0 21.6 20.2 Nonowner-occupied 264,931 245,053 200,258 19,878 8.1 64,673 32.3 21.0 22.4 Commercial and industrial 135,392 125,230 85,377 10,162 8.1 50,015 58.6 10.8 9.6 Consumer 76,313 83,465 108,425 (7,152 ) (8.6 ) (32,112 ) (29.6 ) 6.1 12.1 Total loans 1,258,779 1,110,521 893,426 148,258 13.4 % 365,353 40.9 % 100 % 100 % Construction and development loans were $157.7 million at December 31, 2017, an increase of $35.2 million, or 28.7%, compared to $122.5 million at September 30, 2017, and an increase of $66.9 million, or 73.8%, compared to $90.7 million at December 31, 2016. The increase in the construction and development portfolio at December 31, 2017 compared to September 30, 2017 is partly attributable to the $21.5 million balance of these loans acquired from BOJ. The increase in this portfolio compared to December 31, 2016 is primarily a result of organic growth in the Company’s Baton Rouge market where our lenders have great experience and long-standing relationships with local developers.\nOne-to-four family loans were $276.9 million at December 31, 2017, an increase of $24.9 million, or 9.9%, compared to $252.0 million at September 30, 2017, and an increase of $99.7 million, or 56.3%, compared to $177.2 million at December 31, 2016. The increase in the 1-4 family portfolio is primarily a result of the approximately $79.4 million balance at December 31, 2017 of 1-4 family loans acquired from both BOJ and Citizens.\nOwner-occupied commercial real estate loans were $272.4 million at December 31, 2017, an increase of $55.1 million, or 25.3%, compared to $217.4 million at September 30, 2017, and an increase of $92.0 million, or 51.0%, compared to $180.5 million at December 31, 2016. The increase in the owner-occupied portfolio is primarily a result of the approximately $37.7 million of these loans acquired from both BOJ and Citizens.\nAt December 31, 2017, the Company’s total business lending portfolio, which consists of loans secured by owner-occupied commercial real estate properties and commercial and industrial loans, was $407.8 million, an increase of $65.2 million, or 19.0%, compared to the business lending portfolio of $342.6 million at September 30, 2017, and an increase of $142.0 million, or 53.4%, compared to the business lending portfolio of $265.8 million at December 31, 2016. Included in the business lending portfolio at December 31, 2017 is $71.1 million of loans acquired from BOJ and Citizens. The Company continues to focus on relationship banking and growing its commercial loan portfolio.\nConsumer loans, including indirect auto loans of $55.9 million, totaled $76.3 million at December 31, 2017, a decrease of $7.2 million, or 8.6%, compared to $83.5 million, including indirect auto loans of $64.1 million, at September 30, 2017, and a decrease of $32.1 million, or 29.6%, compared to $108.4 million, including indirect auto loans of $92.1 million, at December 31, 2016. Excluding consumer loans acquired from BOJ, or $1.9 million, consumer loans decreased $9.0 million, or 10.8%, compared to September 30, 2017. Excluding consumer loans acquired from BOJ and Citizens, or $9.3 million, consumer loans decreased $41.4 million, or 38.2%, compared to December 31, 2016. The decrease in consumer loans is attributable to the scheduled paydowns of this portfolio and is consistent with our business strategy.\nCredit Quality\nWhile the Company’s internal focus has been directed toward managing growth and the integration of its recent acquisitions, its commitment to credit quality remains strong. Nonperforming loans were $3.7 million, or 0.29% of total loans, at December 31, 2017, an increase of $1.5 million compared to $2.2 million, or 0.20% of total loans, at September 30, 2017, and an increase of $1.7 million compared to $2.0 million at December 31, 2016. The increase in nonperforming loans at December 31, 2017 compared to September 30, 2017 and December 31, 2016 is mainly attributable to the acquisition of $1.7 million and $0.7 million of nonperforming loans from BOJ and Citizens, respectively.\nThe allowance for loan losses was $7.9 million, or 214.43% and 0.63% of nonperforming and total loans, respectively, at December 31, 2017, compared to $7.6 million, or 349.64% and 0.68%, respectively, at September 30, 2017, and $7.1 million, or 356.16% and 0.79%, respectively, at December 31, 2016. As a result of the acquisitions of BOJ and Citizens, the Company is holding acquired loans that are carried net of a fair value adjustment for credit and interest rate marks and are only included in the allowance calculation to the extent that the reserve requirement exceeds the fair value adjustment.\nThe provision for loan losses was $0.4 million for the quarters ended December 31, 2017, September 30, 2017, and December 31, 2016.\nDeposits\nTotal deposits at December 31, 2017 were $1.2 billion, an increase of $123.9 million, or 11.2%, compared to September 30, 2017, and an increase of $317.5 million, or 35.0%, compared to December 31, 2016. The Company acquired $126.1 million and $212.2 million in deposits from the BOJ and Citizens acquisitions, respectively. Exclusive of deposits acquired from BOJ, total deposits decreased $2.2 million, or 0.2%, compared to September 30, 2017. Exclusive of deposits acquired from BOJ and Citizens, total deposits decreased $11.2 million, or 1.2%, compared to December 31, 2016. The decrease in deposits, exclusive of acquired deposits, at December 31, 2017 compared to December 31, 2016 is primarily due to a decrease in time deposits of $62.3 million, or 13.8%, resulting from the Bank’s strategy to decrease its dependence on non-retail certificates of deposit.\nThe following table sets forth the composition of the Company’s deposits as of the dates indicated (dollars in thousands).\nLinked Quarter Change Year/Year Change Percentage of\nTotal Deposits 12/31/2017 9/30/2017 12/31/2016 $ % $ % 12/31/2017 12/31/2016 Noninterest-bearing demand deposits $ 216,599 $ 175,130 $ 108,404 $ 41,469 23.7 % $ 108,195 99.8 % 17.7 % 11.9 % NOW accounts 208,683 192,503 171,556 16,180 8.4 37,127 21.6 17.0 18.9 Money market deposit accounts 146,140 147,096 123,079 (956 ) (0.6 ) 23,061 18.7 11.9 13.6 Savings accounts 117,372 103,017 52,860 14,355 13.9 64,512 122.0 9.6 5.8 Time deposits 536,443 483,616 451,888 52,827 10.9 84,555 18.7 43.8 49.8 Total deposits $ 1,225,237 $ 1,101,362 $ 907,787 $ 123,875 11.2 % $ 317,450 35.0 % 100.0 % 100.0 % Financial Results for the Quarter Ended December 31, 2017\nThe financial results for the quarter ended December 31, 2017 reflect the acquisition of BOJ beginning December 1, 2017. The acquisition of BOJ added five branch locations in East and West Feliciana Parishes with total assets of approximately $152 million, total loans of $104 million, and total deposits of $126 million. During the quarter ended December 31, 2017, the Company recognized $0.8 million in expenses related to the acquisition activity during the year.\nOn December 22, 2017, President Trump signed the Tax Cuts and Jobs Act, which, among other items, reduces the federal corporate tax rate to 21% effective January 1, 2018. As a result, the Company was required to revalue its deferred tax assets and liabilities to account for the future impact of a lower corporate tax rate. The revaluation of the Company’s deferred tax assets and liabilities resulted in a one-time charge to income tax expense of approximately $0.3 million, which caused a $0.03 reduction in diluted earnings per share for the quarter.\nNet Interest Income\nNet interest income for the fourth quarter of 2017 totaled $12.8 million, an increase of $1.3 million, or 11.1%, compared to the third quarter of 2017, and an increase of $4.0 million, or 46.0%, compared to the fourth quarter of 2016. Included in net interest income for the quarters ended December 31, 2017 and September 30, 2017 is $0.2 million of interest income accretion from the acquisition of loans during those quarters. The increase in net interest income was primarily driven by growth in loan and securities balances partially offset by an increase in interest expense as we funded the increase in earning assets with increased deposits and borrowings. Net interest income for the fourth quarter of 2017 increased $3.5 million and $1.4 million due to increases in the volume and yield, respectively, of interest-earning assets, offset slightly by decreases of $0.6 million and $0.3 million due to the increases in the volume and rate, respectively, of interest-bearing liabilities compared to the fourth quarter of 2016.\nThe Company’s net interest margin was 3.55% for the quarter ended December 31, 2017 compared to 3.40% for the quarter ended September 30, 2017 and 3.20% for the quarter ended December 31, 2016. The yield on interest-earning assets was 4.42% for the quarter ended December 31, 2017 compared to 4.26% for the quarter ended September 30, 2017 and 4.04% for the quarter ended December 31, 2016. The increase in net interest margin at December 31, 2017 compared to both September 30, 2017 and December 31, 2016 was driven by an increase in interest-earning assets and the yields earned on those assets, and an increase in the volume of lower cost deposits, partially resulting from the acquisitions of both BOJ and Citizens. Exclusive of the interest income accretion from the acquisition of loans, discussed in the preceding paragraph, as well as a $40,000 interest recovery in the quarter ended December 31, 2017, net interest margin was 3.48% for the quarter ended December 31, 2017 compared to 3.34% for the quarter ended September 30, 2017 and 3.20% for the quarter ended December 31, 2016. The yield on interest-earning assets was 4.35% at December 31, 2017 compared to 4.20% and 4.04% for the quarters ended September 30, 2017 and December 31, 2016, respectively.\nThe cost of deposits increased one basis point to 0.92% for the quarter ended December 31, 2017 compared to 0.91% for the quarter ended September 30, 2017 and decreased six basis points compared to 0.98% at December 31, 2016. The decrease in the cost of deposits when compared to the quarter ended December 31, 2016 is a result of a decrease in the cost of savings deposits and time deposits. The overall costs of funds for the quarter ended December 31, 2017 increased two basis points to 1.07% compared to 1.05% for the quarter ended September 30, 2017 and increased eight basis points compared to 0.99% for the quarter ended December 31, 2016. The increase in the cost of deposits and cost of funds at December 31, 2017 compared to September 30, 2017 is mainly a result of an increase in the cost of time deposits and short term borrowings. The increase in the cost of funds at December 31, 2017 compared to December 31, 2016 is mainly attributable to the increase in long term borrowings resulting from the Company’s issuance and sale, on March 24, 2017, of $18.6 million in aggregate principal amount of its 6.00% Fixed-to-Floating Rate Subordinated Notes due in 2027.\nNoninterest Income\nNoninterest income for the fourth quarter of 2017 totaled $1.0 million, a decrease of $0.2 million, or 17.6%, compared to the third quarter of 2017, and an increase of $0.1 million, or 7.4%, compared to the fourth quarter of 2016. The decrease in noninterest income when compared to the quarter ended September 30, 2017 is due to a $0.2 million decrease in gain on sale of fixed assets.\nNoninterest Expense\nNoninterest expense for the fourth quarter of 2017 totaled $9.6 million, an increase of $0.5 million, or 5.3%, compared to the third quarter of 2017, and an increase of $3.0 million, or 45.5%, compared to the fourth quarter of 2016. The increase in noninterest expense compared to the quarters ended September 30, 2017 and December 31, 2016 is mainly attributable to the increases in both salaries and employee benefits and acquisition expense. The increase in salaries and employee benefits is a result of the increase in employees following the BOJ and Citizens acquisitions, as well as the addition of four commercial lenders in the Baton Rouge, New Orleans and Lafayette markets, and a Community Development Officer and Treasury Management Sales Officer in the New Orleans market during the quarter ended September 30, 2017. The increase in acquisition expense was a result of the Citizens acquisition that was completed on July 1, 2017 and the BOJ acquisition that was completed on December 1, 2017.\nBasic Earnings Per Share and Diluted Earnings Per Common Share\nThe Company reported both basic and diluted earnings per common share of $0.25 for the quarter ended December 31, 2017, a decrease of $0.01 compared to basic and diluted earnings per common share of $0.26 for the quarter ended December 31, 2016. The decrease in both basic and diluted earnings per share is attributable to the Company’s issuance of approximately 1.6 million common shares as part of a public offering on March 22, 2017, the issuance of approximately 0.8 million common shares as consideration in the acquisition of BOJ, the $0.8 million in acquisition expenses, and the $0.3 million charge to income tax expense as a result of the Tax Cuts and Jobs Act recognized during the quarter ended December 31, 2017.\nTaxes\nThe Company recorded income tax expense of $1.5 million for the quarter ended December 31, 2017, which equates to an effective tax rate of 39.5%, an increase from the effective tax rates of 32.6% and 31.5% for the quarters ended September 30, 2017 and December 31, 2016, respectively. The income tax expense for the quarter ended December 31, 2017 includes a one-time charge of $0.3 million as a result of the revaluation of the Company’s deferred tax assets and liabilities required following the enactment of the Tax Cuts and Jobs Act. The Company’s final analysis and write-down will be based on a number of factors, including completion of the Company’s 2017 consolidated tax return. Management expects the Company’s effective tax rate to approximate 20% beginning in 2018, mainly as a result of the Tax Cuts and Jobs Act.\nAbout Investar Holding Corporation\nInvestar Holding Corporation, headquartered in Baton Rouge, Louisiana, provides full banking services, excluding trust services, through its wholly-owned banking subsidiary, Investar Bank, a state chartered bank. The Company’s primary market is South Louisiana and it currently operates 20 full service banking offices located throughout its market. At December 31, 2017, the Company had 258 full-time equivalent employees.\nNon-GAAP Financial Measures\nThis press release contains financial information determined by methods other than in accordance with generally accepted accounting principles in the United States of America, or GAAP. These measures and ratios include “tangible common equity,” “tangible assets,” “tangible equity to tangible assets,” “tangible book value per common share,” “core noninterest income,” “core earnings before noninterest expense,” “core noninterest expense,” “core earnings before income tax expense,” “core income tax expense,” “core earnings,” “core efficiency ratio,” “core return on average assets,” “core return on average equity,” “core basic earnings per share,” and “core diluted earnings per share.” Management believes these non-GAAP financial measures provide information useful to investors in understanding the Company’s financial results, and the Company believes that its presentation, together with the accompanying reconciliations, provide a more complete understanding of factors and trends affecting the Company’s business and allow investors to view performance in a manner similar to management, the entire financial services sector, bank stock analysts and bank regulators. These non-GAAP measures should not be considered a substitute for GAAP basis measures and results, and the Company strongly encourages investors to review its consolidated financial statements in their entirety and not to rely on any single financial measure. Because non-GAAP financial measures are not standardized, it may not be possible to compare these financial measures with other companies’ non-GAAP financial measures having the same or similar names. A reconciliation of the non-GAAP financial measures disclosed in this press release to the comparable GAAP financial measures is included at the end of the financial statement tables.\nForward-Looking Statements\nThis press release contains within the meaning of the Private Securities Litigation Reform Act of 1995 that reflect the Company’s current views with respect to, among other things, future events and financial performance. The Company generally identifies by terminology such as “outlook,” “believes,” “expects,” “potential,” “continues,” “may,” “will,” “could,” “should,” “seeks,” “approximately,” “predicts,” “intends,” “plans,” “estimates,” “anticipates,” or the negative version of those words or other comparable words. Any contained in this press release are based on the historical performance of the Company and its subsidiaries or on the Company’s current plans, estimates and expectations. The inclusion of this forward-looking information should not be regarded as a representation by the Company that the future plans, estimates or expectations by the Company will be achieved. Such are subject to various risks and uncertainties and assumptions relating to the Company’s operations, financial results, financial condition, business prospects, growth strategy and liquidity. If one or more of these or other risks or uncertainties materialize, or if the Company’s underlying assumptions prove to be incorrect, the Company’s actual results may vary materially from those indicated in these statements. The Company does not undertake any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise. A number of important factors could cause actual results to differ materially from those indicated by the . These factors include, but are not limited to, the following, any one or more of which could materially affect the outcome of future events:\nbusiness and economic conditions generally and in the financial services industry in particular, whether nationally, regionally or in the markets in which we operate; our ability to achieve organic loan and deposit growth, and the composition of that growth;\nchanges (or the lack of changes) in interest rates, yield curves and interest rate spread relationships that affect our loan and deposit pricing; the extent of continuing client demand for the high level of personalized service that is a key element of our banking approach as well as our ability to execute our strategy generally; our dependence on our management team, and our ability to attract and retain qualified personnel; changes in the quality or composition of our loan or investment portfolios, including adverse developments in borrower industries or in the repayment ability of individual borrowers; inaccuracy of the assumptions and estimates we make in establishing reserves for probable loan losses and other estimates; the concentration of our business within our geographic areas of operation in Louisiana; concentration of credit exposure; and the ability to effectively integrate employees, customers, operations and branches from our recent acquisitions of Citizens and BOJ.\nIn addition, forward-looking statement and estimates regarding the effects of the Tax Cuts and Jobs Act are based on our current interpretation of this legislation and may change as a result of additional implementation guidance, changes in assumptions, potential future refinements of or revisions to calculations and completion of the Company’s 2017 consolidated tax return.\nThese factors should not be construed as exhaustive. Additional information on these and other risk factors can be found in Item 1A. “Risk Factors” and in the “Special Note Regarding Forward-Looking Statements” in Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the Company’s Annual Report on Form 10-K for the year ended December 31, 2016, filed with the Securities and Exchange Commission.\nFor further information contact:\nInvestar Holding Corporation\nChris Hufft\nChief Financial Officer\n(225) 227-2215\nChris.Hufft@investarbank.com\nINVESTAR HOLDING CORPORATION SUMMARY FINANCIAL INFORMATION (Amounts in thousands, except share data) (Unaudited) As of and for the three months ended 12/31/2017 9/30/2017 12/31/2016 Linked Quarter Year/Year EARNINGS DATA Total interest income $ 15,967 $ 14,442 $ 11,062 10.6 % 44.3 % Total interest expense 3,150 2,904 2,281 8.5 38.1 Net interest income 12,817 11,538 8,781 11.1 46.0 Provision for loan losses 395 420 375 (6.0 ) 5.3 Total noninterest income 962 1,167 896 (17.6 ) 7.4 Total noninterest expense 9,608 9,122 6,603 5.3 45.5 Income before income taxes 3,776 3,163 2,699 19.4 39.9 Income tax expense 1,492 1,032 851 44.6 75.3 Net income $ 2,284 $ 2,131 $ 1,848 7.2 23.6 AVERAGE BALANCE SHEET DATA Total assets $ 1,534,917 $ 1,437,929 $ 1,147,835 6.7 % 33.7 % Total interest-earning assets 1,434,164 1,346,455 1,087,645 6.5 31.9 Total loans 1,169,686 1,073,800 889,814 8.9 31.5 Total interest-bearing deposits 957,847 927,014 798,250 3.3 20.0 Total interest-bearing liabilities 1,171,884 1,101,112 917,085 6.4 27.8 Total deposits 1,147,782 1,100,226 904,310 4.3 26.9 Total stockholders’ equity 160,485 152,186 113,917 5.5 40.9 PER SHARE DATA Earnings: Basic earnings per share $ 0.25 $ 0.24 $ 0.26 4.2 % (3.8 )% Diluted earnings per share 0.25 0.24 0.26 4.2 (3.8 ) Core Earnings (1) : Core basic earnings per share (1) 0.35 0.29 0.25 20.7 40.0 Core diluted earnings per share (1) 0.34 0.29 0.25 17.2 36.0 Book value per share 18.15 17.56 15.88 3.4 14.3 Tangible book value per share (1) 16.06 16.04 15.42 0.1 4.2 Common shares outstanding 9,514,926 8,704,562 7,101,851 9.3 34.0 Weighted average common shares outstanding - basic 8,981,014 8,702,559 7,017,213 3.2 28.0 Weighted average common shares outstanding - diluted 9,052,213 8,797,517 7,090,500 2.9 27.7 PERFORMANCE RATIOS Return on average assets 0.59 % 0.59 % 0.65 % — % (9.2 )% Core return on average assets (1) 0.81 0.70 0.61 15.7 32.8 Return on average equity 5.65 5.55 6.51 1.8 (13.2 ) Core return on average equity (1) 7.77 6.61 6.15 17.5 26.3 Net interest margin 3.55 3.40 3.20 4.4 10.9 Net interest income to average assets 3.31 3.18 3.04 4.1 8.9 Noninterest expense to average assets 2.48 2.52 2.28 (1.6 ) 8.8 Efficiency ratio (2) 69.73 71.80 68.23 (2.9 ) 2.2 Core efficiency ratio (1) 63.73 66.49 69.11 (4.2 ) (7.8 ) Dividend payout ratio 12.38 12.26 4.65 1.0 166.2 Net charge-offs to average loans 0.01 0.01 0.08 — (87.5 ) (1) Non-GAAP financial measure. See reconciliation. (2) Efficiency ratio represents noninterest expenses divided by the sum of net interest income (before provision for loan losses) and noninterest income.\nINVESTAR HOLDING CORPORATION SUMMARY FINANCIAL INFORMATION (Amounts in thousands, except share data) (Unaudited) As of and for the three months ended 12/31/2017 9/30/2017 12/31/2016 Linked Quarter Year/Year ASSET QUALITY RATIOS Nonperforming assets to total assets 0.46 % 0.41 % 0.52 % 12.2 % (11.5 )% Nonperforming loans to total loans 0.29 0.20 0.22 45.0 31.8 Allowance for loan losses to total loans 0.63 0.68 0.79 (7.4 ) (20.3 ) Allowance for loan losses to nonperforming loans 214.43 349.64 356.16 (38.7 ) (39.8 ) CAPITAL RATIOS Investar Holding Corporation: Total equity to total assets 10.64 % 10.35 % 9.73 % 2.8 % 9.4 % Tangible equity to tangible assets (1) 9.53 9.54 9.48 (0.1 ) 0.5 Tier 1 leverage ratio 10.66 10.13 10.10 5.2 5.5 Common equity tier 1 capital ratio (2) 11.71 11.97 11.40 (2.2 ) 2.7 Tier 1 capital ratio (2) 12.20 12.27 11.75 (0.6 ) 3.8 Total capital ratio (2) 14.17 14.46 12.47 (2.0 ) 13.6 Investar Bank: Tier 1 leverage ratio 11.63 11.21 10.03 3.7 16.0 Common equity tier 1 capital ratio (2) 13.31 13.58 11.67 (2.0 ) 14.1 Tier 1 capital ratio (2) 13.31 13.58 11.67 (2.0 ) 14.1 Total capital ratio (2) 13.90 14.23 12.39 (2.3 ) 12.2 (1) Non-GAAP financial measure. See reconciliation. (2) Estimated for December 31, 2017\nINVESTAR HOLDING CORPORATION CONSOLIDATED BALANCE SHEETS (Amounts in thousands, except share data) (Unaudited) December 31, 2017 September 30, 2017 December 31, 2016 ASSETS Cash and due from banks $ 19,619 $ 17,942 $ 9,773 Interest-bearing balances due from other banks 10,802 30,566 19,569 Federal funds sold — — 106 Cash and cash equivalents 30,421 48,508 29,448 Available for sale securities at fair value (amortized cost of $220,077, $228,980, and $166,258, respectively) 217,564 227,562 163,051 Held to maturity securities at amortized cost (estimated fair value of $17,947, $19,311, and $19,612, respectively) 17,997 19,306 20,091 Loans, net of allowance for loan losses of $7,891, $7,605, and $7,051, respectively 1,250,888 1,102,916 886,375 Other equity securities 9,798 7,744 5,362 Bank premises and equipment, net of accumulated depreciation of $7,825, $7,362, and $6,751, respectively 37,540 33,705 31,722 Other real estate owned, net 3,837 3,830 4,065 Accrued interest receivable 4,688 4,147 3,218 Deferred tax asset 1,294 2,604 2,868 Goodwill and other intangible assets, net 19,926 13,271 3,234 Bank-owned life insurance 23,231 8,140 7,201 Other assets 5,550 4,690 2,325 Total assets $ 1,622,734 $ 1,476,423 $ 1,158,960 LIABILITIES Deposits Noninterest-bearing $ 216,599 $ 175,130 $ 108,404 Interest-bearing 1,008,638 926,232 799,383 Total deposits 1,225,237 1,101,362 907,787 Advances from Federal Home Loan Bank 166,658 162,700 82,803 Repurchase agreements 21,935 24,892 39,087 Subordinated debt 18,168 18,157 — Junior subordinated debt 5,792 3,609 3,609 Other borrowings — — 1,000 Accrued taxes and other liabilities 12,215 12,827 11,917 Total liabilities 1,450,005 1,323,547 1,046,203 STOCKHOLDERS’ EQUITY Preferred stock, no par value per share; 5,000,000 shares authorized — — — Common stock, $1.00 par value per share; 40,000,000 shares authorized; 9,514,926, 8,704,562, and 7,101,851 shares outstanding, respectively 9,515 8,705 7,102 Surplus 131,582 113,458 81,499 Retained earnings 33,203 31,508 26,227 Accumulated other comprehensive loss (1,571 ) (795 ) (2,071 ) Total stockholders’ equity 172,729 152,876 112,757 Total liabilities and stockholders’ equity $ 1,622,734 $ 1,476,423 $ 1,158,960\nINVESTAR HOLDING CORPORATION CONSOLIDATED STATEMENTS OF INCOME (Amounts in thousands, except share data) (Unaudited) For the three months ended For the twelve months ended December 31, 2017 September 30, 2017 December 31, 2016 December 31, 2017 December 31, 2016 INTEREST INCOME Interest and fees on loans $ 14,407 $ 12,893 $ 10,103 $ 47,863 $ 39,380 Interest on investment securities 1,428 1,399 898 5,055 3,565 Other interest income 132 150 61 428 207 Total interest income 15,967 14,442 11,062 53,346 43,152 INTEREST EXPENSE Interest on deposits 2,233 2,137 1,970 8,050 7,182 Interest on borrowings 917 767 311 2,779 1,231 Total interest expense 3,150 2,904 2,281 10,829 8,413 Net interest income 12,817 11,538 8,781 42,517 34,739 Provision for loan losses 395 420 375 1,540 2,079 Net interest income after provision for loan losses 12,422 11,118 8,406 40,977 32,660 NONINTEREST INCOME Service charges on deposit accounts 293 281 79 767 343 Gain on sale of investment securities, net 50 27 15 292 443 (Loss) gain on sale of fixed assets, net (57 ) 160 14 127 1,266 (Loss) gain on sale of other real estate owned, net (5 ) 37 2 27 13 Gain on sale of loans, net — — 92 — 405 Servicing fees and fee income on serviced loans 329 352 449 1,482 2,087 Other operating income 352 310 245 1,120 911 Total noninterest income 962 1,167 896 3,815 5,468 Income before noninterest expense 13,384 12,285 9,302 44,792 38,128 NONINTEREST EXPENSE Depreciation and amortization 556 542 383 1,865 1,493 Salaries and employee benefits 5,486 5,136 3,901 18,681 15,609 Occupancy 324 317 252 1,150 995 Data processing 521 446 373 1,690 1,488 Marketing 151 124 70 422 386 Professional fees 224 263 295 950 1,261 Customer reimbursements — — — — 584 Acquisition expenses 819 824 — 1,868 — Other operating expenses 1,527 1,470 1,329 5,716 4,823 Total noninterest expense 9,608 9,122 6,603 32,342 26,639 Income before income tax expense 3,776 3,163 2,699 12,450 11,489 Income tax expense 1,492 1,032 851 4,248 3,609 Net income $ 2,284 $ 2,131 $ 1,848 $ 8,202 $ 7,880 EARNINGS PER SHARE Basic earnings per share $ 0.25 $ 0.24 $ 0.26 $ 0.96 $ 1.11 Diluted earnings per share $ 0.25 $ 0.24 $ 0.26 $ 0.96 $ 1.10 Cash dividends declared per common share $ 0.03 $ 0.03 $ 0.01 $ 0.10 $ 0.04\nINVESTAR HOLDING CORPORATION CONSOLIDATED AVERAGE BALANCE SHEET, INTEREST EARNED AND YIELD ANALYSIS (Amounts in thousands) (Unaudited) For the three months ended December 31, 2017 September 30, 2017 December 31, 2016 Average\nBalance Interest\nIncome/\nExpense Yield/ Rate Average\nBalance Interest\nIncome/\nExpense Yield/ Rate Average\nBalance Interest\nIncome/\nExpense Yield/ Rate Assets Interest-earning assets: Loans $ 1,169,686 $ 14,407 4.89 % $ 1,073,800 $ 12,893 4.76 % $ 889,814 $ 10,103 4.50 % Securities: Taxable 203,011 1,221 2.39 203,407 1,193 2.33 138,985 707 2.02 Tax-exempt 35,060 207 2.34 34,659 206 2.36 30,898 191 2.45 Interest-bearing balances with banks 26,407 132 1.98 34,589 150 1.72 27,948 61 0.87 Total interest-earning assets 1,434,164 15,967 4.42 1,346,455 14,442 4.26 1,087,645 11,062 4.04 Cash and due from banks 22,520 22,626 7,845 Intangible assets 15,655 13,283 3,237 Other assets 70,254 63,007 56,361 Allowance for loan losses (7,676 ) (7,442 ) (7,253 ) Total assets $ 1,534,917 $ 1,437,929 $ 1,147,835 Liabilities and stockholders’ equity Interest-bearing liabilities: Deposits: Interest-bearing demand deposits $ 348,573 $ 608 0.69 $ 337,846 $ 604 0.71 $ 281,500 $ 485 0.68 Savings deposits 105,896 138 0.52 102,331 139 0.54 53,219 87 0.65 Time deposits 503,378 1,487 1.17 486,837 1,394 1.14 463,531 1,398 1.20 Total interest-bearing deposits 957,847 2,233 0.92 927,014 2,137 0.91 798,250 1,970 0.98 Short-term borrowings 135,126 430 1.26 122,456 367 1.19 99,169 246 0.98 Long-term debt 78,911 487 2.45 51,642 400 3.07 19,666 65 1.31 Total interest-bearing liabilities 1,171,884 3,150 1.07 1,101,112 2,904 1.05 917,085 2,281 0.99 Noninterest-bearing deposits 189,935 173,212 106,060 Other liabilities 12,613 11,419 10,773 Stockholders’ equity 160,485 152,186 113,917 Total liability and stockholders’ equity $ 1,534,917 $ 1,437,929 $ 1,147,835 Net interest income/net interest margin $ 12,817 3.55 % $ 11,538 3.40 % $ 8,781 3.20 %\nINVESTAR HOLDING CORPORATION CONSOLIDATED AVERAGE BALANCE SHEET, INTEREST EARNED AND YIELD ANALYSIS (Amounts in thousands) (Unaudited) For the twelve months ended December 31, 2017 December 31, 2016 Average\nBalance Interest\nIncome/\nExpense Yield/ Rate Average\nBalance Interest\nIncome/\nExpense Yield/ Rate Assets Interest-earning assets: Loans $ 1,013,502 $ 47,863 4.72 % $ 862,340 $ 39,380 4.55 % Securities: Taxable 180,769 4,265 2.36 129,251 2,878 2.22 Tax-exempt 32,427 790 2.44 27,171 687 2.52 Interest-bearing balances with banks 28,524 428 1.50 26,196 207 0.79 Total interest-earning assets 1,255,222 53,346 4.25 1,044,958 43,152 4.12 Cash and due from banks 15,534 7,463 Intangible assets 8,892 3,231 Other assets 61,387 54,951 Allowance for loan losses (7,368 ) (6,891 ) Total assets $ 1,333,667 $ 1,103,712 Liabilities and stockholders’ equity Interest-bearing liabilities: Deposits: Interest-bearing demand $ 317,755 $ 2,223 0.70 $ 257,888 $ 1,690 0.65 Savings deposits 78,444 446 0.57 52,753 353 0.67 Time deposits 456,690 5,381 1.18 439,423 5,139 1.17 Total interest-bearing deposits 852,889 8,050 0.94 750,064 7,182 0.95 Short-term borrowings 129,109 1,430 1.11 108,339 956 0.88 Long-term debt 47,922 1,349 2.81 23,092 275 1.19 Total interest-bearing liabilities 1,029,920 10,829 1.05 881,495 8,413 0.95 Noninterest-bearing deposits 147,856 97,948 Other liabilities 10,782 11,793 Stockholders’ equity 145,109 112,476 Total liability and stockholders’ equity $ 1,333,667 $ 1,103,712 Net interest income/net interest margin $ 42,517 3.39 % $ 34,739 3.32 %\nINVESTAR HOLDING CORPORATION RECONCILIATION OF NON GAAP FINANCIAL MEASURES (Amounts in thousands, except share data) (Unaudited) December 31, 2017 September 30, 2017 December 31, 2016 Tangible common equity Total stockholders’ equity $ 172,729 $ 152,876 $ 112,757 Adjustments: Goodwill 17,086 11,357 2,684 Core deposit intangible 2,740 1,814 450 Trademark intangible 100 100 100 Tangible common equity $ 152,803 $ 139,605 $ 109,523 Tangible assets Total assets $ 1,622,734 $ 1,476,423 $ 1,158,960 Adjustments: Goodwill 17,086 11,357 2,684 Core deposit intangible 2,740 1,814 450 Trademark intangible 100 100 100 Tangible assets $ 1,602,808 $ 1,463,152 $ 1,155,726 Common shares outstanding 9,514,926 8,704,562 7,101,851 Tangible equity to tangible assets 9.53 % 9.54 % 9.48 % Book value per common share $ 18.15 $ 17.56 $ 15.88 Tangible book value per common share 16.06 16.04 15.42\nINVESTAR HOLDING CORPORATION RECONCILIATION OF NON-GAAP FINANCIAL MEASURES (Amounts in thousands, except share data) (Unaudited) Three months ended December 31, 2017 September 30, 2017 December 31, 2016 Net interest income (a) $ 12,817 $ 11,538 $ 8,781 Provision for loan losses 395 420 375 Net interest income after provision for loan losses 12,422 11,118 8,406 Noninterest income (b) 962 1,167 896 Gain on sale of investment securities, net (50 ) (27 ) (15 ) Loss (gain) on sale of other real estate owned, net 5 (37 ) (2 ) Loss (gain) on sale of fixed assets, net 57 (160 ) (14 ) Gain on sale of loans, net — — (92 ) Core noninterest income (d) 974 943 773 Core earnings before noninterest expense 13,396 12,061 9,179 Total noninterest expense (c) 9,608 9,122 6,603 Acquisition expense (819 ) (824 ) — Core noninterest expense (f) 8,789 8,298 6,603 Core earnings before income tax expense 4,607 3,763 2,576 Core income tax expense (1) 1,462 1,228 811 Core earnings 3,145 2,535 1,765 Core basic earnings per share 0.35 0.29 0.25 Diluted earnings per share (GAAP) $ 0.25 $ 0.24 $ 0.26 Gain on sale of investment securities, net — — — Loss (gain) on sale of other real estate owned, net — — — Loss (gain) on sale of fixed assets, net — (0.01 ) — Gain on sale of loans, net — — (0.01 ) Acquisition expense 0.06 0.06 — One-time charge to income tax expense 0.03 — — Core diluted earnings per share $ 0.34 $ 0.29 $ 0.25 Efficiency ratio (c) / (a+b) 69.73 % 71.80 % 68.23 % Core efficiency ratio (f) / (a+d) 63.73 % 66.49 % 69.11 % Core return on average assets (2) 0.81 % 0.70 % 0.61 % Core return on average equity (2) 7.77 % 6.61 % 6.15 % Total average assets $ 1,534,917 $ 1,437,929 $ 1,147,835 Total average stockholders’ equity 160,485 152,186 113,917 (1) Core income tax expense is calculated using the actual effective tax rate prior to the one-time charge of $0.3 million to tax expense as a result of the Tax Cuts and Jobs Act of 31.7% for the quarter ended December 31, 2017, and the actual effective tax rate of 32.6%, and 31.5% for the quarters ended September 30, 2017, and December 31, 2016, respectively. (2) Core earnings used in calculation. No adjustments were made to average assets or average equity.\nSource:Investar Holding Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/6ebb0e77-c078-4124-bdb0-efc6a942b1a9"], "published": "2018-01-26T03:00:00.000+02:00", "crawled": "2018-01-26T03:39:38.035+02:00", "highlightTitle": ""}