{"organizations": [], "uuid": "1d19365e5eaac1c0aea84f30b3be1f006bda0260", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2016/01/gettyimages-503411558.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/07/nvidia-consumer-video-cards/", "country": "US", "domain_rank": 1196, "title": "Nvidia Bars Using Video Cards In Data Centers – Except for Bitcoin | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.828, "site_type": "news", "published": "2018-01-07T17:40:00.000+02:00", "replies_count": 0, "uuid": "1d19365e5eaac1c0aea84f30b3be1f006bda0260"}, "author": "David Z. Morris", "url": "http://fortune.com/2018/01/07/nvidia-consumer-video-cards/", "ord_in_thread": 0, "title": "Nvidia Bars Using Video Cards In Data Centers – Except for Bitcoin | Fortune", "locations": [], "entities": {"persons": [{"name": "david z. morris", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nvidia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nvidia Bars Use of its Consumer Video Cards in Data Centers – Except for Blockchain Nvidia CEO Jen-Hsun Huang By David Z. Morris 3:40 PM EST \nThe chipmaker Nvidia has altered the terms of service for its GeForce and Titan graphics cards to prohibit their use in data centers, or large-scale commercial or research settings. An exception is included for using the cards for blockchain applications, primarily mining cryptocurrency such as Ethereum. \nThe update, first noted by UK tech site The Register , means organizations running large-scale, intensive applications like artificial intelligence, big data or image recognition will have to invest in the much more expensive cards aimed at data centers. While a high-end GeForce graphics card can cost upwards of $700, enterprise processors like Nvidia’s Tesla V100 run to nearly $10,000. \nNvidia’s change, according to the Register, could present problems for projects that don’t necessarily need the very most powerful processors. The impact on academic research facilities could be particularly acute, but a Nvidia spokesperson told the Register that most academic projects aren’t large enough to fall under their definition of a data center. Further, the spokesperson said Nvidia was willing to “work with” users making off-license use of the cards. \nGet Data Sheet , Fortune’s technology newsletter. \nThe alteration reflects at least a minor tension at the heart of Nvidia’s remarkable corporate evolution. Still best known for high-end graphics cards aimed at PC gamers, Nvidia has been on a sustained diversification push in recent years, with a growing footprint in artificial intelligence , self-driving cars, and, yes, cryptocurrency. \nBut that diversification is rooted in Nvidia’s graphics cards, which have long been powerful enough to be repurposed for other applications. Perhaps most notoriously, graphics cards like the GeForce line have been used in recent years to perform the power-hungry mathematics that secure cryptocurrencies like Ether, leading to surging demand for the cards. \nIn that light, Nvidia’s carving out of an exception for use of their consumer GPUs in cryptocurrency data centers is intriguing. One possible explanation is that, because the cryptocurrency market is widely seen as in the midst of a bubble, Nvidia has not aggressively courted the market and is happy to take short-term card sales. \nThe company has more long-term motivation to push adoption of high-end chipsets for AI and other applications — though the company stated that the motivation for the license change was simply that consumer-grade cards aren’t designed to operate under the hot and demanding conditions of a data center. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-07T17:40:00.000+02:00", "crawled": "2018-01-07T22:45:27.101+02:00", "highlightTitle": ""}