{"organizations": [], "uuid": "611227de47d594034f18dc318dd2c422e71e80c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WW454_0107sa_SOC_20180106105518.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1515411346", "country": "US", "domain_rank": 387, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:35:00.000+02:00", "replies_count": 0, "uuid": "611227de47d594034f18dc318dd2c422e71e80c4"}, "author": "Paul Page", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1515411346", "ord_in_thread": 0, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sign up: With one click, get this newsletter delivered to your inbox .\nParcel-delivery companies are speeding up hiring even as other logistics operators appear be taking a pause in payrolls. The warehousing and storage sector shrank by 4,800 jobs in December, WSJ Logistics Report’s Jennifer Smith writes, a rare pullback in a business that has been bringing on workers at a rapid pace, including 8,000 new jobs in a final push toward the holidays in November. The December numbers could be revised, and it’s unclear whether the decline last month signals a bigger change in the market, difficulty in getting new workers into distribution centers or a one-time break in a market that’s been soaring on e-commerce demand. The couriers that handle those goods added 2,100 jobs last month, but the best signal for the freight market may have been elsewhere. Although the broader U.S. job market added a relatively weak 148,000 jobs, hiring in the construction and manufacturing sectors is surging, potentially promising more shipping in 2018.\nTrucking companies are showing more confidence in future freight demand than ever. North American fleets added 37,500 orders for new heavy-duty trucks in December, finishing off a robust year for truck manufacturers that saw order books for the full year grow 59% after a steep slump in sales in 2016. WSJ Logistics Report’s Erica E. Phillips writes that analysts expect the momentum in orders will continue this year and that 2019, at least according to Stifel, “will be stronger yet.” That’s good news for truck makers that had pulled back production and even laid off workers as orders had waned, and perhaps even better news for retailers and manufacturers that have worried whether trucking companies have the capacity to handle their strengthening demand. Most of the new orders are from big operators looking to replace existing trucks rather than add capacity. But many older vehicles will move to the secondary used market, providing new rigs as long as companies can find drivers to take the wheel.\nApple Inc.’s famously efficient world-wide supply chain is showing signs of fraying. The electronics giant has been missing delivery dates for new products in recent years, and the time between new product announcements and shipments has more than doubled in the six years since Tim Cook became chief executive, from 11 days to 23 days. The delays may be costing Apple a competitive edge in an area where it has long held a distinct advantage. The WSJs Tripp Mickle writes the stretched-out deliveries may give competitors more time to respond to technology innovations and may have cost Apple revenues when it’s missed windows during crucial sales seasons. That’s a surprise for a business held as something of an icon in supply-chain circles for its close management of operations, from handling high-value components from multiple suppliers to distribution to consumers. Competition is raising stresses in the market, however, and Apple and its rivals are straining to match their design and marketing with the physical demands of supply chains.\nSUPPLY CHAIN STRATEGIES Photo: Agence France-Presse/Getty Images The fallout from Hurricane Maria is hitting U.S. medical supply chains hard nearly three months after the storm hit Puerto Rico. The U.S. is facing a nationwide shortage of intravenous bags because production by key suppliers on the island remains crippled, pushing many hospitals to use more time-consuming alternatives and even consider halting elective procedures and clinical trials. The WSJ’s Stephanie Armour and Thomas M. Burton report some hospitals have only a day or two of supplies of saline IV bags at a particularly crucial time when flu cases typically accelerate. The shortage highlights a fragile system behind medical supplies that are fundamental to patient care, and which has seen intermittent supply disruptions even before the hurricane. The situation is worsening because of the painfully slow recovery in Puerto Rico, where production at two Baxter International Inc. plants remains hamstrung. Health officials want regulators to help boost supplies, but that may not happen soon enough to solve the current shortage.\nQUOTABLE\n‘ The freight is coming to us, we’ve got to have the capacity to fulfill it. ’\n—Jason Beardall, president of England Logistics Inc.\nNumber of the Day 5.3% Year-over-year increase in U.S. rail intermodal shipments in December, completing a record year for the container and trailer service, according to the Association of American Railroads.\nIN OTHER NEWS An Iranian tanker collided with a Chinese bulk cargo ship near Shanghai, producing a massive oil spill and fire and leaving dozens missing. (WSJ)\nDifferences in how the Labor Department counts warehouse and store workers may account for recent weak retail hiring figures . (WSJ)\nU.S. imports climbed 2.5% in November while exports increased 2.3% . (WSJ)\nCanada’s economy added a net 78,600 jobs in December as the jobless rate fell to a four-decade low . (WSJ)\nThe U.S. service sector lost momentum for the second consecutive month in December . (WSJ)\nBoeing Co. is in discussions with Embraer SA and Brazil’s government on ways to address concerns about a potential combination of the plane makers . (WSJ)\nCadillac sold more vehicles in China than in the U.S. for the first time last year. (WSJ)\nSales of second-hand cars are rising rapidly in China . (WSJ)\nGerman authorities ordered Amazon.com Inc. to hold back goods from many Chinese merchants for failing to pay sales taxes . (Handelsblatt)\nSolar modules worth more than $150 million are stuck at Indian ports in a dispute over their classification for import duties . (Reuters)\nDevelopers have 4.6 million square feet of warehouse space under construction in a resurgent Houston logistics market . (Houston Chronicle)\nThe Pentagon awarded $228 million in freight and passenger transport contracts to 14 U.S. airlines . (The Loadstar)\nDevelopers are adding seafood processing and storage facilities in Massachusetts as the state sees growing export trade . (Seafood Source)\nPinnacle Foods Inc. named Daniel Poland chief supply chain officer for North America. (Food Business News)\nOhio-based ContainerPort Group Inc. and Alabama-based ASF Transportation Group merged their port-trucking businesses . (American Shipper)\nWashington state authorities are using shipping containers filled with concrete to protect Interstate 82 from rockslides . (Yakima Herald)\nABOUT US Paul Page is deputy editor of WSJ Logistics Report. Follow him at @PaulPage , and follow the entire WSJ Logistics Report team: @brianjbaskin , @jensmithWSJ and @EEPhillips_WSJ . Follow the WSJ Logistics Report on Twitter at @WSJLogistics .\nWrite to Paul Page at paul.page@wsj.com", "external_links": ["https://twitter.com/WSJLogistics?lang=en", "https://theloadstar.co.uk/us-airlines-win-new-military-air-freight-contracts-united-stands-back/", "https://twitter.com/EEPhillips_WSJ?lang=en", "http://www.foodbusinessnews.net/articles/news_home/Business_News/2018/01/Pinnacle_Foods_names_new_chief.aspx", "https://www.seafoodsource.com/news/supply-trade/boston-new-bedford-see-expansion-of-seafood-processing-and-cold-storage-facilities", "http://www.yakimaherald.com/slide/state-officials-launch-new-plan-to-protect-i--near/article_0bdfbf74-f0ca-11e7-b075-f3ab8009513b.html", "https://www.chron.com/business/real-estate/article/Report-4-6M-SF-of-warehouses-are-under-12474664.php", "https://global.handelsblatt.com/finance/germany-cracks-down-on-online-tax-cheats-870953", "https://www.reuters.com/article/india-solar/solar-modules-stuck-at-indian-ports-due-to-import-duty-dispute-idUSL4N1P03IA", "https://www.americanshipper.com/main/asd/containerport-group-merges-with-asf-intermodal-70196.aspx", "https://twitter.com/jensmithWSJ", "https://twitter.com/PaulPage", "https://twitter.com/brianjbaskin?lang=en"], "published": "2018-01-08T14:35:00.000+02:00", "crawled": "2018-01-09T09:41:56.528+02:00", "highlightTitle": ""}