{"organizations": [], "uuid": "4515a95aa6da2c3e42712656ec899559501ae3e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-fski-french/chapuis-feeling-pressure-to-replicate-sochi-success-idUSKBN1EY1HB", "country": "US", "domain_rank": 408, "title": "Chapuis feeling pressure to replicate Sochi success", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:11:00.000+02:00", "replies_count": 0, "uuid": "4515a95aa6da2c3e42712656ec899559501ae3e8"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-fski-french/chapuis-feeling-pressure-to-replicate-sochi-success-idUSKBN1EY1HB", "ord_in_thread": 0, "title": "Chapuis feeling pressure to replicate Sochi success", "locations": [], "entities": {"persons": [{"name": "chapuis", "sentiment": "negative"}, {"name": "terence tchiknavorian", "sentiment": "none"}, {"name": "jean-frederic chapuis", "sentiment": "none"}, {"name": "jack tarrant", "sentiment": "none"}], "locations": [{"name": "sochi", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "montafon", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 1:12 PM / Updated 8 hours ago Chapuis feeling pressure to replicate Sochi success Jack Tarrant 3 Min Read \nLONDON(Reuters) - France swept the podium in the men’s ski cross four years ago in Sochi, with Jean-Frederic Chapuis coming away with the gold, and such is the depth of talent in the country that some are predicting a repeat performance in Pyeongchang. \nSix of the top 20 in the 2017 ski cross rankings were French and with the likes of Terence Tchiknavorian and Francois Place to contend with, Chapuis knows he has no room for error if he is to have any chance of claiming back-to-back Olympic titles. \n“It is a lot of pressure because we are a strong team,” Chapuis told Reuters from the Ski Cross World Cup event in Montafon in December, adding that nine athletes had competed for just four places spots on the team. \nDespite their rivalry, the French team remains very close. Chapuis said having a top class team to compete with in training is imperative for ski cross. \n“The team in ski cross is really important because it is an individual sport but we need the other guys to train with because we have to run 4x4. So if you want to train with other guys then you need a team,” said Chapuis. \nThe French know that with great success comes increased expectation, particularly from a French public eager for further glory in South Korea at the Feb. 9-25 Games. \n“They expect us all to be on the podium,” said Chapuis. \n“They do not realize what we did in Sochi because it was really unbelievable and you have to have luck. Sometimes they don’t realize it was just an awesome day and they think if you have a strong team it is easy to put one, two, three on the podium but it is really hard.” \nSki cross, a relatively new entry into the Olympics after its debut in 2010, has quickly become one of the most popular events at the Games. This is largely due to it being easy for fans to understand and appreciate, as well as being an exciting race that could change at any moment. \nThis unpredictability is great for the viewer but Chapuis knows that a small amount of luck can determine the success of a season, not least at the Olympics. \n“In this sport you have to have a little bit of luck because so many things can happen. In 2014 in Sochi everything went all good and perfect,” said Chapuis. \n“You could be in good shape but then you miss the start and the whole race is out because when you are not in front it is really hard to over-take and you have to take more risks.” \nChapuis is aware the French now have a target on their backs and rivals such as Brady Leman of Canada and Slovenian Filip Flisar will be gunning for them. \n“Everyone wants to be on top and take our place,” he said. \n“For the last three years, the French team was the best so every nation wants to take our place. Second is always looking at first and thinking ‘how can I beat him?'” Editing by Peter Rutherford", "external_links": [], "published": "2018-01-09T15:11:00.000+02:00", "crawled": "2018-01-09T15:22:23.000+02:00", "highlightTitle": ""}