{"organizations": [], "uuid": "5b06f7ce9bd229568ea74e4cd692b0a2fbdd7d18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-901158382.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/bomb-cyclone-retail-sector/", "country": "US", "domain_rank": 1196, "title": "'Bomb Cyclone' Leaves Energy and Retail Sectors Exposed | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-04T13:27:00.000+02:00", "replies_count": 0, "uuid": "5b06f7ce9bd229568ea74e4cd692b0a2fbdd7d18"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/04/bomb-cyclone-retail-sector/", "ord_in_thread": 0, "title": "'Bomb Cyclone' Leaves Energy and Retail Sectors Exposed | Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "east coast", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "energy/utilities  natural", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 11:27 AM EST \nThe worst winter storm yet this season is already hitting the Southeast and expected to sweep the Northeast Thursday, threatening to send electricity prices and natural gas demand even higher, boosting energy stocks. The arctic blast could also serve as a positive for companies that provide deicing salt, as well as car parts retailers that stand to benefit from more weather-related replacements. \nMajority of the sectors in the S&P 500 traded higher, led by gains in energy (+1.5%), information technology (+1%) and health care (+0.9%) while telecommunications (-2.3%) and utilities (-0.8%) lagged. Energy/Utilities \nNatural gas-related stocks and utilities with the most exposure to the East Coast will likely see an impact from the storm as demand for heating rises. While high winds and ice could lead to some downed power lines, electricity prices near their highest levels in years helps to offset downside risks. The cold weather pushed natural gas futures to their highest in a month on Tuesday, though prices have pared gains after rising 16 percent over four days. Natural gas-exposed E&Ps include Southwestern Energy, Range Resources, Ultra Petroleum, and Cabot Oil & Gas. EOG Resources and Pioneer Natural are among the top-performing oil and gas E&Ps Wednesday after positive comments earlier from Citigroup . National Fuel Gas had its largest gain in eight months Tuesday after receiving an upgrade from Sidoti on prospects for higher pricing on the back of record cold weather. East Coast power utilities include Duke, Dominion, NextEra, Consolidated Edison , PPL , Public Service Enterprise Group and Exelon . The cold will likely be a “windfall” for Dominion and NextEra, according to Bloomberg Intelligence analyst Kit Konolige. Also watch Generac Holdings, a provider of portable generators serving residential and commercial markets. Insurance \nCatastrophe losses may be in focus for insurers if the storm is like what was seen in the severe weather events of 2014 and 2015 in the Northeast. Snow is “not especially threatening in itself,” BI analyst Jonathan Adams said, but the dangers are in the “combination of wind and ice.” Potential risks include freezing pipes and downed limbs from ice-related damage, which could boost losses. Insurers to watch include Chubb and Travelers. Industrials \nShares of deicing salt provider Compass Minerals and snowplow maker Douglas Dynamics may gain. On Tuesday, Stifel analyst Paul Forward wrote that the firm’s proprietary gauge shows that snowfall occurrences have begun to accelerate in the companies’ key markets, indicating more upside to 2017-2018 salt sales. Investors should also watch equipment and machinery companies such as Caterpillar and snowmobile maker Arctic Cat. Makers and distributors of heating, ventilation and air conditioning systems may stand to benefit. Companies to watch include Watsco, Lennox International and Ingersoll-Rand. Airlines \nAirlines will most likely experience some service disruptions, delays and cancellations depending on the severity of the storm, with some impact from rescheduled flights spilling over into the weekend. Auto Parts Retailers \nCar parts retailers are poised to benefit as extreme weather conditions damage vehicles and send car owners to stores for repairs and replacement parts. The group underperformed the broader market in 2017 after a mild winter dampened demand and investors worried about the growing threat from e-commerce, especially Amazon . According to Wedbush analyst Seth Basham, the prevailing freezing temperatures are “just what the doctor ordered” for auto parts retailers, adding that a more normal winter season will likely lead to more parts failures as compared to last year, and ultimately above-average industry sales growth. The S&P Supercomposite Automotive Retail Sub Industry Index, a standard gauge for the group, dropped almost 11 percent last year, while the S&P 500 Index rose 19 percent. Retail \nClothing retailers unlikely to be broadly affected. “While the snowstorm can result in store closings and shoppers choosing to stay at home, it’s unlikely to dent 4Q retail sales as it comes in a low-volume sales period,” BI analyst Poonam Goyal says. Burlington Stores , TJX Companies, New York & Co. and Abercrombie & Fitch are among apparel retailers with more than 30 percent of their stores in the states that may be affected by the storm. “Food retailers and mass merchants may get a sales bump from customers stocking up ahead of the storm,” according to BI analyst Jennifer Bartashus. Mass merchants may try to quickly move more winter-weather inventory into affected areas, particularly those unaccustomed to the low temperatures and snow. Ingles Markets has 89 percent of its stores in East Coast states expected to see at least some storm activity, followed by Weis Markets, Target , Wal-Mart , Kroger Healthcare \nThe health-care sector probably won’t be affected over the long term by the winter storm, but hospitals could face some short-term volume pressure if snowstorms extend for more than a few days, similar to what happened with hurricanes in the third quarter, according to BI analyst Jason McGorman. Health insurers at the time didn’t quantify the effect on earnings. The impact should be insignificant for pharmaceutical and biotech companies, BI’s Asthika Goonewardene says, as revenue and inventories shouldn’t be affected. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-04T13:27:00.000+02:00", "crawled": "2018-01-04T19:41:02.043+02:00", "highlightTitle": ""}