{"organizations": [], "uuid": "fdd24317e78f551860e748c6a4980beb2a09a127", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224130073&w=1200&r=LYNXMPEE0L0Z4", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-philippines-duterte/shoot-me-if-i-become-a-dictator-philippine-leader-tells-troops-to-protect-constitution-idUSKBN1FB1CD", "country": "US", "domain_rank": 408, "title": "'Shoot me' if I become a dictator: Philippine leader tells troops to protect constitution", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T13:30:00.000+02:00", "replies_count": 0, "uuid": "fdd24317e78f551860e748c6a4980beb2a09a127"}, "author": "", "url": "https://www.reuters.com/article/us-philippines-duterte/shoot-me-if-i-become-a-dictator-philippine-leader-tells-troops-to-protect-constitution-idUSKBN1FB1CD", "ord_in_thread": 0, "title": "'Shoot me' if I become a dictator: Philippine leader tells troops to protect constitution", "locations": [], "entities": {"persons": [{"name": "duterte", "sentiment": "none"}, {"name": "rodrigo duterte", "sentiment": "none"}], "locations": [{"name": "manila", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 11:32 AM / in an hour 'Shoot me' if I become a dictator: Philippine leader tells troops to protect constitution Reuters Staff 2 Min Read \nMANILA (Reuters) - Philippine President Rodrigo Duterte on Monday instructed the army and police to shoot him if he became a dictator and stayed on beyond his term, a scenario his foes are warning against, amid moves by his loyalists to change the constitution. \nThe firebrand leader sought to dispel speculation he had ordered loyalists in Congress to change the constitution to introduce a federal system that would let him stay in power beyond 2022, when his single term ends. \n“If I overstay and wanted to become a dictator, shoot me, I am not joking,” Duterte told soldiers during an army base visit, adding that security forces should not allow anybody to mess with the constitution. \n“It is your job to protect the constitution and to protect the people. Remember, it is your solemn duty.” \nDuterte has advocated federalism to tackle inequality, empower provinces and recognize the country’s diverse makeup. \nLast week, his lower house allies voted to convene a constituent assembly to revise the charter by May this year, scrapping mid-term elections next year and extending the terms of all elected officials. \nConstitutional reform has been a divisive issue, with critics accusing lawmakers of trying to prolong their stay in office, or of seeking a way for the hugely popular Duterte to cling to power beyond the end of his term. \nOpponents warn it could lead to a repeat of the oppressive rule of late dictator Ferdinand Marcos, saying they are troubled by Duterte’s admiration for Marcos and his similar authoritarian traits. \nDuterte’s spokesman, Harry Roque, has repeatedly said the president has no desire to stay longer than his term and, if anything, would prefer to retire earlier. Reporting by Manuel Mogato; Editing by Martin Petty and Clarence Fernandez", "external_links": [], "published": "2018-01-22T13:30:00.000+02:00", "crawled": "2018-01-22T13:43:55.008+02:00", "highlightTitle": ""}