{"organizations": [], "uuid": "54a7d208708b65345a0ed308322b42298bec5269", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219271579&w=1200&r=LYNXMPEE030H0", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-continental-here/continental-to-take-5-percent-stake-in-mapping-firm-here-idUSKBN1ET0VN", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Continental, Bosch to buy 5 pct stakes in map firm HERE", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T11:57:00.000+02:00", "replies_count": 0, "uuid": "54a7d208708b65345a0ed308322b42298bec5269"}, "author": "", "url": "https://www.reuters.com/article/us-continental-here/continental-to-take-5-percent-stake-in-mapping-firm-here-idUSKBN1ET0VN", "ord_in_thread": 0, "title": "UPDATE 1-Continental, Bosch to buy 5 pct stakes in map firm HERE", "locations": [], "entities": {"persons": [{"name": "bosch", "sentiment": "negative"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "continental", "sentiment": "negative"}, {"name": "daimler", "sentiment": "none"}, {"name": "volkswagen", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "audi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nokia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN/FRANKFURT (Reuters) - Germany’s Continental ( CONG.DE ) and Bosch [ROBG.UL], the world’s largest automotive suppliers, have each bought a 5 percent stake in digital mapping firm HERE, as the industry pools resources with major carmakers to develop self-driving cars.\nGermany’s premium automakers BMW ( BMWG.DE ), Daimler ( DAIGn.DE ) and Volkswagen’s ( VOWG_p.DE ) Audi ( NSUG.DE ) bought HERE for 2.8 billion euros ($3.4 billion) in 2015 from Finnish telecoms group Nokia NOK1V.HE. They now hold 74 percent.\nThe automakers wanted to avoid becoming dependent on third-party mapping providers such as Alphabet’s ( GOOGL.O ) Google, a competitor in the race to develop self-driving cars. Chip maker Intel ( INTC.O ) also holds a 15 percent stake in HERE.\nContinental and privately owned Bosch said separately they wanted to advance their expertise in driver-assistance and other data-based technologies.\nAUTONOMOUS WORLD Carmakers are spending billions on developing electric vehicles and software-based mobility services as tougher emission rules, a shift toward shared mobility and connectivity are transforming the auto industry.\n“Our vision for HERE is to enable an autonomous world for everyone,” said HERE Chief Executive Edzard Overbeek. “To achieve this you need strong partners that complement each other in different areas.”\nContinental said it would sign a collaboration agreement with Dutch HERE and also seek to jointly develop a high-definition live map for autonomous cars.\nSoftware and electronics products are the biggest drivers of growth at Hanover-based Continental which also makes fuel-injection systems and vehicle tyres. It plans to boost total sales to more than 50 billion euros by 2020 from 40.5 billion in 2016.\n“By leveraging HERE’s technology, we look forward to generating further profitable growth in mobility services and automated driving,” Chief Executive Elmar Degenhart said.\nContinental shares were up 0.7 percent at 231.30 euros at 1308 GMT.\nA spokesman for Amsterdam-based HERE, which employs 8,000 staff in 54 countries, said it was possible that more investors will buy into the company in which Japanese electronics firm Pioneer ( 6773.T ) has a stake of less than one percent.\nA group of investors led by Chinese mapping firm Navinfo ( 002405.SZ ) and internet giant Tencent ( 0700.HK ) had to abandon a plan in September to buy 10 percent of HERE, after failing to win U.S. approval.\nBosch’s statement on Thursday referred to plans by HERE to increase its diversification into non-automotive applications - a move that could help to offset risks surrounding the eventual arrival of fully autonomous cars for the mass market.\n“Bosch is more than cars,” Chief Executive Volkmar Denner said in the statement.\nHe said the company saw synergies with data-based services for smart homes and smart cities - terms broadly describing the use of technology to find efficiencies everywhere from the factory floor to road traffic management.\nBoth Bosch and Conti said they had agreed not to disclose how much they were paying for their stakes.\nEditing by Maria Sheahan and Elaine Hardcastle\n ", "external_links": [], "published": "2018-01-04T11:57:00.000+02:00", "crawled": "2018-01-04T12:13:36.021+02:00", "highlightTitle": ""}