{"organizations": [], "uuid": "07512ab2a28f28f40ccbd35fb05ca7e40b88201d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104865167-CNBC_Andy_Jassy_Reinvent_interview_2017.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/amazon-aws-and-nvidia-hiring-health-vc-schmoozers.html", "country": "US", "domain_rank": 767, "title": "Amazon AWS and Nvidia hiring health VC schmoozers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:53:00.000+02:00", "replies_count": 0, "uuid": "07512ab2a28f28f40ccbd35fb05ca7e40b88201d"}, "author": "Christina Farr", "url": "https://www.cnbc.com/2018/01/19/amazon-aws-and-nvidia-hiring-health-vc-schmoozers.html", "ord_in_thread": 0, "title": "Amazon AWS and Nvidia hiring health VC schmoozers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "amazon aws", "sentiment": "negative"}, {"name": "nvidia", "sentiment": "negative"}, {"name": "amazon web services", "sentiment": "neutral"}, {"name": "venrock", "sentiment": "none"}, {"name": "aws", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Networking with health-care venture capitalists is now a full-time job.\nAmazon Web Services and Nvidia have job openings for folks who can network with health investors from the elite firms.\nIn Nvidia's case , that means funds like Venrock, which it specifically mentions. The AWS listing doesn't name-check any firms in its job listing, in favor of letting its future hire identify \"appropriate VCs to target.\"\nThe idea behind these hires seems to be to build up relationships with investors and their portfolio companies, so they make an early decision to buy AI chips and services from Nvidia or AWS over others. Switching costs at a later stage in the companies' life cycle are labor-intensive and expensive.\nThe idea isn't new: Big tech companies have been networking with VC firms and start-up accelerator programs for years.\nBut the health-care angle is interesting because traditional tech firms haven't typically paid much attention to health.\n\"What's different today is that they (tech) recognize that health care is roughly a fifth of the GDP and they need a specific strategy to grow quickly in this sector,\" said Venkat Mocherla, who runs business development at Qventus, a health start-up that uses artificial intelligence tools to speed up hospital operations.\nA.I. is hot Bringing AI tools to health care is a particularly hot area.\nNvidia's strategic business development lead for health care would work from the company's AI start-up program, which it describes as cultivating \"dedicated and extraordinary start-ups who are revolutionizing industries.\" It's looking for a health-care expert with a strong grasp of the inner workings of pharma and health information systems.\nGenomics companies are rich targets for big tech beause they generate a massive amount of data. For that reason, Alphabet has a team called Google Genomics dedicated to the space, and Amazon made a strategic investment in Grail, a company that mines genetic information for early signs of cancer.\nVenrock health investor Bob Kocher said by phone that he is not shocked that companies are looking to network with his team.\n\"It is certainly true that many large companies reach out to us to work with our portfolio companies and let us know why we should be early adopters,\" he said. Venrock has backed health companies ranging from Castlight to Juno Therapeutics.\nKocher said companies like Apple , Alphabet and Amazon are realizing that these companies have strong growth potential and are on the market for new technology tools.\n\"Health care is a data-intensive business,\" he said.\nHe also has some advice for applicants to these jobs.\n\"I like two pumps of vanilla in my latte,\" he joked.", "external_links": [], "published": "2018-01-19T15:53:00.000+02:00", "crawled": "2018-01-19T16:26:41.021+02:00", "highlightTitle": ""}