{"organizations": [], "uuid": "a54db16cdbe74c3606c0052b6362a2e50ce3c509", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/08/104698378-GettyImages-843894906.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/homeland-security-chief-deporting-dreamers-not-top-priority.html", "country": "US", "domain_rank": 767, "title": "Homeland Security chief: Deporting 'Dreamers' not top priority", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.131, "site_type": "news", "published": "2018-01-16T18:00:00.000+02:00", "replies_count": 0, "uuid": "a54db16cdbe74c3606c0052b6362a2e50ce3c509"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/16/homeland-security-chief-deporting-dreamers-not-top-priority.html", "ord_in_thread": 0, "title": "Homeland Security chief: Deporting 'Dreamers' not top priority", "locations": [], "entities": {"persons": [{"name": "kirstjen nielsen", "sentiment": "none"}, {"name": "nielsen", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "queens", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "immigration homeland security", "sentiment": "negative"}, {"name": "homeland security", "sentiment": "negative"}, {"name": "cbs news", "sentiment": "none"}, {"name": "u.s. department of homeland security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration Homeland Security chief: Deporting 'Dreamers' not top priority Deporting immigrants who came to the U.S. illegally as children will not be a priority, even if the Deferred Action for Childhood Arrivals (DACA) program is cancelled, said U.S. Department of Homeland Security chief Kirstjen Nielsen. \"If you are a DACA that's compliant with your registration - meaning you haven't committed a crime and you in fact are registered - you are not a priority of enforcement for ICE should the program end,\" Nielsen said. Published 1 Min Ago SHARES Getty Images Immigrants' rights demonstrators march in protest of President Trump's decision on DACA on September 7, 2017 in the Queens borough of New York City. \nDeporting immigrants who came to the United States illegally as children will not be a top federal law enforcement priority even if lawmakers do not pass a program to protect them, the U.S. Department of Homeland Security chief said in an interview aired on Tuesday. \nKirstjen Nielsen, speaking ahead of a congressional hearing, told CBS News that as long as so-called Dreamers have registered with federal authorities they will not be a top target even after U.S. President Donald Trump moved to cancel the Deferred Action for Childhood Arrivals (DACA) program. \n\"It's not going to be a priority of the Immigration and Customs Enforcement,\" she said. \"If you are a DACA that's compliant with your registration—meaning you haven't committed a crime and you in fact are registered—you are not a priority of enforcement for ICE should the program end.\" \nAlthough federal officials have said they will not target Dreamers, Trump has significantly expanded the categories of people who can be prioritized for deportation and immigrant advocates say DACA recipients who lose their status are at risk. \nNielsen's comments come as Trump and lawmakers battle over an immigration deal that has blown up amid Trump's controversial remarks at a recent White House meeting. The talks also overshadow larger spending negotiations ahead of a possible federal government shutdown this week. \nNielsen is set to appear before the Senate Judiciary Committee at 10 a.m. to discuss oversight of the Department of Homeland Security. Joshua Roberts | Reuters Kirstjen Nielsen testifies to the Senate Homeland Security and Governmental Affairs Committee on her nomination to be secretary of the Department of Homeland Security (DHS) in Washington, November 8, 2017. \nNielsen, referring to a forthcoming DHS study on immigration and terrorism, said she would ask lawmakers for help \"to close the loopholes that prevent us from removing known suspected terrorists and other criminals from the United States.\" \nThe report also shows officials must \"continue to enhance our screening and vetting\" as well as \"continually vet those who are here,\" including legal permanent residents and others who were naturalized, she said. \nAsked if that meant such individuals would be under permanent surveillance, Nielsen give no details but said: \"Up until the point that you are a citizen, we want to continue to make sure we understand who you are and why you're here.\" \nNielsen is likely to be asked about Trump's remarks at last week's meeting where Democratic U.S. Senator Dick Durbin said the president made disparaging remarks about immigrants from Haiti and African countries. Nielsen told CBS she did not remember or hear the controversial words used. \nTrump has said that Durbin, who will be at Tuesday's hearing, misrepresented his comments. ", "external_links": [], "published": "2018-01-16T18:00:00.000+02:00", "crawled": "2018-01-16T18:02:11.095+02:00", "highlightTitle": ""}