{"organizations": [], "uuid": "3c5e0b79e36c77403501eb106c8e9842fa27ab9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-simon-treacy-joins-the-howard-hughes-corporationa-to-lead-continued-growth-of-ward-villagea.html", "country": "US", "domain_rank": 767, "title": "Simon Treacy Joins The Howard Hughes Corporation® to Lead Continued Growth of Ward Village®", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.99, "site_type": "news", "published": "2018-01-05T15:30:00.000+02:00", "replies_count": 0, "uuid": "3c5e0b79e36c77403501eb106c8e9842fa27ab9b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-simon-treacy-joins-the-howard-hughes-corporationa-to-lead-continued-growth-of-ward-villagea.html", "ord_in_thread": 0, "title": "Simon Treacy Joins The Howard Hughes Corporation® to Lead Continued Growth of Ward Village®", "locations": [], "entities": {"persons": [{"name": "simon treacy", "sentiment": "negative"}, {"name": "treacy", "sentiment": "none"}], "locations": [{"name": "oversee honolulu", "sentiment": "none"}, {"name": "ward village", "sentiment": "none"}, {"name": "honolulu", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "hawai’i", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "howard hughes corporation", "sentiment": "negative"}, {"name": "premier urban community", "sentiment": "negative"}, {"name": "hhc", "sentiment": "none"}, {"name": "hughes corporation", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "architectural digest", "sentiment": "none"}, {"name": "business wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Seasoned Executive to Oversee Honolulu’s Premier Urban Community\nHONOLULU--(BUSINESS WIRE)-- The Howard Hughes Corporation ® (NYSE: HHC) announced today that Simon Treacy has joined the company as President, Hawai’i. In this position, Mr. Treacy will be leading the development, sales and operations of Ward Village ®, the acclaimed 60-acre master planned community recently named “Best Planned Community in the US” by Architectural Digest. Since beginning sales in 2014, Ward Village has sold more than 1,300 homes. At full build-out, the community will consist of more than 4,500 residences and approximately one million square feet of retail space.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180105005231/en/\nSimon Treacy, President, Hawai’i. The Howard Hughes Corporation, Ward Village (Photo: Business Wire)\nMr. Treacy has 20 years of global real estate experience across Asia, Europe and the US. He has lived in Australia, Singapore, Thailand, Hong Kong, Japan, and China, and spent the past four years in New York as BlackRock Real Estate’s Managing Director, Global Chief Investment Officer and Head of US Equity. Prior to BlackRock, Mr. Treacy was a Founding Shareholder and Global CEO of MGPA, which was acquired by BlackRock in 2013, and had $14 billion of funds under management in Asia and Europe. Mr. Treacy is also a global governing trustee in ULI and a leader in urban planning and land use.\n“With his long and successful track record in real estate and urban planning, Simon is a tremendous addition to our senior team and well positioned to steer Ward Village as it continues to come to life as one of the leading urban master plans in the world,” said David R. Weinreb, Chief Executive Officer of The Howard Hughes Corporation. “I am particularly pleased to have found a dynamic executive like Simon, who already calls Honolulu home, and who brings a variety of skill sets and experiences that can complement our existing deep bench of talent at Ward Village.”\n“My family and I made the decision to move from the mainland to this beautiful and special place last year for personal reasons; I am excited that the opportunity presented itself to join this dynamic company which is transforming Oahu’s urban core,” said Simon Treacy. “I am looking forward to listening, learning, and finding the right ways to be of service in the community as I share my experiences and lead the continued development of Ward Village.”\nMr. Treacy is taking the helm at Ward Village as the community celebrates several recent milestones, including the successful delivery of Anaha®—the second mixed-use residential building in the community. Ward Village has also reached a near sellout of the first collection of homes from its four towers either delivered or under construction— Waiea® , Anaha , Ae`o® , and Ke Kilohana —whose contracted sales have collectively exceeded 93 percent of available homes. Most recently, the launch of sales at ‘A‘ali‘i expanded the selection of residences at Ward Village with the introduction of innovative smart-living homes. The strong market demand for new housing in Honolulu and the desire for an urban, walkable lifestyle have made Ward Village a sought-after destination for home buyers. The momentum is expected to continue to build throughout the coming years; openings slated for 2018 include the state’s largest Whole Foods Market, as well as the first O’ahu location of the acclaimed restaurant Merriman’s.\nAs the largest LEED-ND Platinum certified master plan development in the country and the only one in Hawaiʻi, Ward Village is at the forefront of sustainable community development, featuring public amenities at a scale not offered by any other urban development in the state.\nAbout Ward Village®\nBeing developed by The Howard Hughes Corporation®, Ward Village is a 60-acre coastal master-planned community in the heart of Honolulu located between downtown and Waikīkī in the Kaka'ako district. Ward Village is at the forefront of sustainable community development, integrating significant architecture, local culture, and public space. New tree-lined sidewalks and bike lanes provide access to an over 100-acre public beach park and the Kewalo Harbor. Since beginning sales in 2014, Ward Village has sold more than 1,300 homes. At full build-out, the community will consist of more than 4,500 residences and approximately one million square feet of retail space.\nWard Village includes four mixed-use residential towers—Waiea®, Anaha®, Ae`o®, and Ke Kilohana—that are transforming the popular shopping and dining district into a vibrant neighborhood that offers ocean views and a thoughtfully curated mix of retail experiences set among walkable open spaces. The most recently approved building, ‘A‘ali‘i, will continue to expand the selection of new homes at Ward Village and sit at the top of the Central Plaza, which will serve as a key public gathering and activation space for the community. Art and culture play an integral role at Ward Village, which was the home of the inaugural Honolulu Biennial in 2017. Public art is highlighted throughout the neighborhood, including large-scale wall murals, sculptures and locally-inspired exhibits.\nWard Village is Hawai‘i’s only LEED-ND Platinum-Certified project and is the largest neighborhood development in the country to receive such a prestigious certification. For more information, visit www.wardvillage.com .\nAbout The Howard Hughes Corporation®\nThe Howard Hughes Corporation owns, manages and develops commercial, residential and mixed-use real estate throughout the U.S. Its award-winning assets include the country’s preeminent portfolio of master planned communities, as well operating properties and development opportunities including: The Seaport District NYC in New York; Columbia, Maryland; The Woodlands®, The Woodlands Hills, and Bridgeland® in the Greater Houston, Texas area; Summerlin®, Las Vegas; and Ward Village® in Honolulu, Hawaiʻi. The Howard Hughes Corporation’s portfolio is strategically positioned to meet and accelerate development based on market demand, resulting in one of the strongest real estate platforms in the country. Dedicated to innovative placemaking, the company is recognized for its ongoing commitment to design excellence and to the cultural life of its communities. The Howard Hughes Corporation is traded on the New York Stock Exchange as HHC. For additional information visit www.howardhughes.com .\nSafe Harbor Statement\nStatements made in this press release that are not historical facts, including statements accompanied by words such as “will,” “believe,” “expect,” “enables,” “realize,” “plan,” “intend,” “assume,” “transform” and other words of similar expression, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are based on management’s expectations, estimates, assumptions, and projections as of the date of this release and are not guarantees of future performance. Actual results may differ materially from those expressed or im", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.wardvillage.com%2F&esheet=51738411&newsitemid=20180105005231&lan=en-US&anchor=Ward+Village&index=2&md5=d608462b83f9a5d67bb4c97ec02fbbc4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.howardhughes.com%2F&esheet=51738411&newsitemid=20180105005231&lan=en-US&anchor=www.howardhughes.com&index=9&md5=1c79de1062547afb434ab2265fa84242", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwaieawardvillage.com%2F&esheet=51738411&newsitemid=20180105005231&lan=en-US&anchor=Waiea%C2%AE&index=3&md5=42d38001612f7a9c9b614aad1c4bc10e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.wardvillage.com%2F&esheet=51738411&newsitemid=20180105005231&lan=en-US&anchor=www.wardvillage.com&index=8&md5=3b22930ec275056680b075fedba3f60e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.howardhughes.com%2F&esheet=51738411&newsitemid=20180105005231&lan=en-US&anchor=The+Howard+Hughes+Corporation&index=1&md5=5907ca5abbdc146fa9d900811b529036", "http://www.businesswire.com/news/home/20180105005231/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fkekilohana.com%2F&esheet=51738411&newsitemid=20180105005231&lan=en-US&anchor=Ke+Kilohana&index=6&md5=e747dd757c27901bb1fc9ad3327afaf9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.wardvillage.com%2Faeo%2F&esheet=51738411&newsitemid=20180105005231&lan=en-US&anchor=Ae%60o%C2%AE&index=5&md5=d037bae4ee7b3e8836332d8cca1eb333", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.aaliiwardvillage.com%2F&esheet=51738411&newsitemid=20180105005231&lan=en-US&anchor=%E2%80%98A%E2%80%98ali%E2%80%98i&index=7&md5=5d4d4e696bc9384a1bb8d4f928479db7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fanahawardvillage.com%2F&esheet=51738411&newsitemid=20180105005231&lan=en-US&anchor=Anaha&index=4&md5=de17d4a2f1c4592f72746804cfefc23b"], "published": "2018-01-05T15:30:00.000+02:00", "crawled": "2018-01-05T18:03:07.014+02:00", "highlightTitle": ""}