{"organizations": [], "uuid": "ccf7dd2e37332a8627aa2edf56b2d87194506600", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/10", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-dpw-holdingsa-subsidiary-super-crypto-mining-to-launch-cloud-mining.html", "country": "US", "domain_rank": 767, "title": "DPW Holdings’ Subsidiary, Super Crypto Mining to Launch Cloud Mining", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:45:00.000+02:00", "replies_count": 0, "uuid": "ccf7dd2e37332a8627aa2edf56b2d87194506600"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-dpw-holdingsa-subsidiary-super-crypto-mining-to-launch-cloud-mining.html", "ord_in_thread": 0, "title": "DPW Holdings’ Subsidiary, Super Crypto Mining to Launch Cloud Mining", "locations": [], "entities": {"persons": [{"name": "flexisphere", "sentiment": "none"}], "locations": [{"name": "fremont", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "flexisphere", "sentiment": "none"}], "organizations": [{"name": "dpw holdings", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "dpw holdings, inc.", "sentiment": "neutral"}, {"name": "super crypto mining", "sentiment": "none"}, {"name": "dpw", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Supercrypto Mining\nFREMONT, Calif., Jan. 31, 2018 (GLOBE NEWSWIRE) -- DPW Holdings, Inc. (NYSE American: DPW) (\" DPW \" or the \" Company \"), a diversified holding company, announced today it has entered into an agreement to acquire the operations of Flexisphere, http://www.flexisphere.com/ , an IT managed services provider that will work with Super Crypto Mining, DPW’s wholly owned subsidiary, to leverage its curated blockchain and cloud mining technology and expertise. Flexisphere’s client base ranges from small to medium businesses (“SMB”) and large firms that seek expertise for desktop, network, and other distributed services as well as programming, web/online asset development and cloud computing. Flexisphere is expected to be a majority-controlled subsidiary of DPW and will be available to provide a host of services including supporting Super Crypto Mining’s development of an online cloud mining platform for consumers interested in purchasing hash-rate for as low as $250.00. The cloud mining platform will feature a comprehensive dashboard readily providing historical and real-time operational data to its subscribers. In conjunction with these developments, the Company has prompted Super Crypto Mining to appoint Darren Magot as its CEO.\nFlexisphere is led by its President, CEO and Founder, Thomas Saleh, a leading entrepreneur in the computer industry for more than three decades. Mr. Saleh has founded seven successful high-technology companies, and influenced the success of several more. His first company, Applied Logic, an early provider of Managed Hosting Services, was acquired by Raytheon in 1980. He next founded XNET, which built the first fully automated financial futures and commodities exchange (INTEX) in Bermuda. XNET was acquired by the International Futures and Commodities Exchange in 1984. From there Mr. Saleh’s accomplishments have varied, but include his tenure from 2007 to 2009 at the FASB where, at the request of the president of the Financial Accounting Foundation and the Chairman of the SEC, Mr. Saleh served as the CTO and led the development of the USGAP XBRL “Intelligent Data” project. Mr. Saleh’s research on Policy Driven Security and Cloud Computing technologies led to the formation of FlexiSphere, a company specifically focused on delivering highly managed and ultra-secure turnkey computing to selected verticals including financial services, legal and transportation. Mr. Saleh has served as a strategic consultant and senior adviser to the NASDAQ, the NYSE, the FASB and Safeway Supermarkets among others. He has served as a director of 6 venture-backed companies and advises several private equity funds.\n“We are excited about the appointment of Darren Magot as the CEO of Super Crypto Mining. Mr. Magot brings decades of experience with identifying consumer tastes and trends to drive many successful marketing plans and programs that maximized client revenues against stern competition. We believe Mr. Magot has the critical expertise to navigate Super Crypto Mining’s future through the rapidly evolving crypto space. We expect him to lead Super Crypto Mining in accomplishing multiple goals including the deployment of over 10,000 crypto miners, the establishment of multiple data centers and mining co-locations that operate efficiently and effectively to launching our latest initiative, cloud based mining so consumers can readily participate by purchasing hash-rate at an affordable level,” said Milton “Todd” Ault III, the Company’s CEO and Chairman. Mr. Ault continued, “We are committed to supporting Super Crypto and all its projects as we execute on our highly profitable long-term strategies. We see the anticipated acquisition of Flexisphere as in integral part of our long-term strategy. We look forward to having Flexisphere and its very talented team of experts lead by Mr. Saleh join the DPW family. Mr. Saleh brings a wealth of experience, proficiency and knowledge that can benefit all DPW. We also look forward to Super Crypto Mining working with Flexisphere and Mr. Saleh in the short-term to develop an innovative cloud mining platform.”\nMr. Magot has over 30 years of experience in business development, financial management and sales management with both private and public companies leading teams and projects of various sizes. For the last 5 years, Mr. Magot has been focused on the innovation of new technology and products with some of the largest Fortune 500 companies in the world. The Company selected Mr. Magot since he possessed the best skill set to create a team that can support the aggressive growth opportunities within the Super Crypto family brands. Mr. Magot has a Finance Degree from California State University in Chico. Mr. Magot is the featured guest speaker who will update attendees along with the Company’s CEO and Chairman on both the current and future activities and initiatives of Super Crypto Mining during the 1-hour webinar on January 31, 2018 starting at 5:00pm EST. To participate attendees must individually register prior to the webinar using this link, DPW Webinar .\nThe Company reminds everyone that the presentation for the webinar will be made public through the filing with the SEC of an 8-K report prior to the webinar on Wednesday afternoon. Shareholders, investors and the public are encouraged to review the presentation prior to the webinar as it will be posted at www.DPWHoldings.com . The Company will make available, after the webinar, a video recording for those who could not attend as well as for anyone else. The video will be posted along the side of the posted presentation in the coming days with a link sent to all registered participants.\nABOUT DPW HOLDINGS, INC.\nHeadquartered in Fremont, CA, DPW Holdings, Inc., www.DPWHoldings.com , is a diversified holding company that, through its wholly owned subsidiary, Coolisys Technologies, Inc., is dedicated to providing world-class technology-based solutions where innovation is the main driver for mission-critical applications and lifesaving services. Coolisys’ growth strategy targets core markets that are characterized by “high barriers to entry” and include specialized products and services not likely to be commoditized. Coolisys through its portfolio companies develops and manufactures cutting-edge resonant switching power topologies, specialized complex high-frequency radio frequency (RF) and microwave detector-log video amplifiers, very high-frequency filters and naval power conversion and distribution equipment. Coolisys services the defense, aerospace, medical and industrial sectors and manages four entities including Digital Power Corporation, www.DigiPwr.com , a leading manufacturer based in Northern California, 1-877-634-0982; Digital Power Limited dba Gresham Power Ltd., www.GreshamPower.com , a manufacturer based in Salisbury, UK; Microphase Corporation, www.MicroPhase.com with its headquarters in Shelton, CT 1- 203-866-8000; and Power-Plus Technical Distributors, www.Power-Plus.com , a wholesale distributor based in Sonora, CA 1-800-963-0066.\nDigital Power Lending, LLC, www.DigitalPowerLending.com , a wholly owned subsidiary of the Company, is based in Fremont, CA, and is a California private lending company dedicated to strategically providing capital to small and middle size businesses for an equity interest in addition to loan fees and interest. Super Crypto Mining, Inc. www.SuperCryptoMining.com is a wholly-owned subsidiary of the Company, is based in Fremont CA that leverages its engineering expertise and existing locations to create crypto currency mining facilities across the globe Super Crypto Mining operates the branded division, Super Crypto Power, www.SuperCryptoPower.com . Excelo, LLC, www.Excelo.com , a wholly-owned subsidiary of the Company, is a national search firm specializing in fulfilling strategic executive, professional and hi-tech placements for businesses delivering world-class services. DPW Holdings, Inc.’s headquarters is located at 48430 Lakeview Blvd., Fremont, California, 94538; 1-877-634-0982. For Investor inquiries: IR@DPWHoldings.com or 1-888-753-2235.\nForward-Looking Statements\nThe foregoing release contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements regarding the acquisition and the ability to consummate the acquisition. These forward-looking statements generally include statements that are predictive in nature and depend upon or refer to future events or conditions, and include words such as “believes,” “plans,” “anticipates,” “projects,” “estimates,” “expects,” “intends,” “strategy,” “future,” “opportunity,” “may,” “will,” “should,” “could,” “potential,” or similar expressions. Statements that are not historical facts are forward-looking statements. Forward-looking statements are based on current beliefs and assumptions that are subject to risks and uncertainties. Forward-looking statements speak only as of the date they are made, and the Company undertakes no obligation to update any of them publicly in light of new information or future events. Actual results could differ materially from those contained in any forward-looking statement as a result of various factors. More information, including potential risk factors, that could affect the Company’s business and financial results are included in the Company’s filings with the U.S. Securities and Exchange Commission, including, but not limited to, the Company’s Forms 10-K, 10-Q and 8-K. All filings are available at www.sec.gov and on the Company’s website at www.DPWHoldings.com .\n###\nSource:DPW Holdings, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=4jJsLtCpZdMiyjHevv3IrQ4xbih9FCsHPT2SroTwZTU2hQS2xPCbcL5sJTaLcPQiuHqa-jiuYdBdCIO2VrNVgXyPbX-snkst6OgATMCD4eU=", "https://www.globenewswire.com/Tracker?data=Ln_NDaX2e3wFEGYh4hK1ZMMllrTH-YLvyMFWlhpErqVgRgJTsk0OZxO09EmSjkQD7GZObDHYAq_AXmttPoS1rrErComigWMg2Ol2vYsV6OntazzdySemvZZnMg14PaY6", "https://www.globenewswire.com/Tracker?data=6VTpQsb7FvNyDXn7yybekSAI7fn2Efkdsy9kpJmn1s0TAY0QR3LGJB7zT9ZNKm-LG97LX1X_-f2u7gip5y_bQa3lmfvhsJn1vc8Q9YHep_8=", "https://www.globenewswire.com/Tracker?data=4jJsLtCpZdMiyjHevv3IrX4aaodejy8H_jS-uIZil0IIlE6vSOXLcUdneg5YR_UK9wsdiV-DvMIpVjrPYurKE-CgF4_K8IDzVd4PaWPB_No=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/c8026e3e-8ca5-4fdd-aa76-2962f9d51ddc", "https://www.globenewswire.com/Tracker?data=O749D0NJixFNS8HbUdKuZvk_vzlqz5X8vDCGOD3GrAEV6NMwrnz4T0W9aZy-ZaFvxJPkje7KYHO1l8P9PcI4VQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/196a1b04-58ee-4264-8afa-beafae992487/en", "https://www.globenewswire.com/Tracker?data=Ig9ITHASHfet6rG8sKNbqEltdQKvtbs0IAWOJvYB413pAMgTuhrIWxuEdRZ3dDphuSHAjYz192XAO-NfgtMQdg==", "https://www.globenewswire.com/Tracker?data=rOMhe_A3oGHNmgBpfh4njyy4O7GYyvsMNnsHI48cU8HhNSsABqY0nTTl_YTJbL0KOM6bUtK4iDdpJOQBz8W8v7wuddQzxhIQA6bmAQgMKa8=", "https://www.globenewswire.com/Tracker?data=GFSCdGMmI3FwDoEOmSOuVzWDgnIAM0ZrwwFfq61sE-vsO0yAEwmRGizaTjfn2kc2I4CMNWM4ZDOseSsYBc8vhrfrX-UZnbeam1xHUwjJgiyejorKVKSmUg1dpo8Bvucf", "http://www.flexisphere.com/", "https://www.globenewswire.com/Tracker?data=GFSCdGMmI3FwDoEOmSOuV9BkuFSq8gM4OsepyxPAzLxCT3NjWLmSC0FHCtCmOj2YYLBTP8U_mowQ-yE0_88b5A==", "https://www.globenewswire.com/Tracker?data=WkugAaapcKC3d4EjOmOK-6LXkQWF3A8SHsBnU3_RfQrGu-ZkrDjwq_LYBdHwtsCEGvYT1UqZO-BS6uztZ83mE39nrxNMukgxRs8FHu7lMSI=", "https://www.globenewswire.com/Tracker?data=2uYr1l1ufp_n-6y_chNX4ccbectEWqkUYZH1bh8OYh1_lYTZf1LqFJdh7_YZtCsy8wXnCDK_IZSm5vsE9rgZB_McBbHFy3uUgXgJ8l_HOf4=", "https://www.globenewswire.com/Tracker?data=a3ZUgkBNYd6aRt1mXbz0bBTY6jBwffUzg5ojMB6BdkpsIcUm_WJqwT_OzcOffaV5Pb5DEa8svQue65wcnCQGuAA_VsqvXpk3C9pRC-lYZVE=", "https://www.globenewswire.com/Tracker?data=Wo9E_KyixomFvh0ar7q6KZyNe5gCZlRYlwwMmuARxk8ghXf0qr8tiNnFdZRZWI-DZotiQKGAg_izNx4X2NS25qwoFhRLxxE2e_0KZcMpCxI=", "https://www.globenewswire.com/Tracker?data=4jJsLtCpZdMiyjHevv3Irc9VGZBuduA4Nzvy5FRuRYbkrK8IKaI_lLiHiRsmbXIRlesPJzbgN0gB7vR67EpT0CZgd3EtB0PEnYf1yBTBg9U="], "published": "2018-01-31T14:45:00.000+02:00", "crawled": "2018-01-31T17:48:57.012+02:00", "highlightTitle": ""}