{"organizations": [], "uuid": "3558359516a1bde6492b43eb13f0899ec902ee9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-pure-industrial-real-estate-trust-enters-into-definitive-agreement-to-be-acquired-by-blackstone-for-8-point-10-in-cash-per.html", "country": "US", "domain_rank": 767, "title": "Pure Industrial Real Estate Trust enters into definitive agreement to be acquired by Blackstone for $8.10 in cash per unit in a $3.8 billion transaction", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:00:00.000+02:00", "replies_count": 0, "uuid": "3558359516a1bde6492b43eb13f0899ec902ee9d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-pure-industrial-real-estate-trust-enters-into-definitive-agreement-to-be-acquired-by-blackstone-for-8-point-10-in-cash-per.html", "ord_in_thread": 0, "title": "Pure Industrial Real Estate Trust enters into definitive agreement to be acquired by Blackstone for $8.10 in cash per unit in a $3.8 billion transaction", "locations": [], "entities": {"persons": [{"name": "rick turner", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "pure industrial real estate trust", "sentiment": "neutral"}, {"name": "blackstone", "sentiment": "neutral"}, {"name": "board of trustees", "sentiment": "none"}, {"name": "piret", "sentiment": "none"}, {"name": "special committee", "sentiment": "none"}, {"name": "tsx", "sentiment": "none"}, {"name": "blackstone property partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, Jan. 9, 2018 /PRNewswire/ - Pure Industrial Real Estate Trust (TSX: AAR.UN) (\"PIRET\" or the \"Trust\") announced today that it has entered into an arrangement agreement (the \"Arrangement Agreement\") with an affiliate of Blackstone Property Partners (\"Blackstone\"), pursuant to which Blackstone will acquire all of the outstanding trust units of PIRET (each, a \"Unit\") for $8.10 per Unit in an all-cash transaction valued at $3.8 billion including debt (the \"Transaction\").\nThe Transaction price of $8.10 per Unit represents a 21% premium to the closing price of PIRET Units on the TSX on January 8, 2018, the last trading day prior to the announcement of the Transaction, a 22% premium to PIRET's 30-day volume-weighted average Unit price on the TSX for the period ending January 8, 2018 and a 27% premium to the current research consensus Net Asset Value estimate of $6.40 per Unit.\nCommenting on the Transaction, Rick Turner, Chairman of PIRET's Board of Trustees (the \"Board of Trustees\") and Chairman of the Special Committee of independent Trustees (the \"Special Committee\") formed to supervise the negotiation of the Transaction said: \"The Trust has accomplished tremendous growth in the ten years since the initial public offering in August 2007. Since inception, we have generated a total return in excess of 345% and we have built a platform that has made us a leader in the Canadian industrial REIT space. The Board of Trustees believes that the all-cash Transaction provides significant value for our Unitholders and unanimously recommends that they vote in favour of the Transaction.\"\n\"I am extremely proud of my team's accomplishments over the past several years,\" added Kevan Gorrie President and CEO of the Trust. \"Blackstone is a highly reputable and strategic owner and one of the world's most active investors in logistics real estate. We look forward to further building out our platform.\"\n\"We are excited to be acquiring PIRET, one of the premier Canadian industrial REITs, as a continuation of our global strategy to acquire high-quality logistics assets in key urban markets. The management team has done an excellent job building the portfolio and we look forward to working together going forward,\" said Tyler Henritze, Head of North America Acquisitions for Blackstone Real Estate.\nBlackstone will be making this investment through Blackstone Property Partners (\"BPP\"), its Core+ real estate investment unit. BPP targets substantially stabilized office, industrial, multifamily and retail assets.\nThe Transaction has the unanimous support of the Special Committee, as well as the full Board of Trustees of PIRET. The Board of Trustees, after receiving the unanimous recommendation of the Special Committee and in consultation with its financial and legal advisors, has unanimously determined that the Transaction is in the best interests of PIRET and fair to Unitholders and is unanimously recommending that Unitholders vote in favour of the Transaction.\nTRANSACTION DETAILS\nThe Transaction is structured as a statutory plan of arrangement under the British Columbia Business Corporations Act. Completion of the Transaction, which is expected to occur in the second quarter of this year, is subject to customary conditions, including approval of at least 66 2/3% of the votes cast by Unitholders at a special meeting of Unitholders, court approval and regulatory approvals (Canadian Competition Act and Investment Canada Act).\nThe Trust will continue to pay its normal monthly distributions in the ordinary course, consistent with past practice through closing of the Transaction.\nThe Arrangement Agreement provides for, among other things, customary representations, warranties and covenants, including customary non-solicitation covenants from PIRET and a \"fiduciary out\" that allows the Board of Trustees to accept a superior proposal in certain circumstances, subject to a \"right to match\" in favour of Blackstone and payment of a $77 million termination fee to Blackstone. In certain circumstances, Blackstone is required to pay a $220 million break fee to PIRET upon the termination of the Arrangement Agreement.\nThe foregoing summary is qualified in its entirety by the provisions of the Arrangement Agreement, a copy of which will be filed on SEDAR at www.sedar.com . The Trust will mail a management information circular and certain related documents to Unitholders in connection with the meeting to consider and vote on the Transaction, copies of which will be filed on SEDAR at www.sedar.com . All references to $ above are to Canadian dollars.\nAdvisors\nBMO Capital Markets is acting as financial advisor to PIRET and has provided the Special Committee and the Board of Trustees with a fairness opinion in respect of the Transaction. Goodmans LLP is acting as legal counsel to PIRET in connection with the Transaction. Greenhill & Co. has provided the Special Committee and the Board of Trustees with a fairness opinion in respect of the Transaction.\nRBC Capital Markets and Citigroup are acting as financial advisors to Blackstone. Osler, Hoskin & Harcourt LLP and Simpson Thacher & Bartlett LLP are acting as legal counsel to Blackstone.\nABOUT PURE INDUSTRIAL REAL ESTATE TRUST\nPIRET is an unincorporated, open-ended investment trust that owns and operates a diversified portfolio of income-producing industrial properties in leading markets across Canada and key distribution and logistics markets in the United States. The Trust is an internally managed REIT and is one of the largest publicly-traded REITs in Canada that offers investors exposure to industrial real estate assets in Canada and the United States.\nAdditional information about the Trust is available at www.piret.ca or www.sedar.com .\nABOUT BLACKSTONE\nBlackstone is a global leader in real estate investing. Blackstone's real estate business was founded in 1991 and has approximately US$111 billion in investor capital under management. Blackstone's real estate portfolio includes hotel, office, retail, industrial and residential properties in the US, Europe, Asia and Latin America. Major holdings include Hilton Worldwide, Invitation Homes (single family homes), Logicor (pan-European logistics) and prime office buildings in the world's major cities. Blackstone real estate also operates one of the leading real estate finance platforms, including management of the publicly traded Blackstone Mortgage Trust.\nFORWARD-LOOKING INFORMATION\nCertain statements contained in this news release may constitute forward-looking information within the meaning of applicable Canadian securities laws. Forward-looking information is often, but not always, identified by the use of words such as \"anticipate\", \"plan\", \"expect\", \"may\", \"will\", \"intend\", \"should\", and similar expressions. This information involves known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such forward-looking information. Forward looking information in this news release includes, but is not limited to, the following: statements with respect to the expected completion of the Transaction, the anticipated benefits to the Unitholders, satisfaction of the conditions required with respect thereto and the payment of monthly distributions prior to closing. There can be no assurance that the proposed Transaction will be completed, or that it will be completed on the terms and conditions co", "external_links": [], "published": "2018-01-09T16:00:00.000+02:00", "crawled": "2018-01-09T17:52:52.001+02:00", "highlightTitle": ""}