{"organizations": [], "uuid": "a55da46b121804061c92a54f6d96ea0747282cb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/15/104902022-GettyImages-891987196.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/star-wars-meghan-markle-total-eclipse-drove-sales-on-ebay-in-2017.html", "country": "US", "domain_rank": 767, "title": "Star Wars, Meghan Markle, total eclipse drove sales on eBay in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.081, "site_type": "news", "published": "2018-01-08T17:20:00.000+02:00", "replies_count": 0, "uuid": "a55da46b121804061c92a54f6d96ea0747282cb4"}, "author": "Sarah Berger", "url": "https://www.cnbc.com/2018/01/08/star-wars-meghan-markle-total-eclipse-drove-sales-on-ebay-in-2017.html", "ord_in_thread": 0, "title": "Star Wars, Meghan Markle, total eclipse drove sales on eBay in 2017", "locations": [], "entities": {"persons": [{"name": "meghan markle", "sentiment": "negative"}, {"name": "harry", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "markle", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "ebay", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What mattered most to people in 2017? If you take a look at their receipts, you'll get a pretty good idea.\nEBay recently released its \" Top Shopped \" report, revealing 2017 sales data from its marketplace and highlighting some pretty interesting trends.\nShoppers on the site leaned in to the major pop culture moments of 2017 — including a passion for the \"Star Wars\" franchise , this past summer's total solar eclipse and a renewed royals fever.\nPop culture moments reflected in purchasing patterns The report reveals that two months before the Dec. 15 release of the latest installment in the \"Star Wars\" saga, \"Episode VIII, The Last Jedi,\" there were over 450,000 Star Wars items bought on eBay.\nShoppers weren't only interested in a galaxy far, far away, but also what was happening right across the pond. After the first outing of newly-engaged Prince Harry and Meghan Markle on Nov. 27, shoppers were already taking style cues from Markle, who was wearing a white belted wrap coat. EBay says in the weeks following the couple's debut, more than 13 white coats were purchased every hour on the site.\nLast year, politics also played a role in the purchasing behavior of consumers, with eBay selling 43,000 pieces of apparel featuring political and feminist slogans, the report notes, along with 24,000 women's pantsuits and 2,000 \"Nasty Woman\" shirts.\nAnother phenomenon of 2017 that is reflected in people's purchasing patterns: The total solar eclipse. In the month prior to the Aug. 21 event, eBay says there were 133,500 protective glasses, 19,000 tents and 10,500 pairs of binoculars purchased.\nPhoto by VCG Solar eclipse watchers in New York City. The total solar eclipse was also pretty expensive for people offline: Some hotel rooms in prime viewing locations were charging $1,500 a night, CNBC Make It previously reported.\nTrends that took hold in 2017 In 2017, throwback trends were also thrust into the spotlight.\nLast year, over 57,000 fanny packs and 25,000 Champion sweatshirts were purchased on eBay, according to the report, along with 107,000 pairs of Adidas Superstar sneakers.\nNostalgic toy purchases were a hot commodity as well, with 500,000 Super Nintendo gaming systems purchased, and 16,600 Tamagotchi toys scooped up. There was also a 24 percent increase in vinyl record sales on the e-commerce site, compared to 2016, with nearly 10,000 vinyl records purchased daily.\nBut, shoppers were brought back to the future when it came to tech. 2017 was a big year for devices that help turn houses into \"smarter\" homes: eBay reports over 211,000 Nest devices were bought, followed by 58,000 iRobot Roombas. Since it came out in mid-October, eBay says almost 240 Google Home Minis were purchased daily.\nLast year was also a big year for all things rainbow. Remember Starbucks' sugar-infused unicorn Frappuccinos and Instagram influencers' penchant for showing off their multi-colored bagels? The trend took hold on eBay too: According to the report, shoppers bought nearly 70,000 unicorn phone cases, 56,000 unicorn costumes, along with 57,500 \"mermaid makeup brushes.\"\nThe report looked at data based on U.S. sold items that included key terms in the listing title across all categories from Jan. 1 to Dec. 19, 2017, as well as data from that same time frame in 2016, in order to show year-over-year comparison. EBays' \"Top Shopped\" picks were, \"culled from trends, themes, and items pertaining to pop culture phenomena across multiple categories,\" the report reads.\nDon't miss: You might be spending twice as much money as you think you are online shopping\nshow chapters The online shopping revolution is facing revolution 11:15 AM ET Wed, 20 Dec 2017 | 06:06 Like this story? Like CNBC Make It on Facebook !", "external_links": [], "published": "2018-01-08T17:20:00.000+02:00", "crawled": "2018-01-08T17:21:09.005+02:00", "highlightTitle": ""}