{"organizations": [], "uuid": "f47e77b35fc25dcf78cfe7fe12d2ca65330f85da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/07/104391724-GettyImages-498732342.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/10001147/device/rss/rss.html", "section_title": "Business", "url": "https://www.cnbc.com/2018/01/12/walmarts-bumpy-day-from-wage-increase-to-store-closings.html", "country": "US", "domain_rank": 767, "title": "Walmart’s Bumpy Day: From Wage Increase to Store Closings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T14:26:00.000+02:00", "replies_count": 0, "uuid": "f47e77b35fc25dcf78cfe7fe12d2ca65330f85da"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/12/walmarts-bumpy-day-from-wage-increase-to-store-closings.html", "ord_in_thread": 0, "title": "Walmart’s Bumpy Day: From Wage Increase to Store Closings", "locations": [], "entities": {"persons": [{"name": "paul d.", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "walmart", "sentiment": "negative"}, {"name": "store closings walmart", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Walmart , the nation's largest private employer, waded into the bumpy waters of partisan politics on Thursday, announcing that it will use some of its savings under the new tax bill to provide wage increases, bonuses and expanded benefits to its hourly workers.\nThe giant retailer, which faces stiff competition for qualified workers in a tight labor market and pressure from unions to increase wages, said it would raise its minimum starting wage to $11 an hour, from $9. It will also expand maternity and family leave benefits, and give bonuses of up to $1,000 to eligible employees.\nBy tying its pay increases to the tax break it expects to receive, as other large companies have done in recent weeks, Walmart provided support for claims by the Trump administration and Republicans in Congress that the new tax law will benefit not just the wealthy but also working-class Americans.\nMore from The New York Times:\nWalmart's Minor Act of Redistribution\nThe Numbers Behind Walmart's Pay Raise\nState's Push Back After Net Neutrality Repeal \n\"This law is helping improve people's lives,\" Speaker Paul D. Ryan , Republican of Wisconsin, said in a tweet on Thursday, citing Walmart's actions.\nPaul Ryan tweet \nBut within hours, Walmart had undercut its triumphal message when news leaked that it was closing 63 of its Sam's Club stores. Sam's Club, a retail chain offering memberships, was soon trending on Twitter, and labor groups and Senate Democrats seized on the news to question Walmart's motives and criticize the tax bill as failing to protect low-wage workers.\nThe United Food and Commercial Workers International Union, which hopes to represent Walmart's nonunionized work force, called the wage increase a \"public relations stunt\" meant to distract from the closings.\nSenate Democrats, citing the closings and a $20 billion stock buyback announced last fall, said in a statement: \"The real response of companies like Walmart to the Republican tax bill has been to ensure that its already high-paid executives and wealthy shareholders reap the overwhelming benefit, leaving thousands of workers standing in the cold without jobs.\"\nWith more than one million hourly workers in the United States, Walmart is a bellwether for compensation in low-wage industry. By citing the new tax plan as an impetus for better wages and benefits, the retailer was bound to become a lightning rod in a fiercely ideological debate.\n\"They snatched defeat from the jaws of victory,\" Scott Galloway, a professor of marketing at New York University's Stern School of Business, said in an interview. \"Walmart made a smart move in increasing wages and investing in human capital. Where they screwed up was politicizing it.\"\nSince President Trump signed the tax law last month, a number of large companies — including AT&T , Southwest Airlines and Wells Fargo — have said they were using the savings to help their employees. On Thursday, Fiat Chrysler Automobiles announced that it would give a $2,000 bonus to 60,000 hourly and salaried employees.\n\"It is only proper that our employees share in the savings generated by tax reform,\" Sergio Marchionne, the company's chief executive, said in a statement.\nWalmart, which is the country's single largest corporate taxpayer, said in a statement Thursday that it was still determining how much it would save as a result of the new law.\nMatt Gardner, a senior fellow at the Institute on Taxation and Economic Policy, a nonprofit research group, said it was difficult to forecast precisely how much Walmart would save. But based on the company's average annual United States earnings over the past five years, he said, savings from the cut in the corporate tax rate alone could be roughly $2.2 billion a year, or 40 percent. He said the figure could be higher or lower depending on tax breaks the company might be losing, or new advantages in the treatment of capital investments and other provisions.\nWalmart said the wage increases and bonuses would cost the company roughly $700 million.\n\"Tax reform gives us the opportunity to be more competitive globally and to accelerate plans for the U.S.,\" Walmart's chief executive, Doug McMillon, said in a statement.\nStill, many economists are skeptical that the tax cut will have a meaningful impact on wages. In an economic research memo released on Thursday, Goldman Sachs wrote that \"we expect no significant short-term effect of tax reform on\" average hourly earnings.\nGoldman predicted that, to the extent that the tax bill would drive up pay, it would do so over time, partly by stimulating the economy and forcing employers to pay more as they competed for workers.\nWalmart started the day with a celebratory message, with its early-morning announcement about wage and benefit enhancements. Even some critics were impressed with some of Walmart's changes — particularly in expanding maternity and parental leave.\nFull-time hourly employees will receive 10 weeks of maternity leave and six weeks of paid parental leave. Those workers previously received up to eight weeks of maternity leave at half-pay, and were not entitled to parental leave.\nThe expanded leave benefits are particularly significant, putting shelf-stockers and cashiers on the same footing as many white-collar, college-educated workers across corporate America.\nOur Walmart, a labor group, said in a statement that action on wage increases and maternity leave was a \"substantial step, but still falls short of what all Walmart employees need to be able to provide for our families.\" Target, a competitor, raised its starting wage to $11 an hour last fall.\nIn addition to competing for workers, Walmart is trying to improve customer service in its roughly 4,700 stores around the United States, some of which have been criticized for being untidy in the past.\nAnalysts said the higher wages could also help Walmart burnish its public image as it battled Amazon for online sales.\n\"Amazon has been viewed as a good citizen,\" said Burt P. Flickinger III, managing director of Strategic Resource Group, a retail consulting firm. \"Walmart has been viewed as a bad citizen who is getting better.\"\nBy Thursday afternoon, though, Walmart was dealing with a backlash over the closing of about 10 percent of its Sam's Club stores. The retailer said it had planned to inform its thousands of employees first and then announce it. But customers showed up at stores only to find them closed and began posting the news on social media.\nThere were also reports that workers showed up for work and were informed that their stores were closed.\nWalmart said it was planning to close about 50 Sam's Club stores across the country and retrofit about a dozen others into e-commerce fulfillment centers. It was unclear how many workers will lose their jobs, because the company said it was trying to find the displaced employees jobs at other Sam's Club stores.\n\"There is no easy way to communicate to a group of people that their facility is closing,\" John Furner, president and chief executive of Sam's Club, sai", "external_links": ["https://www.nytimes.com/2018/01/11/business/dealbook/south-korea-bitcoin.html", "https://www.nytimes.com/2018/01/11/business/dealbook/walmart-wage-increase.html", "https://www.nytimes.com/2018/01/11/technology/net-neutrality-states.html", "https://twitter.com/SpeakerRyan/status/951474587526664192"], "published": "2018-01-12T14:26:00.000+02:00", "crawled": "2018-01-12T13:45:41.030+02:00", "highlightTitle": ""}