{"organizations": [], "uuid": "35643ef993f97d1fce676f9a38d05b0ee482ef36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-hooper-holmes-appoints-marc-salois-as-chief-revenue-officer.html", "country": "US", "domain_rank": 767, "title": "Hooper Holmes Appoints Marc Salois as Chief Revenue Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:00:00.000+02:00", "replies_count": 0, "uuid": "35643ef993f97d1fce676f9a38d05b0ee482ef36"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-hooper-holmes-appoints-marc-salois-as-chief-revenue-officer.html", "ord_in_thread": 0, "title": "Hooper Holmes Appoints Marc Salois as Chief Revenue Officer", "locations": [], "entities": {"persons": [{"name": "hooper holmes appoints marc salois", "sentiment": "negative"}, {"name": "salois", "sentiment": "none"}, {"name": "marc", "sentiment": "none"}, {"name": "mark clermont", "sentiment": "none"}, {"name": "hooper holmes", "sentiment": "none"}, {"name": "henry dubois", "sentiment": "none"}, {"name": "marc salois", "sentiment": "none"}], "locations": [{"name": "olathe", "sentiment": "none"}, {"name": "kan.", "sentiment": "none"}], "organizations": [{"name": "hooper holmes, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OLATHE, Kan., Jan. 11, 2018 (GLOBE NEWSWIRE) -- Hooper Holmes, Inc. (OTCQX:HPHW), the nation’s largest publicly-traded pure-play health and well-being solutions provider, announced today that Marc Salois has been named chief revenue officer. Salois is a highly experienced sales executive with a history of building cultures of sales and expanding into new markets. In his most recent role, Salois’ team achieved double-digit growth for three consecutive years.\n\"Marc brings an outstanding track record of business development to Hooper Holmes. He has strong knowledge of the industry, expertise in building successful sales teams, and proven ability to increase revenue,” said Henry Dubois, CEO of Hooper Holmes.\n“This has been an exciting year for Hooper Holmes, as we have seen our organization continue to evolve. Marc brings a wealth of executive experience to our team, and will be an important strategic voice. We look forward to his insight and leadership,” said President Mark Clermont.\nSalois brings more than 15 years of sales leadership experience to the company. Most recently, he was vice president of Enterprise Sales, East, at Omada Health, where he was responsible for sales, implementation, and account management teams in the Eastern US. Omada is a digital health company whose mission is to enable people to live free of chronic disease. Prior to that, Salois was vice president of sales at meQuilibrium, vice president of sales at HighRoads, and is currently an advisor at Harvard Innovation Labs.\n“Joining Hooper Holmes at this point in its growth is a tremendous opportunity. The company has strong customer loyalty, high participant satisfaction, and a large and growing list of customers who are industry leaders across North America,” said Salois. “Hooper Holmes is in an excellent position in an expanding market. I am delighted to join such a well-respected company that has great customers, best-of-breed partners, a first-class leadership team, and employees who are truly committed to helping people be their best selves.”\nSalois has a Bachelor of Science degree in Medical Technology from the University of Massachusetts.\nAbout Hooper Holmes\nHooper Holmes, Inc. is a leader in workplace wellness and clinical research support services. The company mobilizes a national network of health professionals to provide on-site health screenings, laboratory testing, risk assessment and sample collection services to wellness and disease management companies, employers and brokers, government organizations and academic institutions nationwide. Provant, a wholly-owned subsidiary of Hooper Holmes, Inc., is a leader in comprehensive workplace well-being solutions with a growing, global presence. Provant partners with employers and brokers to improve member health and productivity and support healthcare cost management. Provant touches millions of lives by delivering customized well-being strategies and services on-site, telephonically and digitally, utilizing advanced data management technology.\nFor further information:\nHooper Holmes/Provant\nElaine Peterson\nSenior Director, Marketing & Communications\n(401) 234-0165\nSource: Hooper Holmes, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c7ce4fba-38bd-4ec9-9628-387e2ca1f5e3"], "published": "2018-01-11T16:00:00.000+02:00", "crawled": "2018-01-11T19:37:09.017+02:00", "highlightTitle": ""}