{"organizations": [], "uuid": "47573d87edeb54449bb5796b35217957ea7c08b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 34, "shares": 34, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/05/05/101642740-20130429-0814-125.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/10/cramer-remix-dominos-pizza-proves-stock-picking-a-winning-strategy.html", "country": "US", "domain_rank": 767, "title": "Cramer Remix: Domino’s Pizza proves stock-picking a winning strategy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-11T01:59:00.000+02:00", "replies_count": 0, "uuid": "47573d87edeb54449bb5796b35217957ea7c08b6"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/10/cramer-remix-dominos-pizza-proves-stock-picking-a-winning-strategy.html", "ord_in_thread": 0, "title": "Cramer Remix: Domino’s Pizza proves stock-picking a winning strategy", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "negative"}, {"name": "doyle", "sentiment": "none"}, {"name": "patrick doyle", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "10 Hours Ago | 01:19 \nCNBC's Jim Cramer may be a big fan of index funds — one of his best-known mantras is that investors should have $10,000 in an index fund before they start stock-picking — but he doesn't think they should control the entire market. \nYet the \" Mad Money \" host has watch the power of the major averages grow as individual companies fade into the background of the bull market. \n\"Even as recently as a few years ago, individual stocks mattered: a bad quarter from a big-name company could hurt the whole market. Now it doesn't even seem to create a ripple in its own sector, at least not if the group has some momentum,\" Cramer said. \nSo Cramer decided to push back after interviewing Domino's Pizza CEO Patrick Doyle, one of the market's most trusted executives that announced his departure from the company on Tuesday. \nInvestors would have earned much more if they had chosen the stock of Domino's over the averages; since Doyle became CEO in 2010, it has gone from $10 a share to just over $200. \n\"The next time someone tells you that active money management is strictly for boneheads and anyone with a brain puts all of their money in index funds, ... I want you to remember the story we heard from Domino's Pizza earlier in tonight's show. That stock has gone from $10 to $200 because of one person,\" Cramer said. \"I want you to try getting that kind of win from an index fund. I dare you.\" Back up, bears Keren Su | Getty Images Tourists watching the bull statue in front of the Stock Exchange on the Bund, Pudong skyline in the distance, Shanghai, China. \nAs stocks fell on Wednesday on a report that China is considering slowing down or even stopping its purchases of U.S. sovereign debt, Cramer gave the bears a warning. \n\"Logically, you can't be worried about one thing and then suddenly freak out when the opposite happens. It's totally lacking in rigor, but it happens all the time around here, and that's what threw us off today,\" he said. \nCramer was referencing a high-profile narrative: scores of market commentators have been worried about a flattening yield curve , which many see as a precursor to recession. \nWithout a meaningful inflection in the yield curve, short-term Treasury returns almost equal the returns for long-term Treasurys. Paired with a too-abrupt rise in interest rates, that could curb demand for loans, putting a damper on the broader economy. \n\"But here's the thing: if China comes into the market and starts dumping longer-term Treasurys, we won't have a flat yield curve anymore,\" Cramer said. \"Long-term rates will go higher, and bears lose their big thesis propping up the idea that a recession's right around the corner.\" Domino's Pizza CEO talks departure Scott Mlyn | CNBC Patrick Doyle, Domino's Pizza \nDomino's Pizza CEO Patrick Doyle could not be more at peace with his recently announced departure . \n\"I accomplished the goals that I had set out for myself when I took over in 2010,\" Doyle said in an interview with Cramer. \"We've got an amazing team in place, and so I would not leave unless I was confident that this business was going to do even better going forward.\" \nDoyle confessed that he always thought he would be at Domino's for 10 years. Instead, he will clock out at eight and a half years at the end of June, passing the CEO role to Richard Allison, the president of Domino's International. \n\"There's a rhythm to these things, and this is the right time to do it,\" Doyle said, adding that he \"couldn't be more thrilled\" about Allison taking over. \"I'll run hard until the end of June, take the back half of the year off and figure out what I'm going to do next.\" Off the charts: Gaming stocks to rally higher Philippe Lopez | AFP | Getty Images A man walks past an ad for the Grand Theft Auto V video game in Hong Kong. \nBooming Nintendo Switch sales have put video game stocks back on Cramer's mind, so he turned to the charts to see what 2018 could have in store for the gaming names. \n\"There's a whole generation of people out there who can't remember a world without Nintendo, and many of them are now old enough to spend meaningful chunks of their bucks on their hobbies,\" the \"Mad Money\" host said. \"Plus, the technology just keeps getting better and better, including the chips that it's run on, making games more and more alluring for couch-bound millennials.\" \nSo Cramer enlisted technician Rob Moreno, his RealMoney.com colleague and the publisher of RightViewTrading.com, to help him take a closer look at the space. Tableau Software CEO on 'breakthrough technology' Scott Mlyn | CNBC Adam Selipsky, CEO, Tableau Software \nTableau Software's newest data engine technology Hyper, which can process data much faster than the industry standard, will change how companies make top-level decisions, CEO Adam Selipsky told CNBC. \n\"Hyper lets you bring in data into Tableau five times faster than before, lets you perform queries or analyze data in Tableau up to three times faster than before and just lets you bring in much, much larger data sets so you can perform analysis that was, in many cases, impractical before,\" Selipsky told Cramer on Wednesday. \nCalling Hyper \"a breakthrough technology,\" Selipsky stressed its business benefits: if companies can ingest and analyze massive swaths of data faster, they'll be more inclined to update their information more regularly. \n\"I think really what it's going to allow people to do is analyze fresher data. So before, when things took a longer time to load in, bigger data sets, longer to analyze, people would just refresh their data less often,\" the CEO said. \"You've got all this ... data coming in, and if it's stale, you're making decisions based on old data. If you can make up-to-date decisions, you will make better decisions, and I think that's really the potential for improving businesses with Hyper and Tableau.\" Lightning Round: Where's the LUV love? \nIn Cramer's lightning round , he shared his take on some callers' favorite stocks: \nSouthwest Airlines Co. : \"I sold it for the charitable trust, and I've got to tell you, I thought I was so smart making the 10-15 percent, [but] this one goes still higher. Somebody downgraded it yesterday. It was shameful.\" \nFrontier Communications Corp. : \"I just don't like the balance sheet. I'm not going to get in there and say, 'Listen, the chart's getting a little better.' I would scale out on any strength. The greatest thing about some stocks is that they do stop at zero. But I do think that Frontier is in trouble. Very troubled company.\" \nQuestions for Cramer?", "external_links": [], "published": "2018-01-11T01:59:00.000+02:00", "crawled": "2018-01-11T01:59:58.009+02:00", "highlightTitle": ""}