{"organizations": [], "uuid": "51cc5e419d2f699f1686d5b276ed58376b60c3e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-grupo-aeroportuario-del-pacifico-announces-guidance-for-full-year-2018.html", "country": "US", "domain_rank": 767, "title": "Grupo Aeroportuario Del Pacifico Announces Guidance for Full Year 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:36:00.000+02:00", "replies_count": 0, "uuid": "51cc5e419d2f699f1686d5b276ed58376b60c3e8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-grupo-aeroportuario-del-pacifico-announces-guidance-for-full-year-2018.html", "ord_in_thread": 0, "title": "Grupo Aeroportuario Del Pacifico Announces Guidance for Full Year 2018", "locations": [], "entities": {"persons": [{"name": "grupo aeroportuario del pacífico", "sentiment": "negative"}], "locations": [{"name": "guadalajara", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "grupo aeroportuario del pacifico", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GUADALAJARA, Mexico--(BUSINESS WIRE)-- Grupo Aeroportuario del Pacífico, S.A.B. de C.V. (NYSE:PAC) (BMV:GAP) (“the Company” or “GAP”) announced today its guidance for the full year 2018.\nTraffic 8% +- 1% Aeronautical Revenue 12% +- 1% Non-aeronautical Revenue 16% +- 1% Total Revenue 13% +- 1% EBITDA 11% +- 1% EBITDA Margin 69% +- 1% CAPEX Ps. 2.6 billion Passenger traffic projections are based on the consolidation of routes developed to date, estimates for occupancy load factors, projections for increases in frequencies and number of seats offered by the airlines. Revenue increases are based on traffic performance, applicable passenger fees, contract terms and current commercial agreements, as well as the development of other activities. The increase in cost of services reflects operating requirements needed to meet higher airport service demand, infrastructure expansions and service quality improvements, as well as the hiring of additional personnel for the operations, maintenance, security and cleaning departments. CAPEX for GAP’s airports in Mexico will reach approximately Ps. 1.8 billion, of which around Ps. 1.0 billion will be allocated towards the Master Development Program, about Ps. 600 million will be for investments to be executed this year which were postponed in 2017 and will provide higher operational capacity, while approximately Ps. 200 million will be allocated towards commercial investments. Investments at the Montego Bay airport in Jamaica under the Capital Development Program will reach Ps. 800 million.[BEGIN TEXT BOX]\nThese figures are based on the Company’s current expectations for domestic and international aeronautical industry growth in 2018, supported by GAP’s medium- and long-term strategy and business fundamentals.\nThese figures are estimates based on current assumptions that the Company’s management believes are reasonable. Many of the factors affecting these assumptions and the estimates on which they are based are outside of the Company’s control and are subject to change over the course of the year based on various external factors including, but not limited to, airline performance, domestic and international economic conditions and government regulations. Please refer to GAP’s annual report on Form 20-F for the year ended December 31, 2016, published in 2017, for a more extensive list of factors that could affect traffic, revenues and expenses.\nNote: EBITDA (earnings before interest expense, income taxes, depreciation and amortization) is not a standardized measure of performance or financial condition under the accounting principles contained in International Financial Reporting Standards (“IFRS”). This measure is not comparable to measures used by other entities.\nCompany Description:\nGrupo Aeroportuario del Pacífico, S.A.B. de C.V. (GAP) operates 12 airports throughout Mexico’s Pacific region, including the major cities of Guadalajara and Tijuana, the four tourist destinations of Puerto Vallarta, Los Cabos, La Paz and Manzanillo, and six other mid-sized cities: Hermosillo, Guanajuato, Morelia, Aguascalientes, Mexicali and Los Mochis. In February 2006, GAP’s shares were listed on the New York Stock Exchange under the ticker symbol “PAC” and on the Mexican Stock Exchange under the ticker symbol “GAP”. In April 2015 GAP acquired 100% of Desarrollo de Concesiones Aeroportuarias, S.L., which owns a majority stake of MBJ Airports Limited, a company operating the Sangster International Airport in Montego Bay, Jamaica.\nThis press release may contain . These statements are not historical facts, and are based on management’s current view and estimates of future economic circumstances, industry conditions, company performance and financial results. The words “anticipates,” “believes,” “estimates,” “expects,” “plans” and similar expressions, as they relate to the company, are intended to identify . Statements regarding the declaration or payment of dividends, the implementation of principal operating and financing strategies and capital expenditure plans, the direction of future operations and the factors or trends affecting financial conditions, liquidity or results of operations are examples of . Such statements reflect the current views of management and are subject to a number of risks and uncertainties. There is no guarantee that the expected events, trends or results will actually occur. The statements are based on many assumptions and factors, including general economic and market conditions, industry conditions, and operating factors. Any changes in such assumptions or factors could cause actual results to differ materially from current expectations.\nIn accordance with Section 806 of the Sarbanes-Oxley Act of 2002 and article 42 of the “Ley del Mercado de Valores”, GAP has implemented a “ whistleblower ” program, which allows complainants to anonymously and confidentially report suspected activities that may involve criminal conduct or violations. The telephone number in Mexico, facilitated by a third party that is in charge of collecting these complaints, is 01-800-563-0047. The web site is http://www.lineadedenuncia.com/gap . GAP’s Audit Committee will be notified of all complaints for immediate investigation.\nFor more information please visit www.aeropuertosgap.com.mx\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005976/en/\nIn México\nGrupo Aeroportuario del Pacífico, S.A.B. de C.V.\nSaúl Villarreal García, Chief Financial Officer\nPaulina Sánchez, Investor Relations Officer\nTel: 01 (33) 38801100 ext 20151\nsvillarreal@aeropuertosgap.com.mx\npsanchez@aeropuertosgap.com.mx\nor\nIn the U.S.\ni-advize Corporate Communications\nMaria Barona\nTel: 212 406 3691/94\ngap@i-advize.com\nSource: Grupo Aeroportuario del Pacífico, S.A.B. de C.V.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lineadedenuncia.com%2Fgap&esheet=51743395&newsitemid=20180116005976&lan=en-US&anchor=http%3A%2F%2Fwww.lineadedenuncia.com%2Fgap&index=1&md5=3a2487787d4b2bd83f5e07b6d3fab27f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.aeropuertosgap.com.mx&esheet=51743395&newsitemid=20180116005976&lan=en-US&anchor=www.aeropuertosgap.com.mx&index=2&md5=e4ab85d0dff12a9056eda097ccfee27a", "http://www.lineadedenuncia.com/gap", "http://www.businesswire.com/news/home/20180116005976/en/"], "published": "2018-01-16T14:36:00.000+02:00", "crawled": "2018-01-16T17:08:53.000+02:00", "highlightTitle": ""}