{"organizations": [], "uuid": "7081b17feb778cc7f14fd34df3c02d165a61a42a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-bill-varner-joins-novetta-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Bill Varner Joins Novetta Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:28:00.000+02:00", "replies_count": 0, "uuid": "7081b17feb778cc7f14fd34df3c02d165a61a42a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-bill-varner-joins-novetta-board-of-directors.html", "ord_in_thread": 0, "title": "Bill Varner Joins Novetta Board of Directors", "locations": [], "entities": {"persons": [{"name": "bill varner", "sentiment": "negative"}, {"name": "tom rabaut", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "varner", "sentiment": "none"}, {"name": "tiffanny gates", "sentiment": "none"}, {"name": "novetta", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "mclean", "sentiment": "none"}, {"name": "novetta", "sentiment": "none"}], "organizations": [{"name": "mantech", "sentiment": "none"}, {"name": "intelligence solutions group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MCLEAN, Va., Jan. 29, 2018 /PRNewswire/ -- Novetta, a leader in advanced analytics technology, today announced the appointment of Bill Varner - former president of ManTech's Mission, Cyber, and Intelligence Solutions Group - to its Board of Directors.\nMr. Varner brings 40 years of intelligence and defense industry experience, including cyber security, specialized system engineering, operations and mission support, enterprise IT, and full-service security support.\n\"Bill is a respected executive in the national security space, and his background aligns with our position as a leader in delivering advanced, technology-enabled services to the national security community. We are excited to welcome him to our Board of Directors,\" said Tiffanny Gates, Novetta's CEO. \"We will greatly benefit from his deep knowledge of the industry as well as his proven successes in M&A and long-term growth.\"\n\"We are delighted to be working with such an outstanding leader,\" said Tom Rabaut, Novetta's Chairman. \"I'm confident that Bill is going to make an important and positive impact on Novetta as we meet the emerging demands of the national security community and stay focused on our mission.\"\n\"I am honored to be joining the Board of Directors of Novetta and to be associated with an innovative leader in technology delivery to the national security community,\" said Mr. Varner. \"I look forward to helping the leadership team continue to grow and scale strategically.\"\nPrior to ManTech, Mr. Varner was Vice President of Intelligence Operations for Northrop Grumman TASC, delivering innovative technical solutions and operations support to the defense and intelligence communities. Mr. Varner currently serves on the Board of Directors of the Virginia Tech Applied Research Corporation. He is also a member of the George Washington University National Advisory Council. Mr. Varner works with several universities to advance the attractiveness, applicability, and quality of cyber-security engineering and policy education nationwide.\nAbout Novetta\nHeadquartered in McLean, VA with over 700 employees across the US, Novetta has over two decades of experience solving problems of national significance through advanced analytics for government and commercial enterprises worldwide. Grounded in its work for national security customers, Novetta has pioneered disruptive technologies in four key areas of advanced analytics: data, cyber, open source/media, and multi-int fusion. Novetta enables customers to find clarity from the complexity of big data at the scale and speed needed to drive enterprise and mission success. Visit www.novetta.com for more information.\nView original content: http://www.prnewswire.com/news-releases/bill-varner-joins-novetta-board-of-directors-300589342.html\nSOURCE Novetta", "external_links": ["http://www.prnewswire.com/news-releases/bill-varner-joins-novetta-board-of-directors-300589342.html", "http://www.novetta.com/"], "published": "2018-01-29T16:28:00.000+02:00", "crawled": "2018-01-29T20:01:18.006+02:00", "highlightTitle": ""}