{"organizations": [], "uuid": "720009f3dea0343429220e0cdcb616c702649340", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-lantronix-reports-second-quarter-fiscal-2018-net-revenue-of-11-point-3-million.html", "country": "US", "domain_rank": 767, "title": "Lantronix Reports Second Quarter Fiscal 2018 Net Revenue of $11.3 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-26T00:15:00.000+02:00", "replies_count": 0, "uuid": "720009f3dea0343429220e0cdcb616c702649340"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-lantronix-reports-second-quarter-fiscal-2018-net-revenue-of-11-point-3-million.html", "ord_in_thread": 0, "title": "Lantronix Reports Second Quarter Fiscal 2018 Net Revenue of $11.3 Million", "locations": [], "entities": {"persons": [], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "lantronix", "sentiment": "negative"}, {"name": "lantronix, inc.", "sentiment": "neutral"}, {"name": "lantronix slb™ branch office", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}, {"name": "non-gaap", "sentiment": "none"}, {"name": "crn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif., Jan. 25, 2018 (GLOBE NEWSWIRE) -- Lantronix, Inc. (NASDAQ:LTRX) a global provider of secure data access and management solutions for Internet of Things (IoT) assets, today reported results for the second fiscal quarter ended December 31, 2017.\nFinancial Highlights for Second Quarter of Fiscal 2018\nNet revenue of $11.3 million Gross profit margin of 55.7%, compared with 51.8% for the second quarter of fiscal 2017 GAAP net income of $225,000 or $0.01 per share compared with GAAP net income of $41,000, or $0.00 per share for the second quarter of fiscal 2017 Non-GAAP net income of $689,000, compared with non-GAAP income of $444,000 for the second quarter of fiscal 2017, up 55% year over year Cash and cash equivalents increased to $8.4 million 8th consecutive quarter of non-GAAP profitability Record sales of Lantronix SLB™ Branch Office Manager contributed to 42% year-over-year growth in IT Management product line\nOperational and Product Highlights\nMost recently, the company was recognized by CRN ® in its 2017 Internet of Things 50 list, which recognizes companies whose innovative offerings are helping connect objects, computing devices, infrastructure, data storage and data analytics that will transform our everyday lives. In December, the company announced the launch of its xPico® 200 family of embedded IoT gateways, delivering robust Ethernet, Wi-Fi and Bluetooth connectivity, enterprise-grade security, and integrated manageability features ideal for industrial IoT applications. In November, the company announced that it had reached a favorable settlement in the patent infringement lawsuit filed against Jinan USR IOT Technology, Limited., which enforced Lantronix United States patents covering the XPort® family of Serial-to-Ethernet conversion products. In October, the company announced the launch of MACH10® Global Device Manager, the first product offering based on its MACH10 technology platform. MACH10® Global Device Manager is a ready-to-use industrial IoT application designed to enable OEMs and system integrators to deploy lifecycle management for their connected devices at scale. In October, Lantronix joined the National Association of Software and Service Companies (NASSCOM®), an India-based industry association, to promote the development and deployment of innovative Lantronix end-to-end IoT solutions to the India market. During the quarter, the company received initial orders for SGX™ 5150 IoT Device Gateways from one of its strategic OEM customers in the medical segment to support their initial production ramp\n“I am very pleased with our second quarter results and the momentum we carry into the second half of our fiscal year,” said Jeff Benck, Lantronix CEO. “With revenue above $11 million and continued improvement in gross margins we were able to demonstrate the leverage that exists in our business model by achieving non-GAAP net income of 6% of revenue.”\nConference Call and Webcast\nLantronix will host an investor conference call and audio webcast today at 2:00 p.m. Pacific Time (5:00 p.m. Eastern Time) to discuss its results for the second fiscal quarter ended December 31, 2017. To access the live conference call, investors should dial 1-844-802-2442 (US) or 1-412-317-5135 (international) and indicate that they are participating in the Lantronix Q2 FY 2018 call. The webcast will be available simultaneously via the investor relations section of the Company’s website at www.lantronix.com .\nInvestors can access a replay of the conference call starting at approximately 5:00 p.m. Pacific Time today at www.lantronix.com . A telephonic replay will also be available through February 1, 2018 by dialing 1-877-344-7529 (US) or 1-412-317-0088 (international) and entering passcode 10115345.\nAbout Lantronix\nLantronix, Inc. is a global provider of secure data access and management solutions for Internet of Things (IoT) assets. Our mission is to be the leading supplier of IoT solutions that enable companies to dramatically simplify the creation, deployment, and management of IoT projects while providing secure access to data for applications and people.\nWith more than two decades of experience in creating robust machine to machine (M2M) technologies, Lantronix is an innovator in enabling our customers to build new business models and realize the possibilities of the Internet of Things. Our connectivity solutions are deployed inside millions of machines serving a wide range of industries, including industrial, medical, security, transportation, retail, financial, environmental and government.\nFor more information, visit www.lantronix.com .\nLearn more at the Lantronix blog, www.lantronix.com/blog , featuring industry discussion and updates. To follow Lantronix on Twitter, please visit www.twitter.com/Lantronix . View our video library on YouTube at www.youtube.com/user/LantronixInc or connect with us on LinkedIn at www.linkedin.com/company/lantronix .\nDiscussion of Non-GAAP Financial Measures\nLantronix believes that the presentation of non-GAAP financial information, when presented in conjunction with the corresponding GAAP measures, provides important supplemental information to management and investors regarding financial and business trends relating to the company's financial condition and results of operations. Management uses the aforementioned non-GAAP measures to monitor and evaluate ongoing operating results and trends to gain an understanding of our comparative operating performance. The non-GAAP financial measures disclosed by the company should not be considered a substitute for, or superior to, financial measures calculated in accordance with GAAP, and the financial results calculated in accordance with GAAP and reconciliations of the non-GAAP financial measures to the financial measures calculated in accordance with GAAP should be carefully evaluated. The non-GAAP financial measures used by the company may be calculated differently from, and therefore may not be comparable to, similarly titled measures used by other companies. The company has provided reconciliations of the non-GAAP financial measures to the most directly comparable GAAP financial measures.\nNon-GAAP net income (loss) consists of net income (loss) excluding (i) non-GAAP adjustments to operating expenses, (ii) interest income (expense), (iii) other income (expense), (iv) income tax provision (benefit), and (v) severance and restructuring charges.\nForward-Looking Statements\nThis news release contains forward-looking statements, including statements concerning our sales expansion efforts, our product development efforts, and our projected operating and financial performance. These forward-looking statements are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. We have based our forward-looking statements on our current expectations and projections about trends affecting our business and industry and other future events. Although we do not make forward-looking statements unless we believe we have a reasonable basis for doing so, we cannot guarantee their accuracy. Forward-looking statements are subject to substantial risks and uncertainties that could cause our results or experiences, or future business, financial condition, results of operations or performance, to differ materially from our historical results or those expressed or implied in any forward-looking statement contained in this news release. Some of the risks and uncertainties that may cause actual results to differ from those expressed or implied in the forward-looking statements are described in “Risk Factors” in our Annual Report on Form 10-K filed with the Securities and Exchange Commission, or SEC, as well as in our other filings with the SEC. In addition, actual results may differ as a result of additional risks and uncertainties of which we are currently unaware or which we do not currently view as material to our business. For these reasons, investors are cautioned not to place undue reliance on any forward-looking statements. The forward-looking statements we make speak only as of the date on which they are made. We expressly disclaim any intent or obligation to update any forward-looking statements after the date hereof to conform such statements to actual results or to changes in our opinions or expectations, except as required by applicable law or the rules of the NASDAQ Stock Market, LLC. If we do update or correct any forward-looking statements, investors should not conclude that we will make additional updates or corrections.\nInvestor Relations Contacts:\nJeremy Whitaker\nChief Financial Officer\n949-453-3990\n© 2018 Lantronix, Inc. All rights reserved. Lantronix, MACH10, xPico and XPort are registered trademarks, and SGX and SLB are trademarks, of Lantronix, Inc. All other trademarks and trade names are the property of their respective holders.\nLANTRONIX, INC. UNAUDITED CONDENSED CONSOLIDATED BALANCE SHEETS (In thousands) December 31, June 30, 2017 2017 Assets Current assets: Cash and cash equivalents $ 8,423 $ 8,073 Accounts receivable, net 3,962 3,432 Inventories, net 7,061 6,959 Contract manufacturers' receivable 539 476 Prepaid expenses and other current assets 478 440 Total current assets 20,463 19,380 Property and equipment, net 1,113 1,218 Goodwill 9,488 9,488 Other assets 45 46 Total assets $ 31,109 $ 30,132 Liabilities and stockholders' equity Current liabilities: Accounts payable $ 4,013 $ 2,717 Accrued payroll and related expenses 2,664 3,084 Warranty reserve 121 125 Other current liabilities 2,708 3,063 Total current liabilities 9,506 8,989 Long-term capital lease obligations 28 59 Other non-current liabilities 355 396 Total liabilities 9,889 9,444 Commitments and contingencies Stockholders' equity: Common stock 2 2 Additional paid-in capital 211,498 210,550 Accumulated deficit (190,651 ) (190,235 ) Accumulated other comprehensive income 371 371 Total stockholders' equity 21,220 20,688 Total liabilities and stockholders' equity $ 31,109 $ 30,132\nLANTRONIX, INC. UNAUDITED CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (In thousands, except per share data) Three Months Ended Six Months Ended\nDecember 31, September 30, December 31, December 31,\n2017 2017 2016 2017 2016 Net revenue $ 11,336 $ 10,606 $ 11,222 $ 21,942 $ 22,162 Cost of revenue 5,022 5,012 5,410 10,034 10,650 Gross profit 6,314 5,594 5,812 11,908 11,512 Operating expenses: Selling, general and administrative 4,173 3,986 3,873 8,159 7,715 Research and development 1,874 2,221 1,873 4,095 3,818 Total operating expenses 6,047 6,207 5,746 12,254 11,533 Income (loss) from operations 267 (613 ) 66 (346 ) (21 ) Interest expense, net (5 ) (4 ) (6 ) (9 ) (13 ) Other income, net 1 1 4 2 1 Income (loss) before income taxes 263 (616 ) 64 (353 ) (33 ) Provision for income taxes 38 25 23 63 30 Net income (loss) $ 225 $ (641 ) $ 41 $ (416 ) $ (63 ) Net income (loss) per share (basic) $ 0.01 $ (0.04 ) $ 0.00 $ (0.02 ) $ (0.00 ) Net income (loss) per share (diluted) $ 0.01 $ (0.04 ) $ 0.00 $ (0.02 ) $ (0.00 ) Weighted-average common shares (basic) 18,073 17,867 17,347 17,970 17,300 Weighted-average common shares (diluted) 18,739 17,867 17,703 17,970 17,300\nLANTRONIX, INC. UNAUDITED RECONCILIATION OF NON-GAAP ADJUSTMENTS (In thousands) Three Months Ended Six Months Ended December 31, September 30, December 31, December 31,\n2017 2017 2016 2017 2016 GAAP net income (loss) $ 225 $ (641 ) $ 41 $ (416 ) $ (63 ) Non-GAAP adjustments: Cost of revenue: Share-based compensation 13 13 13 26 24 Depreciation and amortization 53 62 84 115 173 Total adjustments to cost of revenue 66 75 97 141 197 Selling, general and adminstrative: Share-based compensation 239 212 162 451 311 Employer portion of withholding taxes on stock grants 3 2 5 5 5 Depreciation and amortization 46 45 56 91 110 Total adjustments to selling, general and administrative 288 259 223 547 426 Research and development: Share-based compensation 58 47 45 105 86 Employer portion of withholding taxes on stock grants - 1 - 1 - Depreciation and amortization 10 10 13 20 21 Total adjustments to research and development 68 58 58 126 107 Severance and related charges - 527 - 527 - Total non-GAAP adjustments to operating expenses 356 844 281 1,200 533 Interest expense, net 5 4 6 9 13 Other income, net (1 ) (1 ) (4 ) (2 ) (1 ) Provision for income taxes 38 25 23 63 30 Total non-GAAP adjustments 464 947 403 1,411 772 Non-GAAP net income $ 689 $ 306 $ 444 $ 995 $ 709\nLANTRONIX, INC. UNAUDITED NET REVENUES BY PRODUCT LINE AND REGION (In thousands) Three Months Ended Six Months Ended December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 IoT $ 7,971 $ 8,477 $ 8,304 $ 16,448 $ 16,173 IT Management 3,218 1,789 2,265 5,007 4,702 Other 147 340 653 487 1,287 $ 11,336 $ 10,606 $ 11,222 $ 21,942 $ 22,162 Three Months Ended Six Months Ended December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 Americas $ 6,292 $ 5,697 $ 6,453 $ 11,989 $ 12,619 EMEA 3,172 3,164 3,122 6,336 6,223 Asia Pacific Japan 1,872 1,745 1,647 3,617 3,320 $ 11,336 $ 10,606 $ 11,222 $ 21,942 $ 22,162\nSource:Lantronix, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=rifpeLT9BY0gnjf8dKSpRX5Z6AiBuJrawBBUoNSu01rW5pPJqYJKE5BbPJPTAO8iMc1tHlkPYZwu9BuoAULNAQ==", "https://www.globenewswire.com/Tracker?data=dhDFppf3IfDJKm3DeSnce3jEJ-c-kxwE3ALA2PiaJK_dwO3SSrNDqBFmyWVG2Ux8UtPMirT7oLr6oHP-EqvnymLTIsLKv_DDu1kV3Fi6nd0x3cmraDPS6em2eB987FpHbmzfWbV2_ciNEFeg8X7Eyw==", "https://www.globenewswire.com/Tracker?data=rifpeLT9BY0gnjf8dKSpRT3alOoVMlS_-v8tBTNniNLEeRSNpVRpu5yZEvsCfMhLKoeOzbPjfUHEfM4zH3juJEzyH1P_JGk86kTtSJGOlm8=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/7f302c60-a860-46bb-b8ad-cbec48506675", "https://www.globenewswire.com/Tracker?data=ArDjKtLK7X1PvI6US4LXab-CxXKn6LAhI-0PNGH40srgJnGaZTv4i3xhPuIfFQH8Ut1aZgay7yhhh2WjZr8NUIV9JHYJ7JwSKE5zS34lhL80K753uoWzKMmKOYaHz9wR", "http://www.twitter.com/Lantronix", "https://www.globenewswire.com/Tracker?data=rifpeLT9BY0gnjf8dKSpRaybSZjWOL_6QrIdxX4-j4ZChNLDsxEXvV8KIHFDvKUPCNLKUWTHQatNgpAXSuep2w==", "https://www.globenewswire.com/Tracker?data=rifpeLT9BY0gnjf8dKSpRfPHg6NQSPa-UK8UzI4nukkcG0tJtYJMrbgtDBRoSk6s4sLMRHgmLMAtk4S8QBVyAg==", "https://www.lantronix.com/mach10-gdm/"], "published": "2018-01-26T00:15:00.000+02:00", "crawled": "2018-01-26T02:30:40.006+02:00", "highlightTitle": ""}