{"organizations": [], "uuid": "be67a6af88c0938ea2252552800bc6b8dce493f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-azz-inc-announces-quarterly-cash-dividend-of-0-point-17-per-share.html", "country": "US", "domain_rank": 767, "title": "AZZ Inc. Announces Quarterly Cash Dividend of $0.17 Per Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T14:30:00.000+02:00", "replies_count": 0, "uuid": "be67a6af88c0938ea2252552800bc6b8dce493f2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-azz-inc-announces-quarterly-cash-dividend-of-0-point-17-per-share.html", "ord_in_thread": 0, "title": "AZZ Inc. Announces Quarterly Cash Dividend of $0.17 Per Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "texas", "sentiment": "none"}], "organizations": [{"name": "azz inc.", "sentiment": "negative"}, {"name": "azz inc", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT WORTH, Texas, Jan. 19, 2018 /PRNewswire/ -- AZZ Inc. (NYSE: AZZ), a global provider of metal coating services, welding solutions, specialty electrical equipment and highly engineered services, today announced its Board of Directors has authorized a quarterly cash dividend in the amount of $0.17 per share on the company's outstanding shares of common stock. The dividend is payable on February 20, 2018, to shareholders of record as of the close of business on February 6, 2018.\nWhile AZZ currently intends to pay regular quarterly cash dividends for the foreseeable future, any future dividends, in the amount of $0.17 per share of common stock or otherwise, will be reviewed individually and declared by the Board of Directors at its discretion. The Board of Directors remains committed to enhancing shareholder value based upon its consideration of various factors, including AZZ's operating results, financial condition and business outlook at the applicable time.\nAZZ Inc. is a global provider of metal coating services, welding solutions, specialty electrical equipment and highly engineered services to the markets of power generation, transmission, distribution and industrial in protecting metal and electrical systems used to build and enhance the world's infrastructure. AZZ Metal Coatings is a leading provider of metal finishing solutions for corrosion protection, including hot dip galvanizing to the North American steel fabrication industry. AZZ Energy is dedicated to delivering safe and reliable transmission of power from generation sources to end customers, and automated weld overlay solutions for corrosion and erosion mitigation to critical infrastructure in the energy markets worldwide.\nCertain statements herein about our expectations of future events or results constitute forward-looking statements for purposes of the safe harbor provisions of The Private Securities Litigation Reform Act of 1995. You can identify forward-looking statements by terminology such as, \"may,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"estimates,\" \"predicts,\" \"potential,\" \"continue,\" or the negative of these terms or other comparable terminology. Such forward-looking statements are based on currently available competitive, financial and economic data and management's views and assumptions regarding future events. Such forward-looking statements are inherently uncertain, and investors must recognize that actual results may differ from those expressed or implied in the forward-looking statements. This release may contain forward-looking statements that involve risks and uncertainties including, but not limited to, changes in customer demand and response to products and services offered by AZZ, including demand by the power generation markets, electrical transmission and distribution markets, the industrial markets, and the hot dip galvanizing markets; prices and raw material cost, including zinc and natural gas which are used in the hot dip galvanizing process; changes in the political stability and economic conditions of the various markets that AZZ serves, foreign and domestic, customer requested delays of shipments, acquisition opportunities, currency exchange rates, adequacy of financing, and availability of experienced management and employees to implement AZZ's growth strategy. AZZ has provided additional information regarding risks associated with the business in AZZ's Annual Report on Form 10-K for the fiscal year ended February 28, 2017 and other filings with the SEC, available for viewing on\nAZZ's website at www.azz.com and on the SEC's website at www.sec.gov . You are urged to consider these factors carefully in evaluating the forward-looking statements herein and are cautioned not to place undue reliance on such forward-looking statements, which are qualified in their entirety by this cautionary statement. These statements are based on information as of the date hereof and AZZ assumes no obligation to update any forward-looking statements, whether as a result of new information, future events, or otherwise.\nContact:\nPaul Fehlman, Senior Vice President - Finance and CFO\nAZZ Inc. 817-810-0095\nInternet: www.azz.com\nLytham Partners 602-889-9700\nJoe Dorame, Robert Blum or Joe Diaz\nInternet: www.lythampartners.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/azz-inc-announces-quarterly-cash-dividend-of-017-per-share-300585140.html\nSOURCE AZZ Inc.", "external_links": ["http://www.prnewswire.com/news-releases/azz-inc-announces-quarterly-cash-dividend-of-017-per-share-300585140.html", "http://www.lythampartners.com/", "http://www.azz.com/"], "published": "2018-01-19T14:30:00.000+02:00", "crawled": "2018-01-19T16:01:08.009+02:00", "highlightTitle": ""}