{"organizations": [], "uuid": "d6b0c8e886b36d0b9afae184dbf645954de0c3f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-michael-baker-international-strengthens-operations-in-dallas-with-appointment-of-laura-weis-as-office-executive.html", "country": "US", "domain_rank": 767, "title": "Michael Baker International Strengthens Operations in Dallas with Appointment of Laura Weis as Office Executive", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:00:00.000+02:00", "replies_count": 0, "uuid": "d6b0c8e886b36d0b9afae184dbf645954de0c3f4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-michael-baker-international-strengthens-operations-in-dallas-with-appointment-of-laura-weis-as-office-executive.html", "ord_in_thread": 0, "title": "Michael Baker International Strengthens Operations in Dallas with Appointment of Laura Weis as Office Executive", "locations": [], "entities": {"persons": [{"name": "laura weis", "sentiment": "negative"}, {"name": "weis", "sentiment": "none"}, {"name": "michael baker", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "north texas", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "michael baker international strengthens operations", "sentiment": "negative"}, {"name": "michael baker international", "sentiment": "negative"}, {"name": "office executive", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 9, 2018 /PRNewswire/ -- Michael Baker International , a global leader in engineering, planning and consulting services, today announced that Laura Weis, P.E., has joined the firm as Vice President and Office Executive in Dallas. As Texas experiences aggressive growth, Ms. Weis will lead the Dallas office's balanced portfolio of services and bring the full range of the firm's expertise to the region in support of various infrastructure projects. She will oversee office personnel and manage the day-to-day operations.\nMs. Weis brings more than 21 years of experience to her role at Michael Baker. She has spent her career delivering engineering and project management services on civil infrastructure projects, including planning, design, estimating and construction support. Her management experience includes overseeing resources to execute and deliver on projects throughout the North Texas region, leading operations and driving new business opportunities. Ms. Weis has extensive experience leading engineering teams on site civil, aviation, highway, bridge, transit, and freight rail projects. Most recently, she managed multi-million dollar programs at Dallas/Fort Worth International Airport.\n\"The rapid population growth in Texas has placed increased importance and attention on our existing infrastructure, and no more so than in North Texas, as improvements and expansion are needed to meet the heavy demand,\" said Juan Contreras, P.E., Regional Director for Michael Baker International's Gulf Coast Region. \"Laura's vast planning and engineering experience is an invaluable addition to our team, and positions Michael Baker to better serve the growing demands of our client base as We Make a Difference in Texas.\"\nMs. Weis added: \"I am excited to join the strong Michael Baker team in Dallas as we build relationships with our clients to help them solve their most complex challenges. The infrastructure needs in the state of Texas continue to evolve and our expertise positions us to play an instrumental role in the ongoing redevelopment efforts.\"\nAdditionally, Ms. Weis is a member of the Dallas Regional Chamber of Commerce's Leadership Dallas Class of 2017. She is also the Southwest Region Chair for the Women's Transportation Seminar (WTS)-Dallas/Fort Worth Chapter. Ms. Weis earned her Bachelor of Science degree in Civil Engineering from The University of Texas at Austin. She is a licensed professional engineer in the state of Texas.\nAbout Michael Baker International\nMichael Baker International is a leading provider of engineering and consulting services, including design, planning, architectural, environmental, construction and program management. The company provides its comprehensive range of services and solutions to support U.S. federal, state and municipal governments, foreign allied governments, and a wide range of commercial clients. Michael Baker is committed to delivering a standard of excellence that fosters a culture of innovation, collaboration and technological advancement to help solve challenges for clients and the company's more than 3,000 employees in nearly 100 locations across the United States. To learn more, visit www.mbakerintl.com .\nContact: Justin Falce\njustin.falce@mbakerintl.com\n(866) 293-4609\nView original content with multimedia: http://www.prnewswire.com/news-releases/michael-baker-international-strengthens-operations-in-dallas-with-appointment-of-laura-weis-as-office-executive-300579795.html\nSOURCE Michael Baker International", "external_links": ["http://www.mbakerintl.com/", "http://www.prnewswire.com/news-releases/michael-baker-international-strengthens-operations-in-dallas-with-appointment-of-laura-weis-as-office-executive-300579795.html"], "published": "2018-01-09T17:00:00.000+02:00", "crawled": "2018-01-09T19:05:00.004+02:00", "highlightTitle": ""}