{"organizations": [], "uuid": "da767098300823db602173b3bdbac672b9058e43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 336, "shares": 336, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225740778&w=1200&r=LYNXMPEE0Q094", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-tillerson/u-s-holding-russia-responsible-for-chemical-weapons-in-syria-idUSKBN1FG0CF", "country": "US", "domain_rank": 408, "title": "U.S. holding Russia responsible for chemical weapons in Syria", "performance_score": 3, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T12:23:00.000+02:00", "replies_count": 0, "uuid": "da767098300823db602173b3bdbac672b9058e43"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-tillerson/u-s-holding-russia-responsible-for-chemical-weapons-in-syria-idUSKBN1FG0CF", "ord_in_thread": 0, "title": "U.S. holding Russia responsible for chemical weapons in Syria", "locations": [], "entities": {"persons": [{"name": "rex tillerson", "sentiment": "none"}, {"name": "lidia kelly", "sentiment": "none"}, {"name": "mark potter", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}], "organizations": [{"name": "state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "syria reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 10:23 AM / Updated 3 hours ago Tillerson says Washington, Europe start work on Iran nuclear deal Lidia Kelly , Marcin Goettig 3 Min Read \nWARSAW (Reuters) - U.S. Secretary of State Rex Tillerson said on Saturday that working groups on fixing what the U.S. sees as flaws in the Iranian nuclear deal have already begun to meet, trying to determine the scope of what is needed and how much Iran needs to be engaged in it. \nTillerson, ending a week-long European trip in Warsaw, said that he had secured support from Britain, France and Germany - all parties to the 2015 agreement - to work on the deal that President Donald Trump has warned he will walk away from unless changes are made. \n“It’s always darkest before the dawn,” Tillerson told journalists. “The working groups have already begun to meet on efforts to agree principles, what is the scope of what we attempt to address and also how much we engage Iran on discussions to address these issues,” he said. \nThe nuclear deal gave Iran billions of dollars in sanctions relief in return for curbs on its atomic program. \nTrump vowed to stop waiving U.S. sanctions unless the Europeans agreed to strengthen the deal’s terms by consenting to a side agreement that would effectively eliminate provisions that allow Iran to gradually resume some advanced atomic work. Trump also wants tighter restrictions on Iran’s ballistic missile program. \nIran has rejected any renegotiation. U.S. Secretary of State Rex Tillerson speaks at the Warsaw Ghetto monument in Warsaw, Poland January 27, 2018. REUTERS/Kacper Pempel \nTillerson said the nuclear deal was only a “small” part of U.S. policy in the Middle East and Washington was more immediately concerned about other issues including Iran’s support for the Houthi rebels in Yemen and its supplying weapons to militias in the region. \n“Our work group also is intending to identify areas of greater cooperation (with) Europe to push back on Iran’s malign behaviour,” he said. Slideshow (3 Images) RUSSIA BLAMED \nDespite statements from Russia earlier this week that Washington’s accusations against Moscow that it and the Syrian army were behind a chemical attack in eastern Ghouta were “unfounded”, Tillerson reiterated that ultimately Russia bore responsibility. \n“I stand by my comments,” he said. \n“The chemical weapons ... are being used to hit the civilian population, the most vulnerable - children inside of Syria ... We are holding Russia responsible for addressing this. They are (Bashar al-) Assad’s ally.” \nRussia is providing direct military support in Syria against various rebel groups trying to oust Assad, and giving diplomatic cover in the U.N. Security Council. Additional reporting by Vladimir Soldatkin in Moscow; Writing by Lidia Kelly; Editing by Andrew Bolton", "external_links": [], "published": "2018-01-27T12:23:00.000+02:00", "crawled": "2018-01-27T12:41:28.027+02:00", "highlightTitle": ""}