{"organizations": [], "uuid": "f3e34a63889d81ab447c5a4ab6b89fceac4bfb74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/07/google-home-black-music.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/google-home-and-chomecast-may-be-interfering-with-users-wi-fi/", "country": "US", "domain_rank": 1196, "title": "Google Home and Chomecast May Be Interfering With Users' Wi-Fi Routers | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.73, "site_type": "news", "published": "2018-01-17T19:12:00.000+02:00", "replies_count": 0, "uuid": "f3e34a63889d81ab447c5a4ab6b89fceac4bfb74"}, "author": "Sarah Gray", "url": "http://fortune.com/2018/01/16/google-home-and-chomecast-may-be-interfering-with-users-wi-fi/", "ord_in_thread": 0, "title": "Google Home and Chomecast May Be Interfering With Users' Wi-Fi Routers | Fortune", "locations": [], "entities": {"persons": [{"name": "sarah gray", "sentiment": "negative"}, {"name": "linksys", "sentiment": "none"}], "locations": [{"name": "chromecast", "sentiment": "none"}], "organizations": [{"name": "google home", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "google home max", "sentiment": "none"}, {"name": "android police", "sentiment": "none"}, {"name": "asus", "sentiment": "none"}, {"name": "netgear", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Sarah Gray January 16, 2018 \nUsers of Google Home and Chromecast may experience trouble connecting online through their home Wi-Fi, according to new reports. \nA glitch in the devices causes Internet routers to shut down or lose their Internet connections, tech news sites Android Police and 9to5Google said earlier this week. \nThe problem, reported by Android Police on Sunday, initially appeared to unique to the recently-released Google Home Max voice-activated speaker and the TP-Link Archer C7 router. When online, the Google Home Max speaker appeared to cause Internet connections to crash. \nHowever, many users later chimed in that the problem was more widespread. People with ASUS, Linksys, Netgear, TP-Link, and Synology routers also reported problems when using Google devices including Google Home and Chromecast dongles for streaming video to television screens. \nAn engineer for TP-Link posted the following on the TP-Link website, explaining that the router outages may be caused by the “Cast” feature on the Android device sending information to the router after it has woken from “sleep” mode: \n“Following initial research and investigation, our engineering team is confident that they’ve determined one of the key origins of the issue. From what we have gathered so far, the issue appears to be related to some of the recent versions of Android OS and Google Apps. \n“This issue stems from these devices’“Cast” feature, which sends MDNS multicast discovery packets in order to discover and keep a live connection with Google products such as Google Home. These packets normally sent in a 20-second interval. However, we have discovered that the devices will sometimes broadcast a large amount of these packets at a very high speed in a short amount of time. This occurs when the device is awakened from its “sleep” state, and could exceed more than 100,000 packets. The longer your device is in “sleep”, the larger this packet burst will be. This issue may eventually cause some of router’s primary features to shut down – including wireless connectivity. \nTP-Link released updates to help solve the problem. The company also suggested rebooting the router and/or disabling the “Cast” function on devices until “an update is released to permanently fix this issue on the device itself.” \n“We’re aware that a small number of users are having issues and our team is working quickly to share a solution,” a Google spokesperson told Fortune in a statement. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T19:12:00.000+02:00", "crawled": "2018-01-17T00:30:30.093+02:00", "highlightTitle": ""}