{"organizations": [], "uuid": "7496366d95b245ad1740177ad7bfedfaab65ebbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-lcnb-corp-reports-financial-results-for-the-three-and-twelve-months-ended-december-31-2017.html", "country": "US", "domain_rank": 767, "title": "LCNB Corp. Reports Financial Results for the Three and Twelve Months Ended December 31, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T01:52:00.000+02:00", "replies_count": 0, "uuid": "7496366d95b245ad1740177ad7bfedfaab65ebbc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-lcnb-corp-reports-financial-results-for-the-three-and-twelve-months-ended-december-31-2017.html", "ord_in_thread": 0, "title": "LCNB Corp. Reports Financial Results for the Three and Twelve Months Ended December 31, 2017", "locations": [], "entities": {"persons": [{"name": "steve foster", "sentiment": "none"}], "locations": [{"name": "ohio", "sentiment": "none"}, {"name": "lebanon", "sentiment": "none"}], "organizations": [{"name": "lcnb corp", "sentiment": "negative"}, {"name": "lcnb corp.", "sentiment": "negative"}, {"name": "lcnb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LEBANON, Ohio--(BUSINESS WIRE)-- LCNB Corp. (\"LCNB\") (NASDAQ: LCNB) today announced net income of $3,617,000 (total basic and diluted earnings per share of $0.37 and $0.36, respectively) and $12,972,000 (total basic and diluted earnings per share of $1.30 and $1.29, respectively) for the three and twelve months ended December 31, 2017. This compares to net income of $3,654,000 (total basic and diluted earnings per share of $0.37) and $12,482,000 (total basic and diluted earnings per share of $1.26 and $1.25, respectively) for the same three and twelve-month periods in 2016.\nAs a result of the Tax Cuts and Jobs Act that was signed into law on December 22, 2017, LCNB revalued its net deferred tax liability position to reflect the reduction in its federal corporate income tax rate from 35% to 21%. This revaluation resulted in a one-time income tax benefit of approximately $224,000, or $0.02 of basic and diluted earnings per common share for the three and twelve months ended December 31, 2017.\nCommenting on the financial results, LCNB Chief Executive Officer Steve Foster said, \"We are pleased to report excellent results for 2017, including a $266,000 or 2.1% increase in net income, which does not include the one-time income tax benefit from a reduction in the federal tax rate. In addition, our loan portfolio grew $29.4 million or 3.6%. Return on average assets increased from 0.96% for 2016 to 0.99% for 2017 and return on average equity increased from 8.60% to 8.74%.\"\nNet interest income for the three months and twelve months ended December 31, 2017 was, respectively, $318,000 and $618,000 greater than the comparable periods in 2016, primarily due to growth in LCNB's loan portfolio, partially offset by a decrease in average investment securities.\nThe provision for loan losses for the three and twelve months ended December 31, 2017 was, respectively, $65,000 and $698,000 less than the comparable periods in 2016. Non-accrual loans and loans past due 90 days or more and still accruing interest decreased $2,783,000, from $5,748,000 or 0.70% of total loans at December 31, 2016, to $2,965,000 or 0.35% of total loans at December 31, 2017.\nNon-interest income for the three and twelve months ended December 31, 2017 was, respectively, $36,000 and $395,000 less than the comparable periods in 2016, primarily due to decreases in gains from the sale of investment securities and loans caused by a decrease in the volume of sales. These decreases were partially offset by increases in fiduciary income and service charges and fees on deposit accounts. The offset for the twelve month period also included an increase in bank owned life insurance income.\nNon-interest expense for the three and twelve months ended December 31, 2017 was, respectively, $704,000 and $602,000 greater than the comparable periods in 2016 primarily due to increases in salaries and employee benefits, marketing, merger-related expenses, and various expenses related to the new operations center. These increases were partially offset by a decrease in other real estate owned expenses. Merger-related expenses increased due to costs connected to the pending acquisition of Columbus First Bancorp, Inc. (\"Columbus First\"). Subject to customary regulatory approvals, LCNB and Columbus First shareholder approvals, and other conditions set forth in the definitive merger agreement, this transaction is anticipated to close in the second quarter of 2018.\nImportant Information for Investors and Shareholders:\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy securities of LCNB. LCNB will file a registration statement on Form S-4 and other documents regarding the proposed business combination transaction referenced in this press release with the Securities and Exchange Commission (“SEC”) to register the shares of LCNB’s common stock to be issued to the shareholders of Columbus First. The registration statement will include a joint proxy statement/prospectus which will be sent to the shareholders of Columbus First and LCNB in advance of respective special meetings of shareholders that will be held to consider the proposed merger. Investors and LCNB and Columbus First shareholders are urged to read the joint proxy statement/prospectus and any other relevant documents to be filed with the SEC in connection with the proposed transaction because they will contain important information about LCNB, Columbus First and the proposed transaction. Investors and shareholders may obtain a free copy of these documents (when available) through the website maintained by the SEC at www.sec.gov . These documents may also be obtained, without charge, by directing a request to LCNB Corp., Two North Broadway, P.O. Box 59, Lebanon, Ohio 45036: Investor Relations.\nLCNB and Columbus First and certain of their directors and executive officers may be deemed to be participants in the solicitation of proxies from the shareholders of LCNB and Columbus First in connection with the proposed merger. Information about the directors and executive officers of LCNB is set forth in the proxy statement for LCNB’s 2017 annual meeting of shareholders, as filed with the SEC on Schedule 14A on March 10, 2017. Additional information regarding the interests of those participants and other persons who may be deemed participants in the transaction may be obtained by reading the joint proxy statement/prospectus regarding the proposed merger when it becomes available. Free copies of this document may be obtained as described in the preceding paragraph, when it becomes available.\nLCNB Corp. is a financial holding company headquartered in Lebanon, Ohio. Through its subsidiary, LCNB National Bank (the “Bank”), it serves customers and communities in Southwest and South Central Ohio. A financial institution with a long tradition for building strong relationships with customers and communities, the Bank offers convenient banking locations in Butler, Clermont, Clinton, Fayette, Hamilton, Montgomery, Preble, Ross and Warren Counties, Ohio. A commercial loan office is located in Franklin County, Ohio. The Bank continually strives to exceed customer expectations and provides an array of services for all personal and business banking needs including checking, savings, online banking, personal lending, business lending, agricultural lending, business support, deposit and treasury, investment services, trust and IRAs and stock purchases. LCNB Corp. common shares are traded on the NASDAQ Capital Market Exchange® under the symbol “LCNB.” Learn more about LCNB Corp. at www.lcnb.com .\nCertain statements made in this news release regarding LCNB’s financial condition, results of operations, plans, objectives, future performance and business, are “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, Section 21E of the Securities Exchange Act of 1934, as amended, and the Private Securities Litigation Reform Act of 1995. These forward-looking statements are identified by the fact they are not historical facts and include words such as “anticipate”, “could”, “may”, “feel”, “expect”, “believe”, “plan”, and similar expressions. Please refer to LCNB’s Annual Report on Form 10-K for the year ended December 31, 2016, as well as its other filings with the SEC, for a more detailed discussion of risks, uncertainties and factors that could cause actual results to differ from those discussed in the forward-looking statements.\nThese forward-looking statements reflect management's current expectations based on all information available to management and its knowledge of LCNB’s business and operations. Additionally, LCNB’s financial condition, results of operations, plans, objectives, future performance and business are subject to risks and uncertainties that may cause actual results to differ materially. These factors include, but are not limited to:\nthe success, impact, and timing of the implementation of LCNB’s business strategies; LCNB’s ability to integrate future acquisitions, including the pending merger with Columbus First, may be unsuccessful, or may be more difficult, time-consuming or costly than expected; LCNB’s ability to obtain regulatory approvals of the proposed merger of LCNB with Columbus First on the proposed terms and schedule, and approval of the merger by the shareholders of LCNB or Columbus First may be unsuccessful; LCNB may incur increased charge-offs in the future; LCNB may face competitive loss of customers; changes in the interest rate environment may have results on LCNB’s operations materially different from those anticipated by LCNB’s market risk management functions; changes in general economic conditions and increased competition could adversely affect LCNB’s operating results; changes in other regulations and government policies affecting bank holding companies and their subsidiaries, including changes in monetary policies, could negatively impact LCNB’s operating results; LCNB may experience difficulties growing loan and deposit balances; the current economic environment poses significant challenges for us and could adversely affect our financial condition and results of operations; deterioration in the financial condition of the U.S. banking system may impact the valuations of investments LCNB has made in the securities of other financial institutions resulting in either actual losses or other than temporary impairments on such investments; and the effects of the Wall Street Reform and Consumer Protection Act (the “Dodd-Frank Act”) and the regulations promulgated and to be promulgated thereunder, which may subject LCNB and its subsidiaries to a variety of new and more stringent legal and regulatory requirements which adversely affect their respective businesses.\nForward-looking statements made herein reflect management's expectations as of the date such statements are made. Such information is provided to assist shareholders and potential investors in understanding current and anticipated financial operations of LCNB and is included pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. LCNB undertakes no obligation to update any forward-looking statement to reflect events or circumstances that arise after the date such statements are made.\nLCNB Corp. and Subsidiaries Financial Highlights (Dollars in thousands, except per share amounts)\n(Unaudited)\nThree Months Ended Year Ended 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 12/31/2017 12/31/2016 Condensed Income Statement\nInterest income $ 11,610 11,055 10,934 10,864 11,226 44,463 43,750 Interest expense 953 908 861 877 887 3,599 3,504 Net interest income 10,657 10,147 10,073 9,987 10,339 40,864 40,246 Provision for loan losses (10 ) (12 ) 222 15 55 215 913 Net interest income after provision 10,667 10,159 9,851 9,972 10,284 40,649 39,333 Non-interest income 2,579 2,659 2,790 2,430 2,615 10,458 10,853 Non-interest expense 8,612 8,672 8,611 7,968 7,908 33,863 33,261 Income before income taxes 4,634 4,146 4,030 4,434 4,991 17,244 16,925 Provision for income taxes 1,017 1,040 1,027 1,188 1,337 4,272 4,443 Net income $ 3,617 3,106 3,003 3,246 3,654 12,972 12,482 Accreted income on acquired loans $ 606 90 180 220 495 1,096 1,365 Tax-equivalent net interest income $ 11,062 10,569 10,494 10,410 10,772 42,549 41,908 Per Share Data\nDividends per share $ 0.16 0.16 0.16 0.16 0.16 0.64 0.64 Basic earnings per common share $ 0.37 0.31 0.30 0.32 0.37 1.30 1.26 Diluted earnings per common share $ 0.36 0.31 0.30 0.32 0.37 1.29 1.25 Book value per share $ 14.99 14.94 14.77 14.52 14.30 14.99 14.30 Tangible book value per share $ 11.64 11.57 11.38 11.11 10.86 11.64 10.86 Average basic common shares outstanding 10,013,777 10,008,807 10,004,422 9,995,054 9,985,936 10,005,575 9,948,057 Average diluted common shares outstanding 10,020,566 10,015,204 10,011,312 10,002,878 9,991,975 10,012,511 9,976,370 Shares outstanding at period end 10,023,059 10,018,507 10,014,004 10,009,642 9,998,025 10,023,059 9,998,025 Selected Financial Ratios\nReturn on average assets 1.11 % 0.94 % 0.91 % 1.01 % 1.10 % 0.99 % 0.96 % Return on average equity 9.49 % 8.22 % 8.15 % 9.10 % 9.91 % 8.74 % 8.60 % Dividend payout ratio 43.24 % 51.61 % 53.33 % 50.00 % 43.24 % 49.23 % 50.79 % Net interest margin (tax equivalent) 3.73 % 3.52 % 3.50 % 3.55 % 3.56 % 3.58 % 3.51 % Efficiency ratio (tax equivalent) 63.13 % 65.56 % 64.82 % 62.06 % 59.07 % 63.88 % 63.04 % Selected Balance Sheet Items\nCash and cash equivalents $ 25,386 21,203 29,967 33,274 18,865 Investment securities and stock 317,413 353,634 373,595 371,501 368,032 Loans: Commercial and industrial $ 36,057 36,049 38,651 40,039 41,878 Commercial, secured by real estate 527,947 510,158 495,255 475,594 477,275 Residential real estate 251,582 253,530 258,710 260,853 265,788 Consumer 17,450 17,956 17,475 17,646 19,173 Agricultural\n15,194 15,677 16,014 15,459 14,802 Other, including deposit overdrafts 539 570 547 609 633 Deferred net origination costs 291 264 281 281 254 Loans, gross 849,060 834,204 826,933 810,481 819,803 Less allowance for loan losses 3,403 3,407 3,382 3,328 3,575 Loans, net $ 845,657 830,797 823,551 807,153 816,228 Three Months Ended Year Ended 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 12/31/2017 12/31/2016 Selected Balance Sheet Items, continued\nTotal earning assets $ 1,170,700 1,193,648 1,211,096 1,200,544 1,188,322 Total assets 1,295,638 1,314,319 1,335,571 1,319,074 1,306,799 Total deposits 1,085,821 1,121,523 1,143,920 1,148,198 1,110,905 Short-term borrowings 47,000 30,000 31,712 15,957 42,040 Long-term debt 303 363 402 480 598 Total shareholders’ equity 150,271 149,713 147,927 145,318 142,944 Equity to assets ratio 11.60 % 11.39 % 11.08 % 11.02 % 10.94 % Loans to deposits ratio 78.20 % 74.38 % 72.29 % 70.59 % 73.80 % Tangible common equity (TCE) $ 116,289 115,527 113,542 110,745 108,178 Tangible common assets (TCA) 1,261,656 1,280,133 1,301,186 1,284,501 1,272,033 TCE/TCA 9.22 % 9.02 % 8.73 % 8.62 % 8.50 % Selected Average Balance Sheet Items\nCash and cash equivalents $ 18,787 21,609 33,639 26,672 28,422 25,132 29,346 Investment securities and stock 332,225 363,039 373,295 366,499 380,138 358,682 390,621 Loans $ 840,526 824,183 811,186 813,597 812,537 822,452 792,526 Less allowance for loan losses 3,407 3,324 3,334 3,557 3,654 3,405 3,318 Net loans $ 837,119 820,859 807,852 810,040 808,883 819,047 789,208 Total earning assets $ 1,175,180 1,190,860 1,202,129 1,188,383 1,204,360 1,189,106 1,195,541 Total assets 1,295,293 1,313,476 1,321,442 1,308,591 1,316,037 1,309,501 1,305,132 Total deposits 1,096,966 1,133,072 1,148,206 1,125,457 1,138,740 1,125,866 1,131,179 Short-term borrowings 34,440 17,936 15,030 28,500 20,406 23,976 17,952 Long-term debt 323 383 441 537 620 421 826 Total shareholders’ equity 151,154 150,032 147,826 144,672 146,602 148,443 145,161 Equity to assets ratio 11.67 % 11.42 % 11.19 % 11.06 % 11.14 % 11.34 % 11.12 % Loans to deposits ratio 76.62 % 72.74 % 70.65 % 72.29 % 71.35 % 73.05 % 70.06 % Asset Quality\nNet charge-offs (recoveries) $ (7 ) (36 ) 168 262 278 387 467 Other real estate owned 0 0 0 0 0 0 0 Non-accrual loans 2,965 4,387 3,747 3,869 5,725 2,965 5,725 Loans past due 90 days or more and still accruing 0 95 141 12 23 0 23 Total nonperforming loans $ 2,965 4,482 3,888 3,881 5,748 2,965 5,748 Net charge-offs (recoveries) to average loans 0.00 % (0.02 )% 0.08 % 0.13 % 0.14 % 0.09 % 0.12 % Allowance for loan losses to total loans 0.40 % 0.41 % 0.41 % 0.41 % 0.44 % 0.40 % 0.44 % Nonperforming loans to total loans 0.35 % 0.54 % 0.47 % 0.48 % 0.70 % 0.35 % 0.70 % Nonperforming assets to total assets 0.23 % 0.34 % 0.29 % 0.29 % 0.44 % 0.23 % 0.44 % Assets Under Management\nLCNB Corp. total assets $ 1,295,638 1,314,319 1,335,571 1,319,074 1,306,799 Trust and investments (fair value) 362,486 326,642 315,450 316,856 303,534 Mortgage loans serviced 92,818 96,241 98,234 99,324 100,982 Cash management 84,344,000 77,780,000 45,519,000 29,102,000 30,319,000 Brokerage accounts (fair value) 229,006 219,960 209,019 199,019 188,663 Total assets managed $ 2,064,292 2,034,942 2,003,793 1,963,375 1,930,297 LCNB CORP. AND SUBSIDIARIES CONSOLIDATED CONDENSED BALANCE SHEETS (Dollars in thousands) December 31, 2017 December 31, (Unaudited) 2016 ASSETS: Cash and due from banks $ 21,159 18,378 Interest-bearing demand deposits 4,227 487 Total cash and cash equivalents 25,386 18,865 Investment securities: Available-for-sale, at fair value 278,472 320,659 Held-to-maturity, at cost 32,571 41,003 Federal Reserve Bank stock, at cost 2,732 2,732 Federal Home Loan Bank stock, at cost 3,638 3,638 Loans, net 845,657 816,228 Premises and equipment, net 34,927 30,244 Goodwill 30,183 30,183 Core deposit and other intangibles 3,799 4,582 Bank owned life insurance 27,985 27,307 Other assets 10,288 11,358 TOTAL ASSETS $ 1,295,638 1,306,799 LIABILITIES: Deposits: Noninterest-bearing $ 283,212 271,332 Interest-bearing 802,609 839,573 Total deposits 1,085,821 1,110,905 Short-term borrowings 47,000 42,040 Long-term debt 303 598 Accrued interest and other liabilities 12,243 10,312 TOTAL LIABILITIES 1,145,367 1,163,855 COMMITMENTS AND CONTINGENT LIABILITIES — — SHAREHOLDERS' EQUITY: Preferred shares – no par value, authorized 1,000,000 shares, none outstanding — — Common shares – no par value, authorized 19,000,000 shares at December 31, 2017 and 2016; issued 10,776,686 and 10,751,652 shares at December 31, 2017 and 2016, respectively 76,977 76,490 Retained earnings 87,301 80,736 Treasury shares at cost, 753,627 shares at December 31, 2017 and 2016 (11,665 ) (11,665 ) Accumulated other comprehensive loss, net of taxes (2,342 ) (2,617 ) TOTAL SHAREHOLDERS' EQUITY 150,271 142,944 TOTAL LIABILITIES AND SHAREHOLDERS' EQUITY $ 1,295,638 1,306,799 LCNB CORP. AND SUBSIDIARIES CONSOLIDATED CONDENSED STATEMENTS OF INCOME (Dollars in thousands, except per share data)\n(Unaudited)\nThree Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 INTEREST INCOME: Interest and fees on loans $ 9,738 9,205 36,571 35,600 Interest on investment securities – Taxable 978 1,054 4,328 4,582 Non-taxable 753 834 3,130 3,199 Other short-term investments 141 133 434 369 TOTAL INTEREST INCOME 11,610 11,226 44,463 43,750 INTEREST EXPENSE: Interest on deposits 839 875 3,378 3,440 Interest on short-term borrowings 112 8 209 38 Interest on long-term debt 2 4 12 26 TOTAL INTEREST EXPENSE 953 887 3,599 3,504 NET INTEREST INCOME 10,657 10,339 40,864 40,246 PROVISION FOR LOAN LOSSES (10 ) 55 215 913 NET INTEREST INCOME AFTER PROVISION FOR LOAN LOSSES 10,667 10,284 40,649 39,333 NON-INTEREST INCOME: Fiduciary income 869 815 3,473 3,286 Service charges and fees on deposit accounts 1,350 1,296 5,236 5,008 Net gain on sales of securities 15 125 233 1,082 Bank owned life insurance income 191 193 867 746 Gains from sales of loans 30 69 166 244 Other operating income 124 117 483 487 TOTAL NON-INTEREST INCOME 2,579 2,615 10,458 10,853 NON-INTEREST EXPENSE: Salaries and employee benefits 4,678 4,478 18,585 18,215 Equipment expenses 336 281 1,172 1,048 Occupancy expense, net 724 564 2,613 2,271 State financial institutions tax 286 278 1,137 1,114 Marketing 232 166 873 696 Amortization of intangibles 189 189 751 753 FDIC insurance premiums 103 52 423 547 Contracted services 325 283 1,255 1,033 Other real estate owned 2 17 10 624 Merger-related expenses 108 — 118 — Other non-interest expense 1,629 1,600 6,926 6,960 TOTAL NON-INTEREST EXPENSE 8,612 7,908 33,863 33,261 INCOME BEFORE INCOME TAXES 4,634 4,991 17,244 16,925 PROVISION FOR INCOME TAXES 1,017 1,337 4,272 4,443 NET INCOME $ 3,617 3,654 12,972 12,482 Dividends declared per common share $ 0.16 0.16 0.64 0.64 Earnings per common share: Basic 0.37 0.37 1.30 1.26 Diluted 0.36 0.37 1.29 1.25 Weighted average common shares outstanding: Basic 10,013,777 9,985,936 10,005,575 9,948,057 Diluted 10,020,566 9,991,975 10,012,511 9,976,370\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129006234/en/\nLCNB Corp.\nSteve P. Foster, CEO & President, 800-344-BANK\nRobert C. Haines II, Executive Vice President and CFO, 800-344-BANK\nSource: LCNB Corp.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lcnb.com&esheet=51750566&newsitemid=20180129006234&lan=en-US&anchor=www.lcnb.com&index=2&md5=a70f49052c4df6a61c9f280bb5316387", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51750566&newsitemid=20180129006234&lan=en-US&anchor=www.sec.gov&index=1&md5=f158789d8845d039e0d17f42eb852569", "http://www.businesswire.com/news/home/20180129006234/en/"], "published": "2018-01-30T01:52:00.000+02:00", "crawled": "2018-01-30T03:45:01.017+02:00", "highlightTitle": ""}