{"organizations": [], "uuid": "9ac95169c55122a3a36f3c74f852916d56adfcad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/09/19/102017319-roger-goodell.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/fanduel-offers-a-chance-to-get-bitcoin-rich-off-of-the-nfl.html", "country": "US", "domain_rank": 767, "title": "FanDuel offers a chance to get bitcoin rich off of the NFL", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.139, "site_type": "news", "published": "2018-01-05T21:14:00.000+02:00", "replies_count": 0, "uuid": "9ac95169c55122a3a36f3c74f852916d56adfcad"}, "author": "Shawn M. Carter", "url": "https://www.cnbc.com/2018/01/05/fanduel-offers-a-chance-to-get-bitcoin-rich-off-of-the-nfl.html", "ord_in_thread": 0, "title": "FanDuel offers a chance to get bitcoin rich off of the NFL", "locations": [], "entities": {"persons": [{"name": "andy giancamilli", "sentiment": "none"}, {"name": "fanduel", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nfl", "sentiment": "positive"}, {"name": "fanduel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you're a fan of the NFL and excited about bitcoin, you may be in luck.\nFantasy-sports gaming company FanDuel recently introduced the Bitcoin Bowl , a fantasy football contest that lasts the duration of the NFL playoffs and gives entrants in participating states an opportunity to win prizes in bitcoin.\n\"FanDuel has always sought to deliver the most unique and rewarding experiences or prizes to our users,\" Andy Giancamilli, FanDuel chief financial officer, said in a statement . \"In awarding bitcoin, we're recognizing that most of our users are early adopters of technology and have a significant interest in cryptocurrency.\"\nThe bowl operates similarly to other fantasy football platforms : Users will select a team of nine players — who score points based on their real-life, in-game performances — and face off against teams assembled by other contestants across the country.\nAssuming its gaming platform is legal where you live, there are two ways to enter, FanDuel's website notes. The first is to participate in a single-entry, free tournament, where the winner is rewarded with a grand prize of one bitcoin. The second is to choose the multi-entry, $3 tournament with a grand prize of two bitcoin, second-place prize half of a bitcoin and third-place prize a quarter of a bitcoin.\nshow chapters Jamie Foxx, Paris Hilton and other celebrities who are hyping cryptocurrencies      11:36 AM ET Wed, 20 Dec 2017 | 01:26 While a fraction of a bitcoin may not sound like much, consider that the value of one bitcoin, as of Friday, was worth just over $16,000 , according to digital-currency website CoinDesk, whose Bitcoin Price Index tracks prices from Bitfinex, Bitstamp, Coinbase and itBit.\nBut also keep in mind that the value of bitcoin can be volatile . Last year, according to CoinDesk, the cryptocurrency's value jumped from under $1,000 in January to more than $19,000 mid-December, and then back down to its current value, which, though impressive, remains more than $3,000 below its record high .\nSince Bitcoin Bowl's prizes aren't pegged to a specific dollar amount, the grand prize could end up being a lot more, or a lot less, than bitcoin is currently worth.\nUsers must enter before 4:35 p.m. EST Saturday, when the first playoff game is set to start. FanDuel is not accepting cryptocurrencies as a form of payment to enter.\nWhen the contest is over, winners will have an opportunity to claim their prize and have 30 days to transfer it into a bitcoin wallet.\nshow chapters Meet Vitalik Buterin, the 23-year-old founder of bitcoin rival ethereum      9:38 AM ET Fri, 23 June 2017 | 00:51 A number of states have contested the legality of fantasy sports platforms such as FanDuel. As of January 1, FanDuel is banned in 10 states , including Nevada and Texas, according to Legal Sports Report.\nAn ESPN report from July of last year notes that lobbyists are working in many of those states to clarify the legal status of such platforms.\nRegardless, FanDuel's Bitcoin Bowl serves as evidence that cryptocurrencies are becoming more mainstream. Currently, 100,000 merchants worldwide accept bitcoin . Some of the biggest names in finance, like billionaire entrepreneurs Mark Cuban and Warren Buffett, are voicing opinions, pro and con. \nIf you find yourself with bitcoin to spend, be sure you know the risks , as laid out by the Federal Trade Commission. And if you're interested in investing in cryptocurrencies — or in playing fantasy football for money, for that matter — take a tip from self-made millionaire Tony Robbins: Only use money you can afford to lose .\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: If you invested $1,000 in bitcoin in 2013, here's how much you'd have now \nVideo by Brandon Ancil \nshow chapters Here’s how much money it'll cost to buy a Super Bowl 52 ticket      10:01 AM ET Wed, 13 Sept 2017 | 01:01", "external_links": [], "published": "2018-01-05T21:14:00.000+02:00", "crawled": "2018-01-05T21:23:03.004+02:00", "highlightTitle": ""}