{"organizations": [], "uuid": "92fd3451a093b51f20fa183b750f698cd42813c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219193531&w=1200&r=LYNXMPEE0302S", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-india-politics-religion/indian-or-not-muslims-fret-amid-drive-against-illegal-immigrants-idUSKBN1ET065", "country": "US", "domain_rank": 408, "title": "Indian or not? Muslims fret amid drive against illegal immigrants", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T03:37:00.000+02:00", "replies_count": 0, "uuid": "92fd3451a093b51f20fa183b750f698cd42813c4"}, "author": "", "url": "https://www.reuters.com/article/us-india-politics-religion/indian-or-not-muslims-fret-amid-drive-against-illegal-immigrants-idUSKBN1ET065", "ord_in_thread": 0, "title": "Indian or not? Muslims fret amid drive against illegal immigrants", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "none"}, {"name": "marzina bibi", "sentiment": "none"}, {"name": "krishna n. das", "sentiment": "none"}], "locations": [{"name": "bangladesh", "sentiment": "none"}, {"name": "assam", "sentiment": "none"}, {"name": "fofonga", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "bharatiya janata party", "sentiment": "none"}, {"name": "bjp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FOFONGA, India (Reuters) - Marzina Bibi, a Muslim woman living in India’s northeastern state of Assam, is petrified she will be declared stateless.\nThe 26-year-old’s name was not on a preliminary list of citizens that was published at midnight on Sunday, although she holds a voter identity card and had voted in state elections in 2016.\n“Why are they doing this to me?” Bibi asked, sitting beside a bamboo mat she was weaving outside her mud house in Assam’s Fofonga village. “They think I am a Bangladeshi. I was born here, my parents were born here, I am an Indian.”\nPrime Minister Narendra Modi’s Hindu nationalist Bharatiya Janata Party (BJP), which came to power in Assam in the April, 2016 elections, vowed during the campaign to act against illegal Muslim immigrants from neighboring Bangladesh. But rights activists say the drive is also targeting Muslims who are Indian citizens.\nTwo national spokesmen for the BJP declined to comment.\nA spokesman for the Ministry of Home Affairs in New Delhi did not reply to e-mails and a telephone call seeking comment.\nCitizenship and illegal migration are volatile issues in tea-growing and oil-rich Assam, home to more than 32 million people, about a third of whom are Muslims. Hundreds of people were killed in the 1980s in a violent protest by a native Assamese group against outsiders from the state taking the bulk of jobs and cornering resources, including land.\nFor the latest update of the National Register of Citizens (NRC), all residents of Assam had to produce documents proving that they or their families lived in the country before March 24, 1971, to be recognized as Indian citizens.\nAccording to the preliminary list of the NRC, about 19 million people in Assam have now been verified as Indian citizens. More names will be added, and officials say the final list is likely to be published in July.\nReuters spoke to nearly two dozen Muslims, including Bibi, from paddy-growing villages around Fofonga who said their names were not on the preliminary list.\n“I feel we are targeted because we are Muslims,” said Bibi, who said she has already proved she was Indian - she was jailed for eight months on charges of being an illegal migrant from Bangladesh and was let off only after showing documents attesting to her nationality.\nSurrounded by her neighbors in the village, she showed her voter identity card and the court order for her release from jail.\nNO RELIGIOUS BIAS Women stand next to policemen as they wait to check their names on the draft list of the National Register of Citizens (NRC) at an NRC centre in Chandamari village in Goalpara district, in the northeastern state of Assam, India, January 2, 2018. REUTERS/Anuwar Hazarika The BJP has said previous governments have included many Bangladeshi immigrants on electoral rolls to buy votes.\nAt the local NRC office in the Muslim-majority area, only around 4,500 people had made it to the preliminary list out of nearly 11,000 who had applied.\nThe government officer in charge of the center, Gautam Sharmah, said there was no religious bias against Muslims.\n“That’s impossible. We only look at documents,” Sharmah said at his office, as people trickled in to look for their names on the second day of the list’s publication. “The time taken in the verification process depends on what kind of documents people submit.”\nReuters saw a tribal Hindu man leaving the NRC office with a smile after being told that the names of all six members of his family were on the list. Soon after, two Muslim women came with their infants, and left disappointed.\nSlideshow (4 Images) Hundreds of thousands of people fled to India from Muslim-majority Bangladesh after it declared independence from Pakistan on March 26, 1971, setting off a nine-month civil war. Most of them settled in Assam and the neighboring state of West Bengal, where there are similar demands to send back illegal Muslim immigrants.\nThe migrants include many Hindus, but the federal BJP government has said they will not be deported.\nHimanta Biswa Sarma, Assam’s finance minister who is also in charge of the citizenship register, told Reuters that all those whose names do not figure in the final NRC list would be segregated.\n“Deportation is an issue handled by the central government,” Sarma said.\n“Hindu Bangladeshis who had faced persecution should be given shelter in India and that is the central government’s stand.”\nMuslims leaders have called the NRC a tool to make them stateless, likening themselves to Myanmar’s persecuted Rohingya minority. They have also warned of unrest.\nAssam Chief Minister Sarbananda Sonowal told the Times of India daily that the “people who are declared foreigners will be barred from all constitutional rights, including fundamental and electoral. They will have only one right — human rights as guaranteed by the U.N. that include food, shelter and clothing”.\nIn Fofonga, Bibi said she would challenge the list if it did not include her and her family as citizens.\n“We are poor people, my husband is a laborer,” she said, going back to weaving her mat. “But I will go to court if we are left out.”\nReporting by Krishna N. Das; Editing by Raju Gopalakrishnan\n ", "external_links": [], "published": "2018-01-04T03:37:00.000+02:00", "crawled": "2018-01-04T04:00:29.008+02:00", "highlightTitle": ""}