{"organizations": [], "uuid": "c0d33b11f8297003855b84704ef56d6e21323fd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224170925&w=1200&r=LYNXMPEE0L1C2", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-france-business/with-versailles-business-summit-macron-seeks-to-bank-on-global-appeal-idINKBN1FB1VE", "country": "US", "domain_rank": 408, "title": "With Versailles business summit, Macron seeks to bank on global appeal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:27:00.000+02:00", "replies_count": 0, "uuid": "c0d33b11f8297003855b84704ef56d6e21323fd1"}, "author": "", "url": "https://in.reuters.com/article/us-france-business/with-versailles-business-summit-macron-seeks-to-bank-on-global-appeal-idINKBN1FB1VE", "ord_in_thread": 0, "title": "With Versailles business summit, Macron seeks to bank on global appeal", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "michel rose", "sentiment": "none"}, {"name": "sheryl sandberg", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "versailles", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "toyota", "sentiment": "none"}, {"name": "min read  paris", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - President Emmanuel Macron sought on Monday to show that his activity on the world stage and his pro-business reforms were bearing fruit with a highly-publicized summit of global CEOs in Versailles and a flurry of investments worth about $3 billion.\nA 300 million euro ($368 million) investment by Japanese carmaker Toyota ( 7203.T ) to increase capacity at its northern French plant producing the Yaris model was the centerpiece of the day, with 800 new jobs to be added by 2020.\nBut beyond the rare bricks-and-mortar factory investment, a trio of pledges by U.S. giants Facebook and Google and German software maker SAP to boost their footprint in the French technology sector was likely to catch the eye of investors.\nFacebook, whose chief operating officer Sheryl Sandberg met Macron in the gilded palace of Versailles, said it would double the number of staff at its Paris artificial intelligence (IA) hub, while Google will open its own IA center at its campus in the French capital.\n“Showcasing these projects will create a snowball effect,” a presidential adviser said. “When on the same day two groups like Google and Facebook make these announcements, it’s natural to expect more in the sector to rethink how they view France.”\nGermany’s SAP committed to spend more than two billion euros in France over five years to help it develop internet-based cloud services and other advanced technologies.\n“There is a real sense of economic momentum in France,” Bill McDermott, the American-born CEO of SAP said in statement after meeting Macron.\nSUN KING‘S PALACE\nSlideshow (3 Images) Eight months into his presidency, Macron is keen to convince the French that the tax cuts he is providing to corporates and millionaires are not a giveaway to the rich but can yield higher investment and curb an unemployment rate of nearly 10 percent.\nSome 140 of the world’s most powerful business executives had lunch at the Sun King’s palace outside Paris, where Prime Minister Edouard Philippe answered questions in English before “speed dating” sessions with French ministers.\nThe French premier also announced new measures to attract investors, including the opening of a new international court in March in Paris to handle English law disputes and 1,000 new places in multilingual schools from September\nThe summit dubbed “Choose France” is held just two days before Macron heads to the global elite’s annual gathering at Davos, making sure the event catches the top executives on their way to the Swiss Alps.\nIf the list of attendees - including Goldman Sachs’s ( GS.N ) Lloyd Blankfein and Google’s Sundar Pichai - is a sign of the 40-year old leader’s pulling power, it is also a reminder of France’s more pressing need for foreign investment to reduce a trade deficit of almost 50 billion euros.\nIn a study published last week, the COE-Rexecode think-tank said French companies had continued to lose market share to their euro zone rivals on global markets, with French goods and services accounting for 12.9 percent of the bloc’s exports last year, down from 13.2 percent in 2016 and 17 percent in 2000.\nIn 2016, France was the 16th highest recipient of foreign direct investments in the world, UN data showed, with $28 billion, well below Europe’s top two inflow hosts, Britain and the Netherlands, with $254 billion and $92 billion respectively.\nBut a flurry of smaller agrobusiness investment projects announced on Monday showed producing in France may be starting to become more attractive.\nU.S. giant General Mills ( GIS.N ) said it would invest 17 million to make more ice cream at Arras in the north, Korean company SPC said it would create a 20 million euro factory to make frozen pastry, while Florida-based Fresh Del Monte ( FDP.N ) would build a nine million euro fresh fruit factory.\nRelated Coverage France makes a new push to tempt bankers to Paris post-Brexit Germany's SAP backs Macron with 2 billion euro French spending plan Reporting by Michel Rose; additional reporting by Marine Pennetier; Editing by Richard Balmforth\n ", "external_links": [], "published": "2018-01-22T16:27:00.000+02:00", "crawled": "2018-01-22T20:11:01.002+02:00", "highlightTitle": ""}