{"organizations": [], "uuid": "5ee1f759a6e1d0edba9d59aef0df5fcb8ad40473", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-st-higher-on-gains-in-energy-industrial-stocks-idUSL4N1P64EW", "country": "US", "domain_rank": 408, "title": "US STOCKS-Wall St higher on gains in energy, industrial stocks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T18:32:00.000+02:00", "replies_count": 0, "uuid": "5ee1f759a6e1d0edba9d59aef0df5fcb8ad40473"}, "author": "", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-st-higher-on-gains-in-energy-industrial-stocks-idUSL4N1P64EW", "ord_in_thread": 0, "title": "US STOCKS-Wall St higher on gains in energy, industrial stocks", "locations": [], "entities": {"persons": [{"name": "sruthi shankar  jan", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "delta air lines", "sentiment": "none"}, {"name": "exxon", "sentiment": "none"}, {"name": "fujifilm", "sentiment": "none"}, {"name": "xerox", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "chevron", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 4:35 PM / Updated 4 minutes ago US STOCKS-Wall St higher on gains in energy, industrial stocks Reuters Staff \n* U.S. crude jumps above $64/barrel, tagging along energy stocks \n* Xerox rises on deal talks with Japan’s Fujifilm \n* U.S. producer prices dip 0.1 pct in Dec. vs est. of 0.2 pct rise \n* Indexes up: Dow 0.41 pct, S&P 0.30 pct, Nasdaq 0.31 pct (Changes comment, updates price, adds details) \nBy Sruthi Shankar \nJan 11 (Reuters) - U.S. stocks rose on Thursday as a jump in oil prices lifted energy stocks to their best day in more than a week and upbeat forecast from No. 2 U.S. carrier Delta Air Lines boosted other airline stocks. \nBrent crude rose above $70 a barrel and U.S. crude rose 1.54 percent to $64.56 per barrel, its highest since December 2014, boosted by a surprise drop in U.S. production and lower crude inventories. \nChevron rose about 2 percent and Exxon 1 percent, lifting the S&P energy index 1.45 percent to its best percentage gains since Jan. 3. \nDelta Air Lines rose 1.3 percent after reporting upbeat quarterly profit as well as forecast, helped by higher business fares in a busy holiday season. \nThat helped the Dow Jones U.S. Airlines index up 1.94 percent. \n“You see this continued rotation into stocks that will accelerate with the economy,” said Michael Antonelli, managing director of institutional sales trading at Robert W. Baird in Milwaukee. \n“Energy is in a good space with crude above 64 bucks and you have industrials being driven by airlines stocks.” \nAt 10:53 a.m. ET (1553 GMT), the Dow Jones Industrial Average was up 103.3 points, or 0.41 percent, at 25,472.43 and the S&P 500 was up 8.25 points, or 0.30 percent, at 2,756.48. \nThe Nasdaq Composite was up 22.22 points, or 0.31 percent, at 7,175.79. \nThe gains come a day after the indexes snapped their rally for the first time in 2018, over speculations that China would slow U.S. government bond purchases and that U.S. President Donald Trump would end a key trade agreement. \nThe focus turned to fourth-quarter earnings, which will get into full swing on Friday with the big U.S. lenders. \nEarnings for S&P 500 companies are expected to increase by 11.8 percent on an average, with the biggest contribution from the energy sector, according to Thomson Reuters I/B/E/S. \n“Expect some irregularities with respect to earnings in the quarter, but investors are looking beyond the impact of tax and how it hits the bottom line,” said Massud Ghaussy, director at Nasdaq Advisory Services. \nWal-Mart Inc, the world’s largest retailer, said it would raise entry-level wages for hourly employees to $11 an hour in February as a result of corporate tax cuts. \nXerox shares jumped 4 percent after the Wall Street Journal reported the copier maker was in deal talks with Japanese camera maker Fujifilm Holdings that could include a change in control of Xerox. \nU.S. producer prices fell in December for the first time in nearly 1-1/2 years amid declining costs for services, which could temper expectations that inflation will accelerate in 2018. \nOther data showed the number of Americans filing for unemployment increasing for the fourth straight week to more than a three-month high. \nAdvancing issues outnumbered decliners on the NYSE by 2,073 to 702. On the Nasdaq, 1,994 issues rose and 809 fell. (Reporting by Sruthi Shankar in Bengaluru; Editing by Saumyadeb Chakrabarty and Arun Koyyur)", "external_links": [], "published": "2018-01-11T18:32:00.000+02:00", "crawled": "2018-01-11T18:40:50.001+02:00", "highlightTitle": ""}