{"organizations": [], "uuid": "c5cf9d2c32e09a695d1c263a1b8f92e3703ccafc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220797131&w=1200&r=LYNXMPEE090KX", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-saudi-aramco-loans-exclusive/exclusive-saudi-aramco-working-to-raise-cheap-loans-before-ipo-banking-sources-idINKBN1EZ13X", "country": "US", "domain_rank": 408, "title": "Exclusive: Saudi Aramco working to raise cheap loans before IPO - banking sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T13:02:00.000+02:00", "replies_count": 0, "uuid": "c5cf9d2c32e09a695d1c263a1b8f92e3703ccafc"}, "author": "", "url": "https://in.reuters.com/article/us-saudi-aramco-loans-exclusive/exclusive-saudi-aramco-working-to-raise-cheap-loans-before-ipo-banking-sources-idINKBN1EZ13X", "ord_in_thread": 0, "title": "Exclusive: Saudi Aramco working to raise cheap loans before IPO - banking sources", "locations": [], "entities": {"persons": [{"name": "davide barbuscia", "sentiment": "none"}, {"name": "tom arnold", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "20th middle east", "sentiment": "none"}, {"name": "saudi aramco", "sentiment": "none"}, {"name": "manama", "sentiment": "none"}, {"name": "bahrain", "sentiment": "none"}], "organizations": [{"name": "saudi aramco", "sentiment": "negative"}, {"name": "citigroup", "sentiment": "none"}, {"name": "eca", "sentiment": "none"}, {"name": "standard chartered", "sentiment": "none"}, {"name": "sumitomo mitsui banking corporation", "sentiment": "none"}, {"name": "min read  dubai", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "citi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 11:09 AM / Updated 5 hours ago Exclusive: Saudi Aramco working to raise cheap loans before IPO - banking sources Davide Barbuscia , Tom Arnold 4 Min Read \nDUBAI (Reuters) - Saudi Aramco is working to secure billions of dollars in cheap loans from banks seeking to strengthen their ties with the oil giant before its stock listing, banking and export credit agency (ECA) sources said. FILE PHOTO: Logo of Saudi Aramco is seen at the 20th Middle East Oil & Gas Show and Conference (MOES 2017) in Manama, Bahrain, March 7, 2017. REUTERS/Hamad I Mohammed/File Photo \nCitigroup (Citi), Standard Chartered and Sumitomo Mitsui Banking Corporation were advising on the transactions, which two sources said could raise at least $5 billion to $6 billion, all with ECA-backing. \nThe bid to raise funds is the latest indication of Saudi Arabia’s push to ensure what could be the world’s biggest initial public offering (IPO) goes ahead in 2018, despite market speculation that sale plans might be delayed or even shelved. \nThe loans will offer slim returns - probably less than 1 percent a year - but the sources said the banks hoped to position themselves for more work as the kingdom proceeds with selling up to 5 percent of Aramco in an IPO that could value the firm at $2 trillion. \nFor its part, Aramco wants to leverage its balance sheet before the IPO, after which it could face higher costs because, once listed, it would cease to be a solely state-owned entity benefiting from cheap funds available to sovereign borrowers. \nECAs offer loan guarantees and sometimes financing to help remove political and other risks facing exporters, encouraging trade and lowering the costs of international business. \n“There’s momentum for Aramco to tap this form of financing. If they did it after the IPO, they’d have to pay more,” one banker said. \nCiti was advising Aramco for loans backed by British and U.S. ECAs, Standard Chartered was advising on ECA funding from continental Europe and Sumitomo Mitsui Banking Corporation was advising on transactions backed by Asian ECAs, the sources said. \nThe bank mandates expire in 2018, one of the sources said. \nCiti and Standard Chartered declined to comment. Aramco and Sumitomo Mitsui did not immediately respond to requests for comment. \nThe sources said it was difficult to establish Aramco’s precise needs due to its extensive spending plans and because the loans would finance both new and existing contracts. \nAramco has already obtained a $2 billion loan guaranteed by the UK Export Finance agency (UKEF). Citi had a lead role on that transaction. \nIt was now looking at deals which could involve the South Korean and Japanese ECAs, and at least one more deal that could involve a European ECA, the sources said. \nEach of these new loans was likely to be in the range of $2 billion dollars, the sources added. \nThe ECA-backed loans would typically come with tenors of up to 10 years at interest rates generally below 1 percent a year, two banking sources said. \nSuch low costs were determined by the credit quality of the borrower, a sovereign entity, and the structure of ECA-backed deals in which the agencies take part of the risk. \nBut it also indicated the readiness of banks to accept lower returns ahead of the IPO, the sources said. \nSaudi Aramco has invited banks pitching for roles in its stock market listing, including Citi and Goldman Sachs, to meetings in the kingdom in coming weeks to make their case, banking sources told Reuters this month. Editing by Edmund Blair", "external_links": [], "published": "2018-01-10T13:02:00.000+02:00", "crawled": "2018-01-10T13:14:03.004+02:00", "highlightTitle": ""}