{"organizations": [], "uuid": "f78504701587970efbfb15948a9173df640d2639", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-simon-property-group-reports-fourth-quarter-and-full-year-2017-results-and-raises-quarterly-dividend.html", "country": "US", "domain_rank": 767, "title": "Simon Property Group Reports Fourth Quarter And Full Year 2017 Results And Raises Quarterly Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:00:00.000+02:00", "replies_count": 0, "uuid": "f78504701587970efbfb15948a9173df640d2639"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-simon-property-group-reports-fourth-quarter-and-full-year-2017-results-and-raises-quarterly-dividend.html", "ord_in_thread": 0, "title": "Simon Property Group Reports Fourth Quarter And Full Year 2017 Results And Raises Quarterly Dividend", "locations": [], "entities": {"persons": [{"name": "simon", "sentiment": "negative"}], "locations": [{"name": "indianapolis", "sentiment": "none"}], "organizations": [{"name": "simon property group reports fourth", "sentiment": "negative"}, {"name": "simon property group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "INDIANAPOLIS, Jan. 31, 2018 /PRNewswire/ -- Simon, a global leader in premier shopping, dining and entertainment destinations, today reported results for the quarter and twelve months ended December 31, 2017.\nResults for the Year 1\nNet income attributable to common stockholders was $1.945 billion, or $6.24 per diluted share, as compared to $1.836 billion, or $5.87 per diluted share, in the prior year period. The 2017 and 2016 results include charges related to the redemption of certain senior notes of Simon Property Group, L.P. of $0.36 and $0.38 per diluted share, respectively. Funds from Operations (\"FFO\") was $4.021 billion, or $11.21 per diluted share, as compared to $3.793 billion, or $10.49 per diluted share, in the prior year period, an increase of 6.9%. The 2017 and 2016 results include the aforementioned charges related to the redemption of certain of our senior notes. Growth in comparable FFO per diluted share for the twelve months ended December 31, 2017 was 6.4%.\nResults for the Quarter 1\nNet income attributable to common stockholders was $571.1 million, or $1.84 per diluted share, as compared to $394.4 million, or $1.26 per diluted share, in the prior year period. Results for the fourth quarter of 2016 include a $0.38 per diluted share charge related to the redemption of certain senior notes. FFO was $1.115 billion, or $3.12 per diluted share, as compared to $912.2 million, or $2.53 per diluted share, in the prior year period. FFO in the fourth quarter of 2016 includes the aforementioned charge related to the redemption of certain of our senior notes. Growth in comparable FFO per diluted share for the three months ended December 31, 2017 was 7.2%.\n1 For a reconciliation of FFO and net income per diluted share on a comparable basis, please see Footnote J of the Footnotes to Unaudited Financial Information.\n\"We had a strong fourth quarter concluding another year of industry-leading growth with record earnings and dividends for our company,\" said David Simon, Chairman and Chief Executive Officer. \"In 2017, we opened five new centers, delivered six significant property transformations and expansions, and completed several major financing transactions that further enhanced our strong balance sheet. We continue to strengthen our portfolio through our innovative and disciplined investment activities that will allow us to continue to deliver cash flow and FFO per share growth.\"\nU.S. Malls and Premium Outlets Operating Statistics\nOccupancy was 95.6% at December 31, 2017. Base minimum rent per square foot was $53.11 at December 31, 2017, an increase of 2.9% compared to the prior year period. Leasing spread per square foot for the trailing 12-months ended December 31, 2017 was $7.42, an increase of 11.4%.\nPortfolio Net Operating Income (\"NOI\") and Comparable Property NOI\nTotal portfolio NOI growth for the twelve months ended December 31, 2017 was 4.5%. Total portfolio NOI includes comparable property NOI, NOI from new development, redevelopment, expansion and acquisitions, NOI from international properties and our share of NOI from investments. Comparable property NOI growth for the twelve months ended December 31, 2017 was 3.2%.\nDividends\nToday, Simon's Board of Directors declared a quarterly common stock dividend of $1.95 per share. This is an 11.4% increase year-over-year. The dividend will be payable on February 28, 2018 to stockholders of record on February 14, 2018.\nSimon's Board of Directors also declared the quarterly dividend on its 8 3/8% Series J Cumulative Redeemable Preferred Stock (NYSE: SPGPrJ) of $1.046875 per share, payable on March 30, 2018 to stockholders of record on March 16, 2018.\nDevelopment Activity\nDuring the quarter, the Company announced plans to create the Southeast's premier mixed-use development at Atlanta's Phipps Plaza, headlined by the arrival of a new Nobu Hotel and Nobu Atlanta Restaurant. Additional elements of this exciting new development call for a unique, curated dining experience, a 90,000 square-foot Life Time® Athletic healthy living and entertainment destination, and a 12-story Class A office building, complete with a three-story lower level parking garage. Construction is slated to commence in 2018 with a phased opening beginning in spring 2020.\nDuring the quarter, we started construction on two new development projects scheduled to open in 2018, including:\nMalaga Designer Outlet (Malaga, Spain); scheduled to open in November. Simon owns a 46% interest in this project. Queretaro Premium Outlets (Queretaro, Mexico); scheduled to open in December. Simon owns a 50% interest in this project.\nConstruction continues on two new development projects scheduled to open in 2018, including:\nPremium Outlet Collection Edmonton IA (Edmonton, Alberta, Canada); scheduled to open in May. Simon owns a 50% interest in this project. Denver Premium Outlets (Thornton, Colorado); scheduled to open in September. Simon owns 100% of this project.\nConstruction also continues on significant redevelopment and expansion projects at properties including Aventura Mall, Town Center at Boca Raton and Toronto Premium Outlets.\nAt quarter-end, redevelopment and expansion projects, including the addition of new anchors, were underway at 25 properties in the U.S., Canada and Asia.\nFinancing Activity\nThe Company was active in both the unsecured and secured credit markets in 2017, continuing to lower our effective borrowing costs.\nThe Company completed two senior notes offerings totaling $2.7 billion, with a weighted average coupon rate of 3.07% and a weighted average term of 7.9 years.\nDuring 2017, and subsequent to year-end, we retired three series of senior notes comprising approximately $2.6 billion at a weighted average coupon rate of 3.65%. The two new notes offerings had a weighted average coupon rate approximately 60 basis points lower than the notes that were retired.\nThe Company also amended and extended its $4.0 billion multi-currency revolving credit facility, which reduced pricing to LIBOR plus 77.5 basis points and extended the term to June 30, 2022.\nWith regard to secured debt activity, we closed or committed on 20 mortgage loans totaling approximately $2.9 billion, (U.S. dollar equivalent), of which Simon's share is $1.8 billion. The weighted average interest rate and weighted average term on these loans is 3.37% and 6.7 years, respectively.\nAs of December 31, 2017, Simon had approximately $8.0 billion of liquidity consisting of cash on hand, including its share of joint venture cash, and available capacity under its revolving credit facilities.\n2018 Guidance\nThe Company currently estimates net income to be within a range of $6.90 to $7.02 per diluted share for the year ending December 31, 2018 and that FFO will be within a range of $11.90 to $12.02 per diluted share.\nThe following table provides the reconciliation for the expected range of estimated net income available to common stockholders per diluted share to estimated FFO per diluted share:\nFor the year ending December 31, 2018\nLow\nHigh\nEnd\nEnd\nEstimated net income available to common stockholders\nper diluted share\n$6.90\n$7.02\nDepreciation and amortization including Simon's share\nof unconsolidated entities\n5.00\n5.00\nEstimated FFO per diluted share\n$11.90\n$12.02\nConference Call\nSimon will hold a conference call to discuss the quarterly financial results today at 8:30 a.m. Eastern Time, Wednesday, January 31, 2018. A live webcast of the conference call will be accessible in listen-only mode at investors.simon.com . An audio replay of the conference call will be available until February 6, 2018. To access the audio replay, dial 1-855-859-2056 (international 404-537-3406) passcode 4376318.\nSupplemental Materials and Website\nSupplemental information on our fourth quarter 2017 performance is available at investors.simon.com . This information has also been furnished to the SEC in a current report on Form 8-K.\nWe routinely post important information online at our investor relations website, investors.simon.com . We use this website, press releases, SEC filings, quarterly conference calls, presentations and webcasts to disclose material, non-public information in accordance with Regulation FD. We encourage members of the investment community to monitor these distribution channels for material disclosures. Any information accessed through our website is not incorporated by reference into, and is not a part of, this document.\nNon-GAAP Financial Measures\nThis press release includes FFO, FFO per share, comparable FFO per share, comparable earnings per share, portfolio net operating income growth and comparable property net operating income growth, which are financial performance measures not defined by generally accepted accounting principles in the United States (\"GAAP\"). Reconciliations of these non-GAAP financial measures to the most directly comparable GAAP measures are included in this press release and in Simon's supplemental information for the quarter. FFO and comparable property net operating income growth are financial performance measures widely used in the REIT industry. Our definitions of these non-GAAP measures may not be the same as similar measures reported by other REITs.\nForward-Looking Statements\nCertain statements made in this press release may be deemed \"forward‑looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Although the Company believes the expectations reflected in any forward‑looking statements are based on reasonable assumptions, the Company can give no assurance that its expectations will be attained, and it is possible that the Company's actual results may differ materially from those indicated by these forward‑looking statements due to a variety of risks, uncertainties and other factors. Such factors include, but are not limited to: changes in economic and market conditions that adversely affect the general retail environment; the potential loss of anchor stores or major tenants; the inability to collect rent due to the bankruptcy or insolvency of tenants or otherwise; decreases in market rental rates; the intensely competitive market environment in the retail industry; the inability to lease newly developed properties and renew leases and relet space at existing properties on favorable terms; risks related to international activities, including, without limitation, the impact of the United Kingdom's vote to leave the European Union; changes to applicable laws or regulations or the interpretation thereof; risks associated with the acquisition, development, redevelopment, expansion, leasing and management of properties; general risks related to real estate investments, including the illiquidity of real estate investments; the impact of our substantial indebtedness on our future operations; any disruption in the financial markets that adversely affects our ability to access capital for growth and satisfy our ongoing debt service requirements; any change in our credit rating; changes in market rates of interest and foreign exchange rates for foreign currencies; changes in the value of our investments in foreign entities; our ability to hedge interest rate and currency risk; our continued ability to maintain our status as a REIT; changes in tax laws or regulations that result in adverse tax consequences; risks relating to our joint venture properties; environmental liabilities; changes in insurance costs, the availability of comprehensive insurance coverage; security breaches that could compromise our information technology or infrastructure; natural disasters; the potential for terrorist activities; and the loss of key management personnel. The Company discusses these and other risks and uncertainties under the heading \"Risk Factors\" in its annual and quarterly periodic reports filed with the SEC. The Company may update that discussion in its periodic reports, but except as required by law, the Company undertakes no duty or obligation to update or revise these forward-looking statements, whether as a result of new information, future developments, or otherwise.\nAbout Simon\nSimon is a global leader in the ownership of premier shopping, dining, entertainment and mixed-use destinations and an S&P 100 company (Simon Property Group, NYSE:SPG). Our properties across North America, Europe and Asia provide community gathering places for millions of people every day and generate billions in annual sales. For more information, visit simon.com .\nSimon Property Group, Inc.\nUnaudited Consolidated Statements of Operations\n(Dollars in thousands, except per share amounts)\nFor the Three Months\nFor the Twelve Months\nEnded December 31,\nEnded December 31,\n2017\n2016\n2017\n2016\nREVENUE (1) :\nMinimum rent\n$ 880,475\n$ 874,937\n$ 3,440,009\n$ 3,358,498\nOverage rent\n52,870\n61,253\n147,471\n161,508\nTenant reimbursements\n386,767\n377,941\n1,532,923\n1,494,804\nManagement fees and other revenues\n30,400\n34,277\n121,259\n143,875\nOther income\n77,180\n77,558\n296,978\n276,544\nTotal revenue\n1,427,692\n1,425,966\n5,538,640\n5,435,229\nEXPENSES:\nProperty operating\n112,951\n104,479\n443,177\n432,394\nDepreciation and amortization\n325,187\n336,717\n1,275,452\n1,252,673\nReal estate taxes\n107,976\n110,374\n440,003\n439,030\nRepairs and maintenance\n24,247\n27,638\n96,900\n99,723\nAdvertising and promotion\n42,416\n38,896\n150,865\n142,801\nProvision for (recovery of) credit losses\n539\n(542)\n11,304\n7,319\nHome and regional office costs\n24,243\n37,867\n135,150\n158,406\nGeneral and administrative\n11,883\n19,939\n51,972\n65,082\nOther\n28,798\n50,097\n131,477\n116,973\nTotal operating expenses\n678,240\n725,465\n2,736,300\n2,714,401\nOPERATING INCOME\n749,452\n700,501\n2,802,340\n2,720,828\nInterest expense\n(204,986)\n(209,508)\n(809,393)\n(857,554)\nLoss on extinguishment of debt\n-\n(136,777)\n(128,618)\n(136,777)\nIncome and other taxes\n(6,362)\n(1,052)\n(23,343)\n(29,678)\nIncome from unconsolidated entities\n123,059\n94,344\n400,270\n353,334\n(Loss) gain upon acquisition of controlling interests and sale or disposal of\nassets and interests in unconsolidated entities, net\n(1,342)\n8,094\n3,647\n84,553\nCONSOLIDATED NET INCOME\n659,821\n455,602\n2,244,903\n2,134,706\nNet income attributable to noncontrolling interests\n87,871\n60,337\n296,941\n295,810\nPreferred dividends\n834\n834\n3,337\n3,337\nNET INCOME ATTRIBUTABLE TO COMMON STOCKHOLDERS\n$ 571,116\n$ 394,431\n$ 1,944,625\n$ 1,835,559\nBASIC AND DILUTED EARNINGS PER COMMON SHARE:\nNet income attributable to common stockholders\n$ 1.84\n$ 1.26\n$ 6.24\n$ 5.87\n(1) No revenue was recognized for the three months ended December 31, 2017 from the Company's two centers in Puerto Rico as a result of ongoing repair and restoration efforts due to the impact of Hurricane Maria.\nSimon Property Group, Inc.\nUnaudited Consolidated Balance Sheets\n(Dollars in thousands, except share amounts)\nDecember 31,\nDecember 31,\n2017\n2016\nASSETS:\nInvestment properties, at cost\n$ 36,393,464\n$ 35,226,089\nLess - accumulated depreciation\n11,935,949\n10,865,754\n24,457,515\n24,360,335\nCash and cash equivalents\n1,482,309\n560,059\nTenant receivables and accrued revenue, net\n742,672\n664,619\nInvestment in unconsolidated entities, at equity\n2,266,483\n2,367,583\nInvestment in Klépierre, at equity\n1,934,676\n1,797,394\nDeferred costs and other assets\n1,373,983\n1,353,588\nTotal assets\n$ 32,257,638\n$ 31,103,578\nLIABILITIES:\nMortgages and unsecured indebtedness\n$ 24,632,463\n$ 22,977,104\nAccounts payable, accrued expenses, intangibles, and deferred revenues\n1,269,190\n1,214,022\nCash distributions and losses in unconsolidated entities, at equity\n1,406,378\n1,359,738\nOther liabilities\n520,363\n455,040\nTotal liabilities\n27,828,394\n26,005,904\nCommitments and contingencies\nLimited partners' preferred interest in the Operating Partnership and noncontrolling\nredeemable interests in properties\n190,480\n137,762\nEQUITY:\nStockholders' Equity\nCapital stock (850,000,000 total shares authorized, $ 0.0001 par value, 238,000,000\nshares of excess common stock, 100,000,000 authorized shares of preferred stock):\nSeries J 8 3/8% cumulative redeemable preferred stock, 1,000,000 shares authorized,\n796,948 issued and outstanding with a liquidation value of $39,847\n43,077\n43,405\nCommon stock, $ 0.0001 par value, 511,990,000 shares authorized, 320,322,774 and\n319,823,322 issued and outstanding, respectively\n32\n32\nClass B common stock, $ 0.0001 par value, 10,000 shares authorized, 8,000\nissued and outstanding\n-\n-\nCapital in excess of par value\n9,614,748\n9,523,086\nAccumulated deficit\n(4,782,173)\n(4,459,387)\nAccumulated other comprehensive loss\n(110,453)\n(114,126)\nCommon stock held in treasury, at cost, 9,163,920 and 6,756,748 shares, respectively\n(1,079,063)\n(682,562)\nTotal stockholders' equity\n3,686,168\n4,310,448\nNoncontrolling interests\n552,596\n649,464\nTotal equity\n4,238,764\n4,959,912\nTotal liabilities and equity\n$ 32,257,638\n$ 31,103,578\nSimon Property Group, Inc.\nUnaudited Joint Venture Combined Statements of Operations\n(Dollars in thousands)\nFor the Three Months Ended\nDecember 31,\nFor the Twelve Months Ended\nDecember 31,\n2017\n2016\n2017\n2016\nREVENUE:\nMinimum rent\n$ 485,253\n$ 472,245\n$ 1,868,613\n$ 1,823,674\nOverage rent\n60,533\n59,047\n210,909\n200,638\nTenant reimbursements\n216,759\n216,160\n860,778\n862,155\nOther income\n80,225\n68,739\n290,515\n237,782\nTotal revenue\n842,770\n816,191\n3,230,815\n3,124,249\nOPERATING EXPENSES:\nProperty operating\n141,584\n136,284\n551,885\n538,002\nDepreciation and amortization\n170,402\n154,045\n640,286\n588,666\nReal estate taxes\n60,419\n58,126\n245,646\n239,917\nRepairs and maintenance\n21,797\n20,350\n81,309\n76,380\nAdvertising and promotion\n22,609\n26,766\n86,480\n88,956\n(Recovery of) provision for credit losses\n(984)\n2,162\n6,645\n7,603\nOther\n50,477\n49,786\n184,037\n183,435\nTotal operating expenses\n466,304\n447,519\n1,796,288\n1,722,959\nOPERATING INCOME\n376,466\n368,672\n1,434,527\n1,401,290\nInterest expense\n(154,669)\n(141,473)\n(593,062)\n(585,958)\n(Loss) gain on sale or disposal of assets and interests in unconsolidated entities\n(2,239)\n-\n(2,239)\n101,051\nNET INCOME\n$ 219,558\n$ 227,199\n$ 839,226\n$ 916,383\nThird-Party Investors' Share of Net Income\n$ 110,001\n$ 115,353\n$ 424,533\n$ 452,844\nOur Share of Net Income\n109,557\n111,846\n414,693\n463,539\nAmortization of Excess Investment (A)\n(21,760)\n(23,542)\n(89,804)\n(94,213)\nOur Share of Loss (Gain) on Sale or Disposal of Assets and Interests in\nUnconsolidated Entities, net\n1,342\n-\n1,342\n(22,636)\nOur Share of Gain on Sale or Disposal of Assets and Interests\nIncluded in Other Income in the Consolidated Financial Statements\n-\n-\n-\n(36,153)\nIncome from Unconsolidated Entities (B)\n$ 89,139\n$ 88,304\n$ 326,231\n$ 310,537\nNote: The above financial presentation does not include any information related to our investments in Klépierre S.A.\n(\"Klépierre\") and HBS Global Properties (\"HBS\"). For additional information, see footnote B.\nSimon Property Group, Inc.\nUnaudited Joint Venture Combined Balance Sheets\n(Dollars in thousands)\nDecember 31,\nDecember 31,\n2017\n2016\nAssets:\nInvestment properties, at cost\n$ 18,328,747\n$ 17,549,078\nLess - accumulated depreciation\n6,371,363\n5,892,960\n11,957,384\n11,656,118\nCash and cash equivalents\n956,084\n778,455\nTenant receivables and accrued revenue, net\n403,125\n348,139\nDeferred costs and other assets\n355,585\n351,098\nTotal assets\n$ 13,672,178\n$ 13,133,810\nLiabilities and Partners' Deficit:\nMortgages\n$ 14,784,310\n$ 14,237,576\nAccounts payable, accrued expenses, intangibles, and deferred revenue\n1,033,674\n867,003\nOther liabilities\n365,857\n325,078\nTotal liabilities\n16,183,841\n15,429,657\nPreferred units\n67,450\n67,450\nPartners' deficit\n(2,579,113)\n(2,363,297)\nTotal liabilities and partners' deficit\n$ 13,672,178\n$ 13,133,810\nOur Share of:\nPartners' deficit\n$ (1,144,620)\n$ (1,018,755)\nAdd: Excess Investment (A)\n1,733,063\n1,791,691\nOur net Investment in unconsolidated entities, at equity\n$ 588,443\n$ 772,936\nNote: The above financial presentation does not include any information related to our investments in Klépierre and\nHBS Global Properties. For additional information, see footnote B.\nSimon Property Group, Inc.\nUnaudited Reconciliation of Non-GAAP Financial Measures (C)\n(Amounts in thousands, except per share amounts)\nReconciliation of Consolidated Net Income to FFO\nFor the Three Months Ended\nFor the Twelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nConsolidated Net Income (D)\n$ 659,821\n$ 455,602\n$ 2,244,903\n$ 2,134,706\nAdjustments to Arrive at FFO:\nDepreciation and amortization from consolidated\nproperties\n321,397\n330,708\n1,260,865\n1,236,476\nOur share of depreciation and amortization from\nunconsolidated entities, including Klépierre and HBS\n139,026\n140,046\n540,718\n527,976\nLoss (gain) upon acquisition of controlling interests and sale or disposal\nof assets and interests in unconsolidated entities, net (E)\n1,342\n(8,094)\n(3,647)\n(80,154)\nNet income attributable to noncontrolling interest holders in\nproperties\n(734)\n(563)\n(13)\n(7,218)\nNoncontrolling interests portion of depreciation and amortization\n(4,248)\n(4,159)\n(17,069)\n(13,583)\nPreferred distributions and dividends\n(1,313)\n(1,313)\n(5,252)\n(5,252)\nFFO of the Operating Partnership (G)\n$ 1,115,291\n$ 912,227\n$ 4,020,505\n$ 3,792,951\nDiluted net income per share to diluted FFO per share reconciliation:\nDiluted net income per share\n$ 1.84\n$ 1.26\n$ 6.24\n$ 5.87\nDepreciation and amortization from consolidated properties\nand our share of depreciation and amortization from unconsolidated\nentities, including Klépierre and HBS, net of noncontrolling\ninterests portion of depreciation and amortization\n1.28\n1.29\n4.98\n4.84\nGain upon acquisition of controlling interests and sale or disposal\nof assets and interests in unconsolidated entities, net (F)\n-\n(0.02)\n(0.01)\n(0.22)\nDiluted FFO per share (H)\n$ 3.12\n$ 2.53\n$ 11.21\n$ 10.49\nDetails for per share calculations:\nFFO of the Operating Partnership (G)\n$ 1,115,291\n$ 912,227\n$ 4,020,505\n$ 3,792,951\nDiluted FFO allocable to unitholders\n(146,935)\n(119,780)\n(529,595)\n(512,361)\nDiluted FFO allocable to common stockholders (I)\n$ 968,356\n$ 792,447\n$ 3,490,910\n$ 3,280,590\nBasic and Diluted weighted average shares outstanding\n310,856\n313,685\n311,517\n312,691\nWeighted average limited partnership units outstanding\n47,169\n47,502\n47,260\n48,836\nBasic and Diluted weighted average shares and units outstanding\n358,025\n361,187\n358,777\n361,527\nBasic and Diluted FFO per Share (H)\n$ 3.12\n$ 2.53\n$ 11.21\n$ 10.49\nPercent Change\n23.3%\n6.9%\nSimon Property Group, Inc.\nFootnotes to Unaudited Financial Information\nNotes:\n(A)\nExcess investment represents the unamortized difference of our investment over equity in the underlying net assets of the related partnerships and joint ventures shown therein. The Company generally amortizes excess investment over the life of the related properties.\n(B)\nThe Unaudited Joint Venture Combined Statements of Operations do not include any operations or our share of net income or excess investment amortization related to our investments in Klépierre and HBS Global Properties. Amounts included in Footnotes D below exclude our share of related activity for our investments in Klépierre and HBS Global Properties. For further information on Klépierre, reference should be made to financial information in Klépierre's public filings and additional discussion and analysis in our Form 10-K.\n(C)\nThis report contains measures of financial or operating performance that are not specifically defined by GAAP, including FFO, FFO per share, comparable FFO per share and comparable EPS. FFO is a performance measure that is standard in the REIT business. We believe FFO provides investors with additional information concerning our operating performance and a basis to compare our performance with those of other REITs. We also use these measures internally to monitor the operating performance of our portfolio. Our computation of these non-GAAP measures may not be the same as similar measures reported by other REITs.\nWe determine FFO based upon the definition set forth by the National Association of Real Estate Investment Trusts (\"NAREIT\"). We determine FFO to be our share of consolidated net income computed in accordance with GAAP, excluding real estate related depreciation and amortization, excluding gains and losses from extraordinary items, excluding gains and losses from the sales or disposals of, or any impairment charges related to, previously depreciated retail operating properties, plus the allocable portion of FFO of unconsolidated joint ventures based upon economic ownership interest, and all determined on a consistent basis in accordance with GAAP.\nWe have adopted NAREIT's clarification of the definition of FFO that requires it to include the effects of nonrecurring items not classified as extraordinary, cumulative effect of accounting changes, or a gain or loss resulting from the sale or disposal of, or any impairment charges relating to, previously depreciated retail operating properties. We include in FFO gains and losses realized from the sale of land, outlot buildings, marketable and non-marketable securities, and investment holdings of non-retail real estate. However, you should understand that FFO does not represent cash flow from operations as defined by GAAP, should not be considered as an alternative to net income determined in accordance with GAAP as a measure of operating performance, and is not an alternative to cash flows as a measure of liquidity.\n(D)\nIncludes our share of:\n-\nGains on land sales of $2.2 million and $8.8 million for the three months ended December 31, 2017 and 2016, respectively, and $12.3 million and $14.0 million for the twelve months ended December 31, 2017 and 2016, respectively.\n-\nStraight-line adjustments increased income by $7.4 million and $12.5 million for the three months ended December 31, 2017 and 2016, respectively, and $34.5 million and $56.8 million for the twelve months ended December 31, 2017 and 2016, respectively.\n-\nAmortization of fair market value of leases from acquisitions increased income by $1.4 million and $2.3 million for the three months ended December 31, 2017 and 2016, respectively, and $6.0 million and $9.6 million for the twelve months ended December 31, 2017 and 2016, respectively.\n-\nDebt premium amortization of $0.0 million and $5.1 million for the three months ended December 31, 2017 and 2016, respectively, and $0.2 million and $19.0 million for the twelve months ended December 31, 2017 and 2016, respectively.\n(E)\nGain upon acquisition of controlling interests and sale or disposal of assets and interests in unconsolidated entities for the three and twelve months ended December 31, 2016 was $8.1 million and $84.6 million, respectively. Noncontrolling interest portion of the gain for the three and twelve months ended December 31, 2016 was $0.0 million and $4.4 million, respectively.\n(F)\nIncludes noncontrolling interests gain upon acquisition of controlling interests and sale or disposal of assets and interests in unconsolidated entities of $0.01 per share for the twelve months ended December 31, 2016.\n(G)\nIncludes a loss on the extinguishment of debt of $128.6 million for the twelve months ended December 31, 2017. Includes a loss on the extinguishment of debt of $136.8 million for the three and twelve months ended December 31, 2016.\n(H)\nIncludes Basic and Diluted FFO per share related to a loss on the extinguishment of debt of $0.36 for the twelve months ended December 31, 2017. Includes Basic and Diluted FFO per share related to a loss on the extinguishment of debt of $0.38 for the three and twelve months ended December 31, 2016.\n(I)\nIncludes Diluted FFO allocable to common stockholders related to a loss on the extinguishment of debt of $111.7 million for the twelve months ended December 31, 2017. Includes Diluted FFO allocable to common stockholders related to a loss on the extinguishment of debt of $118.3 million for the three and twelve months ended December 31, 2016.\n(J)\nReconciliation of reported earnings per share to comparable earnings per share and FFO per share to comparable FFO per share:\nTHREE MONTHS\nTWELVE MONTHS\nENDED\nENDED\nDECEMBER 31,\nDECEMBER 31,\n2017\n2016\n2017\n2016\nReported earnings per share\n$ 1.84\n$ 1.26\n$ 6.24\n$ 5.87\nAdd: Loss on extinguishment of debt\n-\n0.38\n0.36\n0.38\nComparable earnings per share\n$ 1.84\n$ 1.64\n$ 6.60\n$ 6.25\nComparable earnings per share growth\n12.2%\n5.6%\nTHREE MONTHS\nTWELVE MONTHS\nENDED\nENDED\nDECEMBER 31,\nDECEMBER 31,\n2017\n2016\n2017\n2016\nReported FFO per share\n$ 3.12\n$ 2.53\n$ 11.21\n$ 10.49\nAdd: Loss on extinguishment of debt\n-\n0.38\n0.36\n0.38\nComparable FFO per share\n$ 3.12\n$ 2.91\n$ 11.57\n$ 10.87\nComparable FFO per share growth\n7.2%\n6.4%\nView original content with multimedia: http://www.prnewswire.com/news-releases/simon-property-group-reports-fourth-quarter-and-full-year-2017-results-and-raises-quarterly-dividend-300590756.html\nSOURCE Simon", "external_links": ["http://www.prnewswire.com/news-releases/simon-property-group-reports-fourth-quarter-and-full-year-2017-results-and-raises-quarterly-dividend-300590756.html", "http://investors.simon.com/"], "published": "2018-01-31T15:00:00.000+02:00", "crawled": "2018-01-31T15:52:07.002+02:00", "highlightTitle": ""}