{"organizations": [], "uuid": "39f67f464181c907254ed1a36c660a2f96a43edc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-vuzix-announces-closing-of-above-market-30000000-offering.html", "country": "US", "domain_rank": 767, "title": "Vuzix Announces Closing of Above Market $30,000,000 Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T21:15:00.000+02:00", "replies_count": 0, "uuid": "39f67f464181c907254ed1a36c660a2f96a43edc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-vuzix-announces-closing-of-above-market-30000000-offering.html", "ord_in_thread": 0, "title": "Vuzix Announces Closing of Above Market $30,000,000 Offering", "locations": [], "entities": {"persons": [{"name": "chardan", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "rochester", "sentiment": "none"}], "organizations": [{"name": "securities and exchange commission", "sentiment": "none"}, {"name": "maxim group llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROCHESTER, N.Y., Jan. 29, 2018 /PRNewswire/ -- Vuzix® Corporation (NASDAQ: VUZI), a supplier of Smart Glasses and Augmented Reality (AR) products in the consumer and enterprise markets, today announced that it closed the previously announced US$30.0 million registered direct offering on January 26, 2018. The company entered into agreements on January 24, 2018 relating to the sale of 3,000,000 shares of its common stock at an offering price of $10.00 per share together with a 40% one-year warrant to purchase an aggregate 1,200,000 shares of its common stock at $10.00 per share, which will be immediately exercisable for a period of one year. The gross proceeds from the offering were $30,000,000 before deducting commissions and estimated offering expenses. Chardan acted as the lead placement agent for this transaction and Maxim Group LLC acted as a co-placement agent for this transaction. The company has filed a prospectus with the Securities and Exchange Commission, which can be viewed at https://ir.vuzix.com/all-sec-filings/content/0001144204-18-003905/tv484137_424b5.htm .\nThe Company estimates the net proceeds from this offering are approximately $28.4 million, after deducting placement agent fees and estimated offering expenses payable. As noted earlier, the Company intends to use the net proceeds from the offering for general corporate purposes, including expanding its product offering and the commercial launch of its Blade Smart Glasses, featuring its proprietary waveguide technology products and for general working capital purposes.\n\"We believe the success of this offering by institutional investors represents their confidence in our future, as the adoption of wearable technology in the workplace and consumer sector continues to gain steam,\" said Paul Travers, President and Chief Executive Officer at Vuzix. \"With the new funds, we have significantly improved our balance sheet, which gives us tremendous financial flexibility to continue to advance our new Blade Smart Glasses and waveguide technologies and be a stronger supplier to potential OEMs. In response to organic demand from consumers and enterprise customers alike we expect to begin ramping production of the Vuzix Blade by end of the first quarter putting the company in position to deliver in volume beginning in the second quarter of 2018.\"\nThis press release does not constitute an offer to sell, or the solicitation of an offer to buy, any securities described herein, nor will there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Vuzix Corporation\nVuzix is a leading supplier of Smart-Glasses and Augmented Reality (AR) technologies and products for the consumer and enterprise markets. The Company's products include personal display and wearable computing devices that offer users a portable high-quality viewing experience, provide solutions for mobility, wearable displays and virtual and augmented reality. Vuzix holds 59 patents and 42 additional patents pending and numerous IP licenses in the Video Eyewear field. The Company has won Consumer Electronics Show (or CES) awards for innovation for the years 2005 to 2018 and several wireless technology innovation awards among others. Founded in 1997, Vuzix is a public company (NASDAQ: VUZI) with offices in Rochester, NY, Oxford, UK and Tokyo, Japan.\nForward-Looking Statements Disclaimer\nCertain statements contained in this news release are \"forward-looking statements\" within the meaning of the Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. Forward looking statements contained in this release relate to the new Blade 3000 Smart Glasses, our latest waveguides, their technological advancements and proposed features, potential OEM opportunities, use of proceeds, capital needs, and among other things, the Company's leadership in the Smart Glasses and AR display industry. They are generally identified by words such as \"believes,\" \"may,\" \"expects,\" \"anticipates,\" \"should\" and similar expressions. Readers should not place undue reliance on such forward-looking statements, which are based upon the Company's beliefs and assumptions as of the date of this release. The Company's actual results could differ materially due to risk factors and other items described in more detail in the \"Risk Factors\" section of the Company's Annual Reports and MD&A filed with the United States Securities and Exchange Commission and applicable Canadian securities regulators (copies of which may be obtained at www.sedar.com or www.sec.gov ). Subsequent events and developments may cause these forward-looking statements to change. The Company specifically disclaims any obligation or intention to update or revise these forward-looking statements as a result of changed events or circumstances that occur after the date of this release, except as required by applicable law.\nFor further information:\nMedia and Investor Relations Contact:\nMatt Margolis, Director of Corporate Communications and Investor Relations, Vuzix Corporation\nmatt_margolis@vuzix.com Tel: (585) 359-5952\nAndrew Haag, Managing Partner, IRTH Communications\nvuzi@irthcommunications.com Tel: (866) 976-4784\nVuzix Corporation, 25 Hendrix Road, Suite A, West Henrietta, NY 14586 USA,\nInvestor Information – IR@vuzix.com www.vuzix.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/vuzix-announces-closing-of-above-market-3 -offering-300589612.html\nSOURCE Vuzix Corporation", "external_links": ["http://www.vuzix.com/", "http://www.prnewswire.com/news-releases/vuzix-announces-closing-of-above-market-30000000-offering-300589612.html", "https://ir.vuzix.com/all-sec-filings/content/0001144204-18-003905/tv484137_424b5.htm"], "published": "2018-01-29T21:15:00.000+02:00", "crawled": "2018-01-30T00:36:35.001+02:00", "highlightTitle": ""}