{"organizations": [], "uuid": "24ee76d83e35dd300b1888e24591ef59a46a239c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225947167&w=1200&r=LYNXMPEE0R03I", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-afghanistan-blast/afghan-capital-in-shock-after-deadly-ambulance-bomb-attack-idUKKBN1FH04A", "country": "US", "domain_rank": 408, "title": "Afghan capital in shock after deadly ambulance bomb attack", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T07:39:00.000+02:00", "replies_count": 0, "uuid": "24ee76d83e35dd300b1888e24591ef59a46a239c"}, "author": "", "url": "https://uk.reuters.com/article/uk-afghanistan-blast/afghan-capital-in-shock-after-deadly-ambulance-bomb-attack-idUKKBN1FH04A", "ord_in_thread": 0, "title": "Afghan capital in shock after deadly ambulance bomb attack", "locations": [], "entities": {"persons": [{"name": "akram wali", "sentiment": "negative"}, {"name": "mohammad hanif", "sentiment": "none"}], "locations": [{"name": "kabul", "sentiment": "none"}], "organizations": [{"name": "taliban", "sentiment": "none"}, {"name": "min read  kabul", "sentiment": "none"}, {"name": "intercontinental hotel", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 5:41 AM / Updated 2 hours ago Shock gives way to despair in Kabul after ambulance bomb Akram Walizada 5 Min Read \nKABUL (Reuters) - Kabul was in despair on Sunday, a day after a Taliban suicide bomber killed more than 100 people and wounded at least 235 in the worst attack in the Afghan capital in months. \nA week ago, the Taliban killed more than 20 people in a siege of the city’s Intercontinental Hotel. Another six people were killed in an assault claimed by Islamic State on the office of aid group Save the Children in the eastern city of Jalalabad. \nDespite pressure on President Ashraf Ghani’s Western-backed government to improve security, the attacks show no sign of abating, giving rise to helpless anger among residents. \n“How are we to live? Where should we go?” asked shopkeeper Mohammad Hanif, who was in his shop near the site of the explosion when it went off. \nInterior Minister Wais Barmak said the casualty toll had risen to at least 103 dead and 235 wounded. He said at least two vehicles painted as ambulances were involved in the attack, one of which blew up at when it was stopped at a police checkpoint. \nSecurity officials have warned of possible further attacks. \nThe Taliban said their attack was intended as a message to U.S. President Donald Trump who last year sent more American troops to Afghanistan and ordered an increase in air strikes and other assistance to Afghan forces. \n“The Islamic Emirate has a clear message for Trump and his hand kissers that if you go ahead with a policy of aggression and speak from the barrel of a gun, don’t expect Afghans to grow flowers in response,” Taliban spokesman Zabihullah Mujahid said in a statement, using the term the use to describe themselves. \nThe attack in one of the most heavily protected parts of the city, close to foreign embassies and government buildings, was the worst seen in the Afghan capital since a truck bomb near the German embassy killed 150 people in May. \n“People were running everywhere to escape, there were wounded people lying on the ground, people with wounds to their arms, legs, heads,” Hanif said. \nDespite a major tightening in checks following the May 31 attack, the ambulance was able to get through the checkpoints, apparently without difficulty. \n“People don’t have work. There’s no life for people in Afghanistan. People have to look for a life somewhere else, there’s nowhere,” said shopkeeper Sameem. \nWith Ghani embroiled in confrontation with provincial powerbrokers defying central rule, pressure is mounting on the government to set aside political divisions and focus on security. \n“The situation is absolutely unacceptable to the people,” said a former government minister, Abdul Hadi Arghandiwal. An Afghan shopkeeper looks at the broken glass window of his shop near the site of a bomb attack in Kabul, Afghanistan, January 28, 2018. REUTERS/Omar Sobhani \n“The government spends a lot of time and energy in political rivalry and infighting at a time when it has to pay more attention to security.” \n‘TERRORIST WAR’ \nFormer U.S. ambassador to Afghanistan Zalmay Khalilzad called for Ghani’s government and its main political rival, powerful northern leader Atta Mohammad Noor, to “come together and resolve their differences”. \n“Fighting terrorism and protecting the people is job one. I hope they rise to the occasion,” Khalilzad said on Twitter. Slideshow (7 Images) \nSaturday’s attack, described as “an atrocity” by the head of the U.N. mission in Afghanistan, drew universal condemnation from neighbouring countries and allies who had expressed confidence that the new U.S. strategy was producing results. \nFollowing a recent visit to Kabul, the U.S. ambassador to the United Nations, Nikki Haley, said the strategy was working and pushing the insurgents closer to peace talks. \nHowever, the Taliban have dismissed any suggestion that they have been weakened by the U.S. approach and say they will only agree to talks when international forces leave Afghanistan. \nThe United States, which has accused Pakistan of helping the Taliban and has cut off some aid, urged all countries to take “decisive action” to stop the violence. \nAfghan officials also say the insurgency is being directed from outside their country. \n“This is not a civil war, this is a terrorist war imposed on the Afghan people,” said Masoom Stanekzai, head of Afghanistan’s main intelligence agency. \n“This is a war in which the Afghan people are being used as tools and burned like firewood every day.” \nPakistan, which denies accusations it fosters the Afghan war to undermine old rival India’s growing influence there, condemned the attack and called for “concerted efforts and effective cooperation ... to eradicate the scourge of terrorism”. \nAfghanistan declared Sunday a day of mourning and said Monday would be a day off to allow care of the victims’ families. Joko Widodo, president of Indonesia, which has the world’s biggest Muslim population, was due to visit Kabul on Monday, Ghani’s office said. \nWidodo has proposed that Indonesian Islamic scholars could help promote Afghan peace, media reported recently. Additonal reporting by James Mackenzie, Robert Birsel and Hamid Shalizi; Editing by Robert Birsel and Raissa Kasolowsky", "external_links": [], "published": "2018-01-28T07:39:00.000+02:00", "crawled": "2018-01-28T07:57:28.004+02:00", "highlightTitle": ""}