{"organizations": [], "uuid": "2921c072badb481fc9dbe4aa03d95520aa1f3657", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/5000148_1_low.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/porsche-911-gts-carrera-review/", "country": "US", "domain_rank": 1196, "title": "Porsche 911 Carrera GTS Review: The Most Thrilling Drive Under $150K | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.158, "site_type": "news", "published": "2018-01-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "2921c072badb481fc9dbe4aa03d95520aa1f3657"}, "author": "Daniel Bentley", "url": "http://fortune.com/2018/01/24/porsche-911-gts-carrera-review/", "ord_in_thread": 0, "title": "Porsche 911 Carrera GTS Review: The Most Thrilling Drive Under $150K | Fortune", "locations": [], "entities": {"persons": [{"name": "rossen ga", "sentiment": "negative"}, {"name": "daniel bentley", "sentiment": "none"}], "locations": [{"name": "carrera", "sentiment": "none"}, {"name": "stuttgart", "sentiment": "none"}], "organizations": [{"name": "porsche", "sentiment": "negative"}, {"name": "carrera", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Porsche 911 Carrera GTS: Balanced, Bracing, and the Best Driving Experience Under $150,000 Rossen Gargolov www.r-photography.info By Daniel Bentley January 24, 2018 \nPorsche, the famed German automaker, makes a lot of 911s. A glance at Porsche’s website reveals 23 different variants of the Stuttgart company’s enduring sports car, from the simply appointed 911 Carrera (starting at $91,000) to its steroidal new supercar the 911 GT2 RS (from $293,000). \nHow is one to choose? \nThe answer: Aim for the middle. At the top end of the Carrera line but below the 911 Turbo models, you’ll find Porsche’s GTS line. Starting at $120,700—you did say you wanted a Porsche, didn’t you?—it’s comfortably the best value 911 that the carmaker offers. In essence, the GTS is a 911 Carrera S model with a plethora of performance options added. (If you were to add those options to the actual Carrera S, it would cost you about 10% more than if you simply opted for the GTS. See? I told you it was good value.) In other words, it’s just right. \nMy test vehicle was a 911 GTS coupe with rear wheel drive and a manual gearbox, which for many auto enthusiasts is the purest expression of the 911. (Convertible and targa body styles, a dual-clutch automatic transmission, and all-wheel drive are also available.) \nThe first indication that Porsche built the 911 GTS as a driver’s car is the steering wheel. Wrapped in a suede-like material called Alcantara, it is unencumbered by the plethora of plastic buttons manufacturers choose to place on today’s steering wheels. There is just one rotary switch to quickly select between the car’s four driving modes: Normal, Sport, Sport+, and the user-configurable Individual. Everything else—stereo volume, cruise control, voice assistance, phone controls—is relegated to panels and attached to the steering column. This design decision may sound minor, I realize, and possibly even inconvenient to some people. But to this driver, it creates a sort of feng shui where the only focus becomes the wheel, the shift lever, and the three pedals in the foot well. As it should be, at least in a 911. \nA word on those three pedals. It is a delight that in 2018 you can still buy a high-performance sports car with a manual transmission. So many of Porsche’s competitors limit their customers to technically superior (but decidedly less fun) dual-clutch automatics. The 7-speed gearbox in the 911 GTS throws short, engages with purpose, and has a delightful trick on downshifts where the car’s throttle blips to simulate an advanced driving maneuver known as “heel-toe” shifting—something real advanced drivers can turn off if they so choose. And, as previously mentioned, the GTS if available with Porsche’s excellent PDK automatic transmission. \nThe 911 GTS entertainment system comes with SiriusXM and Bluetooth and Apple CarPlay and everything else you’d expect from a modern vehicle. But reader, mea culpa : I never turned it on for a second. To do so would mask the glorious exhaust note radiating from the car’s rear. Porsche’s sport exhaust has a built-in silencer that engages while the car is in Normal driving mode. But switch to Sport mode and the full-throated 911 appears—every grunt, gurgle, pop, and crackle is unleashed. It is a riot, if not a tad obnoxious while driving through residential areas. Use at your own discretion. \nHorsepower is a respectable 450, and Porsche claims the car will go from 0 to 60 mph in 3.9 seconds, 3.5 seconds flat with the PDK transmission (one suspects they are being a tad conservative with these numbers). But let’s be honest: This is a car for which technical specifications matter little when you’re out on the road and fully engaged. Equipped with optional rear-axle steering, my GTS took the challenging corners of New York’s Bear Mountain with aplomb. Rowing between second and fifth gears with spirited acceleration is among the more thrilling driving experiences you can have, and easily the best I’ve experienced in a car under $150,000. Porsche 911 Carrera GTS ", "external_links": [], "published": "2018-01-05T02:00:00.000+02:00", "crawled": "2018-01-25T02:26:09.007+02:00", "highlightTitle": ""}