{"organizations": [], "uuid": "cae68d62b62e19cd17912931054f2e31be02eea8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/mrv-engenharia-sales/update-1-brazils-mrv-home-sales-jump-amid-real-estate-turnaround-idUSL1N1PB1QS", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Brazil's MRV home sales jump amid real estate turnaround", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T04:51:00.000+02:00", "replies_count": 0, "uuid": "cae68d62b62e19cd17912931054f2e31be02eea8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/mrv-engenharia-sales/update-1-brazils-mrv-home-sales-jump-amid-real-estate-turnaround-idUSL1N1PB1QS", "ord_in_thread": 0, "title": "UPDATE 2-Brazil's MRV home sales jump amid real estate turnaround", "locations": [], "entities": {"persons": [{"name": "gabriela mello sao paulo", "sentiment": "negative"}, {"name": "rafael menin", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "mrv", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "mrv engenharia", "sentiment": "none"}, {"name": "participações sa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details on investment plans, context)\nBy Gabriela Mello\nSAO PAULO, Jan 16 (Reuters) - Contracted sales at MRV Engenharia e Participações SA jumped 34.2 percent in the fourth quarter year-on-year, reaching 1.7 billion reais ($527 million), as Brazil’s largest homebuilder benefits from a nationwide real estate rebound.\nThe company said in a statement on Tuesday that it sold 11,800 units in the final three months of 2017, bringing the full-year total to 40,500, a rise of 15.1 percent from last year.\nNew project launches also rose to 1.67 billion reais, jumping 56 percent in the fourth quarter from last year and 18 percent from the third quarter, as the company begins to monetize an expansive portfolio of land it owns. The company is continuing to buy up land, and in the fourth quarter it purchased 39 plots that represent an estimated 3.2 billion reais in potential sales.\n“We bought a lot (of land) in 2014, 2015, 2016, and 2017 in a countercyclical moment, and we see ourselves in a very favorable situation in relation to the rest of the market in this respect,” CEO Rafael Menin told Reuters in an interview.\nBudget restrictions at state bank Caixa Economica Federal, which often funds low-income housing programs, held the company back from even higher fourth-quarter growth, he said, causing 100 million reais in lost sales.\nIn December, MRV executives unveiled plans to start construction on 50,000 new home units in 2018, which they said could generate 7.5 billion reais in sales, a development that sent shares up more than 5 percent in intraday trading. The company, which has focused on Brazil’s lower income segment in recent years, added that it would resume operations in the middle-income market.\nMenin on Tuesday said the company would in 2018 dedicate at least 10 percent of its land bank to projects considered too upscale for Brazil’s popular ‘Minha Casa, Minda Vida’ housing subsidy program.\nMRV’s sales numbers and expansion plans underscore a real estate rebound taking place in Latin America’s largest economy, after a severe downturn battered the market and lead to several major bankruptcies.\nSmaller competitors such as Construtora Tenda SA and Eztec Empreendimentos e Participações SA have also announced aggressive construction plans for 2018.\n$1 = 3.23 reais Reporting by Gabriela Mello; Writing by Gram Slattery; Editing by Cynthia Osterman and Grant McCool\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T04:51:00.000+02:00", "crawled": "2018-01-17T19:57:17.002+02:00", "highlightTitle": ""}