{"organizations": [], "uuid": "a8204e702ec6b518c53109a2872fddbe72463de4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223174220&w=1200&r=LYNXMPEE0H273", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-court-election/supreme-court-blocks-redraw-of-north-carolina-congressional-maps-idUSKBN1F73C1", "country": "US", "domain_rank": 408, "title": "Supreme Court blocks redraw of North Carolina congressional maps", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T01:34:00.000+02:00", "replies_count": 0, "uuid": "a8204e702ec6b518c53109a2872fddbe72463de4"}, "author": "", "url": "https://www.reuters.com/article/us-usa-court-election/supreme-court-blocks-redraw-of-north-carolina-congressional-maps-idUSKBN1F73C1", "ord_in_thread": 0, "title": "Supreme Court blocks redraw of North Carolina congressional maps", "locations": [], "entities": {"persons": [{"name": "andrew chung", "sentiment": "none"}, {"name": "will dunham", "sentiment": "none"}], "locations": [{"name": "north carolina", "sentiment": "none"}, {"name": "greensboro", "sentiment": "none"}], "organizations": [{"name": "supreme court", "sentiment": "negative"}, {"name": "u.s. house of representatives", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "general assembly", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 11:35 PM / in an hour Supreme Court blocks redrawing of North Carolina congressional maps Andrew Chung 3 Min Read \n(Reuters) - The U.S. Supreme Court on Thursday blocked a lower court’s order for North Carolina to rework its congressional map because Republicans violated the Constitution by drawing electoral districts intended to maximize their party’s chances of winning. \nThe conservative-majority court granted a bid by Republican legislators in North Carolina to suspend the Jan. 9 order by a federal court panel in Greensboro that gave the Republican-controlled General Assembly until Jan. 24 to come up with a new map for U.S. House of Representatives districts. \nTwo liberal justices, Ruth Bader Ginsburg and Sonia Sotomayor, objected to the high court’s action. \nThe Supreme Court’s decision to stay the order reduces the chance that the current district lines will be altered ahead of the November mid-term congressional elections. The court offered no reason for its decision. \nThe three-judge panel ruled that the Republican-drawn districts violated the U.S. Constitution’s guarantee of equal protection under the law by intentionally hobbling the electoral strength of non-Republican voters. Two of the three judges also said the plan ran afoul of the Constitution’s First Amendment by discriminating based on political belief and association. \nThose judges on Tuesday refused to put the ruling on hold. \nNorth Carolina’s congressional maps were challenged in two lawsuits by more than two dozen Democratic voters, the North Carolina Democratic Party and other groups. \nUnder current North Carolina congressional boundaries, Republicans won 10 of the 13 House districts in 2016, despite getting just 53 percent of the statewide vote. \nThe Supreme Court is currently examining two other cases from Wisconsin and Maryland involving claims that electoral districts were manipulated to keep the majority party in power in a manner that violated voters’ constitutional rights. That practice is called partisan gerrymandering. \nIn the Wisconsin case, Democratic voters are challenging Republican-drawn legislative districts. In the Maryland case, Republicans are claiming Democratic lawmakers drew a congressional district in a way that would prevent a Republican candidate from winning. \nThe North Carolina dispute centers on a congressional redistricting plan adopted by the Republican-led legislature in 2016. The Republican lawmaker in charge of the plan said it was crafted to favor his party because he thinks “electing Republicans is better than electing Democrats.” \n“But that is not a choice the Constitution allows legislative mapdrawers to make,” the lower court said in unanimously striking down the plan. Reporting by Andrew Chung; Editing by Will Dunham", "external_links": [], "published": "2018-01-19T01:34:00.000+02:00", "crawled": "2018-01-19T01:44:46.006+02:00", "highlightTitle": ""}