{"organizations": [], "uuid": "32ff06d032839978af978c3f58b75353851bd7f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220634714&w=1200&r=LYNXMPEE081GW", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-safrica-politics-zuma/south-africas-zuma-says-commission-to-look-into-claims-of-state-influence-peddling-idUSKBN1EY280", "country": "US", "domain_rank": 408, "title": "Zuma setting up commission to look into allegations of state corruption", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T02:14:00.000+02:00", "replies_count": 0, "uuid": "32ff06d032839978af978c3f58b75353851bd7f2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-safrica-politics-zuma/south-africas-zuma-says-commission-to-look-into-claims-of-state-influence-peddling-idUSKBN1EY280", "ord_in_thread": 0, "title": "Zuma setting up commission to look into allegations of state corruption", "locations": [], "entities": {"persons": [{"name": "zuma", "sentiment": "negative"}, {"name": "jacob zuma", "sentiment": "negative"}, {"name": "ramaphosa", "sentiment": "none"}, {"name": "cyril ramaphosa", "sentiment": "none"}], "locations": [{"name": "johannesburg", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "high court", "sentiment": "none"}, {"name": "anc", "sentiment": "none"}, {"name": "african national congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG (Reuters) - South African President Jacob Zuma said on Tuesday he will set up a commission of inquiry into allegations of influence-peddling, after a 2016 anti-graft report called for a judge to investigate any corruption in his government.\nZuma was ordered to establish the inquiry within 30 days of a High Court ruling last month, which upheld the recommendations of South Africa’s corruption-fighting Public Protector.\n“I am concerned that this matter has occupied the public mind for some time now and deserves urgent attention,” Zuma said in a statement.\nZuma’s announcement comes a day before a meeting of the ruling African National Congress executive committee amid speculation that new party leader Cyril Ramaphosa and his allies are lobbying members to oust Zuma as head of state.\nRamaphosa, who is also deputy president, publicly supports Zuma, whose term does not officially end until 2019 when elections will be held, but he could be removed early through a motion of no confidence in parliament or at the ANC meeting.\nFILE PHOTO: President of South Africa Jacob Zuma gestures during the 54th National Conference of the ruling African National Congress (ANC) at the Nasrec Expo Centre in Johannesburg, South Africa December 16, 2017. REUTERS/Siphiwe Sibeko/File Photo The 75-year-old president has faced and denied numerous corruption allegations since taking office in 2009 and has survived several votes of no-confidence in parliament.\nZuma had challenged the right of the Public Protector to call for a judicial inquiry and the appointment by the chief justice of a judge to head it, saying it was the president’s prerogative whether to set up such an inquiry.\nFILE PHOTO: South Africa's President Jacob Zuma attends the 37th Ordinary SADC Summit of Heads of State and Government in the capital, Pretoria, South Africa, August 19, 2017. REUTERS/Siphiwe Sibeko/File Photo Zuma had also previously sought to block the release of the 2016 report, entitled “State of Capture”, which focused on allegations that Zuma’s friends, the businessmen and brothers Ajay, Atul and Rajesh Gupta, had influenced the appointment of ministers.\nZuma and the Guptas have denied all accusations of wrongdoing.\nDeputy Chief Justice Raymond Zondo, selected by the Chief Justice will head the commission, Zuma said in the statement.\nReporting by Tanisha Heiberg; Editing by Alison Williams\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T02:14:00.000+02:00", "crawled": "2018-01-10T02:58:33.000+02:00", "highlightTitle": ""}