{"organizations": [], "uuid": "1c7511fefba5b15eb290a303e8287e5688dae6d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/11", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-lilis-energy-announces-delaware-basin-acquisition-pro-forma-net-acreage-of-19000-in-the-delaware-basin-and-private-placement.html", "country": "US", "domain_rank": 767, "title": "Lilis Energy Announces Delaware Basin Acquisition, Pro Forma Net Acreage of ~19,000 in the Delaware Basin AND Private Placement of $100 Million of Preferred Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-01-31T14:00:00.000+02:00", "replies_count": 0, "uuid": "1c7511fefba5b15eb290a303e8287e5688dae6d0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-lilis-energy-announces-delaware-basin-acquisition-pro-forma-net-acreage-of-19000-in-the-delaware-basin-and-private-placement.html", "ord_in_thread": 0, "title": "Lilis Energy Announces Delaware Basin Acquisition, Pro Forma Net Acreage of ~19,000 in the Delaware Basin AND Private Placement of $100 Million of Preferred Stock", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN ANTONIO, Jan. 31, 2018 /PRNewswire/ -- Lilis Energy, Inc. (NYSE American: LLEX), an exploration and development company operating in the Permian Basin of West Texas and Southeastern New Mexico announced today that it has entered into a definitive purchase and sale agreement with OneEnergy Partners Operating, LLC (\"OEP\") to acquire approximately 2,798 net acres in the Delaware Basin and associated production of approximately 425 net Boepd (the \"Acquisition\"). Aggregate consideration for the Acquisition is $70 million, consisting of $40 million in cash and $30 million of the Company's common stock (1) , subject to customary purchase price adjustments.\nThe Company also announced today that it has entered into a definitive securities purchase agreement to sell shares of a new series of the Company's convertible preferred stock to certain private funds affiliated with Varde Partners, Inc. (\"Varde\") for gross proceeds of $100 million. The cash portion of the consideration for the Acquisition will be funded using the proceeds from the preferred stock issuance.\nAcquisition Overview\nApproximately 2,798 overlapping (84% operated) and contiguous net acres acquired in the Delaware Basin in Lea County, New Mexico; Ability to control timing and locations of planned drilling program with over 70% of the acreage being HBP Acquisition adds more than 150 net locations (2) with potential targets in the Wolfcamp A, Wolfcamp XY, Wolfcamp B and 2 nd Bone Spring zones, along with further upside from additional benches; Largely contiguous acreage blocks that allow for longer lateral development adding ~72 gross locations of 1 ½ mile laterals plus; Average adjusted per acre cost of $18,942 (3) with net production of 425 Boepd for the year ended December 31, 2017; Current acreage of ~19,000 and committed acreage pipeline allows the Company to exceed 20,000 net acres threshold; Accretive to per-share net asset value, long term cash flow, balance sheet and overall inventory; Acquisition includes 442 net acres that include two existing wells that Lilis currently operates: the Wildhog BWX State Com 1H and the Prize Hog State Com 1H. Post-closing, the Company will have a 100% working interest on both wells; As a result of acquiring the 442 net acre interest in the Wildhog and Prizehog, Lilis will own 100% of 2,560 net acres in four contiguous blocks; Allows longer laterals and full control of development plan; Drilling budget for the acquired New Mexico acreage contemplates the drilling and completion of four wells in 2018, including two 1-mile wells in the first half of the year targeting the Wolfcamp A and XY, respectively, and two 1 ½-mile laterals in the second half of the year;\nThe Acquisition has an effective date of October 1, 2017 and is expected to close in March 2018 subject to customary closing conditions.\n(1) Based on a 20 day VWAP multiplied by $1.05 and subject to certain conditions as of\nthe closing of the Acquisition, (subject to a $4.25 floor and $5.25 ceiling)\n(2) Assumes 48 gross wells per section (640 acre section)\n(3) Based on $40,000 per flowing Boe/d\n\"We are very enthusiastic and pleased to announce this accretive transaction and opportunity to acquire a complementary and contiguous asset to our current New Mexico acreage. The transaction will allow us to enhance our overall position in the Northern Delaware Basin. The Company has reached a new milestone with our pro forma total net acreage count approaching 20,000 net acres in the Delaware Basin and production approaching 5,000 Boepd,\" said Ronald Ormand, Lilis's Executive Chairman. \"The acquired acreage represents a consolidated position with offset operators that have and continue to materially de-risk this position. As we look forward into 2018, we intend to focus on delineation of our acreage position. We intend to do this through development of our eastern acreage and drilling of additional benches, including the Wolfcamp A, B, XY and 2 nd Bone Springs. We intend to drill four wells in New Mexico under our current 2018 budget targeting the Wolfcamp A and XY, which could be expanded.\"\nConvertible Preferred Stock\nConcurrent with the Company's entry into the purchase and sale agreement for the Acquisition, Lilis agreed to issue $100 million of newly created Convertible Preferred Stock to certain private funds affiliated with Varde Partners, Inc. The Preferred Stock will pay quarterly dividends at a rate of 9.75% per annum and holds a conversion price of $6.15. Dividends are payable in kind through April 26, 2021, after which the dividend rate steps up and becomes payable in cash. In addition, the Company holds optional redemption and forced conversion rights. Closing of the sale of the Preferred Stock is anticipated to occur later today on January 31, 2018. Proceeds from the sale of the Preferred Stock will fund the cash portion of the consideration for the Acquisition, as well as a portion of the Company's 2018 drilling program. Lilis expects to be cash flow neutral, on a drilling and completion basis, by 2019.\n\"We are excited to expand our relationship with Varde through the placement of this Preferred Stock. This transformative capital funds the cash portion of our acquisition, provides additional liquidity to our balance sheet and provides Lilis the ability to delineate our existing acreage position in order to continue seeking out accretive opportunities with significant upside potential,\" said Joseph Daches, Chief Financial Officer of the Company. \"This financing gives the Company increased operational and financial flexibility that will allow for accelerated and efficient development of our assets.\"\nSunTrust Robinson Humphrey acted as exclusive financial advisor to Lilis in connection with the Acquisition. Thompson & Knight LLP and Bracewell LLP acted as counsel to Lilis in connection with the Acquistion, and Bracewell LLP acted as counsel to Lilis in connection with the Preferred Stock transaction. Kirkland & Ellis LLP acted as counsel to Varde in connection with the Preferred Stock transaction.\nAbout Lilis Energy, Inc.\nLilis Energy, Inc. is a San Antonio-based independent oil and gas exploration and production company that operates in the Permian's Delaware Basin, considered amongst the leading resource plays in North America. Upon closing of the Acquisition, Lilis's total net acreage in the Permian Basin is expected to be over 19,000 acres. Lilis Energy's near-term E&P focus is to grow current reserves and production and pursue strategic acquisitions in its core areas. For more information, please visit www.lilisenergy.com .\nForward-Looking Statements:\nThis press release contains forward-looking statements within the meaning of the federal securities laws. Such statements are subject to a number of assumptions, risks and uncertainties, many of which are beyond the control of the Company. These risks include, but are not limited to, risks related to the consummation of the Acquisition and the Company's ability to achieve the anticipated benefits of the Acquisition; the Company's ability to finance its continued exploration, drilling operations and working capital needs; the Company's anticipated future cash flows and ability to access other sources of liquidity; all the other uncertainties, costs and risks involved in exploration and development activities; and the other risks identified in the Company's Annual Report on Form 10-K and its other filings with the Securities and Exchange Commission (the \"SEC\"). Readers are cautioned that any such statements are not guarantees of future performance and that actual results or developments may differ materially from those projected in the forward-looking statements. The forward-looking statements in this press release are made as of the date hereof, and the Company does not undertake any obligation to update the forward-looking statements as a result of new information, future events or otherwise.\nView original content with multimedia: http://www.prnewswire.com/news-releases/lilis-energy-announces-delaware-basin-acquisition-pro-forma-net-acreage-of-19000-in-the-delaware-basin-and-private-placement-of-100-million-of-preferred-stock-300590899.html\nSOURCE Lilis Energy, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/lilis-energy-announces-delaware-basin-acquisition-pro-forma-net-acreage-of-19000-in-the-delaware-basin-and-private-placement-of-100-million-of-preferred-stock-300590899.html", "http://www.lilisenergy.com/"], "published": "2018-01-31T14:00:00.000+02:00", "crawled": "2018-01-31T19:01:11.010+02:00", "highlightTitle": ""}