{"organizations": [], "uuid": "3ba2ad2295c591756a79563dc72e228524ced4bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-scf-partners-expands-its-leadership-team-with-the-addition-of-hossam-elbadawy-and-launches-scf-ventures.html", "country": "US", "domain_rank": 767, "title": "SCF Partners Expands Its Leadership Team with the Addition of Hossam Elbadawy and Launches SCF Ventures", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-18T18:48:00.000+02:00", "replies_count": 0, "uuid": "3ba2ad2295c591756a79563dc72e228524ced4bb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-scf-partners-expands-its-leadership-team-with-the-addition-of-hossam-elbadawy-and-launches-scf-ventures.html", "ord_in_thread": 0, "title": "SCF Partners Expands Its Leadership Team with the Addition of Hossam Elbadawy and Launches SCF Ventures", "locations": [], "entities": {"persons": [{"name": "hossam elbadawy", "sentiment": "negative"}, {"name": "elbadawy", "sentiment": "none"}], "locations": [{"name": "lime rock partner", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "scf ventures hossam elbadawy", "sentiment": "negative"}, {"name": "scf", "sentiment": "negative"}, {"name": "scf partners", "sentiment": "negative"}, {"name": "technology partner", "sentiment": "none"}, {"name": "o&g technologies", "sentiment": "none"}, {"name": "scf ventures", "sentiment": "none"}, {"name": "business wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hossam Elbadawy has joined SCF Partners to lead and expand the fund’s technology and high growth investment efforts through SCF Ventures, and encourage the adoption of emerging technologies across the existing SCF portfolio.\nHOUSTON--(BUSINESS WIRE)-- SCF Partners is pleased to announce that Hossam Elbadawy is joining the firm as Managing Director and Technology Partner. His responsibilities will span from making early stage and growth investments via SCF Ventures to facilitating technology adoption and differentiation across the existing SCF portfolio.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180118005951/en/\nHossam Elbadawy, Managing Director and Technology Partner (Photo: Business Wire)\nPrior to joining SCF, Mr. Elbadawy founded and managed O&G Technologies, a Houston-based energy technology incubator. Mr. Elbadawy brings over 24 years of experience in the energy sector, with a particular expertise in technology development and commercialization. He previously served as Senior Operating Partner at Lime Rock Partners and also as CEO of Tercel Oilfield Products, which was acquired in May 2016. Prior to serving in these capacities, Mr. Elbadawy spent nearly 17 years at Schlumberger where he was Global Vice President of Manufacturing in addition to managing the company’s leading-edge Rosharon Technology Center and the Houston Product Center.\nDavid Baldwin, Co-President of SCF Partners, said, “Our team spent the better part of 2017 exploring and identifying the best possible path to invest in earlier-stage companies. Partnering with Hossam and O&G Technologies is a better outcome than we envisioned when we embarked on this initiative. Hossam’s knowledge, experience, and reputation in our industry is second-to-none. Our firm has a long history of not only investing early in trends, but with the best management teams in the industry. While broadening technology adoption is certainly an emerging trend in which we are eager to invest, we are even more excited to be partnering with a new breed of entrepreneur as we make additional early stage and growth investments.”\nMr. Elbadawy stated, “I am very excited to join the SCF team. SCF is the global leader in energy service investing with a stellar track record over the last 30 years of building companies that continue to contribute to the industry many years after SCF’s successful exit. I am honored to join such an accomplished and respected team.”\nSCF Ventures was launched to focus on technology and early stage growth investments in oil and gas. It has become increasingly apparent that the energy industry is at an inflection point necessitating technological innovation in order to facilitate cost reduction and efficiency improvement. The current environment has additionally created a customer willingness to adopt new technologies. SCF Ventures will accelerate the leading edge of this trend by acquiring an ownership interest in Mr. Elbadawy’s existing O&G Technologies portfolio and will be making additional growth investments in technology and product focused companies.\nAbout SCF Partners\nFounded in 1989, SCF Partners (“SCF”) provides equity capital and strategic growth assistance to build leading energy service and equipment companies that operate throughout the world. The firm is headquartered in Houston, Texas and has additional offices in Calgary, Singapore and Aberdeen. SCF currently oversees approximately $2 billion under management and has built more than 70 platform services companies, completing over 300 growth acquisitions, through partnerships with energy services and equipment entrepreneurs.\nFor additional information about SCF, please visit SCF’s website at www.scfpartners.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005951/en/\nSCF Partners\nTheresa Eaton, 713-227-7888\nteaton@scfpartners.com\nSource: SCF Partners", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.scfpartners.com&esheet=51744915&newsitemid=20180118005951&lan=en-US&anchor=www.scfpartners.com&index=1&md5=f49ac2d77c5c5e92756cc46b19064050", "http://www.businesswire.com/news/home/20180118005951/en/"], "published": "2018-01-18T18:48:00.000+02:00", "crawled": "2018-01-18T19:57:01.004+02:00", "highlightTitle": ""}