{"organizations": [], "uuid": "454e21e39c64d8bf96043044c6f2a3a95689e641", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://images.wsj.net/im-1677/social", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/funding-questions-abound-over-trumps-infrastructure-plan-1517425783", "country": "US", "domain_rank": 387, "title": "Funding Questions Abound Over Trump’s Infrastructure Plan", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T22:09:00.000+02:00", "replies_count": 0, "uuid": "454e21e39c64d8bf96043044c6f2a3a95689e641"}, "author": "Paul Page", "url": "https://www.wsj.com/articles/funding-questions-abound-over-trumps-infrastructure-plan-1517425783", "ord_in_thread": 0, "title": "Funding Questions Abound Over Trump’s Infrastructure Plan", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "gerald f. seib", "sentiment": "none"}], "locations": [], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS The lack of funding details for President Donald Trump’s plan to spend at least $1.5 trillion in infrastructure spending leaves uncertain the effort to build and expand roads and bridges nationwide, freight and logistics groups said Wednesday.\nMr. Trump said in his State of the Union address Tuesday night that he plans to use federal dollars to raise matching funds from state and local governments and the private sector to improve the nation’s infrastructure. Administration officials have said they plan to contribute $200 billion to the effort.\nDivisions over the source of the money signal a potentially tough path for the plan. Some transport groups are pushing for more federal dollars and higher fuel taxes that are generally supported by Democrats, while others are backing efforts by Republicans to push more planning and responsibility for revenue to the states.\nRelated Video President Trump gave his first State of the Union address before Congress on Tuesday night. WSJ's Gerald F. Seib gives us three key takeaways from the event. Photo: Getty The idea of leveraging federal spending to such a large degree amounts to “fake funding,” said Chris Spear, president and chief executive of the American Trucking Associations, the country’s biggest trucking group and a strong supporter of Mr. Trump.\n“It’s going to come down to who puts forward real money and who is talking ideology and fake money,” Mr. Spear said in an interview before the GOP president’s address.\nMr. Spear said there would be little interest from private investors in highway and bridge projects that are important to truckers but don’t draw the traffic that would help companies earn a profit. “You are not going to toll your way to sustainable funding,” he said.\nTruck operators would rather see an increase in the federal fuel tax, which hasn’t been raised since 1993. Republicans in Congress have adamantly opposed any increase in the national tax, although lawmakers in several states, including state legislatures controlled by the GOP, have raised taxes to back highway maintenance and construction.\n“The fuel tax is simple, efficient and it serves the very real needs of our country and its people,” Todd Spencer, acting president of the Owner-Operator Independent Drivers Association, said in a statement.\nRelated Video As the container shipping industry continues to boom, companies are adopting new technologies to move cargo faster and shifting to crewless ships. But it’s not all been smooth sailing and the future will see fewer players stay above water. The administration’s proposal to speed up the permitting process for projects is one area that wins broad support. But many groups said they don’t want to see that come with a diminished federal role in transportation that they said would undermine interstate commerce.\nElaine Nessle, executive director of the Coalition for America’s Gateways and Trade Corridors, a Washington-based alliance of state and local planning agencies, ports and other public and private groups, said more than 70% of freight crosses state lines.\n“When you look at staggering numbers like what is needed, it calls for the need for national planning and national investment,” Ms. Nessle said.\n“It’s very important to maintain a strong federal role when we talk about infrastructure investment,” she said. “Not only does this [administration] plan lean heavily on public-private partnerships, but it leans on state and local governments to come up with enormous matches.”", "external_links": [], "published": "2018-01-31T22:09:00.000+02:00", "crawled": "2018-01-31T22:29:29.004+02:00", "highlightTitle": ""}