{"organizations": [], "uuid": "446119aac897eeb1239c42275a77f5c3b8bd49b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-sanofi-to-acquire-ablynx-for-a3-point-9-billion.html", "country": "US", "domain_rank": 767, "title": "Sanofi to acquire Ablynx for €3.9 Billion", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.996, "site_type": "news", "published": "2018-01-29T10:20:00.000+02:00", "replies_count": 0, "uuid": "446119aac897eeb1239c42275a77f5c3b8bd49b7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-sanofi-to-acquire-ablynx-for-a3-point-9-billion.html", "ord_in_thread": 0, "title": "Sanofi to acquire Ablynx for €3.9 Billion", "locations": [], "entities": {"persons": [{"name": "ablynx", "sentiment": "negative"}, {"name": "olivier brandicourt", "sentiment": "none"}], "locations": [{"name": "belgium", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "sanofi", "sentiment": "negative"}, {"name": "sny", "sentiment": "negative"}, {"name": "ghent", "sentiment": "none"}, {"name": "american depositary shares", "sentiment": "none"}, {"name": "ablynx boards of directors paris", "sentiment": "none"}, {"name": "ablynx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Press Release\nSource: Sanofi (EURONEXT: SAN) (NYSE: SNY)\nSanofi to acquire Ablynx for €3.9 Billion\nStrengthens Sanofi's R&D strategy with innovative Nanobody ® technology platform Expands growing rare blood disorders franchise with Ablynx's late-stage investigational caplacizumab aTTP treatment Unanimously approved by Sanofi and Ablynx Boards of Directors\nParis, France and Ghent, Belgium - January 29, 2018 - Sanofi and Ablynx, a biopharmaceutical company engaged in the discovery and development of Nanobodies ® , entered into a definitive agreement under which Sanofi will offer to acquire all of the outstanding ordinary shares, including shares represented by American Depositary Shares (ADSs), warrants and convertible bonds of Ablynx at a price per Ablynx share of €45 in cash, which represents an aggregate equity value of approximately €3.9 billion. The transaction was unanimously approved by both the Sanofi and Ablynx Boards of Directors.\nSanofi's Chief Executive Officer Olivier Brandicourt commented, \"With Ablynx, we continue to advance the strategic transformation of our Research and Development, expanding our late-stage pipeline and strengthening our platform for growth in rare blood disorders. This acquisition builds on a successful existing partnership. We are also pleased to reaffirm our commitment to Belgium, where we have invested significantly over the years in our state-of-the-art biologics manufacturing facility in Geel. We intend to maintain and support the Ablynx science center in Ghent.\"\nAblynx's Chief Executive Officer Edwin Moses noted, \"Since our founding in 2001, our team has been focused on unlocking the power of our Nanobody technology for patients. The results of our work are validated by clinical data. As we look ahead, we believe Sanofi's global infrastructure, commitment to innovation and commercial capabilities will accelerate our ability to deliver our pipeline. Our Board of Directors feels strongly that this transaction represents compelling value for shareholders and maximizes the potential of our pipeline to the benefit of all stakeholders.\"\nSustaining Innovation in R&D\nThe acquisition of Ablynx continues Sanofi's commitment to breakthrough innovation, focused on technologies addressing multiple disease targets with single multi-specific molecules.\nNanobodies are a novel class of proprietary next generation biologicals. Ablynx is at the leading edge of Nanobody technology supporting a deep pipeline of more than 45 proprietary and partnered candidates for a wide range of therapeutic areas such as hematology, inflammation, immuno-oncology and respiratory diseases. Eight Nanobodies have entered clinical development.\nSanofi is committed to accelerating development and maximizing the commercial potential of Ablynx's ongoing and emerging programs.\nStrengthening Sanofi's Platform in Rare Blood Disorders\nAblynx's most-advanced product in development is caplacizumab (anti-vWF Nanobody), a wholly-owned development program for the treatment of acquired thrombotic thrombocytopenic purpura (aTTP). The product is already filed in the European Union and expected to be filed in the U.S. during the first half of this year. Caplacizumab, if approved, would be the first-in-class treatment for this acute, life-threatening disease.\nThe addition of caplacizumab to Sanofi's platform strengthens its position in rare blood disorders, complementing the recently announced agreements to acquire Bioverativ and obtain global rights for fitusiran from Alnylam.\nCombining Complementary Capabilities to Address\nRespiratory Syncytial Virus (RSV) Infections\nAblynx's ALX-0171, an inhaled anti-RSV Nanobody, currently in Phase 2b, is a potential breakthrough for the symptomatic treatment of RSV infections-for which there is no widely used therapy available-and is very complementary to Sanofi Pasteur RSV associated programs.\nDelivering Long-Term Shareholder Value\nThe addition of Ablynx is anticipated to drive meaningful long-term value for Sanofi's shareholders by enhancing its pipeline and research capabilities. Including R&D expenses, the acquisition is expected to be neutral to Business EPS [1] in 2018 and 2019.\nTransaction Terms\nUnder the terms of the agreement, Sanofi will launch public offers to acquire all of the outstanding ordinary shares (including shares represented by ADSs), warrants and convertible bonds of Ablynx in cash. Sanofi has complied with the formalities set forth in the Belgian takeover legislation and filed the mandatory documents with the Belgian Financial Services and Markets Authority (FSMA). A notice was published by the FSMA on its website.\nThe consummation of the public offers is subject to customary conditions, including the tender of securities representing at least 75% of the outstanding shares of Ablynx at the end of the initial acceptance period of the Belgian Tender Offer, and the receipt of required regulatory approvals. The public offers are expected to be launched by the beginning of the second quarter of 2018.\nIn accordance with the Belgian requirement of certainty of funds, Sanofi has entered into a bank credit facility with BNP Paribas Fortis SA/NV acting as the sole credit facility arranger. Subject to the satisfaction or waiver of customary closing conditions, the transaction is expected to close by the end of the second quarter 2018.\nMorgan Stanley and Lazard are acting as financial advisors to Sanofi. J.P. Morgan is acting as financial advisor to Ablynx. Weil, Gotshal & Manges LLP and NautaDutilh are serving as legal counsels to Sanofi. Eubelius CVBA, Goodwin Procter LLP and Linklaters LLP are serving as legal counsels to Ablynx.\nSanofi Conference Call Sanofi will host a webcast live on Sanofi's website at 2:30 p.m. CET / 8:30 a.m. EST on Monday, January 29, 2018. The webcast details and full presentation will be made available on Sanofi's Investor Relations webpage .\nAbout Ablynx\nAblynx is a biopharmaceutical company engaged in the development of Nanobodies, proprietary therapeutic proteins based on single-domain antibody fragments, which combine the advantages of conventional antibody drugs with some of the features of small-molecule drugs. Ablynx is dedicated to creating new medicines which will make a real difference to society. Today, the Company has more than 45 proprietary and partnered programmes in development in various therapeutic areas including inflammation, haematology, immuno-oncology, oncology and respiratory disease. The Company has collaborations with multiple pharmaceutical companies including AbbVie; Boehringer Ingelheim; Eddingpharm; Merck & Co., Inc., Kenilworth, New Jersey, USA; Merck KGaA; Novartis; Novo Nordisk; Sanofi and Taisho Pharmaceuticals. The Company is headquartered in Ghent, Belgium. More information can be found on www.ablynx.com .\nAbout Sanofi\nSanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions.\nWith more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe.\nSanofi, Empowering Life\nSanofi Media Relations\nKyra Obolensky\nTel.: +33 (0)1 53 77 94 74\nmr@Sanofi.com\nAblynx Media Relations\nConsilium Strategic Communications\nMary-Jane Elliott, Philippa Gardner,\nSukaina Virji\nTel.: +44 (0)20 3709 5700\nablynx@consilium-comms.com\nJoele Frank, Wilkinson Brimmer Katcher\nDan Katcher or Joseph Sala\nTel.: +1 212 355-4449\nSanofi Investor Relations\nGeorge Grofik\nTel.: +33 (0)1 53 77 45 45\nir@Sanofi.com\nAblynx Investor Relations\nLies Vanneste\nTel.: +32 (0)9 262 0137\nlies.vanneste@Ablynx.com\nSanofi and Ablynx Forward-Looking Statements\nThis communication contains forward-looking statements. Forward-looking statements are statements that are not historical facts and may include projections and estimates and their underlying assumptions, statements regarding plans, objectives, intentions and expectations with respect to future financial results, events, operations, services, product development and potential, and statements regarding future performance. Forward-looking statements are generally identified by the words \"expects\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"plans\", \"will be\" and similar expressions. Although Sanofi's and Ablynx's management each believes that the expectations reflected in such forward-looking statements are reasonable, investors are cautioned that forward-looking information and statements are subject to various risks and uncertainties, many of which are difficult to predict and generally beyond the control of Sanofi and Ablynx, that could cause actual results and developments to differ materially from those expressed in, or implied or projected by, the forward-looking information and statements. These risks and uncertainties include among other things, risks related to Sanofi's and Ablynx's ability to complete the acquisition on the proposed terms or on the proposed timeline, including the receipt of required regulatory approvals, the possibility that competing offers will be made, other risks associated with executing business combination transactions, such as the risk that the businesses will not be integrated successfully, that such integration may be more difficult, time-consuming or costly than expected or that the expected benefits of the acquisition will not be realized, risks related to future opportunities and plans for the combined company, including uncertainty of the expected financial performance and results of the combined company following completion of the proposed acquisition, disruption from the proposed acquisition making it more difficult to conduct business as usual or to maintain relationships with customers, employees, manufacturers, suppliers or patient groups, and the possibility that, if the combined company does not achieve the perceived benefits of the proposed acquisition as rapidly or to the extent anticipated by financial analysts or investors, the market price of Sanofi's shares could decline, as well as other risks related to Sanofi's and Ablynx's respective businesses, including the ability to grow sales and revenues from existing products and to develop, commercialize or market new products, competition, including potential generic competition, the uncertainties inherent in research and development, including future clinical data and analysis, regulatory obligations and oversight by regulatory authorities, such as the FDA or the EMA, including decisions of such authorities regarding whether and when to approve any drug, device or biological application that may be filed for any product candidates as well as decisions regarding labelling and other matters that could affect the availability or commercial potential of any product candidates, the absence of a guarantee that any product candidates, if approved, will be commercially successful, risks associated with intellectual property, including the ability to protect intellectual property and defend patents, future litigation, the future approval and commercial success of therapeutic alternatives, and volatile economic conditions. While the list of factors presented here is representative, no list should be considered a statement of all potential risks, uncertainties or assumptions that could have a material adverse effect on the companies' consolidated financial condition or results of operations. The foregoing factors should be read in conjunction with the risks and cautionary statements discussed or identified in the public filings with the SEC and the AMF made by Sanofi and Ablynx, including those listed under \"Risk Factors\" and \"Cautionary Statement Regarding Forward-Looking Statements\" in Sanofi's annual report on Form 20-F for the year ended December 31, 2016, and those listed under \"Disclaimer\" in the current reports on Form 6-K filed by Ablynx with the SEC. The forward-looking statements speak only as of the date hereof and, other than as required by applicable law, Sanofi and Ablynx do not undertake any obligation to update or revise any forward-looking information or statements.\nAdditional Information for US Investors\nThe tender offer for the outstanding ordinary shares (\"Shares\"), American Depositary Shares issued by J.P. Morgan Chase Bank, N.A., acting as depositary (\"ADSs\"), warrants (\"Warrants\") and convertible bonds of Ablynx (\"Bonds\" and, together with the Shares, ADSs and Warrants, the \"Securities\") has not yet commenced. This communication is for informational purposes only and is neither a recommendation, an offer to purchase nor a solicitation of an offer to sell any Securities of Ablynx.\nAt the time the tender offer is commenced, Sanofi will file, or cause to be filed, a tender offer statement on Schedule TO with the SEC and thereafter, Ablynx will file a solicitation/recommendation statement on Schedule 14D-9. Holders of Securities are urged to carefully review the documents that will be filed by Sanofi and Ablynx with the SEC because these documents will contain important information, including the terms and conditions of the tender offer.\nThe offer to purchase, the related letter of transmittal and certain other tender offer documents, as well as the solicitation/recommendation statement, are available to all holders of Securities of Ablynx at no expense to them. These documents are available for free at the SEC's website at www.sec.gov . Additional copies may be obtained for free by contacting Sanofi at ir@Sanofi.com or on Sanofi's website at https://en.Sanofi.com/investors . You should read the filings made by Sanofi and Ablynx with the SEC carefully before making a decision concerning the U.S. Offer.\n[1] Business EPS is a non-GAAP financial measure (see appendix to Sanofi press release on quarterly results for a definition)\nAttachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/942563fa-8dcf-49dc-8fcb-0aa5c24a733c\nSource:Sanofi", "external_links": ["https://www.globenewswire.com/Tracker?data=cEALbkBYuY3z_Tnav42Pz3ntEw9YWY1L6aLMGrHrKjIf5NIwzKsLSEspA0vgSHV34eWGyQGr4la35RHMGqh50QG5vMyDhgsqUZc2IOu6jt0hG-kqH4HrZsQR8etS7989HdkolWW42TABBEVWzqGYXH4IBOk1BZ8A8AAgGRaKvZ07E6j2Z55hHIbNRRHp79plkeT-8eDf4AURF_NVVP-o1NEkLF_EHV8eo_XVf1lsPNK7m-VUSG9y1d3mdkhKr5QMb8pVBeTFuNGOR6djoCkk5A==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/942563fa-8dcf-49dc-8fcb-0aa5c24a733c", "https://en.Sanofi.com/investors", "http://en.sanofi.com/investors/investors.aspx"], "published": "2018-01-29T10:20:00.000+02:00", "crawled": "2018-01-29T10:27:21.018+02:00", "highlightTitle": ""}