{"organizations": [], "uuid": "44ee2ea9ed63e326df7f537aadd273a09254436e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1220994767&w=1200&r=LYNXMPEE0A03W", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england/liverpool-without-coutinho-out-to-halt-man-city-march-idUKKBN1F006W", "country": "US", "domain_rank": 408, "title": "Liverpool, without Coutinho, out to halt Man City march", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T04:09:00.000+02:00", "replies_count": 0, "uuid": "44ee2ea9ed63e326df7f537aadd273a09254436e"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england/liverpool-without-coutinho-out-to-halt-man-city-march-idUKKBN1F006W", "ord_in_thread": 0, "title": "Liverpool, without Coutinho, out to halt Man City march", "locations": [], "entities": {"persons": [{"name": "coutinho", "sentiment": "negative"}, {"name": "rik sharma", "sentiment": "negative"}, {"name": "philippe coutinho", "sentiment": "none"}, {"name": "roberto firmino", "sentiment": "none"}, {"name": "mohamed salah", "sentiment": "none"}, {"name": "juergen klopp", "sentiment": "none"}, {"name": "klopp", "sentiment": "none"}, {"name": "sadio mane", "sentiment": "none"}], "locations": [{"name": "man city", "sentiment": "none"}, {"name": "unbeaten city", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "tottenham", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "negative"}, {"name": "fc barcelona", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 2:13 AM / Updated 7 hours ago Liverpool, without Coutinho, out to halt Man City march Rik Sharma 4 Min Read \n(Reuters) - The form table suggests Liverpool have realistic hopes of disrupting Manchester City’s waltz towards the Premier League title when they meet on Sunday, although they must quickly learn how to cope without Philippe Coutinho. FC Barcelona's new signing Philippe Coutinho during the presentation. REUTERS/Albert Gea \nThe Brazilian playmaker completed a 142 million-pound move to Barcelona on Monday, meaning Juergen Klopp’s “fab four” up front is now just a three. \nUnbeaten City are 15 points clear at the top of the table, having scored more goals than anybody with 64, but fourth-placed Liverpool come second on that count with 50. \nKlopp’s side are unbeaten in 17 games in all competitions since they were thrashed 4-1 by Tottenham on Oct. 22. \nEgyptian winger Mohamed Salah is set to return from injury and he and Sadio Mane are likely to play either side of striker Roberto Firmino. \nAlthough Coutinho will no longer be able to provide the trio with ammunition, they still have the speed and guile to trouble Pep Guardiola’s side at the back. \nFormer Liverpool midfielder Jason McAteer believes the Reds can get at City’s defence. \n“We know Manchester City’s quality, we know that they’re running away with (the league) at the minute, but I think, on their day, Liverpool can match anybody,” McAteer told the Liverpool website. \n”They’re so good going forward. You’ve got to be (wary) of the attacking prowess that they’ve got but there are areas of weakness. \n“If you can get in between the lines and at the two centre-halves, which I feel we can, then there are chances and goals there.” \nCity, however, will look to repeat their dominant 5-0 victory over Liverpool at the Etihad in September, although they will be without injured striker Gabriel Jesus, who scored a brace that day. \nThis time they will have Virgil van Dijk in their way with the Liverpool defender set to make his Premier League debut after his move from Southampton. \nVan Dijk enjoyed a dramatic debut for his new team in the FA Cup, scoring late on against Everton to earn Liverpool a derby victory. \nCity’s Belgian midfielder Kevin De Bruyne said his team would just focus on their own performance. \n”We go there to win the game,“ he said. ”They will have a very strong team and they want to be there for the Champions League (places). \n“We just try to do the things that we do well and then we will see what happens.” \nSecond-placed Manchester United host Stoke City on Monday, the visitors currently without a coach after sacking Mark Hughes following their FA Cup defeat by League Two Coventry City. \nCoach Eddie Niedzwiecki is in temporary charge of the team for the trip to Old Trafford, with Jose Mourinho’s side anxious to keep ahead of the chasing pack behind Manchester City. \nThe Portuguese has been embroiled in a war of words with Chelsea coach Antonio Conte, whose side host Leicester City on Saturday when a victory would see them provisionally move above United into second. \nTottenham host Everton on Saturday and Arsenal travel to Bournemouth on Sunday. Crystal Palace face Burnley, Huddersfield meet West Ham United and Newcastle United entertain Swansea City in other weekend matches. Editing by Ed Osmond", "external_links": [], "published": "2018-01-11T04:09:00.000+02:00", "crawled": "2018-01-11T04:31:30.021+02:00", "highlightTitle": ""}