{"organizations": [], "uuid": "3cbe3f5a10786e910f97c2f9b02efa454441ed8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222500846&w=1200&r=LYNXMPEE0F1E5", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-congress-shutdown/u-s-government-shutdown-looms-amid-harsh-immigration-exchange-idUSKBN1F52FE", "country": "US", "domain_rank": 408, "title": "U.S. government shutdown looms amid harsh immigration exchange", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T20:52:00.000+02:00", "replies_count": 0, "uuid": "3cbe3f5a10786e910f97c2f9b02efa454441ed8a"}, "author": "", "url": "https://www.reuters.com/article/us-usa-congress-shutdown/u-s-government-shutdown-looms-amid-harsh-immigration-exchange-idUSKBN1F52FE", "ord_in_thread": 0, "title": "U.S. government shutdown looms amid harsh immigration exchange", "locations": [], "entities": {"persons": [{"name": "richard cowan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "durbin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Note language that may offend some readers)\nBy Richard Cowan and Susan Cornwell\nWASHINGTON (Reuters) - Partisan finger-pointing over immigration policy on Tuesday left the U.S. Congress and the White House stumbling closer to a possible federal government shutdown by the end of the week, although Wall Street held out hopes for a deal to prevent that.\nRepublicans who control Congress are expected to try to push another stopgap funding bill and get it to President Donald Trump’s desk before Friday’s midnight deadline.\nBut there are perils. Conservatives want a large increase in defense spending that such a bill would not provide. Many Democrats might withhold their support unless immigration policy is addressed.\nThe negotiating climate has become increasingly poisonous after a sudden halt last week in talks toward a deal to shield so-called Dreamers -- immigrants brought into the country illegally as children -- from deportation.\nThe Republican president rejected a bipartisan agreement reached by a group of senators. Divisions between Republicans and Democrats then deepened amid an uproar over Trump’s reported use of the word “shithole” when speaking about African countries last week. Trump has denied using that word.\nRepublican Senator Lindsay Graham on Tuesday blamed White House staff for altering Trump’s positive view on the bipartisan agreement on the Deferred Action for Childhood Arrivals (DACA) program that protects the Dreamers. “I will say I don’t think the president was well-served by his staff,” Graham said.\nHouse of Representatives Republicans were scheduled to huddle on Tuesday night to try to figure out how best to avoid a government shutdown, congressional aides said.\nIf a temporary “continuing resolution” to keep the government operating results, it would be the fourth such measure since the 2018 federal fiscal year began on Oct. 1, a sign of Washington’s serious struggles to pass spending legislation.\nThese stopgap measures have become routine, with 112 of them passed since 1998, according to the Peter G. Peterson Foundation, which advocates fiscal responsibility.\nAnalyst Ed Mills at financial firm Raymond James said another short-term extension is expected. “This is likely to be a week of brinkmanship and the potential of a government shutdown is elevated. Should a shutdown occur, we do not expect much of a market reaction,” Mills noted.\nU.S. House Speaker Paul Ryan (R-WI) walks on Capitol Hill in Washington, U.S., after the House vote on the continuing resolution to avoid government shutdown, December 21, 2017. REUTERS/Yuri Gripas “We should all be kicked out if that happens,” Graham told reporters about a possible shutdown.\nYet there also is little appetite for another short-term measure.\n‘KICK THE CAN’\nNo. 2 House Democrat Steny Hoyer said Democrats have not decided whether they will support another continuing resolution and “can kick the can down the road one more time.”\nSlideshow (3 Images) The slim Republican margin of control in the U.S. Senate means Trump’s party will need some Democratic support to resolve the government funding stand-off. Democrats have said they want a spending bill that protects the Dreamer immigrants, mostly Hispanic young adults.\nTalks also continued on related issues, including how to fund a children’s healthcare program and to establish higher spending caps for the U.S. military and other domestic programs.\nHouse Energy and Commerce Chairman Greg Walden was pushing for a six-year reauthorization of the Children’s Health Insurance Program (CHIP) to be passed this week, possibly as part of a stopgap spending bill, a House Republican aide said.\nTrump and Democratic Senator Dick Durbin have traded accusations over the collapse of the immigration talks.\nDurbin intends to introduce the bipartisan agreement as legislation on Wednesday, spokesman Ben Marter said. But it was not yet clear whether Senate Majority Leader Mitch McConnell would schedule it for a floor debate and vote.\nTrump said in September he was terminating the DACA program, launched by his Democratic predecessor Barack Obama, effective in March. Congress has until then to pass legislation to protect the roughly 700,000 Dreamers from deportation and give them work permits.\nTrump said he was willing to make a deal to help the Dreamers, but insisted that funding for border security, including his long-promised wall along the U.S.-Mexican border opposed by Democrats, be included in any spending package.\n“The Democrats want to shut down the Government over Amnesty for all and Border Security. The biggest loser will be our rapidly rebuilding Military, at a time we need it more than ever,” Trump wrote on Twitter.\nDemocrats have done all they can to avert a shutdown and the ball is with the Republicans, said Durbin, the No. 2 Senate Democrat. “It is preventable,” Durbin said.\nReporting by Richard Cowan; Additional reporting by Doina Chiacu and Mohammad Zargham; Writing by Doina Chiacu; Editing by Kevin Drawbaugh and Will Dunham\n ", "external_links": [], "published": "2018-01-16T20:52:00.000+02:00", "crawled": "2018-01-16T21:07:29.010+02:00", "highlightTitle": ""}