{"organizations": [], "uuid": "f63a5122d76a5c8567848f17185f451a007e3859", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222391374&w=1200&r=LYNXMPEE0F0NG", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-ecb-policy/ecb-unlikely-to-ditch-bond-buying-pledge-next-week-sources-idUKKBN1F515E", "country": "US", "domain_rank": 408, "title": "ECB unlikely to ditch bond-buying pledge next week - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T22:10:00.000+02:00", "replies_count": 0, "uuid": "f63a5122d76a5c8567848f17185f451a007e3859"}, "author": "", "url": "https://uk.reuters.com/article/uk-ecb-policy/ecb-unlikely-to-ditch-bond-buying-pledge-next-week-sources-idUKKBN1F515E", "ord_in_thread": 0, "title": "ECB unlikely to ditch bond-buying pledge next week - sources", "locations": [], "entities": {"persons": [{"name": "balazs koranyi", "sentiment": "none"}, {"name": "francesco canepa", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "min read  frankfurt", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "governing council", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 10:54 AM / Updated 7 minutes ago ECB unlikely to ditch bond-buying pledge next week - sources Francesco Canepa , Balazs Koranyi 4 Min Read \nFRANKFURT (Reuters) - The European Central Bank is unlikely to ditch a pledge to keep buying bonds at next week’s meeting as rate setters need more time to assess the outlook for the economy and the euro, three sources close to the matter said. FILE PHOTO: The European Central Bank (ECB) headquarters are pictured in Frankfurt, Germany, December 7, 2017. REUTERS/Ralph Orlowski/File Photo \nThe ECB signalled last week a growing appetite for revising its policy message in “early” 2018, and specifically a promise to continue its 2.55 trillion euro money-printing programme until inflation heads back to target. \nThis has led investors to bring forward to December 2018 their expectations for the first ECB interest rate hike since 2011 and fuelled a rise in the euro EUR= to a three-year high against the U.S. dollar. \nBut three sources on or close to the ECB’s policy-making Governing Council said any fundamental change to the guidance was only likely to come later than next week, with the March meeting, when policymakers get updated economic forecasts, seen as a possible option. \n“We need more thorough analysis before making any change,” one of the sources said. \nThis would still give ECB President Mario Draghi room to use the news conference after the decision to drop informal hints at what may be coming. \nA spokesman for the ECB declined to comment. \nThe ECB has pledged to continue buying bonds at least until September and keep rates at their current, record low levels until well after that, a signal markets have taken to mean around three to six months. \nIn an interview published late on Tuesday, Germany’s representative on the ECB’s Governing Council, Jens Weidmann, seemed to rule out a rate hike this year, saying analyst expectations for a move in mid-2019 were in line with the ECB’s guidance. \nFellow hawk Ardo Hansson, the Estonian central bank governor, had kept a December hike in play by saying on Monday the ECB could end its bond purchases in one go after September. \nEuro zone bond yields and the euro fell after this article was first published. EURO STRENGTH \nWhile the sources said the stronger euro was largely testament to the strength of the bloc’s economy, they cautioned investors had overreacted to the accounts of the December meeting published last Thursday. \nFor one, any hardening of the policy message depended on further improvements in the economy, but euro zone inflation was still slowing and was well below the ECB’s target of almost 2 percent. \nSecond, the euro, at around $1.2230 on Tuesday, was roughly 4.5 percent above the level incorporated in the ECB’s December forecast and rate-setters needed to evaluate the impact of this rise on prices. \nA stronger euro tends to dampen inflation by making exports dearer and imports cheaper. \n“The market reaction to the minutes was excessive,” one of the sources said, referring to the rally after the ECB published the accounts of the December rate meeting last Thursday. \nIn an interview published after the initial Reuters report, France’s central bank governor Francois Villeroy de Galhau said the rise in the euro was “source of uncertainty” that ECB rate setters had to monitor. Reporting by Francesco Canepa and Balazs Koranyi; Additional reporting By Frank Siebelt; Editing by Jeremy Gaunt and Alison Williams", "external_links": [], "published": "2018-01-16T22:10:00.000+02:00", "crawled": "2018-01-16T22:31:00.002+02:00", "highlightTitle": ""}