{"organizations": [], "uuid": "d02498aa55b275a4c01008ac367539b1afbf0178", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-re-tap-offering-for-senior-notes-due-2025-by-gol-finance.html", "country": "US", "domain_rank": 767, "title": "Re-tap offering for Senior Notes due 2025 by Gol Finance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T03:28:00.000+02:00", "replies_count": 0, "uuid": "d02498aa55b275a4c01008ac367539b1afbf0178"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-re-tap-offering-for-senior-notes-due-2025-by-gol-finance.html", "ord_in_thread": 0, "title": "Re-tap offering for Senior Notes due 2025 by Gol Finance", "locations": [], "entities": {"persons": [], "locations": [{"name": "gol finance são paulo", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "gol linhas aéreas inteligentes s.a.", "sentiment": "negative"}, {"name": "gol finance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SÃO PAULO, Jan. 30, 2018 /PRNewswire/ -- GOL Linhas Aéreas Inteligentes S.A. (\"GOL\"), (NYSE: GOL and B3: GOLL4) , Brazil's #1 airline, announced today that its subsidiary, Gol Finance, priced a re-tap offering of US$ 150 million in aggregate principal amount of its 7.000% Senior Notes due 2025 (the \" New Notes \"), in accordance with Rule 144A and Regulation S under the U.S. Securities Act of 1933, as amended (the \" Securities Act \"), expected to close on February 2, 2018. The New Notes were offered as a further issuance of Gol Finance's 7.000% senior notes due 2025, priced at a yield of 7.00%, and will be consolidated with, and form a single series with, the US$500,000,000 aggregate principal amount of notes that were originally issued on December 11, 2017, raising the outstanding total on the tranche to US$650,000,000.\nThe New Notes were offered and sold only to qualified institutional buyers in accordance with Rule 144A under the Securities Act and to non-U.S. persons in accordance with Regulation S under the Securities Act. When issued, the New Notes will not have been registered under the Securities Act or state securities laws and may not be offered or sold in the United States absent registration or an applicable exemption from the registration requirements of the Securities Act and applicable state securities laws. This press release does not constitute an offer to sell or the solicitation of an offer to buy the New Notes or any other securities and shall not constitute an offer, solicitation or sale in any jurisdiction in which, or to any person to whom, such an offer, solicitation or sale is unlawful. Any offers of the New Notes will be made only by means of a private offering memorandum.\nDisclaimer\nThis release may contain within the meaning of Section 27A of the Securities Act and Section 21E of the United States Securities Exchange Act of 1934, as amended. Forward-looking information involves important risks and uncertainties that could significantly affect anticipated results in the future, and, accordingly, such results may differ from those expressed in any . These risks and uncertainties include, but are not limited to, general economic, political and business conditions in Brazil, South America and the Caribbean, existing and future governmental regulations, including air traffic capacity controls, and management's expectations and estimates concerning the company's financial performance.\nInvestor Relations\nri@voegol.com.br\nwww.voegol.com.br/ir\n+55(11) 2128-4700\nAbout GOL Linhas Aéreas Inteligentes S.A.\nBrazil's largest airline group. GOL is Brazil's largest airline, carrying 33 million passengers annually on more than 700 daily flights to 64 destinations, 53 in Brazil and 11 in South America and the Caribbean, on a fleet of 119 Boeing 737 aircraft, with a further 120 Boeing 737 MAX on order. GOLLOG is a leading cargo transportation and logistics business serving more than 2,400 Brazilian municipalities and, through partners, 205 international destinations in 95 countries. SMILES is one of the largest coalition loyalty programs in Latin America, with over 13 million registered participants, allowing clients to accumulate miles and redeem tickets for more than 700 locations worldwide. GOL has a team of more than 15,000 highly skilled aviation professionals delivering Brazil's top on-time performance, and an industry leading 17 year safety record. GOL's shares are traded on the NYSE (GOL) and the B3 (GOLL4).\nView original content: http://www.prnewswire.com/news-releases/re-tap-offering-for-senior-notes-due-2025-by-gol-finance-300590775.html\nSOURCE GOL Linhas Aéreas Inteligentes S.A.", "external_links": ["http://www.voegol.com.br/ir", "http://www.prnewswire.com/news-releases/re-tap-offering-for-senior-notes-due-2025-by-gol-finance-300590775.html"], "published": "2018-01-31T03:28:00.000+02:00", "crawled": "2018-01-31T05:33:10.000+02:00", "highlightTitle": ""}