{"organizations": [], "uuid": "2c9d57fb4eb32b1db2c4c68349e37c057d9d624e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219454592&w=1200&r=LYNXMPEE04006", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-germany-turkey/lets-make-up-turkish-foreign-minister-tells-germany-idUSKBN1EU00C", "country": "US", "domain_rank": 408, "title": "Let's make up, Turkish foreign minister tells Germany", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T02:08:00.000+02:00", "replies_count": 0, "uuid": "2c9d57fb4eb32b1db2c4c68349e37c057d9d624e"}, "author": "", "url": "https://www.reuters.com/article/us-germany-turkey/lets-make-up-turkish-foreign-minister-tells-germany-idUSKBN1EU00C", "ord_in_thread": 0, "title": "Let's make up, Turkish foreign minister tells Germany", "locations": [], "entities": {"persons": [{"name": "germany reut", "sentiment": "negative"}, {"name": "funke", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}, {"name": "gabriel", "sentiment": "none"}, {"name": "sigmar gabriel", "sentiment": "none"}, {"name": "cavusoglu", "sentiment": "none"}, {"name": "mevlut cavusoglu", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}], "organizations": [{"name": "min read  berlin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - Turkish Foreign Minister Mevlut Cavusoglu called on Friday for a fresh start in his country’s rocky relationship with Germany, holding out the prospect of closer economic cooperation if ties improved.\nBut his German counterpart Sigmar Gabriel, who will host Cavusoglu for talks in his hometown of Goslar in central Germany on Saturday, made clear Turkey must first release a German-Turkish journalist detained for more than a year without charge.\n“Both sides have an interest in a new start in the bilateral relationship as we live in a time full of challenges,” Cavusoglu wrote in a column for Germany’s Funke media group of newspapers. “It is not the time for bullhorn diplomacy.”\nHis comments underlined Turkey’s desire to mend fences with Germany, its biggest trade partner and an important NATO ally, after a series of disputes, including over Ankara’s large-scale crackdown on suspected supporters of a failed 2016 coup.\nCavusoglu urged Germany to develop a more “empathetic” tone in its dealings with Turkey, saying it did not seem to fully understand the “trauma” caused by the coup against President Tayyip Erdogan, in which some 240 people were killed.\nGabriel struck a more cautious note in remarks on Friday.\n“If we do not speak to one another the situation can certainly not improve - neither between our countries nor for individuals still being held in custody,” he told the weekly magazine Der Spiegel.\nBut, noting that Germany has refused to authorize “a large number of arms exports” to Turkey, he added: “That will remain so until the case of (Deniz) Yucel has been solved.”\nFILE PHOTO: German and Turkish flags flutter outside the Chancellery in Berlin, Germany, January 22, 2016, ahead of government consultations between German Chancellor Angela Merkel and Turkish Prime Minister Ahmet Davutoglu. REUTERS/Fabrizio Bensch Turkish authorities have accused Yucel, a correspondent for the German daily Die Welt, of spreading propaganda for the outlawed Kurdistan Workers Party (PKK). He denies the charge.\nGerman industry, which saw exports to Turkey shrink by 5.9 percent year-on-year in the first nine months of 2017, echoed Gabriel’s caution on restoring normal relations with Ankara.\n“The relaxation in tensions is welcome,” said Joachim Lang, head of the BDI Association of German Industry. “But a return to the rule of law and democracy is a condition for a sustained improvement in bilateral economic relations.”\nTURKISH CRACKDOWN German politicians have been outspoken critics of Turkey’s post-coup crackdown, in which some 50,000 people have been arrested pending trial and 150,000, including teachers, judges and soldiers, have been sacked or suspended from their jobs.\nTurkey says the crackdown, targeting alleged supporters of a Muslim network it blames for the coup, is necessary on security grounds. Ankara has criticized Germany’s refusal to hand over asylum seekers it says were involved in the failed putsch.\nCavusoglu said improved ties would allow the two countries to work more closely in areas including security and trade.\nHe said trade between Germany and Turkey amounted to 174 billion euros ($209.91 billion) in the last five years, with major opportunities in the coming decade from big infrastructure projects, in particular in transport and renewable energy.\nCavusoglu also stressed Turkey’s role in stemming a wave of migrants to Germany under a deal with the European Union in 2016 and said he hoped the EU would live up to its commitments to make it easier for Turks to get visas to visit the bloc.\nAdditional reporting by Emma Thomasson and Tulay Karadeniz in Ankara; Editing by Gareth Jones\n ", "external_links": [], "published": "2018-01-05T02:08:00.000+02:00", "crawled": "2018-01-05T02:19:16.008+02:00", "highlightTitle": ""}