{"organizations": [], "uuid": "84ad9a8ee3a1234717d1f9cd19f9fef8798cc518", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224372940&w=1200&r=LYNXMPEE0M08K", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-macau-wynn-license/casino-mogul-steve-wynn-confident-on-macau-concession-extension-idUSKBN1FC0H9", "country": "US", "domain_rank": 408, "title": "Casino mogul Steve Wynn confident on Macau concession extension", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T07:50:00.000+02:00", "replies_count": 0, "uuid": "84ad9a8ee3a1234717d1f9cd19f9fef8798cc518"}, "author": "", "url": "https://www.reuters.com/article/us-macau-wynn-license/casino-mogul-steve-wynn-confident-on-macau-concession-extension-idUSKBN1FC0H9", "ord_in_thread": 0, "title": "Casino mogul Steve Wynn confident on Macau concession extension", "locations": [], "entities": {"persons": [{"name": "steve wynn", "sentiment": "negative"}, {"name": "wynn", "sentiment": "none"}], "locations": [{"name": "macau", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hk", "sentiment": "none"}, {"name": "wynn macau", "sentiment": "none"}, {"name": "sands china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "wynn resorts wynn", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "sjm holdings", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mgm china", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 5:52 AM / in 9 hours Casino mogul Steve Wynn confident on Macau concession extension Reuters Staff 3 Min Read \nHONG KONG (Reuters) - U.S. casino magnate Steve Wynn, head of the eponymous Wynn Resorts WYNN.0, said he was confident his casino business in the world’s largest gambling hub of Macau would continue after casino contracts start to expire by 2020. \nThe Chinese-controlled territory has been a goldmine for Wynn, generating more than 75 percent of its total revenues through subsidiary Wynn Macau ( 1128.HK ). \nThe expiry of casino licenses in the former Portuguese colony has been a critical issue for operators, such as Sands China ( 1928.HK ), MGM China ( 2282.HK ) and SJM Holdings ( 0880.HK ), with the first round of licenses due to expire in two years. \nWynn’s concession with the Macau government runs until 2022, but authorities have provided little information about whether, and how, the licenses will be renewed. \nWynn told analysts on a conference call on Monday that his confidence stemmed from talks with the government in Macau. \n“We have been given reason to have confidence that our businesses will continue after the initial concession expiration dates,” he said. “That confidence is based upon the kind of conversations we have had with the government.” \nPrivately, some casino executives have expressed concern over the uncertainty, and have been making increasing efforts to stay on the right side of the authorities. \nWynn, who operates two luxury resorts in Macau and is also the Republican National Committee Finance chair, said China, which controls the special administrative region, was adamant about stability and did not like disruptions. \nHe had frequent discussions with casino bosses Sheldon Adelson, owner of Las Vegas Sands ( LVS.N ) and Sands China, and James Murren, head of MGM Resorts ( MGM.N ), he added. \n“We are so stitched into that community, with our employees and our company, that we feel comfortable in this situation,” he said. \nWynn said the local government had encouraged him to file plans for the company’s second phase on Macau’s fast-growing Cotai strip, modeled after Las Vegas with large, glitzy properties. \nThe company said it had about 11 acres (5 hectares) of adjacent property to develop on the Cotai strip, but gave no further details. \nShares in Wynn Macau jumped as much as 8 percent on Tuesday, after the company reported better-than-expected earnings, boosted by strong revenues at its newest resort, Wynn Palace. \nMacau’s licenses were first awarded in a complex process in the early 2000s. Government officials have said there may be a new public bidding process when they expire. \nThe casino sector is a huge part of Macau’s economy, employing two-thirds of its workforce, and paying taxes amounting to about 80 percent of government revenue. Reporting by Farah Master; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-23T07:50:00.000+02:00", "crawled": "2018-01-23T08:01:06.002+02:00", "highlightTitle": ""}