{"organizations": [], "uuid": "3473ea3bfc2526ea4f3cd94e0b977c74312d0786", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/reuters-america-canadian-marijuana-producers-end-rally-as-u-s-set-to-tighten-enforcement.html", "country": "US", "domain_rank": 767, "title": "Canadian marijuana producers end rally as U.S. set to tighten enforcement", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T23:43:00.000+02:00", "replies_count": 0, "uuid": "3473ea3bfc2526ea4f3cd94e0b977c74312d0786"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/reuters-america-canadian-marijuana-producers-end-rally-as-u-s-set-to-tighten-enforcement.html", "ord_in_thread": 0, "title": "Canadian marijuana producers end rally as U.S. set to tighten enforcement", "locations": [], "entities": {"persons": [{"name": "jeff sessions", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "toronto stock exchange", "sentiment": "none"}, {"name": "aphria inc", "sentiment": "none"}, {"name": "tmx group ltd", "sentiment": "none"}, {"name": "cannaroyalty corp", "sentiment": "none"}, {"name": "u.s. department of justice", "sentiment": "none"}, {"name": "horizons marijuana life sciences etf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan 4 (Reuters) - Canadian cannabis stocks fell on Thursday after the U.S. government said it would resume enforcement of federal laws banning marijuana in states that had legalized pot, disrupting a seven-day rally that boosted shares to record highs.\nThe U.S. Department of Justice rescinded an Obama administration policy that discouraged federal prosecutors from pursuing marijuana-related crimes in states that had legalized the drug. The action by Attorney General Jeff Sessions could harm the burgeoning marijuana industry in six states including California and Colorado.\nThe U.S.-listed ETFMG Alternative Harvest ETF, which launched on Dec. 26, closed down 6.2 percent. Canada's Horizons Marijuana Life Sciences ETF ended down 8.7 percent.\nAphria Inc, which has operations in Florida and Arizona, closed 13.8 percent lower, after falling as much as 22.7 percent earlier in the day.\nCannaRoyalty Corp, tumbled 15.8 percent. The company operates in California, which legalized recreational marijuana sales starting Jan. 1.\nTMX Group Ltd, the operator of the Toronto Stock Exchange, said in October it might delist stocks of marijuana companies with interests in the United States.\nTMX representatives could not immediately be reached for comment Thursday afternoon on the moves by Sessions.\nCanadian securities regulators have said companies must disclose any connection to the U.S. marijuana industry but have not prohibited them from listing in Canada. That could leave room for any firms rejected by TMX to move to other exchanges.\nCanadian Securities Administrators could also not be immediately reached for comment.\nJonathan Sherman, a marijuana securities lawyer at Canadian law firm Cassels Brock, said he expects regulators to change that policy, noting that the Canadian Securities Administrators said in October it would review the matter if there was a change in the U.S. government's approach.\n\"This would be of significant concern to Canadian cannabis companies with U.S. operations,\" Sherman said in a statement.\nStill, the majority of Canadian marijuana companies, which do not have U.S. operations, are unlikely to be harmed by the policy change in Washington, Chris Damas, editor of the BCMI Cannabis Report, said in an interview.\nHe said investors responded so strongly to the news because Canadian pot stocks just posted a strong rally.\n\"They've gone up so much in the last few trading days,\" Damas said. \"This is a reasonable retracement.\"\n(Reporting By Nichola Saminather; Editing by Jim Finkle and Lisa Shumaker)", "external_links": [], "published": "2018-01-04T23:43:00.000+02:00", "crawled": "2018-01-05T00:03:18.007+02:00", "highlightTitle": ""}