{"organizations": [], "uuid": "e984a8106ce267b022e0ecd797220c88263e3878", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-lensara-acquires-laser-business-assets-of-precision-eye-services-inc.html", "country": "US", "domain_rank": 767, "title": "LENSAR® Acquires Laser Business Assets of Precision Eye Services, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-11T16:05:00.000+02:00", "replies_count": 0, "uuid": "e984a8106ce267b022e0ecd797220c88263e3878"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-lensara-acquires-laser-business-assets-of-precision-eye-services-inc.html", "ord_in_thread": 0, "title": "LENSAR® Acquires Laser Business Assets of Precision Eye Services, Inc.", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "lensar", "sentiment": "none"}, {"name": "bloomington", "sentiment": "none"}], "organizations": [{"name": "acquires laser business assets of precision eye services, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "mn-based precision eye services, inc.", "sentiment": "none"}, {"name": "lensar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ORLANDO, Fla.--(BUSINESS WIRE)-- LENSAR, Inc. (LENSAR or the Company), a global leader in next generation femtosecond laser technology for refractive cataract surgery, today announced the acquisition of the laser business unit of Bloomington, MN-based Precision Eye Services, Inc. (PES). This acquisition consolidates the Company’s customer base for greater optimization, efficiency and speed to market. Financial terms of the acquisition were not disclosed.\nLENSAR and PES originally formed a commercial alliance in 2014, launching the mobile laser cataract service with the LENSAR® Laser System to surgeon-customers in the expanding laser refractive cataract market. Now, under LENSAR’s ownership, the PES laser customer base will have direct access to not only the rapid evolution of LENSAR’s technology – including the newly-launched LENSAR® Laser System with Streamline™ IV - but also the Company’s industry-leading sales, service and technical team.\n“With LENSAR’s strong growth and the continued development of our technology, it was the right time to bring these mobile laser operations under our umbrella,” said Nicholas T. Curtis, CEO of LENSAR. “Our relationship with PES has been key to providing more surgeons convenient and immediate access to LENSAR’s first-in-class technology and this asset acquisition consolidates sales, and training to support and expand that effort.”\nThis acquisition is latest in a series of steps LENSAR has completed as the Company continues to pursue its goal of market leadership. Recent news includes receiving FDA clearance of the LENSAR Laser System with Streamline IV and industry veteran William J. Link, Ph.D., joining the Company as chairman of the board.\n“This past year, we received the commitment and backing of PDL BioPharma, which has allowed LENSAR to not only meet our business goals for the year, but build value for the future. Strategic acquisitions such as this make good business sense and supports continued growth and more surgeons gaining access to our first-in-class technology,” continued Curtis.\nAbout the LENSAR Laser System with Streamline IV\nThe LENSAR Laser System with Streamline IV, the fourth LENSAR system upgrade in two years, is dedicated to helping surgeons manage astigmatism with extreme treatment planning insights. This latest upgrade features IntelliAxis-L, a unique reference mark that leverages LENSAR’s integrated pre-operative diagnostic capabilities, iris registration, and intraoperative imaging to precisely and permanently identify the location of the steep corneal axis at the capsular plane for intraoperative and postoperative toric IOL alignment. These custom-shaped marks are exclusive to the LENSAR femtosecond laser platform and cannot be duplicated manually or by any other device on the market today.\nThe LENSAR Laser System features quick and easy patient docking, as well as superior imaging capabilities including LENSAR’s proprietary Augmented Reality™ 3-D model. This technology facilitates enhanced procedure outcomes by allowing the physician to develop individualized treatment plans, including precise laser delivery and efficient lens fragmentation that can reduce, and potentially eliminate, the amount of ultrasonic energy delivered into the eye.\nAbout LENSAR, Inc.\nLENSAR, Inc., is a global leader in next generation femtosecond cataract laser technology for refractive cataract surgery. The LENSAR Laser System with Streamline IV offers cataract surgeons automation and customization for their astigmatism treatment planning and other essential steps of the refractive cataract surgery procedure with the highest levels of precision, accuracy, and efficiency. These features assist surgeons in managing astigmatism treatment for optimal overall visual outcomes.\nThe LENSAR Laser System has been cleared by the U.S. Food and Drug Administration for anterior capsulotomy, lens fragmentation, and corneal and arcuate incisions. For other indications, it is an investigational device limited by U.S. law to investigational use only.\nLENSAR, Inc. is a wholly-owned subsidiary of PDL BioPharma, Inc. For more information, please visit www.lensar.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111005099/en/\nfor LENSAR\nLisa Spicer, 818-785-5287\nlisa@engagedcommunication.net\nSource: LENSAR, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lensar.com&esheet=51741346&newsitemid=20180111005099&lan=en-US&anchor=www.lensar.com&index=1&md5=cabb0330d4f3369c04be97614f43869d", "http://www.businesswire.com/news/home/20180111005099/en/"], "published": "2018-01-11T16:05:00.000+02:00", "crawled": "2018-01-11T19:36:24.030+02:00", "highlightTitle": ""}