{"organizations": [], "uuid": "ad197d4c5d5c1e802486caa4d2fc9551fce559c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-allstate-announces-senior-leadership-changes.html", "country": "US", "domain_rank": 767, "title": "Allstate Announces Senior Leadership Changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T17:26:00.000+02:00", "replies_count": 0, "uuid": "ad197d4c5d5c1e802486caa4d2fc9551fce559c8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-allstate-announces-senior-leadership-changes.html", "ord_in_thread": 0, "title": "Allstate Announces Senior Leadership Changes", "locations": [], "entities": {"persons": [{"name": "matt winter", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "glenn shapiro", "sentiment": "none"}, {"name": "steve shebik", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}, {"name": "mario rizzo", "sentiment": "none"}, {"name": "tom wilson", "sentiment": "none"}, {"name": "glenn", "sentiment": "none"}, {"name": "mario", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "northbrook", "sentiment": "none"}], "organizations": [{"name": "allstate", "sentiment": "negative"}, {"name": "allstate corporation", "sentiment": "none"}, {"name": "allstate personal lines", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NORTHBROOK, Ill., Jan. 4, 2018 /PRNewswire/ -- Allstate announced three senior leadership promotions in preparation for the retirement of Matt Winter, President of The Allstate Corporation. The promotions include Steve Shebik to Vice Chairman of The Allstate Corporation, Glenn Shapiro to President of Allstate Personal Lines and Mario Rizzo to Chief Financial Officer.\n\"These leadership changes demonstrate Allstate's effectiveness in developing talent,\" said Tom Wilson, Chairman and Chief Executive Officer of The Allstate Corporation. \"Matt Winter has been a fabulous partner in preparing for this change by developing leaders, enhancing operating processes and maintaining a focus on precision execution. Steve and Mario have been integral to our success over the last two decades and Glenn's addition to the team in 2016 made us even stronger. Our continued success will be driven by a focused strategy, specific operating priorities and 19 diverse senior leaders, with an average of 15 years at Allstate,\" concluded Wilson.\nMatt Winter has decided to retire in late February after eight years at Allstate and a 25-year career in insurance. He joined Allstate in 2009 as President and CEO of Allstate Financial, became President of Allstate Personal Lines in 2012, and President of The Allstate Corporation in 2015. \"Matt has helped us achieve both strategic and operational success, and build a stronger organization. We wish him continued success in retirement,\" said Wilson.\nWinter is devoted to public service, including his current role on the board of Feeding America, the nation's leading hunger-relief charity. \"It has been a true honor to be part of the leadership team of this great company,\" said Winter. \"I know it is poised for continued success, as Tom has named an outstanding group of key leaders for this organization.\"\nShebik will oversee Allstate Life and Retirement, Allstate Benefits, Encompass, Esurance, Property-Liability Alternative Segments, Business Transformation, Finance, and D3, a corporate analytics team. He has successfully held numerous senior roles at Allstate over the last 22 years, most recently as Chief Financial Officer. He will continue reporting to Wilson.\nShapiro has been promoted to President of Allstate Personal Lines, overseeing product, claims, operations, risk, finance and distribution. He has more than 28 years of property-liability experience and joined Allstate in 2016 as Executive Vice President, Allstate Personal Lines Claims. Shapiro will focus on expanding the trusted advisor strategy, accelerating the utilization of telematics and building an Integrated Digital Enterprise. He will report to Wilson.\nRizzo is promoted to Executive Vice President and Chief Financial Officer, reporting to Shebik. Rizzo has served as Chief Financial Officer of Allstate Personal Lines as well as corporate Treasurer. He has been instrumental in ensuring Allstate's strong capital management and financial flexibility.\nThe Allstate Corporation (NYSE: ALL) is the nation's largest publicly held personal lines insurer, protecting people from life's uncertainties with 78 million proprietary policies. Allstate offers a broad array of protection products through multiple brands and diverse distribution channels, including auto , home , life and other insurance offered through its Allstate , Esurance , Encompass and Answer Financial brands. The company provides additional protection products and services through Allstate Benefits , Allstate Roadside Services , Allstate Dealer Services , Arity and SquareTrade . Allstate is widely known from the slogan \"You're In Good Hands With Allstate ® .\" Allstate agencies are in virtually every local community in America. The Allstate Foundation , Allstate, its employees and agency owners have a proud history of caring for local communities .\nFinancial information, including material announcements about The Allstate Corporation, is routinely posted on www.allstateinvestors.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/allstate-announces-senior-leadership-changes-300577634.html\nSOURCE Allstate", "external_links": ["https://www.allstate.com/life-insurance.aspx", "http://www.allstatenewsroom.com/", "http://www.allstate.com/home-insurance.aspx", "https://www.allstate.com/", "http://www.prnewswire.com/news-releases/allstate-announces-senior-leadership-changes-300577634.html", "http://www.allstate.com/roadside-assistance.aspx", "http://allstatedealerservices.com/Pages/Content/PublicHome.aspx", "http://www.allstateinvestors.com/", "http://www.allstatebenefits.com/", "https://ourstory.allstate.com/", "http://www.encompassinsurance.com/", "http://www.arity.com/", "http://www.allstatefoundation.org/", "http://www.esurance.com/", "https://www.allstate.com/corporate-responsibility.aspx?cid=OTC-PR-Corp-150312", "http://www.squaretrade.com/", "http://www.allstate.com/auto-insurance.aspx", "http://www.answerfinancial.com/"], "published": "2018-01-04T17:26:00.000+02:00", "crawled": "2018-01-04T19:18:52.007+02:00", "highlightTitle": ""}