{"organizations": [], "uuid": "6b8c8fd477b01ede8c1d3f2bc8bdc30a367894f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-lam-research-promotes-tim-archer-to-president.html", "country": "US", "domain_rank": 767, "title": "Lam Research Promotes Tim Archer to President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:05:00.000+02:00", "replies_count": 0, "uuid": "6b8c8fd477b01ede8c1d3f2bc8bdc30a367894f0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-lam-research-promotes-tim-archer-to-president.html", "ord_in_thread": 0, "title": "Lam Research Promotes Tim Archer to President", "locations": [], "entities": {"persons": [{"name": "tim archer", "sentiment": "negative"}, {"name": "martin anstice", "sentiment": "none"}, {"name": "archer", "sentiment": "none"}, {"name": "anstice", "sentiment": "none"}, {"name": "lam", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}], "locations": [{"name": "fremont", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "lam", "sentiment": "none"}], "organizations": [{"name": "lam research", "sentiment": "negative"}, {"name": "lam research corp.", "sentiment": "negative"}, {"name": "novellus systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FREMONT, Calif., Jan. 24, 2018 (GLOBE NEWSWIRE) -- Lam Research Corp. (NASDAQ:LRCX), a global supplier of advanced semiconductor manufacturing equipment, today announced the promotion of Tim Archer to the position of president, effective immediately. Mr. Archer will continue to serve as chief operating officer of the company, a position he has held since June 2012. Martin Anstice, Lam’s chief executive officer and current president, will continue as CEO.\n\"Tim has played a key role in leading the company through a period of transformational growth,” said Mr. Anstice. “The promotion to president is a natural evolution which recognizes Tim’s significant leadership to the success of Lam Research and the high-quality and complementary partnership that we share. It is wonderful to recognize his contributions and potential in the Office of the CEO with me; we have the privilege of working alongside an outstanding global leadership community at Lam.”\nMr. Archer was appointed chief operating officer of Lam Research in June 2012 when the company completed its acquisition of Novellus Systems, Inc. Mr. Archer was previously the chief operating officer of Novellus. He joined Novellus in 1994 and held a number of positions at that company, including executive vice president of Sales, Marketing, and Customer Satisfaction; executive vice president of the PECVD and Electrofill Business Units; and senior director of technology for Novellus Systems Japan.\nAs president and COO, Mr. Archer will focus on driving the operational priorities of the organization and be accountable for delivery of results across the entire company. His key focus will include ensuring that Lam continues to deliver enabling products and services to customers in a differentiated manner. As CEO, Mr. Anstice will continue to focus on the strategic agenda and have comprehensive engagement with the full community of stakeholders, including customers, employees, suppliers, partners, and investors.\nCaution Regarding Forward-Looking Statements\nStatements made in this press release that are not of historical fact are and are subject to the safe harbor provisions created by the Private 1995. Such relate to, but are not limited to Lam’s business, product and service strategies, and the future roles and responsibilities of Mr. Archer and Mr. Anstice. Some factors that may affect these include: business conditions in the consumer electronics industry, the semiconductor industry and the overall economy; and the actions of our customers and competitors, as well as the other risks and uncertainties that are described in the documents filed or furnished by us Commission, including specifically the Risk Factors described in our annual report on Form 10-K for the fiscal year ended June 25, 2017 and our quarterly report on Form 10-Q for the fiscal quarter ended September 24, 2017. These uncertainties and changes could materially affect the and cause actual results to vary from expectations in a material way. The Company undertakes no obligation to update the information or statements made in this release.\nAbout Lam Research\nLam Research Corp. is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world's leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq:LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com . (LRCX-F)\nCompany Contacts:\nSatya Kumar\nInvestor Relations\n510-572-3232\nemail: satya.kumar@lamresearch.com\nKerry Farrell\nCorporate Communications\n510-378-3175\nEmail: kerry.farrell@lamresearch.com\nSource:Lam Research Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/97b3e586-d286-42cd-b7a1-87dea62bf777"], "published": "2018-01-25T00:05:00.000+02:00", "crawled": "2018-01-25T02:37:42.000+02:00", "highlightTitle": ""}