{"organizations": [], "uuid": "d0fab01e89c8a566f9dff58cbb83de4b3c2fba46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 66, "shares": 66, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104977996-GettyImages-912418426.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/trump-gives-immigration-the-spotlight-in-state-of-the-union-commentary.html", "country": "US", "domain_rank": 767, "title": "Trump gives immigration the spotlight in State of the Union—Commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.219, "site_type": "news", "published": "2018-01-31T05:28:00.000+02:00", "replies_count": 0, "uuid": "d0fab01e89c8a566f9dff58cbb83de4b3c2fba46"}, "author": "Jake Novak", "url": "https://www.cnbc.com/2018/01/30/trump-gives-immigration-the-spotlight-in-state-of-the-union-commentary.html", "ord_in_thread": 0, "title": "Trump gives immigration the spotlight in State of the Union—Commentary", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "donald j. trump", "sentiment": "none"}], "locations": [{"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "u.s. house of representatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump's first State of the Union Address mostly followed the typical script created by his predecessors. But while he stuck to tradition in one way by touching on several topics, the one issue where the president clearly pulled out the most stops and made his best case was on immigration.\nImmigration was the single issue President Trump spent the most time discussing, taking up nearly 650 words. He devoted more time to it than his triumphant depiction of the economy and tax reform, the infrastructure plan, and even defense and fighting terrorism.\nHe began by pulling on the most potent heart strings possible with the story of two sets of Latino-American parents from Long Island, New York whose children were murdered by illegal immigrants in the MS-13 gang. Those parents were among the president's guests in the House gallery.\nBut it didn't stop there. He then made the case that illegal immigration and violence committed by some illegal immigrants hurts poorer Americans the most, trying to reach out to a typically Democratic constituency.\nPresident Trump then connected this problem directly to border security funding. He introduced another Latino-American, ICE Special Agent C.J. Martinez, and described the dangerous work he's done to fight MS-13 and other illegal immigrant criminals.\nThe biggest pitch came next: For the first time in his own words and in a fully public forum, President Trump outlined his offer of a path to citizenship to 1.8 million \"Dreamers\" who were brought to this country illegally by their parents.\nHe then made his case for building the wall, and ending the visa lottery and family-based migration.\nLove or hate the president's offer, one thing is clear: He won't get a better, more extensive and uninterrupted chance to make his immigration policy case to the both the left and right and everyone in between.\nIf he can't forge an immigration deal after this speech, he probably won't be able to at all. And if the polls don't move in favor of his border wall and citizenship proposals now, they probably never will.\nWe won't have to wait long to see if it worked. Senate Majority Leader Mitch McConnell has promised to put the DACA issue up to a vote by February 8 th .\nTrump isn't just testing Congress with this gambit, he's testing his own political capital. Almost three years after he made immigration the launching point issue of his presidential campaign, President Trump is going back to the beginning. Let's see if the rest of Washington is any closer to following along.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny . \nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-31T05:28:00.000+02:00", "crawled": "2018-01-31T05:27:55.018+02:00", "highlightTitle": ""}