{"organizations": [], "uuid": "33179c809e5bb7e8a32222c7ce0d618b1601f439", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-regal-entertainment-group-announces-expiration-of-ago-shopa-period.html", "country": "US", "domain_rank": 767, "title": "Regal Entertainment Group Announces Expiration of “Go-Shop” Period", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.877, "site_type": "news", "published": "2018-01-24T00:05:00.000+02:00", "replies_count": 0, "uuid": "33179c809e5bb7e8a32222c7ce0d618b1601f439"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-regal-entertainment-group-announces-expiration-of-ago-shopa-period.html", "ord_in_thread": 0, "title": "Regal Entertainment Group Announces Expiration of “Go-Shop” Period", "locations": [], "entities": {"persons": [], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "knoxville", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "regal entertainment group", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "rgc", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "morgan stanley & co", "sentiment": "none"}, {"name": "cineworld group plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KNOXVILLE, Tenn.--(BUSINESS WIRE)-- Regal Entertainment Group (NYSE: RGC) (“Regal”) a leading motion picture exhibitor owning and operating one of the largest theatre circuits in the U.S. today announced the expiration of the “go-shop” period pursuant to the terms of the previously announced merger agreement (the “Merger Agreement”), which provides for the acquisition of Regal by Cineworld Group plc (LON: CINE) (“Cineworld”), the U.K.’s largest cinema operator. Under the terms of the Merger Agreement, Regal and its representatives were permitted to solicit, initiate, discuss and engage in negotiations with respect to alternative acquisition proposals from third parties until midnight (New York City time) on January 22, 2018 (the “go-shop” period).\nDuring the “go-shop” period, with the assistance of Morgan Stanley & Co. LLC, Regal solicited 11 potential strategic bidders and 36 potential financial bidders (including private equity sponsors, family offices and sovereign wealth and pension funds), for a total of 47 potentially interested parties in connection with the “go-shop” period, which resulted in two parties negotiating and entering confidentiality agreements with Regal. Despite its solicitation efforts, Regal did not receive any alternative acquisition proposals during the “go-shop” period.\nImmediately following the expiration of the “go-shop” period, Regal became subject to customary restrictions that limit Regal and its representatives’ ability to solicit or engage in discussions regarding alternative acquisition proposals from third parties, except as otherwise permitted by the Merger Agreement prior to receipt of the approval of the transaction from Regal’s stockholders, including in connection with the compliance by Regal’s Board of Directors with its fiduciary duties under applicable law.\nAbout Regal Entertainment Group:\nRegal Entertainment Group (NYSE: RGC) operates one of the largest and most geographically diverse theatre circuits in the United States, consisting of 7,321 screens in 560 theatres in 43 states along with Guam, Saipan, American Samoa and the District of Columbia as of December 31, 2017. Regal operates theatres in 48 of the top 50 U.S. designated market areas. Regal believes that the size, reach and quality of Regal’s theatre circuit not only provide its patrons with a convenient and enjoyable movie-going experience, but is also an exceptional platform to realize economies of scale in theatre operations.\nAdditional Information and Where to Find It\nIn connection with the proposed transaction, Regal has and intends to file relevant materials with the Securities and Exchange Commission (the “SEC”), including Regal’s information statement in preliminary and definitive form. Regal filed a preliminary information statement with the SEC on December 22, 2017. Regal’s stockholders are strongly advised to read all relevant documents filed with the SEC, including Regal’s information statement, because they contain important information about the proposed transaction. These documents will be available at no charge on the SEC’s website at www.sec.gov . In addition, documents will also be available for free on Regal’s website at investor.regmovies.com .\nForward-Looking Statements\nThis press release includes “forward-looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “anticipate”, “believe”, “intend”, “expect”, “estimate”, “plan”, “outlook” and “project” and other similar expressions that predict or indicate future events or trends or that are not statements of historical matters. These statements are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially from those anticipated as a result of various factors, including: (1) conditions to the closing of the proposed transaction, including the obtaining of required regulatory or stockholder approvals, may not be satisfied; (2) the proposed transaction may involve unexpected costs, liabilities or delays; (3) the business of Regal and Cineworld may suffer as a result of uncertainty surrounding the proposed transaction; (4) the outcome of any legal proceedings related to the proposed transaction; (5) Regal and Cineworld may be adversely affected by other economic, business, and/or competitive factors; (6) the occurrence of any event, change or other circumstances that could give rise to the termination of the Merger Agreement; (7) the ability to recognize benefits of the proposed transaction; (8) risks that the proposed transaction disrupts current plans and operations and the potential difficulties in employee retention as a result of the proposed transaction; (9) other risks to consummation of the proposed transaction, including the risk that the proposed transaction will not be consummated within the expected time period or at all; and (10) the risks described from time to time in Regal’s reports filed with the SEC under the heading “Risk Factors,” including, without limitation, the risks described under the caption “Risk Factors” in the Regal’s Annual Report on Form 10-K dated February 27, 2017, as amended, and as may be revised in Regal’s future SEC filings. In light of these risks, uncertainties and assumptions, the future events and trends discussed in this release may not occur and actual results could differ materially and adversely from those anticipated or implied in the forward-looking statements. Neither Regal nor Cineworld undertakes any obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006485/en/\nFinancial Contact:\nKevin Mead\nRegal Entertainment Group\nVice President Investor Relations and Planning\nKevin.Mead@regalcinemas.com\n865-925-9685\nor\nMedia Contact:\nKen Thewes\nRegal Entertainment Group\nSenior Vice President and Chief Marketing Officer\nKen.Thewes@regalcinemas.com\n865-925-9539\nSource: Regal Entertainment Group", "external_links": ["http://www.businesswire.com/news/home/20180123006485/en/"], "published": "2018-01-24T00:05:00.000+02:00", "crawled": "2018-01-24T00:55:47.000+02:00", "highlightTitle": ""}