{"organizations": [], "uuid": "ca1764793a9b7cebdc7708c5d7ab783d137435ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/21/104856249-GettyImages-590244034.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/07/coravins-latest-product-reseals-the-wine-without-popping-the-cork.html", "country": "US", "domain_rank": 767, "title": "Coravin's latest product reseals the wine without popping the cork", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.946, "site_type": "news", "published": "2018-01-08T00:01:00.000+02:00", "replies_count": 0, "uuid": "ca1764793a9b7cebdc7708c5d7ab783d137435ec"}, "author": "Deborah Findling", "url": "https://www.cnbc.com/2018/01/07/coravins-latest-product-reseals-the-wine-without-popping-the-cork.html", "ord_in_thread": 0, "title": "Coravin's latest product reseals the wine without popping the cork", "locations": [], "entities": {"persons": [{"name": "coravin", "sentiment": "neutral"}], "locations": [], "organizations": [{"name": "et sun", "sentiment": "none"}, {"name": "international consumer electronics show", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coravin already has a device that pours wine without removing the cork. Now, it's uncorking a new product.\nCoravin's latest product, on display at the International Consumer Electronics Show (CES), reseals the wine without popping the cork.\n\"Coravin Model Eleven,\" priced at $999, is a wine preservation opener that will pair with a newly released app, \"Coravin Moments.\"\nThe Coravin Model Eleven is a fully automatic, Bluetooth-enabled wine bottle opener that can open a wine bottle and allow it to reseal itself for future uses.\nThe device allows consumers to access and pour wine from a bottle without pulling the cork by piercing it with a hollow needle that leaves the bottle resealed when the opener is removed.\nThe extracted wine is replaced with argon gas to preserve the remaining liquid. This allows consumers to have a glass of wine while continuing to age the bottle. Coravin founder Greg Lambrecht said corks can reseal themselves easily because they are elastic.\n\"The Model Eleven, it's fully automatic, so, for somebody who already has a Coravin, it no longer has a clamp that you interact with. You simply push it down on the bottle and it automatically guides the needle through the cork,\" said Lambrecht. The new model also has no trigger, pouring automatically and stopping once tipped back up.\nThe app will let drinkers monitor gas usage, cleaning and battery life through the new Bluetooth-enabled Coravin. The company's other models range from $199 to $500 depending on accessories and model. The Coravin Model Eleven will retail for $999 and launch in tandem with the app by end of September. While the latest device uses the Bluetooth to pair to the app's content, consumers with older models can still enjoy the app without the ability to pair their device.\nCoravin Moments app allows consumers to pair wine with movies, books and, of course, food.\n\"You can naturally type in any situation you want. For example \"godfather and tater tots\" and it'll predict the type of wines that you already own or that you can go out and get that would go perfectly with that combination of things,\" said Lambrecht.\nThe app can either choose from wines a consumer already owns and suggest moments that it would best be paired with or include anything from the perfect food pairing to music or literature. The company's proprietary algorithm works in conjunction with Delectable , one of the world's largest wine databases, which can take photos, recognize wines and then link to pairings.\nCoravin's CEO Frederic Levy spent 20 years with Nestle's Nespresso group prior to joining Coravin. The device itself was created by Lambrecht, a medical device inventor.\nLambrecht was excited to bridge the gap between the consumer hardware side of the business he's been involved with during the creation and now the more digital product the company is adding to the lineup.\nThe Coravin products are available to mass consumers and to high-end restaurants. The company has raised over $39 million from investors including Windham Venture Partners and Quadrille Capital.\nWith this latest product, the company hopes to learn from its consumers and propose how to make the wine they're consuming fit with the experience they're building.\n\"I love this connection of wine to the moment or experience that you're trying to create,\" said Lambrecht. \"For me emotionally and I think this is why so many people are passionate about wine is that it really amplifies any given experience or moment.\"", "external_links": [], "published": "2018-01-08T00:01:00.000+02:00", "crawled": "2018-01-08T00:01:42.020+02:00", "highlightTitle": ""}