{"organizations": [], "uuid": "59f2eb88d0447689850a3285e66bbcd613a79449", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223652832&w=1200&r=LYNXMPEE0J0KG", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-motor-rally-dakar/rallying-sainz-clinches-farewell-dakar-victory-for-peugeot-idUSKBN1F90TF", "country": "US", "domain_rank": 408, "title": "Rallying: Sainz clinches farewell Dakar victory for Peugeot", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T18:19:00.000+02:00", "replies_count": 0, "uuid": "59f2eb88d0447689850a3285e66bbcd613a79449"}, "author": "", "url": "https://www.reuters.com/article/us-motor-rally-dakar/rallying-sainz-clinches-farewell-dakar-victory-for-peugeot-idUSKBN1F90TF", "ord_in_thread": 0, "title": "Rallying: Sainz clinches farewell Dakar victory for Peugeot", "locations": [], "entities": {"persons": [{"name": "sainz", "sentiment": "negative"}, {"name": "matthias walkner", "sentiment": "none"}, {"name": "carlos sainz", "sentiment": "none"}, {"name": "sam sunderland", "sentiment": "none"}, {"name": "ken ferris", "sentiment": "none"}, {"name": "dakars", "sentiment": "none"}, {"name": "alan baldwin", "sentiment": "none"}, {"name": "nasser al-attiyah", "sentiment": "none"}], "locations": [{"name": "dakar", "sentiment": "none"}, {"name": "cordoba", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "peugeot", "sentiment": "negative"}, {"name": "volkswagen", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "ktm", "sentiment": "none"}, {"name": "peugeot reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Spanish veteran Carlos Sainz won the Dakar Rally in Argentina on Saturday as Peugeot bowed out with their third win in a row.\nThe victory, ahead of Qatar’s two times winner Nasser al-Attiyah in a Toyota, handed Sainz his second title in the grueling endurance race that switched to South America from Africa in 2009 for security reasons.\nThe double world rally champion previously won in 2010 with Volkswagen.\nPeugeot’s works team, who won the previous two Dakars with Frenchman Stephane Peterhansel, had already announced their departure after this year’s edition.\nAustrian Matthias Walkner, last year’s runner-up to British team mate Sam Sunderland, won the motorcycle category for his first Dakar triumph and KTM’s 17th in a row.\nSainz had led the cars into the final stage with a 46 minute advantage over al-Attiyah and he took no risks after a marathon two weeks from Peru through Bolivia that have seen a spate of retirements and accidents.\nHe was immediately applauded by his son and namesake, the Renault Formula One driver.\nDakar Rally - 2018 Peru-Bolivia-Argentina Dakar rally - 40th Dakar Edition stage fourteen, Cordoba to Cordoba - January 20, 2018. Carlos Sainz (R) of Spain celebrates with co-pilot Lucas Cruz of Spain after winning Dakar rally. REUTERS/Andres Stapff “Today I am probably the proudest son of his father in the whole world. Winner of the toughest @dakar ever done in South America at 55 years of age (good number) and he did it in his own way,” said the driver, who races with the number 55.\nSainz finished ninth on the last stage, beating al-Attiyah by 43 minutes.\nSlideshow (2 Images) The third place on the podium went to South African Giniel de Villiers in a Toyota, ahead of Peterhansel.\n”We managed to do it,“ said Sainz. ”They (Peugeot) have already won two times, but I think I deserved this victory because we have put lot of effort into this car.\n“I had ups and downs, but I always tried my best. Especially this rally, it has been so, so hard,” added the Spaniard, who left open the question of whether he would be back next year without Peugeot.\n“At the beginning I said we’ll take it a little bit easier, but Peugeot said we’d have to go flat out. I raced a couple of days and pushed really hard, but then the race was a case of not making mistakes.”\nRussian Eduard Nikolaev won the truck category in a Kamaz for the second year in a row and third time in total. Chilean Ignacio Casale won the quadbike title for the second time.\nReporting by Alan Baldwin in London, editing by Ken Ferris and Toby Davis\n ", "external_links": [], "published": "2018-01-20T18:19:00.000+02:00", "crawled": "2018-01-20T18:30:12.051+02:00", "highlightTitle": ""}