{"organizations": [], "uuid": "c52ee37fbff3b7b35df84715eb83898745e123e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/18/reuters-america-global-markets-strong-china-data-cranks-up-pressure-on-bond-markets.html", "country": "US", "domain_rank": 767, "title": "GLOBAL MARKETS-Strong China data cranks up pressure on bond markets", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-18T12:05:00.000+02:00", "replies_count": 0, "uuid": "c52ee37fbff3b7b35df84715eb83898745e123e8"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/reuters-america-global-markets-strong-china-data-cranks-up-pressure-on-bond-markets.html", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Strong China data cranks up pressure on bond markets", "locations": [], "entities": {"persons": [{"name": "marc jones", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}, {"name": "msci asia-pacific", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GLOBAL MARKETS-Strong China data cranks up pressure on bond markets Published 5:05 AM ET Thu, 18 Jan 2018 Reuters \n* Treasury yields hit highest in 10-months at 2.6 percent \nMSCI Asia-Pacific index hits record high, 26-yr peak for Nikkei \n* European stocks tick higher in choppy trade \n* Dollar index lifts off 3-year lows \n* Shanghai stocks buoyed, Q4 China GDP tad stronger than forecast \nBy Marc Jones \nLONDON, Jan 18 (Reuters) - Strong Chinese data on Thursday kept world stocks hovering near record highs, as bond markets pushed U.S. Treasury yields - the benchmark for global borrowing costs - to a 10-month high. \nUnderlining the momentum of the world economic expansion into the back end of last year, both Chinese fourth quarter growth of 6.8 percent and December industrial output growth of 6.2 percent were ahead of expectations. \nMost Asian bourses were closing when the data landed but had briefly set a new an all-time record after the U.S. bluechip Dow Jones Industrial index had closed above 26,000 points for the first time. \nChina's yuan <CNY=CFXS > finished at its highest since December 2015. Europe's main FTSE, Dax and CAC40 stock markets then ticked higher though moves were choppy in the cross currents of rising euro and bond yields. \nThe 10-year U.S. Treasury yield hit its highest since March 2017 at 2.60 percent which then pushed the European counterparts higher. Germany's 10-year bond yield, the benchmark for the region, was near a 5-1/2 month top at 0.52 percent. \n\"The likelihood we have higher inflation data in the big economies is well over 50 percent so that is the next turning point for the markets,\" SEB investment management's global head of asset allocation Hans Peterson said. \nHe added there were now two big questions. How will central banks respond and will the rise in bond yields happen at such a pace that it impacts optimism around assets like equities? \n\"We are going to change the regime probably within the next 2-3 months,\" he said. \"Will it be accompanied by rising producer prices then we can live with higher bond yields, otherwise it is a problem for us.\" \nThe break higher in U.S. yields helped the dollar rise from a three-year low hit earlier in the day in Asia. \nThe euro last stood at $1.2194, up 0.1 percent on the day but well below a peak of $1.2323 set on Wednesday, the euro's strongest level since December 2014. \nA number of top ECB policymakers were due to speak in Frankfurt. Some may have been caught off guard by the speed of the euro's appreciation, said Lee Jin Yang, macro research analyst for Aberdeen Standard Investments in Singapore. \n\"Maybe they are trying to manage volatility or slow down the rise,\" Lee said referring to Austria's Ewald Nowotny who told reporters on Wednesday that the euro's recent strength against the dollar was \"not helpful.\" \nTRAINED LIKE DOGS \nElsewhere, the Canadian dollar eased about 0.1 percent to C$1.2450, having see-sawed after the Bank of Canada raised interest rates but sounded a cautious tone on the future of the North American Free Trade Agreement (NAFTA). \nEmerging markets were gearing up meanwhile for a number of key interest rate meetings including in Turkey where last year's 18 percent slump in the lira versus the euro has got inflation back in double digits. \nSouth Africa's central bank also meets. After being sickly for much of 2017, a sounder political backdrop has seen the rand surge. It is one of the best performing currencies in the world so far this year, fueling talk of a possible rate cut. \n\"The South Africa meeting is the big show today. People are in it, they want to like it they want to own it,\" said UBP's EM macro and FX strategist Koon Chow. \"So any dovishness or a cut would be another trigger for another leg higher.\" \nThe rising U.S. bond could cause turbulence for EM debt markets,however. As well as the gains for benchmark Treasuries, The two-year yield hovered at a nine-year high of just over 2 percent. \n\"In emerging markets we are trained like dogs,\" Chow said about the rising yields. \"When we hear that bell ring we want to just run,\" \nIn commodities, crude oil prices rose earlier on data showing a decline in U.S. crude inventories and as rebels in Nigeria threatened to attack the country's petroleum infrastructure, before trimming their gains. \nU.S. crude futures were 2 cents higher at $63.99 a barrel have hit hit a three-year high of $64.89 on Tuesday. \nSpot gold was down 0.1 percent at $1,327.56 an ounce, with the dollar's bounce pulling it back from a four-month high of $1,344.43 set on Monday. (Reporting by Marc Jones Editing by Jeremy Gaunt) ", "external_links": [], "published": "2018-01-18T12:05:00.000+02:00", "crawled": "2018-01-19T16:47:27.022+02:00", "highlightTitle": ""}