{"organizations": [], "uuid": "73b64180758866e69386103af76b6f2247d232b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-oil-prices-kemp/u-s-shale-returns-to-growth-posing-problem-for-opec-kemp-idUSKBN1EU1BT", "country": "US", "domain_rank": 408, "title": "Column: U.S. shale returns to growth, posing problem for OPEC: Kemp", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.984, "site_type": "news", "published": "2018-01-05T21:54:00.000+02:00", "replies_count": 0, "uuid": "73b64180758866e69386103af76b6f2247d232b0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-oil-prices-kemp/u-s-shale-returns-to-growth-posing-problem-for-opec-kemp-idUSKBN1EU1BT", "ord_in_thread": 0, "title": "Column: U.S. shale returns to growth, posing problem for OPEC: Kemp", "locations": [], "entities": {"persons": [{"name": "kemp", "sentiment": "negative"}, {"name": "harold hamm", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "north dakota", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "negative"}, {"name": "continental resources", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - U.S. crude oil prices have risen above $60 per barrel which should accelerate shale drilling and production in the next few months, provided the price increase is sustained.\nU.S. crude futures are trading over $60 for all delivery months between February and August 2018, an increase of about 40 percent since the middle of 2017.\nAnd the futures strip for 2019, the benchmark against which U.S. shale producers can execute hedges for next year’s output, is trading over $56, up almost 20 percent on the last six months.\nHarold Hamm, chief executive of Continental Resources, one of the largest producers in North Dakota and Oklahoma, said last year that prices needed to be above $50 to be sustainable.\nAnalysis of earnings statements and drilling behavior of the shale firms confirmed most were not breaking when futures prices were below $50.\nBreakeven prices for shale vary tremendously between different companies, different basins and even different wells within the same play.\nBut with futures prices above $60, a much wider range of wells and shale plays should now be profitable.\nFutures prices are sending a clear signal to shale firms that they should step up drilling programs and boost output.\nExperience shows changes in drilling rates generally follow changes in futures prices with a lag of about 16 to 20 weeks.\nFutures prices have been rising fairly consistently for 27 weeks since hitting a trough around $43 in late June 2017.\nDrilling rates, as measured by the Baker Hughes rig count, started turning up 19 weeks later, consistent with normal behavior.\nThe rig count unexpectedly stalled in the second half of December, but the continued increase in futures prices strongly suggests the rig count will start increasing again and should rise at least through March and April.\nShale production is already increasing strongly as a result of the growing number of wells drilled earlier in 2017 and completed in the second half of last year.\nMonthly completion rates across the seven major shale plays climbed from 700 in January 2017 to 921 in June and 1,086 in November, according to the U.S. Energy Information Administration.\nProduction from the Lower 48 states excluding the Gulf of Mexico, much of it from shale formations, has surged from 6.6 million barrels per day (bpd) in January 2017 to 7.0 million bpd in June and 7.7 million bpd in October.\nProduction from the Lower 48 excluding federal waters in the Gulf is forecast to top 8 million bpd before the end of 2018, according to the Energy Information Administration.\nThe continued rise in prices makes it more likely the forecast will prove correct and onshore output will top 8 million bpd even earlier this year.\nThe more U.S. crude prices rise, the bigger the eventual production response is likely to be, which could significantly complicate OPEC’s attempt to draw down global oil inventories.\nOPEC must decide how far it is willing to allow prices to rise before increasing shale output threatens both its market share and its plan to reduce inventories.\n(John Kemp is a Reuters market analyst. The views expressed are his own.)\nEditing by Edmund Blair\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T21:54:00.000+02:00", "crawled": "2018-01-05T22:24:25.016+02:00", "highlightTitle": ""}