{"organizations": [], "uuid": "ba21992e6b6d7f87be54d5eb6db82d246b4499d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/05/the-associated-press-correction-washington-monsanto-lawsuit-story.html", "country": "US", "domain_rank": 767, "title": "Correction: Washington-Monsanto Lawsuit story", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T19:52:00.000+02:00", "replies_count": 0, "uuid": "ba21992e6b6d7f87be54d5eb6db82d246b4499d3"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/the-associated-press-correction-washington-monsanto-lawsuit-story.html", "ord_in_thread": 0, "title": "Correction: Washington-Monsanto Lawsuit story", "locations": [], "entities": {"persons": [{"name": "monsan", "sentiment": "negative"}, {"name": "jay inslee", "sentiment": "none"}, {"name": "bob ferguson", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "johnson associated press seattle", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "monsanto", "sentiment": "none"}, {"name": "pcb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE (AP) — In a story Dec. 8, 2016 about the state of Washington filing a lawsuit against Monsanto, The Associated Press reported erroneously that Monsanto stopped producing PCBs in 1979 when Congress banned the compounds. The company voluntarily stopped producing them in 1977.\nA corrected version of the story is below:\nWashington state suing agrochemical giant over PCB pollution\nWashington says it's the first U.S. state to sue the agrochemical giant Monsanto over pollution from PCBs\nBy GENE JOHNSON\nAssociated Press\nSEATTLE (AP) — Washington has become the first U.S. state to sue the agrochemical giant Monsanto over pervasive pollution from PCBs, the toxic industrial chemicals that have accumulated in plants, fish and people around the globe for decades. The company said the case \"lacks merit.\"\nDemocratic Gov. Jay Inslee and Attorney General Bob Ferguson announced the lawsuit at a news conference in downtown Seattle Thursday, saying they expect to win hundreds of millions or even billions of dollars from the company.\n\"It is time to hold the sole U.S. manufacturer of PCBs accountable for the significant harm they have caused to our state,\" Ferguson said, noting that the chemicals continue to imperil the health of protected salmon and orcas despite the tens of millions of dollars Washington has spent to clean up the pollution. \"Monsanto produced PCBs for decades while hiding what they knew about the toxic chemicals' harm to human health and the environment.\"\nThe suit arrives just days before Monsanto shareholders vote whether to accept a $57 billion buyout offer from Germany's Bayer. The extraordinary meeting of shareholders takes place just outside of St. Louis on Tuesday.\nPCBs, or polychlorinated biphenyls, were used in many industrial and commercial applications, including in paint, coolants, sealants and hydraulic fluids. Monsanto, based in St. Louis, produced them from 1935 until 1977, two years before they were banned by Congress.\nAccording to the U.S. Environmental Protection Agency, PCBs have been shown to cause a variety of health problems, including cancer in animals as well as effects on the immune, nervous and reproductive systems.\nIn a company release, Monsanto spokesman Scott S. Partridge said that the \"case is experimental because it seeks to target a product manufacturer for selling a lawful and useful chemical four to eight decades ago that was applied by the U.S. government, Washington State, local cities, and industries into many products to make them safer. PCBs have not been produced in the U.S. for four decades, and Washington is now pursuing a case on a contingency fee basis that departs from settled law both in Washington and across the country. Most of the prior cases filed by the same contingency fee lawyers have been dismissed, and Monsanto believes this case similarly lacks merit.\"\nIn response to a similar lawsuit filed last year by the city of Spokane, Washington, Monsanto said a previous incarnation of the company produced the PCBs, which it said \"served an important fire protection and safety purpose.\"\n\"PCBs sold at the time were a lawful and useful product that was then incorporated by third parties into other useful products,\" Charla Lord, a company spokeswoman, wrote. \"If improper disposal or other improper uses created the necessity for clean-up costs, then these other third parties would bear responsibility for these costs.\"\nSeveral other cities — including Seattle, Portland, Oregon, and Oakland, Berkeley, San Jose, Long Beach and San Diego, California — have also sued Monsanto over PCB pollution, the Attorney General's Office said. Those cases are ongoing.\nFerguson, a Democrat, pointed to internal Monsanto documents that show the company long knew about the danger the chemicals posed. In 1937, an internal memo said testing on animals showed \"systemic toxic effects\" from prolonged exposure by inhaling PCB fumes or ingestion. In 1969, a company committee on PCBs noted, \"There is too much customer/market need and selfishly too much Monsanto profit to go out.\"\n\"There is little probability that any action that can be taken will prevent the growing incrimination of specific polychlorinated biphenyls ... as nearly global environmental contaminants leading to contamination of human food (particularly fish), the killing of some marine species (shrimp), and the possible extinction of several species of fish eating birds,\" a committee memo said.\nNevertheless, Monsanto told officials around the country the contrary. In a letter to New Jersey's Department of Conservation that year, Monsanto wrote, \"Based on available data, manufacturing and use experience, we do not believe PCBs to be seriously toxic.\"\nFerguson said that infuriated him. He noted that his great-grandparents settled along Washington's Skagit River in the late 19th century. The Skagit was one of more than 100 water bodies in the state listed in the lawsuit as being polluted with PCBs.\n\"That river, the Skagit River, which my family depended on to a great degree in the 19th century as they homesteaded here, is now contaminated by PCBs, as are the fish,\" he said. \"That makes me mad.\"\nFerguson said his office had been in touch with counterparts in other states, but it remained unclear if other states would follow Washington's lead in suing the company.\nWashington's lawsuit seeks damages on several grounds, including product liability for what it described as Monsanto's failure to warn about the danger of PCBs; negligence; and even trespass, for injuring the state's natural resources.\nFollow Gene Johnson at https://twitter.com/GeneAPseattle", "external_links": [], "published": "2018-01-05T19:52:00.000+02:00", "crawled": "2018-01-07T03:42:01.005+02:00", "highlightTitle": ""}