{"organizations": [], "uuid": "8b1b8d4e7429f380ef897c4dc7cf40228a4aab09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223316611&w=1200&r=LYNXMPEE0I0MS", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/uk-britain-eu-city/london-finance-chief-sees-fewer-jobs-shifting-because-of-brexit-idUSKBN1F812N", "country": "US", "domain_rank": 408, "title": "London finance chief sees fewer jobs shifting because of Brexit", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.191, "site_type": "news", "published": "2018-01-19T18:54:00.000+02:00", "replies_count": 0, "uuid": "8b1b8d4e7429f380ef897c4dc7cf40228a4aab09"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-eu-city/london-finance-chief-sees-fewer-jobs-shifting-because-of-brexit-idUSKBN1F812N", "ord_in_thread": 0, "title": "London finance chief sees fewer jobs shifting because of Brexit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "mcguinness", "sentiment": "none"}, {"name": "catherine mcguinness", "sentiment": "none"}], "locations": [{"name": "brexit london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Britain’s vast financial services industry will suffer far fewer job losses from Brexit than first feared, the City of London’s policy chief told Reuters, in remarks that will boost supporters of leaving the EU who say the threat has been exaggerated.\nHome to the world’s highest number of banks and largest commercial insurance market, the City of London is scrambling to prepare for the loss of easy access to the European trading bloc, its most serious threat since the 2007-2009 financial crisis.\nCatherine McGuinness, the political leader of the historic municipal body at the heart of London, said the outlook for the industry had brightened after Britain and the European Union last month agreed to the principle of a transition deal and to talks about future trade relationships.\nThe industry also feels it is getting more of a hearing from Prime Minister Theresa May’s government.\n“The signs are positive, it is clear that the government is not only listening, but has understood our position,” McGuinness said in an interview in a room off the local government’s seat of power in the medieval Guildhall.\n“But now we have to persuade the EU27 to strike a deal which works for this sector.”\nFinancial services, which accounts for about 12 percent of Britain’s economic output, have been viewed as one of the industries that has the most to lose from the end of unfettered access to EU markets.\nBut Britain has stepped up its defence of its prized industry in the last few weeks with the government and central bank sending out messages that they expect the sector will be able to operate with little disruption after Brexit.\nMay told bankers last week she will put their industry at the heart of a new trade deal with the EU.\nMcGuinness also said the Bank of England’s offer to allow European bank branches in London to avoid a costly conversion into subsidiaries last month is an indication Britain will remain open to foreign investment.\nThe numbers of finance jobs that may be shifted out of Britain or created overseas as a result of Brexit are now likely to be at the lower end of estimates that have ranged broadly between 5,000 to 75,000 jobs or higher, she said.\nMirroring that view, Deutsche Bank ( DBKGn.DE ) said this week it expects to move fewer staff than some senior officials had expected from London to the continent.\nSlideshow (3 Images) BATTLES TO BE FOUGHT Christian Noyer, who is leading French efforts to persuade banks to pick Paris as a location after Brexit, also said Britain will remain Europe’s largest financial centre.\n“The City will remain very important. I don’t think it should be a nightmare like it sometimes appears to be in some articles,” Noyer told BBC Radio on Thursday.\nThe future of Britain’s financial services industry is still likely to emerge as one of the main battlegrounds between London and Brussels in divorce talks.\nTrade agreements typically cover goods and none has ever included financial services on the scale envisaged by Britain.\nDuring a visit to Britain on Thursday, French President Emmanuel Macron warned that he would not allow Britain’s financial industry to have privileged access to the EU single market.\nBut echoing comments from the Bank of England, McGuinness said a deal is “absolutely possible” if there is a will on both sides, given the starting point is full alignment of rules.\n“Just because there isn’t a previous model doesn’t mean you couldn’t do it if all parties want to,” she said.\n“We will get less than what we have at the moment whatever the settlement, and you can’t see the EU agreeing to anything else.”\nThe City of London is planning to bolster the size of its operation in Brussels to help pressure EU officials into giving Britain a good trade deal.\n“That’s making sure we play our part in making sure Britain has a loud voice when we are outside the room,” she said.\nBut McGuinness said the full impact of Brexit could take years to emerge.\n“There is a real risk that it may be a slow melt that we don’t see,” she said. “Just because you can’t see a massive change suddenly happening you can’t assume everything is okay.”\nEditing by Keith Weir\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T18:54:00.000+02:00", "crawled": "2018-01-20T17:50:03.019+02:00", "highlightTitle": ""}