{"organizations": [], "uuid": "a334800bd5fccb2521968c2bd7e49e897b923b04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226287293&w=1200&r=LYNXMPEE0S0UY", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-davos-meeting-breakingviews/breakingviews-beware-the-davos-bubbles-dubious-emissions-idUSKBN1FI1AN", "country": "US", "domain_rank": 408, "title": "Beware the Davos bubble’s dubious emissions", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T19:42:00.000+02:00", "replies_count": 0, "uuid": "a334800bd5fccb2521968c2bd7e49e897b923b04"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-meeting-breakingviews/breakingviews-beware-the-davos-bubbles-dubious-emissions-idUSKBN1FI1AN", "ord_in_thread": 0, "title": "Beware the Davos bubble’s dubious emissions", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "davos man", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON/MILAN The Davos bubble is prone to emitting dubious conclusions. Each January, the policymakers, business leaders, financiers, and various hangers-on who gather in the Swiss mountain resort offer up a snapshot of elite thinking. This “Davos consensus” often proves wide of the mark.\nDelegates at the World Economic Forum have in previous years failed to foresee the financial crisis and the election of Donald Trump. Twelve months ago they broadly agreed that the new U.S. president would be a pragmatic leader; that China was becoming a defender of globalisation: and that Europe’s economy would be paralysed by nationalist politics. Not so much.\nGiven this dismal record it might be useful to examine the likely examples of groupthink to emerge from Davos Man and Woman this year.\nTHE GLOBAL ECONOMY WILL NOT BE KNOCKED OFF COURSE In panel debates and private discussions, optimism about synchronised growth was almost unanimous. China’s rate of expansion has stabilised, the euro zone is resurgent, and the United States has just received an extra boost from a tax cut. The International Monetary Fund upgraded its global GDP growth forecasts to 3.9 percent for 2018 and 2019. Others are aiming even higher. At a private reception with business leaders in Davos, Trump questioned why U.S. GDP couldn’t grow at the same rate as China’s or India‘s, joking that it might plausibly grow by 7 percent, people at the event told Breakingviews.\nSuch ebullience invites comparisons with January 2007, when optimistic delegates failed to spot the fragilities of the financial system. Bankers who still bear the scars of that crisis were more cautious, expressing concern about a sudden pickup in inflation and interest rates, or an increase in trade protectionism. Others thought disappointing results from big U.S. tech giants could trigger a stock market correction.\nMore fundamentally, the assembled delegates seemed to be hoping that lower unemployment would ease the political divisions exposed by the last financial crisis. But as one former central banker pointed out: “We tried growing our way out of inequality before, and it doesn’t work.”\nTHERE WON‘T BE AN ITALIAN ELECTORAL SURPRISE\nNo prognostication will be tested as soon as the consensus view that Italy’s general election, the first since 2013, won’t upset the political support for the European Union in the region’s largest economies. Italians vote on March 4, less than a month after Prime Minister Paolo Gentiloni addressed the World Economic Forum. The widely held view among Italian executives and bankers in Davos is that the 5-Star Movement, whose leaders have threatened to pull out of the single currency, will fail to win enough seats in the Chamber of Deputies to form a government.\nThat, the thinking goes, would force Matteo Renzi’s centre-left Democratic Party and Silvio Berlusconi’s centre-right Forza Italia to band together, alongside the Northern League, and form a grand coalition returning Gentiloni to the premiership. As part of the deal, Berlusconi and the League would have a strong influence over the new government’s economic portfolio, nominating someone like Lorenzo Bini Smaghi, formerly of the European Central Bank and now chairman of Société Générale, as finance minister.\nGiven the latest poll commissioned by La Repubblica from Demos & Pi, that’s plausible. Though it is the leading party, 5-Star would only receive 28 percent of the ballot compared to a combined 51.6 percent for the next three parties. But if there is one constant in post-war European politics, it is Italy’s potential to upset the status quo. Demos said an astounding 47 percent of those polled are still undecided. That leaves plenty of potential for an Italian surprise.\nCRYPTO-CURRENCIES WILL TRANSFORM THE WORLD If the buzz around Davos was an accurate predictor of future trends, bitcoin and other digital currencies would be on their way to displacing the dollar, euro and yen. Forums like the CryptoHQ on Davos’ main shopping street hosted entrepreneurs and venture capitalists who earnestly discussed the merits of different tokens and coin offerings.\nBankers debated the phenomenon for different reasons. The risk that criminals will use crypto-currencies to launder money into regulated banks was the main issue raised at a closed-door session among senior regulators. “We need to minimise the points of infection,” the CEO of one large bank declared.\nA more likely outcome, however, is that the speculative frenzy surrounding crypto-currencies will continue to deflate, prompting those seeking a quick fortune to move on. Though monetary authorities may eventually co-opt aspects of blockchain technology, the claims made on behalf of bitcoin - both for good and bad - look equally exaggerated.\nCHANGE IN SAUDI ARABIA WILL BE FOR THE BETTER Recent developments in the desert kingdom were the subject of near-unanimous approval at Davos. Though many senior Saudi royals and businessmen stayed at home, Western bankers and businessmen were full of praise for Crown Prince Mohammed bin Salman‘s economic and social reforms. Chief among them were representatives from the banks underwriting Saudi Aramco’s mooted $100 billion sale of stock this year who attended a dinner co-hosted by the national oil firm’s boss. Even the arrest of Saudi princes and businessmen on corruption charges won admirers. Any doubts about political stability in the world’s largest oil producer were firmly pushed to the background. An anti-MbS backlash would catch many off guard.\nDAVOS GETS AN AWFUL LOT WRONG Throughout the week, a growing number of delegates could be found questioning the received wisdom. Indeed, it’s quite possible that the idea that the Davos consensus is often wrong itself becomes the accepted view. This kind of meta-consensus might be helpful in resisting the Davosian urge to offer simplistic summaries of complex issues. Alternatively, it could prompt delegates to question why they bother attending at all.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-29T19:42:00.000+02:00", "crawled": "2018-01-29T15:08:15.006+02:00", "highlightTitle": ""}