{"organizations": [], "uuid": "0270689a6a71f6260f04bd888e256637a1900eb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/brainstorm-health-daily-01-16-18/", "country": "US", "domain_rank": 1196, "title": "Brainstorm Health: Universal Flu Vaccine, Merck Lung Cancer Drug, UnitedHealth Earnings | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-16T15:33:00.000+02:00", "replies_count": 0, "uuid": "0270689a6a71f6260f04bd888e256637a1900eb3"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/16/brainstorm-health-daily-01-16-18/", "ord_in_thread": 0, "title": "Brainstorm Health: Universal Flu Vaccine, Merck Lung Cancer Drug, UnitedHealth Earnings | Fortune", "locations": [], "entities": {"persons": [{"name": "sy", "sentiment": "neutral"}, {"name": "dan jernigan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "merck lung cancer drug", "sentiment": "negative"}, {"name": "unitedhealth", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "vaccitech", "sentiment": "none"}, {"name": "center for immunization and respiratory diseases", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1:33 PM EST \nHello, readers! This is Sy. \nGoogle parent Alphabet’s venture arm GV (formerly Google Ventures) is among the companies backing U.K. biotech Vaccitech , which has set out to achieve one of medicine’s most-sought milestones: developing a universal flu vaccine . The company has drawn in $27 million in new funding to help, in part, fund large clinical trials of its vaccine as the most widespread flu season in at least a dozen years rages in the U.S. \nThe 2018 flu season is already so deadly that it’s stretching hospital resources to the breaking point in states like California. In fact, Dan Jernigan, director of the influenza division at the national Center for Immunization and Respiratory Diseases, says this flu season represents “the first year we have had the entire continental U.S. be the same color on the [flu tracking] graph, meaning there is widespread activity in all of the continental U.S. at this point.” Public health officials say the flu outbreak may be peaking right now; but since flu season can last into May, millions of more people may get sick (and tens or hundreds of thousands more hospitalized) before all is said and done. The dominant H3N2 strain of the flu going around in 2018 is a particularly nasty one, especially for older Americans, and several more strains like H1N1 are expected to arise within the next few months. \nPart of what makes outbreaks like the 2018 flu season so difficult to control is the imperfection of current flu vaccination methods. This year’s vaccine may only be about 30% to 40% effective (although public health officials still strongly urge all Americans who can to get a flu shot , no matter how late into the season). In any given year, flu vaccine effectiveness ranges from about 40% to 60%. And a major factor is that scientists must try to predict which strains of the flu will be most dominant months ahead of peak flu, since millions of vaccine doses need to be created in time for the fall. Their projections, however educated, aren’t always correct. And the flu virus itself can always evolve. \nA universal flu vaccine would theoretically address this problem by attacking the parts of the influenza virus which don’t change over time. That’s what Vaccitech, which was founded by Oxford University scientists, is attempting to do with its vaccine technology—attack proteins at the flu virus’ core rather than the dynamic ones on its surface and stimulate immune T-cells rather than antibodies. The universal vaccine is moving into mid-stage trials, which means successful studies could lead to a commercial launch by the mid-2020s, according to Vaccitech CEO Tom Evans. \nRead on for the day’s news. Sy Mukherjee @the_sy_guy DIGITAL HEALTH \nCould AI detect cardiac arrest through the phone? A small, early stage study in Copenhagen suggests that artificial intelligence may be better able to recognize cardiac arrest through descriptions over the phone better than human dispatchers can. According to the study, the AI (which uses machine learning to improve its understanding of sounds, including non-verbal and involuntary noises such as irregular breathing) was able to correctly identify cardiac arrest 95% of the time while dispatchers were able to 73% of the time. ( Fast Company ) INDICATIONS \nMerck’s star cancer drug strikes again in lung cancer. Shares of pharmaceutical giant Merck soared 7% in Tuesday trading as a late-stage clinical trial showed that its flagship cancer immunotherapy treatment, Keytruda, helped lung cancer patients live longer when combined with two chemotherapy drugs as a “first-line” treatment (i.e., the first set of treatments given to a patient). Merck actually already secured U.S. Food and Drug Administration approval for Keytruda plus chemotherapy as a first-line lung cancer treatment; the reason investors are so enthusiastic about the latest data is that it significantly boosts the company’s chances of a similar approval in Europe, where regulators had requested more information. ( Reuters ) THE BIG PICTURE \nUninsurance rate rises in 2017 for first time in years. It’s official: the number of uninsured Americans ballooned by 3.2 million in 2017, the first annual increase in the uninsurance rate since the key provisions of the Affordable Care Act (ACA) aka Obamacare went into effect in 2014, according to Gallup. The uninsured rate stood at 12.2% in the fourth quarter of 2017; that’s a significant rise from the 10.9% rate Gallup found at the end of 2016 (other surveys have indicated the rate fell to below 10% for the first time in 2016). The uninsured rate could increase even more over 2018 as states begin implementing major changes to Medicaid, such as work requirements, recently cleared by the Trump administration. ( NBC News ) \nUnitedHealth shares spike on profit jump. Health insurance giant UnitedHealth’s stock rose about 2.5% in Tuesday trading after the company offered a sharp rise in its 2018 earning per share outlook and a doubling of profit thanks to a one-time tax gain from corporate tax cuts. The company said it would move to invest more in data analytics and technology. ( CNBC ) REQUIRED READING ", "external_links": [], "published": "2018-01-16T15:33:00.000+02:00", "crawled": "2018-01-16T20:56:56.033+02:00", "highlightTitle": ""}