{"organizations": [], "uuid": "94251ffa44bf9c656bfc50593866c513e95f72dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/25/reuters-america-sunpower-puts-u-s-expansion-on-hold-over-trump-tariff.html", "country": "US", "domain_rank": 767, "title": "SunPower puts U.S. expansion on hold over Trump tariff", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T01:58:00.000+02:00", "replies_count": 0, "uuid": "94251ffa44bf9c656bfc50593866c513e95f72dc"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/reuters-america-sunpower-puts-u-s-expansion-on-hold-over-trump-tariff.html", "ord_in_thread": 0, "title": "SunPower puts U.S. expansion on hold over Trump tariff", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "tom werner", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "werner", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "sunpower", "sentiment": "negative"}, {"name": "sunpower corp", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 25 (Reuters) - SunPower Corp on Thursday said it was putting a $20 million U.S. factory expansion and hundreds of new jobs on hold until and unless its solar panels receive an exclusion from federal tariffs the Trump administration imposed this week.\nPresident Donald Trump's decision to impose tariffs on cheap imported panels was intended to protect American manufacturing jobs, but many in the solar industry have argued that tariffs will raise costs and trigger thousands of layoffs in the installation end of the industry.\nSunPower, which is based in San Jose, California, but does most of its manufacturing in the Philippines and Mexico, will be hit harder than most in the industry by the announced 30 percent tariff on imported solar modules, Chief Executive Tom Werner said in an interview.\n\"We make a different product that's higher efficiency and that product costs more,\" Werner said. \"We pay a higher tariff despite the fact that it's an American technology.\"\nSunPower has argued that its premium-priced panels, which are among the most efficient in the industry at transforming sunlight into electricity, should receive an exemption from the tariffs because their unique technology cannot be compared with that of more conventional models, including those made by the companies that sought the tariffs, Suniva and SolarWorld.\nThe Trump administration did not announce any product exemptions when it unveiled the tariffs. The U.S. Trade Representative will announce the rules for requesting an exclusion by Feb. 22. The tariffs will take effect Feb. 7.\n\"We have to stop the $20 million investment because the tariffs start before we know if we're excluded,\" Werner said. \"It's not hypothetical. These were positions that we were recruiting for that we are going to stop.\"\nThat investment would create \"hundreds\" of jobs at SunPower facilities in California and Texas, Werner said. They would include jobs in research and development, manufacturing and sales and would be focused on the company's next-generation cell technology.\nSunPower's project development arm has already lost business to rival First Solar Inc, which makes panels that are exempt from tariffs.\nSunPower is majority owned by France's Total SA. (Reporting by Nichola Groom; Editing by Leslie Adler)", "external_links": [], "published": "2018-01-26T01:58:00.000+02:00", "crawled": "2018-01-26T11:21:35.140+02:00", "highlightTitle": ""}