{"organizations": [], "uuid": "05382f848ccebb1f2ba958c573f38c7c9c282cdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-curantis-solutions-hires-chief-sales-officer-debra-l-newton.html", "country": "US", "domain_rank": 767, "title": "Curantis Solutions Hires Chief Sales Officer Debra L. Newton", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T15:00:00.000+02:00", "replies_count": 0, "uuid": "05382f848ccebb1f2ba958c573f38c7c9c282cdb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-curantis-solutions-hires-chief-sales-officer-debra-l-newton.html", "ord_in_thread": 0, "title": "Curantis Solutions Hires Chief Sales Officer Debra L. Newton", "locations": [], "entities": {"persons": [{"name": "debra l. newton", "sentiment": "negative"}, {"name": "newton", "sentiment": "none"}, {"name": "john carreker", "sentiment": "none"}, {"name": "debi", "sentiment": "none"}], "locations": [{"name": "addison", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "negative"}, {"name": "curantis solutions", "sentiment": "negative"}, {"name": "debra l. newton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ADDISON, Texas, Jan. 25, 2018 /PRNewswire/ -- Curantis Solutions, LLC, the software solutions company focused exclusively on serving the hospice and palliative care sector, announces that Debra L. Newton has joined its leadership team as Chief Sales Officer.\nNewton has more than 20 years of experience leading high performing technology sales teams in the healthcare arena, demonstrating exceptional ability to establishing long-lasting client relationships. Besides her professional sales experience, Newton is also a registered nurse and spent 10 years as an on-call hospice nurse.\nJohn Carreker, Curantis Chief Executive, said, \"Debi brings us the perfect mix of talents and enterprise sales experience that will enable us to quickly take our innovative solution to the hospice companies who need the efficiency and compliance it provides. She is intimately familiar with the work of hospice workers and administration and how technology can enable them to give better care to their patients while also working more productively. And she has tremendous credibility in the hospice marketplace, having developed trusted relationships through her work of many years.\"\nNewton said, \"I knew I wanted to take this role with the Curantis team as soon as I saw the software solution, because it is obviously created solely with hospice in mind, instead of a home healthcare solution loosely and inadequately configured. Clearly, it was developed to the highest standards by people who know the importance of hospice work and its unique needs. I am looking forward to working with the Curantis leadership team to take it to a marketplace sorely in need of just this solution.\"\nNewton was most recently with GetWellNetwork as Vice President of Strategic Sales, preceded by highly successful sales stints with Kinnser Software and Allscripts Healthcare.\nAbout Curantis Solutions\nCurantis Solutions, dedicated to Advancing Care through Innovation, delivers value to hospice companies and their patients through an innovative and integrated end-to-end cloud-based management software solution. Curantis allows hospice companies to increase clinical, operational and financial efficiencies, and to focus on healthy growth while providing enhanced, coordinated patient care.\nView original content with multimedia: http://www.prnewswire.com/news-releases/curantis-solutions-hires-chief-sales-officer-debra-l-newton-300588034.html\nSOURCE Curantis Solutions", "external_links": ["http://www.prnewswire.com/news-releases/curantis-solutions-hires-chief-sales-officer-debra-l-newton-300588034.html"], "published": "2018-01-25T15:00:00.000+02:00", "crawled": "2018-01-25T16:26:25.011+02:00", "highlightTitle": ""}