{"organizations": [], "uuid": "4e6fd54702bd3b875a967cd8e6d3533ab80aa9b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222210394&w=1200&r=LYNXMPEE0E0ER", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-russia-lavrov-iran-usa/russia-will-not-support-u-s-attempts-to-change-iran-nuclear-deal-lavrov-idUKKBN1F40TC", "country": "US", "domain_rank": 408, "title": "Russia will not support U.S. bid to change Iran nuclear deal: Lavrov", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T20:35:00.000+02:00", "replies_count": 0, "uuid": "4e6fd54702bd3b875a967cd8e6d3533ab80aa9b4"}, "author": "", "url": "https://uk.reuters.com/article/uk-russia-lavrov-iran-usa/russia-will-not-support-u-s-attempts-to-change-iran-nuclear-deal-lavrov-idUKKBN1F40TC", "ord_in_thread": 0, "title": "Russia will not support U.S. bid to change Iran nuclear deal: Lavrov", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "lavrov", "sentiment": "none"}, {"name": "sergei lavrov", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "lavrov reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 8:24 AM / Updated an hour ago Russia will not support U.S. bid to change Iran nuclear deal: Lavrov Reuters Staff 2 Min Read \nMOSCOW (Reuters) - Russian Foreign Minister Sergei Lavrov said on Monday Moscow will not support attempts by Washington to modify the Iran nuclear deal, arguing such a move could also complicate diplomacy over North Korea’s nuclear weapons programme. \nLavrov spoke days after U.S. President Donald Trump said he would waive nuclear sanctions against Iran for the last time to give Washington and its European allies a chance to fix the “terrible flaws” of the 2015 nuclear deal. \n“We will not support what the United States is trying to do, changing the wording of the agreement, incorporating things that will be absolutely unacceptable for Iran,” Lavrov told a news conference in Moscow. \nRussia’s top diplomat, who stressed that Russia will work to preserve the existing Iran nuclear deal, also warned that the agreement’s collapse could be detrimental to dialogue with North Korea. FILE PHOTO - Russian Foreign Minister Sergei Lavrov speaks during his annual news conference in Moscow, Russia January 15, 2018. REUTERS/Sergei Karpukhin \nLavrov suggested Pyongyang would look at how Iran had been treated by Washington and wonder if any deal it did with the United States on its own missile and nuclear programme would hold or also be called into question. \n“If the deal is put aside and Iran is told, ‘you keep up with your obligations or we will impose sanctions again’, then you have to see it from North Korea’s point of view,” said Lavrov, stressing the international community should approach the two countries’ nuclear programmes in the same manner. \n“They are being promised that sanctions will be lifted if they give up their nuclear programme. They will give it up, but no one will lift the sanctions against Pyongyang.” \nIn separate comments on Monday, Ali Shamkhani, the secretary of Iran’s National Security Council, said Trump’s threats to withdraw from the nuclear deal were fanning “Iranophobia” and meant to deprive Tehran of the agreement’s economic benefits. \n“Scaring the international community with the decisions of a mad man is a repetitive tactic that has proved to be ineffective,” Fars news agency quoted Shamkhani as saying. Reporting by Jack Stubbs in Moscow and Bozorgmehr Sharafedin in London; Writing by Gabrielle Tétrault-Farber; Editing by William Maclean", "external_links": [], "published": "2018-01-15T20:35:00.000+02:00", "crawled": "2018-01-15T21:12:53.008+02:00", "highlightTitle": ""}