{"organizations": [], "uuid": "8e90a7cf7fd9f7a6b46335b393b273e8dc222f7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-aberdeen-asia-pacific-income-fund-inc-announces-record-date-and-payment-date-for-monthly-distribution.html", "country": "US", "domain_rank": 767, "title": "Aberdeen Asia-Pacific Income Fund, Inc. Announces Record Date And Payment Date For Monthly Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:15:00.000+02:00", "replies_count": 0, "uuid": "8e90a7cf7fd9f7a6b46335b393b273e8dc222f7c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-aberdeen-asia-pacific-income-fund-inc-announces-record-date-and-payment-date-for-monthly-distribution.html", "ord_in_thread": 0, "title": "Aberdeen Asia-Pacific Income Fund, Inc. Announces Record Date And Payment Date For Monthly Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "philadelphia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "aberdeen asia-pacific income fund, inc", "sentiment": "neutral"}, {"name": "aberdeen asia-pacific income fund, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Jan. 10, 2018 /PRNewswire/ -- Aberdeen Asia-Pacific Income Fund, Inc. ( NYSE American: FAX) (the \"Fund\"), a closed-end fund, today announced that it will pay on January 30, 2018, a distribution of US $0.035 per share to all shareholders of record as of January 22, 2018.\nYour Fund's distribution policy is to provide investors with a stable monthly distribution out of current income, supplemented by realized capital gains and, to the extent necessary, paid-in capital.\nUnder U.S. tax rules applicable to the Fund, the amount and character of distributable income for each fiscal year can be finally determined only as of the end of the Fund's fiscal year. However, under Section 19 of the Investment Company Act of 1940, as amended (the \"1940 Act\") and related Rules, the Fund may be required to indicate to shareholders the source of certain distributions to shareholders.\nThe following table sets forth the estimated amounts of the sources of the distribution for purposes of Section 19 of the 1940 Act and the Rules adopted thereunder. The table has been computed based on generally accepted accounting principles. The table includes estimated amounts and percentages for the distribution to be paid on January 30, 2018 as well as the estimated cumulative distributions declared fiscal year to date (11/01/2017 - 12/31/2017), from the following sources: net investment income; net realized short-term capital gains; net realized long-term capital gains; and return of capital. The estimated composition of the distributions may vary from month to month because the estimated composition may be impacted by future income, expenses and realized gains and losses on securities and currencies.\nEstimated Amounts of Current Monthly Distribution per share ($)\nEstimated Amounts of Current Monthly Distribution per share (%)\nEstimated Amounts of Fiscal Year to Date Cumulative Distributions per share ($)\nEstimated Amounts of Fiscal Year to Date Cumulative Distributions per share (%)\nNet Investment Income\n$0.0168\n48%\n$0.0504\n48%\nNet Realized Short-Term Capital Gains*\n$0.0018\n5%\n$0.0053\n5%\nNet Realized Long-Term Capital Gains\n-\n-\n-\n-\nReturn of Capital\n$0.0164\n47%\n$0.0493\n47%\nTotal (per common share)\n$0.0350\n100%\n$0.1050\n100%\n*includes currency gains\nThe Fund estimates that it has distributed more than its income and capital gains; therefore, a portion of your distribution may be a return of capital. A return of capital may occur for example, when some or all of the money that you invested in the Fund is paid back to you. A return of capital distribution does not necessarily reflect the Fund's investment performance and should not be confused with \"yield\" or \"income.\"\nAs of December 31, 2017, after giving effect to this payment, the Fund estimates it has a net deficit of $34,740,000. A net deficit results when the Fund has net unrealized losses that are in excess of any net realized gains that have not yet been distributed.\nShareholders should not draw any conclusions about the Fund's investment performance from the amount of the Fund's current distributions or from the terms of the distribution policy (the \"Distribution Policy\").\nThe amounts and sources of distributions reported in this notice are only estimates and are not being provided for tax reporting purposes. The final determination of the source of all distributions in 2018 will be made after year-end. The actual amounts and sources of the amounts for tax reporting purposes will depend upon the Fund's investment experience during the remainder of the fiscal year and may be subject to change based on tax regulations. The Fund will send you a Form 1099-DIV for the calendar year that will tell you how to report these distributions for federal income tax purposes.\nThe following table provides the Fund's total return performance based on net asset value (NAV) over various time periods compared to the Fund's annualized and cumulative distribution rates.\nAverage Annual Total Return on NAV for the 5 Year Period Ending 12/31/2017 1\n0.72%\nCurrent Fiscal Period's Annualized Distribution Rate on NAV 2\n7.69%\nFiscal Year to Date (11/01/2017 to 12/31/2017)\nCumulative Total Return on NAV 1\n1.92%\nCumulative Distribution Rate on NAV 2\n1.28%\n1 Return data is net of all fund expenses and fees and assumes the reinvestment of all distributions reinvested at prices obtained under the Fund's dividend reinvestment plan, with the exception of the most recent distribution which is using an estimated reinvestment price.\n2 Based on the Fund's NAV as of December 31, 2017.\nWhile NAV performance may be indicative of the Fund's investment performance, it does not measure the value of a shareholder's investment in the Fund. The value of a shareholder's investment in the Fund is determined by the Fund's market price, which is based on the supply and demand for the Fund's shares in the open market.\nPursuant to an exemptive order granted by the Securities and Exchange Commission on March 30, 2010, the Fund may distribute any long-term capital gains more frequently than the limits provided in Section 19(b) under the 1940 Act and Rule 19b-1 thereunder. Therefore, distributions paid by the Fund during the year may include net income, short-term capital gains, long-term capital gains and/or a return of capital. Net income dividends and short-term capital gain dividends, while generally taxable at ordinary income rates, may be eligible, to the extent of qualified dividend income earned by the Fund, to be taxed at a lower rate not to exceed the maximum rate applicable to your long-term capital gains. Distributions made in any calendar year in excess of investment company taxable income and net capital gain are treated as taxable ordinary dividends to the extent of undistributed earnings and profits, and then as a return of capital that reduces the adjusted basis in the shares held. To the extent return of capital distributions exceed the adjusted basis in the shares held, capital gain is recognized with a holding period based on the period the shares have been held at the date such amount is received. Shareholders should not draw any conclusions about the Fund's investment performance from the terms of the distribution policy. The final determination of the source of all distributions will be made after year-end. The actual amounts and sources of the amounts for tax reporting purposes will depend upon the Fund's investment experience during the fiscal year and may be subject to change based on tax regulations. The Fund will send you a Form 1099-DIV for the calendar year that will tell you how to report distributions for federal income tax purposes.\nThe payment of distributions in accordance with the Distribution Policy may result in a decrease in the Fund's net assets. A decrease in the Fund's net assets may cause an increase in the Fund's annual operating expense ratio and a decrease in the Fund's market price per share to the extent the market price correlates closely to the Fund's net ass", "external_links": ["http://www.aberdeenfax.com/", "http://www.prnewswire.com/news-releases/aberdeen-asia-pacific-income-fund-inc-announces-record-date-and-payment-date-for-monthly-distribution-300580381.html"], "published": "2018-01-10T17:15:00.000+02:00", "crawled": "2018-01-10T18:52:28.009+02:00", "highlightTitle": ""}