{"organizations": [], "uuid": "d98eb5a71b37f865c710f92e218a7749300e8669", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221509122&w=1200&r=LYNXMPEE0B1CO", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-global-markets-themes/take-five-world-markets-themes-for-the-week-ahead-idUKKBN1F1289", "country": "US", "domain_rank": 408, "title": "Take Five: World markets themes for the week ahead", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:43:00.000+02:00", "replies_count": 0, "uuid": "d98eb5a71b37f865c710f92e218a7749300e8669"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-markets-themes/take-five-world-markets-themes-for-the-week-ahead-idUKKBN1F1289", "ord_in_thread": 0, "title": "Take Five: World markets themes for the week ahead", "locations": [], "entities": {"persons": [{"name": "reuters/lucas jackson", "sentiment": "none"}, {"name": "marc jones", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 5:44 PM / Updated an hour ago Take Five: World markets themes for the week ahead Marc Jones 7 Min Read \nLONDON (Reuters) - Following are five big themes likely to dominate thinking of investors and traders in the coming week and the Reuters stories related to them. Traders work on the floor of the New York Stock Exchange shortly after the opening bell in New York, U.S., January 12, 2018. REUTERS/Lucas Jackson YUAN TO WATCH \nNext week’s data on Chinese GDP, industrial output and retail sales figures are expected to confirm a very modest slowdown is taking place in the world’s second largest economy. \nIt has been largely propelled in recent years by exports and government spending which have helped cancel out the drag caused by Beijing’s drive to reduce leverage and excess capacity. \nThat has made a cheaper yuan critical for the economy. However, the currency gained nearly 7 percent against the dollar in 2017. It is now close to “fair value” according to some analysts and the removal of the secretive “counter-cyclical” factor in the central bank’s daily reference rate this week pointed to Beijing perhaps looking to arrest that rise. \nIt wants to stick around the 6.5-per-dollar level but with some volatility and two-way movement too. But whichever way the economy goes its knows the yuan can easily follow. \nPREVIEW-China Dec data to show economic growth slowly cooling but still solid – \nChina’s Dec imports growth weakest in a year, exports beat f‘cast – \n(Graphic for China yuan, exports and total financing, click reut.rs/2DoMDmj ) CENTRAL HESITATIONS \nA number of the top emerging market central banks meet on Thursday and though little action is expected as policymakers weigh strengthening global growth against the probability of more U.S. rates hikes, there will be plenty of scrutiny on them. \nTurkey, seen as one of the most vulnerable to any revived dollar strength and higher oil prices - not to mention its own politicians haranguing its central bank - is seen holding fire at 12.75 percent with inflation there now firmly back in the double-digits. \nSouth Africa’s Reserve Bank, which has seen the rand roar back to health having been sickly for most of 2017, is expected to leave its rates unchanged too at 6.75 percent despite the rand strengthening nearly over 16 since November. The government’s February annual budget is a big unknown too. \nSouth Korea, where the won and stocks have both been winning big, should also sit on its hands after raised rates for the first time in six years to 1.5 percent in November. Indonesia, in contrast has delivered two surprise rate cuts recently, should leave its rates at 4.25 percent. \nPOLL-South Africa’s Reserve Bank expected to keep repo rate unchanged next week \nStrong yen could kill Japan’s growing emerging market appetite \n(Graphic for Domestic Sovereign Benchmark Yields, click reut.rs/2CVqStr ) BOND VILLAINS \nThe hits just kept on coming for bond markets this week. First, it was a tweak in the Bank of Japan’s purchases of Japanese government bonds which pushed yields higher and then it was a report of a possible scaling back of U.S. Treasury purchases by China, rounded off by speculation over possible policy tweaks from the European Central Bank and finally better-than-expected U.S. inflation data. \nAll of this saw bond yields -- which move inversely to price -- in the world’s major developed economies all scaling new multi-month highs this week in a move that one publication referred to as “Bondmageddon”. \nThe fact is, this moment was always going to come. Central bank purchases had distorted bond markets to such an extent that last year they were not accurately pricing in the return of global inflation and the inevitable tightening of monetary policy across the world. \nThe return of supply and a few headlines here and there have pushed yields closer to their realistic valuations; and this trend will only continue as the BOJ, the Fed and the ECB all begin to slowly unwind the extraordinary post-crisis measures as the world economy continues to recover. \nU.S. core consumer prices post biggest gain in 11 months \nECB may start tweaking policy message in early 2018 \nEuro zone bond yields may be in for New Year shock as ECB cuts buying \n(Graphic for German U.S. yields spike, click reut.rs/2DoGLcS ) EARNINGS EURO-PHORIA \nEuropean equities’ strong start to 2018 is set to be tested by the upcoming Q4 earnings season, if the large falls in stocks who published results this week such as Tesco, Pandora and Micro Focus are anything to go by. \nEarnings in the fourth quarter are expected to increase nearly 16 percent from the same quarter in 2016, according to Thomson Reuters I/B/E/S data. European stocks may have some room to play catch up given that they are trading at cheaper multiples than their U.S. peers, as noted by a number of brokers this week. \nBut investors will first want to see solid evidence that the economic expansion is feeding directly into corporate profits. \nAnd all this comes amid rising bond yields and a resurgent euro, which is forcing fund managers to reassess not only the risk-reward profile of stocks in their portfolios, but also their bond-equity allocations in multi-asset mandates. \nEuro zone confidence at multi-year high, but inflation expectations fall \nDealmaking drives sharp moves as European shares steady \nMorgan Stanley cuts exposure to U.S. equities in favour of Europe \n(Graphic for Europe vs US Earnings and Valuations, click reut.rs/2CXawAi ) NOT SO HOT HOUSE \nU.S. home sales hit an 11-year year high last month but figures on the MBA Weekly Mortgage Application Survey – Purchase Index in the upcoming week could raise questions about the longevity of the boom. \nOn a 12-month percentage change basis dating back to 2013, the data reveals how the Federal Reserve’s interest-rate hikes and unwinding of its massive financial crisis-era balance sheet seems to be taking their toll. \nThen there is President Donald Trump’s tax cut package that will cap the deduction for property and state and local income taxes at $10,000. That could particularly affect a state like New Jersey, which has the country’s highest property taxes, a high state income tax and expensive homes. \nU.S. pending home sales edge higher in November \nWRAPUP 2-U.S. home sales hit 11-year high, supply still tight \n(Graphic for U.S. mortgage applications, click reut.rs/2Dq7hT1 ) Additional reporting by Vidya Ranganathan, Karen Strohecker, Kit Rees, Abhinav Ramnarayan and Jennifer Ablan Editing by Jeremy Gaunt", "external_links": [], "published": "2018-01-12T19:43:00.000+02:00", "crawled": "2018-01-12T20:44:18.007+02:00", "highlightTitle": ""}