{"organizations": [], "uuid": "ea52c20c9ce1acb3d6fffdae5438c76be2be6ed0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000238/device/rss", "section_title": "Mark Zuckerberg", "url": "https://www.cnbc.com/2018/01/11/reuters-america-update-1-facebook-to-emphasize-friends-not-news-in-series-of-changes.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Facebook to emphasize friends, not news, in series of changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T04:53:00.000+02:00", "replies_count": 0, "uuid": "ea52c20c9ce1acb3d6fffdae5438c76be2be6ed0"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/11/reuters-america-update-1-facebook-to-emphasize-friends-not-news-in-series-of-changes.html", "ord_in_thread": 0, "title": "UPDATE 1-Facebook to emphasize friends, not news, in series of changes", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "none"}, {"name": "zuckerberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "facebook inc", "sentiment": "negative"}, {"name": "instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details from Facebook post)\nSAN FRANCISCO/LONDON, Jan 11 (Reuters) - Facebook Inc on Thursday began to change the way it filters posts and videos on its centerpiece News Feed, the start of what Chief Executive Mark Zuckerberg said would be a series of changes in the design of the world's largest social network.\nZuckerberg, in a sweeping post on Facebook, said the company would change the filter for the News Feed to prioritize what friends and family share, while reducing the amount of non-advertising content from publishers and brands.\nFacebook, which owns four of the world's most popular smartphone apps including Instagram, has for years prioritized material that its complex computer algorithms think people will engage with through comments, \"likes\" or other ways of showing interest.\nZuckerberg, the company's 33-year-old co-founder, said that would no longer be the goal.\n\"I'm changing the goal I give our product teams from focusing on helping you find relevant content to helping you have more meaningful social interactions,\" Zuckerberg wrote.\nThe shift was likely to mean that the time people spend on Facebook and some measures of engagement would go down in the short term, he wrote, but he added it would be better for users and for the business over the long term.\nAdvertising on the social network would be unaffected by the changes, John Hegeman, a Facebook vice president, said in an interview.\nFacebook and its social media competitors have been inundated by criticism that their products reinforce users' views on social and political issues and lead to addictive viewing habits, raising questions about possible regulation and the businesses' long-term viability.\nThe company has been criticized for algorithms that may have prioritized misleading news and misinformation in people's feeds, influencing the 2016 American presidential election, as well as political discourse in many countries.\nLast year, Facebook disclosed that Russian agents had used the network to spread inflammatory posts to polarize the American electorate.\nCongress is expected to hold more hearings this month, questioning the role social media platforms like Facebook, Twitter Inc and Alphabet Inc's YouTube play in spreading propaganda.\nZuckerberg said an overhaul of the company's products, beginning with changes to the algorithms that control the News Feed, would help to address those concerns. Similar changes will be made to other products in the coming months, he said.\n\"We feel a responsibility to make sure our services aren't just fun to use, but also good for people's well-being,\" Zuckerberg wrote. ( http://bit.ly/2CSkTW6 )\nWith more than 2 billion monthly users, Facebook is the world's largest social media network. It is also among the world's largest corporations, reporting $36 billion in revenue, mostly from advertising, during the 12 months that ended on Sept. 30.\nA shift away from non-ad content produced by businesses is a potentially severe blow to news organizations, many of which use Facebook to drive readership, but Zuckerberg said many such posts have been unhealthy.\n\"Some news helps start conversations on important issues. But too often today, watching video, reading news or getting a page update is just a passive experience,\" he wrote.\n(Reporting by David Ingram in San Francisco and Paul Sandle in London; Editing by Sandra Maler and Lisa Shumaker)", "external_links": [], "published": "2018-01-12T04:53:00.000+02:00", "crawled": "2018-01-13T09:01:12.005+02:00", "highlightTitle": ""}