{"organizations": [], "uuid": "23ce24ac248492f9bebd71630ce69ddd6a25c3db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-robins-kaplan-llp-announces-2018-partner-and-principal-promotions.html", "country": "US", "domain_rank": 767, "title": "Robins Kaplan LLP Announces 2018 Partner and Principal Promotions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-04T17:00:00.000+02:00", "replies_count": 0, "uuid": "23ce24ac248492f9bebd71630ce69ddd6a25c3db"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-robins-kaplan-llp-announces-2018-partner-and-principal-promotions.html", "ord_in_thread": 0, "title": "Robins Kaplan LLP Announces 2018 Partner and Principal Promotions", "locations": [], "entities": {"persons": [{"name": "sha", "sentiment": "negative"}, {"name": "patrick arenz", "sentiment": "negative"}, {"name": "ron roberg-perez", "sentiment": "none"}, {"name": "thomas berndt", "sentiment": "none"}, {"name": "christine yun sauer", "sentiment": "none"}, {"name": "patrick m. arenz", "sentiment": "none"}, {"name": "bryan mechell", "sentiment": "none"}, {"name": "jamie kurtz", "sentiment": "none"}, {"name": "teresa mcclain", "sentiment": "none"}, {"name": "martin lueck", "sentiment": "none"}, {"name": "elizabeth burnett", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "meegan hollywood", "sentiment": "none"}], "organizations": [{"name": "robins kaplan llp", "sentiment": "negative"}, {"name": "executive board", "sentiment": "none"}, {"name": "robins kaplan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS--(BUSINESS WIRE)-- Robins Kaplan LLP ® is pleased to announce that Patrick Arenz and Sharon Roberg-Perez have been named partners at the firm. Additionally, Thomas Berndt, Elizabeth Burnett, Meegan Hollywood, Jamie Kurtz, Teresa McClain, Bryan Mechell, and Christine Yun Sauer have been elected principals. All promotions were effective January 1, 2018.\n“Our newest partners and principals have consistently demonstrated their trial skills, leadership, talent, and commitment to extraordinary client service,” said Martin Lueck , chairman of the firm’s Executive Board. “It gives us great pleasure to recognize the hard work and dedication of this diverse group of accomplished litigators, who will continue to contribute to the success of our clients, firm, and the communities we serve.”\nOf the nine lawyers promoted this year, six have been significantly involved in Robins Kaplan’s future leaders program, a component of the firm’s innovative Leaders Engaged in the Advancement of Diversity (LEAD) initiative.\nPartners:\nPatrick M. Arenz (Minneapolis) focuses his practice on litigating high-stakes intellectual property cases. As trial counsel, he recently secured a final judgment of over $6 million in favor of his client Megdal Associates, LLC in an IP license dispute. He is also chair of Robins Kaplan’s Pro Bono Committee and recently achieved a precedent-setting pro bono victory when he secured a decisive $950,000 jury verdict in a federal lawsuit on behalf of a sex tourism victim who was sexually assaulted by a U.S. citizen in Laos when she was 14 years old. This was believed to be the first civil jury verdict ever in a sex tourism case.\nSharon Roberg-Perez (Minneapolis, Boston) is an M.I.T.-trained Ph.D. whose practice focuses on intellectual property disputes involving biotechnology, medical devices, and/or digital health. She represents clients of all sizes, ranging from start-up companies to one of the world’s largest medical device manufacturers. By virtue of her earlier career as a research scientist, including at biotechnology and genomics start-up companies, she is well versed at explaining complicated, innovative concepts to varied audiences. She has been trial counsel in hard-fought, multimillion-dollar patent cases between competitors. She has represented pro bono clients in connection with the Children’s Law Center of Minnesota, the Minnesota Advocates for Human Rights, the Minnesota Public Defender’s Appellate Office, and Lambda Legal. Sharon is registered to practice before the United States Patent and Trademark Office and serves on the firm’s Diversity Committee.\nPrincipals:\nThomas Berndt (Minneapolis) focuses his practice on complex civil litigation and represents corporations and individuals in multimillion-dollar disputes involving alleged fraud, breach of contract, antitrust violations, and unfair trade practices. He has particular expertise in mortgage-backed securities, other equity or debt securities, and benchmark manipulation.\nElizabeth Burnett (Minneapolis) frequently defends product manufacturers and industrial plant owners in complex product liability, personal injury, property damage, and disaster litigation. Many of her matters stem from fires and explosions caused by combustible dust and natural gas. She also represents insurance carriers in coverage and subrogation matters, and she successfully second-chaired a federal jury trial for an insurer in a case involving losses caused by Superstorm Sandy. She has handled pro bono cases for the Minnesota Public Defender’s Appellate Office, Mid-Minnesota Legal Aid, and the Minnesota Guardian ad Litem Board, and is a member of the firm’s Hiring Committee.\nMeegan Hollywood (New York) prosecutes antitrust class actions involving price-fixing, unlawful monopolization, and other anticompetitive practices. She was a key member of the Robins Kaplan team that secured more than $1.2 billion in settlements for direct purchasers in In re Air Cargo Shipping Services Antitrust Litigation, a massive alleged global conspiracy in the market for airfreight services. She is currently litigating a proposed class action against the two dominant suppliers of IV saline solution, a vital medical supply used in hospitals nationwide, for allegedly orchestrating an artificial rise in prices under the pretext of a supply shortage.\nJamie Kurtz (Minneapolis) is a trial attorney who primarily focuses her practice on healthcare and intellectual property litigation. She often represents healthcare plans in multimillion-dollar litigation with providers involving claims of improper billing, breach of contract, and fraud. In her IP practice, she has represented clients in matters involving pharmaceuticals and medical devices MRI technology. While in law school, Jamie also attended graduate school where she received her M.S. in pharmacology.\nTeresa McClain (Minneapolis) devotes her legal practice to obtaining justice for those who have been harmed by medical errors or medical negligence. She has dedicated her career to advocating for individuals, first as a registered nurse in the areas of labor and delivery and high-risk obstetrics, then in adult critical care, and now as an attorney. As first-chair trial counsel, she has obtained multimillion-dollar settlements and verdicts on behalf of clients injured or who have wrongfully died as a result of medical errors, pharmaceutical errors, medical negligence, and personal injury. Teresa is a member of the invitation-only American Board of Trial Advocates, the president of Minnesota Women Lawyers Foundation, past president of Minnesota Women Lawyers, and serves on the Board of Directors of Minnesota Women Lawyers Foundation.\nBryan Mechell (Minneapolis) is a trial lawyer and registered patent attorney with experience in complex patent litigation. He focuses on new and cutting-edge technologies to help large companies, small businesses, and inventors assess and protect the value of their intellectual property. He has experience in quantum physics, advanced mathematics, and computer science, and has represented clients in litigation relating to 3D graphics processing systems, semiconductor design and fabrication, internet communication protocols, and consumer products.\nChristine Yun Sauer (Silicon Valley) is a legal technology strategist who practices as an intellectual property trial lawyer and legal technology consultant. She represents technology companies in multimillion-dollar litigation, with particular experience working with semiconductor fabrication/packaging and life science entities, including medical device, biotechnology, and pharmaceutical companies. She also has experience serving clients in a consultative role, in which she works to analyze and valuate the economic impact of patented technologies both in high-volume patent portfolios and in start-up companies that are beginning their technology development. She serves on the firm’s Diversity Committee and has handled pro bono cases for Open Door Legal in San Francisco, California. Christine has a background in chemistry and is admitted to practice in California, Minnesota, and in front of the U.S. Patent and Trademark Office.\nAbout Robins Kaplan LLP ®\nRobins Kaplan is among the nation’s premier trial law firms, with more than 220 lawyers located in Bismarck, N.D.; Boston; Los Angeles; Minneapolis; Naples,", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com%2Ffirm%2Fdiversity-and-inclusion%2Fdiversity-leadership&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Leaders+Engaged+in+the+Advancement+of+Diversity&index=2&md5=f2da994605dda70b2276421a3332c2d0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Robins+Kaplan&index=12&md5=9eac20c0d989e46045a9d66ddc2e78c0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com%2Flawyers%2Fchristine-yun-sauer&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Christine+Yun+Sauer&index=11&md5=e5d25a4e7a64023c4c9d0e2738e18383", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com%2Flawyers%2Fjamie-kurtz&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Jamie+Kurtz&index=8&md5=b3c65415d543b9a634c07bc317afb91b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com%2Flawyers%2Fmeegan-hollywood&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Meegan+Hollywood&index=7&md5=ef5901d042f351a4d07ff17989f64d44", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com%2Flawyers%2Fthomas-berndt&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Thomas+Berndt&index=5&md5=9c4098da52339cd39046f38945f1b375", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com%2Flawyers%2Fteresa-mcclain&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Teresa+McClain&index=9&md5=8b3630736cb4267d5e22f1fa2c44154d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com%2Flawyers%2Fa-elizabeth-burnett&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Elizabeth+Burnett&index=6&md5=08dbd88f87dd530e2ac09ac12e66f904", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com%2Flawyers%2Fmartin-lueck&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Martin+Lueck&index=1&md5=e2b5651ae9611b5549d7d4c8bee211c3", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com%2Flawyers%2Fsharon-roberg-perez&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Sharon+Roberg-Perez&index=4&md5=849e4b8d4b1240c8cb121b3a5e4b2a93", "http://www.businesswire.com/news/home/20180104005319/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com%2Flawyers%2Fpatrick-arenz&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Patrick+M.+Arenz&index=3&md5=abcc78e0203ff111d96dc1eb20849278", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robinskaplan.com%2Flawyers%2Fbryan-mechell&esheet=51737676&newsitemid=20180104005319&lan=en-US&anchor=Bryan+Mechell&index=10&md5=240f5012a5012206b0b772307e20e9ee"], "published": "2018-01-04T17:00:00.000+02:00", "crawled": "2018-01-04T16:37:31.014+02:00", "highlightTitle": ""}