{"organizations": [], "uuid": "7b5bc78c74c206154939518fd0ca330c011b9326", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-umh-properties-inc-prices-public-offering-of-2000000-shares-of-6-point-375-percent-series-d-cumulative-redeemable-preferred.html", "country": "US", "domain_rank": 767, "title": "UMH Properties, Inc. Prices Public Offering of 2,000,000 Shares of 6.375% Series D Cumulative Redeemable Preferred Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-18T16:52:00.000+02:00", "replies_count": 0, "uuid": "7b5bc78c74c206154939518fd0ca330c011b9326"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-umh-properties-inc-prices-public-offering-of-2000000-shares-of-6-point-375-percent-series-d-cumulative-redeemable-preferred.html", "ord_in_thread": 0, "title": "UMH Properties, Inc. Prices Public Offering of 2,000,000 Shares of 6.375% Series D Cumulative Redeemable Preferred Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "freehold", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "umh properties, inc", "sentiment": "neutral"}, {"name": "umh properties, inc.", "sentiment": "neutral"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FREEHOLD, N.J., UMH Properties, Inc. (NYSE: UMH) today announced the pricing of an underwritten public offering of 2,000,000 shares of its 6.375% Series D Cumulative Redeemable Preferred Stock (the \"Series D Preferred Stock\") at an offering price of $25.00 per share. In addition, the Company has granted the underwriters a 30-day over-allotment option to purchase up to an additional 300,000 shares of Series D Preferred Stock. The Series D Preferred Stock is a new series of Preferred Stock which will rank on a parity with the Company's outstanding 8.0% Series B Preferred Stock (the \"Series B Preferred Stock\") and 6.75% Series C Preferred Stock (the \"Series C Preferred Stock\"). The Company has applied to list the shares of Series D Preferred Stock on the New York Stock Exchange. The Series D Preferred Stock will have a $25.00 liquidation value per share.\nThe Company expects to receive net proceeds from the offering before expenses of approximately $48,425,000.00 and expect to close the transaction on or about January 22, 2018. The Company plans to use the net proceeds of the offering for general corporate purposes, which may include the purchase of manufactured homes for sale or lease to customers, expansion of its existing communities, potential acquisitions of additional properties and possible repayment of indebtedness on a short-term basis.\nThe joint bookrunning managers for the offering were BMO Capital Markets Corp. and Stifel, Nicolaus & Company, Incorporated. Co-managers for the offering were B. Riley FBR, Inc., D.A. Davidson & Co., and Janney Montgomery Scott, LLC.\nUMH, a publicly-owned REIT, owns and operates 112 manufactured home communities with approximately 20,000 developed homesites. These communities are located in New Jersey, New York, Ohio, Pennsylvania, Tennessee, Indiana, Maryland and Michigan. In addition, the Company owns a portfolio of REIT securities.\nThe Series D Preferred Stock was issued pursuant to a prospectus supplement and accompanying prospectus under an effective shelf registration statement on file with the Securities and Exchange Commission.\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction. Any offer of the securities will be made only by means of a prospectus, forming part of the effective registration statement, the applicable preliminary prospectus supplement and other related documents. Copies of the prospectus and the prospectus supplement, subject to completion, relating to these securities may be obtained from BMO Capital Markets Corp. You should direct any requests to BMO Capital Markets Corp., Attention: Syndicate Department, 3 Times Square, 25th Floor, New York, New York 10036 or by telephone at (800) 414-3627 or by email at bmoprospectus@bmo.com. You may also obtain a copy of the prospectus and the prospectus supplement, subject to completion, and other documents the Company has filed with the Securities and Exchange Commission for free by visiting the Commission's Web site at http://www.sec.gov .\nCertain statements included in this press release which are not historical facts may be deemed forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Although the Company believes the expectations reflected in any forward-looking statements are based on reasonable assumptions, the Company can provide no assurance those expectations will be achieved. These risks include, among others, changes in the general economic climate, increased competition in the geographic areas in which the Company operates, changes in government laws and regulations and the ability of the Company to continue to identify, negotiate and acquire properties on terms favorable to the Company. Additional information concerning these and other factors that could cause actual results to differ materially from those forward-looking statements is contained from time to time in the Company's SEC filings, including, but not limited to, Item 1A. Risk Factors in the Company's Annual Report on Form 10-K for the year ended December 31, 2016. Copies of each filing may be obtained from the Company or the SEC. Consequently, such forward-looking statements should be regarded solely as reflections of the Company's current operating plans and estimates. Actual operating results may differ materially from what is expressed or forecast in this press release. Except as otherwise required by applicable securities law, the Company undertakes no obligation to publicly release the results of any revisions to these forward-looking statements that may be made to reflect events or circumstances after the date these statements were made.\n releases/umh-properties-inc-prices-public-offering-of-2 -shares-of-6375-series-d-cumulative-redeemable-preferred-stock-300584580.html\nSOURCE UMH Properties, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/umh-properties-inc-prices-public-offering-of-2000000-shares-of-6375-series-d-cumulative-redeemable-preferred-stock-300584580.html"], "published": "2018-01-18T16:52:00.000+02:00", "crawled": "2018-01-18T20:47:20.017+02:00", "highlightTitle": ""}