{"organizations": [], "uuid": "7ca624c5d204845517af9eaccd2c3f053751802c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-research-solutions-appoints-roy-w-olivier-to-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Research Solutions Appoints Roy W. Olivier to its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-12T16:30:00.000+02:00", "replies_count": 0, "uuid": "7ca624c5d204845517af9eaccd2c3f053751802c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-research-solutions-appoints-roy-w-olivier-to-its-board-of-directors.html", "ord_in_thread": 0, "title": "Research Solutions Appoints Roy W. Olivier to its Board of Directors", "locations": [], "entities": {"persons": [{"name": "roy w. olivier", "sentiment": "negative"}, {"name": "jan peterson", "sentiment": "none"}, {"name": "olivier", "sentiment": "none"}, {"name": "roy", "sentiment": "none"}, {"name": "john regazzi", "sentiment": "none"}], "locations": [{"name": "encino", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "research solutions", "sentiment": "negative"}, {"name": "research solutions, inc.", "sentiment": "neutral"}, {"name": "roy w. olivier", "sentiment": "none"}, {"name": "ari network services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ENCINO, Calif., Jan. 12, 2018 /PRNewswire/ -- Research Solutions, Inc. (OTCQB: RSSS), a pioneer in providing cloud-based solutions for scientific research, has appointed Roy W. Olivier to its board of directors. He replaces Jan Peterson, who is retiring.\nMr. Olivier currently serves as president and CEO of ARI Network Services (formerly NASDAQ: ARIS), a provider of an award-winning suite of SaaS tools and marketing services.\n\"Roy has shown the ability to transform and create significant value at various software and technology organizations over his career,\" said John Regazzi, chairman of Research Solutions. \"Under his leadership at ARI, he navigated their transformation from a legacy catalog business into a lead generation and e-Commerce leader. During this time, the company grew sales from $15 million to $52 million, and since 2011 delivered a near 700% return to shareholders, culminating in a sale for approximately $140 million. His valuable skillset will be a welcomed complement to our board as we further transform into a powerful research intelligence SaaS solution for science and technology.\"\nBefore joining ARI in 2006, Mr. Olivier was a consultant to start-up and small- and medium-sized businesses. Prior to that, he served as VP of sales and marketing for ProQuest Media Solutions, a business he founded in 1993 and sold to ProQuest in 2000. He previously held various executive and managerial positions with other companies in the telecommunications and computer industries, including Multicom Publishing, Tandy Corporation, BusinessLand and PacTel.\nOlivier commented: \"Thanks to a tremendous leadership team and group of visionaries, I am joining Research Solutions at a critical point in its strategic evolution. I look forward to utilizing my experience guiding other dynamic technology organizations through change as the company further executes its vision to build a more profitable, fast-growing Platforms business.\"\nAbout Research Solutions\nResearch Solutions, Inc. (OTCQB: RSSS) is a pioneer in cloud-based research intelligence and retrieval solutions for R&D-driven organizations. More than 70 percent of the top 25 pharmaceutical companies in the world rely on services delivered by Research Solutions' wholly owned subsidiary Reprints Desk. The company's Software-as-a-Service (SaaS) Platform provides customers with on-demand access to, and augmented data from, tens of millions of scientific, medical, and technical (STM) documents, helping them to accelerate acquisition at the point of discovery, save time and money, and remain copyright-compliant. For more information, visit www.researchsolutions.com .\nImportant Cautions Regarding Forward-Looking Statements\nCertain matters discussed in this press release may be forward-looking statements. Such matters involve risks and uncertainties that may cause actual results to differ materially, including the following: changes in economic conditions; general competitive factors; acceptance of the company's products in the market; the company's success in obtaining new customers and new Platform deployments; the company's success in technology and product development; the company's ability to execute its business model and strategic plans; the company's success in integrating acquired entities and assets, and all the risks and related information described from time to time in the company's filings with the Securities and Exchange Commission (\"SEC\"), including the financial statements and related information contained in the company's Securities and Exchange Commission Annual Report on Form 10-K and interim Quarterly Reports on Form 10-Q. The company assumes no obligation to update the cautionary information in this release.\nView original content with multimedia: http://www.prnewswire.com/news-releases/research-solutions-appoints-roy-w-olivier-to-its-board-of-directors-300581808.html\nSOURCE Research Solutions, Inc.", "external_links": ["http://www.researchsolutions.com/", "http://www.prnewswire.com/news-releases/research-solutions-appoints-roy-w-olivier-to-its-board-of-directors-300581808.html"], "published": "2018-01-12T16:30:00.000+02:00", "crawled": "2018-01-12T17:53:01.022+02:00", "highlightTitle": ""}