{"organizations": [], "uuid": "289f2cb545a04b736306e4ebb652ae3b171f7ffb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-denovo-biopharma-opens-new-rd-center-names-chief-medical-officer-and-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Denovo Biopharma Opens New R&D Center, Names Chief Medical Officer and Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.073, "site_type": "news", "published": "2018-01-03T14:00:00.000+02:00", "replies_count": 0, "uuid": "289f2cb545a04b736306e4ebb652ae3b171f7ffb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-denovo-biopharma-opens-new-rd-center-names-chief-medical-officer-and-chief-financial-officer.html", "ord_in_thread": 0, "title": "Denovo Biopharma Opens New R&D Center, Names Chief Medical Officer and Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "shazer", "sentiment": "none"}, {"name": "bris", "sentiment": "none"}, {"name": "ronald l. shazer", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "torrey pines science park", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "denovo biopharma opens new r&d center", "sentiment": "negative"}, {"name": "denovo biopharma llc", "sentiment": "negative"}, {"name": "tracon pharmaceuticals", "sentiment": "none"}, {"name": "research & development center", "sentiment": "none"}, {"name": "pfizer", "sentiment": "none"}, {"name": "denovo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 3rd, 2018 /PRNewswire/ -- Denovo Biopharma LLC, a leader in precision medicine, today announced the opening of its new Research & Development Center in San Diego's prestigious Torrey Pines Science Park.\nThe new 7600 square feet custom-built, state-of-the-art facility hosts Denovo's biomarker discovery platform, US clinical team and serves as Denovo's US headquarters. The center will accelerate the development of Denovo's portfolio of 3 late-stage first-in-class drugs in oncology and CNS diseases and provide adequate support for the company's future expansion.\nThe company is delighted to announce two important additions to its senior executive team.\nRonald L. Shazer MD, MBA, has been appointed Chief Medical Officer. Dr. Shazer has over a decade of extensive experience in clinical development, including managing global oncology trials. Dr. Shazer most recently served as Chief Medical Officer for Inspyr Therapeutics and previously as Chief Medical Officer at Tracon Pharmaceuticals. He has held increasingly significant roles leading clinical research teams at Pfizer, Bristol-Myers Squibb, Arena Pharmaceuticals and Exelixis. Dr. Shazer received his MD from New York Medical College and his MBA from UCLA Anderson School of Management. Dr. Shazer will be responsible for leading the DB102 global Phase 3 trial in diffuse large B-cell lymphoma (DLBCL) to eventual registration as well as supporting the other pipeline candidates.\nMichael F. Haller, PhD, has joined the company in the role of Chief Financial Officer. Dr. Haller has broad experience in business development, finance and accounting, drug development, and corporate and product strategy. He was most recently Chief Business Officer at Peloton Therapeutics, where he led the finance and accounting department in addition to business development. Prior to Peloton, Dr. Haller held various positions at Ligand, Anaphore, and Halozyme. At Halozyme Therapeutics, Dr. Haller helped the company grow into a $1B market cap company, directed key alliances with Roche and Baxter Healthcare, and headed the company's drug delivery franchise. Before Halozyme, Dr. Haller was a McKinsey & Company management consultant focusing on complex health care issues for a number of Fortune 500 companies. Dr. Haller earned his PhD in Biomedical Engineering from The Johns Hopkins University School of Medicine.\nDr. Wen Luo, Denovo's CEO commented, \"The opening of the new R&D center in San Diego, one the leading genomic hubs in the world, will substantially enhance our ability to discover innovative biomarkers to personalize all drugs in our pipeline as well as recruit top talent to support our aggressive growth plans. We are also delighted to have Dr. Shazer and Dr. Haller join us, as it will add significant talent and experience to the Denovo executive team to support the company's rapidly expanding pipeline and transform Denovo into a fully integrated late stage biotech company.\"\nAbout Denovo Biopharma\nDenovo Biopharma is a privately-held clinical stage biotechnology company that provides novel and proprietary biomarker approaches to advance drug development, including re-evaluating medicines that have failed in general patient populations by stratifying the responders for the original indication. The company offers the first platform and algorithm for de novo genomic biomarker discovery using archived clinical samples. This technology is especially useful for compounds with suboptimal late-stage trial results. By identifying biomarkers correlated with patients' responses to drug candidates retrospectively, Denovo enables the design and execution of follow-on clinical trials in targeted patient populations while optimizing efficacy, safety and tolerability. Denovo currently has three late stage drugs in its pipeline: DB102 for oncology, DB103 for schizophrenia, and DB104 for depression. For additional information please visit www.denovobiopharma.com .\nContact:\nRobert Little, Chief Business Officer\nDenovo Biopharma LLC\nrlittle@denovobiopharma.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/denovo-biopharma-opens-new-rd-center-names-chief-medical-officer-and-chief-financial-officer-300576853.html\nSOURCE Denovo Biopharma", "external_links": ["http://www.denovobiopharma.com/", "http://www.prnewswire.com/news-releases/denovo-biopharma-opens-new-rd-center-names-chief-medical-officer-and-chief-financial-officer-300576853.html"], "published": "2018-01-03T14:00:00.000+02:00", "crawled": "2018-01-03T13:57:32.001+02:00", "highlightTitle": ""}