{"organizations": [], "uuid": "a8d09ebf36d32f86fe722ce4d5979c7cbef8b917", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/cnbc-transcript-goldman-sachs-chairman-ceo-lloyd-blankfein-speaks-with-squawk-box-from-davos-today.html", "country": "US", "domain_rank": 767, "title": "CNBC TRANSCRIPT: GOLDMAN SACHS CHAIRMAN & CEO LLOYD BLANKFEIN SPEAKS WITH SQUAWK BOX FROM DAVOS TODAY", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T19:57:00.000+02:00", "replies_count": 0, "uuid": "a8d09ebf36d32f86fe722ce4d5979c7cbef8b917"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/cnbc-transcript-goldman-sachs-chairman-ceo-lloyd-blankfein-speaks-with-squawk-box-from-davos-today.html", "ord_in_thread": 0, "title": "CNBC TRANSCRIPT: GOLDMAN SACHS CHAIRMAN & CEO LLOYD BLANKFEIN SPEAKS WITH SQUAWK BOX FROM DAVOS TODAY", "locations": [], "entities": {"persons": [{"name": "lloyd blankfein", "sentiment": "negative"}, {"name": "joe kernen", "sentiment": "none"}, {"name": "kernen", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "goldman sachs", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHEN: Today, Wednesday, January 24, 2018\nWHERE: CNBC's \"Squawk Box\" – Live from the World Economic Forum in Davos, Switzerland\nFollowing is the unofficial transcript of a CNBC interview with Goldman Sachs Chairman & CEO Lloyd Blankfein on CNBC's \"Squawk Box\" (M-F 6AM-9AM) live from the World Economic Forum in Davos, Switzerland today, Wednesday, January 24th. Following are links to video from the interview on CNBC.com: https://www.cnbc.com/video/2018/01/24/goldman-sachs-ceo-i-like-what-trump-has-done-for-the-economy.html?play=1 and https://www.cnbc.com/video/2018/01/24/goldman-ceo-lloyd-blankfein-talks-taxes-politics-and-trading-from-davos.html?play=1 .\nAll references must be sourced to CNBC.\nJOE KERNEN: ANOTHER NEWSMAKER JOINING US ON THE SET HERE IN DAVOS GOLDMAN SACHS CHAIRMAN AND CEO LLOYD BLANKFEIN.\nLLOYD BLANKFEIN: GOOD MORNING, GOOD AFTERNOON.\nKERNEN: A LOT OF STUFF HAS HAPPENED IN THE PAST YEAR. 40% IN THE STOCK MARKET, 3% FOR TWO QUARTERS, MAYBE THREE. BUT THE VOLATILITY IS SO LOW THAT GOLDMANS TRADING ACTUALLY IS AFFECTED BY IT TO SOME EXTENT BECAUSE THERE'S SO LITTLE VOLATILITY. IS IT WORTH IT FOR ALL THE GOOD THINGS THAT ARE HAPPENING THAT YOU CAN'T MAKE QUITE AS MUCH MONEY TRADING? YOU'D PROBABLY TRADE IT FOR THAT, WOULDN'T YOU?\nBLANKFEIN: WE JUST GO WITH IT. I TAKE PEACE AND HAPPINESS AT LEAST FOR A WHILE.\nKERNEN: SO EVEN THOUGH THE DEBT TRADING IS SO QUIET RIGHT NOW.\nBLANKFEIN: IT IS QUIET. I MEAN THINK ABOUT IT RISK LEVELS ARE LOW. RISK PREMIUM IS LOW. IF YOU THINK THE MARKETS ARE NEVER GOING TO MOVE, YOURE NOT GOING TO HEDGE ANYTHING BECAUSE WHY SPEND THAT MONEY AND THE IRONY ALWAYS IS THAT WHEN THINGS HAVENT MOVED FOR A WHILE, THE RISK PREMIUM GETS LOW. THE COST OF HEDGING GETS LOW WHICH SETS YOU UP FOR THE NEXT BIG MOVE AND THEN EVERYBODY WISHES THEY HAD BOUGHT INSURANCE. THE FUNNY THING IS -- ITS LIKE HAVING A BUNCH OF HURRICANES ON THE EAST COAST OF THE UNITED STATES THE RISK OF A HURRICANE IS THE SAME THE SUMMER BEFORE AND THE SUMMER AFTER THE STRING OF HURRICANES WHEN DO PEOPLE PAY THE BIGGER RISK PREMIUM.\nANDREW ROSS SORKIN: WHAT DOES THAT SAY ABOUT WHERE THE MARKET IS?\nKERNEN: THE CANARY IS IN THE COAL MINE THERE ARE SOME WELL KNOWNS LIKE DAVID TEPPER FOR EXAMPLE BUT ONCE TAX REFORM PASSED, HE SAID YOU REVALUE WHAT VALUATIONS ARE BASED ON THE E IN P TO E.\nBLANKFEIN: WE ARE IN A SWEET SPOT. I LIKE IT THIS WAY LET ME TELL YOU, TRADING IS SOFT ALL OUR OTHER BUSINESSES WHICH CORRELATE TO GLOBAL GROWTH ARE KIND OF DOING VERY, VERY WELL. FINANCE -- YOU KNOW, DOING M&A, FINANCING M&A, MANAGING ASSETS FOR PEOPLE, THATS GOING VERY WELL TRADING IS A LITTLE SOFT, NO BIG SURPRISE IN THE MARKET THAT'S NOT THAT VOLATILE, BUT THEY TEND NOT TO STAY THIS WAY.\nQUICK: TRADING WAS A LITTLE SOFTER THAN A LOT OF YOUR PEERS\nBLANKFEIN: WE'RE INDEXED -- W'ERE INDEXED TO A CERTAIN KIND OF MARKET AND WERE MOVING – YOU KNOW, WERE MOVING OURSELVES AROUND YOU KNOW, LOOK, TWO THINGS TWO THINGS, ONE IS THE STRATEGIC QUESTION OF WHETHER COMMODITIES OVER THE LONG TERM IS A GOOD BUSINESS TO BE IN. FIXED INCOME IS A GOOD BUSINESS TO BE IN THE ANSWER IS, YES THERES ANOTHER QUESTION WHICH IS EXECUTE SOMETIMES YOU ZIG, THE MARKET ZAGS. THAT GOES WITH THE TERRITORY OVER A CYCLE WE HAVE TENDED TO OUT PERFORM IN TRADING BUT WE DON'T DO THAT EVERY YEAR. BUT THATS TACTICAL.\nKERNEN: AS A GREAT RISK GUY, ANYTHING THAT YOU SEE IN THE EQUITIES MARKET GLOBALLY THAT RISES TO THE LEVEL OF IRRATIONAL IN TERMS OF THE ECONOMY?\nBLANKFEIN: I WON'T SAY THINGS HAVE BEEN GOING WELL FOR A LONG TIME, BUT I'D FEEL BETTER ABOUT WHERE ASSET PRICES ARE INCLUDING EQUITIES IF INTEREST RATES WERE NORMALIZED HOW MUCH -- YOU KNOW, BASICALLY YOU DISCOUNT EARNINGS BY AN INTEREST RATE. INTEREST RATES ARE VERY, VERY LOW. IF GLOBAL GROWTH IS OVER 4% AND INTEREST RATES AROUND THE WORLD ARE CLOSE TO ZERO OR VERY LOW, CANT BE SURPRISED THAT THERES A LOT OF INVESTMENT AND A LOT OF FROTH IN THE MARKET. MAYBE THERE SHOULD EVEN BE MORE. WHATS GOING TO HAPPEN WHEN INTEREST RATES NORMALIZE AND GET CLOSER TO WHERE THE GROWTH RATE IS AND CATCH UP?\nQUICK: WHAT IS NORMALIZED? IS THAT 5 OR 6%?\nKERNEN: IT'S THE DALIO THING –\nSORKIN: IT IS SORT OF THE RAY DALIO THING BUT YOU HAVE TO TIME IT RIGHT THATS THE PROBLEM THATS NOT THE PROBLEM, THE CHALLENGE.\nBLANKFEIN: I'VE BEEN DOING IT FOR 35 YEARS, GOLDMAN SACHS HAS BEEN DOING IT FOR 149 YEARS OVER THE CYCLE YOU SEE THINGS BUT YOU HAVE TO STAY IN MIND YOU KNOW THEY DONT CALL YOU UP THE DAY BEFORE I'LL GIVE YOU FOOD FOR THOUGHT I THINK WE'RE IN A SWEET SPOT. I THINK THERE'S A GOOD RUNWAY. I DON'T SEE WHERE THE PROBLEM IMMEDIATELY IS GOING TO COME FROM, BUT JUST THINK AS A THOUGHT, HOW MUCH OF ASSET PRICES, HOW MANY BUSINESSES -- INTEREST RATES HAVE BEEN LOW FOR A LONG TIME. HOW MUCH OF COMMERCE AND TRADE AND BUSINESS AND INVESTMENT IS PREMISED ON VERY, VERY LOW INTEREST RATES IF YOU THINK BACK TEN YEARS, WERENT WE SHOCKED TO FIND OUT HOW MUCH ASSETS AROUND THE WORLD WERE HINGED ON U.S. REAL ESTATE PRICES WELL, IF THAT COULD BE THE WAY OF REAL ESTATE PRICING, PEOPLE COULD GET LOW BY LOW – PEOPLE WERE INVESTING IN REAL ESTATE, THEY WERE USING REAL ESTATE AS COLLATERAL TO BORROW MONEY TO INVEST IN OTHER THINGS AND BUT BASICALLY THERE WAS A BIG – THE CRISIS WAS REAL ESTATE.\nSORKIN: WHERE DO YOU SEE THAT HAPPENING? DO YOU SEE THAT HAPPENING NOW?\nBLANKFEIN: I THINK WE HAVE TO CHEW OUR WAY THROUGH, AND I'LL USE THIS TERM, A NORMALIZATION. PEOPLE SAY,WHAT'S THE NEW NORMAL? MAYBE INTEREST. I DON'T THINK IT'S NORMAL TO ALLOCATE ONE OF THE MOST IMPORTANT COMMODITIES IN THE WORLD, NAMELY MONEY, AND HAVE IT BE ALLOCATED IN A SENSIBLE OF A WAY IF ITS PRICED VERY, VERY LOW. IN SOME CASES ZERO AND SO I DON'T THINK OF THAT AS NORMAL I DON'T THINK IT STAYS THERE IN THE LONG RUN AND I THINK WE HAVE TO GO THROUGH A PERIOD OF THAT NORMALIZATION BEFORE WE GET REALLY CONFIDENT THAT, GEE, THIS IS THE WAY LIFES GOING TO BE FOREVER, BUT I DON'T NECESSARILY SEE, YOU KNOW, ANY SHOCK – I THINK WE CAN ABSORB THE KIND OF INTEREST RATE RISES WE HAVE IN THE UNITED STATES THAT ARE FORECAST OVER THE NEXT YEAR, BUT IF YOU ASK ME WHAT I WOULD BE NERVOUS ABOUT, I'D SAY, LISTEN, WE HAVE TO GET THROUGH A PERIOD OF INTEREST RATE NORMALIZATION BEFORE YOU COULD SAY THAT THIS IS WHERE ASSET PRICES BELONG.\nSORKIN: HOW DO YOU ASSESS THE TRUMP ADMINISTRATION? HE'S GOING TO BE HERE ON FRIDAY, BUT YOUVE TROLLED HIM A LITTLE BIT OCCASIONALLY ON TWITTER, BUT WE'VE ALSO HAD THIS TAX REFORM PLAN.\nBLANKFEIN: LOOK, THERE'S A LOT OF STUFF THAT I LIKE AND PROBABLY IF I JUST ADDED, YOU KNOW LOOKED AT IT AND SAY LIKE A LOT MORE STUFF THAN I DON'T LIKE AND SOME OF THE STUFF I DON'T LIKE I REALLY DON'T LIKE IRONICALLY, THE STUFF I TEND NOT TO LIKE IS NOT AS SUBSTANTIVE. IT GOES TO -- SOME OF IT IS AND SOME OF IT IS SOCIAL ASPECTS OF IT. I'VE SAID THIS, BUT I DON'T WANT TO BE, YOU KNOW, HYPOCRITICAL EITHER. I'VE REALLY LIKED WHAT HES DONE FOR THE ECONOMY AND I THINK HE'S GONE OUT OF HIS WAY TO BE VERY, VERY SUPPORTIVE OF THE SYSTEM AND I DON'T WANT TO BE ANTAGONISTIC TO THAT FRANKLY, I WANT TO HONOR THAT.\nKERNEN: I THOUGHT ABOUT HOW I'D ASK YOU THAT QUESTION IN THAT YOU BASICALLY JUST DID A BEN FRANKLIN CLOSE, YOU PUT THE POSITIVES ON ONE SIDE, THE NEGATIVES ON THE OTHER THE POSITIVES OUT WEIGH. ARE YOU NOW HAPPY ABOUT THE OUTCOME OF THE ELECTION OR DO YOU STILL WISH THE OTHER CANDIDATE HAD WON?\nBLANKFEIN: WELL, THATS A COMPOUND QUESTION.\nKERNEN: JUST A YES OR NO.\nBLANKFEIN: YOU KNOW, I DON'T HAVE TO -- YOU KNOW, IT IS WHAT IT IS IM VERY GOOD AT, YOU KNOW, BEING A RISK KIND OF GUY, I KIND OF ADAPT TO THE WAY THE WORLD IS.\nKERNEN: BUT YOU LIKE TAX REFORM. TAX REFORM WOULD NOT HAVE HAPPENED.\nBLANKFEIN: TRUE. I THINK THE MARKET WOULD BE LOWER. ID BE DEALING WITH MORE REGULATION COMPOUNDING.\nKERNEN: RIGHT.\nBLANKFEIN: TOO MUCH REGULATION IN SOME RESPECTS.\nKERNEN: YES. YOU'RE HAPPY WITH THE OUTCOME?\nBLANKFEIN: I'D SAY THE ANIMAL SPIRITS ARE OUT THERE IN A LITTLE BIT MORE VITAL THAN THEY WOULD HAVE BEEN OTHERWISE ID SAY THE COUNTRY MIGHT BE A BIT LESS POLARIZED BUT IM NOT EVEN SURE ABOUT THAT PARTICULAR POINT BECAUSE THERES A LOT OF -- YOU KNOW, NOT ONE PARTY IS RESPONSIBLE FOR THE POLARIZATION BY THE WAY, ITS REALLY THE EXTREME WING OF BOTH PARTIES RESPONSIBLE FOR IT ID LOVE TO FIND THE MODERATES STEPPING UP AND COMPROMISING AGAIN, I WANT TO BE, YOU KNOW, TRUE, ITS NOT JUST POLICIES THEMSELVES IN A GROSS KIND OF MACRO WAY, TAX REFORM. I THINK WERE GOING TO GO UP ON TO A PERIOD WHERE THERES BEEN A PUSH FOR INFRASTRUCTURE SPENDING, ET CETERA.\nKERNEN: YOU THINK 3% IS DOABLE? IF YOU AND DIMON BOTH SAY 3% IS DOABLE, I'M READY TO CALL IT DOABLE.\nBLANKFEIN: I THINK SO.\nKERNEN: YOU DO?\nBLANKFEIN: I DO THINK IT'S DOABLE.\nSORKIN: GET TO 4%.\nBLANKFEIN: WE HAVE TO GET TO 3% ON THE WAY TO 4%.\nKERNEN: SUPPOSEDLY THERES NOT AN ECONOMIST IN THE WORLD THAT BELIEVES IT. THATS WHAT I'M TOLD.\nBLANKFEIN: THERE'S A LOT OF THINGS -- OKAY\nKERNEN: WHO CARES I KNOW.\nBLANKFEIN: ANOTHER THING, YOU KNOW, I WANT TO -- I WENT AS PART OF THE TRADE MISSION TO CHINA AND, AGAIN, ASIDE FROM THE BIG MACRO IN POLICY ISSUES, YOU KNOW, THERE WAS THE PRESIDENT BRINGING COMPANIES FROM THE UNITED STATES AND VERY AGGRESSIVELY WITH WILBUR WHO I THINK IS COMING ON NEXT, AGGRESSIVELY PROMOTING U.S. BUSINESS DEALINGS WITH CHINA, AND I KNOW SPECIFICALLY THERE WERE THINGS THAT GOT DONE THAT OTHERWISE WOULDNT HAVE GOTTEN DONE SO I DON'T WANT TO NOT MARK THAT.\nQUICK: THERE ARE ISSUES ON TRADE THOUGH AND, YOU KNOW, LAST YEAR AT THIS TIME I REMEMBER WE WERE ALL SITTING AROUND THE DESK AND EVERY PERSON SAID THERE COULD BE A POTENTIAL TRADE WAR BASED ON THE COMMENTARY. IT DIDN'T HAPPEN.\nBLANKFEIN: IT DIDN'T HAPPEN. YOU HAVE TO PUT THE WORD YET AT THE END OF ALL OF THINGS.\nQUICK: YEAH.\nBLANKFEIN: IT DIDN'T HAPEEN AND YOU KNOW I HAVE ANXIETY ABOUT THAT BUT, LOOK, LIKE EVERYTHING ELSE, THERES A CORE OF -- AT LEAST A CORE OF VALIDITY TO THESE POINTS THE TRADE. WE ALL WENT TO -- WE ALL TOOK EQ ONE. EVERYONE KNOWS THE THEORY OF RELATIVE ADVANTAGE EVERYBODY SHOULD DO WHAT THEYRE BEST AT AND THEN WE SHOULD ALL TRADE WITH EACH OTHER. THATS HOW YOU CREATE WEALTH IN THE WORLD. MAXIMIZE WEALTH IN THE WORLD ALSO THERES A DISTRIBUTION ELEMENT. WHERE DOES THE WEALTH GO, BOTH AMONG NATIONS AND WITHIN A NATION AND THE FACT OF THE MATTER IS IT MAY WELL HAVE BEEN THAT THE U.S. DIDNT DO AS WELL EVEN THOUGH THE WEALTH OF THE WORLD WAS MAXIMIZED, NOT NECESSARILY FOR THE U.S. NOW, YOU KNOW, YOU DONT STOP THERE BECAUSE YOU SAY, WELL, GEE, IF YOURE GOING TO HAVE THAT SITUATION, CERTAIN INDUSTRIES ARE GOING TO GET HOLLOWED OUT IN THE U.S. AND YOU HAVE POLITICAL UNREST, WHICH IS KIND OF WHAT WE HAVE A BIT OF, UNREST BECAUSE OF THIS WHOLE INEQUALITY ISSUE WHICH MAY HAVE BEEN CAUSED BY CERTAIN KINDS OF JOBS DISAPPEARING AND NOT BEING REPLACED YOU SAY, WELL, GEE, POLITICAL INSTABILITY IS NOT VERY GOOD FOR COMMERCE EITHER.\nQUICK: RIGHT.\nBLANKFEIN: AND SO I COULD MAKE YOU HAVE TO GO TOGETHER AND SO MY EYES HAVE BEEN – I HAVENT THROWN IN -- I HAVEN'T CHANGED RADICALLY MY THOUGHTS ABOUT A LOT OF STUFF LIKE EVERYTHING ELSE, I HAVE AN OPEN MIND. I LISTEN TO THIS STUFF AND I SEE THE OTHER SIDE.\nSORKIN: ARE YOU SURPRISED AFTER THIS TAX REFORM PACKAGE THAT WE'VE SEEN SO MANY COMPANIES, STARBUCKS THIS MORNING ANNOUNCING THAT THEYRE GOING TO BE GIVING RAISES TO THEIR PEOPLE OBVIOUSLY WE HAD JAMIE DIMON, HES DOING THE SAME. DID THAT SURPRISE YOU THAT IT HAPPENED AS QUICKLY AS IT DID?\nBLANKFEIN: YOU KNOW, I DON'T -- YES, IT SURPRISED ME I DIDN'T THINK THAT IT WOULD SO FAR THE ONLY ACCOUNTING EFFECT THAT WEVE HAD FROM THE CHANGE IN THE TAX LAW IS WE HAD A $4.4 BILLION WRITEDOWN, ACCOUNTING WRITEDOWN. IF ANYBODY WANTS TO SHARE THAT WITH US, PLEASE GIVE ME A CALL.\nKERNEN: SOUNDS LIKE A NON-CASH THING?\nBLANKFEIN: NO, IT'S A NON-CASH THING.\nKERNEN: STILL BEAT EXPECTATIONS FROM LAST YEAR, RIGHT?\nQUICK: TANGIBLE EQUITY.\nBLANKFEIN: YEAH, WE HAD A VERY HIGH RETURN ON EQUITY.\nKERNEN: WITH THE TRADING WHERE IT IS?\nBLANKFEIN: YEAH. NO NO, ALL THE OTHER BUSINESSES WE HAD ARE DOING VERY WELL AND WELL ENOUGH TO COMPENSATE FOR THE FALLOFF. YOU KNOW, LOOK, THE BOTTOM LINE IS WHERE I DONT MIND BEING KNOWN AS A GOOD TRADING FIRM, WE GO WITH THAT, ITS NOT A GREAT TRADE. EVEN AN ENVIRONMENT THATS VERY UNSUPPORTIVE OF TRADING WHERE TRADING AGAINST OUR REVENUE BASE IS WELL UNDER 20%, OUR OTHER BUSINESSES ARE PERFORMING SO WELL THAT WE OUTPERFORMED AND DID BETTER ON A WHOLE AND SO IT IS WHAT IT IS. AND YOU'RE RIGHT, I HAVE A MIXED MIND DO I REALLY WANT THE KIND OF MARKET THAT WOULD GENERATE A LOT OF –\nKEREN: EXACTLY.\nBLANKFEIN: -- A LOT OF TRADING BUT GUESS WHAT, WHETHER I WANT IT OR NOT, ITS GOING TO HAPPEN EVENTUALLY.\nSORKIN: YOU'RE OPENING A BITCOIN TRADING DESK.\nBLANKFEIN: WE ARE?\nSORKIN: THATS WHAT I READ. IS THAT NOT TRUE?\nBLANKFEIN: YES, ITS NOT TRUE AND I READ IT ALSO.\nSORKIN: HAS THE BLANKFEIN FAMILY BOUGHT ANY BITCOIN?\nBLANKFEIN: WHAT WE SAID WAS WE WERE OPENING -- WE WE'RE CLEARING FUTURES IN BITCOINS FOR SOME OF OUR FUTURES CLIENTS. WE'D CLEAR THEM. WE'RE A PRIME BROKER AND SO IF OUR CLIENTS ARE GOING TO DO IT, WERE GOING TO GO DO IT. A PRINCIPLE BITCOIN BUSINESS WHERE WERE GOING LONG AND SHORT BITCOIN, MARKET MAKING, SO FAR WE'RE NOT –\nSORKIN: SO THE BLANKFEIN FAMILY IS NOT INVOLVED.\nBLANKFEIN: I CAN'T SPEAK FOR ALL OF MY -- YOU KNOW, FOR ALL OF MY MILLENNIAL CHILDREN –\nSORKIN: YOUR CHILDREN.\nBLANKFEIN: BUT THE GROWNUPS AREN'T\nKERNEN: GOD, I JUST HAD A FLASHBACK WHEN YOU WERE TRYING TO EXPLAIN TO LEVIN WHAT IT MEANT TO BE A MARKET MAKER VERSUS A PRINCIPLE IN A TRADE. YOU'RE GOING TO HAVE TO DO THAT AGAIN.\nBLANKFEIN: DON'T REKINDLE MY PTSD.\nKERNEN: YEH PTSD. YEAH, HAD A HORRIBLE FLASHBACK. CHINA THEY'RE ADULTS OVER THERE. DO YOU THINK WE COULD GET TO THE POINT WHERE WE GOT THEM SO ANGRY SOMETHING HAPPENS OR DO YOU THINK THEY UNDERSTAND THE WAY THINGS WORK.\nQUICK: ON TRADE?\nKERNEN: YEAH, ON TRADE. DO YOU THINK WE COULD ACTUALLY SCREW THIS UP? THEYRE ADULTS.\nBLANKFEIN: OF COURSE WE CAN, OF COURSE AGAIN, I LOOK AT THIS, WHATS GOING ON AND, AGAIN, YOU KNOW, WERE AT THE POINT NOW WHERE WE KIND OF KNOW WHATS GOING ON IN THE WORLD AND ID SAY, YOU KNOW, ITS NOT SO -- YOU KNOW, IT NOT SO CLEAR WHAT THE RIGHT STRATEGY IN THE NEGOTIATION HAS TO BE.\nKERNEN: RIGHT.\nBLANKFEIN: IF YOURE GOING TO NEGOTIATE AND GET SOME BENEFITS, YOU HAVE TO LAY IT DOWN AND SAY, YOU KNOW, THIS IS THE WAY ITS GOING TO BE. WHAT DO YOU WANT TO DO?\nKERNEN: RIGHT.\nBLANKFEIN: I THINK THE CHINESE HAVE BEEN AN EMERGING MARKET BUT A LOT OF PARTS OF THE CHINESE MARKET HAVE EMERGED.\nKERNEN: YEAH.\nBLANKFEIN: AND NOW WE HAVE TO COMPETE ON MORE OF A LEVEL PLAYING FIELD, AND I THINK THEY RECOGNIZE IT. IN SOME CASES THEY REQUEST A SUBSIDY. NOT A REAL SUBSIDY BUT A BENEFIT AND IN SOME CASES I THINK THEY DOMINATE CERTAIN ASPECTS OF THE MARKET, ESPECIALLY IN SOME ASPECTS OF THE INDUSTRIAL MARKET SO, YOU KNOW, WELL SEE WHERE IT GOES, BUT, YOU KNOW, ITS EASY TO SECOND GUESS WHERE IT GOES, BUT IF WE -- YOU KNOW, IF WE HAD THE -- IF WE HAD THAT BRIEF AND WE HAD TO ENGAGE AND WE HAD TO IMPROVE, MAKE THINGS COME OUT BETTER THAN THEYRE COMING OUT, YOU KNOW, WE MIGHT ADAPT SOME OF THE STRATEGY AS WELL.\nKERNEN: RIGHT. GREAT TO HAVE YOU HERE.\nBLANKFEIN: GREAT TO BE HAD THANK YOU.\nAbout CNBC:\nWith CNBC in the U.S., CNBC in Asia Pacific, CNBC in Europe, Middle East and Africa, and CNBC World, CNBC is the recognized world leader in business news and provides real-time financial market coverage and business information to more than 409 million homes worldwide, including more than 91 million households in the United States and Canada. CNBC also provides daily business updates to 400 million households across China. The network's 15 live hours a day of business programming in North America (weekdays from 4:00 a.m. - 7:00 p.m. ET) is produced at CNBC's global headquarters in Englewood Cliffs, N.J., and includes reports from CNBC News bureaus worldwide. CNBC at night features a mix of new reality programming, CNBC's highly successful series produced exclusively for CNBC and a number of distinctive in-house documentaries.\nCNBC also has a vast portfolio of digital products which deliver real-time financial market news and information across a variety of platforms including: CNBC.com; CNBC PRO, the premium, integrated desktop/mobile service that provides live access to CNBC programming, exclusive video content and global market data and analysis; a suite of CNBC mobile products including the CNBC Apps for iOS, Android and Windows devices; and additional products such as the CNBC App for the Apple Watch and Apple TV.\nMembers of the media can receive more information about CNBC and its programming on the NBCUniversal Media Village Web site at http://www.nbcumv.com/programming/cnbc .\nFor more information about NBCUniversal, please visit http://www.NBCUniversal.com .", "external_links": ["https://wpyadmin.ne.cision.com/l/rqqbqgiy/wpyadmin.ne.cision.com/l/ifqfoiiz/wpyadmin.ne.cision.com/l/ekzlkfiz/wpyadmin.ne.cision.com/l/kvqakfgz/www.cnbc.com/squawk-box-us", "http://www.nbcumv.com/programming/cnbc"], "published": "2018-01-24T19:57:00.000+02:00", "crawled": "2018-01-24T20:58:07.025+02:00", "highlightTitle": ""}