{"organizations": [], "uuid": "ef7a82407aeab8f7fa4c7876ef871ad41aa008d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/07/103448984-GettyImages-511706304.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/cashless-technology-catches-on-at-restaurants.html", "country": "US", "domain_rank": 767, "title": "Cashless technology catches on at restaurants", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-27T22:01:00.000+02:00", "replies_count": 0, "uuid": "ef7a82407aeab8f7fa4c7876ef871ad41aa008d8"}, "author": "Trent Gillies", "url": "https://www.cnbc.com/2018/01/26/cashless-technology-catches-on-at-restaurants.html", "ord_in_thread": 0, "title": "Cashless technology catches on at restaurants", "locations": [], "entities": {"persons": [{"name": "michael kaplan", "sentiment": "none"}, {"name": "dos toros", "sentiment": "none"}, {"name": "kaplan", "sentiment": "none"}, {"name": "kremer", "sentiment": "none"}, {"name": "leo kremer", "sentiment": "none"}], "locations": [{"name": "two forks", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "shake shack", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "23 Hours Ago | 04:10 \nAt a growing number of restaurants, your money — or your cash at least — is no good. \nFor a variety of reasons, more eateries are refusing to allow cash payment, and only accepting debit and credit cards. One of them is fast-casual chain Sweetgreen, which went cashless last year . Separately, burger giant Shake Shack said recently that it's testing a cashless, kiosk-only location .When Two Forks opened in New York City just over a year ago, owner Michael Kaplan told CNBC they accepted both cash and cards for the first few weeks. That quickly changed. \n\"…We were noticing that with every cash transaction, the payment process was slowing down significantly,\" Kaplan said to \"On the Money\" in a recent interview. After doing some research, the eatery saw that \"generally everyone pays with credit cards anyway.\" \nWith that in mind, Kaplan decided to eliminate cash as a payment option. \"We thought it was a good next step,\" he said. \nDos Toros co-CEO Leo Kremer said that \"simplicity\" was the reason behind his 14 location chain's decision to be cashless. Kremer explained to CNBC the goal in hospitality is really simple. \n\"To delight your guests every day. But it's hard to do that,\" he said. \n\"It's about great food and great service and a clean environment and those things require time and focus and manager time is eaten up by cash handling procedures. Going cashless just allows us to focus that much more on doing a good job,\" Kremer added. \nThe restauranteur said his managers save about two hours a day that used to be spent counting cash, buying change, and making bank runs. He added that time can be used to coach the team of employees and engage directly with customers. \"Ideally, we're just payment agnostic, as long as its digital. Whether it's Apple Pay or Google or some cryptocurrency or whatever, if it's quick and digital, we'll accept everything.\" -Leo Kremer, co-CEO, Dos Toros \nYet what happens when a customer only has cash to pay for a meal? \nKremer says their employees ask, \"Do you have a card? And if not, and it's an honest mistake, we'll just comp the meal and be generous and say 'remember your card for next time.' We're trying to be very mellow about it.\" \nSimilarly, Two Forks' Kaplan says each week only a \"handful\" of people come in with only cash — but he doesn't turn them away. \n\"If they have exact change, we give it to them, Kaplan said. \"If they can get close enough, we always try to work with the customer.\" \nAnd for their workers, both say going cashless is safer because without cash on premises, the risk of robbery or break-ins is reduced. 'Agnostic, as long as its digital' \nHowever, they acknowledged a downside of going cashless is the risk of alienating those patrons who prefer to use cash, plus the added cost of credit card processing fees. \n\"There is roughly a 3 percent cost to us on every card transaction, which is not great.\" But Kremer calculates that with the added cost of cash management, \"it comes out roughly even.\" \nEarlier this week in Seattle, the cashless trend expanded when the first \"Amazon Go\" grocery store opened . \n\"Amazon Go\" is a convenience store without cashiers or checkout lines. You select your items and the payment information that's stored on your phone is automatically charged as you walk out the door. \nMeanwhile, the landscape is gearing up for more than just debit and credit card payments. Kremer said his restaurant is \"hard at work transitioning to a new point-of-sale software\" that can \"integrate with NFC [near field communication] and contactless payment.\" \nHe added: \"Ideally, we're just payment agnostic, as long as its digital. Whether it's Apple Pay or Google or some cryptocurrency or whatever, if it's quick and digital, we'll accept everything. \" \nEverything except cash. \nOn the Money airs on CNBC Saturday at 5:30 am ET, or check listings for air times in local markets. Trent Gillies CNBC Producer, \"On the Money\" Related Securities", "external_links": [], "published": "2018-01-27T22:01:00.000+02:00", "crawled": "2018-01-27T22:01:23.000+02:00", "highlightTitle": ""}