{"organizations": [], "uuid": "108a62efeffdfd5c20c24901c0af4074c3dbddf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-conmed-corporation-announces-fourth-quarter-and-fiscal-year-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "CONMED Corporation Announces Fourth Quarter and Fiscal Year 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-01T00:01:00.000+02:00", "replies_count": 0, "uuid": "108a62efeffdfd5c20c24901c0af4074c3dbddf3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-conmed-corporation-announces-fourth-quarter-and-fiscal-year-2017-financial-results.html", "ord_in_thread": 0, "title": "CONMED Corporation Announces Fourth Quarter and Fiscal Year 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "utica", "sentiment": "none"}], "organizations": [{"name": "conmed", "sentiment": "negative"}, {"name": "conmed corporation", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}, {"name": "general surgery", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UTICA, N.Y.--(BUSINESS WIRE)-- CONMED Corporation (Nasdaq:CNMD) today announced financial results for the fourth quarter and fiscal year ended December 31, 2017.\nFourth Quarter 2017 Highlights\nSales of $222.6 million increased 9.0% as reported and 7.9% in constant currency as compared to the fourth quarter of 2016. Domestic revenue increased 7.8% year over year and was driven by growth in both General Surgery and Orthopedics. International revenue increased 10.4% as reported and 8.0% in constant currency, driven by continued growth in General Surgery and Orthopedics. Adjusted gross margin expanded 240 basis points to 55.8%. Diluted net earnings per share (GAAP) were $1.65, compared to diluted net earnings per share (GAAP) of $0.24 in the fourth quarter of 2016. Adjusted diluted net earnings per share (1) were $0.69 versus $0.54 in the prior-year period, an increase of 27.8%.\nFiscal Year 2017 Highlights\nSales of $796.4 million increased 4.3% as reported and in constant currency as compared to the full year 2016. Domestic revenue increased 3.0% year over year and was driven by strong performance in General Surgery. International revenue increased 5.7% as reported and 5.8% in constant currency, driven by continued growth in General Surgery and Orthopedics. Diluted net earnings per share (GAAP) were $1.97, compared to $0.52 in 2016. Adjusted diluted net earnings per share (1) were $1.89 versus $1.84 in the prior-year period, an increase of 2.7%.\n“We are very pleased with our fourth quarter results, which included the continued acceleration of our top line, expanded gross margins, and improved earnings. The quarterly and full-year results are the culmination of our strategic focus and the hard work of the entire CONMED team,” commented Curt R. Hartman, CONMED’s President and Chief Executive Officer. “We believe that our continued investments in people and innovative products position us well to drive further market penetration with an improved profitability profile going forward.”\nSales Analysis\nFor the quarter ended December 31, 2017, domestic sales, which represented 50.9% of total revenue, increased 7.8%, driven by strong performances in both General Surgery and Orthopedics. International sales, which represented 49.1% of total revenue, increased 10.4% compared to the fourth quarter of 2016 on a reported basis. Foreign currency exchange rates, including the effects of the FX hedging program, had a positive impact of $2.4 million on fourth quarter sales. In constant currency, international sales increased 8.0% versus the prior-year period.\nFor the fiscal year ended December 31, 2017, domestic sales, which represented 51.6% of total revenue, increased 3.0% as strong growth in General Surgery was offset by a 2.1% decline in Orthopedics. International sales, which represented 48.4% of total revenue, increased 5.7% compared to 2016 on a reported basis. Foreign currency exchange rates, including the effects of the FX hedging program, had a positive impact of $0.1 million on fiscal year 2017 sales. In constant currency, international sales increased 5.8% versus the prior-year period.\nEarnings Analysis\nFor the quarter ended December 31, 2017, reported net earnings totaled $46.7 million, compared to reported net earnings of $6.7 million a year ago. Reported diluted net earnings per share were $1.65 in the quarter, compared to reported diluted net earnings per share of $0.24 in the prior-year period. Reported net income for 2017 and 2016 includes restructuring costs, business acquisition costs, and legal costs. Additionally, reported net income for the fourth quarter of 2017 includes a tax benefit of $1.13 resulting from the 2017 Tax Cuts and Jobs Act. The effect of each of these items on reported net income and reported diluted net earnings per share appears in the reconciliation of GAAP to non-GAAP measures below.\nThe Company excludes the costs of special items including acquisitions, restructurings, legal matters, gains on the sale of assets, debt refinancings, amortization of intangible assets, net of tax, as well as the impact of the 2017 Tax Cuts and Jobs Act from its adjusted diluted net earnings per share. Excluding the impact of these items, adjusted net earnings (2) of $19.5 million increased 29.4% year over year, and adjusted diluted net earnings per share (1) of $0.69 increased 27.8% year over year. The increase in adjusted net earnings resulted primarily from the favorable impact of foreign exchange rates, higher sales, and improved gross margin.\nFor the fiscal year ended December 31, 2017, reported net earnings totaled $55.5 million, compared to reported net earnings of $14.7 million a year ago. Reported diluted net earnings per share were $1.97, compared to $0.52 in the prior-year period. Additionally, reported net income for 2017 includes a tax benefit of $1.14 resulting from the 2017 Tax Cuts and Jobs Act. Excluding the impact of the special items as described above and as provided in the reconciliation of GAAP to non-GAAP measures below, adjusted net earnings (2) of $53.3 million increased 3.7% year over year and adjusted diluted net earnings per share (1) of $1.89 increased 2.7% from the prior year.\n2018 Outlook\nThe Company expects full-year 2018 constant currency sales growth in the 4.0% to 5.0% range. Based on recent exchange rates, the positive impact to 2018 sales from foreign exchange is anticipated to be between approximately 100 and 150 basis points.\nIn addition, the Company forecasts full-year 2018 adjusted diluted net earnings per share in the range of $2.11 to $2.17. This represents growth over 2017 of approximately 12% to 15%. The adjusted diluted net earnings per share estimates for 2018 exclude the cost of special items including acquisition costs and restructuring costs, which are estimated in the range of $3 to $5 million, net of tax, and amortization of intangible assets, which are estimated in the range of $16 to $18 million, net of tax.\nSupplemental Financial Disclosures\n(1) A reconciliation of reported diluted net earnings per share to adjusted diluted net earnings per share, a non-GAAP financial measure, appears below.\n(2) A reconciliation of reported net income to adjusted net earnings, a non-GAAP financial measure, appears below.\nConference Call\nThe Company’s management will host a conference call today at 4:30 p.m. ET to discuss its fourth quarter and fiscal year 2017 results.\nTo participate in the conference call, dial 844-889-7792 (domestic) or 661-378-9936 (international) and refer to the passcode 2281848.\nThis conference call will also be webcast and can be accessed from the “Investors” section of CONMED's website at www.conmed.com . The webcast replay of the call will be available at the same site approximately one hour after the end of the call.\nA recording of the call will also be available from 7:30 p.m. ET on Wednesday, January 31, 2018, until 7:30 p.m. ET on Wednesday, February 14, 2018. To hear this recording, dial 855-859-2056 (domestic) or 404-537-3406 (international) and enter the passcode 2281848.\nAbout CONMED Corporation\nCONMED is a medical technology company that provides surgical devices and equipment for minimally invasive procedures. The Company’s products are used by surgeons and physicians in a variety of specialties, including orthopedics, general surgery, gynecology, neurosurgery and gastroenterology. CONMED has a direct selling presence in 17 countries, and international sales constitute approximately 50% of the Company’s total sales. Headquartered in Utica, New York, the Company employs approximately 3,100 people. For more information, visit www.conmed.com .\nForward-Looking Statements\nThis press release and today’s conference call may contain forward-looking statements based on certain assumptions and contingencies that involve risks and uncertainties, which could cause actual results, performance, or trends to differ materially from those expressed in the forward-looking statements herein or in previous disclosures. For example, in addition to general industry and economic conditions, factors that could cause actual results to differ materially from those in the forward-looking statements may include, but are not limited to, the risk factors discussed in the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2016. Any and all forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and relate to the Company’s performance on a going-forward basis. The Company believes that all forward-looking statements made by it have a reasonable basis, but there can be no assurance that management’s expectations, beliefs or projections as expressed in the forward-looking statements will actually occur or prove to be correct.\nSupplemental Information - Reconciliation of GAAP to Non-GAAP Financial Measures\nThe Company supplements the reporting of its financial information determined under accounting principles generally accepted in the United States (GAAP) with certain non-GAAP financial measures, including percentage sales growth in constant currency; adjusted gross profit; cost of sales excluding specified items; adjusted selling and administrative expenses; adjusted operating income; adjusted income tax expense (benefit); adjusted effective income tax rate; adjusted net earnings and adjusted diluted net earnings per share (EPS). The Company believes that these non-GAAP measures provide meaningful information to assist investors and shareholders in understanding its financial results and assessing its prospects for future performance. Management believes percentage sales growth in constant currency and the other adjusted measures described above are important indicators of its operations because they exclude items that may not be indicative of, or are unrelated to, its core operating results and provide a baseline for analyzing trends in the Company’s underlying business. Further, the presentation of EBITDA is a non-GAAP measurement that management considers useful for measuring aspects of the Company’s cash flow. Management uses these non-GAAP financial measures for reviewing the operating results and analyzing potential future business trends in connection with its budget process and bases certain management incentive compensation on these non-GAAP financial measures.\nTo measure percentage sales growth in constant currency, the Company removes the impact of changes in foreign currency exchange rates that affect the comparability and trend of sales. To measure earnings performance on a consistent and comparable basis, the Company excludes certain items that affect the comparability of operating results and the trend of earnings. These adjustments are irregular in timing, may not be indicative of past and future performance and are therefore excluded to allow investors to better understand underlying operating trends.\nBecause non-GAAP financial measures are not standardized, it may not be possible to compare these financial measures with other companies' non-GAAP financial measures having the same or similar names. These adjusted financial measures should not be considered in isolation or as a substitute for reported sales growth, gross profit, cost of sales, selling and administrative expenses, operating income, income tax expense (benefit), effective income tax rate, net income and diluted net earnings per share, the most directly comparable GAAP financial measures. These non-GAAP financial measures are an additional way of viewing aspects of the Company’s operations that, when viewed with GAAP results and the reconciliations to corresponding GAAP financial measures below, provide a more complete understanding of the business. The Company strongly encourages investors and shareholders to review its financial statements and publicly-filed reports in their entirety and not to rely on any single financial measure.\nConsolidated Condensed Statements of Income\n(in thousands, except per share amounts, unaudited)\nThree Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Net sales $ 222,555 $ 204,094 $ 796,392 $ 763,520 Cost of sales 98,597 97,135 365,351 355,190 Gross profit 123,958 106,959 431,041 408,330 % of sales 55.7 % 52.4 % 54.1 % 53.5 % Selling and administrative expense 92,405 86,719 351,799 338,400 Research & development expense 8,378 7,634 32,307 32,254 Income from operations 23,175 12,606 46,935 37,676 % of sales 10.4 % 6.2 % 5.9 % 4.9 % Other expense - - - 2,942 Interest expense 4,879 3,911 18,203 15,359 Income before income taxes 18,296 8,695 28,732 19,375 Provision (benefit) for income taxes (28,400 ) 1,987 (26,755 ) 4,711 Net income $ 46,696 $ 6,708 $ 55,487 $ 14,664 Basic EPS $ 1.67 $ 0.24 $ 1.99 $ 0.53 Diluted EPS 1.65 0.24 1.97 0.52 Basic shares 27,980 27,832 27,939 27,804 Diluted shares 28,297 27,987 28,171 27,964 Sales Summary\n(in millions, unaudited)\nThree Months Ended December 31, % Change Domestic International 2017 2016 As\nReported\nConstant\nCurrency\nAs\nReported\nAs\nReported\nConstant\nCurrency\nOrthopedic Surgery $ 121.0 $ 111.6 8.4% 6.9% 5.3% 10.5% 7.9% General Surgery 101.6 92.5 9.8% 9.1% 9.6% 10.1% 8.1% $ 222.6 $ 204.1 9.0% 7.9% 7.8% 10.4% 8.0% Single-use Products $ 174.6 $ 160.0 9.1% 7.9% 8.2% 10.1% 7.6% Capital Products 48.0 44.1 8.9% 7.7% 5.8% 11.3% 9.2% $ 222.6 $ 204.1 9.0% 7.9% 7.8% 10.4% 8.0% Domestic $ 113.3 $ 105.1 7.8% 7.8% International 109.3 99.0 10.4% 8.0% $ 222.6 $ 204.1 9.0% 7.9% Year Ended December 31, % Change Domestic International 2017 2016 As\nReported\nConstant\nCurrency\nAs\nReported\nAs\nReported\nConstant\nCurrency\nOrthopedic Surgery $ 428.9 $ 422.1 1.6% 1.5% -2.1% 4.1% 3.9% General Surgery 367.5 341.4 7.6% 7.8% 6.8% 9.3% 9.8% $ 796.4 $ 763.5 4.3% 4.3% 3.0% 5.7% 5.8% Single-use Products $ 637.0 $ 605.8 5.2% 5.2% 3.7% 6.8% 6.9% Capital Products 159.4 157.7 1.1% 1.0% -0.1% 2.1% 2.0% $ 796.4 $ 763.5 4.3% 4.3% 3.0% 5.7% 5.8% Domestic $ 411.0 $ 399.1 3.0% 3.0% International 385.4 364.4 5.7% 5.8% $ 796.4 $ 763.5 4.3% 4.3% Reconciliation of Reported Net Income to Adjusted Net Earnings\n(in thousands, except per share amounts, unaudited)\nThree Months Ended December 31, 2017 Gross Profit Selling &\nAdministrative\nExpense\nOperating\nIncome\nTax\nExpense/\n(Benefit)\nEffective\nTax Rate\nNet\nIncome\nDiluted\nEPS\nAs reported $ 123,958 $ 92,405 $ 23,175 $ (28,400) -155.2% $ 46,696 $ 1.65 % of sales 55.7% 41.5% 10.4% Restructuring costs (1) 125 - 125 42 83 0.00 Business acquisition costs (2) - (1,316) 1,316 477 839 0.03 Legal matters (3) - (439) 439 143 296 0.01 Tax reform (4) - - - 32,058 (32,058) (1.13) $ 124,083 $ 90,650 $ 25,055 $ 4,320 $ 15,856 $ 0.56 % of sales 55.8% Amortization of intangible assets $ 1,500 $ (4,198) $ 5,698 $ 2,015 $ 3,683 $ 0.13 Adjusted net earnings $ 86,452 $ 30,753 $ 6,335 24.5% $ 19,539 $ 0.69 % of sales 38.8% 13.8% Three Months Ended December 31, 2016 Gross Profit Selling &\nAdministrative\nExpense\nOperating\nIncome\nTax\nExpense\nEffective\nTax Rate\nNet\nIncome\nDiluted\nEPS\nAs reported $ 106,959 $ 86,719 $ 12,606 $ 1,987 22.9% $ 6,708 $ 0.24 % of sales 52.4% 42.5% 6.2% Restructuring costs (1) 2,075 (2,565) 4,640 1,630 3,010 0.11 Business acquisition costs (2) - (2,482) 2,482 871 1,611 0.06 Legal matters (3) - (965) 965 339 626 0.02 $ 109,034 $ 80,707 $ 20,693 $ 4,827 $ 11,955 $ 0.43 % of sales 53.4% Amortization of intangible assets $ 1,500 $ (3,500) $ 5,000 $ 1,857 $ 3,143 $ 0.11 Adjusted net earnings $ 77,207 $ 25,693 $ 6,684 30.7% $ 15,098 $ 0.54 % of sales 37.8% 12.6% Reconciliation of Reported Net Income to Adjusted Net Earnings\n(in thousands, except per share amounts, unaudited)\nYear Ended December 31, 2017 Gross\nProfit\nSelling &\nAdministrative\nExpense\nOperating\nIncome\nOther\nExpense\nTax\nExpense/\n(Benefit)\nEffective\nTax Rate\nNet\nIncome\nDiluted EPS As reported $ 431,041 $ 351,799 $ 46,935 $ - $ (26,755) -93.1% $ 55,487 $ 1.97 % of sales 54.1% 44.2% 5.9% Restructuring costs (1) 2,903 (1,347) 4,250 - 1,419 2,831 0.10 Business acquisition costs (2) - (2,336) 2,336 - 847 1,489 0.05 Legal matters (3) - (17,480) 17,480 - 5,681 11,799 0.42 Tax reform (4) - - - - 32,058 (32,058) (1.14) $ 433,944 $ 330,636 $ 71,001 $ - $ 13,250 $ 39,548 $ 1.40 % of sales 54.5% Amortization of intangible assets $ 6,000 $ (15,295) $ 21,295 $ - $ 7,530 $ 13,765 $ 0.49 Adjusted net earnings $ 315,341 $ 92,296 $ - $ 20,780 28.0% $ 53,313 $ 1.89 % of sales 39.6% 11.6% Year Ended December 31, 2016 Gross\nProfit\nSelling &\nAdministrative\nExpense\nOperating\nIncome\nOther\nExpense\nTax\nExpense/\n(Benefit)\nEffective\nTax Rate\nNet\nIncome\nDiluted\nEPS\nAs reported $ 408,330 $ 338,400 $ 37,676 $ 2,942 $ 4,711 24.3% $ 14,664 $ 0.52 % of sales 53.5% 44.3% 4.9% Restructuring costs (1) 7,612 (6,670) 14,282 - 4,850 9,432 0.34 Business acquisition costs (2) - (17,029) 17,029 - 5,930 11,099 0.40 Legal matters (3) - (3,773) 3,773 - 1,312 2,461 0.09 Gain on sale of facility (5) - 1,890 (1,890) - (853) (1,037) (0.04) Debt refinancing costs (6) - - - (2,942) 930 2,012 0.07 $ 415,942 $ 312,818 $ 70,870 $ - $ 16,880 $ 38,631 $ 1.38 % of sales 54.5% Amortization of intangible assets $ 6,000 $ (13,989) $ 19,989 $ - $ 7,197 $ 12,792 $ 0.46 Adjusted net earnings $ 298,829 $ 90,859 $ - $ 24,077 31.9% $ 51,423 $ 1.84 % of sales 39.1% 11.9% (1) In 2017 and 2016, the Company restructured certain operating, sales, marketing and administrative functions and incurred severance and other related costs. Additionally, in the third quarter of 2017, the Company incurred inventory charges related to its SKU rationalization project. Finally, in the second quarter of 2016, the Company terminated a product offering and incurred charges mainly related to inventory and fixed assets. (2) In 2017 and 2016, the Company incurred investment banking fees, consulting fees, legal fees and integration related costs associated with the acquisition of SurgiQuest, Inc. (3) In 2017, the Company incurred litigation fees as a result of the unfavorable verdict in the Lexion vs. SurgiQuest, Inc. case. In 2017 and 2016, the Company incurred legal fees associated with the Lexion vs. SurgiQuest, Inc. case and other legal matters. (4) In 2017, the Company recorded a tax benefit resulting from the 2017 Tax Cuts and Jobs Act. (5) In 2016, the Company recorded a gain on the sale of its facility in Centennial, Colorado. (6) In 2016, in conjunction with the acquisition of SurgiQuest, Inc., the Company refinanced its existing credit facility and incurred one-time fees associated with an agreement between the Company and JP Morgan Chase Bank, N.A., as well as costs associated with the early extinguishment of debt. Reconciliation of Reported Net Income to EBITDA & Adjusted EBITDA\n(in thousands, unaudited)\nThree Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Net income $ 46,696 $ 6,708 $ 55,487 $ 14,664 Provision (benefit) for income taxes (28,400) 1,987 (26,755) 4,711 Interest expense 4,879 3,911 18,203 15,359 Depreciation 5,086 5,237 20,079 20,479 Amortization 10,139 8,601 37,427 33,788 EBITDA $ 38,400 $ 26,444 $ 104,441 $ 89,001 Stock based compensation 2,132 1,869 8,472 7,653 Restructuring costs 125 4,640 4,250 14,282 Business acquisition costs 1,316 2,482 2,336 17,029 Legal matters 439 965 17,480 3,773 Gain on sale of facility - - - (1,890) Debt refinancing costs - - - 2,942 Adjusted EBITDA $ 42,412 $ 36,400 $ 136,979 $ 132,790 EBITDA Margin EBITDA 17.3% 13.0% 13.1% 11.7% Adjusted EBITDA 19.1% 17.8% 17.2% 17.4%\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131006189/en/\nCONMED Corporation\nTodd Garner, 315-624-3317\nChief Financial Officer\nToddGarner@conmed.com\nSource: CONMED Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.conmed.com&esheet=51751771&newsitemid=20180131006189&lan=en-US&anchor=www.conmed.com&index=1&md5=d5ae89bd662289e1d5a77d7dba9a1532", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.conmed.com&esheet=51751771&newsitemid=20180131006189&lan=en-US&anchor=www.conmed.com&index=2&md5=cef0aa67fd3b097a2864424f97004b16", "http://www.businesswire.com/news/home/20180131006189/en/"], "published": "2018-02-01T00:01:00.000+02:00", "crawled": "2018-01-31T23:08:49.000+02:00", "highlightTitle": ""}