{"organizations": [], "uuid": "f9b02dacfa43345eff87cdee6ae8a76bb25f3259", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222570144&w=1200&r=LYNXMPEE0G002", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-refugees-prize-jewish/sculptor-kapoor-awards-1-million-jewish-nobel-prize-to-refugees-idUSKBN1F6003", "country": "US", "domain_rank": 408, "title": "Sculptor Kapoor awards $1 million 'Jewish Nobel' prize to refugees", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-17T08:06:00.000+02:00", "replies_count": 0, "uuid": "f9b02dacfa43345eff87cdee6ae8a76bb25f3259"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-refugees-prize-jewish/sculptor-kapoor-awards-1-million-jewish-nobel-prize-to-refugees-idUSKBN1F6003", "ord_in_thread": 0, "title": "Sculptor Kapoor awards $1 million 'Jewish Nobel' prize to refugees", "locations": [], "entities": {"persons": [{"name": "anish kapoor", "sentiment": "negative"}, {"name": "kapoor", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - British-Indian sculptor Anish Kapoor donated $1 million to five charities working with refugees worldwide on Wednesday in a bid to alleviate a record-breaking global displacement crisis.\nKapoor, who was born to an Indian father and Iraqi Jewish mother, won the Genesis Prize - dubbed the Jewish Nobel - last year, for his commitment to Jewish values.\n“Like many Jews, I do not have to go far back in my family history to find people who were refugees,” he said in a statement.\n“Directing Genesis Prize funds to this cause is a way of helping people who, like my forebears not too long before them, are fleeing persecution.”\nThe United Nations (U.N.) says the world is witnessing the highest levels of displacement on record, with more than 65 million people forced to flee their homes, surpassing numbers after the Second World War more than 70 years ago.\nU.N. efforts to agree a voluntary pact on safe, orderly and regular migration suffered a setback in December when the United States quit the negotiations.\n“In recent months, awareness of the plight faced by tens of millions of refugees and displaced persons worldwide has fallen significantly while the refugee crisis continues unabated,” said Kapoor, a longtime social activist.\nKapoor, who lived in Israel briefly before settling in Britain in the 1970s, won the Turner Prize in 1991 and created a Holocaust memorial for London’s Liberal Jewish Synagogue.\nWinners of the Genesis Prize, which is granted via a partnership with the Genesis Prize Foundation, the Jewish Agency for Israel and the Israeli government, award $1 million to charities of their choice, with the aim of inspiring the next generation of Jews.\nOne of Kapoor’s grantees is the International Rescue Committee, which is working with refugees in Uganda - home to more than 1 million people who have fled war in South Sudan - and with stateless Rohingya in Myanmar.\nHe is also providing food for refugees in Greece and France and medical care for Syrian refugees.\nKapoor’s other chosen charities are the Multifaith Alliance for Syrian Refugees (MFA), HIAS (founded as the Hebrew Immigrant Aid Society), Help Refugees and Hillel International.\nPrevious winners of the prize include former New York City Mayor Michael Bloomberg and the actor Michael Douglas. The 2018 winner, the Oscar-winning actress Natalie Portman, plans to focus her award funds on promoting women’s equality.\nReporting by Karla Mendes. Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T08:06:00.000+02:00", "crawled": "2018-01-17T11:50:32.000+02:00", "highlightTitle": ""}