{"organizations": [], "uuid": "ba9559080f064b53b6bb17e6e085e6dab72116e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220112141&w=1200&r=LYNXMPEE060Q3", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-italy-election-right/italys-rightist-bloc-vows-to-reverse-pension-law-if-elected-idUKKBN1EW0WE", "country": "US", "domain_rank": 408, "title": "Italy's rightist bloc vows to reverse pension law if elected", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T00:59:00.000+02:00", "replies_count": 0, "uuid": "ba9559080f064b53b6bb17e6e085e6dab72116e1"}, "author": "", "url": "https://uk.reuters.com/article/uk-italy-election-right/italys-rightist-bloc-vows-to-reverse-pension-law-if-elected-idUKKBN1EW0WE", "ord_in_thread": 0, "title": "Italy's rightist bloc vows to reverse pension law if elected", "locations": [], "entities": {"persons": [{"name": "silvio berlusconi", "sentiment": "none"}, {"name": "crispian balmer", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "catania", "sentiment": "none"}], "organizations": [{"name": "min read  rome", "sentiment": "none"}, {"name": "forza italia", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "northern league", "sentiment": "none"}, {"name": "brothers of italy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 11:03 PM / Updated 3 hours ago Italy's rightist bloc vows to reverse pension law if elected Crispian Balmer 3 Min Read \nROME (Reuters) - Italy’s rightist parties agreed on Sunday to the outlines of a joint manifesto for the country’s March national election, including pledges to slash taxes, crack down on migrants and reverse planned increases to the retirement age. Forza Italia party leader Silvio Berlusconi waves as he leaves at the end of a rally in Catania, Italy, November 2, 2017. REUTERS/Antonio Parrinello \nFormer Prime Minister Silvio Berlusconi’s Forza Italia party, and its two allies, the far-right Northern League and Brothers of Italy, look set to win the March 4 vote, but are expected to fall short of an absolute majority. \nThe leaders of the three groups, who have an often testy relationship, gathered on Sunday for their first campaign strategy meeting, putting out a brief statement to highlight their shared policy priorities. \n“Less taxes, less bureaucracy, less binds from Europe, more help for those who need it, more security for everyone,” said the statement, released after four hours of talks in one of Berlusconi’s luxury villas. \nOne of their main early goals if they win power would be to eliminate the “damaging effects” of 2011 legislation, named after then-Welfare Minister Elsa Fornero, which called for staggered increases in the retirement age. \nItaly still spends more than 16 percent of its gross domestic product on state pensions, the second highest percentage in Europe after Greece. Economists warn that undoing the law would cost billions of euros and alarm financial markets. \nBut the law is highly unpopular with Italians and the Northern League, led by Matteo Salvini, has made its repeal its number one priority. “Cancelling the Fornero Law (is) in the centre-right programme. Mission accomplished,” Salvini wrote on Twitter on Sunday. \nHe also said that the three parties had agreed to expel all illegal migrants and “take control” of the country’s borders, which are currently covered by the EU free-travel Schengen zone. \nSunday’s statement made no reference to another League proposal - exiting the euro currency - but did commit the conservative bloc to introducing an unspecified flat tax. \nThe Northern League has called for a 15 percent flat tax, while Berlusconi has proposed a flat rate of between 20 and 25 percent. Income tax bands currently run from 23 to 43 percent. \nThe bloc has given no indication of how it intends to pay for its programme, saying only that by lowering the tax rate, more people will pay up, raising the overall tax take. \nEconomy Minister Pier Carlo Padoan told Corriere della Sera newspaper on Sunday that the proposed flat tax was “not sustainable”. \nWith the election less than two months away, all Italian parties are looking to win votes with eye-catching ideas. \nThe ruling centre-left Democratic Party suggested last week that it might abolish the television licence fee, while the leftist Free and Equal party on Sunday proposed making university education free for all. Reporting by Crispian Balmer, Editing by Rosalba O'Brien", "external_links": [], "published": "2018-01-08T00:59:00.000+02:00", "crawled": "2018-01-08T01:55:46.007+02:00", "highlightTitle": ""}