{"organizations": [], "uuid": "51440f349ed035555ae45089f14ffe05edee4646", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 85, "shares": 85, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225126914&w=1200&r=LYNXMPEE0O0SB", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-spain-politics-catalonia/spanish-government-takes-first-step-to-block-nomination-of-puigdemont-as-catalan-leader-idUSKBN1FE1IU", "country": "US", "domain_rank": 408, "title": "Spanish government takes first step to block nomination of Puigdemont as Catalan leader", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:53:00.000+02:00", "replies_count": 0, "uuid": "51440f349ed035555ae45089f14ffe05edee4646"}, "author": "", "url": "https://www.reuters.com/article/us-spain-politics-catalonia/spanish-government-takes-first-step-to-block-nomination-of-puigdemont-as-catalan-leader-idUSKBN1FE1IU", "ord_in_thread": 0, "title": "Spanish government takes first step to block nomination of Puigdemont as Catalan leader", "locations": [], "entities": {"persons": [{"name": "puigdemon", "sentiment": "negative"}, {"name": "puigdemont", "sentiment": "none"}, {"name": "jesus aguado", "sentiment": "none"}, {"name": "soraya saenz de santamaria", "sentiment": "none"}, {"name": "paul day", "sentiment": "none"}, {"name": "ingrid melander", "sentiment": "none"}, {"name": "saenz de santamaria", "sentiment": "none"}], "locations": [{"name": "puigdemont", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MADRID (Reuters) - The Spanish government took steps on Thursday to prevent the re-election of Catalonia’s sacked leader Carles Puigdemont as head of the region in a renewed effort to crack down on the independence movement. \nPuigdemont has been living in self-imposed exile in Brussels since the Madrid government dismissed him as Catalan president in October for spearheading the campaign to split from Spain which culminated in a declaration of independence by the regional parliament. \nHe faces charges of sedition and rebellion in Spain. \nCatalonia’s newly elected parliamentary speaker nominated Puigdemont on Monday as the sole candidate for regional president, defying Spanish government warnings. \nThe Catalan parliament said on Thursday it will hold a vote of confidence in Puigdemont’s candidacy on Jan. 30. Pro-independence parties hold a majority in parliament, meaning he is likely to win the vote. \nAfter imposing direct rule on the northeastern region in October, Spanish Prime Minister Mariano Rajoy called regional elections in December to try to defuse the crisis. \nBut his gamble backfired when separatist parties won a majority, giving new impetus to the independence movement. \nOn Thursday, the Spanish government pressed forward with moves to block Puigdemont’s nomination in the courts and stop him being put forward as candidate next week. \n\nDismissed Catalan president Carles Puigdemont (R) and Roger Torrent, Speaker of Catalan regional Parliament, shake hands before their meeting in Brussels, Belgium, January 24, 2018. REUTERS/Yves Herman The government asked the Council of State -- the supreme consultative council of the Spanish government which advises on serious issues -- for its opinion on appealing against Puigdemont’s candidacy in the courts. \nIn a setback for the government, the Council advised against appealing Puigdemont’s candidacy at the present time, a government source said on Thursday, without giving further details about the content of the Council’s findings. \n\nFormer Catalan president Carles Puigdemont addresses the media after a meeting with Roger Torrent, speaker of Catalan Parliament, in Brussels, Belgium, January 24, 2018. REUTERS/Yves Herman The Council of State declined to comment. \nThe government intends to press ahead with the appeal in any case, the government source said, adding that the matter will be discussed at the weekly cabinet meeting on Friday. \nEarlier, Spanish deputy prime minister said current circumstances did not permit the election of Puigdemont as regional leader as he cannot enter Spain without being arrested. \n“The parliament speaker has put forward as candidate someone who does not enjoy his full rights, who has no right to freedom of movement,” Soraya Saenz de Santamaria said. \nPuigdemont has not divulged his plans on any return to Spain though he has said he has not ruled out returning to Barcelona, the Catalan capital, to attend the parliamentary vote. \nSpanish authorities are keeping a watch on the country’s borders to thwart any attempt by him to sneak him, Interior Minister Juan Ignacio Zoido said on Tuesday. He could face decades in prison if he is arrested, tried and convicted. \nAdditional reporting by Inmaculada Sanz and Ingrid Melander; Editing by Angus MacSwan\n ", "external_links": [], "published": "2018-01-25T13:53:00.000+02:00", "crawled": "2018-01-25T14:13:27.010+02:00", "highlightTitle": ""}