{"organizations": [], "uuid": "22273b3306d2aec6ac33d19ff2517630e94883da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-europe-attacks-belgium/belgium-reduces-security-threat-level-idUSKBN1FB26E", "country": "US", "domain_rank": 408, "title": "Belgium reduces security threat level", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T17:58:00.000+02:00", "replies_count": 0, "uuid": "22273b3306d2aec6ac33d19ff2517630e94883da"}, "author": "", "url": "https://www.reuters.com/article/us-europe-attacks-belgium/belgium-reduces-security-threat-level-idUSKBN1FB26E", "ord_in_thread": 0, "title": "Belgium reduces security threat level", "locations": [], "entities": {"persons": [{"name": "philip blenkinsop", "sentiment": "none"}, {"name": "charles michel", "sentiment": "none"}, {"name": "robert-jan bartunek", "sentiment": "none"}], "locations": [{"name": "belgium", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - Belgium lowered its national threat level on Monday, saying Islamic State’s defeats in Iraq and Syria meant an attack was less likely almost two years after bombings killed 32 people in Brussels.\nPrime Minister Charles Michel said the country had reduced the threat level to two from three on a four-tier scale. The move indicates the threat has fallen to “medium” from “serious”, meaning an attack is now considered unlikely, rather than probable.\n“But level two after the attacks is not the same as level two was before the attacks,” Prime Minister Charles Michel told a news conference. “There is a security culture which has developed over the past years.”\nBelgian soldiers will continue to patrol streets, but in fewer numbers. The move is expected to save money and relieve pressure on a stretched military, allowing troops to train.\nPaul Van Tigchelt, head of security assessment agency OCAD/OCAM, said that while an attack had become less likely in Belgium, it did not mean there was no threat at all.\n“The self-proclaimed caliphate does not exist anymore in Iraq and Syria. The virtual caliphate has also lost ground. The Islamic State has lost much of its attraction,” he said.\nIn December, Iraqi forces recaptured the last areas still under Islamic State control along the border with Syria, three years after the militants had invaded about a third of Iraq’s territory.\nThe group’s militants are still active in Syria and it has claimed responsibility for multiple attacks worldwide, including vehicles driven into pedestrians in two incidents in London and one in Barcelona last year.\nBelgium was last at level two on the eve of the coordinated shooting and suicide bomb attacks that killed 130 people in Paris in November 2015.\nTwo weeks later, the threat level rose to the maximum of four in Brussels for about a week, with schools initially closed, the metro shut and more soldiers on patrol. Belgium was also at level four for a few days after the Brussels attacks.\nSome places would continue to be put on level three alert, but officials declined to give any details. Belgium has previously given greater protection to large events, certain embassies and Jewish schools and areas.\nReporting by Robert-Jan Bartunek, writing by Philip Blenkinsop\n ", "external_links": [], "published": "2018-01-22T17:58:00.000+02:00", "crawled": "2018-01-22T18:17:13.018+02:00", "highlightTitle": ""}