{"organizations": [], "uuid": "a0c470af2a44dea66c6c8316b2d876d7c6f9d5e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224611616&w=1200&r=LYNXMPEE0M1W1", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-alpine-skiing-men/alpine-skiing-hirscher-wins-again-snowballs-aimed-at-kristoffersen-idUKKBN1FC34H", "country": "US", "domain_rank": 408, "title": "Alpine skiing - Hirscher wins again, snowballs aimed at Kristoffersen", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:24:00.000+02:00", "replies_count": 0, "uuid": "a0c470af2a44dea66c6c8316b2d876d7c6f9d5e1"}, "author": "", "url": "https://uk.reuters.com/article/uk-alpine-skiing-men/alpine-skiing-hirscher-wins-again-snowballs-aimed-at-kristoffersen-idUKKBN1FC34H", "ord_in_thread": 0, "title": "Alpine skiing - Hirscher wins again, snowballs aimed at Kristoffersen", "locations": [], "entities": {"persons": [{"name": "hirscher", "sentiment": "negative"}, {"name": "hermann maier", "sentiment": "none"}, {"name": "ingemar stenmark", "sentiment": "none"}, {"name": "henrik kristoffersen", "sentiment": "none"}, {"name": "maier", "sentiment": "none"}, {"name": "marcel hirscher", "sentiment": "none"}, {"name": "kristoffersen", "sentiment": "none"}], "locations": [{"name": "schladming", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "schladming", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "kristoffersen", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "kristoffersen reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 10:25 PM / Updated 12 minutes ago Alpine skiing - Hirscher wins again, snowballs aimed at Kristoffersen Reuters Staff 3 Min Read \nSCHLADMING, Austria (Reuters) - Local favourite Marcel Hirscher edged out Norwegian Henrik Kristoffersen at the World Cup slalom in Schladming on Tuesday after his great rival had snowballs thrown at him. \nHirscher, who will chase an elusive first Olympic gold medal at Pyeongchang next month, equalled Hermann Maier’s total of 54 World Cup wins as he claimed his sixth slalom victory this season and moved closer to a seventh successive overall title. \nMaier, known as the Herminator, is regarded as one of the greatest skiers of all time. Only Sweden’s Ingemar Stenmark, with 86 victories, has won more World Cup races. \nReplays showed that at least two snowballs were thrown at Kristoffersen during his second run, one appearing to hit him. \nThe Norwegian, who did not appear to lose time, gesticulated angrily at the finish line before watching Hirscher, who already had a lead of 0.20 seconds from the first run, charge down to win by 0.39 seconds. \nKristoffersen told Hirscher what had happened as the pair shook hands and the Austrian, looking surprised, replied, “Oh really?, I‘m sorry.” \n“It’s really a lack of respect... a race in Schladming is like a home race for me so it’s not cool,” Kristoffersen told Austrian broadcaster ORF. \nThe floodlight race, in front of a large flag-waving crowd, had something of the atmosphere of a football match, especially when Hirscher crossed the finish line. \nAmerican Mikaela Shiffrin, the top women’s skier, said the incident was dangerous. \n“I don’t care who you are, who you cheer for, what your nationality, or what your reason. Throwing snowballs or any other kind of obstruction AT racers WHILE they are skiing to throw them off is not only disgusting, but dangerous,” she said on Twitter. \n“Marcel... can handle himself without anyone throwing snowballs at his competition.” \nIt was Kristoffersen’s eighth second place of the season, with six of those behind Hirscher. \nThe roles were briefly reversed in Sunday’s slalom at Kitzbuehel when Kristoffersen claimed his first World Cup win of the season, with Hirscher second. \n“This rivalry with Hirscher is really fun,” said Kristoffersen, who lives in Austria. “He is the second best skier of all time.” \nHirscher leads the overall standings with 1154 points, a lead of 174 over Kristoffersen. Norwegian Aksel Lund Svindal, a speed specialist who did not race on Tuesday, is third with 666. Writing by Brian Homewood in Bern; Editing by Ken Ferris", "external_links": [], "published": "2018-01-24T00:24:00.000+02:00", "crawled": "2018-01-24T00:42:01.007+02:00", "highlightTitle": ""}