{"organizations": [], "uuid": "40553fa83ef5ca751d994cd36fdbf554cac1d2df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-sarepta-therapeutics-pre-announces-fourth-quarter-2017-revenue-and-provides-full-year-2018-revenue-guidance-for-exondys-51a.html", "country": "US", "domain_rank": 767, "title": "Sarepta Therapeutics Pre-Announces Fourth Quarter 2017 Revenue and Provides Full-Year 2018 Revenue Guidance for EXONDYS 51® (eteplirsen), Representing Approximately 100 Percent Year-over-Year Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.935, "site_type": "news", "published": "2018-01-08T21:42:00.000+02:00", "replies_count": 0, "uuid": "40553fa83ef5ca751d994cd36fdbf554cac1d2df"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-sarepta-therapeutics-pre-announces-fourth-quarter-2017-revenue-and-provides-full-year-2018-revenue-guidance-for-exondys-51a.html", "ord_in_thread": 0, "title": "Sarepta Therapeutics Pre-Announces Fourth Quarter 2017 Revenue and Provides Full-Year 2018 Revenue Guidance for EXONDYS 51® (eteplirsen), Representing Approximately 100 Percent Year-over-Year Growth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "-- Fourth quarter 2017 EXONDYS 51 unaudited revenue of $57.3 million --\n-- Full-year 2017 EXONDYS 51 unaudited revenue of $154.6 million --\n-- Full-year 2018 EXONDYS 51 revenue guidance of $295 – $305 million --\n-- 16 programs in development --\nSAN FRANCISCO, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Sarepta Therapeutics, Inc. (NASDAQ:SRPT), a commercial-stage biopharmaceutical company focused on the discovery and development of precision genetic medicine to treat rare neuromuscular diseases, today pre-announced its fourth quarter 2017 revenue and also provided full-year 2018 revenue guidance for EXONDYS 51 during the Company’s presentation at the 36 th Annual J.P. Morgan Healthcare Conference. Sarepta’s president and chief executive officer, Douglas Ingram, who presented on behalf of the Company, stated that revenue for the fourth quarter will total $57.3 million and $154.6 million for the full-year of 2017. EXONDYS 51 revenue guidance for 2018 will be in the range of $295 – $305 million.\n“2017 was a remarkable year for Sarepta,” said Douglas Ingram, Sarepta’s president and chief executive officer. “Our full-year 2017 revenue, representing one of the most successful rare disease launches in history, speaks to the value of EXONDYS 51 and also to the ability of our talented colleagues at Sarepta to execute on our plans and deliver on our commitments.”\nMr. Ingram continued, “In 2017, we set the stage by successfully launching our first therapy, entering into important collaborations and ensuring we have ample resources to invest in our impressive pipeline. In 2018, we are accelerating our plans, moving 16 programs through various stages of development, and planning for multiple milestones and inflection points. And we are doing all of this to serve our lofty but achievable aspiration: to improve and extend the lives of the thousands of children suffering from DMD, expand our platform to other rare diseases, and in so doing, to become one of the most important global leaders in precision genetic medicine to reduce human suffering and treat disease.”\nAbout EXONDYS 51\nEXONDYS 51 uses Sarepta’s proprietary phosphorodiamidate morpholino oligomer (PMO) chemistry and exon-skipping technology to skip exon 51 of the dystrophin gene. EXONDYS 51 is designed to bind to exon 51 of dystrophin pre-mRNA, resulting in exclusion of this exon during mRNA processing in patients with genetic mutations that are amenable to exon 51 skipping. Exon skipping is intended to allow for production of an internally truncated dystrophin protein. Data from clinical studies of EXONDYS 51 in a small number of DMD patients have demonstrated a consistent safety and tolerability profile. The pivotal trials were not designed to evaluate long-term safety and a clinical benefit of EXONDYS 51 has not been established.\nImportant Safety Information About EXONDYS 51\nAdverse reactions in DMD patients (N=8) treated with EXONDYS 51 30 or 50 mg/kg/week by intravenous (IV) infusion with an incidence of at least 25% more than placebo (N=4) (Study 1, 24 weeks) were (EXONDYS 51, placebo): balance disorder (38%, 0%), vomiting (38%, 0%) and contact dermatitis (25%, 0%). The most common adverse reactions were balance disorder and vomiting. Because of the small numbers of patients, these represent crude frequencies that may not reflect the frequencies observed in practice. The 50 mg/kg once weekly dosing regimen of EXONDYS 51 is not recommended.\nIn the 88 patients who received ≥30 mg/kg/week of EXONDYS 51 for up to 208 weeks in clinical studies, the following events were reported in ≥10% of patients and occurred more frequently than on the same dose in Study 1: vomiting, contusion, excoriation, arthralgia, rash, catheter site pain, and upper respiratory tract infection.\nThere have been reports of transient erythema, facial flushing, and elevated temperature occurring on the day of EXONDYS 51 infusion.\nFor further information, please see the full Prescribing Information.\nAbout Sarepta Therapeutics\nSarepta Therapeutics is a commercial-stage biopharmaceutical company focused on the discovery and development of precision genetic medicine to treat rare neuromuscular diseases. The Company is primarily focused on rapidly advancing the development of its potentially disease-modifying Duchenne muscular dystrophy (DMD) drug candidates. For more information, please visit www.sarepta.com .\nForward-Looking Statements\nThis press release contains forward-looking statements. Any statements contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements. Words such as \"believes,\" \"anticipates,\" \"plans,\" \"expects,\" \"will,\" \"intends,\" \"potential,\" \"possible\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements include statements regarding Sarepta’s revenue from EXONDYS 51 in the fourth quarter of 2017 and in the year 2017; Sarepta’s full-year 2018 EXONDYS 51 revenue guidance and approximately 100 percent year-over-year growth; Sarepta’s full year 2017 revenue representing one of the most successful rare disease launches in history, and speaking to the value of EXONDYS 51 and also to the ability of Sarepta’s talented employees to execute on Sarepta’s plans and deliver on its commitments; Sarepta accelerating its plans in 2018, moving 16 programs through development, and planning for multiple milestones and inflection points; and Sarepta’s lofty but achievable aspiration to improve and extend the lives of the thousands of children suffering from DMD, expand its platform to other rare diseases and become one of the most important global leaders in precision genetic medicine to reduce human suffering and treat disease.\nThese forward-looking statements involve risks and uncertainties, many of which are beyond Sarepta’s control. Known risk factors include, among others: the audit of Sarepta’s financial statements for the year ended December 31, 2017 is ongoing and could result in changes to the information; Sarepta may not be able to meet expectations with respect to EXONDYS 51 sales or attain the net revenues it anticipates for 2018, profitability or positive cash‐flow from operations; Sarepta may not be able to comply with all FDA post‐approval commitments/requirements with respect to EXONDYS 51 in a timely manner or at all; Sarepta may not be able to obtain regulatory approval for eteplirsen in jurisdictions outside of the U.S., including from the EMA; the results of Sarepta’s ongoing research and development efforts, including those with strategic partners, and clinical trials for Sarepta’s product candidates may not be positive or consistent with prior results or demonstrate a safe treatment benefit which could negatively impact its business; Sarepta may not be able to execute on its business plans and goals, including meeting its expected or planned regulatory milestones and timelines, clinical development plans, and bringing its product candidat", "external_links": ["https://www.globenewswire.com/Tracker?data=eo7vXKdnkW7pB-DaPNkvMQu9akMZeGFk8OtOfI3pQyechQUDmo1pEZzkFlsLhrpQk6QacwGWrUd1yAxiT7fQAbej1QEjB4qOM2l9k8U8ju8=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/7cc27c43-de1a-41c5-bbce-6ca95676ea69", "https://www.globenewswire.com/Tracker?data=aRxniF5RePL6Um8Er-0iPp5gZoXYfZO1e2UywbKXLC_ed0Bv0_YEBYY3nCVUSI1BeGVyteubumcXw-a-HrEzv9HkD9jjhXhKO8rVBTDjcwQ=", "https://www.globenewswire.com/Tracker?data=T9s0GhAaTAcGDLK4Y3wS6cRhxL38inHhGY6xqR5qIlXVt1FnLUwShhH910dq6SxpgYrzEmFhrY1B-3Xd5GxQuA==", "https://www.globenewswire.com/Tracker?data=T9s0GhAaTAcGDLK4Y3wS6bA7BeY2IcKP4AjBSl32ZJ4qCcvqNltL6J_oVS-CXMHRZ749V08JA-7VecZHmSXWWw=="], "published": "2018-01-08T21:42:00.000+02:00", "crawled": "2018-01-09T09:36:41.630+02:00", "highlightTitle": ""}