{"organizations": [], "uuid": "90c28169d034311d96b9589415bdaef06fd396ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 25}, "facebook": {"likes": 312, "shares": 312, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/08/104155848-GettyImages-171891912.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/southwest-and-american-airlines-to-pay-bonuses-after-tax-bill.html", "country": "US", "domain_rank": 767, "title": "Southwest and American airlines to pay bonuses after tax bill", "performance_score": 3, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.204, "site_type": "news", "published": "2018-01-03T13:27:00.000+02:00", "replies_count": 0, "uuid": "90c28169d034311d96b9589415bdaef06fd396ca"}, "author": "Robert Alexander Getty Images", "url": "https://www.cnbc.com/2018/01/03/southwest-and-american-airlines-to-pay-bonuses-after-tax-bill.html", "ord_in_thread": 0, "title": "Southwest and American airlines to pay bonuses after tax bill", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "southwest", "sentiment": "negative"}, {"name": "boeing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Southwest and American airlines to pay bonuses after tax bill Airlines are sharing some of their tax-law windfall with employees and Boeing. American and Southwest said they will pay employees bonuses of $1,000 each. Published 5 Hours Ago 22 Mins Ago | 00:40 \nAirlines are sharing some of their tax-law windfall with employees and Boeing , the big aircraft maker. \nAmerican and Southwest said Tuesday that they will pay employees bonuses of $1,000 each, a gesture that American said would cost $130 million. \nSouthwest also said that it exercised options to buy more new jets from Boeing while delaying orders for some others. \nUnlike most other U.S. airlines, Dallas-based Southwest has long been profitable and already pays cash income taxes. It earned $1.6 billion in the first nine months of 2017, and will benefit immediately from the lower rate on corporate income in the tax bill that President Donald Trump signed last month. \nSouthwest said it expects to record a non-cash credit of between $1 billion and $1.5 billion in the fourth quarter to reflect the difference in rates between the time the tax expenses were accrued and when they will be paid. \nBecause of huge losses in previous years, other major U.S. carriers do not pay cash income taxes even though they have become hugely profitable. American, for instance, earned $1.7 billion in the first nine months of last year. All the airlines should benefit, however, from a provision in the new law that lets businesses more quickly depreciate the cost of investments — aircraft, in their case. \nCEO Doug Parker and President Robert Isom said the new tax law will help American in the long run, presumably when it can no longer avoid income taxes by counting past losses. They said the tax changes will give the company more confidence to invest in planes and facilities and pay the employee bonuses. \nAmerican said employees at the main airline and its regional affiliates would get their money in the first quarter. Southwest said it will make payments next Monday. \nSouthwest also announced that it would exercise options on 40 Boeing 737 jets valued at $4.5 billion while delaying 23 previous orders with a sticker price of $2.1 billion by up to five years. Southwest did not disclose financial terms, but airlines routinely get large discounts from list prices. \nSouthwest also said that it will donate an extra $5 million to charities in 2018. A spokesman for the company said it paid out more than $25 million in cash, free tickets and other donations to charity in 2016, the last year for which final figures are available. \nIn a regulatory filing, Southwest also said it expects to record $105 million in fourth-quarter expenses because of the moves announced Tuesday and other items, including a legal settlement, which it did not describe. The result will be an increase of about 3.5 percentage points in the company's forecast of so-called unit expenses — the amount per seat that it costs to fly one mile. Related Securities ", "external_links": [], "published": "2018-01-03T13:27:00.000+02:00", "crawled": "2018-01-03T13:42:38.039+02:00", "highlightTitle": ""}