{"organizations": [], "uuid": "f57a8e4649103f0b993b24c71eca1ba57b7408c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226066697&w=1200&r=LYNXMPEE0R0QM", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-trade-nafta/canada-pm-opposition-wants-to-give-into-u-s-demands-on-nafta-idUKKBN1FH0QZ", "country": "US", "domain_rank": 408, "title": "U.S. lawmakers at NAFTA talks express optimism about modernizing trade pact", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T02:25:00.000+02:00", "replies_count": 0, "uuid": "f57a8e4649103f0b993b24c71eca1ba57b7408c8"}, "author": "", "url": "https://uk.reuters.com/article/us-trade-nafta/canada-pm-opposition-wants-to-give-into-u-s-demands-on-nafta-idUKKBN1FH0QZ", "ord_in_thread": 0, "title": "U.S. lawmakers at NAFTA talks express optimism about modernizing trade pact", "locations": [], "entities": {"persons": [{"name": "david lawder", "sentiment": "none"}, {"name": "dave reichert", "sentiment": "none"}, {"name": "david ljunggren", "sentiment": "none"}, {"name": "reichert", "sentiment": "none"}, {"name": "robert lighthizer", "sentiment": "none"}, {"name": "lighthizer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "min read  montreal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "house ways and means", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 4:27 PM / Updated 37 minutes ago U.S. lawmakers at NAFTA talks express optimism about modernizing trade pact David Lawder , David Ljunggren 4 Min Read \nMONTREAL (Reuters) - U.S. lawmakers attending NAFTA talks in Montreal expressed optimism on Sunday that efforts to update the trade pact would avoid collapse and start gaining momentum and said they urged negotiators not to bind themselves to a specific deadline. \n“There’s just an air of optimism,” said U.S. Representative Dave Reichert, a Republican who chairs the House Ways and Means trade subcommittee. He spoke to reporters after a briefing from U.S. Trade Representative Robert Lighthizer. \nReichert said Lighthizer was “hopeful” about the negotiations but also “recognizes that there’s a great deal of work to be done.” \nOfficials from the United States, Canada and Mexico will wrap up the sixth of seven planned rounds of talks on the North American Free Trade Agreement in Montreal on Monday, with little sign of agreement on the toughest U.S. proposals to overhaul the $1.2 trillion pact. \n“You can point to the fact that they’re already talking about additional rounds, where not too long ago, we were wondering whether or not there would be continued negotiations,” Reichert said. \nReichert led a delegation of 10 other Ways and Means members to Montreal to meet with negotiators from all three countries and express support for modernizing the trade agreement. \nSome trade-focused lawmakers have complained that USTR has not adequately informed them about U.S. proposals in the talks. Any deal for a NAFTA update will need Congress’ approval. \nU.S. President Donald Trump, who blames the 1994 treaty for job losses and a big trade deficit with Mexico, has repeatedly threatened to withdraw unless major changes are made. Markets have been nervous about the potential economic turmoil. \nWith the slow progress so far, Lighthizer, Canadian Foreign Minister Chrystia Freeland and Mexican Economy Minister Ildefonso Guajardo will meet in Montreal on Monday to review what has been achieved. \nThey are expected to announce that the anti-corruption chapter has been largely completed, along with progress on some other less controversial areas. FILE PHOTO: Flags are pictured during the fifth round of NAFTA talks involving the United States, Mexico and Canada, in Mexico City, Mexico, November 19, 2017. REUTERS/Edgard Garrido/File Photo \nBut a deep gulf remains over U.S. demands to boost regional auto content requirements and require 50 percent U.S. content in North American-built vehicles. Other major sticking points are Washington’s demands that NAFTA largely eliminate trade and investment dispute-settlement systems and contain a “sunset” clause to force renegotiations every five years. \nDemocratic Representative Sander Levin told reporters he was certain the United States would not quit the NAFTA talks. \nRepublican Representatives Adrian Smith added: “I‘m encouraged that we’re seeing things progress. We still need to get it across the finish line.” \nLighthizer could not be reached after the lawmakers spoke with reporters, and a USTR spokeswoman declined comment. Slideshow (3 Images) DEADLINE CONCERNS \nOfficials said that if the three countries conclude that negotiations should continue, an additional round of talks would start in Mexico on Feb. 26. \nThe talks are scheduled to finish by the end of March to avoid clashing with Mexico’s presidential election in July. Mexican officials now suggest the deadline could be extended. \n“We believe it’s more important to get a quality agreement than to tailor the negotiations to a strict time line,” said Reichert. \nA senior source close to the talks told reporters late on Saturday that “the United States needs to show flexibility” when it comes to its major proposed reforms to NAFTA. \n“Do we feel optimistic? I would say cautiously so,” added the source, who spoke on the condition of anonymity. \nEarlier on Sunday, Democratic Representative Bill Pascrell said that he did not believe that Mexican negotiators were serious enough about addressing labor problems that have kept Mexican wages too low. Additional reporting by Anthony Esposito in Montreal; Editing by Jeffrey Benkoe and Peter Cooney", "external_links": [], "published": "2018-01-29T02:25:00.000+02:00", "crawled": "2018-01-29T02:45:45.037+02:00", "highlightTitle": ""}