{"organizations": [], "uuid": "e90c8955081623dec7e8d89125be996507e3a99d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222387675&w=1200&r=LYNXMPEE0F0MP", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-eurozone-banks-ecb-auditors/flaws-in-ecb-supervision-of-failing-banks-eu-auditors-warn-idUSKBN1F513N", "country": "US", "domain_rank": 408, "title": "Flaws in ECB supervision of failing banks, EU auditors warn", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T12:30:00.000+02:00", "replies_count": 0, "uuid": "e90c8955081623dec7e8d89125be996507e3a99d"}, "author": "", "url": "https://www.reuters.com/article/us-eurozone-banks-ecb-auditors/flaws-in-ecb-supervision-of-failing-banks-eu-auditors-warn-idUSKBN1F513N", "ord_in_thread": 0, "title": "Flaws in ECB supervision of failing banks, EU auditors warn", "locations": [], "entities": {"persons": [{"name": "francesco guarascio", "sentiment": "none"}, {"name": "daniele nouy", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  brussels", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - The European Central Bank has “flaws” in its procedures for identifying and dealing with banks in crisis, European Union auditors said on Tuesday.\nThe European Court of Auditors, a European Union agency, cast doubt on the ECB’s supervision of the big banks in the euro zone and criticized the central bank’s reluctance to disclose relevant information. But it stopped short of saying the flaws could have an impact on the way an actual crisis was addressed.\nAfter the 2007-08 global financial crisis, the ECB has added to its monetary policy functions the task of supervising the top banks of the euro zone’s 19 countries. It oversees around 120 banks that hold over 80 percent of the bloc’s banking assets.\nThe ECB’s supervisory unit - the Single Supervisory Mechanism (SSM), chaired by French regulator Daniele Nouy - has sweeping powers to spot and tackle emerging troubles at individual banks. But it lacks sufficient guidelines to exercise those powers, EU auditors said in a report published on Tuesday.\n“The ECB’s operational framework for crisis management has some flaws and there are some signs of inefficient implementation,” the auditors said.\nIn their report, the auditors found “deficiencies” in the procedures the ECB use to identify potential banking troubles at an early stage and in how it would respond to a crisis. The ECB said some concerns raised by auditors had been addressed after the audit was concluded in June.\nThe SSM has dealt since it was established in 2014 with lingering troubles at euro zone banks caused by lower profits, an overcrowded market and a mass of bad loans, mostly in southern Europe.\nAuditors said the ECB would need to gather information quickly when a bank showed signs of distress, but it “has limited available on-site inspection teams to carry out a detailed analysis of asset quality for crisis banks.”\nThey also said the central bank had not developed proper guidance on how to assess emerging risks and use its powers in a crisis. The lack of guidance could allow an excessive discretion in taking key decisions.\n“The latest guidance, which was produced in September 2017, was not taken into account during the audit process and addresses the concerns raised by the ECA,” the ECB said in replies included in the ECA report.\nCRISIS RESPONSE Auditors also said the ECB lacked sufficient guidelines on the emergency procedure that is triggered when a bank is deemed “failing or likely to fail”. The ECB said it had already developed guidance on this matter and rejected the auditors’ recommendations on this point.\nThe procedure was used in the rescue of Spain’s Banco Popular in May, and led to the forced sale of Popular to rival Santander for one euro. Depositors and taxpayers were shielded in the process, but bondholders lost their investment and are suing EU regulators.\nIn a report released in December, auditors also raised concern about the preparation of the Single Resolution Board to deal with collapsing banks.\nThe SRB is the other EU agency that handles banking crises. It played a crucial role in the disposal of Banco Popular after the ECB declared the bank failing or likely to fail.\nThe ECA also criticized the ECB’s reluctance to disclose information that were needed for its audit.\n“The ECB refused to provide important evidence which the ECA had requested. This had a negative impact on the audit work,” auditors said in a press release.\nThe ECB said it had fully cooperated with auditors providing “a substantial number of documents and explanations,” but it said some information could not be shared with the ECA.\nAuditors said they had requested access to documents of five randomly selected banks in varying degrees of crisis, but the ECB gave them only “a limited selection of documents on three banks”. The information provided was also “heavily edited”, ECA said in its report.\nIn a report published in November 2016, the ECA also warned against possible conflicts of interest at the ECB over its supervision powers when it used the same staff to perform both monetary and supervisory functions.\nReporting by Francesco Guarascio, editing by Larry Kign\n ", "external_links": [], "published": "2018-01-16T12:30:00.000+02:00", "crawled": "2018-01-16T13:00:45.000+02:00", "highlightTitle": ""}