{"organizations": [], "uuid": "18b6e6be38d8fcd4de369ed59d86e3eed09b5fe6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940397-GettyImages-507065943.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/11/from-the-iot-to-bim-and-ddos-to-gdpr-breaking-down-technological-jargon.html", "country": "US", "domain_rank": 767, "title": "From the IoT to BIM and DDoS to GDPR: Breaking down technological jargon", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.101, "site_type": "news", "published": "2018-01-11T14:48:00.000+02:00", "replies_count": 0, "uuid": "18b6e6be38d8fcd4de369ed59d86e3eed09b5fe6"}, "author": "Anmar Frangoul", "url": "https://www.cnbc.com/2018/01/11/from-the-iot-to-bim-and-ddos-to-gdpr-breaking-down-technological-jargon.html", "ord_in_thread": 0, "title": "From the IoT to BIM and DDoS to GDPR: Breaking down technological jargon", "locations": [], "entities": {"persons": [{"name": "tesla", "sentiment": "none"}], "locations": [{"name": "waymo", "sentiment": "none"}], "organizations": [{"name": "alphabet", "sentiment": "none"}, {"name": "u.s. department of homeland security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The devices and systems we use seem to change or get updated on a daily basis.\nAs the world changes and our lives become increasingly interconnected, a range of new words and phrases are frequently added to the technological lexicon.\nHere's a few that have popped up during the course of \"IoT: Powering the Digital Economy.\"\nAutonomous vehicle A vehicle, such as a car or truck, that uses technology and sensors to drive without the need for human assistance.\nUber, Tesla and Alphabet — through its subsidiary Waymo — are just some of the big businesses working on self-driving technologies.\nBIM According to the Institution of Structural Engineers, Building Information Modeling, or BIM, is centered on utilizing digital tools \"to efficiently produce information\" in order to allow assets to be constructed, maintained and operated.\nBiometrics The U.S. Department of Homeland Security (DHS) describes biometrics as being \"unique physical characteristics\" that can be utilized for \"automated recognition.\" Think fingerprints, iris scans and voice recognition.\nThe applications of biometrics are diverse and wide ranging. Today, we can unlock our smartphones with our fingerprints and use our voices to gain access to sensitive information, such as our banking details.\nFor its part, the DHS says it uses biometrics to, among other things, \"detect and prevent illegal entry into the U.S.\" and enforce federal laws.\nBlockchain A tamper-proof, distributed digital ledger that records transactions. Instead of different parties in a transaction keeping their own records of that transaction — which could potentially differ and cause confusion — blockchain creates one \"master\" record. This cannot be changed once a transaction has been recorded. As technology giant IBM notes: \"All parties must give consensus before a new transaction is added to the network.\"\nDDoS Stands for Distributed Denial of Service. The U.K.'s National Crime Agency (NCA) says that DDoS attacks usually take place when a group of \"compromised, controlled computers\" send messages to a computer or server simultaneously. The messages are sent involuntarily, the NCA adds.\nGDPR: In the European Union, the General Data Protection Regulation will apply from May this year. It will update the 1995 Data Protection Directive, which was introduced at a time when the digital age was in its infancy, and will impact both citizens and businesses.\nAmong other things, the GDPR will boost people's right to be forgotten and guarantee free, easy access to their personal data. Organizations and businesses will also have to inform people about data breaches that could negatively impact them, and do this \"without undue delay.\" Relevant data protection supervisory authorities will also need to be told of any breaches.\nInternet of Things The European Commission describes the internet of things as merging \"physical and virtual worlds, creating smart environments.\"\nThink of devices that are connected to the internet and able to \"talk\" to one another. One example would be a thermostat in your home that you control with your smartphone from your office.\nSmartphone A cell phone that can connect to the internet, enabling users to carry out a host of tasks. These range from visiting websites and sending instant messages to taking photographs and carrying out financial transactions.\nFollow CNBC International on Twitter and Facebook .", "external_links": ["https://www.facebook.com/cnbcinternational", "https://twitter.com/cnbci"], "published": "2018-01-11T14:48:00.000+02:00", "crawled": "2018-01-11T14:50:30.004+02:00", "highlightTitle": ""}