{"organizations": [], "uuid": "75d27fb2c52b4f9dea39f7c037a7c2859e00c267", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-horizon-media-taps-4c-to-fuel-its-advanced-tv-platform-pivot-with-data-driven-audience-targeting.html", "country": "US", "domain_rank": 767, "title": "Horizon Media Taps 4C to Fuel its Advanced TV Platform, Pivot, with Data-Driven Audience Targeting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-09T17:00:00.000+02:00", "replies_count": 0, "uuid": "75d27fb2c52b4f9dea39f7c037a7c2859e00c267"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-horizon-media-taps-4c-to-fuel-its-advanced-tv-platform-pivot-with-data-driven-audience-targeting.html", "ord_in_thread": 0, "title": "Horizon Media Taps 4C to Fuel its Advanced TV Platform, Pivot, with Data-Driven Audience Targeting", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "horizon media", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 09, 2018 (GLOBE NEWSWIRE) -- Horizon Media, a global leader in data-driven media and marketing, continues to lead the way in the application of data science and audience targeting to advance linear television. Today, the agency is pleased to announce an agreement with 4C, a marketing technology company, which will deliver more value to its advanced TV platform, Pivot, while offering clients more precise data-driven audience targeting.\nPivot provides an advanced television solution for Horizon’s clients, addressing the need for more sophisticated targeting. The practice encompasses elements of programmatic, addressable, advanced targeting, and automated buying platforms to optimize media inventory efficiencies. Horizon will partner with 4C to develop a proprietary tool customized for the needs of its clients.\n4C offers a suite of advanced software tools for planning, buying and measurement across linear television. The agency will have the ability to integrate advanced data targets along with custom 4C data sets into the Pivot planning tool. This will drive efficiency in TV upfront planning, optimizing linear schedules, and scatter market buying. The 4C Insights Affinity Graph™ delivers a full picture of how people behave with each other, media and technology by mapping across 2 billion+ social media users, 200 million offline sales profiles, 7 million TV households, 50,000 brands, 2,200 TV channels, and 41 languages.\n“Partnering with 4C has enhanced Pivot to the next level, continuing to provide our clients with data-driven audience targeting going beyond standard age and gender buying demos and borrowing some elements from programmatic digital media,” said David Campanelli, EVP, Managing Partner, Video Investment, Horizon Media. “The platform allows our TV buyers to easily and intelligently find the right audiences for client campaigns with greater efficiency. Partnering with 4C allows us to leverage their tool to make this process smooth and seamless.”\n“Brands increasingly require the ability to target precise audiences across channels following the lead of digital marketing capabilities,” said Kevin Kearns, CRO of 4C. “4C answered this demand for the TV industry, giving buyers the ability to apply real human behavior in identifying their most valuable audiences. 4C is thrilled to work with forward-looking companies like Horizon to bring this offering to marketers as linear TV advertising only becomes more valuable in an era of unprecedented multi-screening.”\n“Today’s evolving media ecosystem and access to new data has provided new opportunities to invent better ways of doing things,” said Samantha Rose, VP, Director, Video Investment, Horizon Media. “The application and customization of Pivot is crucial, allowing our teams to make media investments more effectively and deliver more value to our clients. This new relationship with 4C will allow us to view the TV landscape under a clearer lens, balancing data science with the art of real world buying realities.”\nPivot is housed within Horizon’s integrated television innovation practice, HorizonAdvanced . The practice was launched in 2015 to spearhead innovation in the areas of advanced TV, programmatic TV, addressable and data-infused linear buying for its clients. The Horizon Advanced team is comprised of activation specialists and data analysts that help align the agency’s clients to efficiently take advantage of what data and intelligent automated activation has to offer traditional television activation. Horizon Advanced is responsible for evaluating, testing and utilizing existing data-infused and addressable offerings. The team is tasked with client and agency education, and the development and refinement of the agency’s proprietary tools, such as Pivot, to address the future of television activation.\nAbout Horizon Media\nHorizon Media , Inc. is a global leader in data-driven media and marketing. The company was founded in 1989, is headquartered in New York with offices in Los Angeles and Toronto. Recognized as one of the world’s ten most innovative marketing and advertising companies by Fast Company, Horizon Media has been recognized as U.S. Media Agency of the Year by Adweek and AdAge, and Independent Media Agency of the Year by Mediapost. Renowned for its incredible culture, Horizon is also consistently named to all the prestigious annual Best Places to Work lists published by Fortune, AdAge, Crain’s New York Business and Los Angeles Business Journal. Bill Koenigsberg served as the Chairman of the 4A’s Board of Directors from 2014 to 2017, and currently serves as Vice Chair of the 4A’s Board of Directors. Bill was the first person from a media agency to hold this prestigious position in the 100-year history of the 4As, the marketing industry’s leading trade association. Horizon Media has estimated billings of $8 billion and over 2,000 employees.\nABOUT 4C INSIGHTS\n4C is a global leader in data science and marketing technology with solutions for multi-screen marketing. Brands, agencies, and media owners rely on the 4C Insights Affinity Graph™ to identify their most valuable audiences and improve effectiveness across channels. With $1.7+ billion in annualized media spend running through its software-as-a-service platform, 4C offers activation on Apple News, Facebook, Instagram, LinkedIn, NBCUniversal, Pinterest, Snapchat, and Twitter as well as TV Synced Ads across display, search, social, and video. The company also provides paid, earned, and owned media analytics leveraging its Teletrax™ television monitoring network which detects over 400 million TV asset airings on an annual basis. Founded in 2011 and based in Chicago, 4C has staff in 16 worldwide locations across the United States, United Kingdom, the Netherlands, France, Hong Kong, India, Singapore, and the Philippines. Visit www.4Cinsights.com for more information.\nContact\nHorizon Media\nErin Schneider\n(310) 469-4901\neschneider@horizonmedia.com\n4C\nKari Brownsberger\n(937) 367-5665\nkari.brownsberger@4cinsights.com\nSource:Horizon Media Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/a7c57a32-244c-4a6c-9a3f-2243ab91ef16", "https://www.globenewswire.com/Tracker?data=wmtI5iy6AMD3dvweQKXEm86P7CJ85gVTSuK9lcV4xA2vck41ZoOs57VQl9rIMsCHNzEhceu4yh4MlAtdgm7Y3GKwpnDknPnTXp9-A6XIvo4=", "https://www.globenewswire.com/Tracker?data=CRL9WHWF2Fn9QKsGUz1KQq4n8ze2zAfFmQrklUO5IP8oM-jjtxRcPhitB19x_Q0nBLWVXndIptKj8reLoaMDOQ==", "https://www.globenewswire.com/Tracker?data=PoIHLWcQakfPI4GJtL-tOYhbQrsLNk1HWs8advIXpY-Sk4woQAFdE7OMBIeOPQ7-jQhwESyhRYxQbYhyRn2E8zkFopoy2pBcNcVYbb7IXoHJBLlPZJc23qQofo7hallh", "https://www.globenewswire.com/Tracker?data=w2wURlIyDsjs8mr5pTNj5UoBuZJj-hlV7BVFfYuw6CNSYcZNKPHuorfYeIR1sbtKcFx4Y0gMMIn4RDQtdx-ZAfnf3E9KK2_WLfUBmgqx6tZu0liuSxjXTosb8GO8mj4o"], "published": "2018-01-09T17:00:00.000+02:00", "crawled": "2018-01-09T19:03:51.045+02:00", "highlightTitle": ""}