{"organizations": [], "uuid": "1126849451c1ff3b4d65c13771b2cb2ebe56e1aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226264730&w=1200&r=LYNXMPEE0S0OG", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-germany-politics/german-coalition-negotiators-close-to-deal-on-refugees-spd-says-idUSKBN1FI13O", "country": "US", "domain_rank": 408, "title": "German coalition negotiators close to deal on refugees, SPD says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T12:45:00.000+02:00", "replies_count": 0, "uuid": "1126849451c1ff3b4d65c13771b2cb2ebe56e1aa"}, "author": "", "url": "https://www.reuters.com/article/us-germany-politics/german-coalition-negotiators-close-to-deal-on-refugees-spd-says-idUSKBN1FI13O", "ord_in_thread": 0, "title": "German coalition negotiators close to deal on refugees, SPD says", "locations": [], "entities": {"persons": [{"name": "dreyer", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "malu dreyer", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "spd", "sentiment": "negative"}, {"name": "deutschlandfunk", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 10:45 AM / in 40 minutes German coalition negotiators close to deal on refugees, SPD says Reuters Staff 3 Min Read \nBERLIN (Reuters) - German Chancellor Angela Merkel’s conservatives and the Social Democrats (SPD) are close to overcoming a major stumbling block in their talks to form a new coalition government, a senior SPD negotiator said on Monday. \nThe parties are trying to thrash out an agreement on the vexed issue of family reunions for asylum seekers allowed to stay in Germany, with some in the center-left SPD pushing for a more lenient approach. \nBut the conservatives are keen to present a tougher line on immigration issues to avoid losing more votes to the far-right Alternative for Germany (AfD), which surged into parliament for the first time after last September’s election. \nTalks on the family reunion issue broke off overnight without agreement, but Malu Dreyer, an SPD deputy leader, said the parties were in the “final stages” of clinching an accord. \nDreyer told Deutschlandfunk radio there was a will among the negotiators “that we really reach an agreement today”. \nMerkel, who failed to form a government in talks with two smaller parties late last year, needs the talks with the SPD to succeed in order to secure a fourth term as chancellor. \nHer conservative bloc and the SPD governed Germany, Europe’s biggest economy, over the previous four years from 2013 to 2017 in what is known as a ‘grand coalition’. That government took the decision in 2015 to take in more than a million migrants and refugees, many of them fleeing conflicts in the Middle East. \nOn the asylum seekers issue, the SPD and conservatives agreed in a blueprint this month to limit to 1,000 a month the number of people who can join immediate family members granted protection in Germany. \nBut the SPD is trying to refine the agreement on family reunions for some accepted asylum seekers. The conservatives have so far rejected demands by the SPD to raise that number by introducing a so-called “hardship” clause. \nDreyer said the negotiating parties also had unresolved differences on health insurance and employment policy. \n“But there we are also not miles away from a solution,” she added. Writing by Paul Carrel and Joseph Nasr; Editing by Gareth Jones", "external_links": [], "published": "2018-01-29T12:45:00.000+02:00", "crawled": "2018-01-29T12:56:21.000+02:00", "highlightTitle": ""}