{"organizations": [], "uuid": "6ad05159d886e0b940f0f078ccc84414e6bee9cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-10th-magnitude-acquires-northwest-cadence.html", "country": "US", "domain_rank": 767, "title": "10th Magnitude Acquires Northwest Cadence", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T02:22:00.000+02:00", "replies_count": 0, "uuid": "6ad05159d886e0b940f0f078ccc84414e6bee9cc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-10th-magnitude-acquires-northwest-cadence.html", "ord_in_thread": 0, "title": "10th Magnitude Acquires Northwest Cadence", "locations": [], "entities": {"persons": [{"name": "alex brown", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "northwest cadence", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "analytics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 10, 2018 /PRNewswire/ -- 10 th Magnitude, the leading U.S. Microsoft Azure services firm and Microsoft's 2017 Hybrid Cloud and Infrastructure Partner of the Year, announced today that it has acquired Northwest Cadence, a Seattle-based Microsoft consultancy providing industry leading DevOps, Analytics, and Artificial Intelligence (AI) services on the Microsoft cloud.\n\"We are excited to add Northwest Cadence's world class team and top-notch skill set to our rapidly growing organization. Their DevOps and Analytics capabilities accelerate and deepen the complete managed platform of transformed and automated infrastructure, applications, and data that 10 th Magnitude already provides for enterprise customers,\" said Alex Brown founder and CEO of 10 th Magnitude. \"Customers are embracing Microsoft Azure as their digital transformation enablement platform of choice at a staggering pace. Northwest Cadence's capabilities, expertise at guiding customers to true transformation, and reputation for quality perfectly complements—as well as enhances—our ability to deliver the cloud transformed platform our customers demand.\"\n10 th Magnitude's acquisition of Northwest Cadence:\nDeepens 10 th Magnitude's DevOps capabilities , enhancing their Datacenter Transformation, Cloud Automation and App Modernization teams Expands 10 th Magnitude's capacity to deliver innovative Data Analytics and AI solutions to customers Complements 10 th Magnitude's 10vū™ digital transformation planning solution set to now include application layer opportunities Extends 10 th Magnitude's managed services portfolio to include DevOps management Establishes 10 th Magnitude as a nationwide provider by expanding geographic presence to the West Coast with Northwest Cadence's Seattle-based organization\n\"No one understands the entire customer digital transformation journey to Microsoft Azure like 10 th Magnitude, and Northwest Cadence's expertise in Applications, DevOps, and AI on the Microsoft platform aligns precisely with high value opportunities along that path,\" said Lori Borg, founder and CEO of Northwest Cadence. \"This combination will both provide our customers with the expertise needed to accelerate their investment and return with Azure, and offer our employees unlimited opportunities for growth.\"\nWith the completion of this acquisition, Northwest Cadence founders and visionaries Lori and Steven Borg will join the 10 th Magnitude Executive Leadership team. Lori becomes the VP of Marketing for 10 th Magnitude, evangelizing the message of the fully transformed agile enterprise to the marketplace. Steven becomes the VP of the 10 th Magnitude Innovation Institute, where he will build the vision, technology, and solutions to enable 10 th Magnitude customers to achieve the vast levels of agility and innovation that Azure promises.\n\"Our new team is going to have amazing opportunities to deliver ground breaking work for a wonderful roster of customers,\" said Steven Borg, Founder and Strategist. \"I couldn't be more excited to join this amazing organization and have the opportunity to build the most innovative and comprehensive cloud and digital transformation platform in the Microsoft ecosystem.\"\nAbout 10 th Magnitude\n10 th Magnitude helps businesses transform with innovative, cloud-based solutions that harness the power of Microsoft Azure. The company combines elements from multiple deep cloud competencies, as well as the most efficient and innovative technology tools and platforms to help clients become more agile, more customer-focused and more operationally efficient. A Microsoft Gold Cloud Platform Partner and the 2017 Microsoft Hybrid Cloud and Infrastructure Platform Partner of the Year, 10 th Magnitude is headquartered in Chicago with offices in New York City, Dallas, Tulsa, and now Seattle. Our clients span the globe.\nAbout Northwest Cadence\nNorthwest Cadence helps software delivery teams tap into the power of modernization, cloud integration, and data analytics to create streamlined, scalable, and smart applications. Microsoft's first Gold DevOps partner in the United States, Northwest Cadence has been helping software delivery teams ship great software that is built with solid DevOps practices and processes, modernized through the cloud, and transformed with machine learning and artificial intelligence. Serving software delivery teams for over a decade, Northwest Cadence is headquartered in Kirkland, Washington.\nContact\nJason Rook\nVP of Market Development\n10 th Magnitude\njrook@10thmagnitude.com\n312.281.7159\nView original content with multimedia: http://www.prnewswire.com/news-releases/10th-magnitude-acquires-northwest-cadence-300581137.html\nSOURCE 10th Magnitude", "external_links": ["http://www.prnewswire.com/news-releases/10th-magnitude-acquires-northwest-cadence-300581137.html"], "published": "2018-01-11T02:22:00.000+02:00", "crawled": "2018-01-11T05:01:45.016+02:00", "highlightTitle": ""}