{"organizations": [], "uuid": "3caf7c6ffe5911a6cabfa76b117c6c20f6491788", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225959133&w=1200&r=LYNXMPEE0R04E", "site_section": "http://www.reuters.com/resources/archive/us/20180128.html", "section_title": "Archive News &amp; Video for Sunday, 28 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/india-nifty-sensex-weekahead/india-markets-weekahead-all-eyes-on-the-budget-idUSKBN1FH052", "country": "US", "domain_rank": 408, "title": "India Markets Weekahead: All eyes on the budget", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T15:00:00.000+02:00", "replies_count": 0, "uuid": "3caf7c6ffe5911a6cabfa76b117c6c20f6491788"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/india-nifty-sensex-weekahead/india-markets-weekahead-all-eyes-on-the-budget-idUSKBN1FH052", "ord_in_thread": 0, "title": "India Markets Weekahead: All eyes on the budget", "locations": [], "entities": {"persons": [], "locations": [{"name": "india", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "axis bank", "sentiment": "none"}, {"name": "wipro", "sentiment": "none"}, {"name": "biocon", "sentiment": "none"}, {"name": "union budget", "sentiment": "none"}, {"name": "pnb housing", "sentiment": "none"}, {"name": "imf", "sentiment": "none"}, {"name": "indiabulls housing", "sentiment": "none"}, {"name": "reliance industries", "sentiment": "none"}, {"name": "hdfc bank", "sentiment": "none"}, {"name": "indiabulls real estate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Nifty and Sensex scaled significant landmarks of 11,000 and 36,000 levels respectively during the week as unabated fund inflows continued amid robust corporate earnings and optimism over the upcoming Union Budget on February 1.\nThe momentum was further fuelled by the IMF’s projection that India could emerge as the fastest-growing major economy in the world in 2018 at 7.4 percent. Sentiment was also boosted by hopes that the government could meet its fiscal deficit target after it announced generating 370 billion rupees ($5.8 billion) through a stake sale in a petroleum refinery.\nOn the currency front, the rupee ended at a one-week high of 63.54 on Thursday as the dollar stumbled to a fresh three-year low. Brent oil jumped to $71 per barrel as the dollar continued to weaken and crude inventories in the U.S. fell for a 10th straight week.\nMeanwhile, the results season saw key companies like Reliance Industries, HDFC Bank, Axis Bank, PNB Housing, Indiabulls Housing, Indiabulls Real Estate and Asian Paints meet estimates, while Biocon and Wipro reported lower-than-expected numbers.\nOn the stock specific front, ONGC gained 7 percent after its board approved acquisition of the entire 51.11 percent of the government’s stake in HPCL. ONGC will now control over 40 mmt of refinery and over 14,700 retail outlets.\nIT stocks, which underperformed the broader markets in 2017, have joined the rally as optimism about global economic growth, tech spending and third-quarter earnings of some IT companies have lifted sentiment.\nThe government released recapitalisation plans for PSU banks during the week while deferring a decision on a road-map for consolidation in the banking sector. The finance minister announced that the government will infuse 881.39 billion rupees ($12.62 billion) into PSU banks, but their shares turned weak as the amount was below market expectation.\nThe coming week will be action-packed for stock markets as the government unveils the Union Budget. The week will also see prominent companies like L&T, ICICI Bank, HDFC, Dabur, Tech Mahindra, Bajaj Auto, Hindalco, NTPC, IOC, JSW Steel, Ashok Leyland and Vedanta release their quarterly earnings.\nIn addition, a series of macro-economic data will also be out - fiscal deficit, eight infrastructure industries data and annual GDP estimates are scheduled to be announced on January 31, while January Nikkei India PMI manufacturing data will be announced on February 2. Monthly automobile sales numbers will start flowing in from February 1.\nOn the global front, the U.S. Federal Reserve holds its next two-day monetary policy meet on Tuesday and Wednesday, followed by the monthly U.S. jobs report on Friday. The Fed had raised interest rates by 25 bps in December, and is not expected to make any substantive changes this time. However, the central bank’s comments and outlook will likely set the tone for monetary policy going forward into 2018.\nThursday’s budget, the last before India’s general election in 2019, will be crucial for the government as it faces various challenges - from the impact of the rollout of a national goods and services tax to the plight of farmers and increasing rate of inflation. In parliament, opposition parties may also raise the issue of law and order in the country due to the controversy over the film “Padmaavat”.\nThe government is expected to prioritise rural spending in the budget given that rural distress entails political costs. Thus, MGNREGA, rural roads, rural housing and irrigation may get higher allocations, while infrastructure spending will be pushed through off-budget sources. No changes in indirect taxes are expected as the GST Council decides on rates now, and corporate tax cuts are also unlikely given fiscal pressure. However, some relaxation in individual income tax slabs or tax rate is expected in order to boost urban disposable incomes.\nThe markets seem to be in a distribution phase with the Nifty continuing to hold up while mid-cap and small-cap stocks are under pressure. It’s still unclear whether the budget will act as the trigger for a further rally.\nAbout the Author Ambareesh Baliga has about 25 years of experience in the stock market and has worked with Karvy and Kotak groups in the past. He is a regular market commentator on various business channels. He is a commerce graduate from Calcutta University and a qualified cost accountant.\nThe views expressed in this article are not those of Reuters News.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-28T15:00:00.000+02:00", "crawled": "2018-01-29T21:54:04.002+02:00", "highlightTitle": ""}