{"organizations": [], "uuid": "2b9619a4b60cb68f339cc604835ab08310380fbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 10}, "facebook": {"likes": 39, "shares": 39, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/29/104741303-IMG_8456r-jim-cramer.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/cramer-remix-the-115-year-old-3m-is-still-getting-it-right.html", "country": "US", "domain_rank": 767, "title": "Cramer Remix: The 115-year-old 3M is still getting it right", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.799, "site_type": "news", "published": "2018-01-27T02:00:00.000+02:00", "replies_count": 0, "uuid": "2b9619a4b60cb68f339cc604835ab08310380fbe"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/26/cramer-remix-the-115-year-old-3m-is-still-getting-it-right.html", "ord_in_thread": 0, "title": "Cramer Remix: The 115-year-old 3M is still getting it right", "locations": [], "entities": {"persons": [{"name": "jim cramer", "sentiment": "negative"}, {"name": "cramer", "sentiment": "none"}, {"name": "rob tringali", "sentiment": "none"}], "locations": [{"name": "england patri", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "minnesota mining & manufacturing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "15 Hours Ago | 01:03 \nWhen CNBC's Jim Cramer wants to remind himself what a fabulous quarter looks like, he goes back to the earnings reports from manufacturing colossus 3M . \n\"Every earnings season, 3M, the old Minnesota Mining & Manufacturing, puts on a clinic, showing you exactly how it's done,\" the \" Mad Money \" host said. \"3M gives you everything you could ever want from a publicly-traded company.\" \nAn 115-year-old company, 3M focuses heavily on research and development, with 30 percent of its sales coming from products that didn't exist just five years ago. \nBut while its innovation tends to confuse analysts, Cramer remembers when his Pop used to work as a sales representative for the company. Thanks to 3M, Pop constantly got new products to market and sell to his clients. \n\"That was 55 years ago,\" Cramer said. \"All I can say is that 3M is constantly giving the Pops of the world all kinds of new product to make a call or a sale on. It worked then. It's still working now.\" Cramer's game plan for the Super Bowl of earnings Rob Tringali | SportsChrome | Getty Images New England Patriots will face off against the Philadelphia Eagles in 2018 Super Bowl. \nThis year, the week of the Super Bowl coincides with the week of the Super Earnings Bowl for Cramer. \n\"Even as President Trump made the pitch for doing business in America at Davos , it's the earnings that are front and center,\" the \"Mad Money\" host said. \nWithout further ado, Cramer turned to the stocks and events he'll watch in one of the most eventful weeks of earnings season, with Facebook , Amazon , Alphabet , Apple and others set to report. The market's other FANG Jeyhun Abdulla | Bloomberg | Getty Images Crude oil and water pour from a well head at an oil field. \nWith a weak dollar pushing oil prices higher than they've been in months, Cramer checked in on one oil stock that has become the trade of the town on Wall Street. \n\"As the price of crude has come roaring back to the mid-$60s ... thanks to surging worldwide demand and instability in major petroleum-producing countries like Nigeria and the failed state of Venezuela, Diamondback [Energy] has become one of the hottest stocks around,\" Cramer said. \nTrading under the ticker symbol FANG, Diamondback's stock has climbed 57 percent since its lows in the fall of 2017, nearly doubling over the last two years. \nBut its recent positive action made Cramer wonder if Diamondback was truly deserving of Wall Street's accolades, or if the oil play would soon run out of juice. Esports goes to college Scott Mlyn | CNBC Mark Deppe, UC Irvine \nWhen Mark Deppe, the acting director for University of California, Irvine's esports program, thinks of esports, he doesn't think of traditional sports games like NBA 2K. \nIt may sound ironic, but compared to high-profile competition games like Overwatch and League of Legends, Take-Two Interactive's basketball-themed series doesn't stack up, Deppe told CNBC. \n\"I'm a little less bullish on the NBA games just because, one, the viewership's not there right now. It's probably the 50th or 60th most-watched esport,\" Deppe told Cramer. \"And ... it has to be a balanced game, a fair game going into it, so they actually take out the actual players and their faces and their names, and so you're essentially playing with kind of nameless avatars.\" \nDeppe, whom Cramer dubbed \"chief gaming officer,\" helped develop UCI's esports program in 2015. The move made UCI the first public university to offer an official program for esports. \nIn his interview with Cramer, the esports chief flagged one obstacle for big-name organizations like the NCAA that are interested in entering the space. Lam Research CEO on 'technology inflection' \nSome investors and market-watchers may hesitate to embrace the rapidly changing and increasingly connected global landscape, but not Lam Research President and CEO Martin Anstice. \n\"I think it's perhaps the natural consequence of the time it takes to process and internalize the scale of this technology inflection in the broader economy,\" Anstice told Cramer. \"The reality is there is an extraordinary inflection occurring.\" \nAnstice, whose company manufactures equipment that makes semiconductor chips for powerful electronic devices such as smartphones and high-power computers, is at the center of this sea change. \n\"The world in every respect – every segment of the economy, every aspect of our lives – is being influenced by this roadmap of innovation in applications,\" the CEO said. \"Historically, our industry would dialogue around units, units of cellphones, units of PCs. That is still relevant, but nowhere close to the relevance today that was true previously. Today it's about content. Cellphone growth: single digits. Content growth in cellphone: 50 percent per year for the last couple of years and forecast again this year.\" Lightning round: Go with best of breed \nIn Cramer's lightning round, he flew through his take on some callers' favorite stocks: \nAllscripts Healthcare Solutions Inc. : \"Look, the company's a slow grower. I'm not a big fan. In that segment I like UnitedHealth and I like Centene and I don't need to go any deeper than that.\" \nAK Steel Holding Corporation : \"No. I don't want to be in a second-tier steel company when I can buy Nucor at a discount. And Nucor reports next week and I think the actual number's going to be OK this time.\" \nDisclosure: Cramer's charitable trust owns shares of Facebook, Alphabet, Apple and Nucor. \nQuestions for Cramer?", "external_links": [], "published": "2018-01-27T02:00:00.000+02:00", "crawled": "2018-01-27T02:11:22.005+02:00", "highlightTitle": ""}