{"organizations": [], "uuid": "e4fc1676766c356938450f0f17ac028efeeb5dde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/nordics-highyield/nordic-junk-bonds-in-high-demand-after-record-2017-credit-analysts-idUSL8N1PH3CV", "country": "US", "domain_rank": 408, "title": "Nordic junk bonds in high demand after record 2017 -credit analysts", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:31:00.000+02:00", "replies_count": 0, "uuid": "e4fc1676766c356938450f0f17ac028efeeb5dde"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/nordics-highyield/nordic-junk-bonds-in-high-demand-after-record-2017-credit-analysts-idUSL8N1PH3CV", "ord_in_thread": 0, "title": "Nordic junk bonds in high demand after record 2017 -credit analysts", "locations": [], "entities": {"persons": [{"name": "magnus vie sundal", "sentiment": "none"}, {"name": "henrik stolen oslo", "sentiment": "none"}], "locations": [], "organizations": [{"name": "dnb", "sentiment": "negative"}, {"name": "danske bank", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* DNB sees 2018 Nordic high-yield issues NOK 100 bln-120 bln\n* Danske Bank expects growing volumes from oil service\nBy Henrik Stolen\nOSLO, Jan 25 (Reuters) - Demand for Nordic high-yield bonds remains strong this year and could allow companies in the region to raise enough money to rival last year’s record, Norwegian credit analysts said.\nIn 2017, Nordic firms sold junk bonds equivalent to 121.5 billion Norwegian crowns ($15.43 billion), with Swedish real estate firms and Norwegian shipping companies among the leading issuers.\n“One should not be surprised if we reach similar levels in 2018 as in 2017. If I were to make a qualified guess, I would say 100 billion to 120 billion crowns, betting on a really strong first half of the year and a somewhat more quiet second half,” DNB Markets credit strategist Magnus Vie Sundal said.\nHe estimated that refinancing purposes alone would account for about 75 billion crowns in 2018.\nOil service firms, most of which were shut out of the bond market as the price of crude slumped from 2014, could again issue debt as the price of oil has partly recovered, said Haseeb Syed, Danske Bank’s head of credit research in Norway.\n“Closer to 30 percent of volumes maturing in 2018 in Norway are from non-distressed oil service companies. There could be quite a bit of volumes from these companies,” he said, adding that high-yield investors have regained trust in the industry.\nNorwegian oil service firm Aker Solutions and its top owner, industrial holding company Aker ASA, were among the first in the region issuing high-yield bonds this year, both substantially oversubscribed.\n“We have seen solid investor interest and achieved competitive terms that reflect Aker Solutions’ strong credit position,” Chief Financial Officer Svein Stoknes said after completing a 1.5 billion crowns issue earlier this month.\nSo far in 2018, companies have issued Nordic high yield bonds worth about 10.7 billion crowns, compared to around 3.5 billion crowns issued at the same time last year, data from DNB Markets showed.\nDanske Bank’s Syed predicted a steady flow of new deals throughout 2018, but did not provide a full-year forecast. ($1 = 7.8728 Norwegian crowns) (Editing by Terje Solsvik)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T13:31:00.000+02:00", "crawled": "2018-01-26T21:23:52.010+02:00", "highlightTitle": ""}