{"organizations": [], "uuid": "295ffd28a1e03946b172b29f44af047bdd9ffe4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/05/reuters-america-analysis-in-test-for-powell-internal-groundswell-grows-to-rethink-feds-inflation-approach.html", "country": "US", "domain_rank": 767, "title": "ANALYSIS-In test for Powell, internal groundswell grows to rethink Fed's inflation approach", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T00:33:00.000+02:00", "replies_count": 0, "uuid": "295ffd28a1e03946b172b29f44af047bdd9ffe4f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/reuters-america-analysis-in-test-for-powell-internal-groundswell-grows-to-rethink-feds-inflation-approach.html", "ord_in_thread": 0, "title": "ANALYSIS-In test for Powell, internal groundswell grows to rethink Fed's inflation approach", "locations": [], "entities": {"persons": [{"name": "powell", "sentiment": "negative"}, {"name": "jerome powell", "sentiment": "none"}, {"name": "charles evans", "sentiment": "none"}, {"name": "john williams", "sentiment": "none"}, {"name": "janet yellen", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fed", "sentiment": "negative"}, {"name": "congressional", "sentiment": "none"}, {"name": "san francisco fed", "sentiment": "none"}, {"name": "chicago fed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "inflation approach@\nPHILADELPHIA, Jan 5 (Reuters) - Pressure is building within the Federal Reserve for incoming Chairman Jerome Powell to consider a new strategy for raising U.S. inflation after more than five years of weakness that has baffled the central bank.\nThree Fed policymakers added their voices this week to what is now a majority of regional Fed bank presidents urging, at the least, further study of alternatives to the current regime that targets a 2 percent inflation rate. Two others, Chicago Fed President Charles Evans and John Williams of the San Francisco Fed, last year sparked renewed debate on the issue and went so far as to urge changes.\nThe internal groundswell comes a month before Powell is set to succeed Chair Janet Yellen in February, and poses an early leadership test that could rewrite the Fed's play book for how it characterizes and approaches its Congressional mandate to keep inflation low and steady.\nThe Fed currently has a simple inflation target, setting policy to keep annual inflation at 2 percent regardless of past performance. After years of falling short of this goal, the regional Fed bank heads are arguing that the time is right to consider more dynamic strategies.\nOne alternative, price-level targeting, would attempt to make up for years in which inflation is below or above two percent by over- or under-shooting that goal for a time. A related method targets gross domestic product at its overall or \"nominal\" level, before it is adjusted for inflation, and also promises to make up for lost ground with higher, inflation-fueled growth, in the future.\nIn the current situation, the recent years of missing inflation would be offset by lower-than-expected interest rates and higher-than-normal inflation until the overall price level is back where it would have been if annual inflation had averaged two percent annually.\nThe method in theory keeps output on a steady course over the long run, but carries risks as the Fed tries to convince investors and the public that higher inflation is only temporary, and under the central bank's control.\n\"We are not ready to snap our fingers and do it,\" St. Louis Fed President James Bullard, who has often written about such level-targeting regimes in the past, said in an interview on Thursday in which he joined the growing call for a broad review. \"It would take quite a few years (but) at a minimum you should ask\" if the benefits are worth it.\nOn Friday Cleveland Fed President Loretta Mester and Philadelphia Fed President Patrick Harker also called for the Powell Fed to open a broad discussion.\n\"I think he knows that there are these open issues that we need to think deeply about,\" Mester said of the incoming chair.\nDallas Fed President Robert Kaplan and Atlanta Fed President Raphael Bostic round out the majority of the Fed's 12 district presidents who have called for changes or urged study of the inflation framework. That call has gained steam since the Fed's Oct. 31-Nov. 1 policy meeting, the minutes of which indicate that two members - likely Evans and Williams - suggested the Fed consider a system in which it committed to allowing higher inflation to make up for periods of low price rises.\nThe central bank's preferred core inflation measure largely has fallen short of 2 percent since it set its goal six years ago. Nonetheless it has raised rates five times in just over two years in a nod to strong employment, which is the Fed's other mandate.\nProponents say a healthy and growing economy warrants a steady \"normalization\" of monetary policy. Opponents warn the Fed is raising rates needlessly, and sending the wrong signal with inflation still so weak.\nThe discussion has moved to the point where policymakers have begun putting numbers around what different regimes might have meant had they been in place. Bullard said that between 1995 and 2012 the Fed essentially maintained a price level target consistent with an annual 2 percent inflation rate. But since then a gap has emerged that now amounts to about 4.6 percent of nominal gross domestic product, a sizeable amount.\nWhile Yellen said in December that the inflation target was not currently up for discussion, it is unclear where Powell, a Fed governor of five years, stands.\nRecently released transcripts show Powell open to the opinions of others, and those who know him say one of his strengths is his open-mindedness. But as a non-economist he may also be hesitant to open, and have to moderate, a broad and politically controversial debate that would delve deep into monetary policy theory and navigate complex problems of statistical estimation.\nLevel-targeting regimes, in promising to \"make up\" for lost ground, rest on assessing the size of past shortfalls. This could lead the Fed to tolerate excessive inflation, for example, if it relies on the frequently revised estimates of gross domestic product as part of its targeting system.\nThe U.S. would be the first major central bank to try such a system, and Mester, while open to the discussion, also pointed out several of the pitfalls.\n\"None of these alternative frameworks are without challenges and we will need to evaluate whether the net benefits of any of the alternatives would outweigh,\" the current system, she said. (Reporting by Jonathan Spicer and Howard Schneider; Additional reporting by Ann Saphir Editing by Chizu Nomiyama)", "external_links": [], "published": "2018-01-06T00:33:00.000+02:00", "crawled": "2018-01-06T03:30:23.007+02:00", "highlightTitle": ""}