{"organizations": [], "uuid": "4d6a85bcdf85a128c29fea249d8e7bbe9e896cfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/09/reuters-america-update-2-fbi-chief-calls-unbreakable-encryption-urgent-public-safety-issue.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-FBI chief calls unbreakable encryption 'urgent public safety issue'", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:47:00.000+02:00", "replies_count": 0, "uuid": "4d6a85bcdf85a128c29fea249d8e7bbe9e896cfe"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/reuters-america-update-2-fbi-chief-calls-unbreakable-encryption-urgent-public-safety-issue.html", "ord_in_thread": 0, "title": "UPDATE 2-FBI chief calls unbreakable encryption 'urgent public safety issue'", "locations": [], "entities": {"persons": [{"name": "christopher wray", "sentiment": "none"}, {"name": "wray", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "federal bureau of investigation", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds political context, additional material throughout, paragraphs 5-9)\nNEW YORK, Jan 9 (Reuters) - The inability of law enforcement authorities to access data from electronic devices due to powerful encryption is an \"urgent public safety issue,\" FBI Director Christopher Wray said on Tuesday as he sought to renew a contentious debate over privacy and security.\nThe Federal Bureau of Investigation was unable to access data from nearly 7,800 devices in the fiscal year that ended Sept. 30 with technical tools despite possessing proper legal authority to pry them open, a growing figure that impacts every area of the agency's work, Wray said during a speech at a cyber security conference in New York.\nThe FBI has been unable to access data in more than half of the devices that it tried to unlock due to encryption, Wray added.\n\"This is an urgent public safety issue,\" Wray added, while saying that a solution is \"not so clear cut.\"\nTechnology companies and many digital security experts have said that the FBI's attempts to require that devices allow investigators a way to access a criminal suspect's cellphone would harm internet security and empower malicious hackers. U.S. lawmakers, meanwhile, have expressed little interest in pursuing legislation to require companies to create products whose contents are accessible to authorities who obtain a warrant.\nWray's comments at the International Conference on Cyber Security were his most extensive yet as FBI director about the so-called Going Dark problem, which his agency and local law enforcement authorities for years have said bedevils countless investigations. Wray took over as FBI chief in August.\nThe FBI supports strong encryption and information security broadly, Wray said, but described the current status quo as untenable.\n\"We face an enormous and increasing number of cases that rely heavily, if not exclusively, on electronic evidence,\" Wray told an audience of FBI agents, international law enforcement representatives and private sector cyber professionals. A solution requires \"significant innovation,\" Wray said, \"but I just do not buy the claim that it is impossible.\"\nWray's remarks echoed those of his predecessor, James Comey, who before being fired by President Donald Trump in May frequently spoke about the dangers of unbreakable encryption.\nTech companies and many cyber security experts have said that any measure ensuring that law enforcement authorities are able to access data from encrypted products would weaken cyber security for everyone.\nU.S. officials have said that default encryption settings on cellphones and other devices hinder their ability to collect evidence needed to pursue criminals.\nThe matter came to a head in 2016 when the Justice Department tried unsuccessfully to force Apple Inc to break into an iPhone used by a gunman during a mass shooting in San Bernardino, California.\nThe Trump administration at times has taken a tougher stance on the issue than former President Barack Obama's administration. U.S. Deputy Attorney General Rod Rosenstein in October chastised technology companies for building strongly encrypted products, suggesting Silicon Valley is more willing to comply with foreign government demands for data than those made by their home country.\n(Reporting by Dustin Volz; Editing by Will Dunham)", "external_links": [], "published": "2018-01-09T18:47:00.000+02:00", "crawled": "2018-01-09T20:07:54.012+02:00", "highlightTitle": ""}