{"organizations": [], "uuid": "d93f96ba686107855605c377022f8fba5565be1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/safrica-renewables-solar/feature-solar-steam-powers-homes-and-new-jobs-in-south-africa-idUSL8N1P54O4", "country": "US", "domain_rank": 408, "title": "CORRECTED-FEATURE-Solar steam powers homes – and new jobs – in South Africa", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-11T11:05:00.000+02:00", "replies_count": 0, "uuid": "d93f96ba686107855605c377022f8fba5565be1e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/safrica-renewables-solar/feature-solar-steam-powers-homes-and-new-jobs-in-south-africa-idUSL8N1P54O4", "ord_in_thread": 0, "title": "CORRECTED-FEATURE-Solar steam powers homes – and new jobs – in South Africa", "locations": [], "entities": {"persons": [{"name": "munyaradzi makoni", "sentiment": "negative"}, {"name": "thomson reut", "sentiment": "negative"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "northern cape province", "sentiment": "none"}, {"name": "bonn", "sentiment": "none"}], "organizations": [{"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Updates jobs figures and clarifies technology)\nBy Munyaradzi Makoni\nCAPE TOWN, Jan 11 (Thomson Reuters Foundation) - South Africa may still get most of its energy from coal, but in the country’s sunny Northern Cape province, a different electricity source is taking hold: solar steam.\nA Spanish renewable energy company has opened three thermal solar plants – which use the sun’s heat to create electricity - in the province.\nThe plants - which use sun-heated salt to drive turbines - produce enough electricity to provide power to just short of a million people, or almost the province’s entire population, according its operators.\nThat represents an important shift in a country that suffered power shortages as recently as 2015, but that now has excess power to sell to neighbouring southern African countries.\nJust as important, the plants have provided new jobs in a province with one of the highest youth unemployment rates in the country, at more than 40 percent, according to U.N. officials.\nThey recognised the clean-energy project at climate change talks in Bonn in November as a creative model for bringing scarce private cash into renewable energy projects in Africa.\nThe first solar steam plant – KaXu Solar One, opened in 2015 in Pofadder – provided about 80 new permanent jobs, and about 1,700 temporary jobs, according to Sarah Marchildon, a spokeswoman for the U.N. climate change secretariat’s Momentum for Change initiative.\nThe other two plants, including Xina Solar One, completed last year in Uppington, on the banks of the Orange River, have created another 45 permanent and 1,300 temporary jobs, she said.\n“The region is now benefiting from stable, clean energy, and we are happy to have played a role in helping to solve South Africa’s electricity needs and improving the nation’s sustainability and energy security,” said Gerardo Rodriguez Pagano, the general director of Abengoa South Africa, which developed the plants.\nMORE POWER, FEWER EMISSIONS The power plants – jointly owned by Abengoa Solar, the government’s Industrial Development Corporation and a community trust – are part of South Africa’s push to cut its climate changing emissions by 2030, in line with its promises under the 2015 Paris Agreement.\nIn 2011, the government announced plans for 28 renewable energy projects around the country.\nThe solar thermal technology is generally a more expensive way to produce clean energy than traditional wind or solar-panel energy, said Kruskaia Sierra-Escalante, a finance manager with the International Finance Corporation, a World Bank group organisation that provided part of the funding for the project.\nBut it produces a more stable and predictable supply of power as sun-tracking mirrors concentrate the sun’s rays to heat salt, which is then used to produce steam that powers turbines to produce electricity.\nEnergy can be stored both in molten salt and as electricity in batteries, something crucial to building a reliable power grid, Sierra-Escalante said.\nThe World Bank came under huge criticism in 2010 when it agreed to provide a $3 billion loan to help South Africa build Medupi, one of the world’s largest coal-fired power plants, as world leaders were trying to seal a global deal to curb climate change.\nThe World Bank has since agreed, in 2013, that it would finance coal plants only in unusual circumstances, when there are no reasonable alternatives to meet basic energy needs.\nMORE CASH FOR CLEAN ENERGY The solar project, with its mix of public and private finance, is seen as a model for helping boost large-scale clean energy projects in Africa.\n“By involving private sector funds to begin operating in an emerging market, the KaXu Solar One project is an innovative and transformative financial solution that addresses climate change,” Marchildon said.\n“Leveraging private sector finance has proven to be a major obstacle for the funding of renewable energy projects in emerging economies,” she told the Thomson Reuters Foundation.\nUp-front costs to build large-scale solar plants are significant, and international investors can be hesitant to jump into developing markets, she said.\nBut solar projects, once put in place, have lower operating costs, she said, which can be a draw for investors.\n“KaXu has helped to unlock the South African concentrated solar power plant market, attract financiers, and drive down costs,” Marchildon said.\nIt is now ”the first operational private-sector utility-scale concentrated solar power plant project in South Africa - and in the developing world,” she said.\nPagano, of Abengoa South Africa, said the Northern Cape’s sunny conditions – the best in the country – were the reason to put the first solar thermal plants there, but the company would be open to looking at replicating the plants in other areas of South Africa.\n“We are more than willing to participate in new projects in the country if the conditions allow it,” he said. (Reporting by Munyaradzi Makoni; editing by Laurie Goering :; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/climate )\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://news.trust.org/climate"], "published": "2018-01-11T11:05:00.000+02:00", "crawled": "2018-01-13T14:56:33.035+02:00", "highlightTitle": ""}