{"organizations": [], "uuid": "556b642c33e38f70d392ee2a315e7213d23e089a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-immigration-trump-factbox/factbox-what-is-in-trumps-framework-for-immigration-legislation-idUSKBN1FF2ID", "country": "US", "domain_rank": 408, "title": "Factbox: What is in Trump's framework for immigration legislation", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T02:50:00.000+02:00", "replies_count": 0, "uuid": "556b642c33e38f70d392ee2a315e7213d23e089a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-immigration-trump-factbox/factbox-what-is-in-trumps-framework-for-immigration-legislation-idUSKBN1FF2ID", "ord_in_thread": 0, "title": "Factbox: What is in Trump's framework for immigration legislation", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "white house", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The White House has released a list of requirements for immigration legislation that it said President Donald Trump would support, offering a path to citizenship for up to 1.8 million young illegal immigrants while tightening border security and clamping down on family sponsorship of immigrants.\nHere is a look at what the White House said on Thursday that it wants.\n“DREAMERS”\n- Expand protections from deportation to 1.8 million so-called “Dreamer” immigrants brought illegally into the country as children, up from the 700,000 people currently signed up for a program begun in 2012 to protect them from deportation and provide work permits. Trump in September rescinded the program, effective in March.\n- The increase would include people who were eligible for the protections but did not initially sign up.\n- Allow “Dreamers” to become citizens in 10 to 12 years, with requirements yet to be determined for work and education, as long as they do not commit crimes.\nBORDER SECURITY - Establish a $25 billion trust fund to pay for a wall on the U.S. southern border with Mexico and security improvements on the northern border with Canada. The trust fund would ensure that Congress in the future could not claw back the money.\n- Agree to spend more money to hire border guards, immigration judges and other law enforcement personnel, and overhaul the hiring system and pay grades. Trump estimated that would cost $5 billion, but the White House said it was subject to further discussion.\n- Immediately deport illegal immigrants who cross the southern or northern border even if they are not from Mexico or Canada. That would affect Central American migrants who often arrive at the U.S. border after crossing through Mexico.\nFAMILY SPONSORSHIP - Limit immigration sponsorship to spouses and minor children, ending the ability to sponsor parents, older children and siblings. That change would annually cut at least 287,700 green cards signifying legal permanent U.S. resident status, according to the Migration Policy Institute think tank.\n- The change would apply prospectively, meaning people caught in the backlog would still be processed by the old rules.\nEND DIVERSITY VISA LOTTERY - End a lottery for green cards offered to applicants from countries with low immigration rates. The program offers up to 50,000 visas a year.\nReporting by Roberta Rampton; Editing by Kevin Drawbaugh and Will Dunham\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T02:50:00.000+02:00", "crawled": "2018-01-26T21:04:52.011+02:00", "highlightTitle": ""}