{"organizations": [], "uuid": "a614e159c6adead0cd94a0c62dca89b90461a8d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/morocco-currency-band/update-1-morocco-dirham-stable-as-central-bank-introduces-flexible-fx-system-idUSL8N1PA1YN", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Morocco dirham stable as central bank introduces flexible FX system", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.056, "site_type": "news", "published": "2018-01-15T18:41:00.000+02:00", "replies_count": 0, "uuid": "a614e159c6adead0cd94a0c62dca89b90461a8d4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/morocco-currency-band/update-1-morocco-dirham-stable-as-central-bank-introduces-flexible-fx-system-idUSL8N1PA1YN", "ord_in_thread": 0, "title": "UPDATE 1-Morocco dirham stable as central bank introduces flexible FX system", "locations": [], "entities": {"persons": [{"name": "aziz el yaakoubi casablanca/dubai", "sentiment": "negative"}, {"name": "ulf laessing", "sentiment": "negative"}], "locations": [{"name": "morocco", "sentiment": "none"}], "organizations": [{"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details and bankers comments)\nBy Ulf Laessing and Aziz El Yaakoubi\nCASABLANCA/DUBAI, Jan 15 (Reuters) - Morocco’s dirham barely moved against major currencies and there was little speculative trade as the central bank introduced a more flexible exchange rate on Monday, part of free-market reforms recommended by the International Monetary Fund.\nThe new system, designed to keep exports competitive and protect Morocco’s foreign exchange reserves, widened the band in which the dirham can trade against hard currencies to 2.5 percent on either side of a reference price, from the previous 0.3 percent.\nThis could potentially give speculators more room to take positions against the dirham. But in the initial hours of trading on Monday, the market was calm and almost all activity was to fill commercial orders.\n“The central bank made it very clear that they will not tolerate speculation - bankers are just waiting for clients’ orders,” said one Moroccan banker.\n“Since the opening, we have had requests for information, but people prefer to wait and see how the dirham will react,” said a second.\nThe central bank set a band of 8.9969-9.4524 dirhams to the U.S. dollar on Monday. After 90 minutes, the dirham had firmed marginally in the spot market to trade around 9.2117, Thomson Reuters data showed.\nThe dollar has been falling sharply against currencies globally over the past few days, another factor which deterred speculation against the dirham on Monday.\nThe Moroccan currency edged down against the euro in early trade, to 11.3045 from 11.2883 on the previous trading day.\nMorocco has been working for years with a technical mission from the IMF to liberalise its currency, with both saying the move will be gradual and a total float will take years, depending on how the market reacts.\nThe central bank and IMF say the country has enough foreign exchange reserves, covering five months and 24 days of imports, to allow a smooth transition. The central bank manages the dirham against a currency basket in which the euro has a weight of 60 percent and the dollar, 40 percent.\nIt has said it will intervene in the market as necessary through regular auctions of the dollar, and other currencies if needed. A foreign currency auction is expected later on Monday, the central bank said.\nJason Tuvey, Middle East economist for London-based Capital Economics, said the new foreign exchange system was a positive step.\n”Last year it was delayed amid fears the currency could sharply depreciate. Those fears have dissipated over the past six to 12 months as foreign exchange reserves have continued to build and capital inflows have remained fairly strong.\n“We saw in Egypt in November 2016 the currency was floated and subsequently fell 50 percent against the dollar. The chance of such a scenario taking hold in Morocco is very unlikely.”\nTuvey added that though Morocco’s current account deficit had deteriorated in recent years, because of higher oil prices and a one-off jump in imports related to expansion of the manufacturing sector, the deficit was now starting to shrink, with imports falling and exports picking up quite strongly.\n“That should support an improvement in the current account position over the coming years.” (Additional reporting by Claire Milhench in London; Editing by Andrew Torchia)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T18:41:00.000+02:00", "crawled": "2018-01-16T13:30:08.089+02:00", "highlightTitle": ""}