{"organizations": [], "uuid": "a989146da1020b91b4efe40bbee31c29fa8918c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/07/104696312-RTX3F00Z.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/21/government-shutdown-news-congress-trump-appear-to-make-progress.html", "country": "US", "domain_rank": 767, "title": "Government shutdown news: Congress, Trump appear to make progress", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.192, "site_type": "news", "published": "2018-01-21T20:02:00.000+02:00", "replies_count": 0, "uuid": "a989146da1020b91b4efe40bbee31c29fa8918c6"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/21/government-shutdown-news-congress-trump-appear-to-make-progress.html", "ord_in_thread": 0, "title": "Government shutdown news: Congress, Trump appear to make progress", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "kevin lamarque", "sentiment": "none"}], "locations": [{"name": "oval office", "sentiment": "none"}, {"name": "capitol", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "et sun", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As the government shutdown dragged on through its second day Sunday, Republicans at least appear unified around a path forward with crucial hours of negotiations and possible votes ahead. \nThe House and the Senate reconvened Sunday afternoon, after lawmakers left the Capitol on Saturday evening appearing some distance away from a deal to break a Senate impasse. Congress aims to strike an agreement before the start of business Monday, when the effects of the government funding lapse would be felt more heavily. Just under a million federal workers would not go into work if the shutdown persists, while financial markets would have their first chance to react to the dysfunction in Washington. \nSigns of progress, however small, emerged Sunday. House Speaker Paul Ryan told CBS News that his chamber would support a stopgap measure to keep the government funded through Feb. 8. \"We will see sometime today,\" if the Senate has the votes for it, he said. \nSenate Majority Leader Mitch McConnell has pushed for such a bill and aims to vote on it by early Monday morning. On Sunday afternoon, he pushed to make that vote sooner. \n\"This shutdown is going to get a lot worse tomorrow. A lot worse,\" McConnell said on the Senate floor. \"Today would be a good day to end it. All we have to do is pass the common sense legislation the Senate is currently considering.\"\nHowever, Democrats did not support that measure as of Sunday afternoon, according to a spokesman for Senate Minority Leader Chuck Schumer . Republicans crucially need 10 or more Democratic votes in the Senate to pass spending legislation with 50 members present. (Sen. John McCain, R-Ariz., is receiving cancer treatment away from Washington.)\nA group of a dozen or more bipartisan, moderate senators is set to take a proposal to McConnell and Schumer sometime Sunday, according to reporters from Politico and The Washington Post. The two senators did not directly negotiate on Saturday, according to NBC News. Sens. Lindsey Graham, R-S.C., and Jeff Flake, R-Ariz., were seen shuffling between their offices. \nGraham told reporters Sunday that a \"breakthrough\" was possible later in the day. \nOffice of Management and Budget Director Mick Mulvaney, meanwhile, expressed some optimism about a deal — while taking another a swipe at Democrats. \n\"I really do believe that at heart here there was an interest by some folks in the Democratic Party to deny the president sort of the victory lap of the anniversary of his inauguration, the chance to talk about the success of the tax bill, the success of the economy and jobs,\" Mulvaney said on \"Fox News Sunday.\" ″And I think if they get over that, there's a chance this thing gets done before 9 o'clock on Monday morning when folks come to work.\"\nSenate Minority Whip Dick Durbin told NBC's \"Meet the Press\" on Sunday that he saw \"positive conversations\" toward breaking the stalemate. However, he was not willing to predict that the government would be open by the close of business Monday. \nTo get behind the bill, Democrats appear to want an assurance that McConnell will put a bipartisan immigration bill up for a vote, with or without President Donald Trump 's blessing. Schumer has repeatedly expressed frustration about nailing down Trump's demands for an immigration deal that would protect hundreds of thousands of young undocumented immigrants from deportation. \n\"He can't take yes for an answer,\" the New York Democrat said Sunday, contending that \"only Trump\" can end the shutdown. \nSchumer reiterated that he offered Trump the funding for an initial payment on his wall project. \nThe White House has said it will not negotiate on immigration until the government is open. \nDemocratic leaders want an immigration agreement at least in place before they support a spending plan. Republicans have sought concessions in exchange for protections for the immigrants, including money for increased border security and changes to extended family migration and the visa \"lottery\" system. \nSchumer had hopes that he may have reached an immigration compromise with Trump on Friday before he got a call from White House chief of staff John Kelly saying his proposal was too liberal for Republicans. Schumer expressed exasperation after his proposal fell through, saying he even put Trump's border wall — previously a deal breaker for Democrats — on the table. \nOther Democrats appeared ready to make that concession if it meant shielding the immigrants brought to the U.S. illegally as children, often known as \"Dreamers.\"\n\"We are ready to sacrifice that so that Dreamers can have freedom in this country,\" Rep. Luis Gutierrez, D-Ill., told ABC News on Sunday. \nTrump ended the Deferred Action for Childhood Arrivals program in September, and it starts to phase out March 5. \nMeanwhile, Trump urged Senate Republicans to go it alone if the \"stalemate continues.\" In a tweet Sunday morning, he urged the GOP to end the legislative filibuster, or take the \"nuclear option,\" to pass a long-term budget. \nA spokesman for McConnell said Republicans have no plans to do so.", "external_links": [], "published": "2018-01-21T20:02:00.000+02:00", "crawled": "2018-01-21T20:02:09.033+02:00", "highlightTitle": ""}