{"organizations": [], "uuid": "f441b776675a49d3859d91de91c2fabbe86e41c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 14, "shares": 14, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/detroit-abandoned-auto-plant.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/trump-new-plan-bill-tax-cuts-jobs-act/", "country": "US", "domain_rank": 1196, "title": "Commentary: New Tax Bill: What Will Public Companies Do? | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.163, "site_type": "news", "published": "2018-01-10T02:00:00.000+02:00", "replies_count": 0, "uuid": "f441b776675a49d3859d91de91c2fabbe86e41c2"}, "author": "Robert C. Pozen", "url": "http://fortune.com/2018/01/10/trump-new-plan-bill-tax-cuts-jobs-act/", "ord_in_thread": 0, "title": "Commentary: New Tax Bill: What Will Public Companies Do? | Fortune", "locations": [], "entities": {"persons": [{"name": "robert k. steel", "sentiment": "neutral"}, {"name": "robert c. pozen", "sentiment": "neutral"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Robert C. Pozen and Robert K. Steel January 10, 2018 \nU.S. companies will soon experience a tsunami of free cash flow. Because of the new Trump-GOP tax plan—the Tax Cuts and Jobs Act—we estimate American companies will have over $2.6 trillion of additional cash over the next five years. This will come from three sources: repatriated overseas cash, future foreign earnings, and lower corporate taxes on domestic profits. The critical question is: What will companies do with this inpouring of cash? \nFor years, many CEOs of public companies have complained of pressure by analysts and activists to focus on short-term profits rather than long-term growth. Now each CEO has a great chance to put their money where their mouth is. \nCEOs have two main alternatives for this incremental cash flow; they can boost short-term returns to shareholders through higher dividends and share repurchases, or they can augment long-term growth by investing in plants, people, research, and technology acquisitions. \nFor the sake of their credibility and the American economy, we urge CEOs to invest in long-term growth, and not in share buybacks as they did in 2004. \nIn 2004, Congress passed a tax holiday for the repatriation of foreign profits of U.S. companies then held abroad—at a 5.25% rate. As a result, nearly 1,000 eligible American companies decided to bring back to the U.S. $362 billion in foreign profits then held abroad. They then mostly spent that money on share buybacks, which decrease the outstanding number of a company’s shares and thereby increase earnings per share. \nUnder the new tax act, the incremental cash flow from repatriating past foreign profits is likely to be much higher—above $1 trillion over the next five years. The foreign profits of U.S. companies held abroad have increased dramatically—from approximately $600 billion in 2004 to over $2.5 trillion in 2017. In 2004, companies paid a repatriation tax on foreign profits only if they were brought back to the U.S. By contrast, the new tax plan assesses a repatriation tax on all foreign profits held abroad, so there is no extra tax cost for bringing them back to the U.S. \nThe future foreign profits of U.S. companies will total over $2 trillion during the next five years. Under the new tax act, these future profits may be repatriated to the U.S. without paying any additional U.S. corporate taxes. We estimate that American companies could reasonably allocate half of this total, or $1 trillion, to capital investments in the U.S. \nAt the same time, the after-tax domestic profits of American companies should be up sharply with a corporate tax rate at 21%, down from 35%. This rate cut will lead to higher after-tax corporate profits of roughly $600 billion over the next five years. \nWill American companies use this total of over $2.6 trillion in incremental cash mainly for share buybacks, as happened in 2004? Then, politicians from both parties were disappointed that so little of the $362 billion in repatriated profits was used to create American jobs or expand U.S. facilities. \nSince 2010, companies have engaged in a frenzy of share buybacks. There is no question that some activists will advocate again for buybacks to raise stock prices. But most investors see through this tactic; they are looking for real growth of company revenue and earnings. \nTo promote real growth and add domestic jobs, public company executives should make capital investments in sustainable projects and programs. Share buybacks above a modest level are a tacit admission by executives that they cannot find enough capital investments to produce reasonable returns. \nThe special tax incentives in the new tax act should spur company executives to use this incremental cash to make American capital investments during the next five years. Only during this period will all companies be allowed to deduct immediately the full costs of their U.S. capital investments, instead of deducting these costs gradually over the useful life of these investments. \nThe economic impact of these new capital investments would be significant for the American economy. Incremental domestic investments of $2.6 trillion over the next five years would be 20% higher than total capital investments by American companies in the previous five years. \nSo now is the time for public company executives to invest for the future—to create jobs and expand local facilities. If, instead, executives propose to use new cash flows solely to buy back their companies’ stock, independent directors should consider major changes in structure and strategy—and, if needed, in the management team. \nRobert C. Pozen is a senior lecturer at the MIT Sloan School of Management and former president of Fidelity Management & Research Company. Robert K. Steel is the CEO of Perella Weinberg Partners and a former undersecretary of the U.S. Treasury Department. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-10T02:00:00.000+02:00", "crawled": "2018-01-11T17:00:54.037+02:00", "highlightTitle": ""}