{"organizations": [], "uuid": "26b4d463eae17d164e4e4e7f32b48149777ee8f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/16/the-associated-press-concept-cars-from-japan-automakers-offer-glimpse-into-future.html", "country": "US", "domain_rank": 767, "title": "Concept cars from Japan automakers offer glimpse into future", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T22:59:00.000+02:00", "replies_count": 0, "uuid": "26b4d463eae17d164e4e4e7f32b48149777ee8f9"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/the-associated-press-concept-cars-from-japan-automakers-offer-glimpse-into-future.html", "ord_in_thread": 0, "title": "Concept cars from Japan automakers offer glimpse into future", "locations": [], "entities": {"persons": [{"name": "michelle krebs", "sentiment": "none"}, {"name": "karim habib", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "neutral"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (AP) — Japanese vehicle brands are exploring new design ideas — and figuring out what sets them apart from their U.S. and European rivals — with new prototype vehicles.\nNissan, Infiniti and Lexus are all unveiling new concept cars at the Detroit auto show, which opens to the public Saturday.\nConcepts are used to test ideas and see how show visitors react. Some elements are glamorous but impractical, with sharply angled headlights or pencil-thin side mirrors that will never actually end up on a production vehicle. But other elements from concept cars do make it onto the road. Lexus's gaping spindle grilles, now a feature on the automaker's vehicles, were introduced in 2011 on the LF-Gh concept car.\n\"Maybe they don't develop that concept per se, but it makes a statement about where the brand is going,\" says Michelle Krebs, an executive analyst with the car buying site Autotrader.com .\nThis year's auto show concepts differ in many ways, but they're striving for one thing: simplicity. They all have serene interiors with real wood and minimal distractions. Karim Habib, Infiniti's executive design director, says designers are reacting to all the visual stimulation in the world.\n\"It is our intention to be an antidote to that,\" he said.\nHere are some details on the concept cars at the show:\nINFINITI Q INSPIRATION: The sleek sedan from Nissan Motor Co.'s luxury Infiniti brand explores how design will change as it moves to compact but powerful variable compression ratio engines. Karim Habib, Infiniti's executive design director, said the smaller engine allows for a shorter hood and a bigger passenger cabin than Infiniti's previous models. The exterior is bold and deceptively simple; there are few lines, but they're deeply etched into the surface so the curves shift as the viewer moves around the vehicle. At first glance, it's hard to see the grille, which is made of twisted metal painted the same color as the car. Inside, there are subtle details, like the traditional Japanese fabric made with gold rice paper that's tucked under the door handles. Each passenger has a touchscreen that offers guided meditation to reduce stress. Habib says the interior is meant to reflect Japan's tradition of polite, generous hospitality. Habib says elements from the Q Inspiration will eventually make it into production vehicles.\nLEXUS LF-1 LIMITLESS: Vehicle brands have always had so-called flagship sedans, the big cars in the lineup that set the tone for all the others. Lexus, which invented the luxury crossover 20 years ago with the RX 300, is now playing with the idea of a flagship crossover SUV. The LF-1 is built so it can be powered by a fuel cell, a hybrid system, gasoline or a battery. By 2025, Lexus says, all of its models will have one of those options available. The LF-1 was designed in California but took its inspiration from a traditional Japanese sword, imagining smooth molten metal flowing into a solid, chiseled form. Inside, knobs and buttons are replaced by motion-activated controls and a wide, unobstructed dashboard. Lexus General Manager Jeff Bracken says Toyota Motor Corp.'s luxury Lexus brand will decide whether to build a flagship crossover based on customer and dealer response to the concept.\nNISSAN XMOTION: Nissan Motor Co.'s XMotion — pronounced \"cross motion\" — differs from the Infiniti and Lexus concepts in exterior styling; instead of spare, undulating designs, the Xmotion is solid, square and blocky. It's ready for rugged use, with all-terrain tires and a retractable rooftop cargo box. But Alfonso Albaisa, Nissan's global design director, said the tough exterior protects the soft, cocoon-like interior. The long center console, which runs from the front to the rear seats, is made of cedar and uses a traditional Japanese architectural wood joinery technique. Cedar is also used for slats below the dashboard, which are meant to convey the sturdy \"bones\" of the vehicle. Nissan says the XMotion will serve as a blueprint for the company's SUVs and eventual autonomous shared vehicles.", "external_links": [], "published": "2018-01-16T22:59:00.000+02:00", "crawled": "2018-01-17T07:26:46.047+02:00", "highlightTitle": ""}