{"organizations": [], "uuid": "f9583831be44128e7419f26672c2db0ee3f806dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-linestar-integrity-services-formed-through-merger-of-ems-and-tucker.html", "country": "US", "domain_rank": 767, "title": "LineStar Integrity Services Formed Through Merger Of EMS And Tucker", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T20:37:00.000+02:00", "replies_count": 0, "uuid": "f9583831be44128e7419f26672c2db0ee3f806dc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-linestar-integrity-services-formed-through-merger-of-ems-and-tucker.html", "ord_in_thread": 0, "title": "LineStar Integrity Services Formed Through Merger Of EMS And Tucker", "locations": [], "entities": {"persons": [{"name": "tucker", "sentiment": "negative"}, {"name": "daniel cowan", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "gulf coast", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "permian", "sentiment": "none"}, {"name": "appalachia", "sentiment": "none"}, {"name": "o&m", "sentiment": "none"}], "organizations": [{"name": "linestar integrity services formed through merger of ems", "sentiment": "negative"}, {"name": "linestar integrity services", "sentiment": "negative"}, {"name": "tucker midstream inc. / tucker construction inc.", "sentiment": "none"}, {"name": "ems energy services llc", "sentiment": "none"}, {"name": "first reserve", "sentiment": "none"}, {"name": "eagle ford", "sentiment": "none"}, {"name": "ems", "sentiment": "none"}, {"name": "blue point capital partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 16, 2018 /PRNewswire/ -- LineStar Integrity Services (\"LineStar\") announced its official brand launch today as a leading provider of midstream integrity maintenance, corrosion and cathodic protection, coatings, GIS, control room operations, measurement and automation, and O&M compliance. The company was formed through the combination of Tucker Midstream Inc. / Tucker Construction Inc. (jointly referred to as \"Tucker,\" acquired from Blue Point Capital Partners) with EMS Energy Services LLC (\"EMS\"). EMS is a portfolio company of First Reserve, a leading global private equity investment firm exclusively focused on energy.\nThe combined company will offer a suite of recurring, non-discretionary and mission-critical midstream maintenance and repair services throughout the U.S. with a strategic footprint in areas of concentrated pipeline infrastructure such as the Gulf Coast industrial corridor, the Mid-continent as well as the Eagle Ford, Permian and Appalachia basins. Effective immediately, Daniel Cowan, current CEO of EMS, will serve as Chief Executive Officer of LineStar, and Paul Neundorfer, current CEO of Tucker, will serve as President, Midstream Operations reporting to Mr. Cowan.\nDaniel Cowan stated, \"This combination of Tucker with EMS under the LineStar banner creates what we believe is a market leader in midstream integrity maintenance, employing over 750 people and serving over 85 customers. I speak for the whole organization when I say we have been impressed with Tucker's entire employee base and experienced management team as they share a similar culture dedicated to safety and customer service, and we are delighted to join forces with them in the LineStar family. We look forward to continuing to partner with our clients to deliver solutions that help manage risk and properly maintain the integrity of pipeline and facility assets throughout their life cycle.\"\nPaul Neundorfer added, \"Through the dedication of our employees, we have developed a reputation for delivering safe, quality results to our customers. Since partnering with Blue Point in 2009, we have made significant investments in our operational infrastructure as well as organic and acquisition initiatives, and we thank them for their support and guidance. This combination of EMS and Tucker is a natural and important step in our evolution and will offer numerous benefits as we become part of a larger platform with a shared vision.\"\nHoulihan Lokey acted as financial advisor to EMS in this transaction. Financial details of the transaction were not disclosed.\nAbout LineStar Integrity Services\nLineStar Integrity Services provides a comprehensive suite of solutions which includes integrity maintenance, corrosion and cathodic protection, coatings, GIS, control room operations, measurement and automation, and O&M compliance throughout the midstream value chain. With over 750 employees and a strategic footprint in areas of concentrated pipeline infrastructure such as the Gulf Coast industrial corridor, the Mid-continent as well as the Eagle Ford, Permian and Appalachia basins, LineStar has an existing customer base of over 85 clients, including long-standing relationships with multiple blue-chip energy companies. These customers rely on LineStar for complete services and solutions that help manage risk, enhance safety and environmental best practices and compliance, and properly maintain the integrity of pipeline and midstream facility assets throughout their life cycles.\nFor LineStar media inquiries, please contact: kirsten.crowley@linestar.com\nView original content: http://www.prnewswire.com/news-releases/linestar-integrity-services-formed-through-merger-of-ems-and-tucker-300583308.html\nSOURCE LineStar Integrity Services", "external_links": ["http://www.prnewswire.com/news-releases/linestar-integrity-services-formed-through-merger-of-ems-and-tucker-300583308.html"], "published": "2018-01-16T20:37:00.000+02:00", "crawled": "2018-01-16T21:16:03.013+02:00", "highlightTitle": ""}