{"organizations": [], "uuid": "ff6fc708a75e285c20733d03d20ac75809430bfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/mpw-revised-logo-2-42.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/26/larry-nasser-red-cross-jessica-chastain-broadsheet-for-jan-26/", "country": "US", "domain_rank": 1196, "title": "Larry Nasser, Red Cross, Jessica Chastain: Broadsheet | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.851, "site_type": "news", "published": "2018-01-26T09:50:00.000+02:00", "replies_count": 0, "uuid": "ff6fc708a75e285c20733d03d20ac75809430bfa"}, "author": "Valentina Zarya", "url": "http://fortune.com/2018/01/26/larry-nasser-red-cross-jessica-chastain-broadsheet-for-jan-26/", "ord_in_thread": 0, "title": "Larry Nasser, Red Cross, Jessica Chastain: Broadsheet | Fortune", "locations": [], "entities": {"persons": [{"name": "valentina zarya", "sentiment": "negative"}, {"name": "larry nasser", "sentiment": "negative"}, {"name": "jessica chastain", "sentiment": "negative"}, {"name": "oprah", "sentiment": "none"}, {"name": "nasser", "sentiment": "none"}, {"name": "gerald anderson", "sentiment": "none"}, {"name": "anderson", "sentiment": "none"}], "locations": [], "organizations": [{"name": "red cross", "sentiment": "negative"}, {"name": "save the children", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Valentina Zarya 7:50 AM EST \nGood morning, Broadsheet readers! Heads continue to roll after the Larry Nasser sentencing, new moms in tech share their tales, and Oprah really—really!—isn’t running for president. Have a cozy weekend. EVERYONE'S TALKING \n• Stay loud. We’ve written a lot in this newsletter about both the positive outcomes and the negative fallout of the #MeToo movement. While some readers—and celebrities—have fretted that things are, or could soon be, “going too far,” a newly published investigation by ProPublica makes me believe otherwise. \nThe story reveals that senior Save the Children executive Gerald Anderson was hired “with very positive references” after he was forced out of the American Red Cross over allegations of sexual misconduct. One of his former co-workers accuses him of sexual harassment; another says he drugged and raped her. \nAnderson’s lawyer declined to answer ProPublica’s specific questions but said in a statement: “Mr. Anderson has not engaged in any sexual misconduct.” \nThese charges have come to light as a direct outcome of the #MeToo movement. The investigative reporting outlet says that Eliza Paul—the woman accusing Anderson of rape—reached out to ProPublica because she was “moved by the stories of sexual misconduct dominating the news late last year.” She told the nonprofit that the Red Cross’s handling of her case left her disillusioned: “Their mission was to help the most vulnerable,” she said. “The whole experience felt like they were so busy covering their asses they didn’t have any concern about me.” \nProPublica confirms as much. Though the charity launched an internal investigation into the women’s allegations in 2012, “Investigators did not interview multiple people who had been referred as witnesses. They asked few follow-up questions. They did not seek copies of Paul’s medical [rape kit] exam.” The investigation eventually concluded that Anderson had sexually harassed at least one subordinate, and he left the Red Cross in 2013—and landed in a plum job at Save the Children later that year. \nSave the Children says it learned of the circumstances surrounding Anderson’s departure from the Red Cross only last week when contacted by ProPublica, adding that he was hired with a glowing reference from his former employer. Anderson is now on administrative leave. \nThis chain of events is yet another insight into “ how institutions actually think, rationalize, compartmentalize.” The phrase was written by The Wall Street Journal ‘s Jason Gay about USA Gymnastics in relation to the Larry Nasser sentencing, but is no less applicable here—or in relation to Harvey Weinstein, Roger Ailes, the list goes on. These men are only part of the problem; the organizations that protect them are equally culpable (see first news item below). And until they stop protecting those in power instead of believing those without, women will—and must—keep speaking up. \nOn the subject of doing just that, my colleague, the incredible writer Erika Fry, is looking to talk to individuals who have reported instances of discrimination, harassment and/or other issues in their workplace. Are you one of those people? How did things work out? If you’re willing to share your experience, send an email to . ALSO IN THE HEADLINES \n• See ya, Simon . Lou Anna Simon, the president of Michigan State University, resigned under pressure Wednesday night over the way she handled the Larry Nasser case. (For those of you who haven’t been keeping up with the news, Nasser is the MSU and USA Gymnastics doctor who has been sentenced to a minimum 40 years in prison for sexually abusing more than 150 women.) Simon’s statement about what one of MSU’s trustees called “just this Nassar thing” made it clear that she was resigning due to outside pressure and not because she feels any personal responsibility for the failings of an institution that allowed a sexual predator to remain blameless for so long. She said in a statement: “As tragedies are politicized, blame is inevitable. As president, it is only natural that I am the focus of this anger.” New York Times \n• Millions can’t say #MeToo . Even as awareness of sexual harassment rises, an estimated tens of millions of American employees work for companies that require disputes with their employers be adjudicated through arbitration, according to a 2017 study by a Cornell University professor. What’s more, the percentage of nonunion, private-sector employees covered by the mandatory-arbitration clauses has more than doubled since the early 2000s. Wall Street Journal \n• Tech moms tell all . Earlier this month, Recode asked new moms in tech about their experiences coming back to work after having kids. The survey results—which include responses from 230 women across 150 companies—include details on tech companies’ maternity packages, work flexibility, childcare benefits and quality of lactation rooms. Overall, about half the women surveyed rated their experiences as great. The biggest pro of working in the industry seems to be flexibility, while the biggest con is a lack of affordable childcare. Recode \n• Walking the walk . Speaking on a panel at the Sundance Film Festival, Academy Award-winning actress Octavia Spencer said that when she told her castmember Jessica Chastain that black women frequently get paid less in Hollywood than white actresses, Chastain promised Spencer that they would join forces to avoid any salary disparity. While she praised Chastain for her support, Spencer was also quick to take a shot at the ongoing wage gap that exists in Hollywood between men and women: “Now, I want to go to what the men are making.” Fortune \nMOVERS AND SHAKERS: Liza Landsman, president of the Jet.com, is reportedly leaving the company (which was acquired 18 months ago by Walmart). According to Recode, she is leaving for a new—and still unknown—role at another company that “she saw as too good to pass up.” IN CASE YOU MISSED IT \n• Managing #MeToo . HBR launched a new series yesterday called “Managing #MeToo,” headlined by legal scholar Joan C. Williams and feminist historian Suzanne Lebsock. The duo puts the #MeToo movement in historical context, offers tips for managers and employees alike, and attempts to answer the question, “Now what?” They conclude: “It’s our final piece of advice that signals the tectonic shift [in workplace culture]: If you are being sexually harassed, report it. We’re not sure if we would have advised that, in such a blanket and unnuanced way, even a year ago.” Harvard Business Review \n• Nope, says Oprah . Our sister magazine InStyle ‘s March cover story features Oprah Winfrey, who once and for all puts the Oprah 2020 rumors to rest: “It’s not something that interests me. I don’t have the DNA for it,” she says. InStyle \n• The feminist case for UBI . Slate’s Jessica Flanigan argues that feminists should support universal basic income. Her reasoning is tri-fold: 1) Women are more likely to be in poverty than men are and so more likely to benefit from it 2) A UBI for mothers and children would enable women who want to work to pay for childcare and 3) “Trusting women and all people with the right to spend their money how they see fit, as UBI allows, would push back against decades of paternalistic social policy.” ", "external_links": [], "published": "2018-01-26T09:50:00.000+02:00", "crawled": "2018-01-26T15:25:28.058+02:00", "highlightTitle": ""}