{"organizations": [], "uuid": "b98fefaedd0e2cbf735683463753c1441c67cc31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104978027-RTS1LUMQ.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/trump-gives-one-of-longest-state-of-the-union-speeches.html", "country": "US", "domain_rank": 767, "title": "Trump gives one of longest State of the Union speeches", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.217, "site_type": "news", "published": "2018-01-31T06:13:00.000+02:00", "replies_count": 0, "uuid": "b98fefaedd0e2cbf735683463753c1441c67cc31"}, "author": "John W. Schoen", "url": "https://www.cnbc.com/2018/01/30/trump-gives-one-of-longest-state-of-the-union-speeches.html", "ord_in_thread": 0, "title": "Trump gives one of longest State of the Union speeches", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "george washington", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump 's first State of the Union speech was one of the longest on record.\nTrump spent a little more than an hour and twenty minutes reviewing the first year of his administration, including a sweeping tax cut and the repeal of the individual mandate to buy health insurance. Looking ahead, Trump called on Congress to take up the remainder of his agenda on policies from immigration and national security. \nThe result was the third longest State of the Union address in the modern era, surpassed only by President Bill Clinton in 1995 (one hour, 24 minutes) and in 2000 (one hour, 28 minutes).\n\nPresidents weighing in on the state of the nation has been a tradition since the early days of the U.S. That's because Article II, Section 3 of the Constitution says the president may \"from time to time give to the Congress information of the state of the union, and recommend to their consideration such measures as he shall judge necessary and expedient.\"\nGeorge Washington got the tradition started with a personal address, but by the time Thomas Jefferson occupied the White House, the message was conveyed in writing, according to political science professor.\nApparently, Jefferson feared that standing in front of Congress \"was too similar to the British monarch's practice of addressing each new Parliament with a list of policy mandates,\" Gerhard Peters writes in a post on The American Presidency Project , a web site he co-produces.\n\nThat all changed in 1913, when Woodrow Wilson decided to go back to a spoken address to Congress. Since then, most presidential briefings to Congress on the state of the union have been delivered in person once a year, with few exceptions. In some years, presidents have chosen to provide both spoken and written updates, Peters writes. \nSince Ronald Reagan, the five most recent presidents have also addressed a joint session of Congress shortly after their inaugurations, although these are not technically considered official \"State of the Union\" addresses.\nDespite the time span of Trump's speech, however, he used much fewer words than predecessor Barack Obama ever did, often pausing for applause – including his own.", "external_links": [], "published": "2018-01-31T06:13:00.000+02:00", "crawled": "2018-01-31T06:13:31.010+02:00", "highlightTitle": ""}