{"organizations": [], "uuid": "bd1ca6e6001ae1e52b20ad3b7bfe18f6249f473b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-texas-capital-bancshares-inc-announces-operating-results-for-2017.html", "country": "US", "domain_rank": 767, "title": "Texas Capital Bancshares, Inc. Announces Operating Results for 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:02:00.000+02:00", "replies_count": 0, "uuid": "bd1ca6e6001ae1e52b20ad3b7bfe18f6249f473b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-texas-capital-bancshares-inc-announces-operating-results-for-2017.html", "ord_in_thread": 0, "title": "Texas Capital Bancshares, Inc. Announces Operating Results for 2017", "locations": [], "entities": {"persons": [{"name": "keith cargill", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "tcbi", "sentiment": "negative"}, {"name": "texas capital bancshares, inc", "sentiment": "neutral"}, {"name": "texas capital bancshares, inc.", "sentiment": "neutral"}, {"name": "texas capital bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 24, 2018 (GLOBE NEWSWIRE) -- Texas Capital Bancshares, Inc. (NASDAQ:TCBI), the parent company of Texas Capital Bank, announced earnings and operating results for the fourth quarter and full year of 2017.\n“We are pleased to finish 2017 with strong operating results, including record earnings. The strong loan and deposit growth in 2017 positions us well as we move into 2018,\" said Keith Cargill, CEO. \"We are focused on developing our talent and leveraging our people with improved technology as we gain efficiencies and improve client experience.\"\nQ4 2017 was negatively impacted by a $17.6 million ($0.35 per share) write-off of our deferred tax asset (\"DTA\") as a result of the Tax Cuts and Jobs Act (the \"Tax Act\"). The amount of the write-off is expected to be recovered during 2018 from cash tax savings resulting from the Tax Act. Net income decreased 24% on a linked quarter basis and decreased 8% from the fourth quarter of 2016. EPS decreased 25% on a linked quarter basis and decreased 13% from the fourth quarter of 2016. Loans held for investment (\"LHI\"), excluding mortgage finance, increased 4% on a linked quarter basis and 18% from the fourth quarter of 2016. Total mortgage finance loans, including mortgage correspondent loans (\"MCA loans\"), decreased 4% on a linked quarter basis and increased 16% from the fourth quarter of 2016. Demand deposits decreased 5% and total deposits remained flat on a linked quarter basis (increased 4% and 8% on an average basis, respectively), and decreased 2% and increased 12%, respectively, from the fourth quarter of 2016.\nFINANCIAL SUMMARY\n(dollars and shares in thousands)\n2017 2016 % Change ANNUAL OPERATING RESULTS Net income $ 197,063 $ 155,119 27 % Net income available to common stockholders $ 187,313 $ 145,369 29 % Diluted EPS $ 3.73 $ 3.11 20 % Diluted shares 50,260 46,766 7 % ROA 0.87 % 0.74 % ROE 9.51 % 9.27 % QUARTERLY OPERATING RESULTS Net income $ 44,742 $ 48,386 (8 )% Net income available to common stockholders $ 42,305 $ 45,949 (8 )% Diluted EPS $ 0.84 $ 0.96 (13 )% Diluted shares 50,312 47,760 5 % ROA 0.71 % 0.85 % ROE 8.18 % 10.82 % BALANCE SHEET Loans held for sale (MCA) $ 1,007,695 $ 968,929 4 % LHI, mortgage finance 5,308,160 4,497,338 18 % LHI 15,366,252 13,001,011 18 % Total LHI 20,674,412 17,498,349 18 % Total loans 21,685,416 18,467,278 17 % Total assets 25,075,645 21,697,134 16 % Demand deposits 7,812,660 7,994,201 (2 )% Total deposits 19,123,180 17,016,831 12 % Stockholders’ equity 2,202,721 2,009,557 10 % DETAILED FINANCIALS\nTexas Capital Bancshares, Inc. reported net income of $197.1 million and net income available to common stockholders of $187.3 million for the year ended December 31, 2017, compared to net income of $155.1 million and net income available to common stockholders of $145.4 million for the year ended December 31, 2016. For the fourth quarter of 2017, net income was $44.7 million and net income available to common stockholders was $42.3 million, compared to net income of $48.4 million and net income available to common stockholders of $45.9 million for the same period in 2016. On a fully diluted basis, earnings per common share were $3.73 for the year ended December 31, 2017 compared to $3.11 for the same period in 2016. Diluted earnings per common share were $0.84 for the quarter ended December 31, 2017 compared to $0.96 for the same period of 2016. The decrease reflects a $17.6 million write-off of our DTA in response to enactment of the Tax Act, which was recorded as additional income tax expense during the fourth quarter. The write-off had an adverse effect of $0.35 on earnings per common share for the 2017 fourth quarter and full year. The federal corporate income tax rates declined from 35% to 21% effective January 1, 2018 as a result of the Tax Act. The amount of the DTA write-off is expected to be recovered in 2018 from cash tax savings attributable to the Tax Act.\nReturn on common equity (\"ROE\") was 9.51 percent and return on average assets (\"ROA\") was 0.87 percent for the year ended December 31, 2017, compared to 9.27 percent and 0.74 percent, respectively, for the year ended December 31, 2016. ROE was 8.18 percent and ROA was 0.71 percent for the fourth quarter of 2017, compared to 11.20 percent and 0.99 percent, respectively, for the third quarter of 2017 and 10.82 percent and 0.85 percent, respectively, for the fourth quarter of 2016. The linked quarter and year-over-year decreases in ROE and ROA for the fourth quarter of 2017 resulted primarily from the DTA write-off, which outpaced the increases in net-interest income and decreases in the provision for credit losses. Excluding the DTA write-off, year-to-date and quarter-to-date December 31, 2017 ROE would have been 10.41% and 11.58%, respectively.\nNet interest income was $210.6 million for the fourth quarter of 2017, compared to $204.4 million for the third quarter of 2017 and $171.2 million for the fourth quarter of 2016. The linked quarter and year-over-year increases in net interest income are due primarily to the growth in total LHI. Net interest margin for the fourth quarter of 2017 was 3.47% percent, a decrease of 12 basis points from the third quarter of 2017 and an increase of 36 basis points from the fourth quarter of 2016. Traditional LHI yields were down 3 basis points from the third quarter of 2017, but were up 50 basis points compared to the fourth quarter of 2016. In contrast, total cost of deposits for the fourth quarter of 2017 was up only 6 basis points to 0.53 percent compared to the third quarter of 2017 and up 31 basis points compared to the fourth quarter of 2016. Net interest margin for the fourth quarter of 2017 was adversely affected by increases in mortgage and liquidity assets which are at lower yields than traditional LHI, but produced significant growth in net interest income.\nAverage LHI, excluding mortgage finance loans, for the year ended December 31, 2017 were $14.0 billion, an increase of $1.7 billion, or 13 percent, from 2016. Average LHI, excluding mortgage finance loans, for the fourth quarter of 2017 were $15.0 billion, an increase of $582.1 million, or 4 percent, from the third quarter of 2017 and an increase of $2.3 billion, or 18 percent, from the fourth quarter of 2016. Average total mortgage finance loans (including MCA) for the fourth quarter of 2017 were $6.2 billion, an increase of $388.9 million, or 7 percent, from the third quarter of 2017 and an increase of $930.2 million, or 17 percent, from the fourth quarter of 2016.\nAverage total deposits for the year ended December 31, 2017 were $18.5 billion, an increase of $1.2 billion, or 7 percent, from 2016. Average demand deposits for the year ended December 31, 2017 were $8.3 billion, an increase of $196.5 billion, or 2 percent, from 2016. Average total deposits for the fourth quarter of 2017 increased $1.5 billion from the third quarter of 2017 and increased $1.9 billion from the fourth quarter of 2016. Average demand deposits for the fourth quarter of 2017 increased $321.6 million, or 4 percent, to $9.1 billion from $8.8 billion from the third quarter of 2017, and decreased $43.8 million, or 0.48 percent, from the third quarter of 2017.\nWe recorded a $2.0 million provision for credit losses for the fourth quarter of 2017 compared to $20.0 million for the third quarter of 2017 and $9.0 million for the fourth quarter of 2016. The provision for the fourth quarter of 2017 was driven by the consistent application of our methodology. The linked quarter and year-over-year decreases were primarily related to improvements in the composition of our pass-rated and classified loan portfolios, including energy loans. The combined allowance for credit losses at December 31, 2017 decreased to 1.26 percent of LHI excluding mortgage finance loans compared to 1.30 percent at September 30, 2017 and 1.38 percent at December 31, 2016. In management’s opinion, the allowance is appropriate and is derived from consistent application of the methodology for establishing reserves for the loan portfolio.\nWe experienced a decrease in non-performing assets in the fourth quarter of 2017 compared to levels reported in the third quarter of 2017 and fourth quarter of 2016, reducing the ratio or total non-performing assets to total LHI plus other real estate owned (\"OREO\") to 0.55 percent compared to 0.67 percent for the third quarter of 2017 and 1.07 percent for the fourth quarter of 2016. The linked quarter and year-over-year decreases are primarily related to the decrease in energy non-accrual loans from $81.6 million at September 30, 2017 and $121.5 at December 31, 2016 to $65.2 million at December 31, 2017. Net charge-offs for the fourth quarter of 2017 were $964,000 compared to $10.7 million for the third quarter of 2017 and $20.8 million for the fourth quarter of 2016. For the fourth quarter of 2017, net charge-offs related to energy loans were $175,000 compared to net charge-offs of $6.3 million for the third quarter of 2017 and $16.3 million for the fourth quarter of 2016. For the fourth quarter of 2017, net charge-offs were 0.02 percent of average total LHI, compared to 0.22 percent for the third quarter of 2017 and 0.48 percent for the same period in 2016. At December 31, 2017, OREO was $11.7 million compared to $18.1 million at September 30, 2017 and $19.0 at December 31, 2016. The linked quarter and year-over-year decreases were due to a $6.1 million permanent write down of a commercial property during the fourth quarter of 2017.\nNon-interest income increased $539,000, or 3 percent, during the fourth quarter of 2017 compared to the same period of 2016, and increased $371,000, or 2 percent, compared to the third quarter of 2017. The year-over-year increase primarily related to a $3.9 million increase in servicing income during the fourth quarter of 2017 compared to the same period of 2016 primarily attributable to an increase in mortgage servicing rights (\"MSRs\"). Offsetting this increase was a $2.7 million decrease in other non-interest income and a $1.6 million decrease in brokered loan fees, which resulted from a decrease in mortgage finance volumes.\nNon-interest expense for the fourth quarter of 2017 increased $26.6 million, or 25 percent, compared to the fourth quarter of 2016, and increased $18.3 million, or 16 percent, compared to the third quarter of 2017. The year-over-year increase is primarily related to a $6.1 million write-down of OREO taken during the fourth quarter of 2017 and a $6.8 million increase in servicing related expenses resulting from a $2.8 million impairment charge primarily due to an anticipated sale of Ginnie Mae MSRs in the first quarter of 2018 and an increase in MSRs, which are being amortized. Non-interest expense for the fourth quarter of 2017 was also affected by increases in salaries and employee benefits, marketing expense and legal and professional expense of $4.1 million, $3.8 million and $2.3 million, respectively, all of which were due to general business growth. The linked quarter increase in non-interest expense was primarily related to the $6.1 million write-down of OREO, as well as a $3.3 million increase in servicing related expenses, which included a $2.8 million impairment charge on MSRs, a $2.4 million increase in legal and professional expense and a $2.3 million increase in salaries and employee benefits.\nStockholders’ equity increased by 10 percent from $2.0 billion at December 31, 2016 to $2.2 billion at December 31, 2017, primarily due to retention of net income. Texas Capital Bank is well capitalized under regulatory guidelines. At December 31, 2017, our ratio of tangible common equity to total tangible assets was 8.1 percent.\nABOUT TEXAS CAPITAL BANCSHARES, INC.\nTexas Capital Bancshares, Inc. (NASDAQ:TCBI) , a member of the Russell 2000® Index and the S&P MidCap 400®, is the parent company of Texas Capital Bank, a commercial bank that delivers highly personalized financial services to businesses and entrepreneurs. Headquartered in Dallas, the bank has full-service locations in Austin, Dallas, Fort Worth, Houston and San Antonio.\nThis news release may be deemed to include forward-looking statements which are based on management’s current estimates or expectations of future events or future results. These statements are not historical in nature and can generally be identified by such words as “believe,” “expect,” “estimate,” “anticipate,” “plan,” “may,” “will,” “intend” and similar expressions. A number of factors, many of which are beyond our control, could cause actual results to differ materially from future results expressed or implied by such forward-looking statements. These risks and uncertainties include, but are not limited to, the credit quality of our loan portfolio, general economic conditions in the United States and in our markets, including the continued impact on our customers from declines and volatility in oil and gas prices, the financial impact of the Tax Cuts and Jobs Act on our results of operations, the impact on our loan and deposit portfolios as a result of Hurricanes Harvey and Irma, rates of default or loan losses, volatility in the mortgage industry, the success or failure of our business strategies, future financial performance, future growth and earnings, the appropriateness of our allowance for loan losses and provision for credit losses, the impact of increased regulatory requirements and legislative changes on our business, increased competition, interest rate risk, the success or failure of new lines of business and new product or service offerings and the impact of new technologies. These and other factors that could cause results to differ materially from those described in the forward-looking statements, as well as a discussion of the risks and uncertainties that may affect our business, can be found in our Annual Report on Form 10-K and in other filings we make with the Securities and Exchange Commission. The information contained in this release speaks only as of its date. We are under no obligation, and expressly disclaim such obligation, to update, alter or revise our forward-looking statements, whether as a result of new information, future events, or otherwise.\nTEXAS CAPITAL BANCSHARES, INC. SELECTED FINANCIAL HIGHLIGHTS (UNAUDITED) (Dollars in thousands except per share data) 4th Quarter 3rd Quarter 2nd Quarter 1st Quarter 4th Quarter 2017 2017 2017 2017 2016 CONSOLIDATED STATEMENTS OF INCOME Interest income $ 249,519 $ 237,643 $ 208,191 $ 183,946 $ 188,671 Interest expense 38,870 33,282 25,232 20,587 17,448 Net interest income 210,649 204,361 182,959 163,359 171,223 Provision for credit losses 2,000 20,000 13,000 9,000 9,000 Net interest income after provision for credit losses 208,649 184,361 169,959 154,359 162,223 Non-interest income 19,374 19,003 18,769 17,110 18,835 Non-interest expense 133,138 114,830 111,814 106,094 106,523 Income before income taxes 94,885 88,534 76,914 65,375 74,535 Income tax expense 50,143 29,850 25,819 22,833 26,149 Net income 44,742 58,684 51,095 42,542 48,386 Preferred stock dividends 2,437 2,438 2,437 2,438 2,437 Net income available to common stockholders $ 42,305 $ 56,246 $ 48,658 $ 40,104 $ 45,949 Diluted EPS $ 0.84 $ 1.12 $ 0.97 $ 0.80 $ 0.96 Diluted shares 50,311,962 50,250,866 50,229,670 50,234,230 47,759,548 CONSOLIDATED BALANCE SHEET DATA Total assets $ 25,075,645 $ 24,400,998 $ 23,119,713 $ 20,864,874 $ 21,697,134 LHI 15,366,252 14,828,406 14,280,353 13,298,918 13,001,011 LHI, mortgage finance 5,308,160 5,642,285 5,183,600 3,371,598 4,497,338 Loans held for sale, MCA 1,007,695 955,983 843,164 884,647 968,929 Liquidity assets (1) 2,727,581 2,357,537 2,142,658 2,804,921 2,725,645 Securities 23,511 24,224 119,043 42,203 24,874 Demand deposits 7,812,660 8,263,202 8,174,830 7,094,696 7,994,201 Total deposits 19,123,180 19,081,257 17,292,223 16,605,380 17,016,831 Other borrowings 3,165,040 2,583,496 3,162,224 1,641,834 2,109,575 Subordinated notes 281,406 281,315 281,225 281,134 281,044 Long-term debt 113,406 113,406 113,406 113,406 113,406 Stockholders’ equity 2,202,721 2,158,363 2,100,553 2,050,442 2,009,557 End of period shares outstanding 49,643,344 49,621,825 49,595,252 49,560,100 49,503,662 Book value $ 41.35 $ 40.47 $ 39.33 $ 38.35 $ 37.56 Tangible book value (2) $ 40.97 $ 40.09 $ 38.94 $ 37.95 $ 37.17 SELECTED FINANCIAL RATIOS Net interest margin 3.47 % 3.59 % 3.57 % 3.29 % 3.11 % Return on average assets 0.71 % 0.99 % 0.96 % 0.83 % 0.85 % Return on average common equity 8.18 % 11.20 % 10.08 % 8.60 % 10.82 % Non-interest income to average earning assets 0.32 % 0.33 % 0.36 % 0.34 % 0.34 % Efficiency ratio (3) 57.9 % 51.4 % 55.4 % 58.8 % 56.0 % Efficiency ratio, excluding OREO write-down (3) 55.2 % 51.4 % 55.4 % 58.8 % 56.0 % Non-interest expense to average earning assets 2.17 % 2.00 % 2.17 % 2.12 % 1.93 % Tangible common equity to total tangible assets (4) 8.1 % 8.2 % 8.4 % 9.0 % 8.5 % Common Equity Tier 1 8.5 % 8.4 % 8.6 % 9.6 % 9.0 % Tier 1 capital 9.5 % 9.4 % 9.8 % 10.9 % 10.2 % Total capital 11.5 % 11.4 % 11.8 % 13.3 % 12.5 % Leverage 9.2 % 9.6 % 10.3 % 10.3 % 9.3 % (1) Liquidity assets include Federal funds sold and deposits in other banks. (2) Stockholders’ equity excluding preferred stock, less goodwill and intangibles, divided by shares outstanding at period end. (3) Non-interest expense divided by the sum of net interest income and non-interest income. (4) Stockholders’ equity excluding preferred stock and accumulated other comprehensive income less goodwill and intangibles divided by total assets less accumulated other comprehensive income and goodwill and intangibles.\nTEXAS CAPITAL BANCSHARES, INC. CONSOLIDATED BALANCE SHEETS (UNAUDITED) (Dollars in thousands) December 31,\n2017 December 31,\n2016 %\nChange Assets Cash and due from banks $ 178,010 $ 113,707 57 % Interest-bearing deposits 2,697,581 2,700,645 — % Federal funds sold and securities purchased under resale agreements 30,000 25,000 20 % Securities, available-for-sale 23,511 24,874 (5 )% Loans held for sale ($1,007.7 million and $968.9 million at December 31, 2017 and 2016, respectively, at fair value) 1,011,004 968,929 4 % LHI, mortgage finance 5,308,160 4,497,338 18 % LHI (net of unearned income) 15,366,252 13,001,011 18 % Less: Allowance for loan losses 184,655 168,126 10 % LHI, net 20,489,757 17,330,223 18 % Mortgage servicing rights, net 85,327 28,536 199 % Premises and equipment, net 25,176 19,775 27 % Accrued interest receivable and other assets 516,239 465,933 11 % Goodwill and intangibles, net 19,040 19,512 (2 )% Total assets $ 25,075,645 $ 21,697,134 16 % Liabilities and Stockholders’ Equity Liabilities: Deposits: Non-interest bearing $ 7,812,660 $ 7,994,201 (2 )% Interest bearing 11,310,520 9,022,630 25 % Total deposits 19,123,180 17,016,831 12 % Accrued interest payable 7,680 5,498 40 % Other liabilities 182,212 161,223 13 % Federal funds purchased and repurchase agreements 365,040 109,575 233 % Other borrowings 2,800,000 2,000,000 40 % Subordinated notes, net 281,406 281,044 — % Trust preferred subordinated debentures 113,406 113,406 — % Total liabilities 22,872,924 19,687,577 16 % Stockholders’ equity: Preferred stock, $.01 par value, $1,000 liquidation value: Authorized shares - 10,000,000 Issued shares - 6,000,000 shares issued at December 31, 2017 and 2016 150,000 150,000 — % Common stock, $.01 par value: Authorized shares - 100,000,000 Issued shares - 49,643,761 and 49,504,079 at December 31, 2017 and 2016, respectively 496 495 — % Additional paid-in capital 961,305 955,468 1 % Retained earnings 1,090,500 903,187 21 % Treasury stock (shares at cost: 417 at December 31, 2017 and 2016) (8 ) (8 ) — % Accumulated other comprehensive income, net of taxes 428 415 3 % Total stockholders’ equity 2,202,721 2,009,557 10 % Total liabilities and stockholders’ equity $ 25,075,645 $ 21,697,134 16 %\nTEXAS CAPITAL BANCSHARES, INC. CONSOLIDATED STATEMENTS OF INCOME (UNAUDITED) (Dollars in thousands except per share data) Three Months Ended\nDecember 31 Year Ended\nDecember 31 2017 2016 2017 2016 Interest income Interest and fees on loans $ 238,906 $ 182,909 $ 846,292 $ 684,582 Securities 213 228 1,066 967 Federal funds sold and securities purchased under resale agreements 936 338 2,542 1,547 Deposits in other banks 9,464 5,196 29,399 16,312 Total interest income 249,519 188,671 879,299 703,408 Interest expense Deposits 27,625 10,432 79,886 37,175 Federal funds purchased 723 156 2,592 518 Other borrowings 5,380 1,863 15,137 6,128 Subordinated notes 4,191 4,191 16,764 16,764 Trust preferred subordinated debentures 951 806 3,592 3,009 Total interest expense 38,870 17,448 117,971 63,594 Net interest income 210,649 171,223 761,328 639,814 Provision for credit losses 2,000 9,000 44,000 77,000 Net interest income after provision for credit losses 208,649 162,223 717,328 562,814 Non-interest income Service charges on deposit accounts 3,109 2,940 12,432 10,341 Wealth management and trust fee income 1,767 1,244 6,153 4,268 Bank owned life insurance (BOLI) income 698 481 2,260 2,073 Brokered loan fees 5,692 7,249 23,331 25,339 Servicing income 5,270 1,410 15,657 1,715 Swap fees 586 536 3,990 2,866 Other 2,252 4,975 10,433 14,178 Total non-interest income 19,374 18,835 74,256 60,780 Non-interest expense Salaries and employee benefits 70,192 66,081 264,231 228,985 Net occupancy expense 6,749 5,937 25,811 23,221 Marketing 8,438 4,617 26,787 17,303 Legal and professional 8,756 6,443 29,731 23,326 Communications and technology 6,590 6,334 31,004 25,562 FDIC insurance assessment 6,710 6,573 23,510 24,440 Servicing related expenses 7,177 398 15,506 1,703 Allowance and other carrying costs for OREO 6,122 59 6,437 824 Other 12,404 10,081 42,859 37,033 Total non-interest expense 133,138 106,523 465,876 382,397 Income before income taxes 94,885 74,535 325,708 241,197 Income tax expense 50,143 26,149 128,645 86,078 Net income 44,742 48,386 197,063 155,119 Preferred stock dividends 2,437 2,437 9,750 9,750 Net income available to common stockholders $ 42,305 $ 45,949 $ 187,313 $ 145,369 Basic earnings per common share $ 0.85 $ 0.97 $ 3.78 $ 3.14 Diluted earnings per common share $ 0.84 $ 0.96 $ 3.73 $ 3.11\nTEXAS CAPITAL BANCSHARES, INC. SUMMARY OF LOAN LOSS EXPERIENCE (Dollars in thousands) 4th Quarter 3rd Quarter 2nd Quarter 1st Quarter 4th Quarter 2017 2017 2017 2017 2016 Allowance for loan losses: Beginning balance $ 182,929 $ 174,225 $ 172,013 $ 168,126 $ 180,436 Loans charged-off: Commercial 1,999 10,603 12,310 9,233 22,326 Real estate — 250 40 — — Construction — 59 — — — Consumer — — 180 — 7 Leases — — — — — Total charge-offs 1,999 10,912 12,530 9,233 22,333 Recoveries: Commercial 1,019 132 61 3,381 1,535 Real estate 1 21 3 50 27 Construction — 3 — 101 — Consumer 14 15 36 5 5 Leases 1 1 — 8 6 Total recoveries 1,035 172 100 3,545 1,573 Net charge-offs 964 10,740 12,430 5,688 20,760 Provision for loan losses 2,690 19,444 14,642 9,575 8,450 Ending balance $ 184,655 $ 182,929 $ 174,225 $ 172,013 $ 168,126 Allowance for off-balance sheet credit losses: Beginning balance $ 9,761 $ 9,205 $ 10,847 $ 11,422 $ 10,872 Provision for off-balance sheet credit losses (690 ) 556 (1,642 ) (575 ) 550 Ending balance $ 9,071 $ 9,761 $ 9,205 $ 10,847 $ 11,422 Total allowance for credit losses $ 193,726 $ 192,690 $ 183,430 $ 182,860 $ 179,548 Total provision for credit losses $ 2,000 $ 20,000 $ 13,000 $ 9,000 $ 9,000 Allowance for loan losses to LHI 0.89 % 0.89 % 0.90 % 1.03 % 0.96 % Allowance for loan losses to LHI excluding mortgage finance loans (2) 1.20 % 1.23 % 1.22 % 1.29 % 1.29 % Allowance for loan losses to average LHI 0.92 % 0.95 % 0.99 % 1.09 % 0.98 % Allowance for loan losses to average LHI excluding mortgage finance loans (2) 1.23 % 1.27 % 1.27 % 1.33 % 1.32 % Net charge-offs to average LHI (1) 0.02 % 0.22 % 0.28 % 0.15 % 0.48 % Net charge-offs to average LHI excluding mortgage finance loans (1)(2) 0.03 % 0.30 % 0.36 % 0.18 % 0.65 % Net charge-offs to average LHI for last twelve months (1) 0.16 % 0.29 % 0.27 % 0.28 % 0.29 % Net charge-offs to average LHI, excluding mortgage finance loans, for last twelve months (1)(2) 0.21 % 0.37 % 0.36 % 0.36 % 0.38 % Total provision for credit losses to average LHI (1) 0.04 % 0.41 % 0.30 % 0.23 % 0.21 % Total provision for credit losses to average LHI excluding mortgage finance loans (1)(2) 0.05 % 0.55 % 0.38 % 0.28 % 0.28 % Combined allowance for credit losses to LHI 0.94 % 0.94 % 0.94 % 1.10 % 1.03 % Combined allowance for credit losses to LHI, excluding mortgage finance loans (2) 1.26 % 1.30 % 1.28 % 1.37 % 1.38 % 1. Interim period ratios are annualized. 2. The indicated ratios are presented with and excluding the mortgage finance loans because the risk profile of our mortgage finance loans is different than our other loans held for investment. No provision for credit losses is allocated to these loans based on the internal risk grade assigned.\nTEXAS CAPITAL BANCSHARES, INC. SUMMARY OF NON-PERFORMING ASSETS AND PAST DUE LOANS (Dollars in thousands) 4th Quarter 3rd Quarter 2nd Quarter 1st Quarter 4th Quarter 2017 2017 2017 2017 2016 Non-performing assets (NPAs): Non-accrual loans $ 101,444 $ 118,205 $ 123,730 $ 146,549 $ 167,791 Other real estate owned (OREO) 11,742 18,131 18,689 18,833 18,961 Total $ 113,186 $ 136,336 $ 142,419 $ 165,382 $ 186,752 Non-accrual loans to LHI 0.49 % 0.58 % 0.64 % 0.88 % 0.96 % Non-accrual loans to LHI excluding mortgage finance loans (1) 0.66 % 0.80 % 0.87 % 1.10 % 1.29 % Total NPAs to LHI plus OREO 0.55 % 0.67 % 0.73 % 0.99 % 1.07 % Total NPAs to LHI excluding mortgage finance loans plus OREO (1) 0.74 % 0.92 % 1.00 % 1.24 % 1.43 % Total NPAs to earning assets 0.47 % 0.58 % 0.64 % 0.82 % 0.89 % Allowance for loan losses to non-accrual loans 1.8 x 1.5 x 1.4 x 1.2 x 1.0 x Restructured loans $ — $ — $ — $ — $ — Loans past due 90 days and still accruing (2)(3) $ 28,166 $ 8,892 $ 11,077 $ 8,799 $ 10,729 Loans past due 90 days to LHI 0.14 % 0.04 % 0.06 % 0.05 % 0.06 % Loans past due 90 days to LHI excluding mortgage finance loans (2) 0.18 % 0.06 % 0.08 % 0.07 % 0.08 % 1. The indicated ratios are presented with and excluding the mortgage finance loans because the risk profile of our mortgage finance loans is different than our other loans held for investment. No provision for credit losses is allocated to these loans based on the internal risk grade assigned. 2. At December 31, 2017, loans past due 90 days and still accruing includes premium finance loans of $5.5 million. These loans are primarily secured by obligations of insurance carriers to refund premiums on canceled insurance policies. The refund of premiums from the insurance carriers can take 180 days or longer from the cancellation date. 3. At December 31, 2017, loans past due 90 days and still accruing includes $19.7 million in loans held for sale, of which $19.0 million are loans with government guarantees that we purchased and sold into Ginnie Mae pools. Pursuant to Ginnie Mae servicing guidelines we have the unilateral right to repurchase these loans, and therefore must record them as loans held for sale on our balance sheet regardless of whether the repurchase option has been exercised.\nTEXAS CAPITAL BANCSHARES, INC. CONSOLIDATED STATEMENTS OF INCOME (UNAUDITED) (Dollars in thousands) 4th Quarter 3rd Quarter 2nd Quarter 1st Quarter 4th Quarter 2017 2017 2017 2017 2016 Interest income Interest and fees on loans $ 238,906 $ 229,116 $ 201,646 $ 176,624 $ 182,909 Securities 213 341 287 225 228 Federal funds sold and securities purchased under resale agreements 936 642 434 530 338 Deposits in other banks 9,464 7,544 5,824 6,567 5,196 Total interest income 249,519 237,643 208,191 183,946 188,671 Interest expense Deposits 27,625 22,435 16,533 13,293 10,432 Federal funds purchased 723 891 726 252 156 Other borrowings 5,380 4,835 2,901 2,021 1,863 Subordinated notes 4,191 4,191 4,191 4,191 4,191 Trust preferred subordinated debentures 951 930 881 830 806 Total interest expense 38,870 33,282 25,232 20,587 17,448 Net interest income 210,649 204,361 182,959 163,359 171,223 Provision for credit losses 2,000 20,000 13,000 9,000 9,000 Net interest income after provision for credit losses 208,649 184,361 169,959 154,359 162,223 Non-interest income Service charges on deposit accounts 3,109 3,211 3,067 3,045 2,940 Wealth management and trust fee income 1,767 1,627 1,402 1,357 1,244 Bank owned life insurance (BOLI) income 698 615 481 466 481 Brokered loan fees 5,692 6,152 5,809 5,678 7,249 Servicing income 5,270 4,486 3,700 2,201 1,410 Swap fees 586 647 954 1,803 536 Other 2,252 2,265 3,356 2,560 4,975 Total non-interest income 19,374 19,003 18,769 17,110 18,835 Non-interest expense Salaries and employee benefits 70,192 67,882 63,154 63,003 66,081 Net occupancy expense 6,749 6,436 6,515 6,111 5,937 Marketing 8,438 7,242 6,157 4,950 4,617 Legal and professional 8,756 6,395 7,127 7,453 6,443 Communications and technology 6,590 6,002 11,906 6,506 6,334 FDIC insurance assessment 6,710 6,203 4,603 5,994 6,573 Servicing related expenses 7,177 3,897 2,682 1,750 398 Allowance and other carrying costs for OREO 6,122 105 71 139 59 Other 12,404 10,668 9,599 10,188 10,081 Total non-interest expense 133,138 114,830 111,814 106,094 106,523 Income before income taxes 94,885 88,534 76,914 65,375 74,535 Income tax expense 50,143 29,850 25,819 22,833 26,149 Net income 44,742 58,684 51,095 42,542 48,386 Preferred stock dividends 2,437 2,438 2,437 2,438 2,437 Net income available to common shareholders $ 42,305 $ 56,246 $ 48,658 $ 40,104 $ 45,949\nTEXAS CAPITAL BANCSHARES, INC. QUARTERLY FINANCIAL SUMMARY - UNAUDITED Consolidated Daily Average Balances, Average Yields and Rates (Dollars in thousands) 4th Quarter 2017 3rd Quarter 2017 2nd Quarter 2017 1st Quarter 2017 4th Quarter 2016 Average\nBalance Revenue/\nExpense Yield/\nRate Average\nBalance Revenue/\nExpense Yield/\nRate Average\nBalance Revenue/\nExpense Yield/\nRate Average\nBalance Revenue/\nExpense Yield/\nRate Average\nBalance Revenue/\nExpense Yield/\nRate Assets Securities - Taxable $ 23,678 $ 213 3.57 % $ 86,087 $ 340 1.57 % $ 65,049 $ 287 1.77 % $ 31,905 $ 224 2.84 % $ 25,008 $ 221 3.53 % Securities - Non-taxable (2) — — — % — — — % — — — % 224 3 4.85 % 531 9 6.37 % Federal funds sold and securities purchased under resale agreements 292,544 936 1.27 % 205,938 642 1.24 % 174,264 434 1.00 % 276,910 530 0.78 % 254,008 338 0.53 % Interest-bearing deposits in other banks 2,924,942 9,464 1.28 % 2,383,060 7,544 1.26 % 2,250,330 5,824 1.04 % 3,312,256 6,567 0.80 % 3,812,076 5,197 0.54 % Loans held for sale, at fair value 1,144,124 11,507 3.99 % 1,009,703 9,882 3.88 % 845,623 8,235 3.91 % 1,064,322 9,535 3.63 % 944,484 7,903 3.33 % LHI, mortgage finance loans 5,102,107 44,477 3.46 % 4,847,530 42,294 3.46 % 3,805,831 33,399 3.52 % 2,757,566 23,105 3.40 % 4,371,475 35,081 3.19 % LHI (1)(2) 15,010,041 185,039 4.89 % 14,427,980 178,839 4.92 % 13,718,739 161,369 4.72 % 12,980,544 145,018 4.53 % 12,701,868 140,130 4.39 % Less allowance for loan losses 183,233 — — 172,774 — — 170,957 — — 169,318 — — 180,727 — — LHI, net of allowance 19,928,915 229,516 4.57 % 19,102,736 221,133 4.59 % 17,353,613 194,768 4.50 % 15,568,792 168,123 4.38 % 16,892,616 175,211 4.13 % Total earning assets 24,314,203 251,636 4.11 % 22,787,524 239,541 4.17 % 20,688,879 209,548 4.06 % 20,254,409 184,982 3.70 % 21,928,723 188,879 3.43 % Cash and other assets 766,622 713,778 632,097 606,762 595,671 Total assets $ 25,080,825 $ 23,501,302 $ 21,320,976 $ 20,861,171 $ 22,524,394 Liabilities and Stockholders’ Equity Transaction deposits $ 2,469,984 $ 5,845 0.94 % $ 2,145,324 $ 4,359 0.81 % $ 2,008,872 $ 2,893 0.58 % $ 2,008,401 $ 2,193 0.44 % $ 2,281,240 $ 2,129 0.37 % Savings deposits 8,403,473 20,655 0.98 % 7,618,843 17,152 0.89 % 6,952,317 12,940 0.75 % 6,989,748 10,483 0.61 % 6,711,083 7,592 0.45 % Time deposits 533,312 1,125 0.84 % 496,076 924 0.74 % 455,542 700 0.62 % 427,770 617 0.59 % 474,548 711 0.60 % Total interest bearing deposits 11,406,769 27,625 0.96 % 10,260,243 22,435 0.87 % 9,416,731 16,533 0.70 % 9,425,919 13,293 0.57 % 9,466,871 10,432 0.44 % Other borrowings 1,852,750 6,103 1.31 % 1,821,837 5,726 1.25 % 1,456,737 3,627 1.00 % 1,333,685 2,273 0.69 % 1,553,010 2,017 0.52 % Subordinated notes 281,348 4,191 5.91 % 281,256 4,191 5.91 % 281,167 4,191 5.98 % 281,076 4,191 6.05 % 280,985 4,191 5.93 % Trust preferred subordinated debentures 113,406 951 3.33 % 113,406 930 3.25 % 113,406 881 3.12 % 113,406 830 2.97 % 113,406 806 2.83 % Total interest bearing liabilities 13,654,273 38,870 1.13 % 12,476,742 33,282 1.06 % 11,268,041 25,232 0.90 % 11,154,086 20,587 0.75 % 11,414,272 17,446 0.61 % Demand deposits 9,085,819 8,764,263 7,863,402 7,547,338 9,129,668 Other liabilities 138,050 116,998 102,653 117,877 141,153 Stockholders’ equity 2,202,683 2,143,299 2,086,880 2,041,870 1,839,301 Total liabilities and stockholders’ equity $ 25,080,825 $ 23,501,302 $ 21,320,976 $ 20,861,171 $ 22,524,394 Net interest income (2) $ 212,766 $ 206,259 $ 184,316 $ 164,395 $ 171,433 Net interest margin 3.47 % 3.59 % 3.57 % 3.29 % 3.11 % (1) The loan averages include loans on which the accrual of interest has been discontinued and are stated net of unearned income. (2) Taxable equivalent rates used where applicable. INVESTOR CONTACT\nHeather Worley, 214.932.6646\nheather.worley@texascapitalbank.com\nSource:Texas Capital Bancshares, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/696d5c0c-dd1a-4541-8f73-99cca2b4485c", "https://www.globenewswire.com/Tracker?data=cAjebVg7M0hA0jR9z5fZxtSESLWTOorWIc01XUYz-q-OiiNHnpvjgZ5J9NZ01NTH-CGL_EWBoZTwcZ2LRtzjvkX3bnZdvUpSTk_2pziTbh4FIpjn_6wWw-s_Jfp3eouGNxMZy5a6Y-oWU373Bf6Ubw=="], "published": "2018-01-25T00:02:00.000+02:00", "crawled": "2018-01-25T02:32:56.015+02:00", "highlightTitle": ""}