{"organizations": [], "uuid": "a877119ccf43a1927953adcd3f65a83979fdd528", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226036269&w=1200&r=LYNXMPEE0R0KN", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-britain-politics-lidington/lidington-calls-for-unity-after-latest-brexit-skirmishes-idUKKBN1FH0N5", "country": "US", "domain_rank": 408, "title": "Lidington calls for unity after latest Brexit skirmishes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T16:36:00.000+02:00", "replies_count": 0, "uuid": "a877119ccf43a1927953adcd3f65a83979fdd528"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-politics-lidington/lidington-calls-for-unity-after-latest-brexit-skirmishes-idUKKBN1FH0N5", "ord_in_thread": 0, "title": "Lidington calls for unity after latest Brexit skirmishes", "locations": [], "entities": {"persons": [{"name": "lidington", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "david lidington", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "andrew macaskill", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cabinet office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 2:36 PM / Updated 32 minutes ago Lidington calls for unity after latest Brexit skirmishes Andrew MacAskill 3 Min Read \nLONDON (Reuters) - Britain’s Cabinet Office minister David Lidington urged his party to unite to heal growing rifts over how to leave the European Union that could threaten the prime minister’s fragile grip on the leadership. \nAfter a series of public rows in recent days, Lidington, who works closely with Prime Minister Theresa May, said all sides of the ruling centre-right Conservative party should unite to confront Jeremy Corbyn’s opposition Labour party. \n“What I say to all my colleagues is the Conservative family needs to come together in a spirit of mutual respect and look at what the bigger picture is showing,” Lidington told the BBC. \nMay is struggling to juggle competing demands from within her party on the best route out of the bloc which Britain is scheduled to leave in March 2019. \nIn comments likely to galvanise supporters of a clean break with the EU, U.S. President Donald Trump criticised the way May is negotiating Brexit. He said he would take a tougher line in the talks in an interview that will be broadcast later on Sunday. \nLidington stepped in after a series of public clashes over Brexit, the latest of which saw the former Northern Ireland secretary Theresa Villiers warn that Britain risked remaining in the EU “in all but name”. Britain's Cabinet Office Minister David Lidington appears on The Andrew Marr Show in London, Britain, January 28, 2018. Jeff Overs/BBC/Handout via REUTERS \nVilliers, a cabinet minister under Prime Minister David Cameron and who campaigned to leave the EU in the 2016 referendum, used an article in the Sunday Telegraph to warn against a deal that could lead to a “a dilution of Brexit”. \nMany Brexit backers are voicing concern that the referendum result may be betrayed with the government agreeing to have a two-year transition period with the EU in which little changes. \nBritain’s finance minister Philip Hammond enraged members of his party last week for saying the UK’s trade relations with the EU would change only “very modestly” after Brexit. \nMay has appeared vulnerable after calling an election last June only to lose her parliamentary majority. She has remained in power in part because her party remains too divided to rally around a potential successor. \nCorbyn has also faced criticism from his party to clarify what relationship he wants with the EU amid signs of growing support for a second vote on whether to leave the trading bloc. \nOn Sunday, Corbyn said he is not calling for a second referendum, but said his party may consider making future payments into the EU budget for access to the single market. \n“That’s some way down the line whether we need to do that or not,” he said. Reporting By Andrew MacAskill; Editing by Keith Weir", "external_links": [], "published": "2018-01-28T16:36:00.000+02:00", "crawled": "2018-01-28T17:13:08.008+02:00", "highlightTitle": ""}