{"organizations": [], "uuid": "083fa6910991692ef5172f7a7711d84b5c2cd817", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222708050&w=1200&r=LYNXMPEE0G0QA", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-nadal-pay/nadal-says-lower-ranked-players-need-more-money-idUKKBN1F61BQ", "country": "US", "domain_rank": 408, "title": "Nadal says lower-ranked players need more money", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T13:39:00.000+02:00", "replies_count": 0, "uuid": "083fa6910991692ef5172f7a7711d84b5c2cd817"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-nadal-pay/nadal-says-lower-ranked-players-need-more-money-idUKKBN1F61BQ", "ord_in_thread": 0, "title": "Nadal says lower-ranked players need more money", "locations": [], "entities": {"persons": [{"name": "nadal", "sentiment": "negative"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "rafa nadal", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "players’ council", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 11:43 AM / Updated 40 minutes ago Nadal says lower-ranked players need more money Ian Ransom 3 Min Read \nMELBOURNE (Reuters) - World number one Rafa Nadal voiced his support for players to demand a greater share of tennis revenues, saying that more lower-ranked professionals should be able to make a living from the sport. \nNadal’s comments follow media reports this week that Novak Djokovic, the president of the Players’ Council, had urged players to unionise at a pre-Australian Open meeting and revolt over the way the revenues from the four grand slams are distributed. \nThe 30-year-old Serb denied any threat of a boycott on Tuesday. \nNadal, a former vice-president of the Players’ Council, said tennis had improved “a lot” for lower-ranked players in recent years but felt more needed to be done. \n“Just to be clear, at some point, I don’t know 100 percent about what’s going on or not, but at some point, it’s good that the players speak between each other about what we want or what we don’t want,” he told reporters after winning his second round match against Argentine Leonardo Mayer on Wednesday. \n‘That’s all. (It‘s) not about union or not union. Forget about this ... I believe that the tennis improved a lot the last couple of years for the lower ranking players. \n”One sport is bigger not only when the top guys win a lot of money. It’s bigger when a sport creates a lot of jobs. \n”If there is 300 people living from tennis is better than if there is only 100. Tennis - Australian Open - Rod Laver Arena, Melbourne, Australia, January 17, 2018. Spain's Rafael Nadal prepares to serve during his match against Argentina's Leonardo Mayer. REUTERS/Issei Kato \n“But that’s my opinion. The real thing is if we can help at some point to the players that needs more help, will be fantastic.” \nTennis has been compared unfavourably with rival sports like soccer, golf and basketball in terms of the number of professionals able to make a living in the game and the overall share of wealth given to players. \nBut the Spaniard, who has earned $94,588,627 in prizemoney from the men’s professional ATP tour, suggested such comparisons were unhelpful. Tennis - Australian Open - Rod Laver Arena, Melbourne, Australia, January 17, 2018. Spain's Rafael Nadal in action during his match against Argentina's Leonardo Mayer. REUTERS/Issei Kato \n“You know what? The market is the market,” said the 31-year-old, who will play Bosnian 28th seed Damir Dzumhur for a place in the fourth round at Melbourne Park. \n”We cannot fight about the market. \n”Probably our sport is more global than football. \n”At the same time the sport is much bigger, football (more) than tennis, in terms of money, in terms of millions of fans. \n”But we cannot compare the sports. \n“We have to fight to make our sport better, bigger, and to have the best show possible for the crowd. Only like this we going to grow in all terms.” Editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-17T13:39:00.000+02:00", "crawled": "2018-01-17T14:34:32.009+02:00", "highlightTitle": ""}