{"organizations": [], "uuid": "8eb56853748f09e5eca66f74e2b2d66fbb44dd14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222971402&w=1200&r=LYNXMPEE0H0LZ", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-trump-israel-netanyahu/after-trump-denial-netanyahu-clarifies-remarks-on-timeframe-for-u-s-embassy-in-jerusalem-idUKKBN1F70XE", "country": "US", "domain_rank": 408, "title": "After Trump denial, Netanyahu clarifies remarks on timeframe for U.S. Embassy in Jerusalem", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T10:45:00.000+02:00", "replies_count": 0, "uuid": "8eb56853748f09e5eca66f74e2b2d66fbb44dd14"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-israel-netanyahu/after-trump-denial-netanyahu-clarifies-remarks-on-timeframe-for-u-s-embassy-in-jerusalem-idUKKBN1F70XE", "ord_in_thread": 0, "title": "After Trump denial, Netanyahu clarifies remarks on timeframe for U.S. Embassy in Jerusalem", "locations": [], "entities": {"persons": [{"name": "netanyahu", "sentiment": "negative"}, {"name": "benjamin netanyahu", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "jerusalem", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "u.s. embassy", "sentiment": "negative"}, {"name": "u.s. embassy in jerusalem reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 8:45 AM / Updated 7 hours ago After Trump denial, Netanyahu clarifies remarks on timeframe for U.S. Embassy in Jerusalem Reuters Staff 3 Min Read \nJERUSALEM (Reuters) - Israeli Prime Minister Benjamin Netanyahu took a step back on Thursday from comments, challenged by U.S. President Donald Trump, that envisioned a one-year timeframe for the planned relocation of the U.S. Embassy in Israel to Jerusalem. \nAn official in Netanyahu’s office said the prime minister recognised that construction of a new embassy will take years but believes Washington is considering “interim measures that could result in an embassy opening much faster”. \nThe official, who declined to be named, did not define those steps or mention any dates for a Jerusalem embassy to begin operating. In the past, Israeli media have speculated that, before a building is ready, the U.S. ambassador would operate part of the time out of a temporary location in Jerusalem. \nReversing decades of U.S. policy, Trump in early December recognised Jerusalem as Israel’s capital and set in motion the process of moving the embassy from Tel Aviv, imperilling Middle East peace efforts and upsetting the Arab world and Western allies alike. \nNetanyahu, according to Israeli reporters travelling with him on a trip to India, said on Wednesday: “My solid assessment is that it will go much faster than you think - within a year from now.” \nAsked about Netanyahu’s comment, Trump told Reuters in an interview that was not the case. “By the end of the year? We’re talking about different scenarios - I mean obviously that would be on a temporary basis. We’re not really looking at that. That’s no.” \nThe Israeli official, responding to Trump’s remarks, said: “The president and the prime minister are not saying anything different”. \nU.S. Secretary of State Rex Tillerson said last month the embassy move was “probably no earlier than three years out, and that’s pretty ambitious”, a timeframe that administration officials have attributed to the logistics of finding and securing a site as well as arranging housing for diplomats. \nJerusalem is home to sites holy to the Muslim, Jewish and Christian religions. The Palestinians want East Jerusalem, which Israel captured in the 1967 Arab-Israeli war and annexed in a move not recognised internationally, as the capital of their future state. Reporting by Jeffrey Heller; Additional reporting by Jeff Mason, Steve Holland and Roberta Rampton in Washington; Editing by Toby Chopra", "external_links": [], "published": "2018-01-18T10:45:00.000+02:00", "crawled": "2018-01-18T11:20:55.009+02:00", "highlightTitle": ""}