{"organizations": [], "uuid": "9dda9efaf56d6df2f7b7483c72544de951395701", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-meridian-bioscience-reports-first-quarter-2018-operating-results-declares-regular-first-quarter-cash-dividend-and-reaffirms.html", "country": "US", "domain_rank": 767, "title": "Meridian Bioscience Reports First Quarter 2018 Operating Results, Declares Regular First Quarter Cash Dividend, and Reaffirms Fiscal 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-25T15:15:00.000+02:00", "replies_count": 0, "uuid": "9dda9efaf56d6df2f7b7483c72544de951395701"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-meridian-bioscience-reports-first-quarter-2018-operating-results-declares-regular-first-quarter-cash-dividend-and-reaffirms.html", "ord_in_thread": 0, "title": "Meridian Bioscience Reports First Quarter 2018 Operating Results, Declares Regular First Quarter Cash Dividend, and Reaffirms Fiscal 2018 Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "cincinnati", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "meridian bioscience reports first", "sentiment": "neutral"}, {"name": "meridian bioscience, inc.", "sentiment": "neutral"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CINCINNATI, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Meridian Bioscience, Inc. (NASDAQ:VIVO) today:\nGENERAL HIGHLIGHTS\nreported first quarter net revenues of $52.3 million, an increase of 12% from the same period of the prior fiscal year; reported first quarter operating income of $8.1 million (including $1.5 million of costs associated with transition to a new CEO and litigation costs), a decrease of 20% from the same period of the prior fiscal year; reported first quarter net earnings of $6.3 million, or $0.15 per diluted share, on a GAAP basis, flat compared to the fiscal 2017 first quarter. On a non-GAAP basis, earnings were $6.5 million, or $0.15 per diluted share, an increase of 4% and flat, respectively. Non-GAAP basis excludes the effect of CEO transition costs, litigation costs and certain one-time tax effects of the recently-enacted U.S. Tax Cuts and Jobs Act (the “tax reform act”) (see non-GAAP financial measure reconciliation below); declared the regular quarterly cash dividend of $0.125 per share for the first quarter of fiscal 2018 (annual indicated rate of $0.50 per share); and reaffirmed its fiscal 2018 guidance of per share diluted earnings between $0.59 and $0.62 on a GAAP basis (between $0.65 and $0.68 on a non-GAAP basis) on net revenues of $207 million to $212 million, before the impact of the tax reform act.\nFINANCIAL HIGHLIGHTS (UNAUDITED)\nIn Thousands, Except per Share Data\nThree Months Ended December 31, 2017 2016 % Change Net Revenues $ 52,283 $ 46,809 12 % Operating Income 8,061 10,085 -20 % Net Earnings 6,302 6,279 - % Diluted Earnings per Share $ 0.15 $ 0.15 - % December 31, 2017 2016 Cash and Equivalents $ 54,711 $ 49,276 Working Capital 113,143 105,004 Long-term Debt 53,530 57,620 Shareholders’ Equity 172,878 165,732 Total Assets 251,951 250,055 TAX REFORM IMPACT\nOur GAAP net earnings for the quarter include the effects of the U.S. Tax Cuts and Jobs Act (the “tax reform act”), signed into law by the President during December. Included therein are (i) a benefit of $1.7 million ($0.04 per diluted share) primarily related to the re-measurement of our U.S. net deferred tax liabilities; and (ii) a provisional charge of $850,000 ($0.02 per diluted share) for the mandatory U.S. repatriation transition tax, based upon reasonable estimates of the income tax effects. Excluding discrete items, we preliminarily estimate our effective tax rate to range from 26% to 27% on a normalized basis during fiscal 2018. We are in the early stages of assessing the opportunities tax reform creates for us to invest in and further strengthen our business, and at this time, we have not made any decisions in this regard. Approximately 25% of our cash is held outside of the U.S. At this time, we do not expect a large influx of cash from overseas.\nCOMPANY COMMENTS\nJack Kenny, Chief Executive Officer, commented, “We are pleased with Meridian’s overall performance during the first quarter of fiscal 2018. Both our Diagnostics and Life Science segments contributed to the solid performance. Diagnostic revenues increased 11% over the fiscal 2017 first quarter (10% on a constant currency basis), while Life Science revenues grew 14% (12% on a constant currency basis). The healthy start to fiscal 2018 provides continued confidence that investment initiatives aimed at strengthening our business and developing new products remain on track.\nOur core diagnostics business got off to a great start in fiscal 2018, with revenues increasing 17% over the first quarter of fiscal 2017 (15% on a constant currency basis), benefitting from a lower comparable in the same period last year, as well as a strong respiratory season this year. Additionally, both our foodborne and H. pylori product families posted strong double-digit growth compared to the year-ago period. C. difficile revenues continue to be stable at approximately $5 million per quarter. The overall performance of this segment reflects the early success of initiatives aimed at improving our commercial effectiveness while we invest for future growth.\nOur Magellan lead testing business unit revenues declined by 20% in the quarter year-over-year. Magellan was impacted by reduced test volumes on LeadCare systems using venous blood and by a difficult comparable due to a large, non-repeating international order in the year-ago period. We continued to drive placements of LeadCare® II in the quarter, which will facilitate ongoing growth of this business. We anticipate a rebound in the Magellan business in the second quarter and a return to growth for the quarter. We are continuing to work with the FDA regarding the use of venous blood with Magellan’s LeadCare Testing Systems. We remain committed to strengthening Magellan’s quality system and ensuring that all aspects of the system are in full compliance. We take this issue very seriously and are continuing to progress with the highest sense of urgency.\nOur Life Science segment posted another strong quarter with revenues increasing 14% year-over-year (12% on a constant currency basis), with both our immunoassay components and reagents unit, and our molecular components unit, posting double-digit growth. Investments in the Asia-Pacific markets continue to perform well, with revenues in China growing approximately 115% over last year’s comparable quarter. We continue to be very pleased with the performance of this segment.\nDuring the quarter we made progress on a number of research and development initiatives. The development of our Curian platform, leveraging both optical and fluorescent technologies, is progressing nicely. We expect this platform and initial assays to launch in early calendar 2019 and contribute to revenues in the second half of fiscal 2019. Our illumi gene CMV, the first molecular test for cytomegalovirus, is targeted to launch late in calendar year 2018. This test is designed to detect the presence of cytomegalovirus in newborns, which can cause hearing loss as well as intellectual disability. We are making continued progress in our development of our H. pylori /Clarithromycin resistance assay and expect to enter clinical trials near the end of calendar 2018. We remain confident that we are deploying our investments towards products and platforms that will not only grow Meridian’s top- and bottom-line as we move beyond fiscal 2018, but importantly, serve to improve patient outcomes.\nOur financial position remains solid, and cash flows from operating activities remain strong. We continue to evaluate opportunities for collaboration and potential acquisitions.\nAs we evaluate our businesses, we will continue to search for areas where we can further improve operational efficiency and position the Company for higher growth. The Meridian team is motivated towards these efforts. We look forward to providing more detail on these initiatives in subsequent quarters as we move through this process.\nOur business outlook for fiscal 2018 remains unchanged. Overall, we believe the Diagnostics segment is on track, with strong respiratory revenues offsetting recent weakness in our lead testing revenues. Our Life Science segment is also on track, with good growth coming from both the immunoassay and molecular component businesses. We recognize we will have a difficult comparison for the second quarter; however, our solid start to the year is encouraging. We are currently evaluating the impact of the tax reform act and will publish updated guidance to reflect these tax revisions once our evaluation is complete.”\nCASH DIVIDEND MATTERS\nThe Board of Directors declared the regular quarterly cash dividend of $0.125 per share for the first quarter ended December 31, 2017. The dividend is payable on February 15, 2018 to shareholders of record as of the close of business on February 5, 2018. Guided by the Company’s policy of setting a payout ratio of between 75% and 85% of each fiscal year’s expected net earnings, the actual declaration and amount of dividends will be determined by the Board of Directors in its discretion based upon its evaluation of earnings on both a GAAP and non-GAAP basis, cash flow requirements and future business developments, including any acquisitions and other factors deemed relevant by the Board.\nFISCAL 2018 GUIDANCE REAFFIRMED\nExcluding the impact of the tax reform act, for the fiscal year ending September 30, 2018, management expects net revenues to be in the range of $207 million to $212 million and per share diluted earnings to be between $0.59 and $0.62 on a GAAP basis. On a non-GAAP basis, fiscal 2018 earnings are expected to be between $0.65 and $0.68 per diluted share The per share estimates assume an increase in average diluted shares outstanding from approximately 42.6 million at fiscal 2017 year end to approximately 42.8 million at fiscal 2018 year end.\nThe Company is evaluating the overall impact of the tax reform act. We will adjust guidance at a later date after management’s further assessment and upon the issuance of additional interpretations and guidance on the tax reform act. The impact of the tax reform act during the first quarter is described above in “TAX REFORM IMPACT”. Overall, we expect the impact of the tax reform act to be favorable for the year, given the expectation that a lower effective tax rate and the one-time favorable impact of re-measuring deferred tax balances will more than offset the repatriation transition tax.\nThe revenue and earnings guidance provided in this press release is derived from expected internal growth and does not include the impact of any acquisitions the Company may complete during fiscal 2018.\nFINANCIAL CONDITION\nThe Company’s financial condition remains sound. At December 31, 2017, current assets were $136.6 million compared to current liabilities of $23.5 million, resulting in working capital of $113.1 million and a current ratio of 5.8. Cash and equivalents were $54.7 million, and the Company had 100% borrowing capacity under its $30.0 million commercial bank credit facility. The Company’s bank-debt obligations, all of which were incurred in connection with the 2016 acquisition of Magellan, totaled $53.5 million as of December 31, 2017.\nFIRST QUARTER UNAUDITED OPERATING RESULTS\n(In Thousands, Except per Share Data)\nThe following table sets forth the unaudited comparative results of Meridian on a U.S. GAAP basis for the first quarters of fiscal 2018 and fiscal 2017.\nThree Months Ended December 31, 2017 2016 Net revenues $ 52,283 $ 46,809 Cost of sales 20,497 17,770 Gross profit 31,786 29,039 Operating expenses Research and development 4,496 3,597 Selling and marketing 8,842 7,618 General and administrative 8,904 7,739 CEO transition and litigation costs 1,483 - Total operating expenses 23,725 18,954 Operating income 8,061 10,085 Other income (expense), net (403) (426) Earnings before income taxes 7,658 9,659 Income tax provision 1,356 3,380 Net earnings $ 6,302 $ 6,279 Net earnings per basic common share $ 0.15 $ 0.15 Basic common shares outstanding 42,263 42,159 Net earnings per diluted common share $ 0.15 $ 0.15 Diluted common shares outstanding 42,662 42,535\nThe following table sets forth the unaudited segment data for the interim periods in fiscal 2018 and fiscal 2017 (in thousands).\nThree Months Ended December 31, 2017 2016 Net Revenues Diagnostics $ 37,490 $ 33,808 Life Science 14,793 13,001 $ 52,283 $ 46,809 Operating Income Diagnostics $ 5,291 $ 6,643 Life Science 2,784 3,267 Eliminations (14) 175 $ 8,061 $ 10,085 NON-GAAP FINANCIAL MEASURES\nIn this press release, we have supplemented our reported GAAP financial information with information on net earnings, basic earnings per share and diluted earnings per share excluding the effects of CEO transition costs, litigation costs and certain one-time tax effects of the tax reform act. We have provided in the tables below reconciliations of net earnings, basic earnings per share and diluted earnings per share, with and without the effects of these non-routine items, for the first quarters ended December 31, 2017 and December 31, 2016.\nWe believe this information is useful to an investor in evaluating our performance because:\nThese measures help investors to more meaningfully evaluate and compare the results of operations from period to period by removing the impacts of these non-routine items; and\nThese measures are used by our management for various purposes, including evaluating performance against incentive bonus achievement targets, comparing performance from period to period in presentations to our board of directors, and as a basis for strategic planning and forecasting.\nThese non-GAAP measures may be different from non-GAAP measures used by other companies. In addition, the non-GAAP measures are not based on any comprehensive set of accounting rules or principles. Non-GAAP measures have limitations, in that they do not reflect all amounts associated with our results as determined in accordance with U.S. GAAP. Therefore, these measures should only be used to evaluate our results in conjunction with corresponding GAAP measures.\nFIRST QUARTER\nGAAP TO NON-GAAP RECONCILATION TABLES\n(In Thousands, Except per Share Data)\nThree Months Ended December 31, 2017 2016 Net Earnings - U.S. GAAP basis $ 6,302 $ 6,279 CEO transition and litigation costs* 1,080 - One-time benefit from tax law change (1,695) - Repatriation transition tax 854 - Adjusted Earnings $ 6,541 $ 6,279 Net Earnings per Basic Common Share - U.S. GAAP basis $ 0.15 $ 0.15 CEO transition and litigation costs 0.03 - One-time benefit from tax law change (0.04) - Repatriation transition tax 0.02 - Adjusted Basic EPS $ 0.15 ** $ 0.15 Net Earnings per Diluted Common Share - U.S. GAAP basis $ 0.15 $ 0.15 CEO transition and litigation costs 0.03 - One-time benefit from tax law change (0.04) - Repatriation transition tax 0.02 - Adjusted Diluted EPS $ 0.15 ** $ 0.15 * Net of tax\n** Does not sum to total due to rounding.\nFORWARD-LOOKING STATEMENTS\nThe Private Securities Litigation Reform Act of 1995 provides a safe harbor from civil litigation for forward-looking statements accompanied by meaningful cautionary statements. Except for historical information, this report contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, which may be identified by words such as “estimates”, “anticipates”, “projects”, “plans”, “seeks”, “may”, “will”, “expects”, “intends”, “believes”, “should” and similar expressions or the negative versions thereof and which also may be identified by their context. All statements that address operating performance or events or developments that Meridian expects or anticipates will occur in the future, including, but not limited to, statements relating to per share diluted earnings and revenue, are forward-looking statements. Such statements, whether expressed or implied, are based upon current expectations of the Company and speak only as of the date made. Specifically, Meridian’s forward-looking statements are, and will be, based on management’s then-current views and assumptions regarding future events and operating performance. Meridian assumes no obligation to publicly update or revise any forward-looking statements even if experience or future changes make it clear that any projected results expressed or implied therein will not be realized. These statements are subject to various risks, uncertainties and other factors that could cause actual results to differ materially, including, without limitation, the following:\nMeridian’s operating results, financial condition and continued growth depends, in part, on its ability to introduce into the marketplace enhancements of existing products or new products that incorporate technological advances, meet customer requirements and respond to products developed by Meridian’s competition, its ability to effectively sell such products and its ability to successfully expand and effectively manage increased sales and marketing operations. While Meridian has introduced a number of internally developed products, there can be no assurance that it will be successful in the future in introducing such products on a timely basis or in protecting its intellectual property, and unexpected or costly manufacturing costs associated with the ramp up of new products could cause actual results to differ from expectations. Meridian relies on proprietary, patented and licensed technologies. As such, the Company’s ability to protect its intellectual property rights, as well as the potential for intellectual property litigation, would impact its results. Ongoing consolidations of reference laboratories and formation of multi-hospital alliances may cause adverse changes to pricing and distribution. Recessionary pressures on the economy and the markets in which our customers operate, as well as adverse trends in buying patterns from customers, can change expected results. Costs and difficulties in complying with laws and regulations, including those administered by the United States Food and Drug Administration, can result in unanticipated expenses and delays and interruptions to the sale of new and existing products, as can the uncertainty of regulatory approvals and the regulatory process. The international scope of Meridian’s operations, including changes in the relative strength or weakness of the U.S. dollar and general economic conditions in foreign countries, can impact results and make them difficult to predict. One of Meridian’s growth strategies is the acquisition of companies and product lines. There can be no assurance that additional acquisitions will be consummated or that, if consummated, will be successful and the acquired businesses will be successfully integrated into Meridian’s operations. There may be risks that acquisitions may disrupt operations and may pose potential difficulties in employee retention, and there may be additional risks with respect to Meridian’s ability to recognize the benefits of acquisitions, including potential synergies and cost savings or the failure of acquisitions to achieve their plans and objectives. Meridian cannot predict the outcome of goodwill impairment testing and the impact of possible goodwill impairments on Meridian’s earnings and financial results. Meridian cannot predict the possible impact of U.S. health care legislation enacted in 2010 – the Patient Protection and Affordable Care Act, as amended by the Health Care and Education Reconciliation Act – and any modification or repeal of any of the provisions thereof initiated by Congress or the presidential administration, and any similar initiatives in other countries on its results of operations. Efforts to reduce the U.S. federal deficit, breaches of Meridian’s information technology systems, and natural disasters and other events could have a materially adverse effect on Meridian’s results of operations and revenues. We have identified a material weakness in our internal control over financial reporting that, if not properly corrected, could materially adversely affect our operations and result in material misstatements in our financial statements. In addition to the factors described in this paragraph, as well as those factors identified from time to time in our filings with the Securities and Exchange Commission, Part I, Item 1A Risk Factors of our most recent Annual Report on Form 10-K contains a list and description of uncertainties, risks and other matters that may affect the Company. Readers should carefully review these forward-looking statements and risk factors, and not place undue reliance on our forward-looking statements.\nAbout Meridian Bioscience, Inc.\nMeridian is a fully integrated life science company that develops, manufactures, markets and distributes a broad range of innovative diagnostic test kits, rare reagents, specialty biologicals and components. Utilizing a variety of methods, our diagnostic tests provide accuracy, simplicity and speed in the early diagnosis and treatment of common medical conditions, such as infections and lead poisoning. Meridian’s diagnostic products are used outside of the human body and require little or no special equipment. The Company’s diagnostic products are designed to enhance patient well-being while reducing the total outcome costs of health care. Meridian has strong market positions in the areas of gastrointestinal and upper respiratory infections, and blood lead level testing. In addition, Meridian is a supplier of rare reagents, specialty biologicals and components used by organizations in the life science and agri-bio industries engaged in research. Many companies also utilize Meridian’s products as components in the manufacture of diagnostics. The Company markets its products and technologies to hospitals, reference laboratories, research centers, diagnostics manufacturers, and agri-bio companies in more than 70 countries around the world. The Company’s shares are traded on the NASDAQ Global Select Market, symbol VIVO. Meridian’s website address is www.meridianbioscience.com .\nContact:\nJack Kenny\nChief Executive Officer\nMeridian Bioscience, Inc.\nPhone: 513.271.3700\nEmail: mbi@meridianbioscience.com\nSource:Meridian Bioscience Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=CWnHGYNetUjz1HfEa-Fb1WLsUDRgoqb8KripM_jE1B-LVv4xctLqGbuScfZvNgKFI37c7m6OQlRsdYD9BElScQVLuH7pW4a_ebvSZ3hlMCZ5Ygq591k-WwFVkroLFsx-", "https://www.globenewswire.com/Tracker?data=1z559UPLAEr296xthUUGFOHcl2znWCQ7eL4ZclPILvLIvCwICcDJJbvg2qd2uzqnYwR7iFY-t45DQmM9MrABDJYZr_m64-lxJaJfhGhq79d4agEkGFlbCeRGduL70WaweZdaQtKWqdomdO-UYmiEzV14nIkKeXBH_wfExFRsj5rbeGwyG5-HMiMjhKfiREeUGiEY23pfRNmafM8CNWuGzF5y7XbZ3FZfHMjmRzKxXO3HqYMW8mCiYUOiZM-9786dlSQG-lXx_SuwmSTOPuA2hxUq9wXYCxDjylKFPKXW5M52vgfnH4khQSXa1fUasFI8D1FqYItC_2UenPTuPPh94M4awkq-iDJLKk10eCuPqIA=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/247cce87-e874-4a65-ba10-d0e7ed498732"], "published": "2018-01-25T15:15:00.000+02:00", "crawled": "2018-01-25T16:59:47.015+02:00", "highlightTitle": ""}