{"organizations": [], "uuid": "b7da9c1ed0c33cf774a93a414809b4922a9c9b2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224089050&w=1200&r=LYNXMPEE0L0K6", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-israel-pence/pence-on-israel-visit-meets-netanyahu-idUKKBN1FB0TU", "country": "US", "domain_rank": 408, "title": "Pence, on Israel visit, meets Netanyahu", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T10:26:00.000+02:00", "replies_count": 0, "uuid": "b7da9c1ed0c33cf774a93a414809b4922a9c9b2f"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-israel-pence/pence-on-israel-visit-meets-netanyahu-idUKKBN1FB0TU", "ord_in_thread": 0, "title": "Pence, on Israel visit, meets Netanyahu", "locations": [], "entities": {"persons": [{"name": "netanyahu", "sentiment": "negative"}, {"name": "netanyahu reuters s", "sentiment": "negative"}, {"name": "benjamin netanyahu", "sentiment": "none"}, {"name": "dan williams", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "min read  jerusalem", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 8:27 AM / Updated 19 minutes ago U.S. Embassy in Israel to move to Jerusalem by end of 2019 - Pence Jeff Mason , Jeffrey Heller 4 Min Read \nJERUSALEM (Reuters) - The U.S. Embassy in Israel will move to Jerusalem by the end of 2019, U.S. Vice President Mike Pence said in a speech to the Israeli parliament on Monday that highlighted a policy shift that has stoked Palestinian anger and international concern. \nPresident Donald Trump last month recognised Jerusalem as the capital of Israel and said he would move the U.S. Embassy there - dismaying Palestinians who claim the eastern part of the city and angering Arab states across the region. \n“In the weeks ahead, our administration will advance its plan to open the United States Embassy in Jerusalem – and that United States Embassy will open before the end of next year,” Pence said. \n“Jerusalem is Israel’s capital – and, as such, President Trump has directed the State Department to immediately begin preparations to move the United States Embassy from Tel Aviv to Jerusalem.” \nThe speech was briefly disrupted, at the outset, by Israeli Arab parliament members who held up protest signs in Arabic and English, reading “Jerusalem is the capital of Palestine”, and were ejected by ushers. \nPence responded to the fracas by saying with a smile: “It is deeply humbling for me to stand before this vibrant democracy.” \nThough shunned by the Palestinians, the Trump administration says it remains committed to helping them and Israel negotiate a peace deal. Those talks have been stalled for almost four years. \n“FAIR MEDIATOR” U.S. Vice President Mike Pence (C) stands next to Israeli Prime Minister Benjamin Netanyahu (R) during a formal reception ceremony at the Prime Minister's office in Jerusalem January 22, 2018. REUTERS/Ronen Zvulun \nResponding to Pence’s speech, Nabil Abu Rdainah, a spokesman for Palestinian President Mahmoud Abbas, said: “If the United States wanted to a play a role of a mediator in the peace process it must be a fair mediator and it must abide by (international) resolutions.” \nPalestinians seek East Jerusalem, including the walled Old City with its holy sites, as the capital of their own future state. Israel, which annexed East Jerusalem after capturing it in 1967 in a move not internationally recognised, regards all of the city as its “eternal and indivisible capital”. \nPence, who visited Egypt and Jordan before travelling to Israel, said that with its policy shift on Jerusalem, “the United States has chosen fact over fiction - and fact is the only true foundation for a just and lasting peace”. Slideshow (2 Images) \nIt was the highest-ranking visit by a U.S. official to the region since Trump’s Jerusalem declaration and gave Pence and Netanyahu an opportunity to highlight their own warm relationship for a conservative Christian American community that serves as a power base for the U.S. administration. \nPence, an evangelical Christian, drew parallels between Jewish history dating back to biblical times and the European pilgrims who founded the United States. He was greeted with ovations by Israeli legislators throughout his speech. \nNoting that Israel will in May mark 70 years since its founding - in a war Palestinians mourn as a catastrophe - Pence switched to Hebrew to recite a Jewish prayer of thanksgiving. Related Coverage U.S. embassy to move to Jerusalem by the end of 2019 - Pence \nWelcoming Pence to the parliament, Netanyahu said he was the first U.S. vice president to have been accorded the honour. \nIsrael and the United States “are striving together to achieve a true peace, lasting peace, peace with all our neighbours, including the Palestinians,” Netanyahu said. \nHe reiterated his long-standing demand that the Palestinians recognise “the Jewish people’s right to a nation state in its land, a nation state of its own here in the land of Israel”. The Palestinians have ruled out such recognition, saying it would disadvantage Israel’s Arab minority. Writing by Jeffrey Heller and Dan Williams; Editing by Stephen Farrell and John Stonestreet, William Maclean", "external_links": [], "published": "2018-01-22T10:26:00.000+02:00", "crawled": "2018-01-22T10:36:03.007+02:00", "highlightTitle": ""}