{"organizations": [], "uuid": "2a4e9989b9b4f9231790c76d688360e98b496406", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-pacwest-bancorp-announces-results-for-the-fourth-quarter-and-full-year-2017.html", "country": "US", "domain_rank": 767, "title": "PacWest Bancorp Announces Results for the Fourth Quarter and Full Year 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.796, "site_type": "news", "published": "2018-01-18T15:00:00.000+02:00", "replies_count": 0, "uuid": "2a4e9989b9b4f9231790c76d688360e98b496406"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-pacwest-bancorp-announces-results-for-the-fourth-quarter-and-full-year-2017.html", "ord_in_thread": 0, "title": "PacWest Bancorp Announces Results for the Fourth Quarter and Full Year 2017", "locations": [], "entities": {"persons": [{"name": "bill", "sentiment": "negative"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "cu bancorp", "sentiment": "negative"}, {"name": "pacwest bancorp", "sentiment": "negative"}, {"name": "per diluted share new loan and lease production", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth Quarter 2017 Highlights\nCU Bancorp (“CUB”) Acquisition Closed October 20, 2017 Sold $1.5 Billion of Cash Flow Loans Net Earnings of $84.0 Million, or $0.66 Per Diluted Share New Loan and Lease Production of $1.6 Billion and Annualized Growth Excluding Acquired and Sold Loans of 17% Classified Loans and Leases Reduced by 19% Tax Benefit of $1.2 Million from Enactment of Tax Cuts and Jobs Act\nFull Year 2017 Highlights\nNet Earnings of $357.8 Million, or $2.91 Per Diluted Share New Loan and Lease Production of $4.7 Billion and Growth Excluding Acquired and Sold Loans of 7% Core Deposits Growth of $3.4 Billion, Including $2.7 Billion from CUB Acquisition Tax Equivalent Net Interest Margin of 5.10% Classified Loans and Leases Reduced by 32%\nLOS ANGELES, Jan. 18, 2018 (GLOBE NEWSWIRE) -- PacWest Bancorp (Nasdaq:PACW) today announced net earnings for the fourth quarter of 2017 of $84.0 million, or $0.66 per diluted share, compared to net earnings for the third quarter of 2017 of $101.5 million, or $0.84 per diluted share. Net earnings for the full year 2017 were $357.8 million, or $2.91 per diluted share, compared to net earnings for the full year 2016 of $352.2 million, or $2.90 per diluted share.\nThe decrease in net earnings from the prior quarter was due primarily to higher noninterest expense, higher income tax expense and lower noninterest income offset by higher net interest income and a lower provision for credit losses. Noninterest expense for the fourth quarter of 2017 was higher mainly due to an increase in acquisition, integration and reorganization costs of $14.6 million related to the CUB acquisition and integration. Income tax expense for the fourth quarter of 2017 was higher as the third quarter of 2017 reflected a $13.6 million reversal of a valuation allowance related to tax credits, while the fourth quarter reflected a $2.0 million increase in the valuation allowance. Noninterest income for the fourth quarter of 2017 declined mainly due to the tax-related decision to sell certain securities resulting in a loss for the quarter of $3.3 million.\nMatt Wagner, President and CEO, commented, “Although the fourth quarter included several significant items, the benefits of the CUB acquisition for our future profitability were apparent in our fourth quarter results. Interest income on loans and leases increased 10% over the prior quarter, core deposits increased to 85% of total deposits, and the CUB integration as well as the vast majority of cost save initiatives were achieved in December. We are on track to achieve the remainder of our targeted expense savings during the first quarter of 2018.”\nMr. Wagner continued, “Our organic loan growth of $684 million in the fourth quarter was the strongest of the year. The fourth quarter sale of $1.5 billion in cash flow loans and the exit from the CapitalSource Division origination operations related to general, technology, and healthcare cash flow loans allows us to focus on profitably growing our other businesses.”\nMr. Wagner added, “The strong fourth quarter capped a year of profitable growth and continued our solid operating performance resulting in a 2017 return on assets of 1.58% and return on tangible equity of 15.15%. These outstanding operating results allowed us to return $347 million to our stockholders in 2017 through stock repurchases and dividends, including $100 million of stock repurchases in the fourth quarter.”\nFINANCIAL HIGHLIGHTS\nAt or For the Three Months Ended At or For the Year Ended December 31, September 30, December 31, Financial Highlights (1) 2017 2017 Change 2017 2016 Change (Dollars in thousands, except per share data) Net earnings $ 84,037 $ 101,466 $ (17,429 ) $ 357,818 $ 352,166 $ 5,652 Diluted earnings per share $ 0.66 $ 0.84 $ (0.18 ) $ 2.91 $ 2.90 $ 0.01 Return on average assets 1.34 % 1.82 % (0.48 ) 1.58 % 1.66 % (0.08 ) Return on average tangible equity (2) 13.75 % 16.85 % (3.10 ) 15.15 % 15.52 % (0.37 ) Net interest margin (tax equivalent) 4.97 % 5.08 % (0.11 ) 5.10 % 5.40 % (0.30 ) Efficiency ratio 41.0 % 40.4 % 0.6 40.8 % 39.8 % 1.0 Total assets $ 24,994,876 $ 22,242,932 $ 2,751,944 $ 24,994,876 $ 21,869,767 $ 3,125,109 Loans and leases held for investment, net of deferred fees $ 16,972,743 $ 15,690,517 $ 1,282,226 $ 16,972,743 $ 15,455,954 $ 1,516,789 Noninterest-bearing deposits $ 8,508,044 $ 6,911,874 $ 1,596,170 $ 8,508,044 $ 6,659,016 $ 1,849,028 Core deposits $ 15,937,012 $ 13,531,300 $ 2,405,712 $ 15,937,012 $ 12,523,834 $ 3,413,178 Total deposits $ 18,865,536 $ 16,773,245 $ 2,092,291 $ 18,865,536 $ 15,870,611 $ 2,994,925 Noninterest-bearing deposits as percentage of total deposits 45 % 41 % 4 45 % 42 % 3 Core deposits as percentage of total deposits 85 % 81 % 4 85 % 79 % 6 Equity to assets ratio 19.91 % 20.73 % (0.82 ) 19.91 % 20.48 % (0.57 ) Tangible common equity ratio (2) 10.50 % 12.02 % (1.52 ) 10.50 % 11.54 % (1.04 ) Book value per share $ 38.65 $ 37.96 $ 0.69 $ 38.65 $ 36.93 $ 1.72 Tangible book value per share (2) $ 18.24 $ 19.84 $ (1.60 ) $ 18.24 $ 18.71 $ (0.47 ) (1) The operations of CU Bancorp are included from its October 20, 2017 acquisition date. (2) Non-GAAP measure. INCOME STATEMENT HIGHLIGHTS\nNet Interest Income\nNet interest income increased by $21.3 million to $263.0 million for the fourth quarter of 2017 compared to $241.7 million for the third quarter of 2017 due mainly to higher average loan and lease balances primarily from the CUB acquisition. The loan and lease yield was 5.89% for the fourth quarter of 2017 compared to 6.01% for the third quarter of 2017. The decrease in the loan and lease yield was principally due to a lower yield on the acquired CUB loans, offset partially by an increase in discount accretion on acquired loans. Total discount accretion on acquired loans was $6.8 million for the fourth quarter of 2017 (15 basis points on the loan and lease yield) compared to $5.5 million for the third quarter of 2017 (14 basis points on the loan and lease yield). A total discount of $37.0 million was recorded in connection with the acquired CUB loan portfolio, of which $2.9 million was accreted during the fourth quarter. The total remaining acquired loan discount as of December 31, 2017 was $56.9 million.\nThe tax equivalent NIM was 4.97% for the fourth quarter of 2017 compared to 5.08% for the third quarter of 2017. The decrease in the NIM was mostly due to the lower yield on the CUB loans and securities and a higher cost of average interest-bearing liabilities, offset partially by the increase in discount accretion on acquired loans. Total discount accretion on acquired loans contributed 13 basis points to the NIM for the fourth quarter of 2017 and 11 basis points for the third quarter of 2017.\nThe cost of average total deposits decreased to 0.30% for the fourth quarter of 2017 from 0.31% for the third quarter of 2017 due to the lower cost of the deposits acquired from CUB.\nNoninterest Income\nNoninterest income decreased by $4.6 million to $26.8 million for the fourth quarter of 2017 compared to $31.4 million for the third quarter of 2017 due mainly to a $4.6 million decrease in the gai", "external_links": [], "published": "2018-01-18T15:00:00.000+02:00", "crawled": "2018-01-18T16:20:39.020+02:00", "highlightTitle": ""}