{"organizations": [], "uuid": "2817bd19f307c3c9bbc7c79518f0096a29306c87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-skyline-and-champion-home-builders-to-host-conference-call-on-proposed-business-combination-on-thursday-january-25.html", "country": "US", "domain_rank": 767, "title": "Skyline and Champion Home Builders to Host Conference Call on Proposed Business Combination on Thursday, January 25", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T03:00:00.000+02:00", "replies_count": 0, "uuid": "2817bd19f307c3c9bbc7c79518f0096a29306c87"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-skyline-and-champion-home-builders-to-host-conference-call-on-proposed-business-combination-on-thursday-january-25.html", "ord_in_thread": 0, "title": "Skyline and Champion Home Builders to Host Conference Call on Proposed Business Combination on Thursday, January 25", "locations": [], "entities": {"persons": [], "locations": [{"name": "ind.", "sentiment": "none"}, {"name": "elkhart", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "skyline corporation", "sentiment": "negative"}, {"name": "about skyline corporation", "sentiment": "none"}, {"name": "champion enterprises holdings", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ELKHART, Ind., Skyline Corporation (\"Skyline\" or the \"Company\") will hold a conference call at 9:00 am Eastern Time on Thursday, January 25, 2018 to discuss the previously announced definitive agreement to combine operations with Champion Enterprises Holdings, LLC (\"Champion\"). Members of executive management of Champion also will participate in the conference call. To participate in the live conference call, dial 1-877-407-0784 (U.S. and Canada) or 1-201-689-8560 (International). Presentation slides to accompany the call will be available on the Company's Investor Relations web site at http://www.skylinecorp.com . To access the replay of the call, dial 1-844-512-2921 (U.S. & Canada) or 1-412-317-6671 (International), replay pin number 13675884.\nAbout Skyline Corporation:\nSkyline Corporation and its consolidated subsidiaries design, produce, and market manufactured housing, modular housing, and park models to independent dealers, developers, campgrounds, and manufactured housing communities located throughout the United States and Canada. The company has eight manufacturing facilities in seven states. Skyline Corporation was originally incorporated in Indiana in 1959, as successor to a business founded in 1951, and is one of the largest producers of manufactured and modular housing in the United States. For more information, visit http://www.skylinecorp.com .\nAbout Champion Enterprises Holdings, LLC :\nChampion Enterprises Holdings, LLC was formed in 2010 as the parent company of Champion Home Builders, Inc. which was founded in 1953. Champion Home Builders specializes in a wide variety of manufactured and modular homes, park-model RVs and modular buildings for the multi-family, hospitality, senior and workforce housing sectors. The company operates 28 manufacturing facilities throughout North America. Additionally, Champion operates a factory-direct retail business, Titan Factory Direct, with 21 retail locations spanning the southern U.S., and Star Fleet Trucking, providing transportation services to the manufactured housing industry from 10 dispatch locations across the United States. Champion is majority owned by funds affiliated with Bain Capital Credit ( https://www.baincapitalcredit.com ), Centerbridge Partners, L.P. ( https://www.centerbridge.com ), and MAK Capital. For more information, visit https://www.championhomes.com .\nForward-Looking Statements\nExcept for historical information contained herein, this document expresses \"forward-looking statements\" which are intended to be covered by the safe harbor for forward-looking statements provided by the Private Securities Litigation Reform Act of 1995, as amended. Such matters include forward-looking statements regarding the prospective effects and timing of the proposed share contribution and exchange transaction with Champion (the \"Exchange\"). Generally, the words \"believe,\" \"expect,\" \"intend,\" \"estimate,\" \"project,\" \"will,\" and similar expressions indicate forward-looking statements. Those statements, including statements, projections, estimates, or assumptions concerning future events or performance, and other statements that are other than statements of historical fact, are subject to material risks and uncertainties. Skyline cautions readers not to place undue reliance on any forward-looking statements, which speak only as of the date made. Skyline may make other written or oral forward-looking statements from time to time. Readers are advised that various important factors could cause Skyline's actual results or circumstances for future periods to differ materially from those anticipated or projected in such forward-looking statements. Such factors, among others, include, but are not limited to: potential failure to obtain shareholder approval of the Exchange-related matters to be submitted to Skyline's shareholders (the \"Company Shareholder Approval Matters\"); potential failure to obtain regulatory approval for the Exchange or to satisfy other conditions to the consummation of the Exchange on the proposed terms and within the proposed timeframes; costs or difficulties relating to integration matters might be greater than expected; material adverse changes in Skyline's operations or earnings; changes in laws, regulations, or accounting principles generally accepted in the United States; the effect of the recently enacted Tax Cuts and Jobs Act on Skyline and its subsidiaries; Skyline's competitive position within the markets it serves; unforeseen downturns in the local, regional, or national economies or in the specific regions in which Skyline has market concentrations; and other risks discussed in Skyline's filings with the SEC, including its Annual Report on Form 10-K, which filings are available from the SEC. Skyline undertakes no obligation to publicly update or revise any forward-looking statements except as required by law.\nAdditional Information for Shareholders\nIn connection with the Company Shareholder Approval Matters and the proposed Exchange, Skyline will prepare a proxy statement to be filed with the SEC. When completed, a definitive proxy statement and a form of proxy will be mailed to the shareholders of Skyline. The proxy statement will contain important information about the Company Shareholder Approval Matters and the proposed Exchange and related matters. SKYLINE'S SHAREHOLDERS ARE URGED TO READ ALL RELEVANT DOCUMENTS FILED WITH THE SEC, INCLUDING THE DEFINITIVE PROXY STATEMENT REGARDING THE PROPOSED EXCHANGE (INCLUDING ALL AMENDMENTS AND SUPPLEMENTS) CAREFULLY AND IN THEIR ENTIRETY WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE COMPANY SHAREHOLDER APPROVAL MATTERS AND THE PROPOSED EXCHANGE. Skyline's shareholders will be able to obtain, without charge, a copy of the proxy statement (when available) and other relevant documents filed with the SEC from the SEC's website at http://www.sec.gov . Skyline's shareholders also will be able to obtain, without charge, a copy of the proxy statement and other relevant documents (when available) by directing a request by mail or telephone to Skyline Corporation, 2520 By-Pass Road, P.O. Box 743, Elkhart, Indiana 46514, Attention: Corporate Secretary, or by calling (574) 294-6521, or from Skyline's website at http://www.skylinecorp.com under the tab \"Investors – SEC Filings.\" The information available through Skyline's website is not and shall not be deemed part of this Current Report on Form 8-K or incorporated by reference into other filings Skyline makes with the SEC. This communication does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval.\nThis communication is not a solicitation of proxies in connection with the proposed Exchange. However, Skyline and its directors and officers may be deemed to be participants in the solicitation of proxies from Skyline's shareholders with respect to the special meeting of shareholders that will be held to consider the Company Shareholder Approval Matters in connection with the Exchange. Information concerning the ownership of Skyline securities by Skyline's directors and executive officers is included in their SEC filings on Forms 3, 4, and 5 and additional information about Skyline's directors and executive officers and their ownership of Skyline's common stock is set forth in the proxy statement for Skyline's 2017 annual meeting of shareholders, as filed with the SEC on Schedule 14A on August 22, 2017. Shareholders may obtain additional information regarding the interests of Skyline and its directors and executive officers in the proposed Exchange, which may be different than those of Skyline's shareholders generally, by reading the proxy statement and other relevant documents regarding the proposed Exchange, when filed with the SEC. These documents can be obtained free of charge from the sources indicated above.\nView original content: http://www.prnewswire.com/news-releases/skyline-and-champion-home-builders-to-host-conference-call-on-proposed-business-combination-on-thursday-january-25-300587151.html\nSOURCE Skyline Corporation", "external_links": ["http://www.prnewswire.com/news-releases/skyline-and-champion-home-builders-to-host-conference-call-on-proposed-business-combination-on-thursday-january-25-300587151.html"], "published": "2018-01-24T03:00:00.000+02:00", "crawled": "2018-01-24T03:26:53.000+02:00", "highlightTitle": ""}