{"organizations": [], "uuid": "e59a2be6a3781aa8435518b5373012fda852d666", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-endologix-appoints-greg-morrow-as-chief-marketing-officer-and-announces-inducement-grants-under-nasdaq-listing-rule-5635c4.html", "country": "US", "domain_rank": 767, "title": "Endologix Appoints Greg Morrow as Chief Marketing Officer and Announces Inducement Grants Under NASDAQ Listing Rule 5635(c)(4)", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-29T16:00:00.000+02:00", "replies_count": 0, "uuid": "e59a2be6a3781aa8435518b5373012fda852d666"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-endologix-appoints-greg-morrow-as-chief-marketing-officer-and-announces-inducement-grants-under-nasdaq-listing-rule-5635c4.html", "ord_in_thread": 0, "title": "Endologix Appoints Greg Morrow as Chief Marketing Officer and Announces Inducement Grants Under NASDAQ Listing Rule 5635(c)(4)", "locations": [], "entities": {"persons": [{"name": "greg morrow", "sentiment": "neutral"}, {"name": "abbott", "sentiment": "none"}, {"name": "morrow", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "endologix, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "centers of marketing excellence", "sentiment": "none"}, {"name": "endologix", "sentiment": "none"}, {"name": "abbott vascular", "sentiment": "none"}, {"name": "coronary division and marketing function for abbott vascular", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif.--(BUSINESS WIRE)-- Endologix, Inc. (Nasdaq:ELGX), a developer and marketer of innovative treatments for aortic disorders, announced today that it has appointed Greg Morrow as the Company’s Chief Marketing Officer, effective immediately.\nMr. Morrow brings to Endologix a wealth of executive marketing experience in medical devices. Most recently, he led the Coronary Division and Marketing Function for Abbott Vascular. While at Abbott, he was responsible for all elements of commercial operations and concurrently responsible for global volume and market share. He led a transformation of the marketing strategy to rejuvenate the core business, achieving global leadership share in metallic stents, and further transformed the global commercial model and upstream pipeline in both metallic stents and guide wires. He also created the company’s Centers of Marketing Excellence, which included Abbott Vascular’s first-ever digital marketing, hospital administrative customer marketing, and direct to patient marketing capabilities.\nBefore joining Abbott, Mr. Morrow served in executive, medical device marketing roles at Novartis, Johnson & Johnson, and Invisalign (Align Technology).\nJohn McDermott, Chief Executive Officer for Endologix, said, “We are very excited to welcome Greg to Endologix’s executive team. He is a proven marketing executive with a strong track record of growing medical device businesses in highly competitive and challenging environments and achieving breakthrough results. His experience will be invaluable in both strengthening our brand value proposition and maximizing the impact of our innovative new product pipeline.”\nGreg Morrow said, “I am thrilled to have the opportunity to lead Endologix’s global marketing team. The Company has built an impressive new product portfolio, and our marketing team’s goal is to effectively launch these new technologies, strengthen the brand, and provide excellent clinical outcomes for physicians and their patients.”\nMr. Morrow earned his MBA from the University of Maryland and a Bachelor of Science in Industrial Engineering from the U.S. Naval Academy. He is also a graduate of the Stanford Executive Program and a combat veteran of the Persian Gulf.\nEndologix has also announced the grant of equity awards under its 2017 Inducement Stock Incentive Plan (the “2017 Plan”) to Mr. Morrow as an inducement material to Mr. Morrow’s entry into employment with Endologix, as permitted under NASDAQ Listing Rule 5635(c)(4).\nThe inducement grants to Mr. Morrow consisted of (i) a non-qualified option to purchase up to 158,925 shares of Endologix’s common stock at an exercise price of $4.34 per share; and (ii) 46,083 restricted stock units (the “RSUs”). The date of grant for the option and RSUs was January 26, 2018.\nOne quarter (25%) of the shares subject to the option shall vest and become exercisable upon completion of one year of service, with the remaining shares vesting in thirty-six (36) equal, consecutive, monthly installments as measured from the first anniversary of the grant date, subject to Mr. Morrow’s continued service with Endologix as of each vesting installment date. The RSUs shall vest upon satisfaction of certain (i) performance milestones, which shall be determined by Endologix within ninety (90) days of commencement of Mr. Morrow’s employment, and (ii) tenure requirements.\nAbout Endologix\nEndologix, Inc. develops and manufactures minimally invasive treatments for aortic disorders. The Company's focus is endovascular stent grafts for the treatment of abdominal aortic aneurysms (AAA). AAA is a weakening of the wall of the aorta, the largest artery in the body, resulting in a balloon-like enlargement. Once AAA develops, it continues to enlarge and, if left untreated, becomes increasingly susceptible to rupture. The overall patient mortality rate for ruptured AAA is approximately 80%, making it a leading cause of death in the U.S. For more information, visit www.endologix.com .\nCautions Regarding Forward-Looking Statements\nExcept for historical information contained herein, this press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements generally can be identified by the use of words such as “anticipate,” “expect,” “could,” “may,” “will,” “believe,” “estimate,” “forecast,” “goal,” “project,” \"continue,\" \"outlook,\" “guidance,” \"future,” other words of similar meaning and the use of future dates. Forward-looking statements used in this press release include, but are not limited to, statements regarding the anticipated commencement (and commensurate benefits) of Mr. Morrow’s employment with Endologix, the accuracy of which are necessarily subject to risks and uncertainties that may cause Endologix’s actual results to differ materially and adversely from the statements contained herein. Some of the potential risks and uncertainties that could cause actual results to differ materially and adversely from anticipated results include Endologix’s ability to continue integrating the businesses and operations of, and to realize the expected benefits of its merger with, TriVascular, continued market acceptance, hiring, integration and retention of the Endologix’s executive management team, endorsement and use of Endologix's products (including market acceptance and adoption of the Nellix EVAS System with its refined IFU), risks associated with the manufacturing of Endologix’s products, the success of clinical trials relating to Endologix’s products (including the clinical results of the EVAS2 study), product research and development efforts, uncertainty in the process of obtaining and maintaining U.S. FDA and other regulatory approvals for Endologix's products, risks associated with international operations, including currency exchange rate fluctuations, Endologix’s ability to protect its intellectual property rights and proprietary technologies, and other economic, business, competitive and regulatory factors. Undue reliance should not be placed upon the forward-looking statements contained in this press release, which speak only as of the date of this press release. Endologix undertakes no obligation to update any forward-looking statements contained in this press release to reflect new information, events or circumstances after the date they are made, or to reflect the occurrence of unanticipated events. Please refer to Endologix's filings with the Securities and Exchange Commission including its Annual Report on Form 10-K for the year ended December 31, 2016 and subsequent Quarterly Reports on Form 10-Q, for more detailed information regarding these risks and uncertainties and other factors that may cause actual results to differ materially from those expressed or implied.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005311/en/\nEndologix, Inc.\nVaseem Mahboob, 949-595-7200\nCFO\nSource: Endologix, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.endologix.com&esheet=51749894&newsitemid=20180129005311&lan=en-US&anchor=www.endologix.com&index=1&md5=a23dbbcc31462e46459fb2acc7737e43", "http://www.businesswire.com/news/home/20180129005311/en/"], "published": "2018-01-29T16:00:00.000+02:00", "crawled": "2018-01-29T17:36:59.000+02:00", "highlightTitle": ""}