{"organizations": [], "uuid": "8a630a995ac9cc4ef5059f862db38d7bf4cd0334", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/nigeria-cenbank-rates/update-1-nigeria-unlikely-to-hold-interest-rate-meeting-next-week-c-bank-sources-idUSL8N1PE35G", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Nigeria unlikely to hold interest rate meeting next week -c.bank sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-19T20:45:00.000+02:00", "replies_count": 0, "uuid": "8a630a995ac9cc4ef5059f862db38d7bf4cd0334"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/nigeria-cenbank-rates/update-1-nigeria-unlikely-to-hold-interest-rate-meeting-next-week-c-bank-sources-idUSL8N1PE35G", "ord_in_thread": 0, "title": "UPDATE 2-Nigeria unlikely to hold interest rate meeting next week -c.bank sources", "locations": [], "entities": {"persons": [{"name": "chijioke ohuo", "sentiment": "negative"}, {"name": "muhammadu buhari", "sentiment": "none"}, {"name": "ibrahim magu", "sentiment": "none"}, {"name": "camillus eboh", "sentiment": "none"}], "locations": [{"name": "abuja", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}], "organizations": [{"name": "mpc", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "central bank of nigeria", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cbn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details of stand-off between presidency, parliament, central bank no comment)\nBy Chijioke Ohuocha and Camillus Eboh\nABUJA, Jan 19 (Reuters) - Nigeria’s central bank is unlikely to hold an interest rate setting meeting on Jan. 22 as scheduled as several new members of the monetary policy committee (MPC) have yet to be approved by lawmakers, two central bank sources said.\nAt least five of the MPC’s 12 members are due to be replaced after retiring last year. “The indications that the MPC might not hold are there because of quorum,” one of the sources told Reuters.\nCentral Bank of Nigeria (CBN) rules state that at least six members of the MPC are needed to approve an interest rate decision. A rate announcement had been expected on Jan. 23, a day after the meeting.\nAt the heart of the matter is a stand-off between the presidency and legislature over the latter’s powers to confirm - or deny - executive nominees to key posts within the government.\nNigeria’s upper house of parliament, the Senate, had twice refused to approve President Muhammadu Buhari’s nomination of Ibrahim Magu as the head of the financial crimes watchdog, most recently last March.\nNevertheless, Magu assumed the role of acting chief of the Economic and Financial Crimes Commission (EFCC), a move the Senate saw as an overreaching of presidential powers and a rejection of its legislative authority.\nIn response, the Senate is now refusing to approve other presidential nominees, including those for the MPC.\n“The Senate plenary has not referred the confirmation of the deputy governor and members of the MPC to our committee because the Senate is having issues with the executive,” said Senator Rafiu Ibrahim, chairman of the Senate banking committee.\n“The issue is the executive refusal to honour our decision on the confirmation of Ibrahim Magu,” Ibrahim said. “Until that is resolved the situation would remain as it is.”\nA presidency official said he did not know when the stand-off would be resolved but it was being addressed by Buhari’s office. A CBN spokesman also declined to comment. The two central bank sources said a statement would be issued.\nAt its last meeting in November, the MPC held rates at the same 14 percent level it has kept for more than a year, to fight inflation and to attract foreign investors to support the naira. (Reporting by Chijioke Ohuocha and Camillus Eboh with additional reporting by Felix Onuah; writing by Chijioke Ohuocha and Paul Carsten; editing by Mark Heinrich)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T20:45:00.000+02:00", "crawled": "2018-01-20T17:47:55.002+02:00", "highlightTitle": ""}