{"organizations": [], "uuid": "401426e4758ab3c0709b847c1de16654954a2d50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-the-mexico-fund-inc-pays-distribution.html", "country": "US", "domain_rank": 767, "title": "The Mexico Fund, Inc. Pays Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:00:00.000+02:00", "replies_count": 0, "uuid": "401426e4758ab3c0709b847c1de16654954a2d50"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-the-mexico-fund-inc-pays-distribution.html", "ord_in_thread": 0, "title": "The Mexico Fund, Inc. Pays Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "mexico fund, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 26, 2018 (GLOBE NEWSWIRE) -- The Mexico Fund, Inc. (NYSE:MXF) announced that it will pay today a distribution of $0.13 per share in cash to stockholders of record as of January 18, 2018, according to the Fund´s Managed Distribution Plan (MDP).\nAs a general matter, the amount of distributable income for each fiscal period depends on the aggregate gains and losses realized by the Fund during the entire year. Distributions may consist of net investment income, capital gains and return of capital, but the character of these distributions cannot be determined until after the end of the Fund’s fiscal year.\nHowever, under the Investment Company Act of 1940, the Fund is required to indicate the source of each distribution to stockholders. The following table sets forth an estimate of the sources of the January 26, 2018 distribution and distributions paid in the current fiscal year:\nDistribution Estimates January 2018 Fiscal Year-to-date ( YTD) 1 Source Per Share\nAmount Percent of\nCurrent\nDistribution Per Share\nAmount Percent of Fiscal\nYear Distributions Net Investment Income - - - - Net Realized Short-Term Capital Gains - - - - Net Realized Long-Term Capital Gains - - - - Return of Capital $0.1300 100.00% $0.1300 100.00% Total Distribution $ 0.1300 100.00 % $ 0.1300 100.00 % Information regarding the Fund’s performance and distribution rates is set forth below:\nAverage Annual Total Return for the 5-year period ended on December 31, 2017 2 (2.69 )% Current Annualized Distribution Rate (current fiscal year) 3 - Current Fiscal Year Cumulative Total Return 4 0.39 % Cumulative Distribution Rate (current fiscal year) 5 - 1 The Fund’s current fiscal year began on November 1, 2017.\n2 Average Annual Total Return represents the simple arithmetic average of the Annual NAV Total Returns of the Fund for the last five years. Annual NAV Total Return is the percentage change in the Fund’s NAV over a year including distributions paid and assuming reinvestment of those distributions.\n3 The Current Annualized Distribution Rate is the Cumulative Distribution Rate as of December 31, 2017, annualized as a percentage of the Fund’s NAV at the same date. As of the date of this press release, this rate is zero because the $0.1300 distribution has not been paid yet.\n4 Current Fiscal Year Cumulative Total Return is the percentage change in the Fund’s NAV from November 1, 2017, through December 31, 2017, including distributions paid and assuming reinvestment of those distributions.\n5 Cumulative Distribution Rate for the Fund’s current fiscal period (November 1, 2017, through December 31, 2017) measured on the dollar value of distributions in the period as a percentage of the Fund’s NAV as of December 31, 2017. As of the date of this press release, this rate is zero because the $0.1300 distribution has not been paid yet.\nYou should not draw any conclusions about the Fund’s investment performance from the amount of this distribution or from the terms of the Fund’s MDP.\nThe amounts and sources of distributions reported above are only estimates and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for accounting and tax reporting purposes will depend upon the Fund’s investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The Fund will send you a Form 1099-DIV for the calendar year that will tell you how to report the distribution for federal income tax purposes.\nFor further information, contact the Fund’s Investor Relations office at +52-55-9138-3350, or by email at investor-relations@themexicofund.com.\nThe Mexico Fund, Inc. is a non-diversified closed-end management investment company with the investment objective of long-term capital appreciation through investments in securities, primarily equity, listed on the Mexican Stock Exchange. The Fund provides a vehicle to investors who wish to invest in Mexican companies through a managed non-diversified portfolio as part of their overall investment program.\nThis press release may contain certain forward-looking statements regarding future circumstances. These forward-looking statements are based upon the Fund’s current expectations and assumptions and are subject to various risks and uncertainties that could cause actual results to differ materially from those contemplated in such forward-looking statements including, in particular, the risks and uncertainties described in the Fund’s filings with the Securities and Exchange Commission. Actual results, events, and performance may differ. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. The Fund undertakes no obligation to release publicly any revisions to these forward looking statements that may be made to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events. The inclusion of any statement in this release does not constitute an admission by The Mexico Fund or any other person that the events or circumstances described in such statement are material.\nCONTACT:\nAlberto Gómez Pimienta\nThe Mexico Fund, Inc.\n+52-55-9138-3350\nCONTACT:\nPatricia Baronowski\nPristine Advisers, LLC\n(631) 756-2486\nSource:The Mexico Fund, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/db2e00dc-a7c4-4b91-aa22-c8f9e57f1f0c"], "published": "2018-01-26T17:00:00.000+02:00", "crawled": "2018-01-26T18:01:11.015+02:00", "highlightTitle": ""}