{"organizations": [], "uuid": "c5fb1a4f4021b3baf287f0cac366c09fe9c11690", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-evio-inc-completes-acquisition-of-licensed-california-cannabis-testing-laboratory.html", "country": "US", "domain_rank": 767, "title": "EVIO Inc. Completes Acquisition of Licensed California Cannabis Testing Laboratory", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-02T17:00:00.000+02:00", "replies_count": 0, "uuid": "c5fb1a4f4021b3baf287f0cac366c09fe9c11690"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-evio-inc-completes-acquisition-of-licensed-california-cannabis-testing-laboratory.html", "ord_in_thread": 0, "title": "EVIO Inc. Completes Acquisition of Licensed California Cannabis Testing Laboratory", "locations": [], "entities": {"persons": [{"name": "janua", "sentiment": "none"}], "locations": [{"name": "ore.", "sentiment": "none"}, {"name": "berkeley", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "organizations": [{"name": "completes acquisition of licensed california cannabis testing laboratory bend", "sentiment": "negative"}, {"name": "evio inc", "sentiment": "neutral"}, {"name": "llc", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "evio", "sentiment": "none"}, {"name": "bureau of cannabis control", "sentiment": "none"}, {"name": "labs llc", "sentiment": "none"}, {"name": "evio labs berkeley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEND, Ore., EVIO, Inc. (OTCQB:EVIO), a life sciences company and leading provider of quality control testing and advisory services to the regulated cannabis industry, announced today that it completed the acquisition of 60% of C3 Labs, LLC. EVIO also has the option to purchase the remaining ownership subject to terms disclosed below. Effective January 1, 2018, C3 Labs LLC was also granted its temporary testing license from the State of California, and will operate under the brand EVIO Labs Berkeley.\nLocated in Berkeley, CA, C3 Labs will serve licensed California cannabis businesses in accordance with the rules set forth by the Bureau of Cannabis Control. The State has issued more than 400 temporary licenses from the 1,800 applications submitted, with most still pending review. The Bureau of Cannabis Control also implemented emergency rules which require all cannabis harvested or manufactured after January 1, 2018 be tested by a licensed testing laboratory. Testing rules will phase-in, with increased testing requirements both on July 1, 2018 and January 1, 2019.\nLicensed Cannabis companies seeking to obtain testing services from EVIO Labs Berkeley can reach the lab by calling 888-544-EVIO (3846) extension 2001.\n“The addition of C3 Labs to the EVIO network is a tremendous milestone for EVIO Inc. C3 Labs generated over $1M in consulting revenues during the last two years, EVIO plans to continue offering these services along with traditional compliance testing. The 8,000 square foot facility is already outfitted with the latest analytical testing equipment, and will become our Northern California hub laboratory,” commented William Waldrop EVIO CEO, “This acquisition represents a significant development for EVIO as the Company continues to focus on increasing market share in the state of California. Demand for testing services is expected to increase significantly as the state rolls out its adult-use marijuana market.”\nIn consideration of the C3 Labs 60% membership acquisition, EVIO issued a $500,000 convertible promissory note that bears no interest and has a maturity date six months from closing at which time the note will automatically convert at a rate of $0.75 per share. EVIO also issued a $100,000 promissory note that is due within 90 days of closing. For a period of three years from closing date, EVIO has the right to acquire an additional 30% ownership for $450,000 payable in cash and/or stock subject to C3 member approval. Contingent upon exercise of the 30% option, EVIO will have the option to acquire the remaining 10% ownership after three years from closing. The purchase price will be mutually agreeable at that time, or subject to independent third-party valuation.\nAbout C3 Labs, LLC.\nLocated in Berkeley, CA, C3 Labs, LLC has been serving the cannabis industry since 2015. C3 Labs was one of the nation’s first, true, cannabis-focused contract research organization (CRO), with both field services and a state of the art research center in beautiful Berkeley, California. C3 Labs’ highly experienced scientists and engineers utilize cutting edge technology to support their customers in analytical chemistry, process chemistry, formulations, and engineering. C3 Labs applies technologies employed by the food product and pharmaceutical industries to ensure that growers and processors operate in a fully compliant and quality manner and helps clients maintain the highest level of safe and effective medicinal products. Their staff has over 40 years of collective hands-on analytical expertise working in the Pharmaceutical and Petrochemical industries with 7 years of experience consulting to the FDA, USDA, and EPA, as well as the companies regulated by these agencies.\nAbout EVIO, Inc.\nEVIO, Inc. is a life sciences company focused on analyzing cannabis as a means for improving quality of life. The Company provides analytical testing services, advisory services and performs product research in its accredited laboratory testing facilities. The Company’s EVIO Labs division operating coast-to-coast provides state-mandated ancillary services to ensure the safety and quality of the nation's cannabis supply.\nFor more information, visit www.eviolabs.com .\nSafe Harbor Statement\nAny statements in this press release that are not statements of historical fact maybe considered to be forward-looking statements. Statements may contain certain forward-looking statements pertaining to future anticipated or projected plans, performance and developments, as well as other statements relating to future operations and results. Words such as \"may,\" \"will,\" \"expect,\" \"believe,\" \"anticipate,\" \"estimate,\" \"intends,\" \"goal,\" \"objective,\" \"seek,\" \"attempt,\" or variations of these or similar words, identify forward-looking statements. These forward-looking statements by their nature are estimates of future results only and involve substantial risks and uncertainties, including but not limited to risks associated with the uncertainty of future financial results, additional financing requirements, development of new products, our ability to complete our product testing and launch our product commercially, the acceptance of our product in the marketplace, the uncertainty of the laws and regulations relating to cannabis, the impact of competitive products or pricing, technological changes, the effect of economic conditions and other uncertainties detailed from time to time in our reports filed with the Securities and Exchange Commission, available at www.sec.gov or www.eviolabs.com .\nCompany Contact:\nEVIO Inc.\nBend, OR\nwww.EVIOlabs.com\n888.544.EVIO\ninfo@EVIOlabs.com\nCommunications Contact:\nNetworkNewsWire (NNW)\nNew York, New York\nwww.NetworkNewsWire.com\n212.418.1217 Office\nEditor@NetworkNewsWire.com\nSource:EVIO, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=wzDtaTyezF2qLDZH74dnISHDU3iKP-8e5f1wxnkgv-2Efp8-hN276jiInrJtxCzvPWnQTBLTupkMqThNboc54A==", "https://www.globenewswire.com/Tracker?data=TwcNT37-udBhRk2IpEzYucVxdaplC5QGDHO8Z9yVL82Rg4TAzyPC4xwNtgXBbG3Bsk80gbVigxtmuhqV4NJ0Iqco6fDwzFcspdzhy7AOGao=", "https://www.globenewswire.com/Tracker?data=0nTcAp3-gONf1hOMsCYJEwWjUdZ1js1d9EnLh5h5hRXTVdhKJzTbrv6b8taNXmpf4dZNye3BEdPmZj4P3b8VPQ==", "https://www.globenewswire.com/Tracker?data=5NZjEayUNAFTDYIqFledaDogV9Aq2OSI_i7h3LwiDoJMdZ9DyIpuFjl0XJILIdnu2xQcw7Ir_p7QgzSKu70hoQ==", "https://www.globenewswire.com/Tracker?data=5NZjEayUNAFTDYIqFledaK7ufmJKSzFMdhKlRJmO_L11c862IY4TL-2q0Q61YwH-VNGf2W0HSH9pLXNP6SdJGg=="], "published": "2018-01-02T17:00:00.000+02:00", "crawled": "2018-01-02T16:22:49.042+02:00", "highlightTitle": ""}