{"organizations": [], "uuid": "c819dd7021894f146348d867bd65a8e706581bdd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220319010&w=1200&r=LYNXMPEE070VG", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-global-bitcoin/bitcoin-drops-below-15000-as-south-korea-reviews-accounts-idUSKBN1EX1CC", "country": "US", "domain_rank": 408, "title": "Bitcoin drops below $15,000 as South Korea reviews accounts", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.997, "site_type": "news", "published": "2018-01-08T22:04:00.000+02:00", "replies_count": 0, "uuid": "c819dd7021894f146348d867bd65a8e706581bdd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-bitcoin/bitcoin-drops-below-15000-as-south-korea-reviews-accounts-idUSKBN1EX1CC", "ord_in_thread": 0, "title": "Bitcoin drops below $15,000 as South Korea reviews accounts", "locations": [], "entities": {"persons": [{"name": "richard leong", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Bitcoin sank on Monday after website CoinMarketCap removed prices from South Korean exchanges from its calculations of digital currency rates without any warning, resulting in a steep drop in all virtual coins they track. \nCoinMarketCap shows real-time prices and market capitalizations for more than 1,300 cryptocurrencies and is widely followed by market participants. The exclusion of data from South Korean exchanges, where virtual currencies trade at a wide premium, sowed confusion and triggered a broad selloff. \n”Every crypto is priced at a 30 percent premium in South Korea,“ said Greg Dwyer, head of business development at cryptocurrency derivatives exchange BitMex. ”By removing that, it looks like the market cap fell by 30 percent and so people rushed to sell because they’re not sure what’s happening. \nAs of midday in New York, bitcoin was last down 7.1 percent, at $14,980 BTC=BTSP on the Luxembourg-based Bitstamp exchange. It fell to a one-week low below $14,000. \nAnalysts said bitcoin was also undermined by news earlier in the session that South Korean financial authorities were inspecting six local banks that offer virtual currency accounts to institutions. \nMarket participants said CoinMarketCap removed data without any explanation from three of the largest South Korean exchanges: Bithumb, Coinone, and Korbit. \nCoinMarketCap was not immediately available to comment on its move. \nCryptocurrency prices tend to be much higher on South Korean exchanges because of huge demand and monetary restrictions in that country, analysts said. \n“South Korea has always had a premium because it’s very difficult to get cash out of the country,” said Dwyer. “Anyone looking to take advantage of an arbitrage in South Korea needs to do it with fiat currencies.” \nRipple’s currency XRP fell more than 30 percent on the day, after hitting an all-time peak of around $3.84. In 2017, XRP soared 35,000 percent, surpassing bitcoin’s surge of around 1,500 percent. \nTraders said XRP was the most severely affected by CoinMarketCap’s removal of South Korean prices because it was trading at a 50 percent premium in that country. \nRipple is a U.S.-based provider of blockchain-based banking payments and it created XRP to facilitate cross-border payments and institutional settlement in seconds. \nReporting by Gertrude Chavez-Dreyfuss; Editing by Meredith Mazzilli\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T22:04:00.000+02:00", "crawled": "2018-01-08T19:28:04.004+02:00", "highlightTitle": ""}