{"organizations": [], "uuid": "db66ac9bc0ad7d49405ee79bd48cb5b263bf71bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/italy-factors-jan-29/italy-factors-to-watch-on-jan-29-idUSL8N1PA3R3", "country": "US", "domain_rank": 408, "title": "Italy - Factors to watch on Jan. 29", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-29T13:01:00.000+02:00", "replies_count": 0, "uuid": "db66ac9bc0ad7d49405ee79bd48cb5b263bf71bc"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/italy-factors-jan-29/italy-factors-to-watch-on-jan-29-idUSL8N1PA3R3", "ord_in_thread": 0, "title": "Italy - Factors to watch on Jan. 29", "locations": [], "entities": {"persons": [{"name": "matteo renzi", "sentiment": "none"}, {"name": "giuseppe castagna", "sentiment": "none"}, {"name": "corrado passera", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "corriere della sera", "sentiment": "none"}, {"name": "banco bpm", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}, {"name": "istat", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "banca mediolanum", "sentiment": "none"}, {"name": "assogestioni", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following factors could affect Italian markets on Monday.\nReuters has not verified the newspaper reports, and cannot vouch for their accuracy. New items are marked with (*).\nFor a complete list of diary events in Italy please click on .\nPOLITICS Former prime minister Matteo Renzi triggered uproar in his centre-left Democratic Party (PD) at the weekend by packing the group’s electoral list with close allies and shutting the door on internal rivals.\nECONOMY ISTAT releases December producer prices data (0900 GMT).\nAssogestioni expected to release December fund flows data.\nDEBT Treasury offers 6-month BOT bills. Subscriptions close at 1000 GMT.\nCOMPANIES (*) BANCO BPM Italy’s third-biggest bank Banco BPM could be part of a new wave of consolidation in the country, its Chief Executive Giuseppe Castagna told Corriere della Sera’s L‘Economia insert in an interview on Monday.\nBANKS Veteran Italian banker and former Industry Minister Corrado Passera topped expectations by raising 600 million euros ($746 million) from investors with the aim of acquiring a small bank.\n(*) BANCA MEDIOLANUM The CEO of Mediolanum Banca reiterated the bank was ready to buy 3 percent of a 20 percent stake Fininvest may be called on to sell as part of legal proceedings against its main owner Silvio Berlusconi. Massimo Doris, who said he hoped Berlusconi would be able to hang on to the stake, said there were also institutional investors interested in buying. Doris said the group was betting on a better financial performance in 2018 compared to last year.\nATLANTIA The company may already launch an offer on Abertis as soon as Feb. 13, offering 16.5 euros per share and valuing the Spanish rival at 16.3 billion euros, La Stampa said, without giving details.\nINTESA SANPAOLO Intesa Sanpaolo said on Friday it learned “with dismay” that it could be brought into judicial proceedings against Veneto Banca, a lender it purchased last year. “Intesa Sanpaolo will not hesitate to defend itself and will exercise all legal and contractual rights,” the bank said.\nThe lawyer representing former shareholders in Veneto Banca said he plans to raise the same issue for Popolare di Vicenza, according to La Stampa on Saturday.\nScandinavian debt collector Intrum Justitia, engaged in talks with Italy’s Intesa SanPaolo, is eyeing a 51 percent stake in the bank’s soured loan unit and 10-12 billion euros in bad debts, two sources close to the matter said.\nBANCA CARIGE At its next board meeting, the lender will present the 2018 budget, confirming targets set out in its industrial plan and focused on cutting costs, CEO Paolo Fiorentino told MF in an interview published on Saturday.\nHelped by the recent capital hike, the bank wants to re-launch its traditional business of a commercial regional bank, lending to small and micro enterprises. Carige wants to exceed the bad loan reduction target set by the ECB for the bank for 2020, Fiorentino added. As far as unlikely-to-pay loans, the CEO said the bank had identified a portfolio worth 500 million euros that it could shed and which had attracted interest from specialised operators in the market. Talks with the bank’s main shareholder, Malacalza Investimenti, which had expressed some criticism over the management of the recent cash call, were constructive, he added.\nCarige’s board meeting, planned for Tuesday, was postponed to Feb. 2, Il Sole 24 Ore said on Sunday.\nThe paper added, citing a financial source, that Malacalza had a right to ask for more information and to have an answer, but that there were no contraposition between the bank’s CEO, the board and the top shareholder.\nFIAT CHRYSLER United Auto Workers President Dennis Williams on Friday denied a claim that payments by a Fiat Chrysler Automobiles NV (FCA) executive to a union official had compromised contract talks or impacted union funds.\nMEDIASET Italy’s soccer league has launched talks with Spanish broker Mediapro on its 950-million-euro ($1.18 billion) bid for the rights to broadcast Serie A soccer matches for the 2018-2021 seasons, the CEO of the league’s advisor Infront, Luigi De Siervo, said on Friday.\nThe league will also prepare a new tender for the rights targeting media operators such as Mediaset and Sky that will be launched if no deal is reached with Mediapro, De Siervo added.\nTELECOM ITALIA Outgoing Deputy Chairman Giuseppe Recchi was appointed CEO of medical service provider Affidea, a statement on the Dutch company’s website showed. Telecom Italia Chairman Arnaud de Puyfontaine said he was happy for Recchi to have found a new job.\nGENERALI The low-interest rate scenario has been integrated in Generali’s business model and the insurer can operate in that environment for a long time, CEO Philippe Donnet told MF in an interview on Saturday. The executive added that development, expansion and growth would be the guiding priorities for the company’s new business plan.\nCATTOLICA ASSICURAZIONI Presents 2018-2020 industrial plan (0900 GMT), followed by new conference with CEO Alberto Minali. (*) The company said it sees operating profit rising to 375-400 million euros by 2020.\nThe company is also working on changes to its governance model, Il Sole 24 Ore said on Saturday. (*) Chief Executive Alberto Minali said a transformation into a joint-stock company was not on the table. He also said the company was interested in buying minority stakes in bancassurance JVs that will be put up for sale after the liquidation of Popolare di Vicenza.\nLUXOTTICA Board meeting on preliminary FY results (sales).\nABITARE IN Annual and extraordinary shareholders’ meetings (1600 GMT).\nGUCCI, KERING French luxury group Kering said on Friday that Gucci boss Marco Bizzarri was fully compliant with his tax obligations in Italy, after a French newspaper reported that the executive and his employer had benefited from an offshore tax scheme.\nM&A, ALITALIA Industry Minister Carlo Calenda said he would still like to reach an accord on the sale of Alitalia before the March 4 elections although it may challenging to do so, Il Sole 24 Ore on Saturday Quote: d him as saying\nCorriere della Sera Quote: d Calenda as saying he would like to launch exclusive talks with one of the interested parties before the vote.\nCommissioner Luigi Gubitosi said he agrees with Calenda that a deal should be struck soonest, but could not say whether this will be before or after the vote, according to an interview with Il Messaggero on Sunday.\nIPO, EATALY The food group expects to list on the stock market in the first quarter of 2019, chairman Andrea Guerra told La Repubblica in an interview on Saturday. The executive added that 2017 revenues rose 22 percent to 470 million euros, while EBITDA totaled 25 million euros. Guerra expects the figures to rise to 560 million and 35 million this year, respectively.\nFor Italian market data and news, click on codes in brackets:\n20 biggest gainers (in percentage)\n20 biggest losers (in percentage)\nFTSE IT allshare index\nFTSE Mib index\nFTSE Allstars index...\nFTSE Mid Cap index....\nBlock trades\nStories on Italy IT-LEN\nFor pan-European market data and news, click on codes in brackets: European Equities speed guide FTSEurofirst 300 index DJ STOXX index Top 10 STOXX sectors Top 10 EUROSTOXX sectors Top 10 Eurofirst 300 sectors Top 25 European pct gainers Top 25 European pct losers Main stock markets: Dow Jones Wall Street report Nikkei 225 Tokyo report FTSE 100 London report Xetra DAX Frankfurt market stories CAC-40 Paris market stories... World Indices Reuters survey of world bourse outlook Western European IPO diary European Asset Allocation Reuters News at a Glance: Equities Main currency report:\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T13:01:00.000+02:00", "crawled": "2018-01-30T18:51:53.008+02:00", "highlightTitle": ""}