{"organizations": [], "uuid": "60b9e7c7d1a9762ad1d32597b576db28b84cb9cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 17, "shares": 17, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225586439&w=1200&r=LYNXMPEE0P199", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-jordan-economy-subsidies-bread/jordan-ends-bread-subsidy-doubling-some-prices-to-help-state-finances-idUSKBN1FF2CP", "country": "US", "domain_rank": 408, "title": "Jordan ends bread subsidy, doubling some prices, to help state finances", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T01:37:00.000+02:00", "replies_count": 0, "uuid": "60b9e7c7d1a9762ad1d32597b576db28b84cb9cf"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-jordan-economy-subsidies-bread/jordan-ends-bread-subsidy-doubling-some-prices-to-help-state-finances-idUSKBN1FF2CP", "ord_in_thread": 0, "title": "Jordan ends bread subsidy, doubling some prices, to help state finances", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AMMAN (Reuters) - Jordan said a decision to end subsidies on staple pitta bread that will lift its prices by between 60 and 100 percent will take effect on Saturday, the first such step in over two decades to ease the country’s budget woes.\nThe price of a kilo of white pitta bread was raised 60 percent to 0.40 dinars from 0.25 dinars and prices of large pita bread were nearly doubled. Other types of bread that most middle class Jordanians consume are not affected. Mechanism have set up to offset the impact on the poor by cash transfers.\nThe move, which takes effect after midnight, is the first major increase since 1996. A move to raise prices then sparked civil unrest when the government was forced to push for it to comply with International Monetary Fund requirements for extending new credit.\nProtests also erupted in 2012 after the government cut fuel subsidies to secure an IMF loan. That loan was intended to rein in a budget deficit that threatened the country’s fiscal and monetary stability.\nThe authorities have been saying bread subsidies were benefiting foreign workers and Syrian refugees living in the country and the money that was saved would be given to Jordanians in cash transfers.\nThe government says bread prices - among the cheapest regionally - had encouraged waste. It expects the move will reduce consumption.\nPeople stand in line to buy bread at a bakery in Amman, Jordan, January 26, 2018. REUTERS/Muhammad Hamed The bread move comes 10 days after Jordan’s cabinet announced a major package of IMF-guided tax hikes it says are needed to gradually lower public debt and rejuvenate an economy hit by regional conflict [nL8N1PA56A].\nAlthough the IMF didn’t seek lifting bread subsidies this time, it has long said Jordan’s costly subsidy system was increasingly untenable without large inflows of foreign capital or foreign aid.\nTax hikes and subsidy cuts - highly unpopular - have been forced on the government as the country’s debt-to-gross-domestic-product ratio has reached a record 95 percent, up from 71 percent in 2011.\nAfter an IMF standby arrangement that brought some fiscal stability, Jordan agreed last year to a more ambitious three-year program of long-delayed structural reforms to cut public debt to 77 percent of GDP by 2021.\nThe debt has grown at least in part because successive governments have adopted expansionist fiscal policies characterized by job creation in the bloated public sector and by lavish subsidies for bread and other staple goods.\nBut the economy has slowed, battered by the turmoil in neighboring Syria and Iraq. The economic strains have reduced local revenue and foreign aid, forcing Jordan to borrow heavily externally and also resort to more domestic financing.\n$1=0.7090 dinars\nReporting by Suleiman Al-Khalidi; Editing by Matthew Mpoke Bigg, Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T01:37:00.000+02:00", "crawled": "2018-01-27T00:14:01.010+02:00", "highlightTitle": ""}