{"organizations": [], "uuid": "c52aee0a011bafe0fd944dd4f1cf1ec8c1abb79f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-search-discovery-announces-european-expansion.html", "country": "US", "domain_rank": 767, "title": "Search Discovery Announces European Expansion", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.492, "site_type": "news", "published": "2018-01-23T23:34:00.000+02:00", "replies_count": 0, "uuid": "c52aee0a011bafe0fd944dd4f1cf1ec8c1abb79f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-search-discovery-announces-european-expansion.html", "ord_in_thread": 0, "title": "Search Discovery Announces European Expansion", "locations": [], "entities": {"persons": [{"name": "brian marin", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "statista", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, January 23, 2018 /PRNewswire/ --\nFast growing business intelligence and analytics company launches UK operations; Appoints veteran business leader Brian Marin as European Managing Director.\n(Photo: https://mma.prnewswire.com/media/631097/Search_Discovery_Brian_Marin.jpg )\nBy 2020, UK companies will benefit from gains of £62bn as a result of data analytics and data science, according to Statista . The manufacturing industry is expected to see the largest gains (£13bn), followed by professional services (£10bn) and retail (£5bn).\nSearch Discovery a leading provider of enterprise business intelligence and analytics solutions and services today announced its European expansion with the opening of an office in the UK.\n\"We are thrilled to be opening for business in London, serving clients initially in the UK and subsequently across Europe. European enterprises are rapidly enhancing their ability to capture operational and consumer data, and we look forward to working with them to drive tangible, sustainable value through putting actionable data into the hands of decision makers in real time.\" says Steve Gustafson, COO, Search Discovery.\n\"The Search Discovery team has been critical to our success in European markets. Their team works closely with our country teams to meet goals and drive results.\" says Bryan Huber, Global Director, Digital Marketing Comfort Keepers (Sodexo PHS).\nThe appointment of Brian Marin as European Managing Director at Search Discovery will allow deeper partnerships with existing clients across Europe as well as open doors for new ventures.\nMarin says: \"While small companies might use one or two dozen different software programs, larger organisations use literally hundreds. Each of these generates data constantly and each has its own reporting interface.\"\n\"Most companies are not leveraging their data to drive informed business decisions. Search Discovery has built a world class business intelligence team of analysts and data scientists and has a track record of delivering solutions for the world's most trusted and respected brands. I'm delighted to have been selected to lead Search Discovery's expansion into Europe as we look to replicate the success of our US business across the region.\"\nAbout Search Discovery\nAbout Brian Marin\nAbout Search Discovery\nSearch Discovery is a business intelligence and analytics company that empowers organizations to use data to improve business performance. We engage clients at every stage of data enablement including strategy, implementation, business experiments, optimization and organizational change management. Our solutions enable more efficient operations, clear business insights and improved decision making across marketing, sales, finance, operations and human resources. We partner with Fortune 5000 companies like Marriott, Adobe, Michael Kors and others who are transforming their businesses by leveraging the value of data. For more information contact us at searchdiscovery.com.\nAbout Brian Marin, Managing Director, Europe, Search Discovery.\nBrian has been building, launching and scaling operations for enterprise software and services companies for the past 20 years. He has helped a number of US-headquartered companies expand into Europe and Asia, most notably Marin Software (NYSE: MRIN) and Performics which was acquired by DoubleClick, then Google (NASDAQ: GOOGL) then Publicis Groupe (OTCMKTS: PUBGY).\nSOURCE Search Discovery", "external_links": ["https://www.statista.com/statistics/608206/big-data-customer-intelligence-efficiency-benefits-uk-by-industry/", "https://www.searchdiscovery.com/", "https://www.searchdiscovery.com/about/executives/", "http://www.searchdiscovery.com/", "http://searchdiscovery.com/about"], "published": "2018-01-23T23:34:00.000+02:00", "crawled": "2018-01-24T01:56:04.017+02:00", "highlightTitle": ""}