{"organizations": [], "uuid": "fbb20bf930dca9cf8985fb13734968c3c6cb1dbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-rights-lawmaking/orange-passports-for-indias-migrant-workers-create-second-class-citizens-idUSKBN1F427D", "country": "US", "domain_rank": 408, "title": "Orange passports for India's migrant workers create 'second class citizens'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T00:54:00.000+02:00", "replies_count": 0, "uuid": "fbb20bf930dca9cf8985fb13734968c3c6cb1dbb"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-rights-lawmaking/orange-passports-for-indias-migrant-workers-create-second-class-citizens-idUSKBN1F427D", "ord_in_thread": 0, "title": "Orange passports for India's migrant workers create 'second class citizens'", "locations": [], "entities": {"persons": [{"name": "s. irudaya rajan", "sentiment": "none"}, {"name": "raveesh kumar", "sentiment": "none"}], "locations": [{"name": "mumbai india", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "thiruvananthapuram", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "kerala", "sentiment": "none"}], "organizations": [{"name": "ministry of external affairs", "sentiment": "none"}, {"name": "centre for development studies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI India’s plan to introduce orange-colored passport jackets for some migrant workers is discriminatory and could increase the vulnerability of workers often duped by middlemen who promise them jobs, said legal experts and campaigners.\nThe Ministry of External Affairs said last week migrant workers who need emigration clearance - those who have not passed 10th grade at school - to travel to a group of 18 countries, mostly in the Gulf region, would soon be issued orange passports.\n“Passport holders with ECR (Emigration Check Required) status would be issued a passport with orange color passport jacket and those with non-ECR status would continue to get a blue passport,” spokesman Raveesh Kumar said on Friday.\nIndian passports, barring official and diplomatic passports, are navy blue.\nThe government’s plan was roundly criticized.\n“You cannot divide people on the basis of educational qualifications; it’s discriminatory,” said S. Irudaya Rajan, professor at the Centre for Development Studies in Thiruvananthapuram in the southern state of Kerala, from where many migrant workers originate.\n“An orange cover shows a person is not well educated, and makes them vulnerable to exploitation. These are already vulnerable people who need more protection, not discrimination,” he told the Thomson Reuters Foundation.\nThere are an estimated six million Indian migrants in the six Gulf states of Bahrain, Kuwait, Qatar, Saudi Arabia, United Arab Emirates and Oman, many of them trafficked and exploited.\nMany are duped by job agents, and trapped in low paying jobs with few benefits or protections.\n“Treating India’s migrant workers like second class citizens is completely unacceptable,” Rahul Gandhi, leader of the opposition Congress party, said in a tweet.\nThe government has not released any other details of the plan, including a timeline for implementation.\n“The government could argue that these passports are for the workers’ protection, but to a worker it may not seem that way,” said Sehjo Singh, a director at advocacy group ActionAid India.\n“The government must make clear how this system will work in favor of the workers.”\nReporting by Rina Chandran @rinachandran. Editing by Ros Russell. Please credit the Thomson women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T00:54:00.000+02:00", "crawled": "2018-01-15T22:19:43.017+02:00", "highlightTitle": ""}