{"organizations": [], "uuid": "a492b1b0d658a169c93a00df44854b3997d108f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-udr-appoints-chief-executive-officer-and-president-thomas-w-toomey-as-chairman-of-the-board-and-james-d-klingbeil-as-lead.html", "country": "US", "domain_rank": 767, "title": "UDR Appoints Chief Executive Officer and President Thomas W. Toomey as Chairman of the Board and James D. Klingbeil as Lead Independent Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:16:00.000+02:00", "replies_count": 0, "uuid": "a492b1b0d658a169c93a00df44854b3997d108f1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-udr-appoints-chief-executive-officer-and-president-thomas-w-toomey-as-chairman-of-the-board-and-james-d-klingbeil-as-lead.html", "ord_in_thread": 0, "title": "UDR Appoints Chief Executive Officer and President Thomas W. Toomey as Chairman of the Board and James D. Klingbeil as Lead Independent Director", "locations": [], "entities": {"persons": [{"name": "denver", "sentiment": "neutral"}, {"name": "thomas w. toom", "sentiment": "neutral"}, {"name": "thomas w. toomey", "sentiment": "neutral"}, {"name": "james d. klingbeil", "sentiment": "neutral"}, {"name": "tom", "sentiment": "none"}, {"name": "toomey", "sentiment": "none"}, {"name": "klingbeil", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "locations": [], "organizations": [{"name": "udr, inc.", "sentiment": "neutral"}, {"name": "board", "sentiment": "neutral"}, {"name": "board of directors of the company", "sentiment": "none"}, {"name": "company’s board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER--(BUSINESS WIRE)-- UDR, Inc. (the “Company”) (NYSE: UDR ) announced today that Thomas W. Toomey, Chief Executive Officer and President, has been appointed Chairman of the Board of Directors of the Company effective January 1, 2018. Mr. Toomey was appointed Chief Executive Officer of the Company in 2001 and was elected to the Company’s Board of Directors at that time. Mr. Toomey succeeds James D. Klingbeil who has served as Chairman since 2010.\nThe Company’s Board of Directors also established a Lead Independent Director position and appointed Mr. Klingbeil as Lead Independent Director.\n“Tom’s long-term leadership, his successful reshaping of UDR into a blue-chip REIT as President and CEO for the past 17 years, and his in-depth knowledge of the public multifamily space make him the right choice to lead the Board moving forward,” said Mr. Klingbeil. “I look forward to continuing to serve as the Lead Independent Director.”\nMr. Toomey said, “I want to thank Jim for his contributions to the Company as Chairman and am grateful to retain his continued leadership as Lead Independent Director. Serving in the additional capacity of Chairman, I look forward to the opportunities that lie ahead for UDR as we continue to improve the Company and create long-term value for our shareholders.”\nForward Looking Statement\nCertain statements made in this press release may constitute “forward-looking statements.” Words such as “expects,” “intends,” “believes,” “anticipates,” “plans,” “likely,” “will,” “seeks,” “estimates” and variations of such words and similar expressions are intended to identify such forward-looking statements. Forward-looking statements, by their nature, involve estimates, projections, goals, forecasts and assumptions and are subject to risks and uncertainties that could cause actual results or outcomes to differ materially from those expressed in a forward-looking statement, due to a number of factors, which include, but are not limited to, unfavorable changes in the apartment market, changing economic conditions, the impact of inflation/deflation on rental rates and property operating expenses, expectations concerning availability of capital and the stabilization of the capital markets, the impact of competition and competitive pricing, acquisitions, developments and redevelopments not achieving anticipated results, delays in completing developments, redevelopments and lease-ups on schedule, expectations on job growth, home affordability and demand/supply ratio for multifamily housing, expectations concerning development and redevelopment activities, expectations on occupancy levels and rental rates, expectations concerning the joint ventures with third parties, expectations that technology will help grow net operating income, expectations on annualized net operating income and other risk factors discussed in documents filed by the Company with the SEC from time to time, including the Company's Annual Report on Form 10-K and the Company's Quarterly Reports on Form 10-Q. Actual results may differ materially from those described in the forward-looking statements. These forward-looking statements and such risks, uncertainties and other factors speak only as of the date of this press release, and the Company expressly disclaims any obligation or undertaking to update or revise any forward-looking statement contained herein, to reflect any change in the Company's expectations with regard thereto, or any other change in events, conditions or circumstances on which any such statement is based, except to the extent otherwise required under the U.S. securities laws.\nAbout UDR, Inc.\nUDR, Inc. (NYSE: UDR ), an S&P 500 company, is a leading multifamily real estate investment trust with a demonstrated performance history of delivering superior and dependable returns by successfully managing, buying, selling, developing and redeveloping attractive real estate properties in targeted U.S. markets. As of September 30, 2017, UDR owned or had an ownership position in 50,127 apartment homes including 2,935 homes under development or in its Developer Capital Program. For over 45 years, UDR has delivered long-term value to shareholders, the best standard of service to residents and the highest quality experience for associates.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005978/en/\nUDR, Inc.\nChris Van Ens, 720-348-7762\ncvanens@udr.com\nSource: UDR", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.udr.com%2FStock&esheet=51737970&newsitemid=20180104005978&lan=en-US&anchor=UDR&index=1&md5=e01b956b49abefcb2b1827eea8af4e3f", "http://www.businesswire.com/news/home/20180104005978/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.udr.com%2FStock&esheet=51737970&newsitemid=20180104005978&lan=en-US&anchor=UDR&index=2&md5=bae33c775f165ad22ef5cb401a5d5a25"], "published": "2018-01-05T00:16:00.000+02:00", "crawled": "2018-01-05T01:36:15.004+02:00", "highlightTitle": ""}