{"organizations": [], "uuid": "875a57f00d45218f43fb197ff20d3b550b3e1d24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1224969456&w=1200&r=LYNXMPEE0O004", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-oil-gas-spending/more-oil-and-gas-firms-expect-to-hike-capital-spending-in-2018-survey-idUKKBN1FE007", "country": "US", "domain_rank": 408, "title": "More oil and gas firms expect to hike capital spending in 2018 - survey", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T02:05:00.000+02:00", "replies_count": 0, "uuid": "875a57f00d45218f43fb197ff20d3b550b3e1d24"}, "author": "", "url": "https://uk.reuters.com/article/uk-oil-gas-spending/more-oil-and-gas-firms-expect-to-hike-capital-spending-in-2018-survey-idUKKBN1FE007", "ord_in_thread": 0, "title": "More oil and gas firms expect to hike capital spending in 2018 - survey", "locations": [], "entities": {"persons": [{"name": "nina chestney", "sentiment": "none"}], "locations": [], "organizations": [{"name": "shell", "sentiment": "none"}, {"name": "mckinsey", "sentiment": "none"}, {"name": "dnv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 12:05 AM / Updated 2 hours ago More oil and gas firms expect to hike capital spending in 2018 - survey Nina Chestney 3 Min Read \nLONDON (Reuters) - More global oil and gas firms expect to increase capital spending this year as confidence picks up after crude prices climbed above $70 (49.22 pounds) a barrel in January for the first time in the three years, according to a survey by DNV. \nDNV, a technical adviser to energy industry sector, reported that 66 percent of the 813 senior oil and gas professionals surveyed said their company would maintain or increase capital spending this year, compared to 39 percent last year. \nConfidence that the industry would grow rose to 63 percent this year from 32 percent last year, the survey found. \nMany companies, including oil majors BP ( BP.L ) and Shell ( RDSa.L ), cut capital expenditure and costs in 2016 after the price of Brent oil fell to a 12-year low of under $30 a tonne. \nCapital expenditure in global oil production fell to $200 billion in 2016 from an all-time high of around $520 billion in 2014 as companies tried to save cash, according to consultancy firm McKinsey. \nThe price of Brent, the global benchmark, has slowly recovered since then, helped by output curbs by the Organization of the Petroleum Exporting Countries, Russia and others. The pact began in January 2017 and expires at the end of 2018. \n“Our research indicates that the oil and gas industry is becoming more confident that its successful focus on cutting costs and building new efficiencies into the value chain will last,” DNV Oil & Gas Chief Executive Liv Hovem said. \n“Intentions to increase capital and innovation spending in 2018 come alongside a clear signal that oil and gas industry costs will not return to pre-2014 norms,” she said in a statement. \nHalf of the survey respondents said they would maintain efforts to increase cost control measures this year, and nearly two thirds believe these changes would be permanent. \nJust 37 percent of those surveyed said the oil price was a barrier to growth this year, compared to 64 percent a year ago, the DNV survey found. Editing by Edmund Blair", "external_links": [], "published": "2018-01-25T02:05:00.000+02:00", "crawled": "2018-01-25T02:31:44.024+02:00", "highlightTitle": ""}