{"organizations": [], "uuid": "835a8f05d542f720b2880812dbfc4e2b8a072e24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/canada-ma/canadian-ma-seen-picking-up-in-2018-on-market-rally-u-s-tax-reform-idUSL1N1OY0RH", "country": "US", "domain_rank": 408, "title": "Canadian M&A seen picking up in 2018 on market rally, U.S. tax reform", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T14:00:00.000+02:00", "replies_count": 0, "uuid": "835a8f05d542f720b2880812dbfc4e2b8a072e24"}, "author": "", "url": "https://www.reuters.com/article/canada-ma/canadian-ma-seen-picking-up-in-2018-on-market-rally-u-s-tax-reform-idUSL1N1OY0RH", "ord_in_thread": 0, "title": "Canadian M&A seen picking up in 2018 on market rally, U.S. tax reform", "locations": [], "entities": {"persons": [{"name": "darin deschamps", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "john tilak", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "wells fargo securities", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 12:00 PM / in 22 minutes Canadian M&A seen picking up in 2018 on market rally, U.S. tax reform John Tilak 4 Min Read \nTORONTO, Jan 4 (Reuters) - Rising equity markets and clarity on U.S. tax reform could set the stage for an acceleration in Canadian mergers and acquisitions this year after a slowdown in 2017, investment bankers said. \nCanadian M&A activity slipped 6 percent in 2017 to $239.7 billion, from $255.1 billion in the previous year, data from Thomson Reuters showed on Thursday. \nWhile uncertainty around the tax regime weighed on deal activity in 2017, bankers expect the recently passed changes to the U.S. tax system to boost the allure of U.S. companies to Canadian firms and funds looking to make acquisitions. \nFollowing a sweeping overhaul under President Donald Trump, the U.S. corporate income tax rate has been cut to 21 percent from 35 percent. \nWith Canadian and U.S. stocks at record highs, bankers also see buoyant equity markets supporting deals. \n“We expect 2018 to be a very strong year for M&A,” said Darin Deschamps, co-head of Wells Fargo Securities Canada. \n“You’ve got healthy economies in Canada and the United States, corporate liquidity is very robust, the banking system wants to lend, and the financing markets are very attractive,” Deschamps said. \nStill, the lack of visibility around negotiations over renewal of the North American Free Trade Agreement has been holding back some potential buyers. Some experts expect the NAFTA situation to be resolved in the first half of the year. \n“There is a desire to do deals, but it’s a more difficult environment to find value in certain sectors as NAFTA negotiations add a certain level of uncertainty,” said David Rawlings, head of JPMorgan Canada. \nSome bankers said they see Trump’s threat to pull out of NAFTA if the talks fail as an opportunity for Canadian companies. \n“The risks around the continuation of the existing NAFTA agreement necessitates companies to undertake M&A to try and position themselves in a potential post-NAFTA world,” said Grant Kernaghan, Citigroup’s managing director of Canadian investment banking. \nIn this environment, Kernaghan expects Canadian companies to acquire U.S. targets in the automotive, paper and telecommunication equipment sectors. \nPension funds, among the world’s most active dealmakers, are expected to fuel deal activity as they look to invest massive capital pools. \n“The pension funds have such a large amount of money that they need to deploy on behalf of the beneficiaries that they really have to be looking at a lot of different opportunities,” said Peter Buzzi, co-head of mergers and acquisitions at ‎RBC Capital Markets. \nLast year saw a decline in outbound deals, after they peaked in 2015 and 2016. Some of the year’s biggest transactions were domestic companies picking up assets, including Cenovus Energy Inc’s C$16.8 billion acquisition of some ConocoPhillips assets. \n“The market sentiment for M&A has definitely picked up over the course of 2017,” said Geoff Barsky, BMO’s head of Canadian and international M&A.“We anticipate increased levels of outbound activity going into 2018.” (Reporting by John Tilak; Additional reporting by Matt Scuffham in Toronto; Editing by Jim Finkle and Tom Brown)", "external_links": [], "published": "2018-01-04T14:00:00.000+02:00", "crawled": "2018-01-04T14:27:53.014+02:00", "highlightTitle": ""}