{"organizations": [], "uuid": "7514f1043e7fda6a072249fc158cea4961d4222f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-sound-financial-bancorp-inc-reports-net-income-of-5-point-1-million-in-2017.html", "country": "US", "domain_rank": 767, "title": "Sound Financial Bancorp, Inc. Reports Net Income of $5.1 Million in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "7514f1043e7fda6a072249fc158cea4961d4222f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-sound-financial-bancorp-inc-reports-net-income-of-5-point-1-million-in-2017.html", "ord_in_thread": 0, "title": "Sound Financial Bancorp, Inc. Reports Net Income of $5.1 Million in 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "seattle", "sentiment": "none"}], "organizations": [{"name": "sfbc", "sentiment": "negative"}, {"name": "sound financial bancorp, inc", "sentiment": "neutral"}, {"name": "sound financial bancorp, inc.", "sentiment": "neutral"}, {"name": "sound community bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Sound Financial Bancorp, Inc. (Nasdaq:SFBC), the holding company (the \"Company\") for Sound Community Bank (the \"Bank\"), today reported net income of $5.1 million for the year ended December 31, 2017, or diluted earnings per share of $2.00, as compared to net income of $5.4 million, or diluted earnings per share of $2.09, for the year ended December 31, 2016. Net income for the fourth quarter of 2017 was $1.2 million, or $0.46 per diluted share, compared to $1.6 million, or $0.60 per diluted share, for the quarter ended December 31, 2016. The decrease in net income compared to the same quarter last year was mainly due to a revaluation adjustment of deferred tax assets as a result of the passage of the Tax Cuts and Jobs Act. The tax revaluation resulted in an increase to the Company’s income tax expense and a $309,000 or $0.12 reduction in earnings per diluted share. Total assets were $645.2 million as of December 31, 2017 compared to $588.4 million as of December 31, 2016.\nThe Company also announced today that the Board of Directors has declared a cash dividend on Company common stock of $0.12 per share, payable on February 26, 2018 to stockholders of record as of the close of business on February 12, 2018.\n“We had a year of excellent balance sheet growth with success in both deposit and loan origination. The net interest margin remained higher than the prior year as we maintained our cost of deposits within one basis point of the cost in 2016 and increased our loan yield,” said Laurie Stewart, President and CEO of the Company and the Bank. “In both cases the mix of products helped contribute to these results,” concluded Ms. Stewart.\nHighlights for the year ended December 31, 2017 include:\n● Net loans increased 9.7% to $543.4 million at December 31, 2017, from $495.2 million at December 31, 2016 ● Deposits increased 10.0% to $514.4 million at December 31, 2017, from $467.7 million at December 31, 2016 ● Total assets increased 9.7% to $645.2 million at December 31, 2017, from $588.4 million at December 31, 2016 ● Net interest income increased 8.8% to $24.1 million during the year ended December 31, 2017, from $22.1 million during the year ended December 31, 2016 ● Noninterest income decreased 24.6% to $3.9 million during the year ended December 31, 2017, from $5.1 million during the year ended December 31, 2016 ● Net interest margin (\"NIM\") remained strong at 4.35% for the year ended December 31, 2017 compared to 4.26% for the year ended December 31, 2016 ● The provision for loan losses was $500,000 for the year ended December 31, 2017, compared to $454,000 for the year ended December 31, 2016 ● The provision for income taxes was $3.1 million for the year ended December 31, 2017, which included a $309,000 one-time write-down of our deferred tax asset as a result of the Tax Cuts and Jobs Act, which was signed into law on December 22, 2017. The comparable provision for income taxes for the year ended December 31, 2016 was $2.7 million Highlights for the quarter ended December 31, 2017 include:\n● Net interest income was $6.3 million for the quarter ended December 31, 2017, an increase of 2.6% compared to $6.2 million for the quarter ended September 30, 2017 and an increase of 7.7%, compared to $5.9 million for the quarter ended December 31, 2016 ● NIM (annualized) decreased 3 basis points to 4.37% for the quarter ended December 31, 2017 compared to 4.40% for the quarter ended September 30, 2017 ● Noninterest income increased 27.5% to $1.0 million for the quarter ended December 31, 2017, from $826,000 for the quarter ended September 30, 2017 and decreased 24.1%, compared to $1.4 million for the quarter ended December 31, 2016. ● Net loans increased 3.9% to $543.4 million at December 31, 2017, compared to $523.2 million as of September 30, 2017 ● Deposits decreased 2.0% to $514.4 million at December 31, 2017, compared to $524.8 million at September 30, 2017 ● Return on average assets (annualized) was 0.77% for the quarter ended December 31, 2017, compared to 0.81% and 1.09% for the quarters ended September 30, 2017 and December 31, 2016, respectively ● Return on average equity (annualized) was 7.36% for the quarter ended December 31, 2017, compared to 7.68% and 10.92% for the quarters ended September 30, 2017 and December 31, 2016, respectively Both the Company and Bank continue to maintain capital levels in excess of the regulatory requirements and the Bank continued to be categorized as “well-capitalized” at December 31, 2017.\nOperating Results\nNet interest income increased $2.0 million, or 8.8%, to $24.1 million during the year ended December 31, 2017, compared to $22.1 million during the year ended December 31, 2016. The increase was primarily a result of increased interest income on loans, due to both higher average balances and loan yields, partially offset by increased interest expense.\nInterest income increased $2.4 million, or 9.6%, to $27.4 million during the year ended December 31, 2017, compared to $25.1 million during the year ended December 31, 2016. Interest income on loans increased $2.1 million, or 8.5%, to $26.7 million during the year ended December 31, 2017, compared to $24.6 million during the year ended December 31, 2016. The change from the comparable period one year ago was primarily due to higher average loan balances. The average balance of the loan portfolio was $508.5 million for the year ended December 31, 2017, compared to $474.4 million for the year ended December 31, 2016. The weighted-average yield on the loan portfolio was 5.25% for the year ended December 31, 2017, compared to 5.19% for the year ended December 31, 2016. Interest income on investments increased $300,000, or 67.9%, to $742,000 during the year ended December 31, 2017, compared to $442,000 during the year ended December 31, 2016. The change from the prior year was due to higher cash balances and higher average yields due to the increase in interest rates over the past year. Also included in interest income on investments, was a $57,000 discount that was taken into income in July 2017 as a result of an early redemption of a non-agency mortgage-backed security.\nInterest expense increased $449,000, or 15.4%, to $3.4 million during the year ended December 31, 2017, compared to $2.9 million during the year ended December 31, 2016. Interest expense on deposits increased $313,000, or 11.6%, to $3.0 million for the year ended December 31, 2017, compared to $2.7 million for the year ended December 31, 2016. The increase from the prior year was primarily a result of the higher average deposit balances during 2017. Average deposits increased to $493.6 million at December 31, 2017, as compared to $452.5 million at December 31, 2016. The increase in deposits was the result of organic growth and the acquisition of $14.5 million in deposits in connection with our University Place branch acquisition in July 2017. The weighted-average cost of deposits increased to 0.61% for 2017 compared to 0.60% for 2016. The cost of borrowings increased $136,000, or 64.5%, to $347,000 during the year ended December 31, 2017, from $211,000 during the year ended December 31, 2016. The increase in the borrowing cost for 2017 compared to 2016 was primarily due to the increase in the weighted-average cost of borrowings. The weighted-average cost of borrowings for the year ended December 31, 2017 was 1.16% compared to 0.58% for the year ended December 31, 2016. As the Federal Reserve has increased interest rates over the past year, those increases are reflected in the borrow costs from the Federal Home Loan Bank of Des Moines.\nThe net interest margin increased to 4.35% for 2017, compared to 4.26% for 2016. The increase for the year over year period was due to the combination of increases in both the average balance and yield on loans. The weighted-average yield on loans increased six basis points during 2017. The weighted-average gross loan balance increased $34.2 million, or 7.2%, in 2017 compared to $474.4 million in 2016.\nWe recorded a provision for loan losses of $500,000 for the year ended December 31, 2017 compared to a $454,000 provision for the year ended December 31, 2016. The increase in the provision for loan losses for the year was primarily a result of the increase in the loan portfolio and also reflects improvements in our asset quality metrics. The gross loan portfolio increased $48.6 million, or 9.7% compared to December 31, 2016. Net charge-offs for 2017 totaled $81,000 compared to $268,000 for 2016. Nonperforming loans decreased to $2.3 million at December 31, 2017 compared to $3.3 million at December 31, 2016.\nNoninterest income decreased $1.3 million, or 24.6%, to $3.9 million for the year ended December 31, 2017, compared to $5.1 million for the year ended December 31, 2016. The decrease from one year ago was primarily the result of a $613,000 decline in service charges and fee income, a $341,000 decline in mortgage servicing income, and a $295,000 decrease in the gain on sale of loans. The decrease in service charges and fee income included a decrease in loan fees, as well as overdraft fees. The decrease in loan fees was due to the deferral of additional loan fees compared to the same period in 2016 as well as lower loan volumes. During 2017, we originated and sold $52.0 million of loans compared with $88.1 million in 2016. The decrease in mortgage servicing income compared to one year ago was due to both the lower underlying principal balance of loans being serviced as well as a slight decrease in the market value of the servicing rights. Total loans serviced for others was $411.4 million at December 31, 2017 compared to $423.9 million at December 31, 2016. The market value of the servicing rights decreased to 83 basis points as of December 31, 2017 from 84 basis points as of December 31, 2016. The decline in the gain on sale of loans was due to a lower volume of loans originated and sold on the secondary market reflecting the increase in residential mortgage interest rates over the last year resulting in a decrease in refinance activity.\nNoninterest expense increased $526,000, or 2.8%, to $19.2 million for the year ended December 31, 2017, from $18.7 million for the year ended December 31, 2016. The increase from the year ended December 31, 2016 was primarily due to higher occupancy expense, higher salaries and benefits expense and higher losses and expense related to other real estate owned (“OREO”) and repossessed assets, partially offset by lower regulatory expenses. The increase in occupancy expense was a result of the relocation of the Company’s headquarters to a new location, the costs associated with the acquisition of the University Place branch, as well as amortization expenses resulting from purchases of fixed assets and tenant improvements. Salaries and benefits expense was higher compared to 2016 primarily due to higher full-time equivalents (“FTE’s”) at December 31, 2017 compared to one year ago partially offset by lower benefit expense and higher deferred costs. FTE’s increased to 116 at December 31, 2017 from 100 at December 31, 2016 primarily due to staffing for our University Place branch as well as staffing in preparation for the opening of our new Belltown branch and for our new loan production office in Sequim. In addition, we had a number of open positions at the end of 2016 that were filled throughout 2017. The increase in losses and expenses related to OREO and repossessed assets was principally the result of the sale of one OREO property at a $103,000 loss.\nThe efficiency ratio for the year ended December 31, 2017 was 68.89%, compared to 68.71% for the year ended December 31, 2016. The slight increase in the efficiency ratio compared to the prior year was due to the reduction in noninterest income and higher noninterest expense in 2017.\nThe provision for income taxes increased $373,000, or 13.8% to $3.1 million for the year ended December 31, 2017, compared to $2.7 million for the year ended December 31, 2016. The Tax Cuts and Jobs Act was signed into law on December 22, 2017, which reduced the federal income tax rate from 35% for corporations to 21% effective in 2018. As a result of this change, we incurred a $309,000 one-time, write-down of our deferred tax asset.\nBalance Sheet Review, Capital Management and Credit Quality\nTotal assets at December 31, 2017 were $645.2 million, compared to $588.4 million at December 31, 2016. The increase from one year ago was the result of the increase in total loans and higher cash balances.\nCash and cash equivalents increased $6.1 million, or 11.2%, to $60.7 million at December 31, 2017, compared to $54.6 million at December 31, 2016. The increase from one year ago primarily was a result of the increase in total deposits.\nInvestment securities available-for-sale totaled $5.4 million at December 31, 2017, compared to $6.6 million at December 31, 2016. The decrease was due to normal principal pay downs on the investments and the full redemption of a non-agency mortgage-backed security totaling $318,000 in July 2017.\nGross loans totaled $548.6 million at December 31, 2017, compared to $500.0 million at December 31, 2016. The largest increases in the loan portfolio were in the commercial and multifamily real estate portfolio, which increased $30.3 million and in the commercial business loan portfolio, which increased $14.5 million. At December 31, 2017, commercial and multifamily real estate loans accounted for 38.5% of the gross loan portfolio and one- to four- family loans accounted for 28.6% of the portfolio. Consumer loans, consisting of home equity, manufactured and floating homes, and other consumer loans accounted for 14.4% of the portfolio at that date. Construction and land loans accounted for 11.1% of the portfolio and commercial business loans accounted for the remaining 7.4% of the portfolio at December 31, 2017.\nNonperforming assets (\"NPAs\"), which are comprised of non-accrual loans, nonperforming troubled debt restructurings (“TDRs”), other real estate owned (“OREO”) and other repossessed assets, decreased to $2.9 million, or 0.45% of total assets, at December 31, 2017 compared to $4.5 million, or 0.77% of total assets at December 31, 2016.\nThe following table summarizes our NPAs:\nNonperforming Loans: December 31, 2017 December 31, 2016 (Dollars in thousands, unaudited) Balance\n% of Total Balance % of Total One- to four- family $ 837 28.9 % $ 2,216 49.0 % Home equity loans 722 25.0 553 12.2 Commercial and multifamily 201 6.9 218 4.8 Construction and land 92 3.2 - 0.0 Manufactured homes 206 7.1 120 2.7 Commercial business 217 7.5 242 5.4 Other consumer 8 0.3 - 0.0 Total nonperforming loans 2,283 78.9 3,349 74.1 OREO and Other Repossessed Assets: One- to four- family - - 562 12.4 Commercial and multifamily 600 20.7 600 13.3 Manufactured homes 10 0.4 10 0.2 Total OREO and repossessed assets 610 21.1 1,172 25.9 Total nonperforming assets $ 2,893 100.0 % $ 4,521 100.0 % The following table summarizes the allowance for loan losses:\nYear Ended: Allowance for Loan Losses December 31, December 31, (Dollars in thousands, unaudited) 2017 2016 Balance at beginning of period $ 4,822 $ 4,636 Provision for loan losses during the period 500 454 Net charge-offs during the period (81 ) (268 ) Balance at end of period $ 5,241 $ 4,822 Allowance for loan losses to total loans 0.96 % 0.96 % Allowance for loan losses to total nonperforming loans 229.57 % 143.98 % The allowance for loan losses to total loans remained unchanged at 0.96% for both the years ended December 31, 2017 and 2016. The gross loan portfolio increased $48.6 million, or 9.7% compared to one year ago. Net charge-offs decreased to $81,000 for the year ended December 31, 2017, compared to $268,000 for the year ended December 31, 2016.\nDeposits increased to $514.4 million at December 31, 2017, compared to $467.7 million at December 31, 2016. The increase in deposits was the result of organic growth and $14.5 million in deposits assumed in connection with our purchase of the University Place branch. Borrowings increased to $59.0 million at December 31, 2017, compared to $54.8 million one year ago.\nSound Financial Bancorp, Inc. , a bank holding company, is the parent company of Sound Community Bank, and is headquartered in Seattle, Washington with full-service branches in Seattle, Tacoma, Mountlake Terrace, Sequim, Port Angeles, Port Ludlow, and University Place. Sound Community Bank is a Fannie Mae Approved Lender and Seller/Servicer with an additional Loan Production Office in the Madison Park neighborhood of Seattle, Washington. For more information, please visit www.soundcb.com .\nForward Looking Statement Disclaimer\nWhen used in filings by Sound Financial Bancorp, Inc. (the \"Company”) with the Securities and Exchange Commission (the “SEC”), in the Company's press releases or other public or stockholder communications, and in oral statements made with the approval of an authorized executive officer, the words or phrases “will likely result,” “are expected to,” “will continue,” “is anticipated,” “estimate,” “project,” “intends” or similar expressions are intended to identify “ ” within the meaning of the Private Securities Litigation Reform Act of 1995. Such , which are based on various underlying assumptions and expectations and are subject to risks, uncertainties and other unknown factors, may include projections of our future financial performance based on our growth strategies and anticipated trends in our business. These statements are only predictions based on our current expectations and projections about future events, and may turn out to be wrong because of inaccurate assumptions we might make, because of the factors illustrated below or because of other important factors that we cannot foresee that could cause our actual results to be materially different from the historical results or from any future results expressed or implied by such .\nFactors which could cause actual results to differ materially, include, but are not limited to: changes in general and local economic conditions; legislative changes; changes in policies by regulatory agencies; fluctuations in interest rates ; the risks of lending and investing activities, including changes in the level and direction of loan delinquencies and write-offs and changes in estimates of the adequacy of the allowance for loan losses; the Company's ability to access cost-effective funding; fluctuations in real estate values and both residential and commercial real estate market conditions; demand for loans and deposits in the Company's market area; secondary market conditions for loans; results of examinations of the Company or its wholly owned bank subsidiary by their regulators; competition ; changes in management’s business strategies and other factors described in the Company’s latest annual Report on Form 10-K and Quarterly Reports on Form 10-Q and other filings with the Securities and Exchange Commission – which are available at www.soundcb.com and on the SEC’s website at www.sec.gov .\nThe Company does not undertake - and specifically declines any obligation - to publicly release the result of any revisions which may be made to any to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events.\nCONSOLIDATED INCOME STATEMENTS Quarter Ended Sequential\nQuarter\n% Change Year over\nYear\n% Change (Dollars in thousands, unaudited) Dec. 31,\n2017 Sep. 30,\n2017 Dec. 31,\n2016 Interest income $ 7,275 $ 7,066 $ 6,653 3.0 % 9.3 % Interest expense 931 880 763 5.8 22.0 Net interest income 6,344 6,186 5,890 2.6 7.7 Provision for loan losses 250 250 204 0.0 22.5 Net interest income after provision for loan losses 6,094 5,936 5,686 2.7 7.2 Noninterest income: Service charges and fee income 453 439 586 3.2 (22.7 ) Increase in cash surrender value of life insurance 82 82 84 0.0 (2.4 ) Mortgage servicing income 166 18 445 822.2 (62.7 ) Gain on sale of loans 352 287 338 22.6 4.1 Total noninterest income 1,053 826 1,453 27.5 (27.5 ) Noninterest expense: Salaries and benefits 2,602 2,777 2,693 (6.3 ) (3.4 ) Operations expense 1,296 1,002 1,124 29.3 15.3 Data processing 443 448 520 (1.1 ) (14.8 ) Net (gain) loss on OREO and repossessed assets (12 ) 109 (2 ) (111.0 ) 500.0 Other noninterest expense 565 600 520 (5.8 ) 8.7 Total noninterest expense 4,894 4,936 4,855 (0.9 ) 0.8 Income before provision for income taxes 2,253 1,826 2,284 23.4 (1.4 ) Provision for income taxes 1,067 604 721 76.7 48.0 Net income $ 1,186 $ 1,222 $ 1,562 (2.9 )% (24.1 )%", "external_links": ["https://www.globenewswire.com/Tracker?data=3SBohmnfoXXGaKnkfYEr1yAcRIN5Xky93OjLQaHe5ej7NSpFfSLOlfDiZUV2AVunTXnCt1LlvHK1V4byLHX4sQ==", "https://www.globenewswire.com/Tracker?data=PDmGvIHfUtsUxFAZIhwkTh_Xds1WEtf7d8pnUIYNKYnS7-LRJ3T5fnJAimVYXfTaAYk1YmAuE1nD3YdB7Tmw0Q==", "https://www.globenewswire.com/Tracker?data=PDmGvIHfUtsUxFAZIhwkTt83sQf_GjDeQdytQPi6DZAGdFvbNk60ULORdBacWsdp9iH0YDcZu5vIWhHxAwW63g=="], "published": "2018-01-26T02:00:00.000+02:00", "crawled": "2018-01-26T03:38:07.006+02:00", "highlightTitle": ""}