{"organizations": [], "uuid": "c7459c6d30915ce23cc5f70f954a4502f197b3e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/24/104670924-GettyImages-492682160-autonomous-car.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/10000101/device/rss/rss.html", "section_title": "Autos", "url": "https://www.cnbc.com/2018/01/08/driverless-cars-will-have-to-learn-the-language-of-driving--commentary.html", "country": "US", "domain_rank": 767, "title": "Driverless cars will have to learn the language of driving - commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-08T22:57:00.000+02:00", "replies_count": 0, "uuid": "c7459c6d30915ce23cc5f70f954a4502f197b3e8"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/driverless-cars-will-have-to-learn-the-language-of-driving--commentary.html", "ord_in_thread": 0, "title": "Driverless cars will have to learn the language of driving - commentary", "locations": [], "entities": {"persons": [], "locations": [{"name": "pittsburgh", "sentiment": "none"}, {"name": "waymo", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}], "organizations": [{"name": "university of pittsburgh", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Recently, while on my way to the University of Pittsburgh's campus, I made a quick \" Pittsburgh left \" – taking a left turn just as the light turns green – while facing a driverless car.\nInstead of jolting forward or honking – as some human drivers would be tempted to do – the car allowed me to go. In this case, the interaction was pleasant. (How polite of the car to let me cut it off!)\nBut as a sociolinguist who studies human-computer interaction, I started thinking about how self-driving cars will communicate with the human drivers they encounter on the road. Driving can involve a range of social signals and unspoken rules, some of which vary by country – even by region or city. How will driverless cars be able to navigate this complexity? Can they ever be programmed to do so?\nWhat driverless cars can do Here in Pittsburgh, Uber has tested self-driving cars with a backup driver behind the wheel; in Phoenix, Waymo's cars operate in a limited part of the city without any backup driver at all .\nWe know the driverless cars are equipped with a technology called LIDAR , which creates a 360-degree image of the car's surroundings. Image sensors can interpret signs, lights and lane markings. A separate radar detects objects, while a computer incorporates all of this information along with mapping data to guide the car.\nMore from The Conversation:\nWith FCC's net neutrality ruling, the US could lose its lead in online consumer protection\nTrust in digital technology will be the internet's next frontier, for 2018 and beyond\nTo get the most out of self-driving cars, tap the brakes on their rollout\nAlthough ideally autonomous vehicles will be able to \"talk\" to one another in order to allow smoother navigation and reduce crashes , this technology is still in the early stages.\nBut any autonomous vehicle will also need to be able to interact with traditional cars and their drivers, as well as pedestrians, bikes and unforeseen events like lane closures, disabled stop lights, emergency vehicles and accidents.\nThe complex language of driving This is where things can get murky.\nFor example, if you're driving and pass a speed trap, you might flash your headlights at drivers coming in the other direction to let them know. But flashing headlights can also mean \"your high beams are too bright,\" \"you forgot to put your headlights on\" or \"go ahead\" in situations where it's unclear who has the right of way. In order to interpret the meaning, a person will consider the context: the time of day, the type of road, the weather. But how would an autonomous vehicle react?\nThere are other forms of communication to help us navigate, ranging from honks and sirens, to hand signals and even bumper stickers.\nOf course, humans use all sorts of hand gestures – waving a car in front of them, indicating that another driver needs to slow, and even giving the finger when angry. Sounds can communicate love, anger, arrivals, departures, warnings and more. Drivers can express total disapproval with a hard, extended hit of the horn. Of course, emergency sirens encourage drivers to make way.\nBut specific meaning can vary by region or country. For example, a few years ago, Public Radio International ran a story about the language of honking in Cairo, Egypt, which is \"spoken\" primarily by men. These honks can have complex constructions; for example, four short honks followed by a long one mean \"open your eyes\" to warn someone who is not paying attention.\nIn Pittsburgh, people tend to honk before going through a short, narrow or curvy tunnel. In Morocco, where I'm originally from, drivers perform varied honks when passing; they'll honk once before passing to secure cooperation, again as they pass (to signal progress), and lastly after they pass to say, \"thank you.\" Yet this might be confusing – or even perceived as rude – to drivers in the U.S.\nWritten communication also plays a role between cars and drivers. For example, signs such as \"Baby on Board\" or \"Students on Board\" are supposed to encourage the drivers following these vehicles to be even more careful. Bumper stickers like \"Caution: Wide Right Turn\" or \"This Vehicle Makes Frequent Stops\" can be critical to safety.\nWhat if there's a communication breakdown? Vehicles can be taught to \"read\" road signs, and thus presumably can be taught to recognize common warnings on bumpers.\nYet navigating construction sites or accident scenes may require following directions from a human in a way that cannot be programmed. This creates a huge opportunity for error. Because hand signals vary widely from region to region (and even person to person), autonomous cars could fail to recognize a signal to go or, more catastrophically, could mistakenly follow a hand gesture into a barrier or another car.\nThis gives me pause: How much knowledge about our societal and linguistic values are built into the system? How can driverless cars learn to interpret hand and auditory signals?\nGoogle cars can apparently recognize hand signals on bikers , but what if the biker doesn't use standard signals? Who gets to embed the algorithm in the machine, and how are sociolinguistic values assigned?\nIn my experience, the self-driving car was very polite and didn't honk or otherwise chastise me for my behavior (though the human passenger did communicate his displeasure with a gaze). But had I waved it in front of me, would it have been able to respond appropriately? A 2015 story in Robotics Trends described how a bike and a Google car got stuck in a standoff when the car misread signals from the biker.\nCities (and countries) possess a variety of sociolinguistic cues. It remains to be seen if the engineers working on driverless cars will be able to program these subtle – but important – differences into these vehicles as more and more appear on the roads.\nCommentary by Abdesalam Soudi , a Sociolinguist at the University of Pittsburgh . He is also a contributor at The Conversation , an independent source of news and views from the academic and research community. Follow him on Twitter @soudi_a .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": ["https://www.twitter.com/soudi_a", "https://theconversation.com/trust-in-digital-technology-will-be-the-internets-next-frontier-for-2018-and-beyond-87566", "https://theconversation.com/profiles/abdesalam-soudi-420498", "https://counter.theconversation.edu.au/content/88824/count", "https://theconversation.com/javascripts/lib/content_tracker_hook.js", "https://theconversation.com/with-fccs-net-neutrality-ruling-the-us-could-lose-its-lead-in-online-consumer-protection-88816", "https://www.nytimes.com/interactive/2016/12/14/technology/how-self-driving-cars-work.html", "https://arstechnica.com/cars/2017/12/driverless-cars-became-a-reality-in-2017-and-hardly-anyone-noticed/", "http://www.roboticstrends.com/article/a_cyclists_encounter_with_an_indecisive_google_self_driving_car", "https://www.pri.org/stories/2012-09-21/cairo-cars-speak", "https://en.wikipedia.org/wiki/Pittsburgh_left", "https://theconversation.com/to-get-the-most-out-of-self-driving-cars-tap-the-brakes-on-their-rollout-88444", "https://theconversation.com/saving-lives-by-letting-cars-talk-to-each-other-59221", "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PALL&p=1&u=/netahtml/PTO/srchnum.htm&r=1&f=G&l=50&s1=9014905.PN.&OS=PN/9014905&RS=PN/9014905", "http://www.twitter.com/CNBCopinion", "https://www.recode.net/2016/7/5/12101360/google-self-driving-car-cyclist-bike-handsignals-report", "http://time.com/3719270/you-asked-how-do-driverless-cars-work/", "http://www.post-gazette.com/business/tech-news/2017/09/20/uber-atg-pittsburgh-self-driving-autonomous-cars-volvo-travis-kalanick-ford-white-gray/stories/201709200162", "http://www.thedrive.com/tech/8657/heres-how-the-sensors-in-autonomous-cars-work", "https://www.wired.com/2017/02/self-driving-cars-cant-even-construction-zones/"], "published": "2018-01-08T22:57:00.000+02:00", "crawled": "2018-01-08T23:23:28.003+02:00", "highlightTitle": ""}