{"organizations": [], "uuid": "0c45ec9b13a3cd837a9b96f94b02145e8ff650e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225022185&w=1200&r=LYNXMPEE0O054", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-softbank-group-investment-breakingvie/breakingviews-uber-plan-highlights-softbanks-addiction-to-debt-idUSKBN1FE0BJ", "country": "US", "domain_rank": 408, "title": "Uber plan highlights SoftBank's addiction to debt", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T12:25:00.000+02:00", "replies_count": 0, "uuid": "0c45ec9b13a3cd837a9b96f94b02145e8ff650e3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-softbank-group-investment-breakingvie/breakingviews-uber-plan-highlights-softbanks-addiction-to-debt-idUSKBN1FE0BJ", "ord_in_thread": 0, "title": "Uber plan highlights SoftBank's addiction to debt", "locations": [], "entities": {"persons": [{"name": "masayoshi son", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "hong kong softbank", "sentiment": "negative"}, {"name": "softbank", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}, {"name": "arm", "sentiment": "none"}, {"name": "information", "sentiment": "none"}, {"name": "softbank vision fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG (Reuters Breakingviews) - SoftBank’s debt wizards have found new ingredients to chuck in their finance cauldron. A report that they might raise funds against semiconductor subsidiary ARM or a newly purchased 15 percent stake in Uber sounds entirely plausible: the hyperactive Japanese group does whatever possible to maximise financial firepower.\nSoftBank is talking to banks about borrowing $5 billion against ARM, technology news service The Information said this week, citing people familiar with the matter. The report added that Masayoshi Son’s $93 billion tech and telecoms outfit is considering raising capital from the shares in Uber, the U.S. ride-hailing giant.\nNothing is official, nor is it clear how long-term any borrowing would be. The Information suggests ARM proceeds could tide SoftBank over as it awaits U.S. approval to transfer Uber shares to investment vehicles run by its $98 billion SoftBank Vision Fund segment. So this could be merely a clever stopgap.\nStill, the notion broadly fits in with Son’s modus operandi. The listed parent is an avid borrower. Gross debt was 5.7 times EBITDA as of June, according to Moody’s Investors Service. And SoftBank’s army of in-house bankers uses all kinds of funky financing to conjure up funds.\nThe Vision Fund is the most inventive, but SoftBank has also created securities exchangeable into Alibaba stock, and sold scads of equity-like hybrid bonds. U.S. telecoms unit Sprint has sold bonds backed by mobile spectrum. Another recent report suggested Son might float the Japanese mobile business in order to unlock $18 billion and seed a second Vision Fund with the proceeds.\nARM, as a standalone unit that was until recently public, should be a relatively straightforward proposition for lenders. Borrowing against shares in a startup such as Uber would be unorthodox, but the line between listed companies and huge private tech firms has blurred of late. The latter now have more numerous investors and reveal some financial details.\nBut SoftBank is complicated enough already. Remortgaging ARM would add yet another wrinkle. Suppose for some reason its performance tanked: banks might demand cash from the parent, or seize shares as collateral. As ever, extra layers of leverage magic add fresh complexity and risk.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-25T12:25:00.000+02:00", "crawled": "2018-01-25T10:07:49.020+02:00", "highlightTitle": ""}