{"organizations": [], "uuid": "9f02f0210599fd1ff7f5af2da2f3d71447adaaa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219323006&w=1200&r=LYNXMPEE030TI", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-trump-election-democrats/trump-attacks-democrats-over-voter-fraud-panel-urges-voter-id-rules-idUSKBN1ET1I1", "country": "US", "domain_rank": 408, "title": "Trump attacks Democrats over voter fraud panel, urges voter ID rules", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T15:35:00.000+02:00", "replies_count": 0, "uuid": "9f02f0210599fd1ff7f5af2da2f3d71447adaaa9"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-election-democrats/trump-attacks-democrats-over-voter-fraud-panel-urges-voter-id-rules-idUSKBN1ET1I1", "ord_in_thread": 0, "title": "Trump attacks Democrats over voter fraud panel, urges voter ID rules", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "electoral college", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 1:36 PM / in 7 hours Trump attacks Democrats over voter fraud panel, urges voter ID rules Reuters Staff   U.S. President Donald Trump pushed for stricter voter identification rules on Thursday and accused Democratic-led states of failing to cooperate with a presidential election fraud commission that he disbanded this week. \nIn a pair of posts on Twitter, the Republican president reiterated his allegations, without offering any evidence, that there was voter fraud in the November 2016 presidential election. \nTrump won the White House through the state-by-state Electoral College system but lost the popular vote by nearly 3 million votes to Democrat Hillary Clinton. \nMost state officials who oversee elections, including Republicans and Democrats, as well as election law experts say voter fraud is rare in the United States. \nOn Wednesday, the White House said in a statement it was shutting down the bipartisan panel that Trump established in May to look into allegations of fraud in the 2016 contest, saying many states had refused to provide data. \nTrump had now asked the Department of Homeland Security to investigate and decide what action was needed, the White House said. \nThe panel was headed by Vice President Mike Pence, along with Kris Kobach, who as Kansas Secretary of State runs elections in that state and who has long urged new voting restrictions. \nTheir effort, however, quickly met resistance from a number of U.S. states as well as civil rights groups such as the Electronic Privacy Information Center and the American Civil Liberties Union, which had both filed lawsuits opposing it. \nStates and the groups balked at the information requested by the commission such as names, birth dates, political affiliation and voting histories. More than 20 states refused outright to provide the data and others said they needed to study the issue. \nOn Thursday, Trump said uncooperative “mostly Democratic states ... fought hard that the Commission not see their records or methods because they know that many people are voting illegally. System is rigged, must go to Voter I.D.” \nA number of states such as Texas have already passed laws requiring voter identification. Critics say that can make it harder for some people, including minorities, to vote because they are less likely to have certain IDs. Proponents say such steps are necessary and are not onerous. \nIn July, a federal judge in Washington noted the advisory panel lacked legal authority to compel states to provide data, even as it allowed the commission’s work to move forward. A U.S. appeals court later also allowed the panel to continue. Reporting by Susan Heavey; Editing by Frances Kerry", "external_links": [], "published": "2018-01-04T15:35:00.000+02:00", "crawled": "2018-01-04T15:49:15.072+02:00", "highlightTitle": ""}