{"organizations": [], "uuid": "593afee788cacbb65dd952ee64319ca3d84ea4a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-funds-rates-analysis/rising-bond-yields-not-high-enough-yet-to-spook-investors-idUSKBN1FJ2M6", "country": "US", "domain_rank": 408, "title": "Rising bond yields not high enough yet to spook investors", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T02:39:00.000+02:00", "replies_count": 0, "uuid": "593afee788cacbb65dd952ee64319ca3d84ea4a0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-funds-rates-analysis/rising-bond-yields-not-high-enough-yet-to-spook-investors-idUSKBN1FJ2M6", "ord_in_thread": 0, "title": "Rising bond yields not high enough yet to spook investors", "locations": [], "entities": {"persons": [{"name": "margaret patel", "sentiment": "none"}, {"name": "patel", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "wells fargo asset management", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - The jump in U.S. Treasury yields to more than three-year highs is pushing fund managers to sell interest-rate sensitive utility and real estate stocks, but does not yet threaten to derail the nine year-long bull market in U.S. equities or slow down the broader economy.\nInstead, the 10-year Treasury yields would need to rise above 3 percent - or about 30 basis points from their current 2.71 percent - for the effects of higher borrowing costs to start to seep into the economy in the form of a slowdown in the housing market or consumer spending, fund managers say.\n“Rates can go quite a bit higher before we see any lasting negative affects in the stock market,” said Margaret Patel, a senior portfolio manager at Wells Fargo Asset Management. “With a pickup in global economic growth and the recent U.S. tax cuts, the backdrop for equities looks a lot better than it did one or two years ago.”\nAs a result, Patel is selling some of her high-yield “junk” bond holdings and buying growth-focused equity sectors like technology and healthcare, leaving her overall bond allocation near multi-year lows, she said.\nThe broad S&P 500 fell nearly 1 percent in early trading Tuesday in part due to concerns about rising interest rates. The yield of the benchmark 10-year Treasury note - which helps set consumer interest rates ranging from automobile loans to mortgages - touched 2.71 percent on Tuesday, up from a low of 2.06 percent in early September.\nYet fund managers say that the recent rise in yields helps bring interest rates back to more natural levels after years of massive intervention by central banks in response to the 2008 financial crisis.\n“Yields are moving back to what we consider their intrinsic valuation, yet are still low on a historical basis and aren’t quite at a level where we consider them an attractive alternative” to equities at a time when the economic expansion in the U.S. economy is accelerating, said Mike Dowdall, a portfolio manager with BMO Global Asset Management.\nNO SIGNS OF BROAD ROTATION The current bull market has weathered other quick jumps in Treasury yields without faltering. The yield of the 10-year Treasury rose from 1.7 percent in early November 2016 to 2.5 percent in March of 2017, due in part to expectations that the election of President Donald Trump would lead to higher inflation. Global economic growth and a Republican-led effort to slash corporate taxes helped push the S&P 500 up nearly 20 percent in 2017.\nOverall, rising yields have not yet pushed fund managers to broadly rotate out of stocks and into bonds. So-called balanced mutual funds - those that invest in a mixture of both stocks and bonds - had 55.4 percent of their portfolios in equities at the end of 2017, down approximately 2 percentage points from 2014, according to Lipper data.\nSectors most exposed to interest rates have fallen. The SPDR Utilities Select fund ( XLU.P ), an exchange traded fund that tracks the performance of utilities companies, is down 4.2 percent year-to-date, while the Real Estate Select SPDR ( XLRE.P ) fund is down 4.1 percent. The broad S&P 500 is up 5.8 percent over the same time.\nMartin Jarzebowski, a portfolio manager of the $631 million Federated Clover Small Value fund ( VSFAX.O ), said that he expects the stock market rally to continue even if the 10-year Treasury yield tops 3 percent by the end of the year. As a result, he is increasing his overweight in financial companies such as Iberiabank Corp ( IBKC.O ) and Radian Group Inc ( RDN.N ), both up 8 percent or more for the year to date.\n“The rationale is there aren’t just rising rates, but you also have deregulation” as a result of the Trump administration, he said. “It’s been almost a decade since the financial sector has been in vogue.”\nReporting by David Randall; Editing by Jennifer Ablan and Nick Zieminski\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T02:39:00.000+02:00", "crawled": "2018-01-31T04:27:49.001+02:00", "highlightTitle": ""}