{"organizations": [], "uuid": "f9ffdea046f7385cf78725e29beac9efbd764f44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 14, "shares": 14, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/16/103310520-GettyImages-109075851.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/china-set-to-top-japan-as-worlds-biggest-natural-gas-importer.html", "country": "US", "domain_rank": 767, "title": "China set to top Japan as world's biggest natural gas importer", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.218, "site_type": "news", "published": "2018-01-03T11:39:00.000+02:00", "replies_count": 0, "uuid": "f9ffdea046f7385cf78725e29beac9efbd764f44"}, "author": "Str", "url": "https://www.cnbc.com/2018/01/03/china-set-to-top-japan-as-worlds-biggest-natural-gas-importer.html", "ord_in_thread": 0, "title": "China set to top Japan as world's biggest natural gas importer", "locations": [], "entities": {"persons": [{"name": "jap", "sentiment": "neutral"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "sichuan province", "sentiment": "none"}, {"name": "suining", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters cnbc.com", "sentiment": "none"}, {"name": "thomson reuters eikon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Beijing's crackdown on pollution has put China on track to overtake Japan this year as the world's biggest importer of natural gas, used to replace dirtier coal.\nChina — already the biggest importer of oil and coal — is the world's third biggest user of natural gas behind the United States and Russia, but has to import around 40 percent of its total needs as domestic production can't keep up with demand.\nData compiled from the Thomson Reuters Eikon terminal indicates China's 2017 imports of pipeline gas and liquefied natural gas (LNG) will top 67 million tonnes, up by more than a quarter from a year earlier. LNG imports alone surged more than 50 percent.\nThe data, which includes LNG tanker arrivals to China and pipeline monthly import flow estimates, is preliminary as December figures are not yet available.\nChina still lags Japan, with gas annual imports of around 83.5 million tonnes, all as LNG, but its overall gas imports topped Japan's in September and again in November, government data and shipping flows show.\nAnalysts say the trend is set and China should top Japan for the full year in 2018.\n\"Both LNG and pipeline imports will continue to increase in the next few years. We expect China to overtake Japan as the world's largest gas importer in 2018,\" said Miaoru Huang, Asia gas and LNG senior manager at energy consultancy Wood Mackenzie.\n\"But Japan will remain as the No.1 LNG importer till around 2028,\" she added.\nChina last year started to move millions of households and many industrial facilities from coal to gas as part of efforts to clean its skies, sparking an unprecedented rally in overseas import orders.\nChina's three biggest LNG suppliers are Australia, Qatar and Malaysia, while pipeline imports come from Central Asia and Myanmar. A pipeline connecting China to Russia is under construction.\nUnlike established LNG importers which import the bulk of their cargoes under long-term contracts with fixed monthly volumes and a link to the oil market, many Chinese utilities buy LNG in the spot market when they need it at short notice, such as the current peak demand winter season.\nAs a result, Asian spot LNG prices have more than doubled since June to $11.20 per million British thermal units (mmBtu), their highest since November 2014, making LNG one of 2017's strongest performing commodities.\nChina's surging demand already pushed it past South Korea in 2017 as the world's number 2 LNG importer.", "external_links": [], "published": "2018-01-03T11:39:00.000+02:00", "crawled": "2018-01-03T11:39:09.021+02:00", "highlightTitle": ""}