{"organizations": [], "uuid": "155fe72f8a64c755732b9933613fb5cb80355f06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226984210&w=1200&r=LYNXMPEE0U15B", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-mexico-oil/long-wait-ends-for-big-oil-as-mexico-auctions-prized-blocks-idUSKBN1FK278", "country": "US", "domain_rank": 408, "title": "Long wait ends for Big Oil as Mexico auctions prized blocks", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T23:31:00.000+02:00", "replies_count": 0, "uuid": "155fe72f8a64c755732b9933613fb5cb80355f06"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mexico-oil/long-wait-ends-for-big-oil-as-mexico-auctions-prized-blocks-idUSKBN1FK278", "ord_in_thread": 0, "title": "Long wait ends for Big Oil as Mexico auctions prized blocks", "locations": [], "entities": {"persons": [{"name": "enrique pena nieto", "sentiment": "none"}, {"name": "pena nieto", "sentiment": "none"}], "locations": [{"name": "mexico city", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "gulf of mexico", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 3:31 PM / Updated an hour ago Shell sweeps nine of 19 blocks awarded in Mexico oil auction Adriana Barrera , Marianna Parraga 4 Min Read \nMEXICO CITY (Reuters) - Royal Dutch Shell ( RDSa.L ) snapped up nine of 19 oil and gas blocks awarded in Mexico’s prized Gulf of Mexico deep waters, emerging the clear winner in the country’s biggest auction since the energy sector was opened up to foreign oil firms. \nThe stakes are high for Mexican President Enrique Pena Nieto and his ruling party, which is keen to showcase the results of the liberalization ahead of a presidential election in July. \nShell focused on blocks in the Perdido and Salina basins, which were expected to be the most competitive of the 29 areas on offer in the auction. Perdido is close to U.S. waters where oil firms already operate. \n(Graphic on the blocks: tmsnrt.rs/2DGpgnB ) \nShell won four blocks as a lone bidder, four more in a consortium with Qatar Petroleum and another in a consortium with Mexican state oil firm Pemex. \n“This is excellent news for Mexico and is a strong commitment from Shell in Mexico. We are a big player in deep water worldwide,” said Alberto de la Fuente, president of Shell Mexico. \nShell would spend more than the minimum investment it pledged in the bids, he said, but declined to give further details. Shell was operating in Mexico before the auction. The firm won a block in an earlier sale in Mexico’s shallow waters in 2017 and has a chain of 30 gas stations in Mexico, he said. \nPC Carigali, a unit of Malaysia’s state oil firm Petronas, won six blocks. The firm won in consortia for four blocks and alone for two more. \n“We’re in, we want to explore and we want to find oil and gas,” said Faisal Bakar, Carigali’s country manager in Mexico. \nCarigali also participated in winning bids for two deep water fields in an earlier auction. \nQatar Petroleum participated in winning consortia in five blocks. A Pemex logo is seen at the Energy Mexico Expo 2018 in Mexico City, Mexico January 30, 2018. REUTERS/Carlos Jasso \nTen blocks received no bids, so were not awarded. \nFor a full list of winners and bidders, see. OIL PRICE HELPS \nWith oil prices CLc1 LCOc1 near a three-year high, energy firms are emerging from a recession. They have more cash now than at any time since 2014, so conditions are better than they were for any of the eight auctions Mexico has held since 2015. \nThe higher oil price helped Shell to put in solid bids, de la Fuente said. \nShell was also a big winner in an oil auction for blocks in Brazil’s deepwater in October, snapping up three blocks in the presalt region in the country’s Atlantic waters. \nMexico faces stiff competition from Brazil and other regional rivals keen to attract cash from global oil majors. Argentina, Uruguay and Ecuador are also auctioning oil and gas fields this year. \nPena Nieto’s 2013 energy reform was his highest-profile economic initiative, aimed at attracting hundreds of billions of dollars of investment to turn around a state-run oil industry in decline. The results of previous auctions to attract foreign investment were mixed. \nFirms that won in the previous auctions have pledged investments of $61 billion. But Mexico needs 10 times that amount to raise oil output back to 2004 levels, the country’s Energy Secretary Pedro Joaquin Coldwell said on Tuesday. \nSome of the firms that won in previous auctions have made big finds, adding over 2 billion barrels of oil equivalent to reserves. \nMexico is expected to hold its first shale oil and gas auction by the end of 2018, the head of the country’s oil regulator said on Wednesday, potentially opening up one of the world’s top reserves of unconventional energy. Related Coverage", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://tmsnrt.rs/2DGpgnB"], "published": "2018-01-31T23:31:00.000+02:00", "crawled": "2018-01-31T17:42:43.010+02:00", "highlightTitle": ""}