{"organizations": [], "uuid": "52c0f39b24932dc1c23311fb642389c205417db3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/egypt-economy-inflation/egypts-inflation-drop-shows-spending-levels-still-low-say-economists-idUSL4N1P64ND", "country": "US", "domain_rank": 408, "title": "Egypt's inflation drop shows spending levels still low, say economists", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-12T22:51:00.000+02:00", "replies_count": 0, "uuid": "52c0f39b24932dc1c23311fb642389c205417db3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/egypt-economy-inflation/egypts-inflation-drop-shows-spending-levels-still-low-say-economists-idUSL4N1P64ND", "ord_in_thread": 0, "title": "Egypt's inflation drop shows spending levels still low, say economists", "locations": [], "entities": {"persons": [], "locations": [{"name": "cairo", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAIRO, Jan 12 (Reuters) - Egypt’s inflation dropped sharply in December, the latest apparent indication of economic improvement after the 2016 currency float hit Egyptians hard.\nEconomists say, however, it may just be showing that spending power has yet to recover.\nPrices climbed to record highs and the Egyptian pound lost half its value after the central bank floated it in November 2016 in a bid to secure a $12 billion International Monetary Fund loan to boost economic growth after years of turmoil.\nWith the pound at about 17.7 to the U.S. dollar from a pegged 8.8 before the float, Egyptians have had to amend their spending habits to deal with their incomes and savings being slashed in half.\nUrban consumer inflation eased to 21.9 percent in December from 26 percent the previous month, its lowest reading since the flotation, official data showed earlier this week.\nCore inflation, stripping out volatile items such as food, fell to 19.86 percent from 25.53 percent.\nSince the float, Egyptian exports have found new markets, narrowing the country’s trade deficit, and foreign reserves and foreign direct investment have surged to record highs.\nBut economists say the inflation drop is the result of a strong base effect, and not necessarily a meaningful economic recovery.\n“After November 2016, you were comparing to the high rates of the post-flotation period, but in December, you had a strong base effect,” said senior economist at Beltone Financial Alia Mamdouh.\nMonthly headline inflation contracted for the first time in two years in December due to a decline in the prices of poultry, meat and some vegetables and beans, data showed.\n“The reduction may signal that spending level has not fully recovered, especially because seasonal demand usually drives rates up,” Mamdouh said.\n“We had expected a monthly rate of 0.5-0.7, but instead everything was flat except for food prices of which some went down.”\nFORCED PRICE CUTS Food producers said they wished to raise prices to maintain profitability, but are unable to because the market cannot absorb any more price hikes.\n“We would like to raise the prices but the market isn’t favourable to that right now,” said Hani Berzi, the chairman of Edita Food Industries, one of the country’s largest food producers.\nRetailers have also had to reduce prices of some foods like poultry and meat to lure back shoppers driven away by hikes.\n“People don’t buy anymore,” said Ismail Gamal, the owner of a poultry shop in Nasr City. “We’re afraid we’ll go out of business, if we don’t reduce prices.”\nEconomists say purchasing power could take three to four years to recover from the shock of the flotation.\n“Segments of society have shifted from meat to cheese as a source of protein, this is what inflation did to consumers,” said Noaman Khalid, CI Capital Asset Management economist.\nHe said a complete economic cycle that includes business recovery and increased wages is necessary before purchasing power returns to pre-float levels and a healthy inflation rate is seen.\nEgypt’s central bank has raised key interest rates by 700 basis points since it floated the pound to battle soaring inflation. Economists expect it to start cutting the rates in their upcoming monetary policy meeting, set for Feb. 15.\nReporting by Arwa Gaballa Editing by Jeremy Gaunt\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T22:51:00.000+02:00", "crawled": "2018-01-13T14:33:38.016+02:00", "highlightTitle": ""}