{"organizations": [], "uuid": "cd541a22a7f03a061d4c65127412899d7c1b18dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940930-GettyImages-684190892-1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/democrats-want-proof-trump-donated-profits-from-foreign-governments.html", "country": "US", "domain_rank": 767, "title": "Democrats want proof Trump donated profits from foreign governments", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.238, "site_type": "news", "published": "2018-01-11T18:59:00.000+02:00", "replies_count": 0, "uuid": "cd541a22a7f03a061d4c65127412899d7c1b18dc"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/11/democrats-want-proof-trump-donated-profits-from-foreign-governments.html", "ord_in_thread": 0, "title": "Democrats want proof Trump donated profits from foreign governments", "locations": [], "entities": {"persons": [{"name": "elijah cummi", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trey gowdy", "sentiment": "none"}, {"name": "sheri dillon", "sentiment": "none"}, {"name": "gowdy", "sentiment": "none"}, {"name": "joe crowley", "sentiment": "none"}, {"name": "adam schiff", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "government reform committee", "sentiment": "negative"}, {"name": "united states treasury", "sentiment": "none"}, {"name": "house intelligence committee", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "trump organization", "sentiment": "none"}, {"name": "house democratic caucus", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Getty Images House Oversight and Government Reform Committee ranking member Rep. Elijah Cummings (D-MD) speaks during a news conference with House Intelligence Committee ranking member Rep. Adam Schiff (D-CA) (L) and House Democratic Caucus chairman Rep. Joe Crowley (D-NY) at the U.S. Capitol May 17, 2017 in Washington, DC. \nOne year ago, as Donald Trump prepared to take office, Trump attorney Sheri Dillon announced that he would \"voluntarily donate all profits from foreign government payments made to his hotel to the United States Treasury.\" \nNow House Democrats are saying: \"Show me the money.\" They want proof that Trump's company followed through on its pledge. \n\"We respectfully request that you issue a subpoena to the Trump Organization to produce ... the specific sources and amounts of all foreign government payments, the manner in which these amounts were calculated, and documents demonstrating the manner in which they were donated to the Treasury,\" Democratic members of the House Oversight and Government Reform Committee wrote in a letter Thursday to committee Chairman Trey Gowdy, R-S.C. \nIf Gowdy refuses to issue the subpoena, they want to hold a committee vote on the matter, effectively forcing their GOP counterparts to cast a vote not to hold Trump accountable. \nA representative for Trump Hotels said the figures won't be available until late February. \nThe letter is the latest step in a yearlong effort to resolve concerns that the Trump family's sprawling business empire will benefit financially from the office of the presidency. Throughout that time, ethics experts have sounded the alarm about foreign governments using payments to Trump's companies to curry favor with his administration. This could violate a clause of the Constitution that prohibits the president from accepting personal \"emoluments\" from foreign governments. \nDillon aimed to ease those fears at a January 2017 press conference, nine days before Trump took the oath of office. Trump would move the assets of the Trump Organization to a trust to be managed by his sons Donald Jr. and Eric Trump along with executive Allen Weisselberg, Dillon said. She added that Trump would donate foreign government payments from \"his hotel\" to the Treasury, without specifying which Trump hotels would do so. \nOn Thursday, the committee Democrats wrote that they received a \"insultingly incomplete\" eight-page pamphlet on May 11, 2017, responding to requests for documents related to the Treasury donations. The pamphlet \"made clear that the Trump Organization would not attempt to identify all foreign government emoluments\" they say are barred by the U.S. Constitution. \nLater in May, NBC News reported on this pamphlet , saying the Trump Organization \"suggests that it is up to foreign governments, not Trump hotels, to determine whether they self-report their business.\" \nThe lack of documentation of donations to the Treasury comes as Trump's Washington, D.C., hotel — which is just down the street from the White House — has reportedly become a hot spot for foreign diplomats. The Saudi Arabian government and others have reportedly hosted events at the venue. \nTrump's Washington hotel had turned an unexpected profit for the year 2017, The Washington Post reported in August. \n\"Our fiscal year ended on December 31, 2017. As typical with businesses finalizing their annual financial reporting, we expect to have information available towards the end of February 2018,\" said a representative for Trump Hotels. \nIt is unclear if Gowdy, typically a defender of Trump, will accept the Democrats' request. When he took over the panel's chairmanship, he identified emoluments as an issue that may not fall under the committee's jurisdiction, according to The Washington Post . \nA spokeswoman for Gowdy did not immediately respond to CNBC's request to comment. \nArticle 1 Section 9 of the Constitution says : \"No Title of Nobility shall be granted by the United States: And no Person holding any Office of Profit or Trust under them, shall, without the Consent of the Congress, accept of any present, Emolument, Office, or Title, of any kind whatever, from any King, Prince or foreign State. \nIn December, a federal judge dismissed a lawsuit that had accused Trump of violating the Constitution by accepting foreign payments through his hotels and other businesses. The judge said the plaintiffs, including the watchdog group Citizens for Responsibility and Ethics in Washington, did not have legal standing to bring the suit.", "external_links": [], "published": "2018-01-11T18:59:00.000+02:00", "crawled": "2018-01-11T19:00:14.028+02:00", "highlightTitle": ""}