{"organizations": [], "uuid": "04046b79c79cd2beb49b1c4513ecf66045e55211", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-line-corporation-announces-summary-of-consolidated-financial-results-for-the-fiscal-year-ended-december-31-2017.html", "country": "US", "domain_rank": 767, "title": "LINE Corporation Announces Summary of Consolidated Financial Results for the Fiscal Year Ended December 31, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:14:00.000+02:00", "replies_count": 0, "uuid": "04046b79c79cd2beb49b1c4513ecf66045e55211"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-line-corporation-announces-summary-of-consolidated-financial-results-for-the-fiscal-year-ended-december-31-2017.html", "ord_in_thread": 0, "title": "LINE Corporation Announces Summary of Consolidated Financial Results for the Fiscal Year Ended December 31, 2017", "locations": [], "entities": {"persons": [{"name": "kokan ki", "sentiment": "none"}, {"name": "takeshi idezawa", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "line corporation announces summary of consolidated financial results", "sentiment": "negative"}, {"name": "tokyo stock exchange", "sentiment": "none"}, {"name": "line corporation", "sentiment": "none"}, {"name": "international accounting standards board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Prepared in Accordance with the International Financial Reporting Standards (“IFRS”) as issued by the International Accounting Standards Board (“IASB”)\nTOKYO--(BUSINESS WIRE)-- LINE Corporation (NYSE:LN) (TOKYO:3938) announces the summary of its consolidated financial results for the fiscal year ended December 31, 2017.\nThis is an English translation of the original Japanese-language document. Should there be any inconsistency between the translation and the original Japanese text, the latter shall prevail. All references to the “Company,” “we,” “us” or “our” shall mean LINE Corporation and, unless the context otherwise requires, its consolidated subsidiaries.\nCompany name: LINE Corporation (Stock Code: 3938) (the “Company”)\nStock exchange on which the shares are listed: Tokyo Stock Exchange URL: http://linecorp.com/\nRepresentative: Takeshi Idezawa, Chief Executive Officer Contact: Kokan Ki, Executive Officer and Head of Finance and Accounting Telephone: +81-3-4316-2050 Scheduled date of annual general meeting of shareholders: March 29, 2018 Payment date of dividends: – Filing date of annual securities report: March 30, 2018 Supplemental materials prepared on financial results: Yes Financial results conference scheduled: Yes (for institutional investors and analysts) (Yen amounts are rounded to the nearest million, unless otherwise noted.)\n1. Consolidated financial results for the fiscal year ended December 31, 2017 (from January 1, 2017 to December 31, 2017)\n(1) Consolidated operating results (Percentages indicate year-on-year changes.) Revenues Profit from operating\nactivities\nProfit before income\ntaxes\nProfit for the year Fiscal year ended Millions of yen\n% Millions of yen % Millions of yen % Millions of yen % December 31, 2017 167,147 18.8 25,078 26.0 18,145 0.9 8,210 15.6 December 31, 2016 140,704 16.9 19,897 915.1 17,990 － 7,104 －\nProfit attributable to the\nshareholders of the\nCompany\nComprehensive income\nfor the year\nBasic earnings\nper share Diluted earnings\nper share Fiscal year ended Millions of yen % Millions of yen % Yen Yen December 31, 2017 8,078 19.4 11,743 100.7 36.56 34.01 December 31, 2016 6,763 － 5,852 － 34.84 31.48 Return on equity attributable to\nthe shareholders of the Company Ratio of profit before tax\nto total assets Ratio of operating profit\nto revenue Fiscal year ended % % % December 31, 2017 4.7 6.5 15.0 December 31, 2016 7.6 9.5 14.1 (Reference) Share of profit (loss) of associates accounted for using the equity method:\nFiscal year ended December 31, 2017 (6,321) million yen Fiscal year ended December 31, 2016 (833) million yen\n(2) Consolidated financial position\nTotal assets Total equity Equity attributable\nto the shareholders\nof the Company\nRatio of equity\nattributable to the\nshareholders of the\nCompany to total\nassets\nEquity attributable\nto the shareholders\nof the Company\nper share\nAs of Millions of yen Millions of yen Millions of yen % Yen December 31, 2017 303,439 189,977 185,075 61.0 779.30 December 31, 2016 256,089 161,023 160,834 62.8 738.53 (3) Consolidated cash flows\nCash flows from\noperating activities\nCash flows from\ninvesting activities\nCash flows from\nfinancing activities\nCash and cash\nequivalents at the end\nof the year\nFiscal year ended Millions of yen Millions of yen Millions of yen Millions of yen December 31, 2017 10,965 (34,230) 11,439 123,606 December 31, 2016 28,753 (34,086) 106,628 134,698 2. Cash dividends\nAnnual dividends per share Total amount of\ncash dividends\n(annual) Payout ratio\n(consolidated) Dividend on\nequity attributable to the\nshareholders of\nthe Company ratio\n(consolidated)\nFirst\nquarter-end Second\nquarter-end\nThird\nquarter-end\nFiscal\nyear-end\nTotal Yen Yen Yen Yen Yen Millions of yen % % For the year ended\nDecember 31, 2016 – 0.00 – 0.00 0.00 – 0.0 0.0 For the year ended\nDecember 31, 2017\n– 0.00 – 0.00 0.00 – 0.0 0.0 For the year ending December 31, 2018 (Forecast) – – – – – – 3. Consolidated earnings forecasts for 2018 (from January 1, 2018 to December 31, 2018)\nAmid rapid international and domestic changes, there is a level of uncertainty within the mobile applications market for smartphones and other mobile devices, the main business of the Company and its subsidiaries (collectively, the “Group”). As the state of this market significantly impacts the Group’s financial results, it is difficult to formulate a precise earnings forecast. Furthermore, as the Company’s shares are listed on the New York Stock Exchange as well as the Tokyo Stock Exchange, we are also carefully considering risks relating to U.S. securities regulations. Accordingly, an announcement concerning earnings forecasts is not made at this time.\nNotes\n(1) Changes in significant subsidiaries during the fiscal year ended December 31, 2017 (changes in specified subsidiaries resulting in change in scope of consolidation): None\n(2) Changes in accounting policies and estimates a. Changes in accounting policies due to revisions in accounting standards under IFRS: None b. Changes in accounting policies due to other reasons: None c. Changes in accounting estimates: None (3) Number of shares issued and outstanding (common stock) a. Total number of common shares issued and outstanding at the end of the fiscal year (including treasury shares) As of December 31, 2017 238,496,810 shares As of December 31, 2016 217,775,500 shares b. Number of treasury shares at the end of the fiscal year As of December 31, 2017 1,007,710 shares As of December 31, 2016 – shares c. Average number of common shares outstanding during the fiscal year\nFor the fiscal year ended December 31, 2017 220,945,548 shares For the fiscal year ended December 31, 2016 150,693,608 shares Note: As of December 31, 2015, the Company had issued 174,992,000 class A shares. However, through an amendment to its articles of incorporation effective as of March 31, 2016, the Company terminated its dual class structure and converted all class A shares into common shares. The average number of class A shares outstanding during the fiscal year ended December 31, 2016 was 43,390,387. The combined average number of common shares and class A shares outstanding for the fiscal year ended December 31, 2016 was 194,083,995.\n(Reference) Separate financial results for the fiscal year ended December 31, 2017 (from January 1, 2017 to December 31, 2017) under Japanese GAAP\n(Yen amounts are rounded down to the nearest million, unless otherwise noted.)\n(1) Separate operating results (Percentages indicate year-on-year changes.) Revenues Profit from operating\nactivities\nProfit from ordinary\nactivities\nProfit for the year Fiscal year ended Millions of yen % Millions of yen % Millions of yen % Millions of yen % December 31, 2017 125,929 17.7 13,848 59.9 14,157 44.4 7,733 206.2 December 31, 2016 107,032 21.0 8,661 134.4 9,806 182.4 2,525 － Basic earnings\nper share Diluted earnings\nper share Fiscal year ended Yen Yen December 31, 2017 35.00 32.56 December 31, 2016 13.01 11.75 (2) Separate financial position\nTotal assets Net assets Equity ratio Net assets\nper share As of Millions of yen Millions of yen % Yen December 31, 2017 265,517 185,332 67.7 756.39 December 31, 2016 237,786 164,229 61.6 672.78 (Reference) Equity:\nFiscal year ended December 31, 2017 179,633 million yen Fiscal year ended December 31, 2016 146,515 million yen Reasons for variance between separate financial results for the fiscal years ended December 31, 2017 and 2016\nRevenues, profit from operating activities, profit from ordinary activities, and profit for the year ended December 31, 2017 increased significantly as a result of the significant growth in “performance ads” such as Timeline Ads and LINE News Ads provided through the LINE advertising platform, the performance-based advertising platform we operate.\n* Information regarding the audit procedures\nThis summary financial results report is not subject to the audit procedures in accordance with the Financial Instruments and Exchange Act.\n* Cautionary statement with respect to forward-looking statements, and other information\nThis document contains forward-looking statements with respect to the current plans, estimates, strategies and beliefs of the Company. Forward-looking statements include, but are not limited to, those statements using words such as “anticipate,” “believe,” “continue,” “expect,” “estimate,” “intend,” “project” and similar expressions and future or conditional verbs such as “will,” “would,” “should,” “could,” “might,” “can,” “may,” or similar expressions generally intended to identify forward-looking statements. These forward-looking statements are based on information currently available to the Company, speak only as of the date hereof and are based on the Company’s current plans and expectations and are subject to a number of known and unknown uncertainties and risks, many of which are beyond the Company’s control. As a consequence, current plans, anticipated actions and future financial position and results of operations may differ significantly from those expressed in any forward-looking statements in the document. You are cautioned not to unduly rely on such forward-looking statements when evaluating the information presented and the Company does not intend to update any of these forward-looking statements. Risks and uncertainties that might affect the Company include, but are not limited to:\ni. its ability to attract and retain users and increase the level of engagement of its users; ii. its ability to improve user monetization; iii. its ability to successfully enter new markets and manage its business expansion; iv. its ability to compete in the global social network services market; v. its ability to develop or acquire new products and services, improve its existing products and services and increase the value of its products and services in a timely and cost-effective manner; vi. its ability to maintain good relationships with platform partners and attract new platform partners; vii. its ability to attract advertisers to the LINE platform and increase the amount that advertisers spend with LINE; viii. its expectations regarding its user growth rate and the usage of its mobile applications; ix. its ability to increase revenues and its revenue growth rate; x. its ability to timely and effectively scale and adapt its existing technology and network infrastructure; xi. its ability to successfully acquire and integrate companies and assets; xii. its future business development, results of operations and financial condition; xiii. the regulatory environment in which it operates; xiv. fluctuations in currency exchange rates and changes in the proportion of its revenues and expenses denominated in foreign currencies; and xv. changes in business or macroeconomic conditions.\nIndex\n1. Overview of operating results and others\n2. Basic approach to the selection of accounting standards\n3. Consolidated financial statements - unaudited\n1. Overview of operating results and others\n(1) Overview of operating results for the fiscal year\nIn the fiscal year ended December 31, 2017 (from January 1, 2017 to December 31, 2017), despite continuing geopolitical risk related to North Korea and the Middle East, there were no exceptional monetary policy surprises in various countries, and the global economy remained stable. In addition, exports in Thailand and Taiwan, countries with which the Company has close relationships, were robust, and both countries continued to record positive GDP growth. Meanwhile, the Japanese economy showed signs of recovery in exports in industries such as the IT industry, firm improvement in employment rates and personal income levels, while personal spending showed moderate improvement.\nAmid such circumstances, in the internet industry in which the Group is engaged, the total number of mobile phone shipments in Japan is forecast to be 37.4 million for the period from April 2017 to March 2018, an increase of 2.5% year on year. During the same period, the ratio of smartphones to the total number of mobile phone shipments in Japan is forecast to reach 84.8%, an increase of 2.2 percentage points year on year. Although the overall number of mobile phone shipments has hit a ceiling, there was an increase in users switching from feature phones to smartphones and an increase in the number of SIM-free smartphones. Current estimates suggest that the number of smartphone contracts in Japan will exceed 100 million by FY 2018, and the mobile internet market is expected to continue to grow on the back of this expansion. (Source: MM Research Institute, Overview of domestic mobile phone shipments for FY 2017).\nIn this business environment, the Group actively moved forward with business development focused on the LINE business and portal segment. As of December 31, 2017, MAUs* in our four key countries (Japan, Taiwan, Thailand and Indonesia) had reached 167.5 million, a year-on-year increase of 0.3%.\n* Monthly Active Users (“MAUs”) in a given month refers to the number of user accounts that (i) accessed the LINE messaging application or any LINE Games through mobile devices; (ii) sent messages through the LINE messaging application from personal computers; or (iii) sent messages through any other LINE application from mobile devices, in each case at least once during that month.\nRevenues\nThe Group’s revenues from continuing operations from its major services in the fiscal years ended December 31, 2016 and 2017, are as follows:\n(In millions of yen)\nFor the fiscal year\nended December 31,\n2016 2017 LINE business and portal segment Communication and content Communication (1) 29,290 30,225 Content (2) 44,784 40,144 Others (3) 11,923 20,241 Sub-total 85,997 90,610 Advertising LINE advertising (4) 44,521 66,104 Portal advertising 10,186 10,433 Sub-total 54,707 76,537 Total 140,704 167,147 (1) Revenues from communication increased mainly due to the steady growth of Creators’ Themes, as well as an increase in the number of new stickers available due to a shortening of the time needed for stickers to pass the review process and enhancement of products by popular creators of Creators’ stickers. (2) Revenues from content decreased mainly due to a decrease in revenues generated by the LINE Games business as a result of fewer new title releases, although we are steadily promoting existing services such as LINE Manga, LINE Fortune and LINE MUSIC. (3) Revenues from others saw the expansion of LINE Friends service outlets overseas, primarily in Asia, as well as a steady growth of LINE Mobile, which was launched in September 2016. Furthermore, LINE Pay posted significant growth, particularly in Taiwan. (4) In LINE advertising, in addition to substantial growth of “performance ads” (Timeline and LINE NEWS etc.), “messenger ads” (LINE@) also grew, contributing to an increase in revenues.\nProfit from operating activities\nProfit from operating activities consists of revenues and other operating income reduced by operating expenses. In the fiscal year ended December 31, 2017, other operating income included 10,444 million yen in gain on transfer of business resulting from the restructuring of our camera application business. With respect to operating expenses, while partially offset by a decrease in share-based payment expenses, employee compensation expenses increased due mainly to headcount growth in accordance with our business expansion. Marketing expenses increased due mainly to the active running of TV commercials for LINE Mobile and cloud AI platform “Clova”. Authentication and other service expenses increased due mainly to additional network costs for LINE Mobile to serve an increasing number of users. Depreciation expenses of furniture and fixtures which were newly purchased increased due mainly to the relocation of our headquarter offices. And other operating expenses increased due mainly to rent payments for the new headquarter offices and cost of goods sold for Clova and LINE Friends. Accordingly, the Group recorded operating expenses of 154,080 million yen, a year-on-year increase of 21.6%.\nAs a result, for the fiscal year ended December 31, 2017, the Group recorded a profit from operating activities of 25,078 million yen, a year-on-year increase of 26.0%.\nProfit for the year from continuing operations\nThe Group recorded profit before tax from continuing operations of 18,145 million yen in the fiscal year ended December 31, 2017, a 0.9% increase year on year. The main factors of increase were an increase in profit from operating activities and an increase in other non-operating income due to the revaluation of conversion right and redemption right of preferred stock. The main factors of decrease were an increase in share of loss of associates and joint ventures mainly related to the Group’s interest in Snow Corporation, an increase in loss on foreign currency transactions, net, and an increase in other non-operating expenses due to the impairment loss for available-for-sale financial assets. On an after-tax basis, profit for the year from continuing operations was 8,223 million yen in the fiscal year ended December 31, 2017, a decrease of 9.5% year on year. The effective tax rate for the fiscal year ended December 31, 2017 of 54.7% differed from the Japanese statutory tax rate of 31.7% for the year ended December 31, 2017. The effective income tax rate of 54.7% was primarily due to pre-tax losses recorded by some subsidiaries on a standalone basis and recognition of share of loss on associates and joint ventures for which no deferred tax assets were recognized as the related tax benefits could not be recognized. The effective tax rate for the fiscal year ended December 31, 2016 was 49.5%. The effective tax rate of the fiscal year ended December 31, 2017 increased to 54.7% from the effective tax rate of the fiscal year ended December 31, 2016 of 49.5% due mainly to an increase in the share of loss of associates and joint ventures.\nProfit for the year\nLoss for the year from discontinued operations related to the MixRadio business, which existed in the fiscal year ended December 31, 2016, decreased. Therefore, after subtracting the loss for the year from discontinued operations, profit for the year was 8,210 million yen in the fiscal year ended December 31, 2017, an increase of 15.6% year on year. Profit attributable to the shareholders of the Company was 8,078 million yen in the fiscal year ended December 31, 2017, an increase of 19.4% year on year.\n(2) Overview of financial position for the fiscal year\nRegarding the financial position of the Group as of December 31, 2017, total assets of the Group increased by 47,350 million yen compared to the end of the fiscal year ended December 31, 2016 to 303,439 million yen. The main factors of increase were a 14,725 million yen increase in trade and other receivables due to an increase in revenues, a 13,367 million yen increase in goodwill resulting from acquisition of subsidiaries, and a 12,132 million yen increase in investments in associates and joint ventures mainly due to the acquisition of additional shares of Snow Corporation, an associate of the Group, in exchange for the camera application business, while the main factor of decrease was a 11,092 million yen decrease in cash and cash equivalents.\nTotal liabilities increased by 18,396 million yen to 113,462 million yen as of December 31, 2017. The main factors of increase were a 7,278 million yen increase in trade and other payables due to increased costs associated with the expansion of businesses and a 6,689 million yen increase in advances received mainly due to an increase in unused LINE Points.\nTotal shareholders’ equity increased by 28,954 million yen to 189,977 million yen as of December 31, 2017. The main factors of increase were a 14,513 million yen increase in share capital, recognition of 8,078 million yen of profit attributable to the shareholders of the Company in the fiscal year ended December 31, 2017, and a 2,352 million yen increase in share premium mainly due to the exercise of stock options.\n(3) Overview of cash flow position for the fiscal year\nThe balance of cash and cash equivalents (hereinafter, “cash”) as of December 31, 2017 decreased by 11,092 million yen from the end of the fiscal year ended December 31, 2016 to 123,606 million yen.\nThe respective cash flow positions are as follows.\nCash flows from operating activities\nNet cash provided by operating activities was 10,965 million yen in the fiscal year ended December 31, 2017, compared to net cash provided by operating activities of 28,753 million yen in the fiscal year ended December 31, 2016. The cash inflows, and related adjustments for non-cash items and changes in working capital, in the fiscal year ended December 31, 2017 are primarily related to recognition of profit before tax from continuing operations of 18,145 million yen, recognition of depreciation and amortization expenses of 7,149 million yen, recognition of share of loss of associates and joint ventures of 6,321 million yen, an increase of 6,338 million yen in advances received, and an increase of 6,215 million yen in trade and other payables. The cash outflows, and related adjustments for non-cash items and changes in working capital, in the fiscal year ended December 31, 2017 are primarily related to recognition of gain on loss of control of subsidiaries and business transfer of 10,444 million yen, an increase of 13,539 million yen in trade and other receivables, and income taxes paid of 12,421 million yen.\nCash flows from investing activities\nNet cash used in investing activities was 34,230 million yen in the fiscal year ended December 31, 2017, compared to net cash used in investing activities of 34,086 million yen in the fiscal year ended December 31, 2016. Factors affecting the cash flows in the fiscal year ended December 31, 2017 are primarily related to acquisition of property and equipment and intangible assets of 12,622 million yen, acquisition of subsidiaries and businesses, net of cash acquired of 11,887 million yen, and investments in debt instruments of 6,433 million yen.\nCash flows from financing activities\nNet cash provided by financing activities was 11,439 million yen in the fiscal year ended December 31, 2017, compared to net cash provided by financing activities of 106,628 million yen in the fiscal year ended December 31, 2016. The cash inflows in the fiscal year ended December 31, 2017 are primarily related to 11,489 million yen in exercise of stock options.\n(4) Forecasts for the next quarter\nThe Group’s revenues for the first quarter of FY 2018 (January 1, 2018 to March 31, 2018), driven by the steady growth of revenues from advertising services, are expected to be higher compared to the corresponding period of 2017. Specifically, in LINE advertising, in addition to revenues from LINE Official Accounts, revenues from “messenger ads” following the steady growth of LINE@ accounts both in domestic and overseas markets as well as revenues from “performance ads” following the enhancement of the LINE advertising platform are expected to contribute to revenue growth. With respect to content distribution, the Group expects to continue to generate steady revenues, mainly because the Group plans to appropriately update existing titles as well as the titles launched at the end of FY 2017 and to implement marketing activities. At the same time, the Group expects to continue to generate steady revenues in communication from activities such as the “New Year’s gift stickers” and other seasonal events.\nIn the first quarter of FY 2018, operating expenses are expected to increase following our active investments in Clova, LINE Pay service and other new business opportunities.\n2. Basic approach to the selection of accounting standards\nThe Group has adopted International Financial Reporting Standards (“IFRS”) to increase the international comparability of its financial information and to improve the convenience in capital markets.\n3. Consolidated Financial Statements - Unaudited\n(1) Consolidated Statement of Financial Position - Unaudited\n(In millions of yen) December 31,\n2016\nDecember 31,\n2017\nAssets Current assets Cash and cash equivalents 134,698 123,606 Trade and other receivables 28,167 42,892 Other financial assets, current 6,952 13,258 Inventories 961 3,455 Other current assets 3,929 7,438 Total current assets 174,707 190,649 Non-current assets Property and equipment 9,029 15,125 Goodwill 3,400 16,767 Other intangible assets 1,851 6,486 Investments in associates and joint ventures 12,712 24,844 Other financial assets, non-current 35,715 32,084 Deferred tax assets 18,385 16,492 Other non-current assets 290 992 Total non-current assets 81,382 112,790 Total assets 256,089 303,439 Liabilities Current liabilities Trade and other payables 21,532 28,810 Other financial liabilities, current 24,497 28,003 Accrued expenses 9,049 12,087 Income tax payables 5,699 2,365 Advances received 11,286 17,975 Deferred revenue 9,739 9,246 Provisions, current 964 991 Other current liabilities 3,670 1,940 Total current liabilities 86,436 101,417 Non-current liabilities Other financial liabilities, non-current – 602 Deferred tax liabilities 1,161 1,573 Provisions, non-current 1,120 3,060 Post-employment benefits 6,204 6,162 Other non-current liabilities 145 648 Total non-current liabilities 8,630 12,045 Total liabilities 95,066 113,462 Shareholders' equity Share capital 77,856 92,369 Share premium 91,208 93,560 Treasury shares – (4,000 ) Accumulated deficit (12,381 ) (4, 294 ) Accumulated other comprehensive income 4,151 7,440 Equity attributable to the shareholders of the Company 160,834 185,075 Non-controlling interests 189 4,902 Total shareholders' equity 161,023 189,977 Total liabilities and shareholders' equity 256,089 303,439\n(2) Consolidated Statement of Profit or Loss - Unaudited\n(In millions of yen) 2016 2017 Revenues and other operating income: Revenues 140,704 167,147 Other operating income 5,892 12,011 Total revenues and other operating income 146,596 179,158 Operating expenses: Payment processing and licensing expenses (29,781 ) (29,589 ) Employee compensation expenses (39,445 ) (42,469 ) Marketing expenses (11,833 ) (15,477 ) Infrastructure and communication expenses (7,770 ) (9,087 ) Authentication and other service expenses (14,394 ) (24,906 ) Depreciation and amortization expenses (5,100 ) (7,149 ) Other operating expenses (18,376 ) (25,403 ) Total operating expenses (126,699 ) (154,080 ) Profit from operating activities 19,897 25,078 Finance income 87 257 Finance costs (65 ) (26 ) Share of loss of associates and joint ventures (833 ) (6,321 ) Loss on foreign currency transactions, net (43 ) (818 ) Other non-operating income 9 1,963 Other non-operating expenses (1,062 ) (1,988 ) Profit before tax from continuing operations 17,990 18,145 Income tax expenses (8,904 ) (9,922 ) Profit for the year from continuing operations 9,086 8,223 Loss from discontinued operations, net of tax (1,982 ) (13 ) Profit for the year 7,104 8, 210 Attributable to: The shareholders of the Company 6,763 8,078 Non-controlling interests 341 132 (In yen) Earnings per share Basic profit for the year attributable to the shareholders of the Company 34.84 36.56 Diluted profit for the year attributable to the shareholders of the Company 31.48 34.01 Earnings per share from continuing operations Basic profit from continuing operations attributable to the shareholders of the Company 45.05 36.62 Diluted profit from continuing operations attributable to the shareholders of the Company 40.70 34.06 Earnings per share from discontinued operations Basic loss from discontinued operations attributable to the shareholders of the Company (10.21 ) (0.06 ) Diluted loss from discontinued operations attributable to the shareholders of the Company (9.22 ) (0.05 )\n(3) Consolidated Statement of Comprehensive Income - Unaudited\n(In millions of yen) 2016 2017 Profit for the year 7,104 8,210 Other comprehensive income Items that will not be reclassified to profit or loss Remeasurement of defined benefit plans 674 2,093 Income tax relating to items that will not be reclassified to profit or loss (209 ) (488 ) Items that may be reclassified to profit or loss Available-for-sale financial assets: Net changes in fair value (2,019 ) (3,339 ) Reclassification to profit or loss 293 1,090 Exchange differences on translation of foreign operations: (Loss)/gain arising during the year (299\n)\n3,751 Reclassification to profit or loss 50 (13 ) Proportionate share of other comprehensive income of associates and joint ventures 3 106 Income tax relating to items that may be reclassified subsequently to profit or loss 255 333 Total other comprehensive income for the year, net of tax (1,252 ) 3,533 Total comprehensive income for the year, net of tax 5,852 11,743 Attributable to: The shareholders of the Company 5,546 11,365 Non-controlling interests 306 378\n(4) Consolidated Statement of Change in Equity - Unaudited\n(In millions of yen) Equity attributable to the shareholders of the Company Accumulated other comprehensive income Share\ncapital Share\npremium Accumulated\ndeficit Foreign\ncurrency\ntranslation\nreserve Available-for-\nsale reserve Defined\nbenefit plan\nreserve Total Non-\ncontrolling\ninterests Total\nshareholders’\nequity Balance at January 1, 2016 12,596 18,983 (19,204 ) 240 6,917 (1,789 ) 17,743 (210 ) 17,533 Comprehensive income/(loss) Profit for the year – – 6,763 – – – 6,763 341 7,104 Other comprehensive income – – – (414 ) (1,268 ) 465 (1,217 ) (35 ) (1,252 ) Total comprehensive income/ (loss) for the year – – 6,763 (414 ) (1,268 ) 465 5,546 306 5,852 Recognition of share-based payments – 9,520 – – – – 9,520 – 9,520 Forfeiture of stock options – (60 ) 60 – – – – – – Exercise of stock options 1,836 (88 ) – – – – 1,748 – 1,748 Acquisition of subsidiary – – – – – – – 93 93 Initial public offering 63,424 62,853 – – – – 126,277 – 126,277 Other – – – – – – – 0 0 Balance at December 31, 2016 77,856 91,208 (12,381 ) (174 ) 5,649 (1,324 ) 160,834 189 161,023\nEquity attributable to the shareholders of the Company\n(In millions of yen)\nAccumulated other comprehensive income Share\ncapital Share\npremium Treasury shares Accumulated\ndeficit Foreign\ncurrency\ntranslation\nreserve Available-for-\nsale reserve Defined\nbenefit plan\nreserve Total Non-\ncontrolling\ninterests Total\nshareholders'\nequity Balance at January 1, 2017 77,856 91,208 – (12,381 ) (174 ) 5,649 (1,324 ) 160,834 189 161,023 Comprehensive income/(loss) Profit for the year – – – 8,078 – – – 8,078 132 8,210 Other comprehensive income – – – – 3,328 (1,721 ) 1,680 3,287 246 3,533 Total comprehensive income/(loss) for the year – – – 8,078 3,328 (1,721 ) 1,680 11,365 378 11,743 Recognition of share-based payments – 1,882 – – – – – 1,882 – 1,882 Forfeiture of stock options – (9 ) – 9 – – – – – – Exercise of stock options 12,513 (1,088 ) – – – – – 11,425 – 11,425 Acquisition of subsidiary – – – – – – – – 4,168 4,168 Acquisition of non-controlling interests – (423 ) – – 4 – (2 ) (421 ) 167 (254 ) Issuance of common shares and acquisition of treasury shares under Employee Stock Ownership Plan 2,000 1,990 (4,000 ) – – – – (10 ) – (10 ) Balance at December 31, 2017 92,369 93,560 (4,000 ) (4,294 ) 3,158 3,928 354 185,075 4,902 189,977\n(5) Consolidated Statements of Cash Flows - Unaudited\n(In millions of yen)\n2016\n2017\nCash flows from operating activities Profit before tax from continuing operations\n17,990\n18,145\nLoss before tax from discontinued operations (2,726 ) (19 ) Profit before tax 15,264 18,126 Adjustments for: Depreciation and amortization expenses 5,100 7,149 Finance income (87 ) (257 ) Finance costs 65 26 Dividend income – (69 ) Share-based compensation expenses 9,519 2,686 Gain on loss of control of subsidiaries and business transfer (1,731 ) (10,444 ) Loss/(gain) on financial assets at fair value through profit or loss 656 (1,026 ) Gain on disposal of property and equipment and intangible assets (2,345 ) – Impairment loss of other intangible assets – 214 Impairment loss of available-for-sale financial assets 293 1,761 Gain on sales of available-for-sale financial assets – (751 ) Share of loss of associates and joint ventures 833 6,321 Loss/(gain) on foreign currency transactions, net 514 (182 ) Changes in: Trade and other receivables (756 ) (13,539 ) Inventories 407 (2,366 ) Trade and other payables (1,620 ) 6,215 Accrued expenses 2,229 2,642 Advances received 1,762 6,338 Deferred revenue 1,931 (700 ) Provisions 297 187 Post-employment benefits 1,339 2,054 Other current assets (1,780 ) (2,860 ) Other current liabilities 4,148 1,311 Others 205 232 Cash provided by operating activities 36,243 23,068 Interest received 86 252 Interest paid (58 ) (32 ) Dividend received 4 98 Income taxes paid (7,522 ) (12,421 ) Net cash provided by operating activities 28,753 10,965 Cash flows from investing activities Purchases of time deposits (10,790 ) (1,282 ) Proceeds from maturities of time deposits 377 401 Purchase of equity investments (1,245 ) (4,880 ) Proceeds from sales of equity investments – 1,672 Purchase of debt instruments (7,642 ) (6,433 ) Proceeds from redemption of debt instruments – 5,209 Acquisition of property and equipment and intangible assets (6,352 ) (12,622 ) Proceeds from disposal of property and equipment and intangible assets 5,124 472 Investments in associates and joint ventures (9,333 ) (5,566 ) Payments of office security deposits (2,533 ) (1,112 ) Refund of office security deposits 168 1,581 Return of the office security deposits received under sublease agreement (8 ) (19 ) Payments of the guarantee deposits for the Japanese Payment Services Act (1,815 ) (530 ) Return of the guarantee deposits for the Japanese Payment Services Act 900 3,340 Acquisition of subsidiaries and businesses, net of cash acquired (423 ) (11,887 ) Cash disposed on loss of control of subsidiary and business transfer (485 ) (581 ) Payments for loan receivables (2 ) (2,165 ) Collection of loan receivables – 124 Others (27 ) 48 Net cash used in investing activities (34,086 ) (34,230 ) Cash flows from financing activities Repayment of short-term borrowings, net (20,752 ) (107 ) Payments for redemption of bonds (510 ) – Payments of common shares issuance costs (706 ) (30 ) Proceeds from initial public offering 126,848 – Proceeds from exercise of stock options 1,750 11,489 Payments for acquisition of interest in subsidiaries from non-controlling interests – (255 ) Proceed from the payment received from non-controlling interests 0 343 Others (2 ) (1 ) Net cash provided by financing activities 106,628 11,439 Net increase/(decrease) in cash and cash equivalents 101,295 (11,826 ) Cash and cash equivalents at the beginning of the year 33,652 134,698 Effect of exchange rate fluctuations on cash and cash equivalents (249 ) 734 Cash and cash equivalents at the end of the year 134,698 123,606\n(6) Notes to going-concern assumptions - Unaudited\nNot applicable.\n(7) Notes to Consolidated Financial Statements – Unaudited\nSegment Information\nThe operating segment of the Group is a component for which discrete financial information is available and whose operating results are regularly reviewed by the Group’s chief operating decision maker in making decisions about allocation of resources and assessment of performance. The chief operating decision maker has been identified as the Company’s board of directors. No operating segments have been aggregated to form the reportable segments.\nDescription of Reportable Segment\nThe Group has a single reportable segment:\nLINE business and portal segment –\nThe Group mainly operates a cross-platform messenger application, LINE, and provides communication and content and advertising services. Communication and content are primarily provided to end users via various communication and content. Communication mainly includes LINE Stickers. Content includes LINE Games and LINE Play. Others within communication and contents include LINE Friends. Advertising services are provided via LINE advertising, livedoor blog and NAVER Matome. LINE advertising includes LINE Official Accounts, Sponsored Stickers, LINE Points Ads and “performance ads” on Timeline and LINE NEWS. Earnings per Share\nThe profit or loss for the period and the weighted average number of shares used in the calculation of earnings per share are as follows:\n(In millions of yen, except number of shares) 2016 2017 Profit for the year attributable to the shareholders of the Company from continuing operations 8,745 8,091 Loss for the year attributable to the shareholders of the Company from discontinued operations (1,982 ) (13 ) Total profit for the year attributable to the shareholders of the Company for basic and diluted earnings per share 6,763 8,078 Weighted average number of total common shares and class A shares 194,083,995 221,405,391 Weighted average number of total treasury shares – (459,843 ) Weighted average number of total common shares and class A shares for basic earnings per share (1) 194,083,995 220,945,548 Effect of dilution: Stock options 20,790,013 16,559,790 Employee Stock Ownership Plan (J-ESOP) – 47,369 Weighted average number of total common shares and class A shares adjusted for the effect of dilution (1) 214,874,008 237,552,706 (1) Through the amendment of its articles of incorporation on June 15, 2015, the Company introduced a dual class structure of common shares and class A shares and converted all outstanding common shares into class A shares; therefore, the weighted average number of shares for the year ended December 31, 2016 includes the average number of common shares and class A shares for the year ended December 31, 2016. Additionally, through an amendment of its article of incorporation effective as of March 31, 2016, the Company terminated its dual class structure of commons shares and class A shares and converted all class A shares into common shares.\nIn calculating diluted earnings per share, share options outstanding and other potential shares are taken into account where their impact is dilutive. Potential common shares used in the calculation of diluted earnings per share for the year ended December 31, 2016 included options representing 22,911,500 shares which were outstanding as of December 31, 2016 as they had a dilutive impact.\nPotential common shares used in the calculation of diluted earnings per share for the year ended December 31, 2017, included options representing 5,828,302 shares which were outstanding as of December 31, 2017 as their impact was dilutive.\nThe Company has granted 23,860 of stock options (warrants) to directors and executive officers of the Company and a director of a subsidiary with the grant date of July 18, 2017. Upon exercise of those stock options, common shares of 2,386,000 will be issued.\nMoreover, the Company has issued 1,007,810 of new common shares through a third-party allotment in accordance with the introduction of the Employee Stock Ownership Plan (J-ESOP) on July 18, 2017.\nSignificant Subsequent events\nThrough the meeting of the board of directors on January 31, 2018, the Group resolved to enter into an agreement with a third party in regard to the Group’s mobile communication service. This agreement includes a plan to allot new shares of LINE Mobile Corporation to the third party. Upon completion of the third-party allotment, the Group’s ownership of LINE Mobile Corporation will decrease from 100.0% to 49.0%, resulting in LINE Mobile Corporation to be accounted for as an associate under the equity method.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005664/en/\nLINE Corporation\nMichiko Setsu, +81-3 4316 2104\nGlobal PR\ndl_gpr@linecorp.com\nSource: LINE Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Flinecorp.com%2F&esheet=51751416&newsitemid=20180131005664&lan=en-US&anchor=http%3A%2F%2Flinecorp.com%2F&index=1&md5=c037c82a61469e5a2da2bb14349ed7e5", "http://linecorp.com/", "http://www.businesswire.com/news/home/20180131005664/en/"], "published": "2018-01-31T15:14:00.000+02:00", "crawled": "2018-01-31T17:16:05.016+02:00", "highlightTitle": ""}