{"organizations": [], "uuid": "94cfcb500fafa669460361363e73be372451062a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/haitians-us-canada.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/12/trump-shithole-countries-tps-haiti-el-salvador-immigration/", "country": "US", "domain_rank": 1196, "title": "Commentary: Trump Shithole: His Bizarre Decision on TPS | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.027, "site_type": "news", "published": "2018-01-12T02:00:00.000+02:00", "replies_count": 0, "uuid": "94cfcb500fafa669460361363e73be372451062a"}, "author": "Donald Kerwin", "url": "http://fortune.com/2018/01/12/trump-shithole-countries-tps-haiti-el-salvador-immigration/", "ord_in_thread": 0, "title": "Commentary: Trump Shithole: His Bizarre Decision on TPS | Fortune", "locations": [], "entities": {"persons": [{"name": "trump shithole", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "donald kerwin january", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "haiti", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}, {"name": "honduras", "sentiment": "none"}], "organizations": [{"name": "center for migration studies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Donald Kerwin January 12, 2018 \nPresident Donald Trump reportedly became enraged during a bipartisan immigration meeting Thursday, after lawmakers proposed allowing long-term recipients of Temporary Protected Status (TPS) to retain legal status in return for ending the diversity visa lottery program. The president wondered aloud why the U.S. would want “all these people from shithole countries.” \nTrump’s anger is confusing. He has vowed to crack down on illegal immigration, yet revoking TPS is changing the legal status of hundreds of thousands of immigrants currently living in the U.S. from legal to undocumented. And going forward, this will create a host of other problems for both these immigrants and the U.S. as a whole. \nMy organization, the Center for Migration Studies, exhaustively analyzed TPS beneficiaries from the three countries—El Salvador, Haiti, and Honduras—that represent 94% of the roughly 320,000 program beneficiaries. TPS was recently revoked for El Salvador and Haiti, and a decision on Honduras will be made later this year. Our study found that TPS recipients from these countries work at far higher rates (81–88%) than the overall U.S. labor force (63%). In addition, they have strong family and equitable ties to the U.S., including 273,000 U.S. citizen children. They have lived in the U.S. for long periods of time—21 years on average for Salvadorans—and roughly 30% have mortgages. \nIf deported, many would be subject to extortion and violence, and their U.S. citizen children could easily be recruited by gangs in their new countries. The three aforementioned countries have repeatedly insisted that they cannot ensure the safe and productive return of their nationals. If former TPS recipients decide to risk arrest and remain in the U.S., they will continue to work, but in more (and worse) jobs , which will disadvantage both them and U.S.-born workers. And their deportation will certainly hurt the industries in which they are concentrated, including construction, restaurants and food service, landscaping, and child care. With an unemployment rate of 4.1% , sufficient numbers of U.S. citizens will not be available to fill these positions. \nIn terminating TPS for El Salvador, Haiti, and Nicaragua, the Department of Homeland Security (DHS) has claimed that it cannot consider current conditions in these countries, but only the conditions that led to the initial TPS designation. This position is at odds with the law: The TPS statute does not limit decisions on extensions to the conditions in place at the time of the initial designation. Furthermore, the position is contrary to precedent. As recently as May of 2017, then-DHS Secretary John Kelly announced a six-month extension of Haitians’ TPS status following a “ careful review of the current conditions in Haiti .” Previous administrations have made the same determination. Moreover, there’s nothing to stop the administration, if it wished, from designating these national groups for TPS anew based on current conditions in their countries. \nA far better course, however, would be akin to the one proposed yesterday by lawmakers to the president. A path to permanent residence for productive, long-term TPS recipients would receive broad support from the U.S. public. By contrast, most Americans will not agree that legal status should turn on their president’s prejudices. And they will see through his promise to restore the “rule of law” in immigration through proposals that illegalize the status of people from countries he reviles. \nDonald Kerwin is the executive director of the Center for Migration Studies. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-12T02:00:00.000+02:00", "crawled": "2018-01-15T15:45:25.012+02:00", "highlightTitle": ""}