{"organizations": [], "uuid": "97a64fe89b172e49e7eb0cee43dcfae76af07114", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/12/104894234-GettyImages-684377042.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/stress-test-your-portfolio-to-make-sure-its-ready-for-a-market-downturn.html", "country": "US", "domain_rank": 767, "title": "Stress-test your portfolio to make sure it's ready for a market downturn", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.218, "site_type": "news", "published": "2018-01-30T17:34:00.000+02:00", "replies_count": 0, "uuid": "97a64fe89b172e49e7eb0cee43dcfae76af07114"}, "author": "Kelli B. Grant", "url": "https://www.cnbc.com/2018/01/30/stress-test-your-portfolio-to-make-sure-its-ready-for-a-market-downturn.html", "ord_in_thread": 0, "title": "Stress-test your portfolio to make sure it's ready for a market downturn", "locations": [], "entities": {"persons": [{"name": "lynn ballou", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "lafayette", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "ep wealth advisors", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you haven't stress-tested your portfolio recently, now might be the time.\nU.S. stocks fell sharply for the second day in a row Tuesday, in the year's first major sell-off. Monday was the worst session of the year for both the Dow and the S&P 500 . It's a notable reversal given the market's strong start to 2018.\nUp markets represent a prime opportunity to stress-test your portfolio against future volatility and downturns, certified financial planner Lynn Ballou, regional director at EP Wealth Advisors in Lafayette, California, told CNBC.com earlier this year. Make sure you're comfortable with all the investments you're holding.\nshow chapters Market pause 'natural' after long rally: JP Morgan strategist 7 Hours Ago | 04:00 \"We get lulled into complacency in times like this … then we kick ourselves if there's a market correction,\" she said.\nAs part of that analysis, examine allocations to make sure they're in line with your time horizon and risk tolerance. That favorable stock performance may mean your portfolio has gotten more aggressive over time.\n\"If you're talking about a short-term goal of four years or less, I don't care how appetizing the market looks. Cash is your best friend.\" -Douglas Boneparth, Bone Fide Wealth \"Ask, 'Has my portfolio become unbalanced, because my equities have completely taken over the garden?'\" Ballou said. \"It's time to do some pruning and take some money off the table.\"\nGauging your tolerance for risk is especially key. For more risk-averse investors, forgoing some gains now might be preferable to the pain and panic of a market downturn, certified financial planner Mark LaSpisa, president of Vermillion Financial Advisors in South Barrington, Illinois, told CNBC.com earlier this year.\n\"The real question is, for the person that hasn't experienced a correction in the past nine years, how are they going to react?\" he said.\nDepending on your goals, strategically shifting your investments could help reduce risk and still meet return your objectives, LaSpisa said. For example, he said, an investor who only needs 3 percent to 5 percent to meet retirement income obligations — and has already benefitted from several years of above-average returns — may not need to chase double-digit returns or stay in riskier investments to achieve that goal.\n\"Why are we reaching for that return if it's not needed?\" LaSpisa said.\nKeep goal timelines in mind, too, both for current investments and money you're thinking of investing, Douglas Boneparth, a certified financial planner and president of Bone Fide Wealth in New York, told CNBC.com earlier this year.\n\"Long-term goals, the ones that are seven, 10 years plus … it's easier to remain unemotional because you have time on your side,\" he said.\nshow chapters Market moving towards bearish extreme on bonds, says investor 9 Hours Ago | 03:19 Those long-term investors can benefit from dollar-cost averaging, he said, continuing regular contributions into their retirement accounts, 529 plans and the like. But it's a different story for goals you need to fund on a short timeline.\n\"If you're talking about a short-term goal of four years or less, I don't care how appetizing the market looks,\" Boneparth said. \"Cash is your best friend.\"\nMore from Personal Finance:\nEquifax free credit protection offer ends Jan. 31\nUnused vacation costs workers $66 billion in lost benefits\nHere's what fans will likely spend on the Super Bowl", "external_links": [], "published": "2018-01-30T17:34:00.000+02:00", "crawled": "2018-01-30T17:33:48.017+02:00", "highlightTitle": ""}