{"organizations": [], "uuid": "62b39668eda6c53545a5b4b3c016f483087aca53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/japan-economy-data/japan-to-revamp-gdp-data-to-reflect-sharing-economy-idUSL4N1P721V", "country": "US", "domain_rank": 408, "title": "Japan to revamp GDP data to reflect sharing economy", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:21:00.000+02:00", "replies_count": 0, "uuid": "62b39668eda6c53545a5b4b3c016f483087aca53"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/japan-economy-data/japan-to-revamp-gdp-data-to-reflect-sharing-economy-idUSL4N1P721V", "ord_in_thread": 0, "title": "Japan to revamp GDP data to reflect sharing economy", "locations": [], "entities": {"persons": [{"name": "shuji hasegawa", "sentiment": "none"}, {"name": "shinzo abe", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cabinet office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO, Jan 15 (Reuters) - Japan is set to revamp how it measures gross domestic product data in the coming years by better incorporating new consumption trends such as the sharing economy and changing quality of education and medical services, officials said on Monday.\nThe move comes in response to criticism the country’s economic data fails to grasp actual economic activity as analysts see the components lagging behind changing trends of private consumption that accounts for some 60 percent of the economy.\n“With the economic structure rapidly changing, how to measure the sharing economy and digital economy in particular has become an urgent issue in Japan as well as other countries,” Shuji Hasegawa, executive research fellow at the Cabinet Office, told reporters on Monday.\nThrough a series of reforms on economic indicators, the government also aims to address long-standing concerns about data accuracy, volatility, sampling and collection methods.\nPrime Minister Shinzo Abe has ordered his government to revamp major economic indicators that could affect key policy decisions such as a sales tax hike. Abe twice delayed a planned tax rise to 10 percent from 8 percent after the first hike to 8 percent from 5 percent in 2014 dealt a blow to consumption.\nThe sharing economy involves businesses that use the Internet to form a dispersed network of people that provide services such as car rides or temporary lodging. It includes short-term home rental service Airbnb and U.S. ride-hailing company Uber.\nThe size of Japan’s sharing economy was estimated at 1.2 trillion yen ($11 billion) as of 2016, with a potential market size seen at 2.6 trillion yen, according to InfoCom Research, a private think tank.\nNo deadline has been set for inclusion of the sharing economy in GDP data, the officials said, adding that they aimed to determine some of the quality and prices of other sectors such as education and medical services in the fiscal year ending March 2021.\nIt is uncertain whether the overhaul may boost the size of the economy as measured by nominal economic output, the officials said. However, inclusion of the sharing economy could push up the value of nominal GDP, they added.\nIn 2016 the Cabinet Office, which issues GDP and some other indicators, adopted a new method to reflect research and development (R&D) in capital expenditure, which has boosted nominal economic output.\n$1 = 110.8600 yen Reporting by Tetsushi Kajimoto; Editing by Jacqueline Wong\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T16:21:00.000+02:00", "crawled": "2018-01-16T13:17:06.022+02:00", "highlightTitle": ""}