{"organizations": [], "uuid": "d37190784757fa11ad550b53de3a04e8015306df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/09/104456371-GettyImages-546409134.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/25/its-profit-over-politics-at-chinas-state-run-rail-giant-chairman-says.html", "country": "US", "domain_rank": 767, "title": "It's profit over politics at China's state-run rail giant, chairman says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-26T06:58:00.000+02:00", "replies_count": 0, "uuid": "d37190784757fa11ad550b53de3a04e8015306df"}, "author": "Huileng Tan", "url": "https://www.cnbc.com/2018/01/25/its-profit-over-politics-at-chinas-state-run-rail-giant-chairman-says.html", "ord_in_thread": 0, "title": "It's profit over politics at China's state-run rail giant, chairman says", "locations": [], "entities": {"persons": [{"name": "liu", "sentiment": "none"}, {"name": "liu hualong", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "cnbc trump", "sentiment": "none"}, {"name": "crrc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Making money — not following political directives — is the top priority for Chinese state-owned train giant CRRC , its chairman claimed this week.\n\"As an enterprise, CRRC seeks profits. So when we look at the orders, we first assess our interest, the other things come later,\" Liu Hualong, the company's chair, said in Mandarin.\nConsiderations about Chinese soft power and global political influence \"do exist in our agenda, but our ultimate goal is always the benefit when adjusting ourselves to the market,\" Liu told CNBC annual meeting in Davos, Switzerland.\nLiu was specifically addressing concerns about China's Belt and Road Initiative, which aims to connect Asia, Europe, the Middle East and Africa with a vast logistics and transport network, using roads, ports, railway tracks, pipelines, airports, transnational electric grids and even fiber optic lines. The plan, which continues to evolve, at one point included 65 countries, which together accounted for one-third of global GDP and 60 percent of the world's population, or 4.5 billion people, according to Oxford Economics.\nIt's all part of China's push to increase global clout — building modern infrastructure can attract more investment and trade along the route. The policy could also boost the domestic economy with demand abroad, and might soak up some of the overcapacity in China's industrial sector.\nThat's all led to some skepticism about how Chinese companies are choosing their projects.\n\"In the construction of the Belt and Road, we haven't really seen any projects where new markets are being explored entirely for political interest. What we value is the profit and sending our products outside China, as well as serving our users,\" Liu said.\nCRRC is the world's largets supplier of rail equipment. It has been aggressively expanding its business into foreign markets including the U.S.\nOn Trump CRRC, which was formed by a merger between two state-owned enterprises — China CNR and CSR — has been rapidly expanding its presence stateside .\nEven though President Donald Trump approved controversial tariffs on imported washing machines and solar cells on Monday, Liu said he didn't think the U.S. leader was being anti-China.\n\"I feel that he is seeking a new balance. The past balance had its significance in its time and background, with people acknowledging the meaning of that. After he took over, he needed to figure out how to achieve the new balance,\" said Liu.\n—CNBC's Saheli Roy Choudhury contributed to this story.", "external_links": [], "published": "2018-01-26T06:58:00.000+02:00", "crawled": "2018-01-26T06:57:54.012+02:00", "highlightTitle": ""}