{"organizations": [], "uuid": "b9af3c5a72b6a0085e36090eade9cf01d9995f43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-cox-enterprises-promotes-sonji-jacobs-to-assistant-vice-president-of-corporate-communications.html", "country": "US", "domain_rank": 767, "title": "Cox Enterprises Promotes Sonji Jacobs to Assistant Vice President of Corporate Communications", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:30:00.000+02:00", "replies_count": 0, "uuid": "b9af3c5a72b6a0085e36090eade9cf01d9995f43"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-cox-enterprises-promotes-sonji-jacobs-to-assistant-vice-president-of-corporate-communications.html", "ord_in_thread": 0, "title": "Cox Enterprises Promotes Sonji Jacobs to Assistant Vice President of Corporate Communications", "locations": [], "entities": {"persons": [{"name": "sonji jacobs", "sentiment": "negative"}, {"name": "alex taylor", "sentiment": "none"}, {"name": "sonji", "sentiment": "none"}, {"name": "jacobs", "sentiment": "none"}, {"name": "bob jimenez", "sentiment": "none"}], "locations": [], "organizations": [{"name": "corporate communications atlanta", "sentiment": "negative"}, {"name": "cox enterprises", "sentiment": "negative"}, {"name": "corporate communications", "sentiment": "none"}, {"name": "corporate communications and administrative services", "sentiment": "none"}, {"name": "jacobs", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 11, 2018 /PRNewswire/ -- Cox Enterprises today announced the promotion of Sonji Jacobs to Assistant Vice President of Corporate Communications.\nJacobs will oversee all internal and external communications efforts, which includes leading executive communications for Cox's new President and Chief Executive Officer Alex Taylor; developing strategic business communications and messaging around the company's values, priorities and initiatives; leading media and press relations; and overseeing the company's robust employee communications program.\n\"Sonji has taken on a vast number of responsibilities over the course of the past four years, overseeing executive communications and leading the company's public affairs efforts,\" said Bob Jimenez, Senior Vice President of Corporate Communications and Administrative Services. \"I am confident that with her deep industry knowledge and understanding of Cox Enterprises' values and priorities, Sonji will thrive in her new role.\"\nOver the past four years, Jacobs has held increasingly expansive roles at Cox. She led communications for former President and Chief Executive Officer John Dyer and his senior team. In her former role as Sr. Director, Corporate Affairs, Jacobs led the company's corporate social responsibility team while also bolstering the company's overall public affairs strategy.\n\"Cox Enterprises is at a key point in our 120-year history — both for the company and our employees,\" said Jacobs. \"As we begin a new era of opportunity and growth, I'm excited about working with our stellar communications team and the company's new leadership to help deliver on our enterprise-wide business goals.\"\nA New York native, Jacobs moved to Atlanta in 2004 to work for Cox as a political reporter for The Atlanta Journal-Constitution. She served as the Director of Communications for the City of Atlanta and Mayor Kasim Reed in his first term. She was named to the Georgia Trend and the Atlanta Business Chronicle's 40 Under 40 lists and is a member of the Leadership Atlanta Class of 2016. She serves on the Board of Directors of Zoo Atlanta and the North Carolina Outward Bound School.\nJacobs earned a bachelor's degree cum laude in history and literature from Harvard University and a master's degree in journalism from Columbia University.\nAbout Cox Enterprises:\nCox Enterprises is a leading communications, media and automotive services company. With revenues exceeding $21 billion and approximately 60,000 employees, the company's major operating subsidiaries include Cox Communications (cable television distribution, high-speed internet access, telephone, home security and automation, commercial telecommunications and advertising solutions); Cox Automotive (automotive-related auctions, financial services, media and software solutions); and Cox Media Group (television and radio stations, digital media, newspapers and advertising sales rep firms).\nThe company's major national brands include Autotrader, Kelley Blue Book and Manheim. Through Cox Automotive, the company's international operations stretch across Asia, Australia, Europe and Latin America. To learn more about Cox's commitment to people, sustainability and our communities, please visit www.CoxCSRReport.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/cox-enterprises-promotes-sonji-jacobs-to-assistant-vice-president-of-corporate-communications-300581396.html\nSOURCE Cox Enterprises", "external_links": ["http://www.prnewswire.com/news-releases/cox-enterprises-promotes-sonji-jacobs-to-assistant-vice-president-of-corporate-communications-300581396.html", "http://www.coxcsrreport.com/"], "published": "2018-01-11T17:30:00.000+02:00", "crawled": "2018-01-11T19:05:01.000+02:00", "highlightTitle": ""}