{"organizations": [], "uuid": "fd1dbec91af02b202a9e4b92245f1c21507f053b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/mpw-revised-logo-2-42.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/blockchain-consent-app-aziz-ansari-womens-march-broadsheet-for-jan-17/", "country": "US", "domain_rank": 1196, "title": "Blockchain Consent, Aziz Ansari, Women's March: Broadsheet | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.547, "site_type": "news", "published": "2018-01-17T10:02:00.000+02:00", "replies_count": 0, "uuid": "fd1dbec91af02b202a9e4b92245f1c21507f053b"}, "author": "Valentina Zarya", "url": "http://fortune.com/2018/01/17/blockchain-consent-app-aziz-ansari-womens-march-broadsheet-for-jan-17/", "ord_in_thread": 0, "title": "Blockchain Consent, Aziz Ansari, Women's March: Broadsheet | Fortune", "locations": [], "entities": {"persons": [{"name": "aziz ansari", "sentiment": "negative"}, {"name": "valentina zarya", "sentiment": "negative"}, {"name": "catherine deneuve", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Valentina Zarya 8:02 AM EST \nGood morning, Broadsheet readers! A Dutch startup wants to app-ify consent, news outlets everywhere weigh in on the Aziz Ansari story, and the organizers of the Women’s March are, well, not so organized. Have a great Wednesday. EVERYONE'S TALKING \n• Swipe right to consent. Last week, a group of French women, among them the storied actress Catherine Deneuve, wrote a letter to proclaim that the #MeToo movement had gone too far. In addition to asserting that the movement had turned into a witch hunt, the authors described the fallout as an overreaction: “Next we’ll have a smartphone app that adults who want to sleep together will have to use to check precisely which sex acts the other does or does not accept!” \nWhile portrayed as a frivolous idea in the letter, a product very similar to the described app actually already exists. A Dutch company called LegalThings, whose primary business is creating digital legal contracts, last week launched beta testing of an app called LegalFling that promises to be “the first blockchain-based app to verify explicit consent before having sex.” \nUsers of LegalFling can state their preferences in a number of categories related to sex—including photography, condom use, and STD testing—then send “Fling requests” to their sexual partners via a messaging app. Accepting such a request means, in theory, contractually agreeing to the preferences stated by the partner. That acceptance is then digitally recorded on the blockchain. \nThe blockchain legal experts I spoke to are skeptical about LegalFling’s validity in U.S courts. Dax Hansen, a partner at Perkins Coie and chair of the firm’s blockchain and digital currency industry group, explains that unless a more traditional contract, complete with offer, acceptance, and considerations, is embedded into the app—and knowingly signed by both users—the interaction isn’t legally binding. \nHowever, Hansen does see record-keeping potential in the technology. “One of the blockchain’s wonderful traits is that it enables people to interact in ways that normally require trust, ” he says. If you’re not yet sure whether you trust the person you’re interacting with, using blockchain can create that level of certainty, as a blockchain entry can’t be easily manipulated, erased, or otherwise tampered with. \nWith so many sexual harassment and assault cases relying on “he said, she said” accounts, a technology that allows for nearly ironclad recordkeeping is, at the very least, worth exploring. \nRead the full version of my story here . ALSO IN THE HEADLINES \n• Deneuve says ‘desolee.’ Speaking of Deneuve, the actress apologized to victims of sexual assault for signing the open letter that condemned the #MeToo movement. “I salute all the victims who may have been offended by this public letter published in Le Mond e. It is to them and them only that I present my apologies,” she said. NPR \n• Divided we march. On the eve of the anniversary of the Women’s March on Washington, a rift is emerging between two groups: Women’s March Inc., which organized the original march and spent much of the year creating more social justice protests, and another activist organization called March On, which planned sister marches and believes that winning elections, particularly in red states, should be the movement’s primary goal. New York Times \n• McKenna goes abroad. Wal-Mart has tapped Judith McKenna, COO of the retailer’s domestic operations, to run its international unit. The new role has served as a stepping stone to the CEO job: both current chief Doug McMillon and his predecessor Mike Duke once held the role. McKenna is currently no. 28 on Fortune ‘s list of Most Powerful Women . Bloomberg \nMOVERS AND SHAKERS: Insight Venture Partners has appointed Anika Agarwal and Rachel Geller as managing directors. BlueVine has named Ana Sirbu its first CFO. Albertsons Companies has promoted Susan Morris to EVP and COO. Mina Pacheco Nazemi has joined Barings Alternative Investments as managing director and head of its Funds & Co-Investments platform.The Institute of Biomedical Science has appointed Alison Geddis as their new president. IN CASE YOU MISSED IT \n• More thoughts on Aziz . The story of one woman’s encounter with comedian Aziz Ansari has sent the internet into think-piece overload. I particularly enjoyed these New York Times and Atlantic pieces about the nebulous notion of consent (wouldn’t it be great if there were an, ahem, app for that?), and this Jezebel piece about how journalism around sexual violence is now considered “general-interest prestige reporting”—leading outlets to jump at the chance to get scoops on alleged abusers. \n• Citigroup closes the gap. Citigroup says it will measure, publish, and take steps to close pay gaps between men and women in three countries, and will do the same for the gap between its white and minority employees in the U.S. The move is the first of its kind by a big U.S. bank and follows a proposal by activist investor Arjuna Capital. Citi says women and people of color currently earn 99 cents for every dollar earned by white male employees. Bloomberg \n• Taking back their time. Three Democratic female lawmakers are boycotting President Trump’s State of the Union address, including Rep. Pramila Jayapal (Wash.), Frederica Wilson (Fla.), and Maxine Waters (Calif.). Instead, the lawmakers will attend a meeting “to talk about our opposition to these racist policies that are being put out of the White House and to make sure we put out our own aggressive vision of what our America looks like as we take it back,” says Jayapal. Fortune \n• Tuning in . On Feb. 2, PBS will begin airing #MeToo, Now What? , a five-part series hosted by author and Women for Women International founder Zainab Salbi. The show will be a mix of reporting and conversations, and aims to take the current sexual harassment discussion “to another level.” ", "external_links": [], "published": "2018-01-17T10:02:00.000+02:00", "crawled": "2018-01-17T19:38:52.019+02:00", "highlightTitle": ""}