{"organizations": [], "uuid": "938a97e1613742681325e1abd417f3bdb0fc8fa3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/lmecopper-stocks-home/column-copper-stocks-battle-resumes-but-the-real-action-is-elsewhere-andy-home-idUSL8N1PP565", "country": "US", "domain_rank": 408, "title": "COLUMN-Copper stocks battle resumes, but the real action is elsewhere: Andy Home", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:18:00.000+02:00", "replies_count": 0, "uuid": "938a97e1613742681325e1abd417f3bdb0fc8fa3"}, "author": "", "url": "https://www.reuters.com/article/lmecopper-stocks-home/column-copper-stocks-battle-resumes-but-the-real-action-is-elsewhere-andy-home-idUSL8N1PP565", "ord_in_thread": 0, "title": "COLUMN-Copper stocks battle resumes, but the real action is elsewhere: Andy Home", "locations": [], "entities": {"persons": [{"name": "andy", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "lme", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "tmsnrt.rs/2EnQu3F SIGNAL FAILURE \nHuman nature being what it is, it’s always tempting to try and explain such a change in visible inventory with reference to some equally dramatic shift in market dynamics. \nBut before you do, check out a chart of headline LME copper stocks over the last two years. The latest injection of physical metal is but the latest addition to a violent zig-zag pattern. \nThe six “arrival events” since December 2016 have all been super-charged inflows of copper to the LME system concentrated into the space of just a few days. \nThis one was little different from the others with most of the tonnage hitting the same Asian and Dutch locations as before. \nAnd the Street was quick to see it for what it was, one broker warning clients after Monday’s first hit of “a planned market play” involving around 100,000 tonnes of warrantings and a tranche of put options. \nBased on the price evidence, the bull seems to have held his ground, albeit with considerable assistance from the U.S. Treasury Secretary. \nAnd if past form holds, expect the bull to do what he has done every time in the past, namely buy all the newly delivered metal, cancel it and ship it, most likely to China. \nThis is how the slugging match works. What goes in ends up going out again, just not in quite as dramatic a style. \nThe outcome, for LME stocks at least, is a degree of volatility that defies fundamental interpretation. \nTry the global stocks picture instead. \nTotal inventory registered with the LME, the CME and the Shanghai Futures Exchange registered a net gain of just 4,179 tonnes last year. \nThat’s a roughly balanced market, if you do think exchange inventory can signal supply-demand dynamics. THE UTAH COPPER MOUNTAIN \nThe real stand-out feature of the global stocks picture last year was not the bull-bear shoving match on the LME, but the 111,463-tonne increase in stocks registered with the CME . \nAt a current 219,860 short tons (199,456 metric tonnes), they are at their highest level since March 2004. \nUntil a couple of years ago CME copper tonnage rarely exceeded the low tens of thousands. The exchange’s domestic warehouse system acted as little more than an overflow for local producers. \nThat changed somewhere around the middle of 2015. The subsequent build has seen none of the “arrival events” experienced in the London market but the uptrend has held steady and continues to run. \nSalt Lake City is where most of this copper is located. Warehouses in the Utah city currently hold 124,668 tons, accounting for 57 percent of the total. \nMost of the rest, 32 percent of it, is sitting in Tucson Arizona. \nWhat started as a storing place for local market surplus seems to have taken on a life of its own with traders directing units there to capitalise on a combination of low rents and potential U.S. infrastructure boost. \nLocating surplus metal in the U.S. Southwest has another key advantage as well. OUT OF REACH? \nBoth Salt Lake City and Tucson are a long way from anywhere in terms of copper consumers. \nAnd they’re even further away from the world’s biggest copper consumer, China. \nThis growing stockpile of copper, according to analysts at Barclays Capital, is economically inaccessible to Chinese buyers. \n“Given current premia, the copper stored in the (CME) US warehouses is unlikely to easily (or cost effectively) reach the Chinese market.” \n“Inventories directly accessible to China are tighter than they appear,” they conclude. (“2018 Copper Outlook”, Jan. 19, 2018). \nThis injects a whole new dynamic to the global copper stocks picture and to the potential future flow of metal. \nQuite evidently, if China finds itself short of refined copper at a future date, it will have to pay a higher price in terms of physical premium to entice this metal to the U.S. West Coast for shipping. \nRight now, there is no sign of China running short of metal. \nIndeed, if the current round of the LME copper stocks battle pans out as before, a whole lot of LME metal, around 100,000 tonnes of it, is probably on its way to China in the not too distant future. \nBut China’s own copper supply chain is facing a significant threat this year in the form of a potentially draconian crackdown on imports of copper scrap. \nIf the new scrap rules are implemented in full, China could find itself needing a bit more refined metal than it expected. And it will find that around a third of global visible stock is stuck in the U.S. desert. \nThe bear-bull slugging match over LME stocks may be entertaining, but the real action is taking place in Utah. Editing by David Evans", "external_links": [], "published": "2018-01-30T18:18:00.000+02:00", "crawled": "2018-01-30T18:37:02.002+02:00", "highlightTitle": ""}