{"organizations": [], "uuid": "d316a5b3308ce91665ab46ddc370f871a113c1f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225532489&w=1200&r=LYNXMPEE0P117", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/congo-protests/in-rare-press-appearance-congos-kabila-denies-repression-idINKBN1FF261", "country": "US", "domain_rank": 408, "title": "In rare press appearance, Congo's Kabila denies repression", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T18:15:00.000+02:00", "replies_count": 0, "uuid": "d316a5b3308ce91665ab46ddc370f871a113c1f0"}, "author": "", "url": "https://in.reuters.com/article/congo-protests/in-rare-press-appearance-congos-kabila-denies-repression-idINKBN1FF261", "ord_in_thread": 0, "title": "In rare press appearance, Congo's Kabila denies repression", "locations": [], "entities": {"persons": [{"name": "kabila", "sentiment": "negative"}, {"name": "joseph kabila", "sentiment": "none"}], "locations": [{"name": "congo", "sentiment": "none"}, {"name": "kinshasa", "sentiment": "none"}], "organizations": [{"name": "catholic church", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KINSHASA (Reuters) - Congolese President Joseph Kabila on Friday rejected charges that his forces had violently broken up pro-democracy protests, using his first press conference in six years to accuse demonstrators of attacking police and arson.\nCongolese security forces have dealt with a spate of protests organised by the Catholic Church since the end of last year by firing tear gas, beating and sometimes shooting at protesters.\nSecurity forces shot dead at least six people and wounded dozens more last Sunday while breaking up a protest of churchgoers. [nL8N1PG0KT]\n“I am not (and) ... will never be against peaceful protests by political parties,” Kabila, wearing a dark suit and tie and sporting what has become his trademark goatee, told journalists in the presidential palace.\n“But (not) if a political demonstration is intended to burn, kill police ... incinerate things.”\nThe suppression of protests, triggered by Kabila’s refusal to step down at the end of his mandate in December 2016, has prompted anger from clergy and civil rights groups and condemnation from Western powers.\nScores of people have been killed in the capital Kinshasa.\nElections meant to replace him have been repeatedly delayed, prompting his opponents to accuse him of scuppering the process in order to cling to power, a charge he has denied.\nUnder a deal mediated by the church between Kabila and his opponents, the president was to step down at the end of last year, paving the way for an election early this year. But he reneged on the deal and elections will not take place until the end of 2018, at the earliest.\nPressed on the election date, Kabila said it was up to the electoral commission to set it.\n“There are no guarantees apart from those provided by the Independent National Electoral Commission (CENI),” he said. “Elections will go ahead.”\nReporting by Amedee Mwarabu; Writing by Tim Cocks; Editing by Richard Balmforth\n ", "external_links": [], "published": "2018-01-26T18:15:00.000+02:00", "crawled": "2018-01-26T18:48:54.002+02:00", "highlightTitle": ""}