{"organizations": [], "uuid": "cd8648adf0e317d773a0b67f7fdd105af17c0d49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-mercury-systems-reports-second-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Mercury Systems Reports Second Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.911, "site_type": "news", "published": "2018-01-24T00:01:00.000+02:00", "replies_count": 0, "uuid": "cd8648adf0e317d773a0b67f7fdd105af17c0d49"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-mercury-systems-reports-second-quarter-results.html", "ord_in_thread": 0, "title": "Mercury Systems Reports Second Quarter Results", "locations": [], "entities": {"persons": [{"name": "mark aslett", "sentiment": "none"}, {"name": "aslett", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "andover", "sentiment": "none"}], "organizations": [{"name": "mercury systems", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Second Quarter Highlights Include:\nRecord revenue increases 20% over prior year\nBook-to-bill ratio of 1.14 yields record bookings and backlog\nRevenue, EPS and adjusted EBITDA exceed consensus estimates\nANDOVER, Mass., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Mercury Systems, Inc. (NASDAQ:MRCY) ( www.mrcy.com ), reported operating results for the second quarter of fiscal 2018, ended December 31, 2017.\nManagement Comments\n“The second quarter of fiscal 2018 was strong and capped a solid first half of the year for Mercury,” said Mark Aslett, Mercury’s President and Chief Executive Officer. “Growth was robust both organically and from the contribution of our acquired businesses, again validating the power of our strategy. Mercury continues to execute well, and we look forward to the pending addition of Themis Computer as the next step in the execution of Mercury’s strategy to continue penetrating the C4I market,” Aslett concluded.\nSecond Quarter Fiscal 2018 Results\nTotal Company second quarter fiscal 2018 revenues were $117.9 million, compared to $98.0 million in the second quarter of fiscal 2017. The second quarter fiscal 2018 results included an aggregate of approximately $13.0 million of revenue attributable to the CES, Delta Microwave and Richland Technologies acquired businesses.\nTotal Company GAAP net income for the second quarter of fiscal 2018 was $9.1 million, or $0.19 per share, compared to $5.2 million, or $0.13 per share, for the second quarter of fiscal 2017. Adjusted earnings per share (“adjusted EPS”) was $0.28 per share for the second quarter of fiscal 2018, compared to $0.30 per share in the second quarter of fiscal 2017.\nSecond quarter fiscal 2018 adjusted EBITDA for the total Company was $26.9 million, compared to $23.0 million for the second quarter of fiscal 2017.\nCash flows from operating activities in the second quarter of fiscal 2018 was a net inflow of $8.8 million, compared to a net inflow of $14.2 million in the second quarter of fiscal 2017. Free cash flow, defined as cash flow from operating activities less capital expenditures, was a net inflow of $4.8 million in the second quarter of fiscal 2018, compared to a net inflow of $6.5 million in the second quarter of fiscal 2017.\nAll per share information is presented on a fully diluted basis.\nBookings and Backlog\nTotal bookings for the second quarter of fiscal 2018 were $134.2 million, yielding a book-to-bill ratio of 1.14 for the quarter.\nMercury’s total backlog at December 31, 2017 was $376.4 million, a $57.6 million increase from a year ago. Of the December 31, 2017 total backlog, $310.4 million represents orders expected to be shipped within the next 12 months.\nBusiness Outlook\nThis section presents our current expectations and estimates, given current visibility, on our business outlook for the current fiscal quarter and fiscal year 2018. It is possible that actual performance will differ materially from the estimates given, either on the upside or on the downside. Investors should consider all of the risks with respect to these estimates, including those listed in the Safe Harbor Statement below and in our periodic filings with the U.S. Securities and Exchange Commission, and make themselves aware of how these risks may impact our actual performance.\nFor the third quarter of fiscal 2018, revenues are forecasted to be in the range of $116.0 million to $120.0 million. GAAP net income for the third quarter is expected to be approximately $7.8 million to $9.0 million, or $0.16 to $0.19 per share, assuming no restructuring, acquisition, or non-recurring financing related expenses in the period, an effective tax rate of approximately 33% and approximately 47.5 million weighted average diluted shares outstanding. Adjusted EBITDA for the third quarter of fiscal 2018 is expected to be in the range of $26.3 million to $28.0 million. Adjusted EPS is expected to be in the range of $0.33 to $0.35 per share.\nFor the full fiscal year 2018, we currently expect revenue of $460.0 million to $468.0 million, and GAAP net income of $38.4 million to $40.4 million, or $0.81 to $0.85 per share, assuming approximately 47.6 million weighted average diluted shares outstanding. Adjusted EBITDA for the full fiscal year is expected to be approximately $106.0 million to $109.0 million, and adjusted EPS for the full fiscal year is expected to be approximately $1.33 to $1.37 per share.\nRecent Highlights\nDecember – Mercury Systems announced that it signed a definitive agreement to acquire Themis Computer (Themis). Based in Fremont, CA, Themis is a leading designer, manufacturer and integrator of commercial, SWaP-optimized rugged servers, computers and storage systems for U.S. and international defense programs. Pursuant to the terms of the agreement, Mercury will acquire Themis for an all cash purchase price of $180 million, subject to net working capital and net debt adjustments. The transaction is currently expected to close during Mercury's fiscal 2018 third quarter ending March 31, 2018.\nDecember – Mercury announced it received a $2.3 million follow-on order from a leading electronics manufacturer for state-of-the-art GPS Selective Availability Anti-Spoofing Modules (SAASM) devices for an undisclosed application. The order was booked in the Company’s fiscal 2018 second quarter and is expected to be shipped over the next several quarters.\nDecember – Mercury announced the start of customer design engagements for its new MISSION-Stor™ ultra-portable secure solid state drive (SSD) with integrated security and performance-enhancing algorithms. Though similar in size and function to a commercial USB flash drive, the Company’s new secure SSD has been precision-engineered to withstand the harshest military operating environments while simultaneously protecting the most sensitive data from adversarial attack.\nNovember – Mercury announced it received a $2.2 million order from a leading defense prime contractor for state-of-the-art radio frequency (RF) modules integrated into a ballistic missile defense radar system. The order was booked in the Company’s fiscal 2018 second quarter.\nNovember – Mercury announced the new SpectrumSeries™ RFM3101 ultra-wideband microwave transceiver. Designed in accordance with OpenVPX™ standards, Mercury’s new product integrates OpenRFM™-compliant receiver and transmitter building blocks with versatile local oscillator (LO) circuitry to deliver exceptional phase noise and high dynamic range performance.\nNovember – Mercury announced it received a follow-on $3.8 million order from a leading defense prime contractor for multi-chip module devices integrated into an advanced airborne electronic warfare system. The order was booked in the Company’s fiscal 2018 second quarter and is expected to be shipped over the next several quarters.\nNovember – Mercury announced the Ensemble® 6000 Series GSC6202 6U OpenVPX™ general purpose graphics processor unit (GPGPU) module with two NVIDIA® Pascal™ or Maxwell™ architecture GPU processors. The module’s immense parallel computing capability is ideal for image processing, artificial intelligence, and computational neural networks in electro-optic/infrared (EO/IR), radar signal processing, and electronic warfare (EW) applications.\nNovember – Mercury announced that its ASURRE-Stor® Self-Encrypting Solid-State Drive (SSD) for Classified Programs was recognized with a top level award by the judges of the annual Military & Aerospace Electronics Innovators Awards program. Mercury Systems was honored with a Platinum award. The ASURRE-Stor SSD device honored with this award features a custom-designed cryptographic engine tailored to the stringent requirements specified in the Commercial Solutions for Classified (CSfC) program.\nNovember – Mercury announced that it shipped the defense industry’s first BuiltSecure™ high density secure memory devices manufactured with double data rate fourth-generation synchronous dynamic random-access memory (DDR4 SDRAM). The Company’s first BuiltSecure DDR4 product embeds 8GB of high-speed DDR4 memory in an ultra-compact 13 by 20 millimeter ball grid array (BGA) package optimized for reliability in harsh military environments.\nNovember – Mercury announced the BuiltSAFE™ GS Multi-Core Renderer for the Xilinx® Zynq® UltraScale+™ MPSoC family. Part of the BuiltSAFE Graphics Suite, the Multi-Core Renderer runs on the multi-core ARM® Cortex® A53 processor inside the MPSoC and is certifiable to DO-178C at the highest design assurance level (DAL-A) as well as the highest Automotive Safety Integrity Level (ASIL D).\nOctober – Mercury announced that its BuiltSAFE™ ROCK-2 avionics subsystem is now available pre-integrated with the Green Hills Software safe and secure INTEGRITY-178 tuMP® (time-variant unified multiprocessing) real-time operating system (RTOS). INTEGRITY-178 tuMP enables the full multi-core capabilities of the ROCK-2 subsystem to be utilized for applications requiring DO-178C certification.\nOctober – Mercury celebrated the grand opening of its Advanced Microelectronics Center (AMC) located in Phoenix, Ariz. Arizona Congressman Ruben Gallego (D), State Senator Catherine Miranda (D) and State Representative Reginald Bolding (D) joined Mercury President and CEO Mark Aslett and Mercury's Board of Directors for a ribbon cutting ceremony, reception and facility tour.\nOctober – Mercury announced it received $4.7 million in orders from a leading defense prime contractor for high performance radio frequency (RF) subsystems integrated into an advanced airborne electronic protection system. The order was booked in the Company's fiscal 2018 first quarter and is expected to be shipped over the next several quarters.\nOctober – Mercury announced it received a $3.2 million follow-on order from a leading defense prime contractor for high-speed, rugged memory devices integrated into an airborne command, control, and intelligence (C2I) computing system. The order was booked in the Company's fiscal 2018 first quarter and is expected to be shipped over the next several quarters.\nOctober – Mercury announced the Ensemble® 6000 Series LDS6527 6U OpenVPX™ single board computer (SBC) with available options for Modified Off-the-Shelf (MOTS) extreme durability configurations and BuiltSECURE™ technology. For deployment at the tactical edge and export to U.S. allies, Mercury's BuiltSECURE technology counters nation-state reverse engineering through world-class systems security engineering expertise.\nOctober – Mercury announced it received a $6.2 million order from a leading defense prime contractor for advanced radio frequency (RF) subsystems for an airborne electronic warfare application. The order was booked in the Company's fiscal 2018 first quarter and is expected to be shipped over the next several quarters.\nOctober – Mercury Systems and Green Hills Software announced the commercial availability of Mercury's BuiltSAFE™ GS OpenGL library for the Intel® Atom® processor E3900 and A3900 series (formerly code-named Apollo Lake), both of which are integrated with the Green Hills safe and secure INTEGRITY-178 tuMP® real-time operating system (RTOS).\nConference Call Information\nMercury will host a conference call and simultaneous webcast on Tuesday, January 23, 2018, at 5:00 p.m. ET to discuss the second quarter fiscal 2018 results and review its financial and business outlook going forward.\nTo join the conference call, dial (877) 303-6977 in the USA and Canada, or (760) 298-5079 in all other countries. Please call five to ten minutes prior to the scheduled start time. The live audio webcast can be accessed from the 'Events and Presentations' page of Mercury's website at www.mrcy.com/investor .\nA replay of the webcast will be available two hours after the call and archived on the same web page for six months.\nUse of Non-GAAP Financial Measures\nIn addition to reporting financial results in accordance with generally accepted accounting principles, or GAAP, the Company provides adjusted EBITDA, adjusted income, adjusted earnings per share “adjusted EPS”, and free cash flow, which are non-GAAP financial measures. Adjusted EBITDA, adjusted income, and adjusted EPS exclude certain non-cash and other specified charges. The Company believes these non-GAAP financial measures are useful to help investors understand its past financial performance and prospects for the future. However, these non-GAAP measures should not be considered in isolation or as a substitute for financial information provided in accordance with GAAP. Management believes these non-GAAP measures assist in providing a more complete understanding of the Company’s underlying operational results and trends, and management uses these measures along with the corresponding GAAP financial measures to manage the Company’s business, to evaluate its performance compared to prior periods and the marketplace, and to establish operational goals. A reconciliation of GAAP to non-GAAP financial results discussed in this press release is contained in the attached exhibits.\nMercury Systems – Innovation That Matters ™\nMercury Systems (NASDAQ:MRCY) is a leading commercial provider of secure sensor and mission processing subsystems. Optimized for customer and mission success, Mercury’s solutions power a wide variety of critical defense and intelligence programs. Headquartered in Andover, Mass., Mercury is pioneering a next-generation defense electronics business model specifically designed to meet the industry’s current and emerging technology needs. To learn more, visit www.mrcy.com .\nForward-Looking Safe Harbor Statement\nThis press release contains certain , as that term is defined in the Private 1995, including those relating to fiscal 2018 business performance and beyond and the Company’s plans for growth and improvement in profitability and cash flow. You can identify these statements by the use of the words “may,” “will,” “could,” “should,” “would,” “plans,” “expects,” “anticipates,” “continue,” “estimate,” “project,” “intend,” “likely,” “forecast,” “probable,” “potential,” and similar expressions. These involve risks and uncertainties that could cause actual results to differ materially from those projected or anticipated. Such risks and uncertainties include, but are not limited to, continued funding of defense programs, the timing and amounts of such funding, general economic and business conditions, including unforeseen weakness in the Company’s markets, effects of any U.S. Federal government shutdown or extended continuing resolution, effects of continued geopolitical unrest and regional conflicts, competition, changes in technology and methods of marketing, delays in completing engineering and manufacturing programs, changes in customer order patterns, changes in product mix, continued success in technological advances and delivering technological innovations, changes in, or in the U.S. Government’s interpretation of, federal export control or procurement rules and regulations, market acceptance of the Company's products, shortages in components, production delays due to performance quality issues with outsourced components, inability to fully realize the expected benefits from acquisitions and restructurings, or delays in realizing such benefits, challenges in integrating acquired businesses and achieving anticipated synergies, changes to cyber-security regulations and requirements, changes in tax rates or tax regulations, changes to generally accepted accounting principles, difficulties in retaining key employees and customers, unanticipated costs under fixed-price service and system integration engagements, and various other factors beyond our control. These risks and uncertainties also include such additional risk factors as are discussed in the Company's filings with the U.S. Securities and Exchange Commission, including its Annual Report on Form 10-K for the fiscal year ended June 30, 2017. The Company cautions readers not to place undue reliance upon any such , which speak only as of the date made. The Company undertakes no any forward-looking statement to reflect events or circumstances after the date on which such statement is made.\nContact:\nGerry Haines, CFO\nMercury Systems, Inc.\n978-967-1990\nMercury Systems, Innovation That Matters, BuiltSAFE and BuiltSECURE are trademarks and ASURRE-Stor and Ensemble are registered trademarks of Mercury Systems, Inc. Other product and company names mentioned may be trademarks and/or registered trademarks of their respective holders.\nMERCURY SYSTEMS, INC. UNAUDITED CONSOLIDATED BALANCE SHEETS (In thousands) December 31, June 30, 2017 2017 Assets Current assets: Cash and cash equivalents $ 32,035 $ 41,637 Accounts receivable, net 87,315 76,341 Unbilled receivables and costs in excess of billings 35,655 37,332 Inventory 105,912 81,071 Prepaid income taxes 15 1,434 Prepaid expenses and other current assets 7,970 8,381 Total current assets 268,902 246,196 Property and equipment, net 51,640 51,643 Goodwill 384,785 380,846 Intangible assets, net 120,672 129,037 Other non-current assets 9,817 8,023 Total assets $ 835,816 $ 815,745 Liabilities and Shareholders’ Equity Current liabilities: Accounts payable $ 37,628 $ 27,485 Accrued expenses 10,427 20,594 Accrued compensation 17,781 18,406 Deferred revenues and customer advances 8,440 6,360 Total current liabilities 74,276 72,845 Deferred income taxes - 4,856 Income taxes payable 855 855 Other non-current liabilities 11,454 11,772 Total liabilities 86,585 90,328 Shareholders’ equity: Common stock 468 463 Additional paid-in capital 581,534 584,795 Retained earnings 166,171 139,085 Accumulated other comprehensive income 1,058 1,074 Total shareholders’ equity 749,231 725,417 Total liabilities and shareholders’ equity $ 835,816 $ 815,745\nMERCURY SYSTEMS, INC. UNAUDITED CONSOLIDATED STATEMENTS OF OPERATIONS\n(In thousands, except per share data) Three Months Ended Six Months Ended December 31, December 31, 2017 2016 2017 2016 Net revenues $ 117,912 $ 98,014 $ 223,981 $ 185,663 Cost of revenues (1) 63,752 50,625 119,147 98,830 Gross margin 54,160 47,389 104,834 86,833 Operating expenses: Selling, general and administrative (1) 21,222 19,320 41,790 36,864 Research and development (1) 15,187 13,156 28,929 25,994 Amortization of intangible assets 5,827 4,888 11,464 9,490 Restructuring and other charges 313 69 408 366 Acquisition costs and other related expenses 723 998 984 1,419 Total operating expenses 43,272 38,431 83,575 74,133 Income from operations 10,888 8,958 21,259 12,700 Interest income 3 10 22 50 Interest expense (107 ) (1,898 ) (110 ) (3,720 ) Other (expense) income, net (316 ) (87 ) (1,131 ) 513 Income before income taxes 10,468 6,983 20,040 9,543 Tax provision (benefit) 1,335 1,779 (7,046 ) 520 Net income $ 9,133 $ 5,204 $ 27,086 $ 9,023 Basic net earnings per share: $ 0.20 $ 0.13 $ 0.58 $ 0.23 Diluted net earnings per share: $ 0.19 $ 0.13 $ 0.57 $ 0.23 Weighted-average shares outstanding: Basic 46,752 39,151 46,701 39,004 Diluted 47,447 39,985 47,538 39,920 (1) Includes stock-based compensation expense, allocated as follows: Cost of revenues $ 47 $ 148 $ 195 $ 223 Selling, general and administrative $ 4,270 $ 3,539 $ 8,246 $ 6,578 Research and development $ 510 $ 406 $ 1,007 $ 924\nMERCURY SYSTEMS, INC. UNAUDITED CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (In thousands) Three Months Ended Six Months Ended December 31, December 31, 2017 2016 2017 2016 Cash flows from operating activities: Net income $ 9,133 $ 5,204 $ 27,086 $ 9,023 Depreciation and amortization 9,602 7,856 18,939 15,176 Other non-cash items, net 4,652 5,870 5,462 7,316 Changes in operating assets and liabilities (14,608 ) (4,692 ) (34,680 ) (6,994 ) Net cash provided by operating activities 8,779 14,238 16,807 24,521 Cash flows from investing activities: Acquisition of businesses, net of cash acquired 201 (38,764 ) (5,798 ) (38,764 ) Purchases of property and equipment (3,964 ) (7,703 ) (7,592 ) (13,753 ) Other investing activities - - (375 ) (111 ) Net cash used in investing activities (3,763 ) (46,467 ) (13,765 ) (52,628 ) Cash flows from financing activities: Proceeds from employee stock plans 2,049 2,653 2,049 2,733 Payments under credit facilities (15,000 ) - (15,000 ) (2,500 ) Borrowings under credit facilities 15,000 - 15,000 - Payments for retirement of common stock (1,361 ) (1,432 ) (14,909 ) (7,560 ) Net cash provided by (used in) financing activities 688 1,221 (12,860 ) (7,327 ) Effect of exchange rate changes on cash and cash equivalents 257 (121 ) 216 (72 ) Net increase (decrease) in cash and cash equivalents 5,961 (31,129 ) (9,602 ) (35,506 ) Cash and cash equivalents at beginning of period 26,074 77,314 41,637 81,691 Cash and cash equivalents at end of period $ 32,035 $ 46,185 $ 32,035 $ 46,185\nUNAUDITED SUPPLEMENTAL INFORMATION\nRECONCILIATION OF GAAP TO NON-GAAP MEASURES\n(In thousands) Adjusted EBITDA, a non-GAAP measure for reporting financial performance, excludes the impact of certain items and, therefore, has not been calculated in accordance with GAAP. Management believes that exclusion of these items assists in providing a more complete understanding of the Company’s underlying results and trends, and management uses these measures along with the corresponding GAAP financial measures to manage the Company’s business, to evaluate its performance compared to prior periods and the marketplace, and to establish operational goals. The adjustments to calculate this non-GAAP financial measure, and the basis for such adjustments, are outlined below:\nInterest income and expense . The Company receives interest income on investments and incurs interest expense on loans, capital leases and other financing arrangements. These amounts may vary from period to period due to changes in cash and debt balances and interest rates driven by general market conditions or other circumstances outside of the normal course of Mercury’s operations.\nIncome taxes . The Company’s GAAP tax expense can fluctuate materially from period to period due to tax adjustments that are not directly related to underlying operating performance or to the current period of operations.\nDepreciation . The Company incurs depreciation expense related to capital assets purchased to support the ongoing operations of the business. These assets are recorded at cost or fair value and are depreciated using the straight-line method over the useful life of the asset. Purchases of such assets may vary significantly from period to period and without any direct correlation to underlying operating performance.\nAmortization of intangible assets. The Company incurs amortization of intangibles related to various acquisitions it has made and license agreements. These intangible assets are valued at the time of acquisition, are amortized over a period of several years after acquisition and generally cannot be changed or influenced by management after acquisition.\nRestructuring and other charges. The Company incurs restructuring and other charges in connection with management’s decisions to undertake certain actions to realign operating expenses through workforce reductions and the closure of certain Company facilities, businesses and product lines. The Company’s adjustments reflected in restructuring and other charges are typically related to acquisitions and organizational redesign programs initiated as part of discrete post-acquisition integration activities. Management believes these items are non-routine and may not be indicative of ongoing operating results.\nImpairment of long-lived assets. The Company incurs impairment charges of long-lived assets based on events that may or may not be within the control of management. Management believes these items are outside the normal operations of the Company's business and are not indicative of ongoing operating results.\nAcquisition and financing costs . The Company incurs transaction costs related to acquisition and potential acquisition opportunities, such as legal, accounting, and other third party advisory fees. Although we may incur such third-party costs and other related charges and adjustments, it is not indicative that any transaction will be consummated. Additionally, the Company incurs unused revolver and bank fees associated with maintaining its credit facilities. The Company also incurs non-cash financing expenses associated with obtaining its credit facilities. Management believes these items are outside the normal operations of the Company’s business and are not indicative of ongoing operating results.\nFair value adjustments from purchase accounting. As a result of applying purchase accounting rules to acquired assets and liabilities, certain fair value adjustments are recorded in the opening balance sheet of acquired companies. These adjustments are then reflected in the Company’s income statements in periods subsequent to the acquisition. In addition, the impact of any changes to originally recorded contingent consideration amounts are reflected in the income statements in the period of the change. Management believes these items are outside the normal operations of the Company and are not indicative of ongoing operating results.\nLitigation and settlement income and expense. The Company periodically receives income and incurs expenses related to pending claims and litigation and associated legal fees and potential case settlements and/or judgments. Although we may incur such costs and other related charges and adjustments, it is not indicative of any particular outcome until the matter is fully resolved. Management believes these items are outside the normal operations of the Company’s business and are not indicative of ongoing operating results. The Company periodically receives warranty claims from customers and makes warranty claims towards its vendors and supply chain. Management believes the expenses and gains associated with these recurring warranty items are within the normal operations and operating cycle of the Company's business. Therefore, management deems no adjustments are necessary unless under extraordinary circumstances.\nStock-based and other non-cash compensation expense. The Company incurs expense related to stock-based compensation included in its GAAP presentation of cost of revenues, selling, general and administrative expense and research and development expense. The Company also incurs non-cash based compensation in the form of pension related expenses. Although stock-based and other non-cash compensation is an expense of the Company and viewed as a form of compensation, these expenses vary in amount from period to period, and are affected by market forces that are difficult to predict and are not within the control of management, such as the market price and volatility of the Company’s shares, risk-free interest rates and the expected term and forfeiture rates of the awards, as well as pension actuarial assumptions. Management believes that exclusion of these expenses allows comparisons of operating results to those of other companies, both public, private or foreign, that disclose non-GAAP financial measures that exclude stock-based compensation and other non-cash compensation.\nMercury uses adjusted EBITDA as an important indicator of the operating performance of its business. Management excludes the above-described items from its internal forecasts and models when establishing internal operating budgets, supplementing the financial results and forecasts reported to the Company’s board of directors, determining the portion of bonus compensation for executive officers and other key employees based on operating performance, evaluating short-term and long-term operating trends in the Company’s operations, and allocating resources to various initiatives and operational requirements. The Company believes that adjusted EBITDA permits a comparative assessment of its operating performance, relative to its performance based on its GAAP results, while isolating the effects of charges that may vary from period to period without any correlation to underlying operating performance. The Company believes that these non-GAAP financial adjustments are useful to investors because they allow investors to evaluate the effectiveness of the methodology and information used by management in its financial and operational decision-making. The Company believes that trends in its adjusted EBITDA are valuable indicators of its operating performance.\nAdjusted EBITDA is a non-GAAP financial measure and should not be considered in isolation or as a substitute for financial information provided in accordance with GAAP. This non-GAAP financial measure may not be computed in the same manner as similarly titled measures used by other companies. The Company expects to continue to incur expenses similar to the adjusted EBITDA financial adjustments described above, and investors should not infer from the Company’s presentation of this non-GAAP financial measure that these costs are unusual, infrequent or non-recurring.\nThe following table reconciles the most directly comparable GAAP financial measure to the non-GAAP financial measure. Three Months Ended Six Months Ended December 31, December 31, 2017 2016 2017 2016 Net income $ 9,133 $ 5,204 $ 27,086 $ 9,023 Interest expense (income), net 104 1,888 88 3,670 Income taxes 1,335 1,779 (7,046 ) 520 Depreciation 3,775 2,968 7,475 5,686 Amortization of intangible assets 5,827 4,888 11,464 9,490 Restructuring and other charges 313 69 408 366 Impairment of long-lived assets - - - - Acquisition and financing costs 1,366 1,114 2,220 1,667 Fair value adjustments from purchase accounting 84 868 593 2,945 Litigation and settlement expense (income), net - 100 - 100 Stock-based and other non-cash compensation expense 4,941 4,093 9,637 7,725 Adjusted EBITDA $ 26,878 $ 22,971 $ 51,925 $ 41,192 Free cash flow, a non-GAAP measure for reporting cash flow, is defined as cash provided by operating activities less capital expenditures and, therefore, has not been calculated in accordance with GAAP. Management believes free cash flow provides investors with an important perspective on cash available for investment and acquisitions after making capital investments required to support ongoing business operations and long-term value creation. The Company believes that trends in its free cash flow are valuable indicators of its operating performance and liquidity.\nFree cash flow is a non-GAAP financial measure and should not be considered in isolation or as a substitute for financial information provided in accordance with GAAP. This non-GAAP financial measure may not be computed in the same manner as similarly titled measures used by other companies. The Company expects to continue to incur expenditures similar to the free cash flow financial adjustment described above, and investors should not infer from the Company’s presentation of this non-GAAP financial measure that these expenditures reflect all of the Company's obligations which require cash.\nThe following table reconciles the most directly comparable GAAP financial measure to the non-GAAP financial measure. Three Months Ended Six Months Ended December 31, December 31, 2017 2016 2017 2016 Cash flows from operations $ 8,779 $ 14,238 $ 16,807 $ 24,521 Capital expenditures (3,964 ) (7,703 ) (7,592 ) (13,753 ) Free cash flow $ 4,815 $ 6,535 $ 9,215 $ 10,768\nUNAUDITED SUPPLEMENTAL INFORMATION\nRECONCILIATION OF GAAP TO NON-GAAP MEASURES\n(In thousands, except per share data) Adjusted income and adjusted earnings per share (\"adjusted EPS\") are non-GAAP measures for reporting financial performance, exclude the impact of certain items and, therefore, have not been calculated in accordance with GAAP. Management believes that exclusion of these items assists in providing a more complete understanding of the Company’s underlying results and trends and allows for comparability with our peer company index and industry. These non-GAAP financial measures may not be computed in the same manner as similarly titled measures used by other companies. The Company uses these measures along with the corresponding GAAP financial measures to manage the Company’s business and to evaluate its performance compared to prior periods and the marketplace. The Company defines adjusted income as income before amortization of intangible assets, restructuring and other charges, impairment of long-lived assets, acquisition and financing costs, fair value adjustments from purchase accounting, litigation and settlement income and expense, and stock-based and other non-cash compensation expense. The impact to income taxes includes the impact to the effective tax rate, current tax provision and deferred tax provision (1). Adjusted EPS expresses adjusted income on a per share basis using weighted average diluted shares outstanding.\nThe following table reconciles the most directly comparable GAAP financial measures to the non-GAAP financial measures. Three Months Ended December 31, 2017 2016 Net income and earnings per share $ 9,133 $ 0.19 $ 5,204 $ 0.13 Amortization of intangible assets 5,827 4,888 Restructuring and other charges 313 69 Impairment of long-lived assets - - Acquisition and financing costs 1,366 1,114 Fair value adjustments from purchase accounting 84 868 Litigation and settlement expense (income), net - 100 Stock-based and other non-cash compensation expense 4,941 4,093 Impact to income taxes (1) (8,615 ) (4,439 ) Adjusted income and adjusted earnings per share $ 13,049 $ 0.28 $ 11,897 $ 0.30 Diluted weighted-average shares outstanding: 47,447 39,985 Six Months Ended December 31, 2017 2016 Net income and earnings per share $ 27,086 $ 0.57 $ 9,023 $ 0.23 Amortization of intangible assets 11,464 9,490 Restructuring and other charges 408 366 Impairment of long-lived assets - - Acquisition and financing costs 2,220 1,667 Fair value adjustments from purchase accounting 593 2,945 Litigation and settlement expense (income), net - 100 Stock-based and other non-cash compensation expense 9,637 7,725 Impact to income taxes (1) (20,566 ) (10,524 ) Adjusted income and adjusted earnings per share $ 30,842 $ 0.65 $ 20,792 $ 0.52 Diluted weighted-average shares outstanding: 47,538 39,920 (1) Impact to income taxes is calculated by recasting income before income taxes to include the add-backs involved in determining adjusted income and recalculating the income tax provision using this adjusted income from operations before income taxes.\nMERCURY SYSTEMS, INC. RECONCILIATION OF FORWARD-LOOKING GUIDANCE RANGE Quarter Ending March 31, 2018 Year Ending June 30, 2018 (In thousands, except per share data) The Company defines adjusted EBITDA as income before interest income and expense, income taxes, depreciation, amortization of intangible assets, restructuring and other charges, impairment of long-lived assets, acquisition and financing costs, fair value adjustments from purchase accounting, litigation and settlement income and expense, and stock-based and other non-cash compensation expense.\nThe following table reconciles the adjusted EBITDA financial measure to its most directly comparable GAAP measures. Three Months Ending Twelve Months Ending March 31, 2018 June 30, 2018 Range Range Low High Low High GAAP expectation -- Earnings per share $ 0.16 $ 0.19 $ 0.81 $ 0.85 GAAP expectation -- Net income $ 7,800 $ 9,000 $ 38,400 $ 40,400 Adjust for: Interest expense (income), net - - 100 100 Income taxes 3,400 3,800 5,700 6,600 Depreciation 4,200 4,200 16,000 16,000 Amortization of intangible assets 5,700 5,700 22,500 22,500 Restructuring and other charges - - 400 400 Impairment of long-lived assets - - - - Acquisition and financing costs 500 600 3,400 3,500 Fair value adjustments from purchase accounting - - 600 600 Litigation and settlement expense (income), net - - - - Stock-based and other non-cash compensation expense 4,700 4,700 18,900 18,900 Adjusted EBITDA expectation $ 26,300 $ 28,000 $ 106,000 $ 109,000\nMERCURY SYSTEMS, INC. RECONCILIATION OF FORWARD-LOOKING GUIDANCE RANGE Quarter Ending March 31, 2018 Year Ending June 30, 2018 (In thousands, except per share data) The Company defines adjusted income as income before amortization of intangible assets, restructuring and other charges, impairment of long-lived assets, acquisition and financing costs, fair value adjustments from purchase accounting, litigation and settlement income and expense, and stock-based and other non-cash compensation expense. The impact to income taxes includes the impact to the effective tax rate, current tax provision and deferred tax provision (1). Adjusted EPS expresses adjusted income on a per share basis using weighted average diluted shares outstanding.\nThe following table reconciles the most directly comparable GAAP financial measures to the non-GAAP financial measures. Three Months Ending March 31, 2018 Range Low High Net income and earnings per share $ 7,800 $ 0.16 $ 9,000 $ 0.19 Amortization of intangible assets 5,700 5,700 Restructuring and other charges - - Impairment of long-lived assets - - Acquisition and financing costs 500 600 Fair value adjustments from purchase accounting - - Litigation and settlement expense (income), net - - Stock-based and other non-cash compensation expense 4,700 4,700 Impact to income taxes (1) (3,200 ) (3,200 ) Adjusted income and adjusted earnings per share $ 15,500 $ 0.33 $ 16,800 $ 0.35 Diluted weighted-average shares outstanding: 47,500 47,500 Twelve Months Ending June 30, 2018 Range Low High Net income and earnings per share $ 38,400 $ 0.81 $ 40,400 $ 0.85 Amortization of intangible assets 22,500 22,500 Restructuring and other charges 400 400 Impairment of long-lived assets - - Acquisition and financing costs 3,400 3,500 Fair value adjustments from purchase accounting 600 600 Litigation and settlement expense (income), net - - Stock-based and other non-cash compensation expense 18,900 18,900 Impact to income taxes (1) (20,900 ) (20,900 ) Adjusted income and adjusted earnings per share $ 63,300 $ 1.33 $ 65,400 $ 1.37 Diluted weighted-average shares outstanding: 47,600 47,600 (1) Impact to income taxes is calculated by recasting income before income taxes to include the add-backs involved in determining adjusted income and recalculating the income tax provision using this adjusted income from operations before income taxes.\nSource:Mercury Systems Inc", "external_links": ["https://www.globenewswire.com/Tracker?data=fViO4OnKsAjBA95wxfh3cj0a9wSvBoP0iVXCtyYWOJKs56f4WKVlCbJjO6OsatOuUpSXFIGrbU8jPWa1i-9QPQ==", "https://www.globenewswire.com/Tracker?data=fViO4OnKsAjBA95wxfh3ctqajDvxepODC2_lxrY8KloUTVP0mj9O3NYxVDKgqoZ-ZQNfEIyRoeyefFSQpQZ3Td892tyyUIzFgi8W791AXWk=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/4194f429-919c-4962-8b1a-2bd93c9d4694"], "published": "2018-01-24T00:01:00.000+02:00", "crawled": "2018-01-24T00:53:27.008+02:00", "highlightTitle": ""}