{"organizations": [], "uuid": "69588eb08bf74d73ac6820608be7246373aa2a0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/14/104166951-RTX2QKP4.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/21/retail-under-trump-more-cash-different-problems.html", "country": "US", "domain_rank": 767, "title": "Retail under Trump: More cash, different problems", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.146, "site_type": "news", "published": "2018-01-21T23:16:00.000+02:00", "replies_count": 0, "uuid": "69588eb08bf74d73ac6820608be7246373aa2a0c"}, "author": "Lauren Hirsch", "url": "https://www.cnbc.com/2018/01/21/retail-under-trump-more-cash-different-problems.html", "ord_in_thread": 0, "title": "Retail under Trump: More cash, different problems", "locations": [], "entities": {"persons": [{"name": "eduardo munoz", "sentiment": "none"}], "locations": [{"name": "teterboro", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "walmart", "sentiment": "none"}, {"name": "et sun", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Tax Cuts and Jobs Act is going to put more cash in the pockets of many retailers, but it's not going to save the industry or its employees.\nLowering the corporate tax rate from 35 percent to 21 percent disproportionately impacts the largely domestic retail industry. The new law also makes the effective cost of new equipment cheaper, which may make it easier to make much-needed investments in new technology. You also can expect more dealmaking.\nFor retailers seeking to reestablish a role in the changing retail landscape, that boost may prove impactful. For for those still struggling to find their place, or, even worse, those leveraged and without a profit, the tax bill may actually hurt.\nWinners and Losers For retailers already ahead, the boon of excess cash falling to their bottom line means an opportunity to further leapfrog ahead of their competition.\nAccording to holiday sales , that means home improvement and furniture retailers. That's good news for companies like Home Depot and Floor & Decor . Giants like Walmart are in a class of their own.\nBut not all retailers will get a windfall from the bill and leveraged, unprofitable companies will fare worst. There is now a limit on how much interest expense on debt can be deducted against income. (There was no limit before.) The amount of operating losses that can be deducted against future income also is also now capped.\nIn other words, leveraged companies will be constrained in how they use debt expenses and losses to lower their tax bills.\n\"It's an additional drag on your ability to right the ship, and it's possible it accelerates the number of bankruptcies,\" said Josh Chernoff, managing director of the retail practice at EY-Parthenon.\nNames impacted include: Neiman Marcus, Sears and Claire's. (It doesn't help that apparel/accessories and department stores saw some of the slowest growth during the holiday season.)\nThe winners could widen gap Extra cash in the hands of retailers means capital to widen the gap with the laggards through investments in technology, pricing, and delivery.\nOff-price retailers like Walmart could invest in lowering prices, squeezing their mid-tier retail competition.\nWalmart and grocer peers Kroger and Albertsons could pour money into automation and technology. Pressure for them to do so is particularly intense, as Amazon's automated grocery store finally launches Monday .\nRestaurants could emulate Dunkin' Brands Grou p 's new concept store , where the chain experiments with new technology such as ordering kiosks and separate areas for mobile order pick-up.\nRetailers can also do transformative deals, adding an e-commerce platform many have trouble building on their own, or a new customer subset to augment sales. In dealmaking, a likely theme will be continued unions of unlikely bedfellows.\nPotential acquirers include grocers like Kroger, which could seek to diversify or further consolidate the grocery industry; Walmart, which has been building its coterie of digitally native brands; Target , which has been struggling to find its place ; Nordstrom , which may need another route if its leveraged buyout falls through ; and sit-down restaurant companies like Dinequity or Bloomin Brands, who may look to buy more on-trend, faster-serve concepts.\nBut retailers may not save themselves The extra cash in most retailers' pockets may be the honey activists need to reenter the retail industry.\n\"A handful of them are going to come calling, 'Hey, if you can't show me that there's a path to daylight, sustained investment that's meaningful, give me my cash back so I can invest it elsewhere,'\" said Aaron Cheris, head of Bain's Americas retail practice.\nActivists have a habit of demanding short term solutions — sale leasebacks, stock buybacks — that get in the way of companies making the investments they need for long-term health.\nFurther, while retail stocks have risen in the wake of tax reform, investors often punish retailers for making strategic changes to reinvent their company. Nordstrom shares fell more than four percent in September when it announced launching stores without inventory .\nMeantime, corporate executives have a history of using excess cash in the form of stock buybacks . Retailers led the charge in buybacks in 2017, including Restoration Hardware, Party City and Express .\n\"It gives retail the opportunity to invest to save itself, but it doesn't mean they're going to do it,\" said Bain's Cheris.\nLayoffs will continue Both the winners and losers are likely to continue layoffs as all retailers rightsize their footprints and invest in technology.\nWhile some retailers have announced bonuses, the beauty of a bonus is that companies don't need to replicate it next year. Meantime, retailers like Walmart who are raising minimum wages are more likely doing so because the labor market is tightening, meaning it's more competitive to fight for the low-salaried workers that retailers generally employ.\nFinally, as retailers invest in technology, the need for employees declines. With the new lower corporate tax rate, savings from reducing payroll costs could jump by at least 20 percent .\n\"They may be investing in process automation, which is good for shareholders, but doesn't add more jobs,\" said EY's Chernoff.", "external_links": [], "published": "2018-01-21T23:16:00.000+02:00", "crawled": "2018-01-21T23:16:35.026+02:00", "highlightTitle": ""}