{"organizations": [], "uuid": "b75dc4e6e9a406a561d5cbebc83a9f816f09ce1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-fda-approves-new-indication-for-gilotrifa-in-egfr-mutation-positive-nsclc.html", "country": "US", "domain_rank": 767, "title": "FDA approves new indication for Gilotrif® in EGFR mutation-positive NSCLC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-16T16:00:00.000+02:00", "replies_count": 0, "uuid": "b75dc4e6e9a406a561d5cbebc83a9f816f09ce1e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-fda-approves-new-indication-for-gilotrifa-in-egfr-mutation-positive-nsclc.html", "ord_in_thread": 0, "title": "FDA approves new indication for Gilotrif® in EGFR mutation-positive NSCLC", "locations": [], "entities": {"persons": [{"name": "boehringer ingelheim", "sentiment": "negative"}, {"name": "gilotrif", "sentiment": "none"}], "locations": [{"name": "ridgefield", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}, {"name": "gilotrif", "sentiment": "none"}], "organizations": [{"name": "egfr", "sentiment": "negative"}, {"name": "fda", "sentiment": "negative"}, {"name": "nsclc", "sentiment": "none"}, {"name": "drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RIDGEFIELD, Conn., Jan. 16, 2018 /PRNewswire/ -- Boehringer Ingelheim today announced that the U.S. Food and Drug Administration (FDA) has approved a supplemental New Drug Application (sNDA) for Gilotrif® (afatinib) for the first-line treatment of patients with metastatic non-small cell lung cancer (NSCLC) whose tumors have non-resistant epidermal growth factor receptor (EGFR) mutations as detected by an FDA-approved test. The new label includes data on three additional EGFR mutations: L861Q, G719X and S768I. The FDA granted Priority Review status to Gilotrif in evaluating this application.\nGilotrif, an oral, once-daily tablet, was previously approved in the U.S. for the first-line treatment of patients with NSCLC whose tumors have EGFR exon 19 deletions or exon 21 L858R mutations. In addition, Gilotrif is approved in the U.S. for patients with squamous cell carcinoma of the lung whose disease has progressed after treatment with platinum-based chemotherapy.\n\"With this expanded indication for Gilotrif, NSCLC patients whose tumors have certain EGFR mutations now have an approved therapy that specifically targets these mutations,\" said Sabine Luik, M.D., senior vice president of Medicine & Regulatory Affairs, Boehringer Ingelheim Pharmaceuticals, Inc. \"This approval is a result of our company's commitment to delivering meaningful treatment advances in areas with high unmet medical need and reflects the tireless efforts of physicians, researchers and patients who participated in our studies.\"\nThe sNDA approval is based on a pooled analysis of three studies from the LUX-Lung clinical trial program (Phase II LUX-Lung 2 study and Phase III studies LUX-Lung 3 and LUX-Lung 6) that examined Gilotrif in NSCLC patients whose tumors have EGFR mutations, including L861Q, G719X or S768I. This analysis showed that Gilotrif was active in these EGFR mutations based on objective response rate, duration of response, disease control, progression-free survival and overall survival.\n\"Compared with other EGFR mutations, L861Q, G719X or S768I substitution mutations are associated with a poorer prognosis and limited treatment options,\" said Edward Kim, M.D., Levine Cancer Institute, Carolinas HealthCare System. \"The approval of Gilotrif as a targeted therapy for these additional non-resistant EGFR mutations significantly alters the treatment strategy for this population.\"\nTo determine if a patient is eligible for Gilotrif, physicians must conduct a test for genetic mutations – also known as biomarker testing – to determine the type of EGFR mutation present.\n\"This approval is more welcome news for our lung cancer community,\" said Laurie Fenton Ambrose, president and CEO of Lung Cancer Alliance. \"These types of advances are helping expand access to treatment options for patients who might benefit from targeted therapies to fight their specific type of lung cancer.\"\nAbout NSCLC\nNon-small cell lung cancer (NSCLC) is the most common form of lung cancer. In some people, genetic mutations lead to the constant activation of the epidermal growth factor receptor (EGFR) protein, which is associated with uncontrolled cell division and the development and progression of NSCLC. Most cases of EGFR mutation-positive NSCLC are attributed to the two most common EGFR mutations (exon 19 deletions or L858R). Approximately 10 percent of NSCLC patients with EGFR mutations have rare or uncommon mutations, and have had limited treatment options available to them.\nWhat is Gilotrif?\nGilotrif is a prescription medicine that is used to treat people with non-small cell lung cancer (NSCLC) that:\nhas certain (non-resistant) abnormal epidermal growth factor receptor (EGFR) gene(s). Your healthcare provider will perform a test to make sure that Gilotrif is right for you. has spread to other parts of the body (metastatic), and has not been previously treated for metastatic lung cancer\nIt is not known if Gilotrif is safe and effective in treating people with lung cancer that has resistant abnormal EGFR genes.\nor\nis used to treat people with squamous cell lung cancer that:\nhas spread to other parts of the body, and has been previously treated with chemotherapy that contains platinum.\nIt is not known if Gilotrif is safe and effective in children.\nIMPORTANT SAFETY INFORMATION ABOUT GILOTRIF\nBefore you take Gilotrif, tell your doctor if you:\nhave kidney or liver problems have lung or breathing problems other than lung cancer have a history of severe dry eye or any other eye problems. Tell your doctor if you wear contact lenses. have heart problems have any other medical conditions are pregnant or plan to become pregnant. Gilotrif can harm your unborn baby. You should not become pregnant while taking Gilotrif. Women who are able to become pregnant should use effective birth control during treatment with Gilotrif and for at least 2 weeks after your last dose of Gilotrif. Talk to your doctor about birth control methods that may be right for you. Tell your doctor right away if you become pregnant or think you are pregnant while taking Gilotrif. are breastfeeding or plan to breastfeed. It is not known if Gilotrif passes into your breast milk. Do not breastfeed while taking Gilotrif and for 2 weeks after your last dose of Gilotrif. Talk to your doctor about the best way to feed your baby if you take Gilotrif.\nTell your doctor about all the medicines you take, including prescription and over-the-counter medicines, vitamins, and herbal supplements. Gilotrif may affect the way other medicines work, and other medicines may affect the way Gilotrif works.\nWhat to avoid while taking Gilotrif\nLimit your time in the sun. Gilotrif can make your skin sensitive to the sun. You could get or have worsening rash or acne. You could get a severe sunburn. Use sunscreen and wear a hat and clothes that cover your skin while you are taking Gilotrif if you have to be in sunlight.\nGilotrif may cause serious side effects, including:\nDiarrhea. Diarrhea is common with Gilotrif and may sometimes be severe. Severe diarrhea can cause loss of body fluid (dehydration) and kidney problems that can sometimes lead to death. During your treatment with Gilotrif, your doctor should prescribe medicines to treat diarrhea. Take this medicine exactly as your doctor tells you to. Tell your doctor if you have diarrhea. Get medical attention right away if your diarrhea does not go away or becomes severe. Skin reactions. Gilotrif can cause redness, rash, and acne. It is important to get treatment for skin reactions as soon as you notice them. Take medicines to help skin reactions exactly as your doctor tells you to. Get medical attention right away if you develop severe skin reactions such as peeling or blistering of the skin, or blisters in your mouth. Lung or breathing problems. Gilotrif may cause inflammation of the lung that may lead to death. Symptoms may be similar to those symptoms from lung cancer. Tell your doctor right away if you have any new or worsening lung problems, or any combination of the following symptoms: trouble breathing or shortness of breath, cough, or fever. Liver problems. Gilotrif can cause liver problems that can sometimes l", "external_links": ["https://twitter.com/boehringerus", "https://www.facebook.com/BoehringerUS", "http://docs.boehringer-ingelheim.com/Prescribing%20Information/PIs/Gilotrif/Gilotrif.pdf?DMW_FORMAT=pdf", "http://docs.boehringer-ingelheim.com/Prescribing%20Information/PIs/Gilotrif/Patient%20Info/gilotrif_patient%20information.pdf?DMW_FORMAT=pdf", "http://www.fda.gov/medwatch", "https://www.boehringer-ingelheim.us/", "http://givingreport.us.boehringer-ingelheim.com/", "http://www.prnewswire.com/news-releases/fda-approves-new-indication-for-gilotrif-in-egfr-mutation-positive-nsclc-300582548.html", "http://www.youtube.com/user/BoehringerUS%20CONTACT:%20Boehringer%20Ingelheim%20Pharmaceuticals,%20Inc.:%20Paul%20Wynn,"], "published": "2018-01-16T16:00:00.000+02:00", "crawled": "2018-01-16T16:26:07.044+02:00", "highlightTitle": ""}