{"organizations": [], "uuid": "59c4d14bbcc61494c961253ac4c8803ea2b68ae1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226758959&w=1200&r=LYNXMPEE0U007", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-economy-autos/uk-car-output-drops-for-first-time-since-2009-investment-slumps-idUKKBN1FK00X", "country": "US", "domain_rank": 408, "title": "UK car output drops for first time since 2009, investment slumps", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T02:11:00.000+02:00", "replies_count": 0, "uuid": "59c4d14bbcc61494c961253ac4c8803ea2b68ae1"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-economy-autos/uk-car-output-drops-for-first-time-since-2009-investment-slumps-idUKKBN1FK00X", "ord_in_thread": 0, "title": "UK car output drops for first time since 2009, investment slumps", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "costas pitas", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 12:11 AM / Updated 4 hours ago UK car output drops for first time since 2009, investment slumps Costas Pitas 4 Min Read \nLONDON (Reuters) - British car production fell last year for the first time since 2009 and investment slumped by a third as uncertainty over Brexit cut domestic demand and companies’ new spending plans, an industry body said on Wednesday. \nProduction was down 3 percent at 1.67 million vehicles, mainly due to a 10 percent reduction in domestic demand, which was also impacted by a lack of government clarity over diesel levies, the Society of Motor Manufacturers and Traders (SMMT) said. \nInvestment fell a third to 1.1 billion pounds and the SMMT said some companies were waiting to see what sort of transitional deal Britain negotiates with the European Union. This will bridge Britain’s exit from the EU in March 2019 while terms of its new relationship with the bloc are finalised. \n“A drop of that magnitude is of concern and it bears out what we know anecdotally which is that people are waiting as long as they can for increased certainty to make those investments,” said SMMT Chief Executive Mike Hawes. \nHawes said output would remain “broadly the same” in 2018 as model changes continue and a long-cherished goal of beating an all-time high production of 1.92 million cars achieved in 1972 by 2020 was “hard to foresee us reaching.” \nAutomakers are hoping London and Brussels agree a deal which will allow Britain to maintain free and unfettered trade with its biggest car export market until at least the end of 2020. \nFour of Britain’s six major carmakers recorded slumps in production last year, including the country’s biggest automaker Jaguar Land Rover (JLR) ( TAMO.NS ) and Nissan ( 7201.T ), which operates Britain’s biggest factory. Output at both companies fell 2 percent. \nAt Peugeot’s ( PEUP.PA ) Vauxhall Ellesmere Port, where the French carmaker is cutting staff to improve efficiency and tackle falling demand for its Astra Sports Tourer model, output slumped 22 percent. \nToyota’s ( 7203.T ) production fell 20 percent with the company due to announce what will replace its current line of Avensis family cars and Auris hatchbacks. \nFord ( F.N ), Britain’s biggest automotive engine-builder, is deciding on future investment at its Welsh plant where unions fear jobs could be lost as JLR moves production from the site to its own facility in Wolverhampton in central England in 2020. \n“We’re in discussion with our union partners on other business which we can’t go into right now which would also go a long way to replacing the JLR business,” Ford’s Communications Director in Britain Tim Holmes said. \nBritain and the EU hope to agree the terms of a transitional deal by the end of March, which would allow many car companies to avoid triggering contingency plans such as boosting warehousing and increasing local supply networks. \nBut it is unclear how much detail politicians will provide as part of the agreement and whether Britain will continue to maintain all of the same powers it has with EU membership, including over agencies and regulators. \n“The transition arrangements have to pretty much be business as usual,” Hawes said. \n“It means that the vehicle certification arrangements that we currently have and that allow us to certify a vehicle in the UK to be sold around Europe must also continue,” he said. Reporting by Costas Pitas. Editing by Jane Merriman", "external_links": [], "published": "2018-01-31T02:11:00.000+02:00", "crawled": "2018-01-31T02:32:15.002+02:00", "highlightTitle": ""}