{"organizations": [], "uuid": "f639b8ac04a4d1d50a0198c07b8e62e78af581b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222448985&w=1200&r=LYNXMPEE0F11P", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain-fcb-suarez/suarez-back-to-his-lethal-best-after-hitting-barca-nadir-idUKKBN1F51U3", "country": "US", "domain_rank": 408, "title": "Suarez back to his lethal best after hitting Barca nadir", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:53:00.000+02:00", "replies_count": 0, "uuid": "f639b8ac04a4d1d50a0198c07b8e62e78af581b1"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain-fcb-suarez/suarez-back-to-his-lethal-best-after-hitting-barca-nadir-idUKKBN1F51U3", "ord_in_thread": 0, "title": "Suarez back to his lethal best after hitting Barca nadir", "locations": [], "entities": {"persons": [{"name": "suarez", "sentiment": "negative"}, {"name": "rik sharma", "sentiment": "negative"}, {"name": "luis suarez", "sentiment": "none"}, {"name": "ernesto valverde", "sentiment": "none"}], "locations": [{"name": "camp nou", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "girona", "sentiment": "none"}, {"name": "anoeta stadium", "sentiment": "none"}, {"name": "san sebastian", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "barca", "sentiment": "negative"}, {"name": "espanyol", "sentiment": "none"}, {"name": "fc barcelona", "sentiment": "none"}, {"name": "catalans", "sentiment": "none"}, {"name": "la liga", "sentiment": "none"}, {"name": "king", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "soccer football - la liga santander - real sociedad", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "atletico madrid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 57 PM / Updated 9 minutes ago Suarez back to his lethal best after hitting Barca nadir Rik Sharma 3 Min Read \nMADRID (Reuters) - Since the start of the season La Liga leaders Barcelona have been flying, but the same is not true for striker Luis Suarez. Soccer Football - La Liga Santander - Real Sociedad vs FC Barcelona - Anoeta Stadium, San Sebastian, Spain - January 14, 2018 Barcelona’s Luis Suarez in action REUTERS/Vincent West \nWith three goals in his first 14 games, Suarez was in his worst form for the club, one of the few players in Ernesto Valverde’s side who was struggling as the Catalans established a firm lead in the title race. \nBarcelona were winning despite him, not because of him, as they often did in his first three seasons at Camp Nou. \nWith 121 goals in his first 147 matches, helping his side to two league titles, a Champions League trophy and three King’s Cups, among other silverware, everything Suarez touched turn to gold, until this season. \nSuarez scored in the routs of Espanyol and Girona, as well as netting an important equaliser against Atletico Madrid in the 1-1 draw in October, but otherwise fired blanks. \nThe 30-year-old failed to score in any of Barcelona’s six Champions League group games, missed easy chances and was bereft of confidence, despite Valverde consistently starting him. \nBarcelona hit their stride in the coach’s new 4-4-2 system but Suarez lagged behind, missing Neymar, who left for Paris St Germain in the middle of last year. \nThe Brazilian drew defenders like moths to a lamp and created more space for Suarez to exploit. \nA knee problem dogged him from the start of the season until mid November, not enough to rule him out but irritating enough to hamper his performances. \nUruguay agreed not to call him up for friendly matches at the start of November, which allowed him to rest in Barcelona. \n“It would be a lie to say I am happy with my form, I know I can give more,” Suarez told Diario Sport during this break. \n“These two weeks are going to be spectacular for me. The best thing for the national team and Barca was to miss these two friendlies.” CONFIDENT RETURN \nSuarez trained in the sand to strengthen his knee and when the international break was over, he returned a different figure, with confidence restored. \nIn his first match back he struck two in a 3-0 win at Leganes, which sparked a fine run of form. \nSuarez now has eight goals in his last six games and is the second top scorer in La Liga, with 13 goals, behind team mate Lionel Messi on 17. \nDuring his lean spell he looked short of ideas, but in the 4-2 win over Real Sociedad on Sunday he was Barcelona’s best player, setting up Paulinho for the opening goal before adding two himself. \nThe first of those strikes was sumptuous, a curled and lofted effort which bewildered Real Sociedad goalkeeper Geronimo Rulli and sank into the top corner. \nIt is confirmation that after hitting the low point of his Barcelona career, the real Luis Suarez has returned. \nWith Barcelona unbeaten in 29 games and nine points clear at the top of the table, Suarez’s recovery spells bad news for their domestic and European rivals.  ", "external_links": [], "published": "2018-01-16T16:53:00.000+02:00", "crawled": "2018-01-16T17:12:33.008+02:00", "highlightTitle": ""}