{"organizations": [], "uuid": "9156040be50ea84fa31120ee0ed3dd0aa03274a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-903048966.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/data-sheet-ces-power-outage-backlash/", "country": "US", "domain_rank": 1196, "title": "Data Sheet—Power Outage at CES Comes Amid Tech Backlah | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-11T10:51:00.000+02:00", "replies_count": 0, "uuid": "9156040be50ea84fa31120ee0ed3dd0aa03274a6"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/11/data-sheet-ces-power-outage-backlash/", "ord_in_thread": 0, "title": "Data Sheet—Power Outage at CES Comes Amid Tech Backlah | Fortune", "locations": [], "entities": {"persons": [{"name": "gary shapiro", "sentiment": "none"}, {"name": "aaron pressman", "sentiment": "none"}, {"name": "ethan miller", "sentiment": "none"}, {"name": "jim hackett", "sentiment": "none"}, {"name": "adam lashinsky", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "ces comes amid tech backlah | fortune data sheet", "sentiment": "negative"}, {"name": "ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Data Sheet—Darkness Hits CES Amid the Tech Backlash President and CEO of the Consumer Technology Association Gary Shapiro delivers a keynote address at CES 2018. Ethan Miller—Getty Images By Aaron Pressman and Adam Lashinsky 8:51 AM EST \nThis is the web version of Data Sheet, Fortune’s daily newsletter on the top tech news. To get it delivered daily to your in-box, sign up here . \nTalk about bad omens. \nThe lights went out briefly Wednesday at CES, the giant consumer-electronics trade show in Las Vegas. Electricity is rather key to CES, of course. The booming, thumping, pulsing, flashing stalls of techdom went dark and quiet for a spell, prompting amusing accounts of jugglers entertaining, battery-powered boom boxes bleating, and mere mortals illuminating their way from their rapidly depleting smartphones. \nCould the benighted tech industry have hit on a better metaphor than a power outage? While waiting for Ford CEO Jim Hackett’s enlightening keynote Tuesday morning I listened to CES poo-bah Gary Shapiro mouth words about diversity. This from the head of an organization that didn’t see fit to program one woman as a keynote speaker at its annual event. \nElsewhere talk of a tech “backlash” dominated private conversations at CES, as this New York Times article nicely summarizes. Having observed a few of these cycles I’d offer a different interpretation of the current environment. It’s more the inevitable pendulum swinging. Tech is revered; tech is reviled. It’ll be revered again. It’s only a matter of time. \nAs many predicted, voice has been the big topic of CES along with its empowering cousin, artificial intelligence. That’s what tech companies are selling, anyway. In my conversations the discussion of voice led inevitably to data and then to privacy. If the tech lords are listening—and responding with delightful services and information—they’re collecting data all the while. Do we trust them? \nCan they even keep the lights on? Adam Lashinsky @ NEWSWORTHY \nDancing in the dark . A week after Billboard reported that Apple Music executive Jimmy Iovine would leave the company this summer, a reporter from Variety spotted the bald headed music mogul at an industry event. And Iovine denied the rumor , particularly that his departure would be motivated by some of his stock vesting in August. “All this stuff you’re seeing in the newspapers, let me tell you, my stock vested a long time ago,” he said. “We need Donald Trump here to call it ‘fake news.’” \nComing out of the dark. Tim Cook, Mark Zuckerberg, and dozens of other tech CEOs urged Congress to pass legislation protecting immigrants who came the country as children, known as the dreamers. “Hundreds of thousands of deserving young people across the country are counting on you,” the group wrote . \nNot dark yet. Venture capital funding is booming . Startups raised $84 billion last year, the most since the late 1990s Internet bubble era, PitchBook and the National Venture Capital Association reported. There were many cases of the rich getting richer—almost one-quarter of the money went to billion-dollar-valued unicorns. \nMy songs know what you did in the dark. More troubles for Apple over its slowing of iPhones with older batteries . The chairman of the Senate Commerce Committee, Sen. John Thune (R-S.D.), wants an explanation. “The large volume of consumer criticism leveled against the company in light of its admission suggests that there should have been better transparency,” Thune wrote. In France, a Paris prosecutor’s office opened a probe into whether the slowdowns violated consumer protection rules. And law enforcement officials continue attacking the company over the iPhone’s strong encryption security features. FBI forensic expert Stephen Flatley called the company “jerks,” and “evil geniuses” for making password cracking more difficult. \nThe edge of darkness. Amazon’s Dash button let consumers order one specific product. Now the e-commerce giant is expanding the dash ecosystem to allow third parties to create virtual dash buttons that could appear on the screen of a phone or any other connected device, like a “smart” washing machine. \nShot in the dark. Speaking of Amazon , it may or may not be a tipoff about the location of HQ2 , but the company is looking for 1 million square feet of new office space in Boston. Brendan Carroll, director of intelligence at the real estate firm Perry Brokerage Associates, tells the Boston Globe the current search would be “an incredible coincidence” if it’s not part of the plan for HQ2. \nDark paradise . Drone registrations at the Federal Aviation Administration passed the 1 million mark, the agency said on Wednesday. Of the total, 878,000 registered as hobbyists (who may list one or more drone in a single filing) and 122,000 as commercial or government pilots (who get 1 craft per filing). \n(Decoding the headlines? Check, in order: Bruce Springsteen, Gloria Estefan, Bob Dylan, Fall Out Boy, Iron Maiden, Ozzy, and Lana Del Rey.) FOOD FOR THOUGHT \nThe telecom industry has been talking about 5G , the super-fast fifth generation of cellular technology, for what seems like eons at this point. But at CES this year, companies said they were closer than ever to putting real products into consumers’ hands. AT&T even says it will have 5G smartphone connections available in 12 (as yet unnamed) cities this year. Jeremy Horowitz takes a deep dive into the state of 5G for VentureBeat, trying to separate the reality from the hype. \nTesting of fixed and mobile 5G products has been underway for some time, and Baidu’s Lu suggests that work and testing conducted largely in the U.S. will spread to China and elsewhere in the world throughout 2018. U.S. carriers are largely talking about 2018 as a “road to 5G” year in which bridge technologies such as faster LTE Advanced data and Massive MIMO antenna arrays will be deployed before the arrival of 5G. Verizon’s Vestberg said that 2018 will be the year when the 5G ecosystem develops and tests products to get them working together…Qualcomm’s Amon suggested that “flagship smartphones” could be on shelves by early 2019, allowing the first consumers to start transitioning to 5G. So it makes some sense that T-Mobile is promising its full 5G rollout in 2020, with initial deployments in 2019. \nIn other words, stay tuned for CES 2019, which should be 5G’s real opportunity to shine. This year is mostly just about laying the foundation. IN CASE YOU MISSED IT ", "external_links": [], "published": "2018-01-11T10:51:00.000+02:00", "crawled": "2018-01-11T17:15:16.000+02:00", "highlightTitle": ""}