{"organizations": [], "uuid": "4d6a5a597eb4d8b8b7cc7b861ae03cb0e122706e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/08/otto-black-on-brown-door.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/otto-smart-lock-suspension/", "country": "US", "domain_rank": 1196, "title": "Otto Smart Lock Maker Has Suspended Its Business | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.688, "site_type": "news", "published": "2018-01-02T02:00:00.000+02:00", "replies_count": 0, "uuid": "4d6a5a597eb4d8b8b7cc7b861ae03cb0e122706e"}, "author": "Jonathan Vanian", "url": "http://fortune.com/2018/01/02/otto-smart-lock-suspension/", "ord_in_thread": 0, "title": "Otto Smart Lock Maker Has Suspended Its Business | Fortune", "locations": [], "entities": {"persons": [{"name": "otto", "sentiment": "negative"}, {"name": "jonathan vanian", "sentiment": "negative"}, {"name": "reid hoffman", "sentiment": "none"}, {"name": "sam jadallah", "sentiment": "none"}, {"name": "jadallah", "sentiment": "none"}], "locations": [{"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "linkedin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jonathan Vanian January 2, 2018 \nSmart lock startup Otto has suspended its business before shipping any of its expensive locks, marking a huge failure for a high-profile Silicon Valley company. \nOtto CEO Sam Jadallah said in a Medium post last week that he was “so very saddened” that the startup would not be able to deliver its $700 web-connected door locks to customers who pre-ordered them. \n“Otto will not ship next month and it may never ship,” Jadallah wrote. “We will evaluate our options in the coming weeks and see what is open to us.” \nThe Silicon Valley startup was founded in 2012, but revealed itself to the public in August while pitching its digital door locks as an easier way for people to open doors by using a smartphone app instead of a key. Otto’s board included LinkedIn’s well-known co-founder Reid Hoffman. \nJadallah said that he had agreed to sell his startup to an unnamed public company and was blocked from seeking additional funding as part of the planned deal. However, the suitor backed out on the day the deal was supposed to be finalized, leaving Otto without the necessary cash to continue operations. \nGet Data Sheet , Fortune’s technology newsletter. \n“I was stunned. The reason is still not understood,” Jadallah wrote. “We had extended our cash to get to the closing date, and now were left without alternatives.” \nJadallah attempted to spin the debacle as positive, saying that the process of starting Otto “wasn’t an easy or predictable journey, but it was incredibly rewarding.” \n“The only comfort I can find at this moment is to believe that Team Otto and the technology and product we created, will serve as seeds to grow and change industries in new and exciting directions,” he wrote. \nJadallah also shared his thoughts about the risk of running a venture capital-backed company, most of which eventually collapse after failing to create sustainable businesses. He said that startups are companies that “lack a control of their own destiny because they rely on investor cash infusions to operate.” \nAlthough Otto’s digital door locks cost hundreds of dollars more than conventional locks, Jadallah said that “concerns about the $699 price point melted away as homeowners valued the security, design and performance of a new generation of home access that Otto represented” based on feedback from customers who tested its locks. \nAugust, another maker of web-connected door locks, dropped the price of its flagship August Smart Lock by $80 to $149 in September, and then sold itself to Swedish lock giant Assa Abloy the next month. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-02T02:00:00.000+02:00", "crawled": "2018-01-03T08:00:40.010+02:00", "highlightTitle": ""}