{"organizations": [], "uuid": "34e8a2fdef705233742d8960c71fd0e267c9661c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 122, "shares": 122, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/16/104406490-GettyImages-107066419.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/moneygram-to-test-payments-with-ripple-xrp-cryptocurrency.html", "country": "US", "domain_rank": 767, "title": "MoneyGram to test payments with Ripple’s XRP cryptocurrency", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-11T17:06:00.000+02:00", "replies_count": 0, "uuid": "34e8a2fdef705233742d8960c71fd0e267c9661c"}, "author": "Ryan Browne", "url": "https://www.cnbc.com/2018/01/11/moneygram-to-test-payments-with-ripple-xrp-cryptocurrency.html", "ord_in_thread": 0, "title": "MoneyGram to test payments with Ripple’s XRP cryptocurrency", "locations": [], "entities": {"persons": [{"name": "paul thomas", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "moneygram", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "coinmarketcap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. money transfer giant MoneyGram is teaming up with blockchain firm Ripple to test payments using the latter's cryptocurrency.\nMoneyGram, based in Dallas, Texas, will use the XRP cryptocurrency to speed up and reduce the cost of transferring money through Ripple's payment network xRapid.\nXRP was seen surging on the news, and flew almost 15 percent higher to $2.22 at 9:55 a.m. ET, according to Coinmarketcap data. The move marked a recovery following downward pressure across most major cryptocurrencies Thursday after reports of South Korea preparing a bill to ban cryptocurrency trading.\nRipple claims an average transaction on its network takes between two and three seconds to process. Bitcoin transactions, on the other hand, take around 51 minutes on average to go through, according to data by industry website Blockchain.info.\nRipple has made headlines in recent weeks, as its native digital currency has surged — and fallen — dramatically. It temporarily became the second-largest cryptocurrency by market value last month, usurping ethereum, after a huge rally.\nXRP declined significantly after that rally but Ripple said its price has not been reflected accurately, claiming that industry website Coinmarketcap's decision to remove Korean cryptocurrency exchanges from its platform has affected prices. The website removed Korean exchanges due to the \"extreme divergence\" in prices compared to the rest of the world.\n\"The inefficiencies of global payments don't just affect banks, they also affect institutions like MoneyGram,\" Ripple CEO Brad Garlinghouse said in a statement Thursday.\n\"Money transfer companies are incredibly important because they help people get money to their friends and loved ones.\"\nGarlinghouse added that, by using Ripple's digital asset, MoneyGram would be able to move money \"as quickly as information.\"\nRipple is backed by a number of big international banks and financial institutions. In November, the firm teamed up with American Express and Santander on a blockchain pilot to speed up cross-border payments between the U.K. and the U.S.\nWATCH: Ripple CEO explains why his digital currency can transform banking show chapters Ripple CEO explains why his digital currency can transform banking 2:03 PM ET Wed, 27 Dec 2017 | 02:42", "external_links": [], "published": "2018-01-11T17:06:00.000+02:00", "crawled": "2018-01-11T17:07:32.019+02:00", "highlightTitle": ""}