{"organizations": [], "uuid": "e06906a3701fd247dc0706a70147cb7cd8458520", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-puma-biotechnology-announces-publication-of-results-from-phase-ii-summit-abasketa-trial-evaluating-neratinib-in-her2-and.html", "country": "US", "domain_rank": 767, "title": "Puma Biotechnology Announces Publication of Results from Phase II SUMMIT ‘Basket’ Trial Evaluating Neratinib in HER2 and HER3 Mutant Cancers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-31T21:16:00.000+02:00", "replies_count": 0, "uuid": "e06906a3701fd247dc0706a70147cb7cd8458520"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-puma-biotechnology-announces-publication-of-results-from-phase-ii-summit-abasketa-trial-evaluating-neratinib-in-her2-and.html", "ord_in_thread": 0, "title": "Puma Biotechnology Announces Publication of Results from Phase II SUMMIT ‘Basket’ Trial Evaluating Neratinib in HER2 and HER3 Mutant Cancers", "locations": [], "entities": {"persons": [], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "puma biotechnology announces publication of results", "sentiment": "neutral"}, {"name": "puma biotechnology, inc.", "sentiment": "neutral"}, {"name": "her3 mutant cancers - data", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "- Data published online today in Nature -\nLOS ANGELES--(BUSINESS WIRE)-- Puma Biotechnology, Inc. (NASDAQ: PBYI), a biopharmaceutical company, announced that initial results from the company’s ongoing SUMMIT Phase II ‘basket’ clinical trial of PB272 (neratinib) in patients with tumors harboring HER2 or HER3 mutations were published in the journal Nature . The paper, “HER kinase inhibition in patients with HER2- and HER3-mutant cancers,” appears in the January 31, 2018 online issue at http://nature.com/articles/doi:10.1038/nature25475 and will be published in a future print issue of the journal.\nThe Phase II SUMMIT trial is a global, multi-histology, open-label, precision-medicine ‘basket’ study evaluating the safety and efficacy of neratinib administered daily to patients with a wide variety of solid tumors with activating HER2 or HER3 mutations. SUMMIT is designed to evaluate the contributions of both genetic mutation and cancer type on individual patients’ response to neratinib. Information generated from the trial will help guide neratinib-based targeted therapy across a broad spectrum of tumor types with HER2 or HER3 mutations, including patients with rare tumors who may not otherwise have access to investigational therapies.\n“Publication of the initial SUMMIT data in this prestigious journal reflects the novelty and quality of this precision-medicine trial design, as well as the growing understanding that both tumor type and gene mutations play an important role in individual patients’ response to cancer therapies such as neratinib,” said Alan H. Auerbach, Puma’s Chief Executive Officer and President. “The basket trial design utilized for SUMMIT is enabling researchers to evaluate the clinical potential of neratinib in multiple cancer types, rather than limiting exploration to one tumor type at a time. SUMMIT is also significant in that it will provide the largest body of clinical data to date on the use of an irreversible pan-HER inhibitor in patients who have solid tumors with somatic HER2 or HER3 mutations.”\nThe initial SUMMIT results published in Nature comprise data from 141 patients enrolled in the neratinib monotherapy arm of the trial, including 124 patients with HER2 mutations and 17 patients with HER3 mutations. This included patients with 21 unique tumor types, with the most common being breast, lung, bladder and colorectal cancer. Researchers observed 30 distinct HER2 and 12 distinct HER3 mutations among these patients, with the most frequent HER2 variants involving amino acids S310, L755, A755_G776insYVMA and V777.\nIn the HER2-mutant cohort, clinical responses were observed in tumors with S310, L755, V777, P780_Y781insGSP and A775_G776insYVMA mutations. When stratified by tumor type, responses were observed in patients with breast, cervical, biliary, salivary and non-small-cell lung cancers, which led to cohort expansions in these tumor types. No activity was observed in the HER3-mutant cohort.\nThe neratinib safety profile observed in the SUMMIT study is consistent with that observed previously in metastatic patients with HER2 amplified tumors. The study showed that the most frequently observed adverse reaction was diarrhea. All patients in the SUMMIT study received prophylactic loperamide (16 mg per day initially) for the first cycle of treatment in order to reduce neratinib-related diarrhea, and with this anti-diarrheal prophylaxis and management, diarrhea was not a treatment-limiting side effect in SUMMIT. For the 141 patients enrolled in the neratinib monotherapy arm with safety data available, 31 patients (22.0%) reported grade 3 diarrhea. The median duration of grade 3 diarrhea for those patients was two days. Four patients (2.8%) permanently discontinued neratinib and 21 patients (14.9%) had dose interruptions due to diarrhea.\n“Results to date from the SUMMIT trial validate the ‘next-generation’ basket trial approach, which has enabled us to efficiently and effectively evaluate neratinib across numerous cancer types as well as individual and sometimes entirely novel HER2 mutations,” said David Hyman, M.D., Chief of the Early Drug Development Service at Memorial Sloan Kettering Cancer Center (MSK). “We look forward to completing enrollment in the ongoing cohorts in the study and continuing to utilize the basket trial design to explore the most optimal treatment options for these select patient populations.”\nDr. Hyman, who helped pioneer the concept of basket trials at MSK, presented the initial findings from the SUMMIT study at the American Association for Cancer Research Annual Meeting in April 2017.\n“We are very pleased with these initial results,” said Mr. Auerbach. “We look forward to advancing neratinib into further clinical development in multiple HER2 mutant tumor types, both as monotherapy and in novel combinations.”\nAbout Puma Biotechnology\nPuma Biotechnology, Inc. is a biopharmaceutical company with a focus on the development and commercialization of innovative products to enhance cancer care. The Company in-licenses the global development and commercialization rights to three drug candidates — PB272 (neratinib, oral), PB272 (neratinib, intravenous) and PB357. Neratinib, oral was approved by the U.S. Food and Drug Administration in July 2017 for the extended adjuvant treatment of adult patients with early stage HER2-overexpressed/amplified breast cancer, following adjuvant trastuzumab-based therapy, and is marketed in the United States as NERLYNX ® (neratinib) tablets. NERLYNX is a registered trademark of Puma Biotechnology, Inc.\nImportant Safety Information (ISI)\nNERLYNX ® (neratinib) tablets, for oral use\nINDICATIONS AND USAGE: NERLYNX is a kinase inhibitor indicated for the extended adjuvant treatment of adult patients with early-stage HER2 overexpressed/amplified breast cancer, to follow adjuvant trastuzumab-based therapy.\nCONTRAINDICATIONS: None\nWARNINGS AND PRECAUTIONS:\nDiarrhea: Aggressively manage diarrhea occurring despite recommended prophylaxis with additional antidiarrheals, fluids, and electrolytes as clinically indicated. Withhold NERLYNX in patients experiencing severe and/or persistent diarrhea. Permanently discontinue NERLYNX in patients experiencing Grade 4 diarrhea or Grade ≥ 2 diarrhea that occurs after maximal dose reduction. Hepatotoxicity: Monitor liver function tests monthly for the first 3 months of treatment, then every 3 months while on treatment and as clinically indicated. Withhold NERLYNX in patients experiencing Grade 3 liver abnormalities and permanently discontinue NERLYNX in patients experiencing Grade 4 liver abnormalities. Embryo-Fetal Toxicity: NERLYNX can cause fetal harm. Advise patients of potential risk to a fetus and to use effective contraception.\nADVERSE REACTIONS: The most common adverse reactions (≥ 5%) were diarrhea, nausea, abdominal pain, fatigue, vomiting, rash, stomatitis, decreased appetite, muscle spasms, dyspepsia, AST or ALT increase, nail disorder, dry skin, abdominal distention, epistaxis, weight decreased and urinary tract infection.\nTo report SUSPECTED ADVERSE REACTIONS, contact Puma Biotechnology, Inc. at 1-844-NERLYNX (1-844-637-5969) and www.NERLYNX.com or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch .\nDRUG INTERACTIONS:\nGastric acid reducing agents: Avoid concomitant use with proton pump inhibitors (PPI) and H2-receptor antagonists. Separate NERLYNX by 3 hours after antacid dosing. Strong or moderate CYP3A4 inhibitors: Avoid concomitant use. Strong or moderate CYP3A4 inducers: Avoid concomitant use. P-glycoprotein (P-gp) substrates: Monitor for adverse reactions of narrow therapeutic agents that are P-gp substrates when used concomitantly with NERLYNX.\nUSE IN SPECIFIC POPULATIONS:\nLactation: Advise women not to breastfeed.\nPlease see Full Prescribing Information for additional safety information.\nThe recommended dose of NERLYNX is 240 mg (six 40 mg tablets) given orally once daily with food, continuously for one year. Antidiarrheal prophylaxis should be initiated with the first dose of NERLYNX and continued during the first 2 months (56 days) of treatment and as needed thereafter.\nTo help ensure patients have access to NERLYNX, Puma has implemented the Puma Patient Lynx support program to assist patients and healthcare providers with reimbursement support and referrals to resources that can help with financial assistance. More information on the Puma Patient Lynx program can be found at www.NERLYNX.com or 1-855-816-5421.\nFurther information about Puma Biotechnology can be found at www.pumabiotechnology.com .\nForward-Looking Statements\nThis press release contains forward-looking statements that involve risks and uncertainties that could cause the Company's actual results to differ materially from the anticipated results and expectations expressed in these forward-looking statements. These statements are based on current expectations, forecasts and assumptions, and actual outcomes and results could differ materially from these statements due to a number of factors, which include, but are not limited to, the fact that the Company has only recently commenced commercialization and shipment of its only FDA approved product; the Company’s dependence upon the commercial success of NERLYNX (neratinib); the Company’s history of operating losses and its expectation that it will continue to incur losses for the foreseeable future; risks and uncertainties related to the Company’s ability to achieve or sustain profitability; the Company’s ability to predict its future prospects and forecast its financial performance and growth; failure to obtain sufficient capital to fund the Company’s operations; the effectiveness of sales and marketing efforts; the Company’s ability to obtain FDA approval or other regulatory approvals in the United States or elsewhere for other indications for neratinib or other product candidates; the challenges associated with conducting and enrolling clinical trials; the risk that the results of clinical trials may not support the Company’s drug candidate claims; even if approved, the risk that physicians and patients may not accept or use the Company’s products; the Company’s reliance on third parties to conduct its clinical trials and to formulate and manufacture its drug candidates; risks pertaining to securities class action, derivative and defamation lawsuits; the Company’s dependence on licensed intellectual property; and the other risk factors disclosed in the periodic and current reports filed by the Company with the Securities and Exchange Commission from time to time, including the Company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2017. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. The Company assumes no obligation to update these forward-looking statements, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131006028/en/\nPuma Biotechnology, Inc.\nAlan H. Auerbach or Mariann Ohanesian, +1 424 248 6500\ninfo@pumabiotechnology.com\nir@pumabiotechnology.com\nor\nAlshad S. Lalani, Ph.D., +1 424 248 6500\nalalani@pumabiotechnology.com\nSource: Puma Biotechnology, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pumabiotechnology.com&esheet=51751375&newsitemid=20180131006028&lan=en-US&anchor=www.pumabiotechnology.com&index=6&md5=46b2dcdb7e3915773846475933e80e0c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fnature.com%2Farticles%2Fdoi%3A10.1038%2Fnature25475&esheet=51751375&newsitemid=20180131006028&lan=en-US&anchor=http%3A%2F%2Fnature.com%2Farticles%2Fdoi%3A10.1038%2Fnature25475&index=1&md5=6e19ec2d722b263886f64089b36b2e81", "http://www.businesswire.com/news/home/20180131006028/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.fda.gov%2Fmedwatch&esheet=51751375&newsitemid=20180131006028&lan=en-US&anchor=www.fda.gov%2Fmedwatch&index=3&md5=32ee4c9a4179f9d13781d31b5d76110a", "http://nature.com/articles/doi:10.1038/nature25475", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fnerlynx.com%2Fpdf%2Ffull-prescribing-information.pdf&esheet=51751375&newsitemid=20180131006028&lan=en-US&anchor=Full+Prescribing+Information&index=4&md5=c452babc5feebfc324a1ff3212bf9bf9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.NERLYNX.com&esheet=51751375&newsitemid=20180131006028&lan=en-US&anchor=www.NERLYNX.com&index=2&md5=f0d142e4fa628bd1563dc6a73f85a9e3", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.NERLYNX.com&esheet=51751375&newsitemid=20180131006028&lan=en-US&anchor=www.NERLYNX.com&index=5&md5=8e2c85699afa6b35fa578ac7e968008b"], "published": "2018-01-31T21:16:00.000+02:00", "crawled": "2018-01-31T22:54:07.000+02:00", "highlightTitle": ""}