{"organizations": [], "uuid": "dfe451f11c6fa26d3ae3c30f9c4024617e41acc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INentertainmentNews", "section_title": "Reuters: Entertainment News", "url": "https://in.reuters.com/article/people-le-guin/u-s-author-ursula-k-le-guin-dies-at-88-family-idINKBN1FD026", "country": "US", "domain_rank": 408, "title": "U.S. author Ursula K. Le Guin dies at 88 - family", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T02:36:00.000+02:00", "replies_count": 0, "uuid": "dfe451f11c6fa26d3ae3c30f9c4024617e41acc7"}, "author": "", "url": "https://in.reuters.com/article/people-le-guin/u-s-author-ursula-k-le-guin-dies-at-88-family-idINKBN1FD026", "ord_in_thread": 0, "title": "U.S. author Ursula K. Le Guin dies at 88 - family", "locations": [], "entities": {"persons": [{"name": "ursula k. le guin", "sentiment": "negative"}, {"name": "le guin", "sentiment": "none"}, {"name": "bernie woodall", "sentiment": "none"}, {"name": "theo downes-le guin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "portland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 12:41 AM / Updated 4 minutes ago U.S. author Ursula K. Le Guin dies at 88 - family Bernie Woodall 3 Min Read \n(Reuters) - Science fiction and fantasy author Ursula K. Le Guin, author of “The Left Hand of Darkness” and the Earthsea series, died in her home in Portland, Oregon, her son said on Tuesday. She was 88. \nHer son, Theo Downes-Le Guin, said by telephone that the cause of his mother’s death on Monday afternoon is not clear, but she likely had a heart attack. She had been having health issues related to her heart in recent months, he said. \n“Her mind was as sharp as a tack until the last moment,” he said. \nLe Guin was the author of 20 novels, six volumes of poetry, 13 books for children, many short stories as well as literary criticism, according to her website. \nHer 1969 novel, “The Left Hand of Darkness” won the Hugo and Nebula awards, which are given to recognise the best works of science fiction and fantasy. Her 1974 novel, “The Dispossessed” also won both awards. \nLe Guin continued writing well after she told her family she did not think she had the stamina to write even blog entries, her son said. \n“She was more or less never not writing,” Theo Downes-Le Guin told Reuters. “She surprised even herself writing stories until about two months ago.” \n“She told me a few days ago she felt a little guilty because she was just writing for her own pleasure now,” he said. \nLe Guin’s Earthsea books began in 1968 with the publication of “A Wizard of Earthsea,” and included three novels by 1972, followed by one in 1990 and another in 2001, the last called “The Other Wind.” \n“The Earthsea series was clearly influenced by J. R. R. Tolkien’s ‘The Lord of the Rings’ trilogy,” according to The New York Times. “But instead of a holy war between Good and Evil, Ms. Le Guin’s stories are organised around a search for ‘balance’ among competing forces.” \nBorn in Berkeley, California in 1929, Le Guin graduated from Radcliffe College in 1951, then earned a master’s degree from Columbia University the following year. \nShe is survived by her husband, Charles Le Guin, her son Theo, and two daughters, Caroline and Elisabeth Le Guin. A private service will be held in Portland where she lived since 1958. A public celebration of her life, also in Portland, will be announced later, her son said. Reporting by Bernie Woodall in Fort Lauderdale, Fla.; editing by Grant McCool", "external_links": [], "published": "2018-01-24T02:36:00.000+02:00", "crawled": "2018-01-24T02:54:25.015+02:00", "highlightTitle": ""}