{"organizations": [], "uuid": "be3a18c9a56eff79a04188e45cb0a23882427e97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104937235-GettyImages-896041908.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/10/the-last-jedi-loses-out-to-chinese-comedy-opening-weekend.html", "country": "US", "domain_rank": 767, "title": "'The Last Jedi' loses out to Chinese comedy in opening weekend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.034, "site_type": "news", "published": "2018-01-10T11:02:00.000+02:00", "replies_count": 0, "uuid": "be3a18c9a56eff79a04188e45cb0a23882427e97"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/10/the-last-jedi-loses-out-to-chinese-comedy-opening-weekend.html", "ord_in_thread": 0, "title": "'The Last Jedi' loses out to Chinese comedy in opening weekend", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "disney", "sentiment": "none"}, {"name": "box office mojo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The latest \"Star Wars\" played second fiddle to a locally produced romantic comedy during its opening weekend in China.\nThe Disney movie, \"Star Wars: The Last Jedi,\" racked up just over $28 million in its opening weekend on the mainland, putting the film at number two in the local box office for the week ending Jan. 7, according to Box Office Mojo.\nThose lukewarm numbers were at odds with the film's $450 million worldwide opening weekend numbers in December. That showing made \"The Last Jedi\" the fifth-largest global opening in history, according to Disney.\nMainland takings by \"The Last Jedi\" at its weekend debut, however, were considerably lower than the $87 million recorded by locally produced \"The Ex-File: The Return of the Exes\" in the same period of time. The romantic comedy wasn't even new: It was released in the last week of 2017.\nWhile it's been suggested the Disney movie's late arrival in China could have contributed to its poor performance — meaning pirates would have already had ample opportunity to see the film — other \"Star Wars\" movies have also seen soggy receptions on the mainland.\n\"Star Wars: The Force Awakens,\" which premiered on the mainland in January 2016, took in $52 million and \"Rogue One: A Star Wars Story\" recorded $30 million in the opening weekend, Variety reported .\n\"[T]his is a franchise which has always struggled in China ... the cult following just doesn't exist,\" Ben Cavender, principal at consultancy China Market Research Group, told CNBC.\nHe attributed the less-than-outstanding performance of \"The Last Jedi\" at the Chinese box office to the lack of \"generational awareness\" among Chinese consumers of the franchise.\nThe first three films in the series, which first began in 1977, were never shown in theaters on the mainland. In fact, the first Hollywood film shown theatrically after the Cultural Revolution was \"The Fugitive\" — which coincidentally also starred \"Star Wars\" actor Harrison Ford — in 1994.\nIn order to tackle that lack of awareness ahead of the mainland release of \"The Force Awakens\" two years ago, Disney carried out large-scale marketing campaigns that included positioning 500 white-armored stormtroopers on the Great Wall to drum up hype around the film.\nStar Wars tweet: In a first-ever event of its kind, 500 stormtroopers were stationed on the Great Wall to celebrate #TheForceAwakens!\nDisney also recruited popular Chinese singer Lu Han to star in a themed music video ahead of the mainland release of \"The Force Awakens\" back in 2016.\nThis year, cast and crew members of \"The Last Jedi\" — including actress Daisy Ridley, actor Mark Hamill and director Rian Johnson — attended a premiere at Shanghai Disney Resort some two weeks ahead of the film's mainland release to drum up support.\nMeanwhile, the relative popularity of the latest \"The Ex-File\" sequel could also be due to Chinese consumers becoming more attached to local \"story-driven\" films, Cavender said, citing the outperformance of \"Wolf Warrior 2\" last year.", "external_links": ["https://www.nytimes.com/2018/01/07/movies/jumanji-last-jedi-box-office.html", "http://variety.com/2018/film/news/the-last-jedi-china-box-office-1202655733/", "https://twitter.com/starwars/status/656960157340082181", "https://disneyparks.disney.go.com/blog/2017/12/star-wars-the-last-jedi-premieres-in-china-at-shanghai-disney-resort-with-cast-and-crew/"], "published": "2018-01-10T11:02:00.000+02:00", "crawled": "2018-01-10T10:31:45.000+02:00", "highlightTitle": ""}