{"organizations": [], "uuid": "2a9d3f4d826f6d8d16dc80b3a51ec3a616221045", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 16, "shares": 16, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222751260&w=1200&r=LYNXMPEE0G12A", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-usa-immigration-breakingviews/breakingviews-hadas-malthus-condorcet-and-shithole-economics-idUSKBN1F61UV", "country": "US", "domain_rank": 408, "title": "Hadas: Malthus, Condorcet and “shithole” economics", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.054, "site_type": "news", "published": "2018-01-17T22:51:00.000+02:00", "replies_count": 0, "uuid": "2a9d3f4d826f6d8d16dc80b3a51ec3a616221045"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-immigration-breakingviews/breakingviews-hadas-malthus-condorcet-and-shithole-economics-idUSKBN1F61UV", "ord_in_thread": 0, "title": "Hadas: Malthus, Condorcet and “shithole” economics", "locations": [], "entities": {"persons": [{"name": "hadas", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "malthus", "sentiment": "negative"}, {"name": "thomas malthus", "sentiment": "none"}], "locations": [{"name": "condorcet", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters Breakingviews) - Why did Donald Trump say some places are “shithole countries”? Racism and xenophobia are obvious answers, but something else might be influencing the U.S. president: the pessimism of Thomas Malthus.\nFew thinkers have been both so obviously wrong and unhelpfully influential as the English clergyman. The first edition of his 1798 “An Essay on the Principle of Population” stated as a fact that the populace would always tend to grow faster than food production. The result was near-universal subsistence living interrupted by frequent famines, plagues and wars. He called it a “killing frost of misery”.\nAs agricultural yields increased, Malthus softened his views, but his original bleak theory has had a dire influence on economic thinking. It inspired the supposed iron law of wages – the claim that in a competitive market pay would never rise above subsistence levels. That principle helped shape Marxism. The Malthusian image of an endless fight for economic survival can also be seen in the classic definition of economics as the study of scarcity.\nThe gloomy outlook has lingered, even as life expectancies increased and whole populations came to enjoy formerly unheard of comforts. Of course, now that birth rates in many developed countries are too low to keep the population constant, the precise worries of Malthus are absurd. Yet economists have retained the predisposition to look on the dark side.\nThe ever-expanding banquet of consumption in the real word often seems to pass by a profession which teaches that there is no such thing as a free lunch. Instead of praising the unprecedented current level of prosperity, economists often prefer to worry that economic growth is not fast enough.\nWorse, when it comes to poor countries the old ideas have often survived with little modification. It is not just Trump. Last July, French President Emmanuel Macron, generally considered the antithesis of his American counterpart, referred to Africa’s “civilisational problems”, noting that mothers there still have “seven to eight children”.\nIn effect, Macron saw people still in the throes of a Malthusian struggle for survival. When such presuppositions are the starting point, it is hardly surprising that relatively little attention is paid to steadily falling birth rates, declining poverty and increasing education in almost every country in Africa.\nMalthusian-style gloom can be helpful: the threat of catastrophe can encourage reforms. Too often, however, it inspires an attitude of hopelessness, which all too easily turns into disdain and expectations of failure.\nThat is where the “shithole countries” come in. Trump’s use of such a casually derogative term reflects the perhaps unconscious assumption that some places, and the people who live there, are beyond hope of improvement. The prevalence of such negative thinking may be the worst heritage of the Malthusian worldview.\nThe negativity was unnecessary. Economics would have had a less dismal future if instead of following Malthus the then-nascent discipline had turned to one of his opponents, the Marquis of Condorcet. The Englishman’s “Essay” was partly a response to the French aristocrat’s optimistic “Sketch for a Historic Picture of the Progress of the Human Spirit”.\nThe “Sketch” was published posthumously. Although Condorcet had long praised revolutionary ideals, the radical French government turned against him. He drafted his last major work while on the run from the authorities, and only avoided execution by killing himself in 1794.\nTo the end, though, his confidence in the future was undaunted. The book postulates the “indefinite perfectibility” of human nature, and anticipates an endless stream of “improvements, of which we can at present scarcely form a conception”. He rightly anticipated universal education, the spread of democracy and the decline of aristocratic privilege. He vaguely foresaw immense leaps in technology.\nCondorcet did not believe that any part of the world was cursed to misery. In time, he expected the elimination of the “immense difference” between French sophistication and life in what might now be called “shithole countries” – “the barbarity of the African peoples, the ignorance of the savages”. After a long wait, history is finally catching up with that prediction.\nCondorcet’s expectations of physical immortality and universal social contentment are no more plausible now than then. Still, such dreams probably helped him see that many old assumptions about the limits to growth were completely unjustified.\nMalthus was incredulous at the predictions. To expect longer and healthier lives for all, as Condorcet did, is to “shut our eyes to the book of nature”. To devise a plan for the universal provision of the means of survival - what would now be called welfare states - was to misunderstand the strength of the temptation of idleness.\nBoth nature and human societies proved far more malleable and controllable than Malthus imagined. Condorcet, for all his bizarre utopianism, provides a much better guide to the energy and success of this aspect of the modern spirit. His progressive expectations need not be relegated to the trash heaps of history.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-17T22:51:00.000+02:00", "crawled": "2018-01-18T01:05:33.007+02:00", "highlightTitle": ""}