{"organizations": [], "uuid": "f8ccec6d06dbc4d3563f14d52041f091326c6593", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/ukraine-hiv/conflict-in-ukraine-escalated-spread-of-hiv-scientists-idUSL8N1P74IT", "country": "US", "domain_rank": 408, "title": "Conflict in Ukraine escalated spread of HIV - scientists", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T04:02:00.000+02:00", "replies_count": 0, "uuid": "f8ccec6d06dbc4d3563f14d52041f091326c6593"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/ukraine-hiv/conflict-in-ukraine-escalated-spread-of-hiv-scientists-idUSL8N1P74IT", "ord_in_thread": 0, "title": "Conflict in Ukraine escalated spread of HIV - scientists", "locations": [], "entities": {"persons": [{"name": "tetyana vasylyeva", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "luhansk", "sentiment": "none"}, {"name": "donetsk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "kiev", "sentiment": "none"}, {"name": "east", "sentiment": "none"}, {"name": "odessa", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "oxford university", "sentiment": "none"}, {"name": "oxford university and public health england", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 15 (Thomson Reuters Foundation) - Fighting in Ukraine that erupted in 2014 escalated the spread of HIV throughout the country as millions of infected people were uprooted by violence, a study published on Monday found.\nConflict-affected areas such as Donetsk and Luhansk, two large cities in the east of Ukraine, were the main exporters of the HIV virus to other parts of the country such as Kiev and Odessa, the report found.\nUkraine has among the highest HIV rates in Europe, with an estimated 220,000 infected in a country of about 45 million.\nAn international team of scientists led by Oxford University and Public Health England analysed viral migration patterns and found a correlation between the war-related movement of 1.7 million people and the spread of HIV.\n“The war changed a lot of things in Ukraine and the HIV epidemic is one of them,” said lead author Tetyana Vasylyeva of Oxford University’s Zoology department.\n“When we conducted our analysis we were able to show that the viral spread from the East to the rest of the country had been intensified after the war.”\nThe HIV epidemic has shifted from being associated with drug injections in the 1990s to most new infections now being spread by sexual transmission, Vasylyeva told the Thomson Reuters Foundation.\nHalf of HIV-infected people in Ukraine are unaware of their infection status and around 40 percent of newly diagnosed people are in the later stages of the disease, she added.\nAlmost 37 million people worldwide have the human immunodeficiency virus that causes AIDS.\nSince the first cases of HIV were reported more than 35 years ago, 35 million people have died from AIDS-related illnesses according to the United Nations AIDS programme (UNAIDS), which is seeking to end the public health threat by 2030, in line with the U.N. Sustainable Development Goals.\nA Russia-backed insurgency erupted in Ukraine’s industrialized east in 2014 and the bloodshed has continued despite a ceasefire deal brokered by Germany, France, Russia and Ukraine.\nMore than 10,000 people have been killed in the conflict, with casualties reported on a near-daily basis.\nRussia denies accusations from Ukraine and NATO that it supports the rebels with troops and weapons.\nThe health study also found an alarmingly high resistance, compared to the rest of Europe, to pre-exposure prophylaxis (PrEP) a common treatment for HIV, said senior author and medical virologist, Gkikas Magiorkinis.\n“It’s a worrying development and the policy makers should be alerted because it’s going to be very, very difficult to use it (PrEP) in the near future in Ukraine,” Magiorkinis told the Thomson Reuters Foundation.\nUkraine must scale-up interventions to prevent further transmissions of HIV, and seek international support to prevent a new public health tragedy, he said. (Reporting by Adela Suliman; editing by Ros Russell. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org )\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T04:02:00.000+02:00", "crawled": "2018-01-16T13:27:31.014+02:00", "highlightTitle": ""}