{"organizations": [], "uuid": "7e758373597018ff5531a83e2454f81e857fe257", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/9", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-cf-financial-corporation-announces-net-income-for-2017.html", "country": "US", "domain_rank": 767, "title": "C&F Financial Corporation Announces Net Income for 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.072, "site_type": "news", "published": "2018-01-25T23:30:00.000+02:00", "replies_count": 0, "uuid": "7e758373597018ff5531a83e2454f81e857fe257"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-cf-financial-corporation-announces-net-income-for-2017.html", "ord_in_thread": 0, "title": "C&F Financial Corporation Announces Net Income for 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "nasd", "sentiment": "negative"}, {"name": "c&f financial corporation", "sentiment": "negative"}, {"name": "corporation", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "c&f bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WEST POINT, Va., C&F Financial Corporation (the Corporation) (NASDAQ:CFFI), the one-bank holding company for C&F Bank (the Bank), today reported net income of $6.6 million, or $1.88 per common share assuming dilution, for the year ended December 31, 2017, compared to $13.5 million, or $3.89 per common share assuming dilution, for the year ended December 31, 2016. The Corporation reported a net loss of $3.3 million for the fourth quarter of 2017, or $(0.95) per common share assuming dilution, compared with net income of $3.1 million, or $0.89 per common share assuming dilution, for the fourth quarter of 2016.\nThe results for the year and the three months ended December 31, 2017 include the effect of the Tax Cuts and Jobs Act (the Act), which was signed into law on December 22, 2017. Among other things, the Act permanently lowers the federal corporate income tax rate to 21% from the maximum rate prior to the passage of the Act of 35%, effective January 1, 2018. As a result of the reduction of the federal corporate income tax rate, U.S. generally accepted accounting principles (GAAP) require companies to re-measure their deferred tax assets and deferred tax liabilities, including those accounted for in accumulated other comprehensive income, as of the date of the Act’s enactment and record the corresponding effects in income tax expense in the fourth quarter of 2017. As a result of the permanent reduction in the corporate income tax rate, the Corporation recognized a $6.6 million reduction in the value of its net deferred tax asset and recorded a corresponding incremental income tax expense of $6.6 million in the Corporation’s consolidated results of operations for the fourth quarter of 2017. This additional income tax expense reduced the Corporation’s earnings per common share assuming dilution by $1.91 and $1.90 for the year and three months ended December 31, 2017, respectively. Management expects the negative effect of the Act on the Corporation’s results of operations in 2017 will be recovered over future periods when the lower corporate income tax rate of 21% will be used to calculate income tax expense, which is expected to positively affect the Corporation’s net income. The Corporation’s evaluation of the effect of the Act is subject to refinement for up to one year after enactment.\nFor the year ended December 31, 2017, the Corporation’s returns on average common equity (ROE) and on average assets (ROA) were 4.58 percent and 0.45 percent, respectively, compared to 9.90 percent and 0.96 percent, respectively, for the year ended December 31, 2016. For the fourth quarter of 2017, on an annualized basis, the Corporation’s ROE and ROA were (9.02) percent and (0.89) percent, respectively, compared to 8.87 percent and 0.86 percent, respectively, for the fourth quarter of 2016, on an annualized basis. Excluding the effect of the revaluation of the Corporation’s net deferred tax asset, for the year ended December 31, 2017, the Corporation’s adjusted ROE and adjusted ROA were 9.20 percent and 0.90 percent, respectively, and for the fourth quarter of 2017 on an annualized basis, the Corporation’s adjusted ROE and adjusted ROA were 9.05 percent and 0.89 percent, respectively.\n“The one-time adjustment to the Corporation’s net deferred tax asset that triggered an incremental income tax expense of $6.6 million resulted in a net loss for the quarter. However, excluding this effect, adjusted net income for the fourth quarter of 2017 increased to $3.3 million, compared to $3.1 million in the fourth quarter 2016,” said Larry Dillon, Chairman and Chief Executive Officer of C&F Financial Corporation. “For the year 2017, excluding the effect of the Act’s enactment, adjusted net income exceeded $13 million. At the retail banking segment, we expanded into the Charlottesville market and continued growth in our commercial lending portfolio. The mortgage banking segment increased loan production during 2017 as a result of robust residential home demand in the markets we serve, which we expect to continue in 2018. The consumer finance segment experienced a slight decline in its loan portfolio during 2017; however, we feel very positive about the quality of the portfolio with the delinquencies at their lowest year-end level since 2012.”\n“While the reduced corporate income tax rate resulted in a net loss for the fourth quarter of 2017 and reduced earnings for 2017, we expect that C&F will benefit from the lower rate going forward,” said Tom Cherry, President of C&F Financial Corporation. “Even with the loss for the fourth quarter resulting from the revaluation of C&F’s net deferred tax asset, we continued to maintain capital levels well above the regulatory minimums to be considered well capitalized under current regulatory standards, as well as under the fully phased-in Basel III capital rules. In fact, because of our strong capital levels we were able to increase our fourth quarter dividend by three percent.”\nRetail Banking Segment. C&F Bank, which comprises the retail banking segment, reported net income of $5.0 million for the year ended December 31, 2017, compared to net income of $8.2 million for the year ended December 31, 2016. For the fourth quarter of 2017, the Bank reported a net loss of $1.0 million, compared to net income of $2.2 million for the fourth quarter of 2016. The retail banking segment’s results for both the year and the quarter ended December 31, 2017 included income tax expense of $3.5 million associated with the revaluation of C&F Bank’s net deferred tax asset. The retail banking segment’s income before income taxes for the year ended December 31, 2017 was $10.7 million, compared to $9.6 million for the year ended December 31, 2016. For the fourth quarter of 2017, the Bank reported income before income taxes of $3.0 million, compared to $2.8 million for the fourth quarter of 2016.\nThe primary factor positively influencing the retail banking segment’s income before income taxes for both the year and quarter ended December 31, 2017 was the effect of loan growth on interest income, as average loans at C&F Bank increased $51.5 million or 7.6 percent during the fourth quarter of 2017 and $57.3 million or 8.8 percent during the year ended December 31, 2017 over the same periods of 2016. Partially offsetting the positive effect of loan growth during 2017 were (1) a decline in the yield on the investment portfolio as a result of replacing matured and called securities with lower-yielding securities, (2) a higher provision for loan losses resulting from loan growth, (3) higher operating expenses associated with strengthening C&F Bank’s technology infrastructure, growing its branch network and commercial lending teams, implementing its digital initiatives and promoting brand awareness and (4) one time revenue items totaling $991,000 before taxes during 2016 associated with the Bank’s debit card program, bank-owned life insurance program and a gain on sale of Bank-owned property.\nThe results for the year and fourth quarter of both 2017 and 2016 include the acquisition accounting adjustments recorded in connection with the 2013 acquisition of Central Virginia Bank. The pre-tax net accretion attributable to these adjustments recognized for the year and quarter ended December 31, 2017 was $1.1 million and $279,000, respectively, compared to $1.9 million and $523,000 for the year and quarter ended December 31, 2016, respectively.\nC&F Bank’s total nonperforming assets were $5.4 million at December 31, 2017, compared to $4.4 million at December 31, 2016. Nonperforming assets at December 31, 2017 included $5.3 million in nonaccrual loans, compared to $4.2 million at December 31, 2016, and $168,000 in other real estate owned (OREO), compared to $195,000 at December 31, 2016. The increase in nonaccrual loans was due to one commercial relationship totaling $3.8 million, which was classified as nonaccrual in the first quarter of 2017. This relationship was restructured in 2017 and is reported in troubled debt restructurings (TDR) at December 31, 2017. The loans associated with this relationship were previously identified as problem credits and classified accordingly. Specific reserves have also been established, which management believes are adequate to absorb probable losses on these loans. The OREO decrease during 2017 was due to sales.\nMortgage Banking Segment. C&F Mortgage Corporation, which comprises the mortgage banking segment, reported net income of $985,000 for the year ended December 31, 2017, compared to net income of $1.7 million for the year ended December 31, 2016. For the fourth quarter of 2017, C&F Mortgage Corporation reported a net loss of $373,000, compared to net income of $110,000 for the fourth quarter of 2016. The mortgage banking segment’s results for both the year and the quarter ended December 31, 2017 included income tax expense of $589,000 associated with the revaluation of C&F Mortgage Corporation’s net deferred tax asset. The mortgage banking segment’s income before income taxes for the year ended December 31, 2017 was $2.6 million, compared to $2.8 million for the year ended December 31, 2016. For the fourth quarter of 2017, C&F Mortgage Corporation reported income before income taxes of $337,000, compared to $192,000 for the fourth quarter of 2016.\nLoan production decreased 0.5 percent and increased 10.4 percent during the fourth quarter and year ended December 31, 2017, respectively, compared to the same periods in 2016. The higher loan production during 2017 resulted in higher gains on sales of loans and higher production-based fee income. However, there has been a decline in the interest margin on loans held for sale as a result of the flattening of the yield curve during 2017 whereby short-term interest rates, which affect the segment’s borrowing costs, have been rising while long-term rates have remained relatively unchanged. Income before income taxes also declined because of fixed personnel and overhead costs associated with the segment’s branch expansion in the Chesapeake, Virginia market, which began in late 2016.\nConsumer Finance Segment. C&F Finance Company, which comprises the consumer finance segment, reported net income of $2.3 million for the year ended December 31, 2017, compared to net income of $4.5 million for the year ended December 31, 2016. For the fourth quarter of 2017, C&F Finance Company reported a net loss of $958,000, compared to net income of $888,000 for the fourth quarter of 2016. The consumer finance segment’s results for both the year and the quarter ended December 31, 2017 included income tax expense of $1.7 million associated with the revaluation of C&F Finance Company’s net deferred tax asset. The consumer finance segment’s income before income taxes for the year ended December 31, 2017 was $6.5 million, compared to $7.4 million for the year ended December 31, 2016. For the fourth quarter of 2017, C&F Finance Company reported income before income taxes of $1.1 million, compared to $1.4 million for the fourth quarter of 2016.\nThe decline in income before income taxes for the year and quarter ended December 31, 2017, compared to the same periods in 2016, was principally due to (1) lower interest income attributable to a decline in average loans and (2) net interest margin compression attributable to lower loan yields resulting from competition in the non-prime automobile loan business and the acquisition of loan contracts with higher credit metrics, coupled with higher-cost variable-rate borrowings resulting from increases in short-term interest rates since March 31, 2016. The negative effect of these factors was offset in part by a decrease in the provision for loan losses mainly resulting from a decrease in outstanding loans during 2017.\nThe net charge-off ratio for 2017 increased to 5.82 percent from 5.55 percent for 2016 because of the higher level of charge-offs during 2017 resulting from the lower resale value of repossessed automobiles. The combination of the lower provision and higher charge-offs during 2017 resulted in a decline in the allowance for loan losses to $24.4 million at December 31, 2017 from $25.4 million at December 31, 2016. The ratio of the allowance for loan losses to total loans increased to 8.34 percent at December 31, 2017, compared to 8.33 percent at December 31, 2016, because loans declined to $292.0 million at December 31, 2017 from $304.4 million at December 31, 2016. At December 31, 2017, total delinquent loans as a percentage of total loans declined to 5.17 percent from 5.87 percent at December 31, 2016.\nOther Segments. Other segments, which principally includes the Corporation’s holding company operations and wealth management subsidiary, reported an aggregate net loss of $1.7 million for the year ended December 31, 2017, compared to a net loss of $975,000 for the year ended December 31, 2016. For the fourth quarter of 2017, other segments reported an aggregate net loss of $941,000, compared to a net loss of $145,000 for the fourth quarter of 2016. The other segments’ results for both the year and the quarter ended December 31, 2017 included income tax expense of $874,000 associated with the revaluation of their net deferred tax assets. The other segments’ loss before income taxes was $1.9 million for each of the years ended December 31, 2017 and 2016. For the fourth quarter of 2017, the other segments reported a loss before income taxes of $392,000, compared to a loss before income taxes of $499,000 for the fourth quarter of 2016. The improvement during the fourth quarter of 2017 resulted from an increase in earnings at the Corporation’s wealth management subsidiary, which added a new wealth management group in Williamsburg and Newport News, Virginia during the fourth quarter of 2016.\nCapital and Dividends. The Corporation declared dividends during the year ended December 31, 2017 totaling $1.33 per share. The Corporation declared a quarterly cash dividend of 34 cents per share during the fourth quarter of 2017, which represented a 3.0 percent increase over the prior quarter’s dividend amount of 33 cents per common share and was paid on January 1, 2018. The Board of Directors of the Corporation continually reviews the amount of cash dividends per share and the resulting dividend payout ratio in light of changes in economic conditions, current and future capital requirements, and expected future earnings.\nAbout C&F Financial Corporation. C&F Financial Corporation’s common stock is listed for trading on the Nasdaq Stock Market under the symbol CFFI. The common stock closed at a price of $56.70 per share on January 24, 2018. At December 31, 2017, the book value of the Corporation was $40.53 per common share.\nC&F Bank operates 26 retail bank branches and three commercial loan offices located throughout the Hampton to Charlottesville corridor in Virginia and offers full investment services through its subsidiary C&F Wealth Management, Inc. C&F Mortgage Corporation provides mortgage loan origination services through offices located in Virginia, Maryland, and North Carolina. C&F Finance Company provides automobile loans through indirect lending programs offered in Virginia, Tennessee, Maryland, North Carolina, Georgia, Ohio, Kentucky, Indiana, Alabama, Missouri, Illinois, Texas, Florida, New Jersey, Pennsylvania, and West Virginia through its offices in Richmond and Hampton, Virginia, in Nashville, Tennessee and in Hunt Valley, Maryland.\nAdditional information regarding the Corporation’s products and services, as well as access to its filings with the Securities and Exchange Commission, are available on the Corporation’s web site at http://www.cffc.com .\nUse of Certain Non-GAAP Financial Measures. The accounting and reporting policies of the Corporation conform to generally accepted accounting principles (GAAP) in the United States and prevailing practices in the banking industry. However, certain non-GAAP measures are used by management to supplement the evaluation of the Corporation’s performance. These include (i) adjusted net income, adjusted earnings per share, adjusted ROE and adjusted ROA excluding the one-time effect of the revaluation of deferred tax assets and liabilities and the corresponding effect on income tax expense associated with the enactment of the the Act on December 22, 2017 and (ii) fully-taxable equivalent (FTE) measures of interest income on loans-FTE, interest income on securities-FTE, total interest income-FTE and net interest income-FTE.\nManagement believes that the exclusion of the significant one-time effect of the Act provides users of the Corporation’s financial information a presentation of the Corporation’s financial results that is representative of its ongoing operations. Management uses these non-GAAP measures to evaluate the Corporation’s operating performance on a basis comparable to other financial periods. In this non-GAAP presentation, the income tax expense related to the revaluation of the Corporation’s net deferred tax asset is added to the Corporation’s net income. The resulting adjusted net income is used in the calculations of adjusted earnings per share, adjusted ROE and adjusted ROA.\nManagement believes that FTE measures provide users of the Corporation’s financial information a presentation of the performance of interest earning assets on a basis that is comparable within the banking industry. Management routinely reviews interest income of the Corporation on an FTE basis. In this non-GAAP presentation, interest income is adjusted to reflect tax-exempt interest income on an equivalent before-tax basis. This measure ensures the comparability of net interest income arising from both taxable and tax-exempt sources.\nThese non-GAAP financial measures should not be considered an alternative to GAAP-basis financial statements, and other bank holding companies may define or calculate these or similar measures differently. A reconciliation of the non-GAAP financial measures used by the Corporation to evaluate and measure the Corporation’s performance to the most directly comparable GAAP financial measures is presented below.\nForward-Looking Statements. Statements in this press release which express “belief,” “intention,” “expectation,” “potential” and similar expressions, identify forward-looking statements. These forward-looking statements are based on the beliefs of the Corporation’s management, as well as assumptions made by, and information currently available to, the Corporation’s management. These statements are inherently uncertain, and there can be no assurance that the underlying assumptions will prove to be accurate. Actual results could differ materially from those anticipated or implied by such statements. Forward-looking statements in this release include, without limitation, statements regarding expected future financial performance, including the effect on future results of lower corporate income tax rates, strategic business initiatives including personnel additions, expansion into new markets, development of our digital platform and the utilization of scorecard models, asset quality, adequacy of allowances for loan losses and the level of future charge-offs, capital levels, the effect of future market and industry trends, including competitive trends in the non-prime consumer finance markets, trends with respect to the levels of nonperforming assets and TDRs and expenses associated with nonperforming assets, and the effects of future interest rate levels and fluctuations. Factors that could have a material adverse effect on the operations and future prospects of the Corporation include, but are not limited to, changes in: (1) interest rates, such as volatility in yields on U.S. Treasury bonds and increases or volatility in mortgage rates, (2) general business conditions, as well as conditions within the financial markets, (3) general economic conditions, including unemployment levels, (4) the legislative/regulatory climate, regulatory initiatives with respect to financial institutions, products and services, the Consumer Financial Protection Bureau (CFPB) and the regulatory and enforcement activities of the CFPB, and the application of the Basel III capital standards to the Corporation and the Bank, (5) the effect of the Act, including but not limited to, the effect of the lower corporate income tax rate on the valuation of the Corporation’s tax assets and liabilities and changes in the effect of the Act due to issuance of interpretive regulatory guidance or enactment of corrective or supplemental legislation, (6) monetary and fiscal policies of the U.S. Government, including policies of the U.S. Treasury and the Federal Reserve Board, and the effect of these policies on interest rates and business in our markets, (7) the value of securities held in the Corporation’s investment portfolios, (8) the quality or composition of the loan portfolios and the value of the collateral securing those loans, (9) the inventory level and pricing of used automobiles, including sales prices of repossessed vehicles, (10) the level of net charge-offs on loans and the adequacy of our allowance for loan losses, (11) the level of indemnification losses related to mortgage loans sold, (12) demand for loan products, (13) deposit flows, (14) the strength of the Corporation’s counterparties and the economy in general, (15) competition from both banks and non-banks, including competition in the non-prime automobile finance markets, (16) demand for financial services in the Corporation’s market area, (17) reliance on third parties for key services, (18) the commercial and residential real estate markets, (19) demand in the secondary residential mortgage loan markets, (20) the Corporation’s branch and market expansions and technology initiatives, and (21) accounting principles, policies and guidelines and elections by the Corporation thereunder. These risks and uncertainties should be considered in evaluating the forward-looking statements contained herein, and readers are cautioned not to place undue reliance on any forward-looking statements, which speak only as of the date of this release. For additional information on risk factors that could affect the forward-looking statements contained herein, see the Corporation’s Annual Report on Form 10-K for the year ended December 31, 2016 and other reports filed with the Securities and Exchange Commission.\nC&F Financial Corporation\nSelected Financial Information\n(in thousands, except for share and per share data) Financial Condition 12/31/2017 12/31/2016 (unaudited) * Interest-bearing deposits in other banks $ 105,353 $ 90,309 Investment securities - available for sale, at fair value 218,976 210,026 Loans held for sale, at fair value 55,384 52,027 Loans, net: Retail Banking segment 721,726 680,993 Mortgage Banking segment 2,685 2,677 Consumer Finance segment 267,651 279,004 Restricted stocks, at cost 3,443 3,403 Total assets 1,509,056 1,451,992 Deposits 1,171,429 1,119,921 Repurchase agreements 20,621 17,363 Borrowings 147,239 147,204 Shareholders' equity 141,702 139,214\n*Derived from audited consolidated financial statements.\nFor The For The Quarter Ended Year Ended Results of Operations 12/31/2017 12/31/2016 12/31/2017 12/31/2016 (unaudited) (unaudited) * Interest income $ 22,446 $ 22,493 $ 89,593 $ 89,439 Interest expense 2,495 2,256 9,601 8,968 Provision for loan losses: Retail Banking segment - - 200 - Mortgage Banking segment - - - - Consumer Finance segment 4,500 4,915 16,235 18,040 Noninterest income: Gains on sales of loans 1,835 1,539 8,553 8,120 Other 4,743 4,475 18,186 17,507 Noninterest expenses: Salaries and employee benefits 10,636 10,433 43,104 41,925 Other 7,314 7,037 29,226 28,215 Income tax expense 7,394 784 11,394 4,459 Net income (loss) (3,315 ) 3,082 6,572 13,459 Earnings (loss) per common share - assuming dilution (0.95 ) 0.89 1.88 3.89 Earnings (loss) per common share - basic (0.95 ) 0.89 1.89 3.90 Fully-taxable equivalent (FTE) amounts** Interest income on loans-FTE 20,711 20,980 82,789 83,036 Interest income on securities-FTE 1,810 1,888 7,385 7,907 Total interest income-FTE 22,848 22,968 91,302 91,452 Net interest income-FTE 20,353 20,712 81,701 82,484\n* Derived from audited consolidated financial statements.\n**For more information about these non-GAAP financial measures, please see “Use of Certain Non-GAAP Financial Measures” and “Reconciliation of Certain Non-GAAP Financial Measures.”\nFor The For The Quarter Ended Year Ended Segment Information 12/31/2017 12/31/2016 12/31/2017 12/31/2016 (unaudited) (unaudited) * Income (Loss) Before Income Taxes Retail Banking $ 3,049 $ 2,769 $ 10,706 $ 9,635 Mortgage Banking 337 192 2,591 2,808 Consumer Finance 1,085 1,404 6,531 7,419 Other (392 ) (499 ) (1,862 ) (1,944 ) Net Income (Loss) Retail Banking (1,043 ) 2,229 4,979 8,210 Mortgage Banking (373 ) 110 985 1,687 Consumer Finance (958 ) 888 2,333 4,537 Other (941 ) (145 ) (1,725 ) (975 ) Mortgage loan originations - Mortgage Banking 187,950 188,956 744,780 674,317 Mortgage loans sold - Mortgage Banking 181,943 203,618 741,422 666,290\n* Derived from audited consolidated financial statements.\nFor The For The Quarter Ended Year Ended Average Balances 12/31/2017 12/31/2016 12/31/2017 12/31/2016 (unaudited) (unaudited) * Interest-bearing deposits in other banks $ 106,043 $ 85,404 $ 107,629 $ 105,293 Investment securities - available for sale, at amortized cost 212,458 203,407 210,484 206,171 Loans held for sale, at fair value 42,734 50,985 38,621 43,834 Loans: Retail Banking segment 730,185 678,723 707,229 649,885 Mortgage Banking segment 3,300 3,366 3,295 3,456 Consumer Finance segment 292,128 305,243 294,273 297,633 Restricted stocks, at cost 3,443 3,403 3,434 3,372 Total earning assets 1,390,291 1,330,531 1,364,965 1,309,644 Total assets 1,490,537 1,433,382 1,463,139 1,409,067 Time, checking and savings deposits 899,254 882,333 891,541 868,309 Borrowings 166,409 166,242 165,662 170,490 Total interest-bearing liabilities 1,065,663 1,048,575 1,057,203 1,038,799 Demand deposits 250,583 219,767 236,937 210,520 Shareholders' equity 147,022 138,990 143,646 135,906\n* Derived from audited consolidated financial statements.\nAsset Quality 12/31/2017 12/31/2016 (unaudited) * Retail Banking Loans, excluding purchased loans $ 686,605 $ 629,523 Purchased performing loans 1 42,793 53,329 Purchased credit impaired loans 1 3,103 9,256 Total loans $ 732,501 $ 692,108 Nonaccrual loans $ 5,111 $ 4,039 Purchased performing-nonaccrual loans 2 161 196 Total nonaccrual loans 3 5,272 4,235 Other real estate owned (OREO) 4 168 195 Total nonperforming assets 5 $ 5,440 $ 4,430 Accruing loans past due for 90 days or more 6 $ 306 $ 6 Troubled debt restructurings (TDRs), excluding purchased loans 3 $ 9,748 $ 4,964 Purchased performing TDRs 7 1,148 861 Total TDRs 3 $ 10,896 $ 5,825 Allowance for loan losses (ALL) $ 10,775 $ 11,115 Nonperforming assets to loans and OREO 0.74 % 0.64 % ALL to total loans, excluding purchased credit impaired loans 1.48 % 1.63 % ALL to total nonaccrual loans 204.38 % 262.46 % Net charge-offs (recoveries) to average loans 0.08 % (0.02 )% Mortgage Banking Nonaccrual loans $ 39 $ 42 Total Loans $ 3,283 $ 3,275 ALL $ 598 $ 598 Nonperforming loans to total loans 1.19 % 1.28 % ALL to loans 18.22 % 18.26 % Consumer Finance Nonaccrual loans $ 764 $ 1,215 Repossessed automobiles available for sale $ 250 $ 566 Accruing loans past due for 90 days or more $ - $ - Total loans $ 292,004 $ 304,357 ALL $ 24,353 $ 25,353 Nonaccrual loans to total loans 0.26 % 0.40 % ALL to total loans 8 8.34 % 8.33 % Net charge-offs to average total loans 9 5.82 % 5.55 %\n* Derived from audited consolidated financial statements.\n1 The loans acquired from CVB are tracked in two separate categories: “purchased performing” and “purchased credit impaired.” The remaining discount for the purchased performing loans was $2.3 million at 12/31/17 and $2.9 million at 12/31/16. The remaining discount for the purchased credit impaired loans was $9.8 million at 12/31/17 and $10.5 million at 12/31/16.\n2 Purchased performing-nonaccrual loans are presented net of the remaining interest and credit marks totaling $137 thousand at 12/31/17 and $137 thousand at 12/31/16.\n3 Total nonaccrual loans include nonaccrual TDRs of $3.9 million at 12/31/17 and $2.0 million at 12/31/16.\n4 OREO is recorded at its estimated fair value less cost to sell.\n5 As required by acquisition accounting, purchased credit impaired loans that were considered nonaccrual and TDRs prior to the acquisition lose these designations and are not included in post-acquisition nonperforming assets as presented in the Asset Quality section of the Selected Financial Information.\n6 Accruing loans past due for 90 days or more include purchased credit impaired loans of $90 thousand at 12/31/17 and zero at 12/31/16.\n7 Accruing purchased performing TDRs are presented net of the remaining interest and credit marks totaling $18 thousand at 12/31/17 and $11 thousand at 12/31/16.\n8 The consumer finance loan portfolio purchased during the second quarter of 2015 had the effect of decreasing the allowance to total loans ratio by six basis points at 12/31/17 and 14 basis points at 12/31/16.\n9 The consumer finance loan portfolio purchased during the second quarter of 2015 had the effect of increasing the net charge-off ratio by six basis points for the year ended 12/31/17 and 38 basis points for the year ended 12/31/16.\nAs Of and For The As Of and For The Quarter Ended Year Ended Other Data and Ratios 12/31/2017 12/31/2016 12/31/2017 12/31/2016 (unaudited) (unaudited) * Annualized return on average assets (0.89 )% 0.86 % 0.45 % 0.96 % Annualized return on average common equity (9.02 )% 8.87 % 4.58 % 9.90 % Annualized net interest margin 5.87 % 6.20 % 5.99 % 6.30 % Dividends declared per common share $ 0.34 $ 0.33 $ 1.33 $ 1.29 Weighted average common shares outstanding - assuming dilution 3,488,864 3,461,857 3,486,589 3,455,883 Weighted average common shares outstanding - basic 3,488,864 3,459,851 3,486,510 3,454,282 Market value per common share at period end $ 58.00 $ 49.85 $ 58.00 $ 49.85 Book value per common share at period end $ 40.53 $ 40.50 $ 40.53 $ 40.50 Price to book value ratio at period end 1.43 1.23 1.43 1.23 Price to earnings ratio at period end (ttm) 30.69 12.81 30.69 12.81\n* Derived from audited consolidated financial statements.\nMinimum Capital Capital Ratios * 12/31/2017 12/31/2016 Requirements** (unaudited) C&F Financial Corporation Total capital (to risk-weighted assets) 14.4 % 13.9 % 8.0 % Tier 1 capital (to risk-weighted assets) 13.2 % 12.6 % 6.0 % Common equity tier 1 capital (to risk-weighted assets) 11.1 % 10.5 % 4.5 % Tier 1 capital (to average assets) 10.5 % 10.3 % 4.0 % C&F Bank Total capital (to risk-weighted assets) 14.2 % 14.0 % 8.0 % Tier 1 capital (to risk-weighted assets) 13.0 % 12.8 % 6.0 % Common equity tier 1 capital (to risk-weighted assets) 13.0 % 12.8 % 4.5 % Tier 1 capital (to average assets) 10.4 % 10.2 % 4.0 %\n* All ratios at December 31, 2017 are estimates and subject to change pending the Corporation’s filing of its FR Y9-C and C&F Bank’s filing of its Call Report. All ratios at December 31, 2016 are presented as filed.\n** The ratios presented for minimum capital requirements are those to be considered adequately capitalized.\nC&F Financial Corporation\nReconciliation of Certain Non-GAAP Financial Measures\n(in thousands) For The For The Quarter Ended Year Ended (1 ) 12/31/2017 12/31/2016 12/31/2017 12/31/2016 Adjusted Net Income and Earnings Per Common Share (unaudited) (unaudited) Net income (loss), as reported A $ (3,315 ) $ 3,082 $ 6,572 $ 13,459 Net deferred tax asset revaluation adjustment 6,643 - 6,643 - Adjusted net income B $ 3,328 $ 3,082 $ 13,215 $ 13,459 Weighted average common shares - assuming dilution C 3,489 3,462 3,487 3,456 Weighted average common shares - basic D 3,489 3,460 3,486 3,454 Earnings (loss) per share - assuming dilution Earnings (loss) per share - assuming dilution, as reported A/C $ (0.95 ) $ 0.89 $ 1.88 $ 3.89 Adjusted earnings per share - assuming dilution B/C $ 0.95 $ 0.89 $ 3.79 $ 3.89 Earnings (loss) per share - basic Earnings (loss) per share - basic, as reported A/D $ (0.95 ) $ 0.89 $ 1.89 $ 3.90 Adjusted earnings per share - basic B/D $ 0.95 $ 0.89 $ 3.79 $ 3.90 Adjusted Return on Average Equity (ROE) Average shareholders' equity, as reported E $ 147,022 $ 138,990 $ 143,646 $ 135,906 Annualized ROE, as reported (A/E)*4 (9.02 )% 8.87 % ROE, as reported (A/E) 4.58 % 9.90 % Adjusted annualized ROE (B/E)*4 9.05 % 8.87 % Adjusted ROE (B/E) 9.20 % 9.90 % Adjusted Return on Average Assets (ROA) Average assets, as reported F $ 1,490,537 $ 1,433,382 $ 1,463,139 $ 1,409,067 Annualized ROA, as reported (A/F)*4 (0.89 )% 0.86 % ROA, as reported (A/F) 0.45 % 0.96 % Adjusted annualized ROA (B/F)*4 0.89 % 0.86 % Adjusted ROA (B/F) 0.90 % 0.96 % Fully Taxable Equivalent Net Interest Income (2) Interest income on loans $ 20,698 $ 20,964 $ 82,734 $ 82,951 FTE adjustment 13 16 55 85 FTE interest income on loans $ 20,711 $ 20,980 $ 82,789 $ 83,036 Interest income on securities $ 1,421 $ 1,429 $ 5,731 $ 5,979 FTE adjustment 389 459 1,654 1,928 FTE interest income on securities $ 1,810 $ 1,888 $ 7,385 $ 7,907 Total interest income $ 22,446 $ 22,493 $ 89,593 $ 89,439 FTE adjustment 402 475 1,709 2,013 FTE interest income $ 22,848 $ 22,968 $ 91,302 $ 91,452 Net interest income $ 19,951 $ 20,237 $ 79,992 $ 80,471 FTE adjustment 402 475 1,709 2,013 FTE net interest income $ 20,353 $ 20,712 $ 81,701 $ 82,484", "external_links": ["https://www.globenewswire.com/Tracker?data=6EJ6JPxsHXpOtfjE0Tqq2qVHK9jrGpXn6N7x9T-bdhbq55ffaplnh032hM6E_QKRBNrQ1JtJQPQOX01DINEaNw=="], "published": "2018-01-25T23:30:00.000+02:00", "crawled": "2018-01-26T02:58:51.010+02:00", "highlightTitle": ""}