{"organizations": [], "uuid": "17798395f43af307791b7f470b9fe849824b3926", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-austria-jewish-farright/austrias-jews-boycott-holocaust-commemoration-over-rise-of-far-right-idUSKBN1FE0LI", "country": "US", "domain_rank": 408, "title": "Austria's Jews boycott Holocaust commemoration over rise of far right", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T09:08:00.000+02:00", "replies_count": 0, "uuid": "17798395f43af307791b7f470b9fe849824b3926"}, "author": "", "url": "https://www.reuters.com/article/us-austria-jewish-farright/austrias-jews-boycott-holocaust-commemoration-over-rise-of-far-right-idUSKBN1FE0LI", "ord_in_thread": 0, "title": "Austria's Jews boycott Holocaust commemoration over rise of far right", "locations": [], "entities": {"persons": [{"name": "kurz", "sentiment": "none"}, {"name": "sebastian kurz", "sentiment": "none"}, {"name": "oskar deutsch", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "freedom party", "sentiment": "none"}, {"name": "ikg", "sentiment": "none"}, {"name": "interior", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "orf radio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VIENNA (Reuters) - Austria’s main Jewish body (IKG) will boycott a parliamentary Holocaust commemoration event because of the rise of the far-right Freedom Party (FPO) which entered government last month, the IKG’s chief said on Thursday.\nThe Freedom Party, junior coalition partner to Sebastian Kurz’s conservatives, was founded by former Nazis and has repeatedly excluded members in Nazi scandals. It says it has left its Nazi past behind.\nKurz has vowed to focus on fighting anti-Semitism after Israel said it would not have direct contact with Freedom Party officials although the Foreign, Interior and Defence Ministers all entered cabinet on the far right ticket.\n“We do not want anything to do with such people and we do not want to commemorate the people who died in the Shoah (Nazi holocaust) with such people,” IKG chief Oskar Deutsch said on ORF radio.\n“One should think about what kind of people are sitting in a government and what kind of people get voted into a parliament.”\nThe Freedom Party gained third place with 26 percent of votes in parliamentary elections in October.\nThe conservative president of parliament, Wolfgang Sobotka, said he could understand the IKG’s behavior but also felt it was “a pity that some people are not coming.”\nEarlier this month, Interior Minister Herbert Kickl of the FPO said asylum seekers should be “concentrated” in special centers to help the authorities process their applications swiftly.\nFor many observers, Kickl’s wording evoked Nazi-era concentration camps, where Nazis held and killed millions of Jews, political dissenters, disabled people, Roma and Sinti during World War Two.\nNazi Germany annexed Austria, where Adolf Hitler was born, in 1938.\nThis week, the FPO’s top candidate in elections in the province of Lower Austria, Udo Landbauer, suspended his membership in a student fraternity he helped lead when it emerged the group distributed song books with Nazi content.\nLandbauer said the judiciary had to deal with the case, but added the book in question had been produced when he was 11 years old, meaning he could not be held responsible for it.\n“If you read Hitler’s Mein Kampf, for example, you also cannot say you did not know about it,” Deutsch said of Landbauer, calling for his resignation.\nAustrian President Alexander Van der Bellen told ORF radio he was stunned about the Nazi songs in the publication and that all members of the fraternity must have known about them.\nReporting By Shadia Nasralla\n ", "external_links": [], "published": "2018-01-25T09:08:00.000+02:00", "crawled": "2018-01-25T09:15:58.036+02:00", "highlightTitle": ""}