{"organizations": [], "uuid": "70a6296a1ac091c5f91b187194d994ef1c386a8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226617710&w=1200&r=LYNXMPEE0T0ZF", "site_section": "http://feeds.reuters.com/reuters/INformulaOne\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/uk-britain-eu/britain-will-be-worse-off-in-every-brexit-scenario-government-analysis-says-buzzfeed-idINKBN1FI2U0", "country": "US", "domain_rank": 408, "title": "Britain worse off in three Brexit scenarios, leaked analysis says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:56:00.000+02:00", "replies_count": 0, "uuid": "70a6296a1ac091c5f91b187194d994ef1c386a8d"}, "author": "", "url": "https://in.reuters.com/article/uk-britain-eu/britain-will-be-worse-off-in-every-brexit-scenario-government-analysis-says-buzzfeed-idINKBN1FI2U0", "ord_in_thread": 0, "title": "Britain worse off in three Brexit scenarios, leaked analysis says", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "steve baker", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Britain’s economy will be worse off after Brexit whether it leaves the EU with a free trade deal, single market access, or with no deal at all, according to leaked analysis that fed the view that the government is badly prepared.\nThe “EU Exit Analysis - Cross Whitehall Briefing”, dated January 2018, is another blow for Prime Minister Theresa May, under fire for lacking leadership and a clear Brexit strategy as she negotiates Britain’s departure from the bloc.\nA spokesman for the prime minister said the paper leaked to BuzzFeed News was only an initial assessment that had not considered the government’s preferred goal of a bespoke future relationship with the EU after leaving.\nThe spokesman said the “partial” work had been completed by the Brexit ministry. But a junior minister from the department, Steve Baker, rebuffed calls for the government to release its full impact report by saying it was not ready and for lawmakers to be cautious because such analysis had been proved wrong.\n“It is there to test ideas,” Baker told parliament.\nBut as the government tried to distance itself from the paper by qualifying that it was only part of a wide-ranging and evolving analysis of Brexit, opposition lawmakers, and some even in the ruling Conservative Party, said enough was enough.\n“It is the right of the public to know about their livelihoods and their future and for the government not to publish this is deeply irresponsible and dishonest,” said Chris Leslie, an EU campaigner from the opposition Labour Party.\n“This is a cover up ... pure and simple, and it stinks.”\nAnti-Brexit demonstrators wave EU and Union flags outside the Houses of Parliament in London, Britain, January 30, 2018. REUTERS/Toby Melville DEEPLY DIVIDED The leaked paper again deepened divisions in parliament over Brexit, with Leave campaigners accusing EU supporters of trying to undermine the government in its negotiations to unravel more than 40 years of union with the EU.\nMay has been at the centre of a struggle for influence over the shape of Britain’s future relationship with the EU, with the prime minister’s desire for a bespoke relationship that will include lucrative financial services challenged by EU officials.\nSlideshow (2 Images) The reported analysis suggested that if Britain agreed a comprehensive free-trade agreement with the EU, growth over the next 15 years would be 5 percent lower than current forecasts.\nUnder a no-deal situation in which Britain returns to World Trade Organization rules, the United Kingdom’s growth will be reduced by 8 percent over the same period.\nIf May can negotiate continued access to the single market through membership in the European Economic Area, long-term growth will be 2 percent lower, the analysis showed.\nRelated Coverage Leaked Brexit analysis only 'initial' work - UK PM's spokesman Leaked Brexit analysis is 'selective interpretation' of research - minister Every sector of the economy would be negatively affected in all three scenarios, with chemicals, clothing, manufacturing, food and drink, and cars and retail the hardest hit.\nBrexit campaigners questioned the veracity of the forecasts, employing the same arguments during the referendum campaign in 2016 when they dubbed predictions of economic collapse if Britain left the bloc “project fear”.\n“It’s simply wrong,” said Jacob Rees-Mogg, a Conservative lawmaker and supporter of a clean break with the EU.\nReporting by Kanishka Singh in Bengaluru, Guy Faulconbridge, Elizabeth Piper, Andrew MacAskill, Kate Holton and Elisabeth O'Leary in London; Editing by Hugh Lawson, William Maclean\n ", "external_links": [], "published": "2018-01-30T15:56:00.000+02:00", "crawled": "2018-01-30T16:23:40.033+02:00", "highlightTitle": ""}