{"organizations": [], "uuid": "86cd18fcbbf5d48ae7766dad5c163093a30a3fa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-shareholder-group-nominates-slate-of-four-highly-qualified-director-candidates-for-election-to-aegean-marine-petroleum.html", "country": "US", "domain_rank": 767, "title": "Shareholder Group Nominates Slate of Four Highly Qualified Director Candidates for Election to Aegean Marine Petroleum Network's Board at 2018 Annual Meeting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T20:32:00.000+02:00", "replies_count": 0, "uuid": "86cd18fcbbf5d48ae7766dad5c163093a30a3fa5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-shareholder-group-nominates-slate-of-four-highly-qualified-director-candidates-for-election-to-aegean-marine-petroleum.html", "ord_in_thread": 0, "title": "Shareholder Group Nominates Slate of Four Highly Qualified Director Candidates for Election to Aegean Marine Petroleum Network's Board at 2018 Annual Meeting", "locations": [], "entities": {"persons": [{"name": "tyler baron", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "committee for aegean accountability", "sentiment": "neutral"}, {"name": "aegean marine petroleum network's board", "sentiment": "neutral"}, {"name": "board", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}, {"name": "aegean marine petroleum network, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 31, 2018 /PRNewswire/ -- The Committee for Aegean Accountability (the \"Committee\"), a group of shareholders collectively owning more than 12% of the outstanding shares of Aegean Marine Petroleum Network, Inc. (\"Aegean\" or, the \"Company\") (NYSE: ANW), announced today that it has formally nominated four highly qualified independent candidates for election to the Company's Board of Directors (the \"Board\") at the upcoming 2018 annual meeting of shareholders.\nTyler Baron issued the following statement on behalf of the Committee:\n\"As the Committee highlighted in its open letter to the Board dated December 20, 2017, the present state of corporate governance at the Company is untenable and change is desperately needed. The current members of the Board have presided over a dramatic erosion of shareholder value – a 58% decline in the share price over the past year and a 71% decline since the Company's IPO eleven years ago. There are also significant concerns over the Board's independence and accountability; of the four seated directors, three were appointed by the founder at the time of the IPO or shortly thereafter. Furthermore, despite the founder no longer owning any interest in the Company, we believe he retains significant influence over its activities. These concerns are exacerbated by historical and ongoing related party transactions with entities controlled by the founder. The need for direct and independent shareholder representation on the Board is crucial to restore a corporate governance structure that is aligned with the interests of all shareholders.\"\nThe Committee sees significant value in Aegean's fuel distribution network and the assets that support it, and believes the optionality and strategic importance of this network will grow as the industry approaches the significant changes brought by IMO 2020 regulations less than two years away. The Committee estimates the Company's quick-turning net working capital balance alone, less associated debt, amounts to more than $330MM of equity value. In addition, the fleet of modern vessels and the Fujairah storage terminal have a combined book value of more than $310MM. After deducting outstanding bonds net of cash, the book value of just the Company's three principal assets is approximately $12 per share. Furthermore, using average EBITDA over the past four years and deducting current cash interest expense, capital expenditures, and taxes, the Company would generate approximately $1.50 per share in annual operational free cash flow. Yet the Company trades at deeply discounted multiples relative to both its net asset value and operational free cash flow due to persistent concerns about corporate governance, conflicts of interest and management competence.\nWhile the potential for operational improvement and value creation at Aegean is substantial, there is much work to be done and value will only be unlocked by implementing and successfully executing against a long-term strategic plan. The Committee believes fresh Board members with areas of expertise well-suited to the challenges and opportunities facing the Company are required to formulate and oversee the execution of this plan.\nFor the past nine months members of the Committee have pursued a private and constructive dialogue with the aim of upgrading corporate governance, enhancing the existing Board, and improving the financial performance of the Company. Unfortunately, the response from the Board has ranged from indifference to entrenchment. Accordingly, the Committee has today formally nominated four highly qualified candidates for election at the Company's 2018 annual meeting of shareholders.\nAs can be seen from the detailed biographies that follow, this group of impressive candidates possesses complementary skillsets and expertise including global marine fuel market knowledge, operations, corporate finance, restructuring, corporate governance, capital markets, and strategy. Importantly, these nominees, if elected, will work with the singular focus of best representing the interests of all shareholders.\nThe Committee's nominees include:\nRaymond Bartoszek\nMr. Bartoszek has over 20 years of experience as an oil trader specializing in the supply of marine bunker fuels to global shipping companies, first at Texaco and then at Glencore Ltd. While at Glencore Ltd. he held a number of senior management positions including Managing Director and head of its oil department where he managed a global team and portfolio of assets. Mr. Bartoszek was one of the firm's directors leading up to the successful IPO in 2011. Following his time at Glencore, Mr. Bartoszek started a family office called RLB Holdings. He currently serves on the board of several private companies, and is a Limited Partner of the New York Yankees. He is also the Managing Partner of Horseheads Sand and Transloading Terminal, an energy terminal that supplies well operations in the Marcellus Shale. Mr. Bartoszek holds a M.B.A. with a focus in International Business from Rensselaer Polytechnic Institute and a Dual-Major B.S. degree from the U.S. Merchant Marine Academy.\nDonald Moore\nMr. Moore has over 40 years of experience in the financial services industry at Morgan Stanley, most recently as Chairman of Morgan Stanley Group (Europe) from 2000-2016 and as Global Chairman of the Financial Institutions Group from 2013-2016. He has been involved in over 500 billion euros ($552 billion) worth of transactions throughout Europe working closely with governments, institutions and corporations on strategic issues, including mergers, acquisitions, divestitures, restructurings and equity financings. Prior to moving to Europe in 1997, Mr. Moore worked on over 120 transactions spanning 22 years in New York, including most of the landmark banking transactions such as Citicorp on their restructuring and recapitalization in 1990. In 1995 Mr. Moore was appointed by the US Treasury Secretary Robert Rubin to serve on the US Treasury Advisory Council on Financial Institutions. Mr. Moore has served as a trustee and board member of a number of organizations including, Carnegie Hall, the National Gallery (London), the London Symphony Orchestra, and currently serves as the Chairman of the Institute of Contemporary Arts (London). Mr. Moore attended the London School of Economics and holds a B.A. with Honors from Pomona College and a M.B.A. from Harvard Graduate School of Business Administration.\nDavid Kirshner\nMr. Kirshner has more than 30 years of management experience in the fuels industry, most recently as Chairman and CEO of Axeon Specialty Products LLC, a $1B asphalt and specialty petroleum products marketing and refining company where he led an extensive operational turnaround from 2014-2017 that resulted in the successful sale of a majority of the business. Previously, Mr. Kirshner was Senior Vice President of Commercial at Tesoro Corporation from 2011-2014 where he managed teams that traded and marketed bunker fuels and was a member of the Executive Committee. Prior to that, Mr. Kirshner was Vice President of Supply, Trading, and Transportation at Hess Corporation where he also focused on the supply and trading of bunker fuels and was a member of the Marketing and Refining Leadership Team. Mr. Kirshner also spent 23 years in the US, Europe and Asia at Mobil Corporation and then ExxonMobil Corporation where he held a number of positions of increasing responsibility in supply, trading, risk management, lubricants and fuels. Mr. Kirshner is dedicated to community-based organizations and has served on the advisory boards of a number of non-profits. Mr. Kirshner received his B.S. degree in Systems Engineering/Industrial Engineering and Operations Research with a minor in Economics from Southern Methodist University.\nTyler Baron\nMr. Baron has more than 15 years of experience in the financial services and investment management industry, and leads the Committee for Aegean Accountability. Since 2012, Mr. Baron has been the Portfolio Manager and Managing Partner of Sentinel Rock Capital, a hedge fund that applies an absolute value oriented strategy across long/short investment opportunities expressed in small and mid-capitalization equities and debt. From 2006-2011 Mr. Baron was a Partner at Spring Point Capital, a $1.5B hedge fund based in San Francisco, initially as an analyst and then managing research for the long portfolio as well as becoming one of the largest equity partners at the firm. Mr. Baron started his investing career in 2003 as an analyst at CBI Capital, a long/short hedge fund based in New York City. In 2001, Mr. Baron joined the restructuring group as an analyst at Peter J. Solomon Company, a boutique investment bank, providing advisory services to debtors and creditor groups undergoing debt restructurings. Mr. Baron attended the University of California at Berkeley and graduated with a Bachelor of Science degree from the Haas School of Business in 2001.\nAbout the Committee for Aegean Accountability\nThe Committee for Aegean Accountability is a group of eight long-term shareholders and director nominees collectively owning more than 12% of the outstanding shares of the Company and seeking to unlock value on behalf of all shareholders through enhanced corporate governance practices and Board refreshment.\nThe Committee, led by Tyler Baron, has retained Olshan Frome Wolosky LLP as its legal advisor in connection with its engagement and discussions with the Company.\nInvestor Contact:\nTyler Baron\nThe Committee for Aegean Accountability\ntbaron@sentinelrockcapital.com\nLegal Contact:\nAndrew M. Freedman\nOlshan Frome Wolosky LLP\nafreedman@olshanlaw.com\nCERTAIN INFORMATION CONCERNING THE PARTICIPANTS\nTyler Baron, together with the other participants named herein (collectively, \"The Committee for Aegean Accountability\"), intends to make a preliminary filing with the Securities and Exchange Commission (\"SEC\") of a proxy statement and an accompanying proxy card to be used to solicit votes for the election of a slate of director nominees at the 2018 annual meeting of stockholders of Aegean Marine Petroleum Network, Inc. (\"Aegean\" or, the \"Company\").\nTHE COMMITTEE FOR AEGEAN ACCOUNTABILITY ADVISES ALL STOCKHOLDERS OF THE COMPANY TO READ THE PROXY STATEMENT AND OTHER PROXY MATERIALS AS THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. SUCH PROXY MATERIALS WILL BE AVAILABLE AT NO CHARGE ON THE SEC'S WEB SITE AT HTTP://WWW.SEC.GOV . IN ADDITION, THE PARTICIPANTS IN THE SOLICITATION WILL PROVIDE COPIES OF THESE MATERIALS WITHOUT CHARGE UPON REQUEST.\nThe participants in the solicitation are Tyler Baron, August Roth, Justin Moore, Shah Capital Management, Himanshu H. Shah, Towle & Co., Joseph E. Towle, Christopher D. Towle, Raymond Bartoszek, David Kirshner and Donald Moore.\nAs of the date hereof, Mr. Baron beneficially owns directly 160,000 shares of ANW common stock, $0.01 par value per share (the \"Common Stock\"), 1,000 shares of which are held in record name. Mr. Roth owns directly 850,000 shares of Common Stock, 1,000 shares of which are held in record name. Mr. J. Moore owns directly 681,095 shares of Common Stock. Shah Capital Management (\"SCM\") beneficially owned 1,009,590 shares. Mr. Shah owns directly 35,594 shares of Common Stock and, as President and Chief Investment Officer of SCM, may be deemed the beneficial owner of the 1,009,590 shares beneficially owned by SCM. Towle & Co. (\"Towle\") beneficially owns 2,040,539 shares of Common Stock. Mr. J. Towle owns directly 58,900 shares of Common Stock and, as the investment manager of Ellwood House Association (\"Ellwood\"), may be deemed the beneficial owner of the 10,100 shares held by Ellwood. Mr. J. Towle, as a partner of Towle, may also be deemed the beneficial owner of the 2,040,539 shares beneficially owned by Towle. Mr. C. Towle owns directly 26,500 shares, including 4,500 shares owned by his spouse. Mr. C. Towle, as general partner of Towle Institutional Partners, LP (\"Towle Partners\"), may be deemed the beneficial owner of the 1,235 shares held by Towle Partners. As a partner of Towle, Mr. C. Towle may also be deemed the beneficial owner of the 2,040,539 shares beneficially owned by Towle.\nMr. Bartoszek owns directly 150,000 shares of Common Stock. Mr. Kirshner owns 3,000 shares of Common Stock. Mr. D. Moore does not own any shares of Common Stock.\nWARNING REGARDING FORWARD LOOKING STATEMENTS\nTHIS PRESS RELEASE CONTAINS FORWARD LOOKING STATEMENTS. FORWARD LOOKING STATEMENTS CAN BE IDENTIFIED BY USE OF WORDS SUCH AS \"OUTLOOK\", \"BELIEVE\", \"INTEND\", \"EXPECT\", \"POTENTIAL\", \"WILL\", \"MAY\", \"SHOULD\", \"ESTIMATE\", \"ANTICIPATE\", AND DERIVATIVES OR NEGATIVES OF SUCH WORDS OR SIMILAR WORDS. FORWARD LOOKING STATEMENTS IN THIS PRESS RELEASE ARE BASED UPON PRESENT BELIEFS OR EXPECTATIONS. HOWEVER, FORWARD LOOKING STATEMENTS AND THEIR IMPLICATIONS ARE NOT GUARANTEED TO OCCUR AND MAY NOT OCCUR AS A RESULT OF VARIOUS RISKS, REASONS AND UNCERTAINTIES. EXCEPT AS REQUIRED BY LAW, THE COMMITTEE AND ITS AFFILIATES AND RELATED PERSONS UNDERTAKE NO OBLIGATION TO UPDATE ANY FORWARD LOOKING STATEMENT, WHETHER AS A RESULT OF NEW INFORMATION, FUTURE DEVELOPMENTS OR OTHERWISE.\nView original content: http://www.prnewswire.com/news-releases/shareholder-group-nominates-slate-of-four-highly-qualified-director-candidates-for-election-to-aegean-marine-petroleum-networks-board-at-2018-annual-meeting-300591285.html\nSOURCE The Committee for Aegean Accountability", "external_links": ["http://www.sec.gov/", "http://www.prnewswire.com/news-releases/shareholder-group-nominates-slate-of-four-highly-qualified-director-candidates-for-election-to-aegean-marine-petroleum-networks-board-at-2018-annual-meeting-300591285.html"], "published": "2018-01-31T20:32:00.000+02:00", "crawled": "2018-01-31T22:53:30.016+02:00", "highlightTitle": ""}