{"organizations": [], "uuid": "36b8399472c729087c287f2f057f60e358a0f9a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/hungary-rates/update-1-hungarian-central-bank-holds-rates-sticks-to-dovish-stance-idUSL8N1PP2XO", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Hungarian central bank holds rates, sticks to dovish stance", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T21:09:00.000+02:00", "replies_count": 0, "uuid": "36b8399472c729087c287f2f057f60e358a0f9a7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/hungary-rates/update-1-hungarian-central-bank-holds-rates-sticks-to-dovish-stance-idUSL8N1PP2XO", "ord_in_thread": 0, "title": "UPDATE 1-Hungarian central bank holds rates, sticks to dovish stance", "locations": [], "entities": {"persons": [{"name": "viktor orban", "sentiment": "none"}, {"name": "gyorgy matolcsy", "sentiment": "none"}], "locations": [{"name": "budapest", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "central europe", "sentiment": "none"}], "organizations": [{"name": "bank", "sentiment": "negative"}, {"name": "national bank of hungary", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Bank leaves base rate at 0.9 pct as expected\n* Overnight deposit and lending rates also unchanged\n* Central bank in easing mode, inflation below target\n* Bucking global tightening trend\nBy Krisztina Than\nBUDAPEST, Jan 30 (Reuters) - Hungary’s central bank left its main interest rates unchanged at record lows on Tuesday as expected, hanging on to its set of unconventional tools aimed at curbing long-term interest rates and pushing down yields.\nThe National Bank of Hungary, Central Europe’s most dovish central bank, has said it would start buying mortgage bonds in 2018. It also launched new interest rate swaps for banks with the aim of curbing yields on longer-dated bonds.\nRun by a strong ally of right-wing Prime Minister Viktor Orban who seeks re-election on April 8, the bank wants to keep borrowing costs low for as long as possible.\nIts governor Gyorgy Matolcsy said earlier in January that the base rate must stay at 0.9 percent and interbank rates around zero for inflation to reach the bank’s 3 percent target by mid-2019 in a sustainable way.\nThe bank is bucking a global trend of raising interest rates, without worrying about inflation, which was running at 2.1 percent in December, well below its target.\n“The central bank has already been very successful in flattening the curve and it will continue to do so using any means possible in order to keep rates low going into the election,” Jan Dehn, Head of Research at Ashmore said in a reply to Reuters questions.\n“The main risk is inflation, either in Hungary or in Europe or both. Inflation would push up core European bond yields and Hungarian bond yields.”\nThe first of the new 5-year and 10-year IRS auctions in mid-January led to a rebound in bond yields in the market because the offered amounts and yield spreads disappointed some investors. This prompted the bank to tweak the IRS.\nHowever, tracking a rise in core market yields and German yields, Hungarian government bond yields - especially on the 5-year and 10-year papers - have been rising for the past week. Yields jumped 7-11 basis points on Monday alone according to the fixing page.\nThe forint traded at 310.50 after the bank’s meeting, a shade weaker from levels of 310.30 before the announcement.\nSome analysts said the currency may weaken if the bank sends a fresh, strong dovish message in its statement at 1400 GMT.\n“We could see a weakening in the forint if the tone of the statement suggests an even looser monetary policy stance, especially in light of increasing signals from the ECB... urging the phasing out of the asset-purchase programme,” said Zoltan Varga, a senior analyst at brokerage Equilor.\nThe decision to keep the base rate at 0.9 percent was in line with analysts’ projection in a Reuters poll. The bank is expected to keep its base rate on hold at least until the end of 2019. (Reporting by Krisztina Than, editing by Andrew Heavens)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T21:09:00.000+02:00", "crawled": "2018-01-31T16:46:55.001+02:00", "highlightTitle": ""}