{"organizations": [], "uuid": "a7e7f21a36e84ef9d23e96cf0bec0ef6c8707198", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218777254&w=1200&r=LYNXMPEE010BJ", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-cricket-ashes/england-desperate-for-consolation-ashes-win-in-sydney-idUKKBN1ER0ML", "country": "US", "domain_rank": 408, "title": "England desperate for consolation Ashes win in Sydney", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T12:10:00.000+02:00", "replies_count": 0, "uuid": "a7e7f21a36e84ef9d23e96cf0bec0ef6c8707198"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-ashes/england-desperate-for-consolation-ashes-win-in-sydney-idUKKBN1ER0ML", "ord_in_thread": 0, "title": "England desperate for consolation Ashes win in Sydney", "locations": [], "entities": {"persons": [{"name": "mark stoneman", "sentiment": "none"}, {"name": "joe root", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "harbour city", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "mcg", "sentiment": "none"}, {"name": "min read  sydney", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 10:09 AM / Updated 9 hours ago England desperate for consolation Ashes win in Sydney Nick Mulvenney 3 Min Read \nSYDNEY (Reuters) - Even with the series beyond them and Ashes already returned to Australia, England will be desperate to back up an encouraging performance in Melbourne and secure a consolation victory in the fifth and final test in Sydney this week. FILE PHOTO - Cricket - Ashes test match - Australia v England - MCG, Melbourne, Australia, December 27, 2017. England's Mark Stoneman walks past Australian players as they celebrate his dismissal during the second day of the fourth Ashes cricket test match. REUTERS/David Gray \nAvoiding a whitewash may not be much to crow about but Joe Root’s party must take a modicum of pride in apparently not disintegrating as the 2013-14 tourists did, an impression which a taste of victory in the Harbour City would confirm. \nGiven the fierce nature of the rivalry, though, Australia will be looking to ruthlessly drive home their advantage with a big win in front of a big crowd at the Sydney Cricket Ground, which is sold out for the first three days. \nAustralia captain Steve Smith’s magnificent century helped save a draw in the Boxing Day test and the hosts are confident he will recover from the stiff back that prevented him from training on Tuesday in time for Thursday’s toss. \nLeft-arm quick Mitchell Starc, who missed the fourth test with a bruised heel, did bowl in the nets and should return to terrorise the English batsmen as he did with his 19 wickets in the first three test victories in Brisbane, Adelaide and Perth. \nIn his absence, Alastair Cook’s double century and the bowling of the experienced seam duo of Stuart Broad and James Anderson gave England the sniff of a win at the Melbourne Cricket Ground only for the weather and Smith to deny them. \n“If we’d won the game, then you’d maybe say there’d be more questions posed to Australia,” opening batsman Mark Stoneman told reporters on Tuesday. \n“It’s given us a lot of confidence moving forward that the things we tried to put in place earlier in the series have come through to a certain degree, but ultimately we want to win a game of cricket on this tour.” \nThe SCG traditionally offers some turn and with slow-bowling all-rounder Moeen Ali out of form, leg-spinner Mason Crane looks set to become the third Englishman to make his test debut in the series. \nAustralia drafted left-arm tweaker Ashton Agar into their squad to give them an option of a twin spin attack with Nathan Lyon but the more likely change to the side will be the return of pace spearhead Starc for Jackson Bird. \n“I know he’s pretty confident he’s going to play,” fellow quick Pat Cummins said of Starc on Tuesday. \n“I haven’t spoken to him but it looked like he was bowling quick, running around and wasn’t limping.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-02T12:10:00.000+02:00", "crawled": "2018-01-02T12:31:54.003+02:00", "highlightTitle": ""}