{"organizations": [], "uuid": "fe6d85fee524de8b58bd4663251d15b7950eddb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219083525&w=1200&r=LYNXMPEE020W4", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-tech-ipo-breakingviews/breakingviews-tech-salad-will-come-with-a-side-of-slaw-in-2018-idUSKBN1ES1DH", "country": "US", "domain_rank": 408, "title": "Tech salad will come with a side of SLAW in 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-04T00:05:00.000+02:00", "replies_count": 0, "uuid": "fe6d85fee524de8b58bd4663251d15b7950eddb8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tech-ipo-breakingviews/breakingviews-tech-salad-will-come-with-a-side-of-slaw-in-2018-idUSKBN1ES1DH", "ord_in_thread": 0, "title": "Tech salad will come with a side of SLAW in 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "baidu", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "netflix", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "tencent", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}, {"name": "lyft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK Much of the stock market’s recent boom resided in an acronym: FAANG, for Facebook, Apple, Amazon, Netflix and Google, aka Alphabet. As important as they’ve become, investors tired of this trade can look forward in 2018 to a new set of letters to jumble into a more exciting investment thesis. Call it SLAW.\nFour of the most highly valued private companies - Spotify, Lyft, Airbnb and WeWork – are in various stages of preparing to go public. Although none may ever match the scale of a FAANG or a BAT – as China’s Baidu, Alibaba and Tencent are known – they’re uniquely disruptive enterprises whose success, or failure, may determine the future of cities, mobility, work and fun.\nThe FAANG components altered the internet, retailing, communications and entertainment businesses. It’s hard to imagine the next debutantes blossoming into $900 billion Apples, but they operate in areas offering extraordinary potential to snatch market share from incumbents and stimulate new demand for their products.\nTake Lyft. Though second in the United States to Uber in ride hailing, an initial public offering would make it the first pure play for public investors on a future where transportation is sold as a service, not as an automobile. That potential has lured investors, including Google and General Motors, into giving it a $10 billion valuation.\nSimilarly, Airbnb has snagged a $31 billion valuation as the leading home-rental app. Founder Brian Chesky says he’s taking a “get rich slow” approach, but will be ready for an IPO in 2018. That would offer a way to bet on the emerging model for the lodging industry.\nWhat Chesky is doing to hotels, Adam Neumann is doing to office space with WeWork. While it sounds grand to suggest Neumann’s company is redefining the future of work, it was credible enough for SoftBank to shell out $4.4 billion, valuing WeWork at some $20 billion.\nThen there’s Spotify, which has upended the music industry with its streaming service. As if that’s not unruly enough, founder Daniel Ek plans to list Spotify’s shares without an IPO, potentially upsetting Wall Street’s lucrative underwriting cartel.\nThese firms could choose to remain in private hands for another few years. But with investors hankering for ways to capitalize on changes to the way we work, play and travel, the ingredients to make a perfect SLAW will come together nicely in 2018.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-04T00:05:00.000+02:00", "crawled": "2018-01-03T19:32:07.097+02:00", "highlightTitle": ""}