{"organizations": [], "uuid": "84c5c4d52cec0fc8ad0bf686bddda967d8d3083f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221438227&w=1200&r=LYNXMPEE0B0U8", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-men/federer-still-the-man-to-beat-at-melbourne-park-idUSKBN1F11HJ", "country": "US", "domain_rank": 408, "title": "Federer still the man to beat at Melbourne Park", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T14:35:00.000+02:00", "replies_count": 0, "uuid": "84c5c4d52cec0fc8ad0bf686bddda967d8d3083f"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-men/federer-still-the-man-to-beat-at-melbourne-park-idUSKBN1F11HJ", "ord_in_thread": 0, "title": "Federer still the man to beat at Melbourne Park", "locations": [], "entities": {"persons": [{"name": "federer", "sentiment": "negative"}, {"name": "aljaz bedene", "sentiment": "none"}, {"name": "andy murray", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "melbourne park", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - It might be argued that 36-year-old fathers of four have no business winning grand slam titles but try telling that to Roger Federer as the evergreen Swiss bids to claim a record-equalling sixth Australian Open crown in two weeks’ time.\nFederer will saddle up for a 19th time in the main draw at Melbourne Park, looking to frustrate ‘Generation Next’ once again and defend the title he won last year during a stunning comeback from knee surgery.\nNo such queries hang over his fitness this year and if bookmakers are to be believed the other 127 men in the draw will be fighting for the scraps from Federer’s plate.\nOn immediate form, few could argue.\nFederer, seeded second, arrives for a first round match against mid-ranked Slovenian Aljaz Bedene after cruising through an undefeated run at the Hopman Cup.\nHis major rivals, meanwhile, are either carrying injuries or returning from them, or in the case of ‘Big Four’ cohort Andy Murray, ruled out because of them.\nA magical 20th slam might seem a formality for a player who did it all in last year’s tournament with the shortest of run-ups, but on closer inspection, Federer’s path through the draw is far from straightforward.\nDanger lurks at almost every corner, with former Wimbledon finalist Milos Raonic and a resurgent Juan Martin Del Potro, the man who beat Federer for the 2009 U.S. Open title, looming as threats before the quarter-finals.\nYet few would be surprised if the tournament ends in a repeat of last year’s final with Federer up against his great Spanish rival and top seed Rafa Nadal.\nThe pair split the four grand slam trophies between them last year, with Nadal, at 31, finishing the season as the ATP rankings’ oldest world number one.\nFIT AND FIRING Like Federer, Nadal has pared back his playing schedule to prolong his career but the strain still showed when he pulled out of the ATP Tour Finals in November with a knee problem after losing his opening match.\nHe missed warmup events in Abu Dhabi and Brisbane but appeared untroubled in an exhibition match win over Austrian world number five Dominic Thiem at Melbourne Park on Friday.\nIf fit and firing, 2009 champion Nadal will be hard to beat but needs to bring something new to the court if he ends up facing Federer, who won all four of their matches last year.\nThe Melbourne crowds will throw their support behind the two grand slam titans but the younger generation of players probably wish they would just go away.\nYear after year the bright sparks and ‘Next Big Things’ have been denied by the ‘Big Four’ at the slams.\nEven with Murray and Novak Djokovic out of the frame for much of 2017 due to injury, ‘Gen Next’ once again failed to make inroads at the four tournaments that really count.\nMost bookmakers see third seed Grigor Dimitrov as the best chance among them to make a breakthrough in Melbourne, but still rate the Bulgarian lower than Djokovic, who brings a major query over his serving elbow, is seeded 14th and has barely swung a racquet in six months.\nWhile Melbourne Park maestro Djokovic will bid for a record seventh Australian Open title, those fans hoping for a shake-up of the establishment may look to 20-year-old Alexander Zverev after his stellar 2017.\nLike 22-year-old Australian Nick Kyrgios, fourth seed Zverev possesses a majestic game capable of toppling the very best but also has a propensity to crumble on the biggest stages.\nGrand slam success is seen as a matter of when, not if, for Zverev but the ageless Federer stands ready to thwart another youth-led insurrection.\nEditing by Peter Rutherford\n ", "external_links": [], "published": "2018-01-12T14:35:00.000+02:00", "crawled": "2018-01-12T15:03:53.000+02:00", "highlightTitle": ""}