{"organizations": [], "uuid": "57c5081133243500a8182a2356b8d66ed5b27af4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/9", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-comstock-expands-reston-station-neighborhood.html", "country": "US", "domain_rank": 767, "title": "Comstock Expands Reston Station Neighborhood", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-26T00:00:00.000+02:00", "replies_count": 0, "uuid": "57c5081133243500a8182a2356b8d66ed5b27af4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-comstock-expands-reston-station-neighborhood.html", "ord_in_thread": 0, "title": "Comstock Expands Reston Station Neighborhood", "locations": [], "entities": {"persons": [{"name": "bozzuto", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "reston station neighborhood reston", "sentiment": "none"}, {"name": "reston", "sentiment": "none"}, {"name": "reston station", "sentiment": "none"}, {"name": "sunset hills road", "sentiment": "none"}, {"name": "sunset square", "sentiment": "none"}, {"name": "comstock", "sentiment": "none"}, {"name": "fairfax county", "sentiment": "none"}], "organizations": [{"name": "bank of america", "sentiment": "none"}, {"name": "reston station", "sentiment": "none"}, {"name": "linden development", "sentiment": "none"}, {"name": "wiehle reston-east metro station", "sentiment": "none"}, {"name": "linden development group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RESTON, Va., Jan. 25, 2018 /PRNewswire/ -- Reston-based Comstock Companies has increased the footprint of Reston's newest urban neighborhood, Reston Station, with the acquisition of Sunset Square from Linden Development Group. The property, located at the intersection of Sunset Hills Road and Wiehle Ave, was originally developed in the 1970's and is currently home to a Bank of America branch, Linden Development, and various other office, retail and service businesses. The acquisition, coupled with other properties owned or controlled by Comstock-related entities and including Bozzuto's recently completed Aperture@Reston Station, expands the neighborhood to 20+ acres adjacent to the Wiehle Reston-East Metro Station and the 3,500 space parking garage developed and operated through a public-private partnership between Comstock and Fairfax County.\nReston Station, one of the region's largest new mixed-use, transit oriented developments, is already home to just over 500,000 square feet of office space, just under 900 recently completed housing units (including more than 100 dedicated workforce housing units), multiple retail, service, and dining establishments (including openings of Founding Farmers and SweetLeaf scheduled for this spring) and the busiest Metro Station on the Silver Line. Upcoming development planned for the Reston Station neighborhood includes additional office buildings, multiple residential, retail and dining offerings, two hotels and multiple community amenity spaces. The Reston Station neighborhood will be served by an urban grid of streets that will provide pedestrian friendly connectivity stretching from the Oracle complex at Plaza America to the west and the General Dynamics HQ complex currently being developed east of Wiehle Avenue.\nAbout Reston Station\nReston Station, one of the most anticipated mixed-use, transit-oriented developments in the Washington, DC region redefines the urban realm to create the ideal Live, Work & Play environment. Serving as the gateway to the Wiehle Reston-East Metro Station and the terminus of Phase I of Metro's new Silver Line, Reston Station is fast becoming the center of community activity for the Dulles Corridor. Visit www.RestonStation.com\nAbout Comstock\nComstock is a diversified real estate development enterprise with a focus on urban, mixed-use and transit-oriented developments in the Washington, D.C. region. With a stabilized portfolio and development pipeline representing millions of square feet of mixed-use office, retail, residential and hotel spaces located above and around the Metro station facilities emerging in the Dulles Corridor, Comstock is leading the way in the urbanization of one of America's best real estate markets. For more information about Comstock, please visit www.ComstockCompanies.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/comstock-expands-reston-station-neighborhood-300588562.html\nSOURCE Comstock", "external_links": ["http://www.comstockcompanies.com/", "http://www.restonstation.com/", "http://www.prnewswire.com/news-releases/comstock-expands-reston-station-neighborhood-300588562.html"], "published": "2018-01-26T00:00:00.000+02:00", "crawled": "2018-01-26T03:00:12.011+02:00", "highlightTitle": ""}