{"organizations": [], "uuid": "45b4914ca185b2c6d693fe969649bb9d82014c80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/media", "section_title": "Media | Reuters.com", "url": "https://www.reuters.com/article/usa-trump-book/trump-threatens-ex-ally-bannon-with-legal-action-amid-book-fallout-idUSL1N1OZ0IP", "country": "US", "domain_rank": 408, "title": "Trump threatens ex-ally Bannon with legal action amid book fallout", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T22:31:00.000+02:00", "replies_count": 0, "uuid": "45b4914ca185b2c6d693fe969649bb9d82014c80"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-trump-book/trump-threatens-ex-ally-bannon-with-legal-action-amid-book-fallout-idUSL1N1OZ0IP", "ord_in_thread": 0, "title": "Trump threatens ex-ally Bannon with legal action amid book fallout", "locations": [], "entities": {"persons": [{"name": "steve b", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "bannon", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "donald trump jr.", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "jared kushner", "sentiment": "none"}, {"name": "paul manafort", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "trump tower", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "trump white house", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan 4 (Reuters) - U.S. President Donald Trump threatened former chief strategist Steve Bannon with legal action over “defamatory” statements about Trump’s son and son-in-law over a meeting with Russians during the 2016 presidential campaign.\nTrump cut ties with Bannon on Wednesday, saying his former adviser had “lost his mind” in a blistering statement issued after reports of disparaging comments by Bannon in a forthcoming book, “Fire and Fury: Inside the Trump White House” by Michael Wolff.\nIn the book, Bannon described a June 2016 meeting with a group of Russians at Trump Tower in New York as “treasonous” and “unpatriotic.” The meeting, held after the Russians promised damaging information on Democratic presidential candidate Hillary Clinton, was attended by Donald Trump Jr., Trump son-in-law Jared Kushner and Paul Manafort, who was the campaign manager at the time.\nLawyers for the president sent a cease-and-desist letter to Bannon on Wednesday. They said in the letter, seen by Reuters, Bannon had breached an agreement by communicating with Wolff about Trump, his family and the campaign and made disparaging remarks about Trump and his family.\nTrump personal lawyer Charles Harder said in a statement, “Legal action is imminent,” according to media reports.\nIt was not clear if Trump’s lawyers also would pursue legal action against author Wolff, whose book offered a lacerating portrait of an accidental presidency in a dysfunctional White House.\nOn Thursday, the White House said no personal devices, including cell phones, would be allowed in the West Wing beginning next week for security purposes. The moves followed the Bannon split but had been considered for some time.\nTrump had relied heavily on Bannon, chairman of the right-wing Breitbart News website, for advice in the months leading up to his upset victory in the November 2016 election. He then gave Bannon a strategic role in the White House, where he became a divisive figure before being fired in August. Bannon returned to Breitbart and reportedly continued to talk regularly with Trump.\nHe declined to comment to Reuters on Trump’s statement, which also diminished Bannon’s role in the election victory and accused him of leaking to the media.\nTRUMP‘S LINK TO BASE\nBannon helped Trump shape a populist, anti-establishment message and had been the president’s link to his conservative base of support. It was not clear if the split would push Bannon to be even more aggressive in his campaign against the Republican establishment, whether he would now target Trump or would emerge much weaker.\nOn Thursday, Bannon told a caller on Breitbart News radio that “nothing will ever come between us and President Trump and his agenda,” according to CNN.\nThe story that triggered the Trump-Bannon split was an offshoot of the investigation into whether Trump campaign aides colluded with Russia to sway the election to Trump - allegations Trump and Moscow deny.\nAccording to the book, which is due out on Tuesday, Bannon expressed derision about the June 2016 meeting in which a Russian lawyer offered damaging information about Clinton. Bannon also was Quote: d as saying he was sure Trump Jr. would have taken the Russians to meet his father in Trump Tower.\nIn the book, Bannon also said he believed the investigation into possible collusion between the Trump campaign and Moscow will focus on money laundering.\nSpecial counsel Robert Mueller, who leads the Russia investigation, has asked White House officials to preserve records of the Trump Tower meeting, according to a source with knowledge of the request.\nManafort and business associate Rick Gates, another campaign aide, pleaded not guilty in November to federal charges brought by Mueller including conspiracy to launder money.\nManafort sued Mueller on Wednesday, alleging that his investigation exceeds its legal authority. (Reporting by Steve Holland and Jim Oliphant; Writing by Doina Chiacu; Editing by Bill Trott)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T22:31:00.000+02:00", "crawled": "2018-01-04T21:20:03.004+02:00", "highlightTitle": ""}