{"organizations": [], "uuid": "c2628a1882a8e8d1f02e7a0076713302e62245bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-peopleas-bank-of-commerce-reports-35-percent-increase-in-annual-pre-tax-income.html", "country": "US", "domain_rank": 767, "title": "People’s Bank of Commerce Reports 35% Increase in Annual Pre-tax Income", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-24T01:56:00.000+02:00", "replies_count": 0, "uuid": "c2628a1882a8e8d1f02e7a0076713302e62245bc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-peopleas-bank-of-commerce-reports-35-percent-increase-in-annual-pre-tax-income.html", "ord_in_thread": 0, "title": "People’s Bank of Commerce Reports 35% Increase in Annual Pre-tax Income", "locations": [], "entities": {"persons": [], "locations": [{"name": "ore.", "sentiment": "none"}, {"name": "medford", "sentiment": "none"}], "organizations": [{"name": "people’s bank of commerce", "sentiment": "neutral"}, {"name": "tax reform", "sentiment": "none"}, {"name": "steelhead finance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MEDFORD, Ore.--(BUSINESS WIRE)-- People’s Bank of Commerce (OTCBB: PBCO) announced today its financial results for the fourth quarter and full year 2017 operations. The bank reported net income of $2,061,000 or $0.81 per diluted share for the full year 2017, compared to net income of $1,880,000 or $0.81 per diluted share during the same period 2016. Net income for the 4 th quarter of 2017, after the deferred tax asset adjustment explained below, totaled $313,000 or $0.11 per diluted share compared to $520,000 or $0.22 per diluted share for 2016. Excluding the impact of Tax Reform, net income of $2,474,000 increased 32% from the prior year period. Earnings per share increased 20% to $0.97 per diluted share driven in part by the acquisition of Steelhead Finance, which contributed $0.16 per diluted share or $402,000 in net income.\nNet income for the fourth quarter and full year 2017 was impacted by the passage of the Tax Cuts and Jobs Act (Tax Reform) for corporations, resulting in a one-time, non-cash income tax expense of $413,000, needed to adjust deferred tax assets to the new tax rate. Deferred tax assets are an accounting term that refers to a situation where a business has overpaid taxes or taxes are paid in advance. These taxes are eventually returned to the business by applying them to future taxes, and the over-payment is, therefore, an asset for the company. For People’s Bank, the “overpayment” is primarily associated with the calculation of our allowance for loan and lease losses (ALLL) on our financial statements. For financial statement calculations the bank uses a formula to estimate its ALLL expense based on historical performance. For tax accounting, IRS rules requires the bank to base its ALLL expenses on actual losses averaged over a six year period. The difference between the two calculations resulted in an asset that had to be adjusted downward with the reduction in the corporate tax rate.\nHighlights for the quarter and year included:\nNet loans increased $6.4 million or 3.2% during the fourth quarter 2017 and $9.3 million or 4.7% for the entire year. Deposits increased $0.6 million or 0.2% over the past 3 months and increased $26.8 million or 11.2% for the entire year. The bank’s total assets increased $1.4 million during the fourth quarter and increased $36.5 million or 13.7% for the entire year. Net interest income for 2017 totaled $10.8 million dollars compared to $9.7 million in 2016, an 11.1% increase. Non-Interest income totaled $3.2 million in 2017 versus $2.0 million in 2016, a 66.3% increase. This increase was the result of activity from the banks new wholly owned subsidiary, Steelhead Finance, which was purchased 9-1-17 and provided $1.4 million of gross income during that four month period. Non-interest expense totaled $10.3 million in 2017 compared to $8.6 million in 2016, a 20.4% increase. $768 thousand of this increase was the result of the purchase of Steelhead Financial with the balance attributed to the bank. The bank’s year-to-date efficiency ratio was 73.23% in 2017 and 73.25% in 2016. ROAE was 7.18% in 2017, net of the deferred tax asset adjustment and 7.46% in 2016. ROAA was 0.73% in 2017, 0.71% in 2016. EPS was $0.83 in 2017, $0.81 in 2016. The deferred tax accounting issue in 2017 reduced earnings per share by $0.17. No loans were on non-accrual or past due more than 90 days at the end 2017, vs 0.039% at the end of 2016.\nPresident’s Commentary\n“Loan and deposit growth was more modest and in line with industry averages in 2017 than in prior years,” noted Ken Trautman, People’s Bank President and CEO. “A significant amount of previous year’s loan growth was the transfer of existing loans from other banks to People’s Bank, which immediately increases loan totals. During 2017, a large amount of our new loans booked were commercial construction loans that only advance as the project progresses, typically over an 18-month construction period.”\nOn September 1, 2017 People’s Bank acquired Steelhead Finance for 207,472 shares of People’s Bank common stock valued at $12.845 per share and cash. Additionally, a private placement of 38,296 shares of People’s Bank common stock was made at the same stock price to support tangible capital. Mr. Trautman explained “Steelhead Finance is a 35 year old factoring company specializing in the transportation industry. The acquisition of Steelhead Finance added significantly to the growth of our non-interest income, up 66% when compared to the prior year. It also increased our non-interest expense, primarily in salaries, benefits and occupancy, up 20% over the prior year. The net effect of the Steelhead acquisition was $402,000 of additional net income for the bank over four months of operations.”\nProvision for Credit Losses\nSlower loan growth and the continued improvement in credit quality prompted a provision expense of $52,000 in 2017 compared to $366,000 in 2016. At yearend 2017, the allowance for loan and lease losses totaled 1.15% of loans held for investment compared to 1.18% at the end of 2016. Net loan charge offs in 2017 were ($4,978) versus ($12,176) the prior year.\nCapital\nAt December 31, 2017, tangible shareholder’s equity totaled $27.4 million, compared to $26.0 million at December 31, 2016. The bank’s tangible leverage ratio was 9.16% at year-end 2017, compared to 9.8% at December 31, 2016. The completion of the Steelhead acquisition resulted in approximately $3.3 million in goodwill reflected above in the tangible shareholder equity and leverage ratios. Tangible book value per share was $9.98 at December 31, 2017, compared to $11.44 one year earlier.\nAbout People’s Bank of Commerce\nPeople’s Bank of Commerce’s stock trades on the over-the-counter market under the symbol PBCO. Additional information about the Bank is available in the investor section of the bank’s website at: www.peoplesbankofcommerce.com .\nFounded in 1998, People’s Bank of Commerce is the only locally owned and managed community bank in Southern Oregon. People’s Bank of Commerce is a full service bank headquartered in Medford, Oregon with branches in Medford, Ashland, Central Point and Grants Pass.\n\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995:\nThis release includes forward-looking statements intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements generally can be identified by phrases such as People’s Bank or its management \"believes,\" \"expects,\" \"anticipates,\" \"foresees,\" \"forecasts,\" \"estimates\" or other words or phrases of similar import. Similarly, statements herein that describe People’s Bank’s business strategy, outlook, objectives, plans, intentions or goals also are forward-looking statements. All such forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those in forward-looking statements.\nPeople's Bank of Commerce Income Statement (unaudited) Three Months Ended Twelve Months Ended (dollars in thousands) 12/31/2017 9/30/2017 12/31/2016 12/31/2017 12/31/2016 Interest Income Loans 2,678 2,611 2,479 10,367 9,324 Investments 164 182 199 703 811 Federal funds sold and due from banks 62 72 8 175 67 Total interest income 2,904 2,865 2,686 11,245 10,202 Interest Expense Deposits 130 112 102 435 479 Other - - - - - Total interest expense 130 112 102 435 479 Net interest income 2,774 2,753 2,584 10,810 9,723 Provision for credit losses 72 (13 ) 36 52 366 Net Interest Income after provision for credit losses\n2,702 2,766 2,548 10,758 9,357 Non-Interest Income Service charges on deposit accounts 74 71 67 290 275 Mortgage lending income 191 218 247 805 770 Steelhead Finance income 1,072 326 1,398 Gain (loss) on other real estate - 3 - 22 - Other non-interest income 150 196 170 733 908 Total non-interest income 1,487 814 484 3,248 1,953 Non-Interest Expense Bank salary and benefits 1,492 1,325 1,285 5,619 4,900 Steelhead Finance salary and benefits 462 129 591 Premises and fixed assets 419 368 344 1,473 1,317 Other 724 677 613 2,612 2,336 Total non-interest expense 3,097 2,499 2,242 10,295 8,553 Net income before taxes 1,092 1,081 790 3,711 2,757 Income taxes 779 386 270 1,650 877 Net income 313 695 520 2,061 1,880 Basic earnings per share * 0.11 0.28 0.22 0.83 0.81 Diluted earnings per share * 0.11 0.28 0.22 0.81 0.81 Average common shares outstanding * 2,725,925 2,501,493 2,392,975 2,475,200 2,325,678 Performance Measures Return on average assets 0.41 % 0.95 % 0.78 % 0.73 % 0.71 % Return on average equity 3.87 % 9.65 % 8.13 % 7.18 % 7.46 % Net interest margin 4.12 % 4.12 % 4.00 % 4.22 % 3.97 % Efficiency ratio 72.68 % 70.06 % 73.08 % 73.23 % 73.25 % * adjusted for 5% stock dividend May 2016, May 2017 People's Bank of Commerce Balance Sheet (unaudited) (dollars in thousands) 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 Assets Cash and due from banks 14,046 13,133 11,713 10,181 13,091 Federal funds sold - Interest-bearing deposits 8,209 22,377 14,164 11,067 1,585 Investment securities 28,538 27,436 31,315 29,883 33,181 Loans held for sale 2,191 742 2,295 1,603 294 Loans held for investment, net of unearned income\n208,657 202,165 202,891 199,990 199,337 Allowance for loan and lease losses (2,400) (2,327) (2,339) (2,300) (2,342) Loans, net 206,257 199,838 200,552 197,690 196,995 Premises and equipment, net 12,196 10,965 7,432 7,088 6,970 Other assets 31,004 26,601 13,947 13,966 13,783 Total assets 302,441 301,092 281,418 271,478 265,899 Liabilities Deposits Demand noninterest-bearing 118,948 117,755 113,979 106,171 97,208 Demand interest-bearing 26,218 25,717 23,882 22,858 24,643 Money market and savings 101,141 101,925 97,656 97,137 98,838 Time deposits of less than $100,000 16,555 17,087 8,406 8,501 8,428 Time deposits of more than $100,000 2,060 1,803 8,131 8,224 9,020 Total deposits 264,922 264,287 252,054 242,891 238,137 Other liabilities 6,103 5,093 2,208 1,986 1,683 Total liabilities 271,025 269,380 254,262 244,877 239,820 Shareholders' Equity Common stock, surplus, retained earnings 31,472 31,671 27,067 26,578 26,050 Accumulated other comprehensive income (loss)\n(56) 41 89 23 29 Total shareholders' equity 31,416 31,712 27,156 26,601 26,079 Total Liabilities and Equity 302,441 301,092 281,418 271,478 265,899\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006600/en/\nPeople’s Bank of Commerce\nKen Trautman, 541-774-7654\nPresident and CEO\nkent@peoplesbankofcommerce.com\nSource: People’s Bank of Commerce", "external_links": ["http://www.businesswire.com/news/home/20180123006600/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.peoplesbankofcommerce.com&esheet=51747873&newsitemid=20180123006600&lan=en-US&anchor=www.peoplesbankofcommerce.com&index=1&md5=624db9af91672395c41b5197e5f78760"], "published": "2018-01-24T01:56:00.000+02:00", "crawled": "2018-01-24T03:27:58.002+02:00", "highlightTitle": ""}