{"organizations": [], "uuid": "1a10aa768d5bc5553cd859ab764374ae76d34c95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-dana-strong-joins-comcast-as-president-consumer-services.html", "country": "US", "domain_rank": 767, "title": "Dana Strong Joins Comcast as President, Consumer Services", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.056, "site_type": "news", "published": "2018-01-26T16:00:00.000+02:00", "replies_count": 0, "uuid": "1a10aa768d5bc5553cd859ab764374ae76d34c95"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-dana-strong-joins-comcast-as-president-consumer-services.html", "ord_in_thread": 0, "title": "Dana Strong Joins Comcast as President, Consumer Services", "locations": [], "entities": {"persons": [{"name": "dana strong president", "sentiment": "negative"}, {"name": "dana strong joins comcast", "sentiment": "negative"}, {"name": "dave watson", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "comcast", "sentiment": "negative"}, {"name": "comcast cable", "sentiment": "none"}, {"name": "liberty global", "sentiment": "none"}, {"name": "virgin media", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA--(BUSINESS WIRE)-- Comcast today announced that it has named Dana Strong President, Consumer Services. Strong will be responsible for the go-to-market strategy of the residential business of Comcast Cable. She will oversee Comcast’s Xfinity brand and products, including its video, broadband, voice, home and mobile products as well as the consumer sales and marketing, digital, Xfinity.com and data intelligence groups that support the strategy and growth of the Consumer business. The current leaders of those business units will remain in their positions and report to her. Strong will report to Dave Watson, President and Chief Executive Officer, Comcast Cable.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180126005275/en/\nDana Strong, President, Consumer Services for Comcast Cable (Photo: Business Wire)\nStrong joins Comcast from Virgin Media, a fully owned subsidiary of Liberty Global, where she serves as President and Chief Operating Officer. At Virgin Media, she is responsible for driving growth and has oversight of the entire customer experience across its Consumer business unit, including its broadband, video and voice businesses. She has also served as Senior Vice President and Chief Transformation Officer of Liberty Global, where she led a global transformation to leverage scale across 27 million customers in 14 countries. Previously, Strong served as Chief Executive Officer of UPC Ireland, now Virgin Media Ireland and as Chief Operating Officer of Austar United Communications in Australia. In these roles, Strong’s leadership has been marked by her ability to grow the business while empowering her teams to improve the customer experience and constantly innovate.\n“Dana has an impressive career and great track record driving growth, digital transformation and improving the customer experience for some of the fastest growing companies in the industry,” said Dave Watson, Comcast Cable President and CEO. “I’m thrilled to welcome her to Comcast and can’t imagine a better leader to partner with me and our talented team as we continue to create the most innovative products available on the market, while driving growth and transforming the customer experience.”\nStrong added, “I am delighted to join Comcast at such an exciting time for the company and our industry. Comcast has built an extraordinary portfolio of products and it’s a privilege to join the team and lead this incredible business.”\nStrong and her family are relocating from London and she will officially begin at Comcast in the first quarter of this year.\nAbout Comcast\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with two primary businesses, Comcast Cable and NBCUniversal. Comcast Cable is one of the nation’s largest video, high-speed internet, and phone providers to residential customers under the XFINITY brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the XFINITY brand. NBCUniversal operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures and Universal Parks and Resorts. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005275/en/\nComcast Corporation\nJennifer Khoury, 215-286-7408\nJennifer_Khoury@comcast.com\nSource: Comcast Corporation", "external_links": ["http://www.businesswire.com/news/home/20180126005275/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.comcastcorporation.com%2F&esheet=51749242&newsitemid=20180126005275&lan=en-US&anchor=www.comcastcorporation.com&index=1&md5=4567de37b15b748791e537ff054d5472"], "published": "2018-01-26T16:00:00.000+02:00", "crawled": "2018-01-26T18:11:14.003+02:00", "highlightTitle": ""}