{"organizations": [], "uuid": "8edac7be158fe182334dca90961f7f5ec1e05ef9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/24/103890151-GettyImages-74280025.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/15/years-of-persistence-led-to-holiday-honoring-king.html", "country": "US", "domain_rank": 767, "title": "Years of persistence led to holiday honoring King", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T13:33:00.000+02:00", "replies_count": 0, "uuid": "8edac7be158fe182334dca90961f7f5ec1e05ef9"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/15/years-of-persistence-led-to-holiday-honoring-king.html", "ord_in_thread": 0, "title": "Years of persistence led to holiday honoring King", "locations": [], "entities": {"persons": [{"name": "adam b", "sentiment": "negative"}, {"name": "katie hall", "sentiment": "neutral"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "junifer hall", "sentiment": "none"}, {"name": "hall", "sentiment": "none"}, {"name": "martin luther king jr.", "sentiment": "none"}], "locations": [{"name": "gary", "sentiment": "none"}, {"name": "mississippi", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "northwest indiana", "sentiment": "none"}, {"name": "ind.", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "katie hall educational foundation", "sentiment": "none"}, {"name": "u.s. house of representatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When the late Rep. Katie Hall (D-Ind.) went to Congress in 1982, it was to finish the term of Adam Benjamin Jr., the Northwest Indiana congressman who had died suddenly of a heart attack.\nBut Hall, the first African American to represent Indiana in Congress, also had another goal: She wanted to add her name to the fight to make Dr. Martin Luther King Jr.'s birthday a federal holiday.\nOn Nov. 2, 1983, President Ronald Reagan signed into law HR3706, the King holiday bill written and introduced by Hall. Beginning in 1986, Martin Luther King Day — the first federal holiday honoring an African American — would be observed on the third Monday in January. King's birthday is Jan. 15.\n\"My mother was grateful for being the instrument God used to honor Dr. King with a national holiday,\" said attorney Junifer Hall, founder and CEO of the Katie Hall Educational Foundation in Gary, Ind. \"As a very poor farm girl growing up in segregated Mississippi in the 1940s and '50s, my mother never dreamed that she would have the chance to serve as a member of the U.S. House of Representatives.\"\nSince that bill signing 35 years ago, the King holiday has evolved. In 1994, President Bill Clinton signed a law designating it a National Day of Service. By 2000, all 50 states recognized it as well. South Carolina and New Hampshire were the last holdouts.\nA rough journey \"When King was assassinated in April 1968, he had become a polarizing figure to the political establishment—and even within activist circles—due to his criticism of U.S. imperialism and specifically the Vietnam War,\" said Karlos Hill, PhD, associate professor of African and African-American Studies at the University of Oklahoma.\n\"King's 'fall from grace' is the primary context for understanding why there was (more than a decade of) resistance to naming a federal holiday in his honor.\"\nMichigan Democratic Rep. John Conyers introduced the first bill for a King holiday in 1968, four days after the civil rights leader was assassinated. The effort languished for years.\nMore from USA Today:\nIran rejects Trump's call to renegotiate terms of nuclear deal\nIn mud-battered Montecito, back-to-back disasters 'overwhelming'\nPresident Trump: 'I am not a racist'\n\"Conyers would persist year after year, Congress after Congress, in introducing the same bill again and again, gathering cosponsors along the way, until his persistence finally paid off . . . when (Reagan) signed the King Holiday bill into law,\" wrote congressional scholar Donald Wolfensberger in his essay, The Martin Luther King Jr. Holiday: The Long Struggle in Congress .\nSupport for the King holiday gained traction in 1979 when Coretta Scott King, King's widow and president of the King Center in Atlanta, testified during several congressional hearings. She urged Conyers to reintroduce his legislation for a vote in the House of Representatives. President Jimmy Carter urged Congress to support the measure, according to Wolfensberger.\nIn 1980 Stevie Wonder got behind the holiday effort, artistically and financially. That summer he released Happy Birthday , which helped galvanize support for a holiday.\nWonder's support \"helped to create a sustained dialogue about the merits of honoring Dr. King's legacy,\" said Hill. The pop star's support made the King holiday \"a cause célèbre.\"\nFamily affair The Martin Luther King National Day of Service was the brainchild of Rep. John Lewis (D-Ga.) and former Sen. Harris Wofford (D-Pa.), close friends of Dr. King's and civil rights leaders in their own right, said Samantha Jo Warfield, spokeswoman for the Corporation for National & Community Service (CNCS). Along with AmeriCorps, Senior Corps and City Year volunteer programs, CNCS oversees the King day of service.\n\"Each year, hundreds of thousands of Americans volunteer on King Day weekend at thousands of service projects in all 50 states (and territories),\" said Warfield. \"One of the greatest aspects of service is that anyone, and everyone, can get involved.\"\nJeff Shafer joined City Year after graduating from Columbia College Chicago in 2009, joining the staff in 2012 and helping to start a City Year program in his hometown of Kansas City, Mo., in 2016.\nHe had found his niche and his passion in admiration for King.\n\"I realized how radical he was in pushing our country forward,\" said Shafer, who read King's writings and studied his nonviolence philosophy. \"At the time people were very critical of him.\"\nIn 2013, Shafer wanted his family to share the joy the King day of service brought him. His older brother, Phil Shafer, is a professional muralist known as Sike Style.\n\"I knew that my older brother had this talent that we could take to the next level,\" Shafer said, adding that his father Douglas Shafer \"has fought for social justice his whole life.\"\nSo Douglas and Phil braved the cold, Chicago weather that year to create a King Day mural project.\nThe project theme: \"Your future is what you make it.\" Fat, white lettering adorned the 30-by-6-foot mural in primary colors. The mural's background is in shades of blue, complemented by blue-and-white pentagonal shapes, white stars and red daisies.\nAfter that first experience, Phil wrote on his website: \"This year I started a new tradition.\"\nOn MLK Day 2018, Douglas Shafer and his sons planned their sixth mural project as a family. Younger brother Davis Shafer added a new twist this year. His company, Vresence Media, donated a virtual, 3-D tour of the mural being created in stages. It can be viewed online at https://www.vresence.co.", "external_links": [], "published": "2018-01-15T13:33:00.000+02:00", "crawled": "2018-01-15T14:21:50.003+02:00", "highlightTitle": ""}