{"organizations": [], "uuid": "26f241715bb77905259c3145b338e81a1cba7148", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/01/22/102361585-20150122-4739-1060.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/cramer-remix-ive-issued-more-mea-culpas-on-ge-than-any-other-stock.html", "country": "US", "domain_rank": 767, "title": "Cramer Remix: I've issued more mea culpas on GE than any other stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.214, "site_type": "news", "published": "2018-01-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "26f241715bb77905259c3145b338e81a1cba7148"}, "author": "Carlos Jasso", "url": "https://www.cnbc.com/2018/01/03/cramer-remix-ive-issued-more-mea-culpas-on-ge-than-any-other-stock.html", "ord_in_thread": 0, "title": "Cramer Remix: I've issued more mea culpas on GE than any other stock", "locations": [], "entities": {"persons": [{"name": "jim cramer cramer", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [{"name": "mindbody", "sentiment": "none"}], "organizations": [{"name": "ge", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mad Money with Jim Cramer Cramer Remix: I've issued more mea culpas on GE than any other stock, but I'm not giving up just yet \"Mad Money\" host Jim Cramer revealed why he hasn't given up on GE yet after a year in the house of pain. Cramer also sat down with the CEO of Mindbody, a cloud-based software company that helps health and wellness businesses run their operations and find customers. In the lightning round, Cramer brushed off the negative commentary about one semiconductor stock. Published 21 Hours Ago SHARES show chapters 20 Hours Ago | 01:08 \nAs much as some market-watchers may discredit the Dow Jones industrial average , the index has always been a trustworthy proxy for stock performance for CNBC's Jim Cramer. \n\"In fact, right now it's more important than it's been in a long time because its snapshot of 2017 gives you a terrific view of the winners and losers in classic big-cap names, with the overall score a very representative plus-25 percent,\" the \" Mad Money \" host said. \nTo get a better snapshot of what worked and what didn't in 2017, Cramer ran through the Dow's best and worst performers . \nFirst and worst of all the Dow components was General Electric , down a staggering 45 percent after a rough 2017. \n\"It takes a special kind of industrial to lose that much value during the best economy in ages,\" Cramer said. \"GE refuses to be introspective about what went wrong. That's a bummer. I certainly hope that new CEO John Flannery explains why the company couldn't earn the $2 this year that it forecast at the end of 2016. If he walks us through it and takes the big write-down we've all been expecting, I think it'll be greeted positively.\" \nFlannery's laundry list of turnaround tasks includes stemming the losses from GE's many struggling divisions and selling assets to pay for the company's dividend. \n\"I can't believe that GE's truly as horrendous as the stock suggests, but I've been wrong all the way down,\" Cramer admitted. \"I'm keeping it on a tight leash for my charitable trust, and I've issued more mea culpas for owning this one for my trust than any other stock the trust has owned in 15 years, but I want to see what Flannery lays out before I decide whether to bail into the newfound buying we've seen over the last couple days.\" \"Baked in?\" Cramer thinks not Carlos Jasso | Reuters \nAfter a year of market chatter about the Republican tax overhaul already being \"baked in\" to the market, Cramer came out in full force against the claim. \nAs the \"Mad Money\" host reviewed Wall Street's latest research on Wednesday, he noticed an unusually high number of analyst upgrades and an unusually low number of downgrades. \nCompared to the typical 10 upgrades and 5 downgrades, Cramer counted 29 upgrades of import and only two downgrades. The common thread? \n\"Tax reform. That's right, the very event that was supposedly baked into the [market], that all the graybeards ... said was being overblown, is proving to be the main reason for most of these positive analyst reports and upgrades,\" Cramer said. \nThe strangest part? The upgrades are actually boosting stocks , Cramer said. Children's Place: Still a buy? Scott Mlyn | CNBC A sign outside The Children's Place store in Irvine, California. \nIt's not often that Cramer gives a positive take on a pure-play retail stock, but on Wednesday, he made an exception for one name that recently caught fire: Children's Place . \nShares of the children's apparel retailer didn't see much action for most of 2017. But in the last 10 weeks of the year, the stock caught fire, flying 44 percent as part of a larger retail comeback. \n\"What's really intriguing is not that the stock vaulted into the stratosphere when retail came back into style on the Wall Street fashion show, it's that the company managed to do so well for so long even when other retailers were struggling,\" Cramer said. \nWith over 1,000 stores in the United States and Canada and another 168 overseas, mostly located in shopping malls, it came as a surprise to Cramer that Children's Place managed to shirk the \"death of the mall\" commentary that plagued retail for much of 2017. Mindbody CEO on making wellness businesses 'durable' Scott Mlyn | CNBC Rick Stollmeyer, CEO, Mindbody \nThe beginning of the year is typically a fruitful time for Mindbody , a cloud-based provider of business management software that serves the health and wellness space. \nThe company helps businesses like spas, wellness centers, fitness studios and gyms — often hubs for New-Year's-resolution-followers — organize their administrative structures and send new customers their way via Mindbody's app. \n\"What it's really about is solving for two problems,\" Rick Stollmeyer, the co-founder, chairman and CEO of Mindbody, told Cramer in a Wednesday interview. \"First of all, there needs to be a robust, continuously growing supply of wellness services. And these businesses are not easy to run.\" \nStollmeyer's wife and nephew both run wellness businesses in partnership with Mindbody, which gave the CEO an intimate look into the complexity of the services they provide. \n\"But once they get the right target audience and once they understand how they're going to deliver their services in a predictable way, they are really quite durable,\" Stollmeyer said. \"And so what we're able to do is give them a business management system that solves their fundamental problems and then connect them to a much larger audience and get more people in the door. Because if you've got 20 spin bikes and you've only filled 15 of them, that last five is lost forever. It's lost income.\" \nThe company's latest venture? Introducing dynamic pricing like Uber's to provide more options to price-sensitive customers. For more, see Stollmeyer's full interview here . An optimistic market Getty Images \nCramer has noticed an interesting trend developing in this bull market when certain stocks get hit with negative news. \n\"Normally, negatives linger or create prolonged sell-offs. In this tape? Bad news is packaged, forgotten, and then the upside games start all over again,\" the \"Mad Money\" host said. \nConsider the case of Wells Fargo , the major bank that fell under scrutiny for enrolling its customers in programs without their knowledge of consent. \nThe debacle, which lasted through much of 2017, culminated in the big bank paying a $185 million fine for the indiscretions, many of which are still being uncovered . \n\"Yet how's the stock doing? It's been blasting through the roof, breaking out above the $60 level after languishing in the $50s for ages. Somehow, Wells Fargo's misdeeds have become more like a minor indiscretion, and all people care about now are Fed rate hikes and how they'll impact Wells Fargo's bottom line,\" Cramer said. Lightning Round: All aboard for AMAT \nIn Cramer's lightning round , he flew through his take on some callers' favorite stocks: \nApplied Materials : \"It sold off because people feel that there's not enough demand now for flash and that DRAMs are going to fall. I say that it's spent enough time in the wilderness and it's OK to buy.\" \nNabors Industries : \"That's the worst one of them, but the chart's good. I guess it can go to $9 if oil goes to $65.\" \nDisclosure: Cramer's charitable trust owns shares of General Electric. \nQuestions for Cramer?", "external_links": [], "published": "2018-01-04T02:00:00.000+02:00", "crawled": "2018-01-04T02:03:38.006+02:00", "highlightTitle": ""}