{"organizations": [], "uuid": "b46086905fe762b18d1d719576d284db95f31820", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220091631&w=1200&r=LYNXMPEE060MP", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-usa-trump/under-fire-bannon-backs-off-explosive-comments-about-trumps-son-idUKKBN1EW0SA", "country": "US", "domain_rank": 408, "title": "Under fire, Bannon backs off explosive comments about Trump's son", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T23:40:00.000+02:00", "replies_count": 0, "uuid": "b46086905fe762b18d1d719576d284db95f31820"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump/under-fire-bannon-backs-off-explosive-comments-about-trumps-son-idUKKBN1EW0SA", "ord_in_thread": 0, "title": "Under fire, Bannon backs off explosive comments about Trump's son", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "bannon", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "donald trump jr.", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "paul manafort", "sentiment": "none"}, {"name": "jeff mason", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "trump white house", "sentiment": "none"}, {"name": "breitbart news", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 6:09 PM / Updated 3 hours ago Under fire, Bannon backs off explosive comments about Trump's son Jeff Mason 4 Min Read \nWASHINGTON (Reuters) - President Donald Trump’s former strategist Steve Bannon on Sunday backed away from derogatory comments ascribed to him about Trump’s son in a new book that sparked White House outrage and could threaten Bannon’s influence as a would-be conservative power broker. \nBannon, ousted from the White House in August, was quoted in “Fire and Fury: Inside the Trump White House,” by journalist Michael Wolff, as saying a June 2016 meeting with a group of Russians attended by Donald Trump Jr. and his father’s top campaign officials was “treasonous” and “unpatriotic.” \nThe president responded by saying Bannon had lost his mind, and the White House suggested the hard-right news site Breitbart News part ways with Bannon as its executive chairman. \nBannon said in a statement released on Sunday that his comments were directed at Paul Manafort, Trump’s former campaign manager, and not aimed at the president’s son. \n“Donald Trump, Jr. is both a patriot and a good man. He has been relentless in his advocacy for his father and the agenda that has helped turn our country around,” the statement said. \n“I regret that my delay in responding to the inaccurate reporting regarding Don Jr. has diverted attention from the president’s historical accomplishments in the first year of his presidency,” Bannon said. \nUproar over the book has dominated news coverage for days, putting the White House on the defensive just as Trump and his advisers sought to plan and bring attention to their policy goals for 2018 ahead of a November congressional election. \nThe former strategist’s statement could be aimed at trying to secure his job at Breitbart, a platform he has used while backing anti-establishment candidates for election to Congress. \nThe book portrays Trump, a former reality TV star who took office nearly a year ago, as mentally unstable and unfit for the demands of his job. Stephen Bannon in Midland City, Alabama, U.S., December 11, 2017. REUTERS/Carlo Allegri \n‘SLOPPY STEVE’ \nTrump said last week that Bannon had nothing to do with him or his presidency. That scathing response left Bannon alienated among the more conservative factions of Trump’s Republican Party. \nBannon said he still supported Trump, whose public break with his one-time strategist and use of a derisive nickname for him, “Sloppy Steve,” reflected the depth of the president’s anger. An employee of Book Culture book store unloads copies of \"Fire and Fury: Inside the Trump White House\" by author Michael Wolff inside the store in New York, U.S. January 5, 2018. REUTERS/Shannon Stapleton \n“My support is also unwavering for the president and his agenda,” Bannon said in Sunday’s statement. “I am the only person to date to conduct a global effort to preach the message of Trump and Trumpism, and I remain ready to stand in the breech for this president’s efforts to make America great again.” \nIn the book, Bannon voiced astonishment over the meeting that Trump Jr., the president’s son-in-law Jared Kushner, and Manafort attended at Trump Tower in New York with a Russian lawyer, who was said to be offering damaging information about former Secretary of State Hillary Clinton, the Democratic presidential candidate. \nBannon was quoted as saying he was certain Trump Jr. would have taken the Russians who took part in the meeting to meet his father. \nBannon did not specifically dispute the quotes, but said his criticism was meant for Manafort, who is being prosecuted by Special Counsel Robert Mueller as part of a probe into Russian meddling in the 2016 U.S. presidential election. \n“My comments were aimed at Paul Manafort, a seasoned campaign professional with experience and knowledge of how the Russians operate. He should have known they are duplicitous, cunning and not our friends,” Bannon said. \nOn CNN’s “State of the Union” on Sunday a senior aide to Trump, Stephen Miller, assailed the book, released on Friday, and launched an attack on news coverage before his TV host, Jake Tapper, urged him to calm down and cut off their interview. \nMiller, a senior policy adviser, said the book was a “grotesque work of fiction” and said it was “tragic and unfortunate” that Bannon made the comments in the book that he did. Reporting by Jeff Mason; Additional reporting by Susan Cornwell; Editing by Howard Goller", "external_links": [], "published": "2018-01-07T23:40:00.000+02:00", "crawled": "2018-01-08T00:06:14.000+02:00", "highlightTitle": ""}