{"organizations": [], "uuid": "7c60eb16b8e4cf4dcf0bc335860871d026fb6a3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223858353&w=1200&r=LYNXMPEE0K0E7", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-yemen-security-budget/yemen-sets-first-budget-since-2014-idUSKBN1FA0IT", "country": "US", "domain_rank": 408, "title": "Yemen sets first budget since 2014", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T14:12:00.000+02:00", "replies_count": 0, "uuid": "7c60eb16b8e4cf4dcf0bc335860871d026fb6a3d"}, "author": "", "url": "https://www.reuters.com/article/us-yemen-security-budget/yemen-sets-first-budget-since-2014-idUSKBN1FA0IT", "ord_in_thread": 0, "title": "Yemen sets first budget since 2014", "locations": [], "entities": {"persons": [{"name": "ahmed bin daghr", "sentiment": "none"}, {"name": "abd-rabbu mansour hadi", "sentiment": "none"}, {"name": "hadi", "sentiment": "none"}], "locations": [{"name": "yemen", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "aden", "sentiment": "none"}, {"name": "sanaa", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "aden", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "central bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 12:13 PM / in 23 minutes Yemen sets first budget since 2014 Reuters Staff 3 Min Read \nADEN (Reuters) - Yemen announced on Sunday its first budget since the country descended into armed conflict in 2014, in a sign the Saudi-backed government seeks to get a handle on a chaotic economy as millions face starvation. \nYemen has been divided by nearly three years of civil war between the internationally recognized government of President Abd-Rabbu Mansour Hadi, backed by northern neighbor Saudi Arabia, and the Iran-aligned Houthis. \nBased in the port city of Aden, Hadi’s government controls the Central Bank there but has struggled to enforce order in the southern and eastern parts of Yemen that it controls or eject the Houthis from lands they run around the capital Sanaa. \nThe conflict has unleashed what the United Nations says is the world’s worst humanitarian crisis, including one of the most deadly cholera epidemics in modern times and economic collapse, which has spread hunger. \nPrime Minister Ahmed bin Daghr told reporters the new budget set total expected revenues in 2018 at 978 billion rials ($2.22 billion) while spending would amount to 1.46 trillion rials ($3.32 billion). \n“It’s an austerity budget. It includes salaries for the military and civilians in 12 provinces,” bin Daghr told journalists in Aden. “Salaries in Houthi-dominated areas will be limited to the education and health sectors,” he said. \nThe government has not paid most public sector salaries in northern areas for over a year, saying the Houthis have put their fighters and appointees on wage rosters - a charge the group denies. \nIt has also struggled to pay troops and other employees even in lands under its own control, as poor security and competing internal political agendas have marred their ability to govern. \nLack of wages and soaring prices have pushed many basic commodities beyond the reach of many Yemenis. \nOil revenues accounted for over two-thirds of Yemen’s last budget, rolled out in Jan. 2014, but the war badly damaged the sector and analysts say exports are down by nearly a quarter. \nAsked how the government planned to cover the deficit or revive the oil sector to increase revenues, bin Daghr said the central bank and finance ministry were studying the issues. \nA $2-billion Saudi deposit into the central bank last week helped stabilize Yemen’s currency, which plunged to new lows of over 500 rials to the dollar but has since recovered to around 440, still down sharply from 215 before the war. Reporting By Mohammed Ghobari; Writing by Noah Browning; Editing by Janet Lawrence", "external_links": [], "published": "2018-01-21T14:12:00.000+02:00", "crawled": "2018-01-21T14:23:39.023+02:00", "highlightTitle": ""}