{"organizations": [], "uuid": "e399e543b6a07f4f36671b1824f8068a12f2ca69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-diplomacy-refugees/top-u-s-diplomat-for-refugees-to-quit-post-email-idUSKBN1F20TZ", "country": "US", "domain_rank": 408, "title": "Top U.S. diplomat for refugees to quit post: email", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T20:54:00.000+02:00", "replies_count": 0, "uuid": "e399e543b6a07f4f36671b1824f8068a12f2ca69"}, "author": "", "url": "https://www.reuters.com/article/us-usa-diplomacy-refugees/top-u-s-diplomat-for-refugees-to-quit-post-email-idUSKBN1F20TZ", "ord_in_thread": 0, "title": "Top U.S. diplomat for refugees to quit post: email", "locations": [], "entities": {"persons": [{"name": "henshaw", "sentiment": "none"}, {"name": "reu", "sentiment": "none"}, {"name": "simon henshaw", "sentiment": "none"}, {"name": "yeganeh torbati", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "foreign service", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bureau of population", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 6:55 PM / Updated an hour ago Top U.S. diplomat for refugees to quit post: email Yeganeh Torbati 3 Min Read \nWASHINGTON (Reuters) - The U.S. diplomat in charge of refugee issues plans to quit his post within days, according to an email seen by Reuters, becoming the third senior U.S. official to leave or be re-assigned from refugee work in recent weeks. \nSimon Henshaw, the acting assistant secretary of the Bureau of Population, Refugees and Migration at the State Department, wrote in an email to colleagues in the refugee sector on Saturday that he will be leaving the job at end of next week. \nHis email said he would remain at the State Department in a different capacity. \nHenshaw, a career Foreign Service officer with three decades of experience at the State Department, did not give details of why he was leaving, except to say that the move came at his request. Henshaw did not immediately respond to a request for comment. \n“After 4 and a half years in the job and a year into the new administration, I thought it time for me to move on,” Henshaw said in the email, which was seen by Reuters. \nHenshaw said the bureau will be run from Jan. 22 onward by Carol O‘Connell, who is the deputy assistant secretary of state for African affairs, according to her State Department biography. \n“In a world where the number of refugees and displaced persons continues to rise, I think we should all be proud (of) the good that we have done and the help that we have provided to so many,” Henshaw wrote. \nThe State Department did not immediately respond to a request for comment on Henshaw’s departure. \nHenshaw is the latest senior U.S. official working on refugee issues to leave their job or be sidelined as the Trump administration reshapes U.S. refugee admissions. \nSince taking office last year, President Donald Trump has slashed the number of refugees allowed into the country, paused the refugee program entirely for four months, instituted stricter vetting requirements, and quit negotiations on a voluntary pact to deal with global migration. \nOn Tuesday, Reuters reported that Lawrence Bartlett, previously the head of the refugee admissions office at the State Department, has been given a temporary re-assignment in the State Department office handling Freedom of Information Act requests. \nEarlier this month, Barbara Strack, chief of the Refugee Affairs Division at U.S. Citizenship and Immigration Services, under the Department of Homeland Security, said she would retire in January. Reporting by Yeganeh Torbati; Editing by Yara Bayoumy and Bill Trott", "external_links": [], "published": "2018-01-13T20:54:00.000+02:00", "crawled": "2018-01-13T21:13:09.020+02:00", "highlightTitle": ""}