{"organizations": [], "uuid": "3ff9b795e04091321c0ea1b4ff122bf6652d1010", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-former-assistant-attorney-general-john-c-cruden-joins-beveridge-diamond.html", "country": "US", "domain_rank": 767, "title": "Former Assistant Attorney General John C. Cruden Joins Beveridge & Diamond", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.045, "site_type": "news", "published": "2018-01-10T08:01:00.000+02:00", "replies_count": 0, "uuid": "3ff9b795e04091321c0ea1b4ff122bf6652d1010"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-former-assistant-attorney-general-john-c-cruden-joins-beveridge-diamond.html", "ord_in_thread": 0, "title": "Former Assistant Attorney General John C. Cruden Joins Beveridge & Diamond", "locations": [], "entities": {"persons": [{"name": "john c. cruden", "sentiment": "negative"}, {"name": "john c. cruden joins beveridge", "sentiment": "negative"}, {"name": "john cruden", "sentiment": "none"}, {"name": "john", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "american college of environmental law", "sentiment": "negative"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "environment and natural resources division", "sentiment": "none"}, {"name": "u.s. department of justice", "sentiment": "none"}, {"name": "beveridge & diamond", "sentiment": "none"}, {"name": "doj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON--(BUSINESS WIRE)-- John C. Cruden, President of the American College of Environmental Lawyers and most recent Assistant Attorney General for the Environment and Natural Resources Division (ENRD) of the U.S. Department of Justice (DOJ), joined Beveridge & Diamond as a Principal in the Firm’s Washington, DC office on January 9, 2018.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180109006729/en/\nFormer Assistant Attorney General John Cruden (Photo: Business Wire)\nJohn will provide firm clients with strategic counsel on high-stakes litigation, civil and criminal enforcement, and compliance matters, informed by his decades of experience as one of the nation’s top government environmental and natural resource lawyers and as a leader of several major environmental bar organizations.\nJohn was confirmed by the U.S. Senate in 2014 as Assistant Attorney General, capping a distinguished career at the DOJ. From 1995 to 2011 he served as Deputy Assistant Attorney General for ENRD, and from 1991 to 1995 he was the Chief of the Environmental Enforcement Section of the ENRD. While at DOJ, he received the Presidential Rank Award from three different U.S. Presidents.\nJohn served as President of the Environmental Law Institute from 2011 to 2014, and is a past President of the District of Columbia Bar Association and a past Chair of the American Bar Association’s Section of Environment, Energy, and Natural Resources. In 2017, John received distinguished awards from the DC Bar, the American Bar Association, and the University of California Berkeley Law School.\nHighlights of John’s DOJ career include:\nEngaging in and supervising numerous regulatory and policy initiatives related to the Clean Air Act, Clean Water Act, TSCA reform, chemicals of concern, Superfund, FIFRA/pesticides, and RCRA/hazardous waste. Supervising all major environmental civil enforcement actions brought by the federal government the past several decades, from Exxon Valdez to Deepwater Horizon. Leading U.S. Delegations to two international conferences, meeting with numerous foreign dignitaries, and coordinating international environmental issues. Serving as co-chair of the President’s Task Force on Illegal Wildlife Trafficking. Personally visiting and meeting with Regional Administrators and career attorneys in all ten EPA regional offices. Promoting government pro bono service. The DC Court’s annual award has been named the “John C. Cruden Award” in recognition of his leadership in this area. Serving as a member of the White House task force on Environmental Justice and promoting that theme inside the Department of Justice.\n“John is one of the country’s preeminent environmental lawyers. We know that our clients will benefit greatly from his wise counsel on litigation, regulatory, compliance, and enforcement matters,” said Ben Wilson, Beveridge & Diamond’s Chairman.\nJohn stated, “Beveridge & Diamond is synonymous with leadership in environmental law and litigation. I have known many of the Firm’s lawyers for years and have always admired the Firm’s focused practice. I look forward to working with the Firm and its clients.”\nJohn is a past member of the Board of the National Conference of Bar Presidents, the Board of the District of Columbia Bar Association, and the Judicial Conference of the District of Columbia Circuit’s Standing Committee on Pro Bono Legal Services.\nJohn’s history of public service extends beyond his time at the DOJ to include a distinguished military career, culminating in his tenure as Chief Legislative Counsel of the U.S. Army. After graduating from the United States Military Academy at West Point, John served in Airborne, Ranger, and Special Forces units in Germany and Vietnam. His subsequent military assignments include as a criminal prosecutor in Germany and civil trial lawyer in the Pentagon; Chief of Litigation Branch, Europe; General Counsel, Defense Nuclear Agency; Staff Judge Advocate in Germany; and Director of Administrative and Civil Law, Judge Advocate General’s School, Charlottesville, Virginia. His military education includes being a Fellow, Army War College, and the Command and General Staff College. His numerous military awards include the Vietnamese Cross of Gallantry with Silver Star, the Legion of Merit, and the Bronze Star. In addition to his B.S. from West Point, John graduated from Santa Clara Law School.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109006729/en/\nBeveridge & Diamond\nCaitlyn Hickman, 202-789-6152\nchickman@bdlaw.com\nSource: Beveridge & Diamond", "external_links": ["http://www.businesswire.com/news/home/20180109006729/en/"], "published": "2018-01-10T08:01:00.000+02:00", "crawled": "2018-01-10T10:36:58.020+02:00", "highlightTitle": ""}