{"organizations": [], "uuid": "41c39b56745fc7088859e6f6f58275783c056332", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-adolescents-greenery-depressio/being-around-natural-greenery-may-cheer-up-even-adolescents-idUSKBN1F72LG", "country": "US", "domain_rank": 408, "title": "Being around natural greenery may cheer up even adolescents", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T20:04:00.000+02:00", "replies_count": 0, "uuid": "41c39b56745fc7088859e6f6f58275783c056332"}, "author": "", "url": "https://www.reuters.com/article/us-health-adolescents-greenery-depressio/being-around-natural-greenery-may-cheer-up-even-adolescents-idUSKBN1F72LG", "ord_in_thread": 0, "title": "Being around natural greenery may cheer up even adolescents", "locations": [], "entities": {"persons": [{"name": "carla bezold", "sentiment": "none"}, {"name": "mary gillis", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "journal of adolescent health", "sentiment": "none"}, {"name": "harvard t.h. chan school of public health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 6:05 PM / Updated 2 hours ago Being around natural greenery may cheer up even adolescents Mary Gillis 5 Min Read \n(Reuters Health) - - Exposure to trees and other greenery has been shown to stave off depression in adults, and a new U.S. study finds the same may be true for teenagers. \nResearchers looked at more than 9,000 kids aged 12 to 18 and found those who lived in areas with lots of natural vegetation nearby were less likely to display high levels of depression symptoms. The effect was strongest among middle schoolers, the study team reports in Journal of Adolescent Health. \n“Prior research has shown that lower exposure to nature is associated with more negative emotional and behavioral outcomes,” lead author Carla Bezold of the Harvard T.H. Chan School of Public Health in Boston said in a telephone interview. \nTo see if this is true during the teen years, the researchers analyzed data on 9,385 adolescents who began participating in 1999 in a large study of health factors affecting U.S. youth. Participants had mental health assessments and also provided information about substance abuse, environmental safety issues and race in an annual questionnaire. \nBezold’s team used geo-coding to identify where the participants lived, and satellite data to examine the areas around their homes to assess building density and proximity to green spaces as well as blue spaces - bodies of water. In addition to how close by green and blue spaces were, researchers measured their amount and quality - large and lush or small and sparse. \nBased on the mental health assessments, the researchers found that 11.5 percent of kids had depression symptoms. They categorized the top 11.5 percent of that group with the highest levels of depression symptoms as having “high depression,” and looked at how nearby green and blue space influenced whether kids fell into that category. \n“We saw that living in an area that was greener was associated with lower depression among this population,” Bezold said, “and that the association persisted using a number of statistical techniques, which gives us confidence that the association is there and so are the benefits.” \nOverall, after adjusting for family and economic factors, researchers found that young people living amid the highest-quality green space were 11 percent less likely than peers with the poorest-quality green space to be in the high depression group. No significant association was found for blue spaces, however. \nThe mechanisms linking nature and mental health are fascinating to say the least and, not surprisingly, an active area of theoretical study, said Kirsten Beyer, a health geographer at the Medical College of Wisconsin in Milwaukee, who wasn’t involved in the study. \n“The attention restoration theory is just one theory. It argues that nature offers an opportunity to relax our directed attention, thus providing relief from mental fatigue,” Beyer told Reuters Health by email. \nAnother possibility is the so-called biophilia hypothesis, she said, which argues that humans have this inherent biological tendency to respond positively to natural environments. \n“There are a number of mechanisms connecting greenness and improved overall health,” Bezold said. “Prior evidence shows that living among higher density vegetation is linked to reduced stress, increased physical activity and improved incidental contact and social interaction between neighbors.” \nUrban planners and public health professionals are talking more and more, Bezold added. “Decisions are now being made . . . as to how best to structure communities in order to optimize health. Design teams have come to understand the importance of having nature in a residential environment because it promotes community health - in more ways than one. It’s about more than just aesthetics.” \nWhat about teenagers living in more urban areas where green space is harder to come by? \n“Interestingly, research has shown that even photographs of nature can have positive benefits,” Beyer said. “Greening indoor environments should not be discounted as a way to protect mental health. Even in the most urban environments, vacant lots, yards, and street trees offer opportunities for adding greenspace to the landscape.” \nSOURCE: bit.ly/2mSpkdr Journal of Adolescent Health, online December 19, 2017. The story was refiled to correct the spelling to Kirsten, from Kristen, in paragraph 9", "external_links": [], "published": "2018-01-18T20:04:00.000+02:00", "crawled": "2018-01-18T20:19:38.013+02:00", "highlightTitle": ""}