{"organizations": [], "uuid": "601c1990b5ad0799f8d5aa5fa900a3136b09f992", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223088834&w=1200&r=LYNXMPEE0H1IJ", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/germany-wages/daimler-bosch-hit-by-walkouts-in-sector-wide-labour-dispute-idINKBN1F72GW", "country": "US", "domain_rank": 408, "title": "Daimler, Bosch hit by walkouts in sector-wide labour dispute", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:21:00.000+02:00", "replies_count": 0, "uuid": "601c1990b5ad0799f8d5aa5fa900a3136b09f992"}, "author": "", "url": "https://in.reuters.com/article/germany-wages/daimler-bosch-hit-by-walkouts-in-sector-wide-labour-dispute-idINKBN1F72GW", "ord_in_thread": 0, "title": "Daimler, Bosch hit by walkouts in sector-wide labour dispute", "locations": [], "entities": {"persons": [{"name": "bosch", "sentiment": "negative"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "daimler", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mercedes", "sentiment": "none"}, {"name": "ig metall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 5:27 PM / Updated 34 minutes ago Daimler, Bosch hit by walkouts in sector-wide labour dispute Reuters Staff 3 Min Read \nFRANKFURT (Reuters) - Some 44,000 German workers at companies including Mercedes maker Daimler and automotive supplier Bosch took part in industrial action on Thursday as powerful labour union IG Metall and employers held regional wage talks. \nCiting robust German economic growth and record low joblessness, IG Metall union is demanding 6 percent more pay for 3.9 million metals and engineering workers across Germany. \nIt has also embarked on its first major campaign for shorter working hours in more than three decades, demanding that workers gain the right to reduce their weekly hours to 28 from 35 to care for children or elderly or sick relatives, and then return to full-time employment after two years. \nEmployers have so far offered a 2 percent pay rise plus a one-off 200-euro ($239) payment in the first quarter. They have rejected demands for a shorter working week unless hours could be increased temporarily so as not to put output at risk. \nThree rounds of regional talks have failed to result in agreement. \nA fourth round begins in the southwestern state of Baden-Wuerttemberg, home to Daimler and sports car maker Porsche, on Jan. 24. Any deal in Baden-Wuerttemberg would typically be applied in other states as well. \nIf the two sides remain at loggerheads, IG Metall’s leadership may decide at a meeting on Jan. 26 to call for 24-hour walkouts or ballot the union’s members for extended strikes. \nMore than half a million workers at hundreds of metals and engineering companies have taken part in industrial action this month to support IG Metall’s wage claim. \nOn Thursday, as talks were held in North Rhine-Westphalia, Germany’s industrial heartland, some 4,000 workers at Daimler near Stuttgart downed their tools, and over 1,000 employees of Bosch in the Bavarian town of Ansbach took action. \nForklift truck maker Jungheinrich, Thyssenkrupp’s System Engineering and elevator businesses and premium carmaker BMW were also among the nearly 200 companies affected. \nSuch industrial action is common in Germany during sector-wide pay negotiations, and similar walkouts took place in 2016 and 2015. Reporting by Maria Sheahan; editing by Mark Heinrich", "external_links": [], "published": "2018-01-18T19:21:00.000+02:00", "crawled": "2018-01-18T19:47:58.020+02:00", "highlightTitle": ""}