{"organizations": [], "uuid": "88f9746f3a324a790767e6253113cc7a9ec9e20f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-free-research-reports-on-these-drug-makers-stocks--abbvie-bristol-myers-squibb-johnson-johnson-and-eli-lilly.html", "country": "US", "domain_rank": 767, "title": "Free Research Reports on These Drug Makers Stocks -- AbbVie, Bristol-Myers Squibb, Johnson & Johnson, and Eli Lilly", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.359, "site_type": "news", "published": "2018-01-25T14:50:00.000+02:00", "replies_count": 0, "uuid": "88f9746f3a324a790767e6253113cc7a9ec9e20f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-free-research-reports-on-these-drug-makers-stocks--abbvie-bristol-myers-squibb-johnson-johnson-and-eli-lilly.html", "ord_in_thread": 0, "title": "Free Research Reports on These Drug Makers Stocks -- AbbVie, Bristol-Myers Squibb, Johnson & Johnson, and Eli Lilly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "eli lilly new york", "sentiment": "negative"}, {"name": "bristol-myers squibb, johnson & johnson", "sentiment": "neutral"}, {"name": "major drug manufacturers", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "eli lilly and co.", "sentiment": "none"}, {"name": "johnson & johnson", "sentiment": "none"}, {"name": "bristol-myers squibb co.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "abbvie inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, January 25, 2018 /PRNewswire/ --\nWallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on ABBV, BMY, JNJ, and LLY which can be accessed for free by signing up to http://www.wallstequities.com/registration . Today, WallStEquities.com turns investors' attention to AbbVie Inc. (NYSE: ABBV), Bristol-Myers Squibb Co. (NYSE: BMY), Johnson & Johnson (NYSE: JNJ), and Eli Lilly and Co. (NYSE: LLY). The bulk of business of companies in the Major Drug Manufacturers industry involves manufacturing and selling pharmaceuticals. All you have to do is sign up today for this free limited time offer by clicking the link below.\nhttp://www.wallstequities.com/registration\nAbbVie\nIllinois-based AbbVie Inc.'s stock finished Wednesday's session 0.12% higher at $105.51 with a total trading volume of 4.34 million shares. Over the last month and the previous three months, the Company's shares have advanced 7.76% and 11.64%, respectively. Additionally, the stock has gained 74.17% over the past year. The Company's shares are trading above their 50-day and 200-day moving averages by 8.00% and 29.99%, respectively. Moreover, shares of AbbVie, which discovers, develops, manufactures, and sells pharmaceutical products worldwide, have a Relative Strength Index (RSI) of 69.11.\nOn January 12 th , 2018, AbbVie announced that it will report its Q4 2017 financial results on January 26 th , 2018, before the market opens. The Company will host a live webcast of the earnings conference call at 9:00 a.m. ET that same day. The webcast will be accessible under the Investor Relations section of the Company's website. Get the full research report on ABBV for free by clicking below at: http://www.wallstequities.com/registration/?symbol=ABBV\nBristol-Myers Squibb\nShares in New York headquartered Bristol-Myers Squibb Co. rose slightly by 0.52%, ending yesterday's session at $63.76. A total volume of 6.48 million shares was traded, which was above their three months average volume of 5.69 million shares. The stock has gained 3.67% in the past month, 0.02% in the previous three months, and 30.23% over the past year. The Company's shares are trading 3.00% above their 50-day moving average and 8.41% above their 200-day moving average. Moreover, shares of Bristol-Myers Squibb, which discovers, develops, licenses, manufactures, markets, and distributes biopharmaceutical products worldwide, have an RSI of 62.10.\nOn January 22 nd , 2018, Bristol-Myers Squibb (BMY) announced that the European Commission (EC) has expanded the indication of Yervoy (ipilimumab) to include treatment of advanced (unresectable or metastatic) melanoma in pediatric patients 12 years of age and older. The EC approval marks BMY's first pediatric indication for an Immuno-Oncology medicine in the European Union (EU) and allows for the marketing of Yervoy for this indication in all 28 Member States of the EU. Find your free research report BMY at: http://www.wallstequities.com/registration/?symbol=BMY\nJohnson & Johnson\nOn Wednesday, New Jersey-based Johnson & Johnson's stock climbed slightly by 0.17%, to close the day at $142.07. A total volume of 12.46 million shares was traded, which was above their three months average volume of 5.73 million shares. The Company's shares have advanced 0.72% in the last month and 27.12% over the past year. The stock is trading 0.58% and 5.92% above its 50-day and 200-day moving averages, respectively. Additionally, shares of the Company have an RSI of 46.86.\nOn January 02 nd , 2018, Johnson & Johnson announced that its Board of Directors has declared a cash dividend of $0.84 per share on the Company's common stock for Q12018. The dividend is payable on March 13 th , 2018, to shareholders of record at the close of business on February 27 th , 2018. The ex-dividend date is February 26 th , 2018.\nOn January 24 th , 2018, research firm Stifel reiterated its 'Hold' rating on the Company's stock with an increase of the target price from $142 a share to $145 a share. Sign up today for the free research report on JNJ at: http://www.wallstequities.com/registration/?symbol=JNJ\nEli Lilly\nShares in Indiana headquartered Eli Lilly and Co. ended the day 0.14% lower at $84.30. A total volume of 5.98 million shares was traded, which was above their three months average volume of 3.34 million shares. The stock has gained 12.63% over the past year. The Company's shares are trading above their 200-day moving average by 1.49%. Furthermore, shares of Eli Lilly have an RSI of 41.87.\nOn January 05 th , 2018, Eli Lilly announced that it will release its Q4 and full-year 2017 financial results on January 31 st , 2018. The Company will also conduct a conference call at 9:00 a.m. ET that day to further detail its financial performance. The live webcast of the conference call can be accessed via a link that will be posted on the Company's website.\nOn January 22 nd , 2018, research firm Credit Suisse downgraded the Company's stock rating from 'Neutral' to 'Underperform'. Wall St. Equities' research coverage also includes the downloadable free report on LLY at: http://www.wallstequities.com/registration/?symbol=LLY\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither WSE nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit\nhttps://wallstequities.com/legal-disclaimer/\nCONTACT\nFor any questions, inquiries, or comments reach out to us directly. If you ' re a company, we are covering and wish to no longer feature on our coverage list contact us via email and/or phone between 09:30 EDT to 16:00 EDT from Monday to Friday at:\nEmail: info@wallstequities.com\nPhone number: +21-32-044-483\nOffice Address: 1 Scotts Road #24-10, Shaw Center Singapore 228\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\nSOURCE Wall St. Equities", "external_links": ["http://www.wallstequities.com/registration/?symbol=LLY", "https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=JNJ", "http://www.wallstequities.com/registration/?symbol=BMY", "http://www.wallstequities.com/registration/?symbol=ABBV", "http://www.wallstequities.com/registration"], "published": "2018-01-25T14:50:00.000+02:00", "crawled": "2018-01-25T14:23:29.000+02:00", "highlightTitle": ""}