{"organizations": [], "uuid": "44475fbeac5a968bea2a201e12c850d9c7bc8398", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221011019&w=1200&r=LYNXMPEE0A07L", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-china-oil-breakingviews/breakingviews-china-is-stuck-in-a-petroleum-catch-22-idUSKBN1F00B3", "country": "US", "domain_rank": 408, "title": "Breakingviews - China is stuck in a petroleum Catch-22", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.321, "site_type": "news", "published": "2018-01-11T11:31:00.000+02:00", "replies_count": 0, "uuid": "44475fbeac5a968bea2a201e12c850d9c7bc8398"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-oil-breakingviews/breakingviews-china-is-stuck-in-a-petroleum-catch-22-idUSKBN1F00B3", "ord_in_thread": 0, "title": "Breakingviews - China is stuck in a petroleum Catch-22", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "reuters breakingviews", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE (Reuters Breakingviews) - China must choose between globalizing its currency and increasing its influence over oil prices. A yuan crude futures contract could finally launch in Shanghai early this year, as China tries to shake up trade dominated by London and New York. A new benchmark is within reach, but a clear-cut market success requires the unthinkable: embracing the dollar.\nChina has long wanted to host a global benchmark. As the world’s top energy importer, it wants more clout in a market worth trillions of dollars. It also wants more international trade overall to be done in renminbi – the currency’s official name. Pricing oil in yuan would advance both goals.\nOn paper, that makes sense. Today’s pricing and trading mechanisms were designed for an era where Asia was not a major energy consumer. Dubai is home to the only liquid crude futures contract in the wider region. This new contract won’t unseat U.S. West Texas Intermediate (WTI) or London’s Brent - the two key dollar-denominated crude derivatives - anytime soon. But that does not rule out a viable benchmark traded on the Shanghai International Energy Exchange (INE), providing an Asian snapshot for buyers and sellers.\nHowever, for that snapshot to be globally influential, Beijing needs foreign majors and trading houses to play along - not just state giants. Without that, Shanghai will stagnate as Russia’s Urals contract has. Chinese regulators have a mixed track record when it comes to dabbling in futures.\nThe INE has taken positive steps. Much of what is known of the contract appears based on international standards. Speculators that roiled other experiments should be kept at bay by a large lot size: 1,000 barrels. It will also be the first commodities futures contract to be accessible to qualified outsiders.\nThat may not be enough. Hedge funds may participate anyway, as will sanctions-hit Russia, but oil majors and heavyweight traders are wary of Beijing’s predilection for market meddling and capital controls. Exchange risk adds to that: many Gulf currencies, for example, are pegged to the dollar.\nThe “petroyuan” simply isn’t ready for big business yet. One solution, however unpalatable for Beijing, would be to price the contract in dollars instead. But here Chinese political imperatives and market forces diverge again, and the former tends to overpower the latter.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-11T11:31:00.000+02:00", "crawled": "2018-01-11T12:40:07.017+02:00", "highlightTitle": ""}