{"organizations": [], "uuid": "c0aedb67d4c9ba3f2307b2e958394a7b2692b7a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223436311&w=1200&r=LYNXMPEE0I1MR", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-davos-meeting-trump/trump-to-tout-u-s-economy-urge-fair-trade-at-elite-davos-forum-idUKKBN1F82KK", "country": "US", "domain_rank": 408, "title": "Trump to tout U.S. economy, urge fair trade at elite Davos forum", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:35:00.000+02:00", "replies_count": 0, "uuid": "c0aedb67d4c9ba3f2307b2e958394a7b2692b7a2"}, "author": "", "url": "https://uk.reuters.com/article/uk-davos-meeting-trump/trump-to-tout-u-s-economy-urge-fair-trade-at-elite-davos-forum-idUKKBN1F82KK", "ord_in_thread": 0, "title": "Trump to tout U.S. economy, urge fair trade at elite Davos forum", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "steve holland", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 8:36 PM / Updated 20 minutes ago Trump to tout U.S. economy, urge fair trade at elite Davos forum Steve Holland 4 Min Read \nWASHINGTON (Reuters) - U.S. President Donald Trump will be entering something of a lion’s den when he visits the elitist enclave of Davos next week, rubbing shoulders with the same “globalists” that he campaigned against in winning the 2016 election. \nAides said some of Trump’s advisers had argued against him attending the World Economic Forum in order to steer clear of the event, which brings together political leaders, CEOs and top bankers. \nBut in the end, they said, Trump, the first sitting U.S. president to attend the forum since Bill Clinton in 2000, wanted to go to call attention to growth in the U.S. economy and the soaring stock market. \nA senior administration official said Trump is expected to take a double-edged message to the forum in Switzerland, where he is to deliver a speech and meet some world leaders. \nIn his speech, Trump is expected to urge the world to invest in the United States to take advantage of his deregulatory and tax cut policies, stress his “America First” agenda and call for fairer, more reciprocal trade, the official said. \nDuring his 2016 election campaign, Trump blamed globalization for ravaging American manufacturing jobs as companies sought to reduce labour costs by relocating to Mexico and elsewhere. \n“Globalization has made the financial elite who donate to politicians very wealthy. But it has left millions of our workers with nothing but poverty and heartache,” he said on June 28, 2016, in Pennsylvania. \nTrump retains the same anti-globalist beliefs but has struggled to rewrite trade deals that he sees as benefiting other countries. \nTrump will be speaking two days after German Chancellor Angela Merkel and French President Emmanuel Macron in Davos. \nBoth ardent defenders of multilateralism and liberal democratic values, they are expected to lay out the counter-argument to Trump’s “America First” policies. Merkel and Macron have lobbied Trump hard to keep the United States in the Paris climate accord and Iran nuclear pact, only for him to distance himself from those deals. \nThere is acute concern in European capitals that 2018 could be the year Trump’s bark on trade turns into bite, as he considers punitive measures on steel and threatens to end the 90s-era North American Free Trade Agreement with Canada and Mexico. \nHe has backed off withdrawing from a U.S. trade agreement with South Korea and while he has threatened to terminate NAFTA, he has yet to do so. \nTrump’s tax cuts are a source of concern in Europe, where policymakers are discussing steps to extract more tax dollars out of U.S. multinationals such as Google and Amazon. European governments now fear a “race to the bottom” on corporate tax rates and a shift to more investment in the United States by some of their big companies. \nIn a Reuters interview on Thursday, Trump lamented that it is rare that he meets the leader of a foreign country that has a trade deficit with the United States. \nBased on official data for the year to November, China exported goods worth $461 billion and the United States ran a trade deficit of $344 billion. Trump said he would be announcing some kind of action against China over trade. He is to discuss the issue during his State of the Union address to the U.S. Congress on Jan. 30. \nAsked about the potential for a trade war with China depending on U.S. action over steel, aluminum and solar panels, Trump said he hoped a trade war would not ensue. \n“I don’t think so, I hope not. But if there is, there is,” he said. \nTrump and the U.S. Congress are racing to meet a midnight Friday deadline to pass a short-term bill to keep the U.S. government open and prevent agencies from shutdown. \nBut if a government shutdown does occur and is prolonged, there is always a chance it could complicate Trump’s plans to go to Davos. Reporting by Steve Holland; Additional reporting by Noah Barkin in Berlin; Editing by Yara Bayoumy and Grant McCool", "external_links": [], "published": "2018-01-19T22:35:00.000+02:00", "crawled": "2018-01-19T23:03:44.019+02:00", "highlightTitle": ""}