{"organizations": [], "uuid": "a7cec3d841f19adc353bafff21bc9000d19da22f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-cabot-microelectronics-corporation-reports-strong-results-including-record-revenue-for-first-quarter-of-fiscal-2018.html", "country": "US", "domain_rank": 767, "title": "Cabot Microelectronics Corporation Reports Strong Results, Including Record Revenue, for First Quarter of Fiscal 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.994, "site_type": "news", "published": "2018-01-25T14:00:00.000+02:00", "replies_count": 0, "uuid": "a7cec3d841f19adc353bafff21bc9000d19da22f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-cabot-microelectronics-corporation-reports-strong-results-including-record-revenue-for-first-quarter-of-fiscal-2018.html", "ord_in_thread": 0, "title": "Cabot Microelectronics Corporation Reports Strong Results, Including Record Revenue, for First Quarter of Fiscal 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "aurora", "sentiment": "none"}], "organizations": [{"name": "cabot microelectronics corporation reports strong results", "sentiment": "negative"}, {"name": "cabot microelectronics corporation", "sentiment": "none"}, {"name": "cmp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Revenue of $140.0 Million, 13.6 Percent Higher Than Last Year GAAP Gross Profit Margin of 52.9 Percent of Revenue; Non-GAAP 53.8 Percent, Up 290 Basis Points Compared to Last Year GAAP Loss Per Share of $0.12 Reflects Impact of Tax Reform; Record Non-GAAP Earnings Per Share of $1.19, Up 29.3 Percent Compared to Last Year Cash Flow From Operations of $30.6 Million\nAURORA, Ill., Jan. 25, 2018 (GLOBE NEWSWIRE) -- Cabot Microelectronics Corporation (Nasdaq:CCMP), the world’s leading supplier of chemical mechanical planarization (CMP) polishing slurries and second largest CMP pads supplier to the semiconductor industry, today reported financial results for its first quarter of fiscal 2018, which ended December 31, 2017.\nTotal revenue during the first fiscal quarter was $140.0 million, 13.6 percent higher than in the same quarter last year, and a record level for the company. This included record quarterly revenue in its tungsten slurry and pads product areas, and significant revenue growth from its dielectrics slurries. Gross profit margin was 52.9 percent of revenue; non-GAAP gross profit margin was 53.8 percent of revenue, excluding amortization expense related to the company’s October 2015 acquisition of NexPlanar Corporation, up 290 basis points compared to last year. The company reported a diluted loss per share of $0.12 due to the impact of the enactment of the Tax Cuts and Jobs Act in December 2017 in the United States (“tax reform”); record non-GAAP diluted earnings per share were $1.19, excluding the one-time impact of tax reform and the amortization expense, representing an increase of 29.3 percent compared to the same quarter last year. Cash flow from operations was $30.6 million.\n“We are pleased with our performance in the first quarter of fiscal 2018, as we achieved another record level of quarterly revenue and very strong operating performance, driven by the continued successful execution of our strategic initiatives and healthy semiconductor industry demand,” said David Li, President and CEO of Cabot Microelectronics. “During the quarter, we continued our momentum from last year in three key product areas – CMP slurries for polishing tungsten, dielectrics slurries, and CMP pads. In particular, we continued to grow with the ramp of our customers’ advanced technologies, including 3D NAND and FinFET, and to deliver our innovative, high-quality CMP solutions across a wide range of other memory and logic applications. As a result, we achieved significant year-over-year growth in each of these three key product areas.”\nMr. Li continued, “Looking ahead, I am confident that we are well-positioned for continued profitable growth. We believe that ongoing effective execution in our key product areas, combined with our focused business model and global resources, capabilities and infrastructure, continue to differentiate us among leading suppliers of specialty materials to the semiconductor industry, and position us well to deliver another year of strong performance.”\nKey Financial Information\nThe company’s record revenue of $140.0 million in the first fiscal quarter represents an increase of 13.6 percent from $123.3 million in the same quarter last year. The company achieved record quarterly revenue in its tungsten slurry and pads product areas, which grew 13.7 percent and 16.5 percent year-over-year, respectively. Revenue from the company’s dielectrics slurry product area grew 8.4 percent.\nGross profit for the quarter was 52.9 percent of revenue, compared to 49.9 percent of revenue reported in the same quarter a year ago. Gross profit this quarter included $1.2 million of NexPlanar amortization expense; excluding this, non-GAAP gross profit was 53.8 percent of revenue, up 290 basis points compared to last year. Factors impacting gross profit this quarter compared to last year include higher sales volume and a higher valued product mix, partially offset by higher fixed manufacturing costs, including higher incentive compensation expense. The company’s full fiscal year GAAP gross profit guidance range of 50 to 52 percent of revenue remains unchanged. This includes approximately 100 basis points of NexPlanar amortization expense.\nOperating expenses, which include research, development and technical, selling and marketing, and general and administrative expenses, were $36.9 million in the first fiscal quarter, including $0.5 million of NexPlanar amortization expense. Operating expenses were $3.5 million higher than the $33.4 million reported in the same quarter a year ago, primarily due to higher staffing related expenses, including costs related to the company’s CFO transition and higher incentive compensation expense. The company currently expects its GAAP operating expenses for the full fiscal year to be between $145 million and $150 million; the prior guidance range was $142 million to $147 million. This includes approximately $2 million of NexPlanar amortization expense.\nOperating income for the first fiscal quarter represented 26.5 percent of revenue, which was 370 basis points higher than in the same quarter last year. The significant year-over-year increase represents operating leverage driven by revenue growth, combined with the company’s ongoing attention to controlling costs.\nThe company’s effective tax rate for the first fiscal quarter was 108.4 percent, compared to 20.3 percent in the same quarter last year. The significant increase is primarily related to tax reform, the one-time impact of which increased the company’s income tax expense by approximately $32.9 million. The company currently expects its effective tax rate for the rest of the fiscal year to be within the range of 21 to 24 percent. Before the enactment of tax reform, the company had estimated 24 to 27 percent for the full fiscal year.\nThe company reported a net loss for the quarter of $3.1 million, or net income of $31.1 million on a non-GAAP basis, excluding the one-time impact of tax reform and the referenced amortization expense. Non-GAAP net income was 33.3 percent higher than in the same quarter last year, and increased primarily due to higher revenue and a higher gross profit margin, partially offset by higher operating expenses.\nThe company reported a diluted loss per share of $0.12 this quarter, or diluted earnings per share of $1.19 on a non-GAAP basis, excluding the one-time impact of tax reform and referenced amortization expense. Non-GAAP diluted earnings per share were 29.3 percent higher than in the first quarter of fiscal 2017.\nCONFERENCE CALL\nCabot Microelectronics Corporation’s quarterly earnings conference call will be held today at 9:00 a.m. Central Time. The conference call will be available via live webcast and replay from the company’s website, www.cabotcmp.com , or by phone at (844) 825-4410. Callers outside the U.S. can dial (973) 638-3236. The conference code for the call is 2284727. A transcript of the formal comments made during the conference call will also be available in the Investor Relations section of the company’s website.\nUSE OF NON-GAAP FINANCIAL INFORMATION\nThe company presented the following measures considered as non-GAAP by the U.S. Securities and Exchange Commission: gross profit margin, net income and diluted earnings per share excluding the one-time effects of the enactment of the Tax Cuts and Jobs Act in December 2017 in the United States (“tax reform”), and amortization expense related to its October 2015 acquisition of NexPlanar Corporation. The non-GAAP financial information provided in this press release is a supplement to, and not a substitute for, the company’s financial results presented in accordance with U.S. GAAP. These non-GAAP financial measures are provided to enhance the investor's understanding about the company's ongoing operations. Specifically, the company believes the one-time impact of tax reform and NexPlanar amortization expenses are not indicative of its core operating results, and thus presents its gross profit margin, net income and diluted earnings per share excluding these effects. The presentation of non-GAAP financial information is not meant to be considered in isolation or as a substitute for results prepared and presented in accordance with U.S. GAAP. A reconciliation table of GAAP to non-GAAP financial measures, including gross profit percentage, net income and diluted earnings per share, is contained in this press release.\nABOUT CABOT MICROELECTRONICS CORPORATION\nCabot Microelectronics Corporation, headquartered in Aurora, Illinois, is the world's leading supplier of CMP polishing slurries and second largest CMP pads supplier to the semiconductor industry. The company’s products play a critical role in the production of advanced semiconductor devices, helping to enable the manufacture of smaller, faster and more complex devices by its customers. The company's mission is to create value by delivering high-performing and innovative solutions that solve its customers’ challenges. The company has approximately 1,150 employees on a global basis. For more information about Cabot Microelectronics Corporation, visit www.cabotcmp.com or contact Trisha Tuntland, Director of Investor Relations at 630-499-2600.\nSAFE HARBOR STATEMENT\nThis news release may include statements that constitute “forward looking statements” within the meaning of federal securities regulations. These forward-looking statements include statements related to: future sales and operating results; growth or contraction, and trends in the industry and markets in which the company participates; the company’s management; various economic or political factors and international or national events; regulatory or legislative activity, including the enactment of the Tax Cuts and Jobs Act in December 2017 in the United States.; product performance; the generation, protection and acquisition of intellectual property, and litigation related to such intellectual property; new product introductions; development of new products, technologies and markets; the company’s supply chain; the financial conditions of the company’s customers; natural disasters; the acquisition of, investment in, or collaboration with other entities; uses and investment of the company’s cash balance, including dividends and share repurchases, which may be suspended, terminated or modified at any time for any reason, based on a variety of factors; financing facilities and related debt, payment of principal and interest, and compliance with covenants and other terms; the company’s capital structure; the company’s current or future tax rate, including the effects of tax reform in the US; and the operation of facilities by Cabot Microelectronics Corporation. These forward-looking statements involve a number of risks, uncertainties, and other factors, including those described from time to time in Cabot Microelectronics’ filings with the SEC, that could cause actual results to differ materially from those described by these forward-looking statements. In particular, see \"Risk Factors\" in the company’s annual report on Form 10-K for the fiscal year ended September 30, 2017, filed with the SEC. Cabot Microelectronics assumes no obligation to update this forward-looking information.\nCABOT MICROELECTRONICS CORPORATION CONSOLIDATED STATEMENTS OF INCOME (LOSS) (Unaudited and amounts in thousands, except per share amounts) Quarter Ended December 31,\n2017 September 30,\n2017 December 31,\n2016 Revenue $ 139,979 $ 136,784 $ 123,254 Cost of goods sold 65,965 66,734 61,749 Gross profit 74,014 70,050 61,505 Operating expenses: Research, development & technical 12,151 13,839 13,396 Selling & marketing 5,836 8,680 7,552 General & administrative 18,915 14,489 12,496 Total operating expenses 36,902 37,008 33,444 Operating income 37,112 33,042 28,061 Interest expense 1,132 1,127 1,150 Other income, net 672 798 996 Income before income taxes 36,652 32,713 27,907 Provision for income taxes 39,735 6,211 5,676 Net income (loss) $ (3,083 ) $ 26,502 $ 22,231 Income (loss) available to common shareholders $ (3,072 ) $ 26,434 $ 22,129 Basic earnings (loss) per share $ (0.12 ) $ 1.05 $ 0.90 Weighted average basic shares outstanding 25,326 25,236 24,583 Diluted earnings (loss) per share $ (0.12 ) $ 1.03 $ 0.88 Weighted average diluted shares outstanding 25,326 25,710 25,072\nCABOT MICROELECTRONICS CORPORATION CONSOLIDATED CONDENSED BALANCE SHEETS (Unaudited and amounts in thousands) December 31, September 30, 2017 2017 ASSETS: Current assets: Cash and cash equivalents $ 377,230 $ 397,890 Short-term available-for-sale securities 48,272 - Accounts receivable, net 69,871 64,793 Inventories, net 73,982 71,873 Other current assets 18,688 16,426 Total current assets 588,043 550,982 Property, plant and equipment, net 107,748 106,361 Other long-term assets 162,208 176,757 Total assets $ 857,999 $ 834,100 LIABILITIES AND STOCKHOLDERS' EQUITY: Current liabilities: Accounts payable $ 14,974 $ 17,624 Current portion of long-term debt 16,406 10,938 Accrued expenses, income taxes payable and other current liabilities 58,720 62,651 Total current liabilities 90,100 91,213 Long-term debt, net of current portion 124,310 132,997 Other long-term liabilities 41,921 14,853 Total liabilities 256,331 239,063 Stockholders' equity 601,668 595,037 Total liabilities and stockholders' equity $ 857,999 $ 834,100 CABOT MICROELECTRONICS CORPORATION\nU.S. GAAP to Non-GAAP Reconciliation\nGross Profit as a Percentage of Revenue, Net Income (Loss) and Diluted Earnings (Loss) Per Share\n(Unaudited and amounts in thousands, except per share and percentage amounts)\nThe following presents reconciliation of the Non-GAAP financial measures included in the Cabot Microelectronics Corporation press release dated January 25, 2018.\nThree Months Ended December 31, 2017 U.S. GAAP Adjustments Non-GAAP Gross profit $ 74,014 $ 1,236 $ 75,250 Gross profit as a percentage of revenue (1) 52.9 % 53.8 % Net income (loss) (2) $ (3,083 ) $ 34,143 $ 31,060 Diluted earnings (loss) per share (3) $ (0.12 ) $ 1.31 $ 1.19\n(1) Non-GAAP gross profit as a percentage of revenue for the three months ended December 31, 2017 excludes $1,236 of NexPlanar amortization expense. (2) Non-GAAP net income for the three months ended December 31, 2017 excludes the item mentioned above in (1) plus $468 of NexPlanar amortization expense recorded in operating expenses and $32,880 of one-time tax expense due to U.S. tax reform enacted on December 22, 2017. These adjustments are partially offset by a $441 increase in the provision for income taxes related to excluding NexPlanar amortization. (3) Non-GAAP diluted earnings per share is calculated based upon Non-GAAP net income. The one-time impact of tax reform reduced diluted earnings per share by $1.26. Trisha Tuntland\nDirector of Investor Relations\n630-499-2600\nCabot Microelectronics Corporation\nSource:Cabot Microelectronics Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=LmPIhPLzxUOW108rfrPC9JFhIKa9oFk4bWs_BJhmzLYDQeh_rwmZROAer9OCb-ZdCatEo6u8Y17ORhex1S-VeQ==", "https://www.globenewswire.com/Tracker?data=LmPIhPLzxUOW108rfrPC9Jnt37XAV7C8n4XxDVqY7wbPXNV2HBFUKu7AtoC4DtbOaceDW9TnzxEugVkbCi4s_g==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/4374ee83-e484-4003-8020-ca03e75d4762"], "published": "2018-01-25T14:00:00.000+02:00", "crawled": "2018-01-25T16:23:31.015+02:00", "highlightTitle": ""}