{"organizations": [], "uuid": "c5ff5936cda1c6f4c81808df4235db7aaaefdce2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-lloyds-ceo-inga-beale-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Lloyd’s CEO, Inga Beale, from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T08:59:00.000+02:00", "replies_count": 0, "uuid": "c5ff5936cda1c6f4c81808df4235db7aaaefdce2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-lloyds-ceo-inga-beale-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Lloyd’s CEO, Inga Beale, from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "akiko fujita", "sentiment": "negative"}, {"name": "inga beale", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "lloyd", "sentiment": "negative"}, {"name": "ib", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Inga Beale, Lloyd's CEO and CNBC's Akiko Fujita from the World Economic Forum 2018.\nAF: Welcome back to Capital Connection, where we are live here in Davos, Switzerland, for the World Economic Forum. Much of the focus going in to the week, of course, President Trump's visit at the very end of the week, but there's also been some discussion here about inclusivity, and also income inequality, how exactly countries should really be measuring the success of their economy. To talk a lot more about that, we're joined by our first guest this morning, Inga Beale, who's CEO of Lloyds. Great to have you on today.\nIB: Great to be here. Morning.\nAF: Yes, so, you know, this discussion here, about what exactly should be the measure of success. You know, right now, there seems to be a lot of optimism among business leaders about where the global economy is going, but all that is often measured in just GDP, not necessarily looking at who's benefiting on the back of this. What do you think should be the measure?\nIB: Well, I'm not sure I've got the answer about the actual measure, but we do probably need to think about things a bit differently, and I do remember, when we were going through the campaigning around Brexit, in the UK, we, as businesses, were talking about GDP. Most of the members of the public don't even know what that means, you know, they-, it doesn't relate to them. And there's a definite feeling that they're not being included, and they want to challenge the, you know, the 'as is', at the moment. They really want to go out and say, 'I'm not happy with this status quo. You're not hearing me. You're not respecting me. I'm not included.' And when we talk about GDP, that doesn't feel very inclusive for them. So, I think we've got to find another measure. And, particularly when I think about the level of distrust there is, I mean, there's a-, this has been rising, you know, this populism has been apparent in many parts of the world. And there's a distrust of business, there's a-, or big business. There's a distrust of governments. There's now a distrust of certain media, and even now going in to the social media. You know, people don't know who to trust anymore. So, we've got to find another mechanism to include much bigger parts of the population, and use different metrics to measure success of a country.\nAF: Mm. I wonder, you know, this discussion of income inequality is not necessarily new here at Davos. How much of this actually leads to action?\nIB: Well, there are some action groups, and they will be here-, many of them will be here, present. And I think that's one of the good things about the-, the WEF, is that it does actually allow people to come and talk about their specific topics, they might be from academia, or from certain, you know, campaign groups, and it does get the business community to think about things differently. But, often, we don't have enough time as business leaders to focus on those things. We're focused on our own business numbers, making new deals, new networks, focusing on the bottom line. And that's why I think, actually, I enjoy working in insurance, because we do-, we do have a bigger social purpose. Now, Lloyds is a specialist insurance market, we've been around for over 300 years, and we have been enabling human progress along the way. Every time there was something new going on in the world, Lloyds was there, insuring it, so, enabling them to invest, and we were helping them to derisk their investment. And we mustn't stop doing that. We've got an enormous social purpose to fulfil. And the more we can talk about that, I think the more we can actually show that big business isn't all just about making money. It's actually about doing good for the world, taking us forward.\nAF: Let's bring the conversation to Lloyds, because-, and specifically as it relates to Brexit. You have made it very clear that there needs to be more clarity on the future of the UK. How comfortable are you with the direction Brexit negotiations have gone up until now, and how has that changed the direction of how you see the future there?\nIB: This is a difficult debate to have out, really, in the open. In other words, there's a lot of posturing having to go on. So, businesses, we have no secret-, we don't know the inner workings, we don't know what's really happening, what's really being negotiated, behind scenes. It all has to be out in the public. So, we still live in a-, with uncertainty. Now, the government has made some good in-roads, and by the end of the first quarter, in the UK, we're hoping that the government will have some more clarity as to whether there will be an implementation period beyond March 2019. Now, this will give some comfort to business, but it's not going to be providing any legal certainty. So, despite what they might be able to negotiate in terms of, do we have another two years, three years, four years, to implement the exit, that's not necessarily going to help us, and we need certainty. Lloyds, therefore, we've taken our-, our future in to our own hands, as much as we can. We're moving ahead with our own plans, we are opening up a subsidiary, in Brussels, in Belgium. That's because, about €2 billion of our business has to go through an EU-based entity. We will lose all our licensing post-Brexit. And other businesses will be doing the same. We can't live with this uncertainty, and, of course, the uncertainty is also not helping the population at large. People want to know what's going to happen. But, of course, we have seen the pound just start to recover a little bit against the dollar, so it looks like there's a bit more confidence now in the UK, following what the government's been doing.\nAF: Let's talk about one more thing that's really weighed on business, which is natural disasters. Certainly a very busy year for you last year, especially on the back of the two major hurricanes over in the US. Initial estimates had it at about $4.5 billion in losses, but I know you've had some chance to take a look at more of the claims coming in. I mean, give us a sense of the scope of the losses here, and how you expect that to weigh no business.\nIB: That's what we're here for. We're here to pay when things go wrong, tragic events happen. Our estimate is, for Lloyds, it'll be $4.8 billion. That's what we're paying-, we've already paid out $2 billion, and these will be going to a lot of the businesses, because a lot of the insurance, or reinsurance, so we do a lot of insuring of insurance companies, a lot of that will be to commercial enterprises, but some of it will be going down to helping people rebuild their homes, and we're also involved, and insure some of the islands that are affected, and, of course, we also had other tragedies, with the Mexican earthquake, tragic flooding in Southeast Asia. So, a very, very heavy year for insurance, in terms of natural catastrophes, but, again, that's what we're here for.\nAF: Okay, we'll have to leave it on that note. Inga Beale, really appreciate you joining us, joining us from Lloyds, and, of course, we will have much more here from Davos, Switzerland, on the other side of the break. Capital Connection will be right back.\nENDS", "external_links": [], "published": "2018-01-24T08:59:00.000+02:00", "crawled": "2018-01-24T09:38:13.000+02:00", "highlightTitle": ""}