{"organizations": [], "uuid": "902d0dedb5420d4aa92682315111b1549acd384d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 103, "shares": 103, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222956838&w=1200&r=LYNXMPEE0H0FB", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/us-cambodia-politics/cambodias-hun-sen-appoints-son-in-law-to-senior-police-post-idUKKBN1F70QN", "country": "US", "domain_rank": 408, "title": "Cambodia's Hun Sen appoints son-in-law to senior police post", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T09:36:00.000+02:00", "replies_count": 0, "uuid": "902d0dedb5420d4aa92682315111b1549acd384d"}, "author": "", "url": "https://uk.reuters.com/article/us-cambodia-politics/cambodias-hun-sen-appoints-son-in-law-to-senior-police-post-idUKKBN1F70QN", "ord_in_thread": 0, "title": "Cambodia's Hun Sen appoints son-in-law to senior police post", "locations": [], "entities": {"persons": [{"name": "hun sen", "sentiment": "negative"}, {"name": "dy vichea", "sentiment": "none"}, {"name": "hun mana", "sentiment": "none"}, {"name": "phil robertson", "sentiment": "none"}, {"name": "prak chan thul", "sentiment": "none"}], "locations": [{"name": "cambodia", "sentiment": "none"}, {"name": "southeast asian", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "human rights watch group", "sentiment": "none"}, {"name": "cambodia national rescue party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 7:39 AM / Updated 26 minutes ago Cambodia's Hun Sen appoints son-in-law to senior police post Prak Chan Thul 3 Min Read \nPHNOM PENH (Reuters) - Cambodia’s Prime Minister Hun Sen has appointed his son-in-law as deputy national police chief, in a move apparently aimed at consolidating his power ahead of an election this year. \nDy Vichea, who is married to Hun Sen’s eldest daughter, Hun Mana, was promoted to the post on Tuesday, according to a government decree seen by Reuters on Thursday. \nThe appointment comes amid political tension in the Southeast Asian nation, including a government clamp down on critics, civil rights groups and independent media. \n“Prime Minister Hun Sen aims to cement total control over Cambodian government and business, and appointing his son-in-law as deputy police chief is part of that ongoing effort,” Phil Robertson, deputy director for Asia at the Human Rights Watch group, told Reuters. \nHun Sen celebrated 33 years in power on Sunday, and has spoken of staying on for many more years. \nThe main opposition Cambodia National Rescue Party, which had attracted the support of a new generation of voters not content with what they see as the corruption and nepotism that has stalked Cambodia’s politics, was dissolved in November at the request of Hun Sen’s government. \nExiled critics of Hun Sen recently said they had founded a new movement following the ban but signs of division have emerged over the new group. \nInterior Ministry spokesman Khieu Sopheak defended Dy Vichea’s appointment and compared it with how U.S. President Donald Trump made his daughter, Ivanka Trump, his informal adviser. \n“There is no law that says we can’t appoint him,” Khieu Sopheak told Reuters. \nBusiness and government are entwined in Cambodia and the leadership and its family members control many of its biggest enterprises. \nNational police chief Neth Savoeun is married to Hun Sen’s niece. Hun Sen’s daughter, Hun Mana, is chairwoman of the Kampuchea Thmey Daily and Bayon TV and Radio among at least a dozen other firms. \nHun Sen’s eldest son, Lieutenant-General Hun Manet, is deputy commander of the armed forces and has for years been seen as likely to follow in his father’s footsteps and become a national leader. Editing by Amy Sawitta Lefevre, Robert Birsel", "external_links": [], "published": "2018-01-18T09:36:00.000+02:00", "crawled": "2018-01-18T09:56:13.000+02:00", "highlightTitle": ""}