{"organizations": [], "uuid": "09323680ba5c0f708e2e5be0b4f5e7e5396fec14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226980316&w=1200&r=LYNXMPEE0U140", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-china-funds/china-funds-boost-equity-exposure-cut-cash-poll-idUSKBN1FK25R", "country": "US", "domain_rank": 408, "title": "China funds boost equity exposure, cut cash: poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T23:11:00.000+02:00", "replies_count": 0, "uuid": "09323680ba5c0f708e2e5be0b4f5e7e5396fec14"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-funds/china-funds-boost-equity-exposure-cut-cash-poll-idUSKBN1FK25R", "ord_in_thread": 0, "title": "China funds boost equity exposure, cut cash: poll", "locations": [], "entities": {"persons": [], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI (Reuters) - Chinese fund managers boosted their suggested equity exposure for the next three months as financial and real-estate stocks surged amid easing worries over liquidity in early 2018.\nThe fund managers raised their suggested equity allocations to 76.9 percent from 71.9 percent a month earlier, according to a poll of eight China-based fund managers conducted this week.\nThe fund managers have maintained their suggested bond allocations for the coming three months at 6.9 percent, unchanged from last month.\nThey have cut recommended cash allocations to 16.3 percent for the next three months, from 21.3 percent in the previous month.\n“We could see more chances in the coming months, as the market is underpinned by the continued recovery in global economy and the resilience in China’s economy,” a South China-based fund manager said.\nThe fund manager is optimistic about developers, banks as well as consumer and oil firms that benefit from inflation.\nInvestors had been turning more to leading value stocks starting from last year, a Shanghai-based fund manager said, adding those bellwethers in various industries could be revalued.\nThe fund managers surveyed turned more bullish on asset allocations for the next month, with four suggesting an increase, while four recommended the same level of equity exposure.\nAccording to the poll, average recommended allocations for financial and real-estate shares jumped to more than three-year highs, while those for consumer and electronic stocks were substantially lowered.\nAverage recommended allocations for financial stocks were raised to 21.9 percent from 17.8 percent last month, those for property stocks were boosted to 10.3 percent from 6.9 percent, while those for consumer firms were reduced to 32.9 percent from 27.9 percent, according to the poll.\nReporting by David Lin, Luoyan Liu and John Ruwitch; Editing by Gopakumar Warrier\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T23:11:00.000+02:00", "crawled": "2018-01-31T17:41:34.007+02:00", "highlightTitle": ""}