{"organizations": [], "uuid": "a3795ef7fd92d347b851ad961e19779333691d82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-pdc-energy-appoints-new-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "PDC Energy Appoints New Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.26, "site_type": "news", "published": "2018-01-04T17:00:00.000+02:00", "replies_count": 0, "uuid": "a3795ef7fd92d347b851ad961e19779333691d82"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-pdc-energy-appoints-new-chief-financial-officer.html", "ord_in_thread": 0, "title": "PDC Energy Appoints New Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "david honeyfield", "sentiment": "none"}, {"name": "r. scott meyers", "sentiment": "none"}, {"name": "meyers", "sentiment": "none"}, {"name": "bart brookman", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "denver", "sentiment": "none"}, {"name": "grove city college", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "pdc energy", "sentiment": "negative"}, {"name": "pdc energy, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "pricewaterhousecoopers llc", "sentiment": "none"}, {"name": "schneider downs & co., inc.", "sentiment": "none"}, {"name": "pdc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, Jan. 04, 2018 (GLOBE NEWSWIRE) -- PDC Energy, Inc. (“PDC” or the “Company”) (Nasdaq:PDCE) today announced that it has appointed R. Scott Meyers, the Company’s current Chief Accounting Officer, to the position of Chief Financial Officer, effective immediately. Mr. Meyers will be responsible for financial and treasury functions, as well as other related duties, and he will continue to head the Company’s accounting team.\nMr. Meyers has been the Company’s Chief Accounting Officer since April 2009. Prior to joining the Company, he served as a Senior Manager with PricewaterhouseCoopers LLC and Schneider Downs & Co., Inc., an accounting firm based in Pittsburgh, Pennsylvania. Mr. Meyers holds a B.S. in Accounting from Grove City College, Pennsylvania.\nBart Brookman, the Company’s Chief Executive Officer, said, “Scott has been a key part of the PDC team for almost a decade and has been integral in the success of our company. We are very pleased that he has accepted the expanded role and we’re confident that he is very qualified for the job.”\nDavid Honeyfield, the Company’s previous CFO, has resigned from the company contemporaneously with the appointment of Mr. Meyers. His resignation did not result from a disagreement with the Company with respect to any matter relating to the Company’s operations, policies or practices, including its accounting policies and procedures. Mr. Brookman said, “We thank David for his service at PDC and wish him the best going forward.”\nAbout PDC Energy, Inc.\nPDC Energy, Inc. is a domestic independent exploration and production company that produces, develops, and explores for crude oil, natural gas, and NGLs, with primary operations in the Wattenberg Field in Colorado and the Delaware Basin in Reeves and Culberson Counties, Texas. The Company also has operations in the Utica Shale in Southeastern Ohio, which it plans to divest. PDC’s operations are focused in the horizontal Niobrara and Codell plays in the Wattenberg Field and in the Wolfcamp zones in the Delaware Basin.\nNOTE REGARDING FORWARD-LOOKING STATEMENTS\nAll statements in this news release other than statements of historical fact are forward-looking statements that are made pursuant to the Safe Harbor Provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are subject to a number of risks and uncertainties that may cause actual results to differ materially from the forward-looking statements. PDC urges you to carefully review and consider the cautionary statements made in this press release, the Item 1-A Risk Factors in the 2016 Annual Report on Form 10-K for the year ended December 31, 2016, filed with the Securities and Exchange Commission (“SEC”) on February 28, 2017, and other filings with the SEC for further information on risks and uncertainties that could affect the Company’s business, financial condition and results of operations, which are incorporated by this reference as though fully set forth herein. The Company cautions you not to place undue reliance on forward-looking statements, which speak only as of the date made. PDC undertakes no obligation to update any forward-looking statements in order to reflect any event or circumstance occurring after the date of this release or currently unknown facts or conditions or the occurrence of unanticipated events. All forward looking statements are qualified in their entirety by this cautionary statement . ﻿\nInvestor Contacts:\nMichael Edwards\nSenior Director Investor Relations\n303-860-5820\nmichael.edwards@pdce.com\nKyle Sourk\nManager Investor Relations\n303-318-6150\nkyle.sourk@pdce.com\nMedia Contact:\nCourtney Loper\nCommunications Manager\n303-831-3997\ncourtney.loper@pdce.com\nSource:PDC Energy, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/9ce96d75-bb71-47a5-94e1-bcbc49ad06df"], "published": "2018-01-04T17:00:00.000+02:00", "crawled": "2018-01-04T16:37:42.001+02:00", "highlightTitle": ""}