{"organizations": [], "uuid": "4e9bde7fc74671a45ee838a0acd85e7fc7667d66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224451047&w=1200&r=LYNXMPEE0M0SJ", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-spain-politics-catalonia/spanish-authorities-on-alert-for-any-bid-by-exiled-catalan-leader-to-return-idUSKBN1FC1F7", "country": "US", "domain_rank": 408, "title": "Spanish authorities on alert for any bid by exiled Catalan leader to return", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T13:54:00.000+02:00", "replies_count": 0, "uuid": "4e9bde7fc74671a45ee838a0acd85e7fc7667d66"}, "author": "", "url": "https://www.reuters.com/article/us-spain-politics-catalonia/spanish-authorities-on-alert-for-any-bid-by-exiled-catalan-leader-to-return-idUSKBN1FC1F7", "ord_in_thread": 0, "title": "Spanish authorities on alert for any bid by exiled Catalan leader to return", "locations": [], "entities": {"persons": [{"name": "catala", "sentiment": "negative"}, {"name": "carles puigdemont", "sentiment": "none"}, {"name": "puigdemont", "sentiment": "none"}, {"name": "juan ignacio zoido", "sentiment": "none"}, {"name": "zoido", "sentiment": "none"}], "locations": [{"name": "belgium", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "antena", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MADRID/COPENHAGEN (Reuters) - Spanish authorities are monitoring borders to make sure that fugitive Catalan separatist leader Carles Puigdemont does not sneak back into Spain to take up the presidency of the regional parliament again, a senior minister said on Tuesday.\nPuigdemont, speaking in Copenhagen, said his return from self-exile to Barcelona would be good for Spanish democracy, but he stopped short of saying if and when he would go home.\nPuigdemont has said he can rule from Belgium, where he fled to in October to avoid arrest for his part in organizing an illegal referendum on a split by Catalonia from Spain and a subsequent unilateral declaration of independence.\nThe Madrid government, however, says no one can be named or rule remotely.\nPuigdemont told a news conference in the Danish capital that a huge majority of the Catalan parliament supported him taking up the role of regional president once more following an election in December.\n“My return to Barcelona will not only be good news for Catalan people who support our cause but also for Spanish people and Spanish democracy,” he said.\nBut he did not say exactly when he planned to return to Spain when questioned on the matter.\nThe Catalan separatist leader Carles Puigdemont speaks during a news conference after a meeting with Danish members of the Parliament, after being invited by the Faroese parliamentary member Magni Arge, at Christiansborg in Copenhagen, Denmark January 23, 2018. Mads Claus Rasmussen/Scanpix Denmark via REUTERS In Madrid, Spanish Interior Minister Juan Ignacio Zoido said he was worried that the 55-year old -- who faces arrest the minute he steps back in Spain -- could now try to discreetly return to the parliament in Barcelona for a vote on his candidacy.\n“We’re making sure this cannot happen, at the borders and within the borders, everywhere,” Zoido told Antena 3 TV. “We’ll make sure he cannot get in, even (hidden) in the boot of a car,” he said.\nCatalan lawmakers are set to vote on Puigdemont’s candidacy by Jan. 31.\nSlideshow (3 Images) Puigdemont on Tuesday withdrew a request to be allowed to vote for himself by proxy, a source in his party said, without saying why he had dropped that demand or if it meant he planned to be in parliament in person for the leadership vote.\nHis visit to Denmark to attend a university debate was his first trip outside Belgium since he arrived there in October following his dismissal by the Madrid government and its imposition of direct rule on the semi-autonomous region.\nRelated Coverage Former Catalan leader Puigdemont says huge majority supports him as president Spanish Prime Minister Mariano Rajoy called a new regional election in December in a bid to defuse the crisis but his gamble failed when separatist parties won a majority, giving new impetus to the independence movement.\nPuigdemont, a former journalist, potentially faces decades in prison in Spain if he is convicted of the charges leveled against him, including rebellion and sedition.\nRajoy has said the Madrid government would appeal to the courts and maintain direct rule of the wealthy northeastern region if Puigdemont was elected while abroad.\nReporting by Ingrid Melander and Inmaculada Sanz, Editing by Paul Day and Angus MacSwan\n ", "external_links": [], "published": "2018-01-23T13:54:00.000+02:00", "crawled": "2018-01-23T14:05:28.001+02:00", "highlightTitle": ""}