{"organizations": [], "uuid": "4395be989bf219bdbd902460cc518dfa88043874", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-sabre-chief-information-security-officer-roy-r-mellinger-reaffirmed-to-hitrust-alliance-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Sabre Chief Information Security Officer Roy R. Mellinger reaffirmed to HITRUST Alliance board of directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-25T16:00:00.000+02:00", "replies_count": 0, "uuid": "4395be989bf219bdbd902460cc518dfa88043874"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-sabre-chief-information-security-officer-roy-r-mellinger-reaffirmed-to-hitrust-alliance-board-of-directors.html", "ord_in_thread": 0, "title": "Sabre Chief Information Security Officer Roy R. Mellinger reaffirmed to HITRUST Alliance board of directors", "locations": [], "entities": {"persons": [{"name": "roy r. mellinger", "sentiment": "negative"}, {"name": "mellinger", "sentiment": "none"}], "locations": [{"name": "southlake", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "sabre corporation", "sentiment": "negative"}, {"name": "sabre", "sentiment": "negative"}, {"name": "hitrust alliance", "sentiment": "negative"}, {"name": "wellpoint", "sentiment": "none"}, {"name": "sallie mae", "sentiment": "none"}, {"name": "anthem", "sentiment": "none"}, {"name": "ge capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTHLAKE, Texas, Sabre Corporation (NASDAQ: SABR), the leading technology provider to the global travel industry, and HITRUST Alliance, a not-for-profit organization whose mission is to champion programs that safeguard sensitive information and manage information risk for organizations across all industries, today announced that Roy R. Mellinger, Sabre senior vice president and chief information security officer, has been reaffirmed to the HITRUST board of directors.\nMellinger brought over 30 years of information security experience to Sabre when he joined the company in November 2017. He has served as chief security officer for several companies including Anthem (formerly WellPoint), Sallie Mae and GE Capital, and spent time with the U.S. government as a special agent and intelligence officer. In serving on the board of directors for HITRUST, Mellinger is a firm advocate for information security and risk management with a strong background of skills to represent the travel and hospitality industry on behalf of Sabre.\nFounded in 2007, HITRUST brings together leaders in privacy, information security and risk management in both public and private sectors to develop, maintain and provide broad access to its widely adopted common risk and compliance management frameworks. HITRUST leaders regularly participate in efforts that support government advocacy, community building and cybersecurity education.\n\"Sabre is committed to cybersecurity and, given its leading role in the travel industry, plays an important part in driving the conversation around data protection,\" said Mellinger. \"With a seat on the HITRUST board of directors, I relish the unique opportunity to work with companies across a wider range of industries in our joint obligation to safeguard sensitive information.\"\nMellinger's position on the HITRUST board of directors reinforces the organization's recent strategic direction as HITRUST becomes a resource across all industries. Information security is a crucial focus for any company and in Mellinger's leadership position – both on the board of HITRUST and within Sabre – he will be leading efforts to strengthen programs within the travel and hospitality industry. This relationship will grow the collaborative partnership between HITRUST and Sabre, allowing the two to align their strategies and continue as leaders in cybersecurity.\n\"Roy has been an extraordinary asset to HITRUST through his deep knowledge and experience and has been a major proponent of our cybersecurity and information risk management programs that have historically been based in the healthcare industry,\" said Daniel Nutkis, CEO, HITRUST. \"He is now spearheading initiatives for HITRUST and Sabre to be leaders against cyber threats in the hospitality and travel industry.\"\nAbout Sabre\nSabre Corporation is the leading technology provider to the global travel industry. Sabre's software, data, mobile and distribution solutions are used by hundreds of airlines and thousands of hotel properties to manage critical operations, including passenger and guest reservations, revenue management, flight, network and crew management. Sabre also operates a leading global travel marketplace, which processes more than US$120 billion of global travel spend annually by connecting travel buyers and suppliers. Headquartered in Southlake, Texas, USA, Sabre serves customers in more than 160 countries around the world.\nSABR-F\nMedia contact: sabrenews@sabre.com Investor contact: sabre.investorrelations@sabre.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/sabre-chief-information-security-officer-roy-r-mellinger-reaffirmed-to-hitrust-alliance-board-of-directors-300586960.html\nSOURCE Sabre Corporation", "external_links": ["http://www.prnewswire.com/news-releases/sabre-chief-information-security-officer-roy-r-mellinger-reaffirmed-to-hitrust-alliance-board-of-directors-300586960.html"], "published": "2018-01-25T16:00:00.000+02:00", "crawled": "2018-01-25T17:36:59.000+02:00", "highlightTitle": ""}