{"organizations": [], "uuid": "b18e1fd94e9ef5a0922d537511d94e384cae98ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-arrow-reports-record-net-income-for-2017-continues-double-digit-loan-growth.html", "country": "US", "domain_rank": 767, "title": "Arrow Reports Record Net Income for 2017; Continues Double-Digit Loan Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:55:00.000+02:00", "replies_count": 0, "uuid": "b18e1fd94e9ef5a0922d537511d94e384cae98ed"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-arrow-reports-record-net-income-for-2017-continues-double-digit-loan-growth.html", "ord_in_thread": 0, "title": "Arrow Reports Record Net Income for 2017; Continues Double-Digit Loan Growth", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}], "organizations": [{"name": "arrow financial corporation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GLENS FALLS, N.Y., Jan. 30, 2018 /PRNewswire/ -- Arrow Financial Corporation (NasdaqGS ® – AROW) announced operating results for the three- and twelve-month periods ended December 31, 2017. For the year ended December 31, 2017, net income was a record $29.3 million, up 10.5% over net income of $26.5 million for 2016. Diluted EPS was a record $2.10 up 9.9% from $1.91 in 2016 while return on average equity (ROE) and return on average assets (ROA) were 12.14% and 1.09%, respectively, for the year, as compared to 11.79% and 1.06%, respectively, for 2016. Excluding the one-time benefit resulting from the Tax Act, net income increased $1.7 million, up 6.3% year-over-year with diluted EPS of $2.02.\nNet income for the fourth quarter of 2017 was $8.1 million, an increase of $1.5 million, or 22.3%, from the fourth quarter of 2016, with diluted EPS of $0.58 for the quarter, an increase of 23.4% from the comparable 2016 quarter. Excluding the one-time benefit resulting from the Tax Act, quarterly net income was $7.0 million, an increase of 5.4% from the fourth quarter of 2016 and quarterly diluted EPS was $0.50, a 6.4% increase from the comparable 2016 quarter.\n\"Arrow has continued its steady growth, with solid performance in 2017,\" said Arrow President and CEO Tom Murphy. \"The Company was able to achieve record net income for the fourth consecutive year. On top of that, the favorable one-time adjustment to the valuation of the deferred tax liability resulting from the Tax Act further increased our net income. Overall, our success can be attributed to our talented and hard-working team whose efforts led to another year of double-digit loan growth and the ability to maintain our strong asset quality.\n\"In addition to the one-time tax benefit realized in the fourth quarter, we expect that tax reform will have an ongoing positive impact on our Company,\" Murphy continued. \"This is a unique opportunity, so we are carefully evaluating how to strategically utilize the expected tax savings to deliver value to our customers, employees, communities and shareholders.\"\nThe following list expands on our fourth quarter and year-to-date results:\nTax Reform : The Tax Act enacted on December 22, 2017, reduced the corporate Federal income tax rate from 35% to 21%, effective January 1, 2018. Generally Accepted Accounting Principles (GAAP) requires that the impact of the provisions of the Tax Act be accounted for in the period of enactment. As a result of revaluing the net deferred tax liability to the lower statutory tax rate of 21%, Arrow's provision for income taxes for the fourth quarter and full year 2017 reflects a $1.1 million benefit, representing $0.08 of diluted earnings per share.\nNet Interest Income: Net interest income, on a tax-equivalent basis (a non-GAAP financial measure), increased by $1.3 million, or 7.0%, in the fourth quarter of 2017, as compared to the fourth quarter of 2016, due to an increase of $179.1 million, or 7.5%, in the level of average earning assets between the periods and an increase in tax-equivalent net interest margin, (also a non-GAAP measure) to 3.23% for the fourth quarter of 2017, up significantly from 3.14% for the fourth quarter of 2016. Continued strong loan growth was the primary driver of the increase in average earning assets, while the increase in non-interest bearing demand deposits and low deposit rate betas allowed us to maintain a relatively low cost of funds.\nLoan Growth: At December 31, 2017, total loan balances reached a record high of $1.95 billion, up $197.5 million, or 11.3%, from the prior-year level. The Company experienced growth in all three major segments: commercial, consumer, and residential real estate. This represents the fourth consecutive year of double-digit loan growth.\nResidential real estate loans increased $95.3 million, or 14.0%, to $774.4 million, at year-end compared to the prior year-end. During 2017, Arrow originated $178.9 million of residential real estate loans, up 16.5% from the $153.6 million of originations in 2016. Consumer loans increased $65.5 million, or 12.2% during 2017 to $602.8 million, mainly due to an increase in indirect loan originations. Commercial and commercial real estate loan growth remained strong throughout 2017 with the portfolio increasing by $36.7 million, or 6.8%, to $573.5 million.\nDeposit Growth: At December 31, 2017, total deposit balances reached $2.2 billion, up by $128.6 million, or 6.1%, from the prior-year level. Noninterest-bearing deposits grew by $54.7 million or 14.1% during 2017, and represented 19.7% of total deposits at year-end, up from the prior-year level of 18.3%. Higher levels of noninterest-bearing deposits positively impacted net interest margin.\nAssets Under Management and Related Noninterest Income: Assets under trust administration and investment management at December 31, 2017, rose to a record $1.5 billion, an increase of 11.6%, from the December 31, 2016, balance of $1.3 billion. The growth in balances was primarily due to the performance of the equity markets. For the 2017 fourth quarter, income from fiduciary activities was $2.1 million, up 11% from the same period in 2016.\nSecurities Transactions: As part of the Company's balance sheet management process, the Company executed securities transactions, primarily late in the fourth quarter, pursuant to which the Company sold U.S. Treasury Notes, U.S. Agency debentures and U.S. Agency issued mortgage-backed securities from its available-for-sale portfolio, realizing a $458 thousand net loss on sale. Utilizing the sale proceeds, Arrow purchased U.S. Agency issued mortgage-backed securities and U.S. Agency collateralized mortgage obligations with fixed rate and floating rate coupon structures, which were allocated to the available-for-sale portfolio.\nAsset Quality: Asset quality remained strong, as evidenced by low levels of nonperforming assets and charge-offs. Net loan losses for the fourth quarter of 2017, expressed as an annualized percentage of average loans outstanding, were 0.05%. Net loan losses for the full year 2017 were 0.06% of average loans outstanding, unchanged from the 2016 ratio. Nonperforming assets of $7.8 million at December 31, 2017, represented only 0.28% of period-end assets, unchanged from the 2016 year-end ratio.\nThe Company's allowance for loan losses was $18.6 million at December 31, 2017, which represented 0.95% of loans outstanding, a decrease of two basis points from the ratio of 0.97% at year-end 2016. This decrease was primarily driven by continued strong asset quality indicators. However, the year-over-year provision for loan losses increased by $703 thousand, primarily driven by strong double-digit loan growth.\nCash and Stock Dividends: The cash dividend of $0.25 per share paid to shareholders in the 2017 fourth quarter represented a 3% increase in the cash dividend paid by us in the 2016 quarter, as adjusted for (and reflecting) the 3% stock dividend distributed by us on September 28, 2017. This was the Company's 24 th consecutive year of increased cash dividends. All prior-period per share data have been adjusted to reflect the September 28, 2017 stock dividend.\nCapital: Total shareholders' equity grew to a record of $249.6 million at period-end, an increase of $16.8 million, or 7.2%, above the year-end 2016 balance. This rate of increase exceeded the rate of growth in total assets for the year. The Company's regulatory capital ratios remained strong in 2017. At December 31, 2017, the Company's Common Equity Tier 1 Capital Ratio was 12.89% and total risk-based capital ratio was 14.98%. The capital ratios of the Company and both its subsidiary banks continued to significantly exceed the \"well capitalized\" regulatory standards, the highest category.\nPeer Group: Many of the Company's key operating ratios have consistently compared favorably to its peer group, defined as all U.S. bank holding companies having $1.0 to $3.0 billion in total assets, as identified in the Federal Reserve Bank's \"Bank Holding Company Performance Report\" (FRB Report). The most current peer data available in the FRB Report is as of and for the period ended September 30, 2017. For that period, the peer group's return on average equity (ROE) was 9.19% compared to the Company's ROE of 12.07% for the fourth quarter of 2017.\nAs of December 31, 2017, the Company's ratio of loans 90 days past due and accruing plus nonaccrual loans to total loans was 0.31%, as compared to the 0.73% ratio achieved by the peer group as of September 30, 2017 (as identified in the most recent FRB Report), while net loan losses of 0.06% for the year ended December 31, 2017, were slightly below the peer result for the period ended September 30, 2017 (as identified in the most recent FRB Report), of 0.08% (annualized).\nIndustry Recognition: In 2017 Arrow received various industry recognitions. The Company was named one of \"America's 50 Most Trustworthy Financial Companies\" by Forbes for the sixth consecutive year. Arrow also appeared in Bank Director Magazine's annual \"Bank Performance Scorecard\" as one of the top-performing banks in the country for the third year in a row.\nFinally, both of the Company's banking subsidiaries maintained their 5-Star Superior Bank Rating by BauerFinancial, Inc. Glens Falls National Bank and Trust Company and Saratoga National Bank and Trust Company have each earned this designation for the past 43 and 35 quarters, respectively.\nArrow Financial Corporation is a multi-bank holding company headquartered in Glens Falls, New York, serving the financial needs of northeastern New York. The Company is the parent of Glens Falls National Bank and Trust Company and Saratoga National Bank and Trust Company. Other subsidiaries include North Country Investment Advisers, Inc.; Upstate Agency, LLC, specializing in property and casualty insurance; and Capital Financial Group, Inc., an insurance agency specializing in the sale and servicing of group health plans.\nIn addition to presenting information in conformity with accounting principles generally accepted in the United States of America (GAAP), this news release contains financial information determined by methods other than GAAP (non-GAAP). The following measures used in this release, which are commonly utilized by financial institutions, have not been specifically exempted by the Securities and Exchange Commission (\"SEC\") and may constitute \"non-GAAP financial measures\" within the meaning of the SEC's rules. Certain non-GAAP financial measures include: tangible equity, return on tangible equity, tax-equivalent adjustment and related net interest income - tax equivalent, and the efficiency ratio. Management believes that the non-GAAP financial measures disclosed by the Company from time to time are useful in evaluating the Company's performance and that such information should be considered as supplemental in nature and not as a substitute for or superior to the related financial information prepared in accordance with GAAP. Our non-GAAP financial measures may differ from similar measures presented by other companies. See the reconciliation of GAAP to non-GAAP measures in the section \"Select Quarterly Information.\"\nThe information contained in this news release may contain statements that are not historical in nature but rather are based on management's beliefs, assumptions, expectations, estimates and projections about the future. These statements may be \"forward-looking statements\" within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, involving a degree of uncertainty and attendant risk. In the case of all forward-looking statements, actual outcomes and results may differ materially from what the statements predict or forecast, explicitly or by implication. The Company undertakes no obligation to revise or update these forward-looking statements to reflect the occurrence of unanticipated events. This News Release should be read in conjunction with the Company's Annual Report on Form 10-K for the year ended December 31, 2016, and our other filings with the Securities and Exchange Commission.\nARROW FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\n(In Thousands, Except Per Share Amounts - Unaudited)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nINTEREST AND DIVIDEND INCOME\nInterest and Fees on Loans\n$\n18,509\n$\n16,258\n$\n70,202\n$\n62,823\nInterest on Deposits at Banks\n106\n52\n348\n152\nInterest and Dividends on Investment Securities:\nFully Taxable\n1,957\n1,940\n7,884\n7,934\nExempt from Federal Taxes\n1,563\n1,520\n6,223\n6,006\nTotal Interest and Dividend Income\n22,135\n19,770\n84,657\n76,915\nINTEREST EXPENSE\nInterest-Bearing Checking Accounts\n422\n339\n1,510\n1,280\nSavings Deposits\n408\n255\n1,371\n932\nTime Deposits over $250,000\n95\n54\n282\n187\nOther Time Deposits\n248\n247\n950\n924\nFederal Funds Purchased and\nSecurities Sold Under Agreements to Repurchase\n15\n9\n44\n33\nFederal Home Loan Bank Advances\n433\n327\n2,083\n1,340\nJunior Subordinated Obligations Issued to Unconsolidated Subsidiary Trusts\n200\n173\n766\n660\nTotal Interest Expense\n1,821\n1,404\n7,006\n5,356\nNET INTEREST INCOME\n20,314\n18,366\n77,651\n71,559\nProvision for Loan Losses\n1,157\n483\n2,736\n2,033\nNET INTEREST INCOME AFTER PROVISION FOR LOAN LOSSES\n19,157\n17,883\n74,915\n69,526\nNONINTEREST INCOME\nIncome From Fiduciary Activities\n2,133\n1,929\n8,417\n7,783\nFees for Other Services to Customers\n2,469\n2,325\n9,591\n9,469\nNet (Loss) on Securities Transactions\n(458)\n(166)\n(448)\n(22)\nInsurance Commissions\n2,186\n2,200\n8,612\n8,668\nNet Gain on Sales of Loans\n115\n172\n546\n821\nOther Operating Income\n307\n188\n927\n1,113\nTotal Noninterest Income\n6,752\n6,648\n27,645\n27,832\nNONINTEREST EXPENSE\nSalaries and Employee Benefits\n9,823\n9,107\n37,166\n34,330\nOccupancy Expenses, Net\n2,150\n2,179\n9,560\n9,402\nFDIC Assessments\n212\n232\n891\n1,076\nOther Operating Expense\n3,858\n3,754\n15,088\n14,801\nTotal Noninterest Expense\n16,043\n15,272\n62,705\n59,609\nINCOME BEFORE PROVISION FOR INCOME TAXES\n9,866\n9,259\n39,855\n37,749\nProvision for Income Taxes\n1,795\n2,659\n10,529\n11,215\nNET INCOME\n$\n8,071\n$\n6,600\n$\n29,326\n$\n26,534\nAverage Shares Outstanding 1 :\nBasic\n13,905\n13,844\n13,893\n13,792\nDiluted\n14,006\n13,972\n13,986\n13,880\nPer Common Share:\nBasic Earnings\n$\n0.58\n$\n0.48\n$\n2.11\n$\n1.92\nDiluted Earnings\n0.58\n0.47\n2.10\n1.91\n1 Share and per share data have been restated for the September 28, 2017, 3% stock dividend.\nARROW FINANCIAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In Thousands, Except Share and Per Share Amounts - Unaudited)\nDecember 31,\n2017\nDecember 31,\n2016\nASSETS\nCash and Due From Banks\n$\n42,562\n$\n43,024\nInterest-Bearing Deposits at Banks\n30,276\n14,331\nInvestment Securities:\nAvailable-for-Sale\n300,200\n346,996\nHeld-to-Maturity (Approximate Fair Value of $335,901 at\nDecember 31, 2017, and $343,751 at December 31, 2016)\n335,907\n345,427\nOther Investments\n9,949\n10,912\nLoans\n1,950,770\n1,753,268\nAllowance for Loan Losses\n(18,586)\n(17,012)\nNet Loans\n1,932,184\n1,736,256\nPremises and Equipment, Net\n27,619\n26,938\nGoodwill\n21,873\n21,873\nOther Intangible Assets, Net\n2,289\n2,696\nOther Assets\n57,606\n56,789\nTotal Assets\n$\n2,760,465\n$\n2,605,242\nLIABILITIES\nNoninterest-Bearing Deposits\n$\n441,945\n$\n387,280\nInterest-Bearing Checking Accounts\n907,315\n877,988\nSavings Deposits\n694,573\n651,965\nTime Deposits over $250,000\n38,147\n32,878\nOther Time Deposits\n163,136\n166,435\nTotal Deposits\n2,245,116\n2,116,546\nFederal Funds Purchased and\nSecurities Sold Under Agreements to Repurchase\n64,966\n35,836\nFederal Home Loan Bank Overnight Advances\n105,000\n123,000\nFederal Home Loan Bank Term Advances\n55,000\n55,000\nJunior Subordinated Obligations Issued to Unconsolidated Subsidiary Trusts\n20,000\n20,000\nOther Liabilities\n20,780\n22,008\nTotal Liabilities\n2,510,862\n2,372,390\nSTOCKHOLDERS' EQUITY\nPreferred Stock, $5 Par Value; 1,000,000 Shares Authorized\n—\n—\nCommon Stock, $1 Par Value; 20,000,000 Shares Authorized (18,481,301 Shares Issued at December 31, 2017, and\n17,943,201 Shares Issued at December 31, 2016)\n18,481\n17,943\nAdditional Paid-in Capital\n290,220\n270,880\nRetained Earnings & Accumulated Other Comprehensive (Loss)\n20,303\n21,810\nUnallocated ESOP Shares (9,643 Shares at December 31, 2017, and 19,466 Shares at December 31, 2016)\n(200)\n(400)\nTreasury Stock, at Cost (4,541,524 Shares at December 31, 2017, and 4,441,093 Shares at December 31, 2016)\n(79,201)\n(77,381)\nTotal Stockholders' Equity\n249,603\n232,852\nTotal Liabilities and Stockholders' Equity\n$\n2,760,465\n$\n2,605,242\nArrow Financial Corporation\nSelected Quarterly Information\n(Dollars In Thousands, Except Per Share Amounts - Unaudited)\nQuarter Ended\n12/31/2017\n9/30/2017\n6/30/2017\n3/31/2017\n12/31/2016\nNet Income\n$\n8,071\n$\n7,416\n$\n7,208\n$\n6,631\n$\n6,600\nTransactions Recorded in Net Income (Net of Tax):\nNet (Loss) Gain on Securities Transactions\n(278)\n6\n—\n—\n(101)\nTax Benefit from Net Deferred Tax Liability Revaluation\n1,116\n—\n—\n—\n—\nShare and Per Share Data: 1\nPeriod End Shares Outstanding\n13,930\n13,891\n13,900\n13,886\n13,887\nBasic Average Shares Outstanding\n13,905\n13,889\n13,890\n13,889\n13,844\nDiluted Average Shares Outstanding\n14,006\n13,966\n13,975\n14,001\n13,972\nBasic Earnings Per Share\n$\n0.58\n$\n0.53\n$\n0.52\n$\n0.48\n$\n0.48\nDiluted Earnings Per Share\n0.58\n0.53\n0.52\n0.47\n0.47\nCash Dividend Per Share\n0.250\n0.243\n0.243\n0.243\n0.243\nSelected Quarterly Average Balances:\nInterest-Bearing Deposits at Banks\n$\n27,047\n$\n27,143\n$\n24,480\n$\n23,565\n$\n34,731\nInvestment Securities\n660,043\n677,368\n684,570\n695,615\n684,906\nLoans\n1,930,590\n1,892,766\n1,842,543\n1,781,113\n1,726,738\nDeposits\n2,284,206\n2,193,778\n2,206,365\n2,161,798\n2,160,156\nOther Borrowed Funds\n187,366\n262,864\n207,270\n205,436\n157,044\nShareholders' Equity\n247,253\n243,801\n239,396\n235,257\n230,198\nTotal Assets\n2,744,180\n2,725,653\n2,677,843\n2,626,470\n2,572,425\nReturn on Average Assets\n1.17\n%\n1.08\n%\n1.08\n%\n1.02\n%\n1.02\n%\nReturn on Average Equity\n12.95\n%\n12.07\n%\n12.08\n%\n11.43\n%\n11.41\n%\nReturn on Tangible Equity 2\n14.36\n%\n13.40\n%\n13.45\n%\n12.76\n%\n12.77\n%\nAverage Earning Assets\n2,617,680\n2,597,277\n2,551,593\n2,500,293\n2,446,375\nAverage Paying Liabilities\n2,029,811\n2,012,802\n2,005,421\n1,977,628\n1,933,974\nInterest Income, Tax-Equivalent\n23,115\n22,565\n21,875\n20,945\n20,709\nInterest Expense\n1,821\n1,949\n1,699\n1,536\n1,404\nNet Interest Income, Tax-Equivalent\n21,294\n20,616\n20,176\n19,409\n19,305\nTax-Equivalent Adjustment\n980\n966\n949\n948\n939\nNet Interest Margin 3\n3.23\n%\n3.15\n%\n3.17\n%\n3.15\n%\n3.14\n%\nEfficiency Ratio Calculation:\nNoninterest Expense\n$\n16,043\n$\n15,548\n$\n15,637\n$\n15,475\n$\n15,272\nLess: Intangible Asset Amortization\n69\n69\n70\n71\n73\nNet Noninterest Expense\n$\n15,974\n$\n15,479\n$\n15,567\n$\n15,404\n$\n15,199\nNet Interest Income, Tax-Equivalent\n$\n21,294\n$\n20,616\n$\n20,176\n$\n19,409\n$\n19,305\nNoninterest Income\n6,752\n7,141\n7,057\n6,695\n6,648\nLess: Net Securities (Losses) Gains\n(458)\n10\n—\n—\n(166)\nNet Gross Income\n$\n28,504\n$\n27,747\n$\n27,233\n$\n26,104\n$\n26,119\nEfficiency Ratio\n56.04\n%\n55.79\n%\n57.16\n%\n59.01\n%\n58.19\n%\nPeriod-End Capital Information:\nTotal Stockholders' Equity (i.e. Book Value)\n$\n249,603\n$\n244,648\n$\n240,752\n$\n236,111\n$\n232,852\nBook Value per Share\n17.92\n17.61\n17.32\n17.00\n16.77\nIntangible Assets\n24,162\n24,268\n24,355\n24,448\n24,569\nTangible Book Value per Share 2\n16.18\n15.86\n15.57\n15.24\n15.00\nCapital Ratios:\nTier 1 Leverage Ratio\n9.49\n%\n9.30\n%\n9.35\n%\n9.37\n%\n9.47\n%\nCommon Equity Tier 1 Capital Ratio\n12.89\n%\n12.70\n%\n12.68\n%\n12.84\n%\n12.97\n%\nTier 1 Risk-Based Capital Ratio\n13.97\n%\n13.79\n%\n13.79\n%\n13.99\n%\n14.14\n%\nTotal Risk-Based Capital Ratio\n14.98\n%\n14.77\n%\n14.77\n%\n14.98\n%\n15.15\n%\nAssets Under Trust Administration and Investment Management\n$\n1,452,994\n$\n1,411,608\n$\n1,356,262\n$\n1,333,690\n$\n1,301,408\n1 Share and Per Share Data have been restated for the September 28, 2017, 3% stock dividend.\n2 Tangible Book Value and Tangible Equity exclude intangible assets from total equity. These are non-GAAP financial measures which we believe provide investors with information that is useful in understanding our financial performance.\n3 Net Interest Margin is the ratio of our annualized tax-equivalent net interest income to average earning assets. This is also a non-GAAP financial measure which we believe provides investors with information that is useful in understanding our financial performance.\nArrow Financial Corporation\nSelected Quarterly Information - Continued\n(Dollars In Thousands, Except Per Share Amounts - Unaudited)\nFootnotes:\n1.\nShare and per share data have been restated for the September 28, 2017, 3% stock dividend.\n2.\nTangible Book Value, Tangible Equity, and Return on Tangible Equity exclude goodwill and other intangible assets, net from total equity. These are non-GAAP financial measures which we believe provide investors with information that is useful in understanding our financial performance.\n12/31/2017\n9/30/2017\n6/30/2017\n3/31/2017\n12/31/2016\nTotal Stockholders' Equity (GAAP)\n$\n249,603\n$\n244,648\n$\n240,752\n$\n236,111\n$\n232,852\nLess: Goodwill and Other Intangible assets, net\n24,162\n24,268\n24,355\n24,448\n24,569\nTangible Equity (Non-GAAP)\n$\n225,441\n$\n220,380\n$\n216,397\n$\n211,663\n$\n208,283\nPeriod End Shares Outstanding\n13,930\n13,891\n13,900\n13,886\n13,887\nTangible Book Value per Share (Non-GAAP)\n$\n16.18\n$\n15.86\n$\n15.57\n$\n15.24\n$\n15.00\nNet Income\n8,071\n7,416\n7,208\n6,631\n6,600\nReturn on Tangible Equity (Net Income/Tangible Equity - Annualized)\n14.36\n%\n13.40\n%\n13.45\n%\n12.76\n%\n12.77\n%\n3.\nNet Interest Margin is the ratio of our annualized tax-equivalent net interest income to average earning assets. This is also a non-GAAP financial measure which we believe provides investors with information that is useful in understanding our financial performance.\n12/31/2017\n9/30/2017\n6/30/2017\n3/31/2017\n12/31/2016\nInterest Income (GAAP)\n$\n22,135\n$\n21,599\n$\n20,926\n$\n19,997\n$\n19,770\nAdd: Tax Equivalent Adjustment (Non-GAAP)\n980\n966\n949\n948\n939\nInterest Income - Tax Equivalent (Non-GAAP)\n$\n23,115\n$\n22,565\n$\n21,875\n$\n20,945\n$\n20,709\nNet Interest Income (GAAP)\n$\n20,314\n$\n19,650\n$\n19,227\n$\n18,461\n$\n18,366\nAdd: Tax-Equivalent adjustment (Non-GAAP)\n980\n966\n949\n948\n939\nNet Interest Income - Tax Equivalent (Non-GAAP)\n$\n21,294\n$\n20,616\n$\n20,176\n$\n19,409\n$\n19,305\nAverage Earning Assets\n2,617,680\n2,597,277\n2,551,593\n2,500,293\n2,446,375\nNet Interest Margin (Non-GAAP)*\n3.23\n%\n3.15\n%\n3.17\n%\n3.15\n%\n3.14\n%\n4.\nFinancial Institutions often use the \"efficiency ratio\", a non-GAAP ratio, as a measure of expense control. We believe the efficiency ratio provides investors with information that is useful in understanding our financial performance. We define our efficiency ratio as the ratio of our noninterest expense to our net gross income (which equals our tax-equivalent net interest income plus noninterest income, as adjusted).\n5.\nFor the current quarter, all of the regulatory capital ratios in the table above, as well as the Total Risk-Weighted Assets and Common Equity Tier 1 Capital amounts listed in the table below, are estimates based on, and calculated in accordance with bank regulatory capital rules. All prior quarters reflect actual results. The December 31, 2017 CET1 ratio listed in the tables (i.e., 12.91%) exceeds the sum of the required minimum CET1 ratio plus the fully phased-in Capital Conservation Buffer (i.e., 7.00%).\n12/31/2017\n9/30/2017\n6/30/2017\n3/31/2017\n12/31/2016\nTotal Risk Weighted Assets\n1,856,954\n1,830,730\n1,802,455\n1,747,318\n1,707,829\nCommon Equity Tier 1 Capital\n259,378\n232,473\n228,586\n224,369\n221,472\nCommon Equity Tier 1 Ratio\n12.89\n%\n12.70\n%\n12.68\n%\n12.84\n%\n12.97\n%\n* Quarterly ratios have been annualized\nArrow Financial Corporation\nConsolidated Financial Information\n(Dollars in Thousands - Unaudited)\nQuarter Ended:\n12/31/2017\n12/31/2016\nLoan Portfolio\nCommercial Loans\n$\n129,249\n$\n105,155\nCommercial Real Estate Loans\n444,248\n431,646\nSubtotal Commercial Loan Portfolio\n573,497\n536,801\nConsumer Loans (Primarily Indirect Automobile Loans)\n602,827\n537,361\nResidential Real Estate Loans\n774,446\n679,106\nTotal Loans\n$\n1,950,770\n$\n1,753,268\nAllowance for Loan Losses\nAllowance for Loan Losses, Beginning of Quarter\n$\n17,695\n$\n16,975\nLoans Charged-off\n(363)\n(486)\nRecoveries of Loans Previously Charged-off\n97\n40\nNet Loans Charged-off\n(266)\n(446)\nProvision for Loan Losses\n1,157\n483\nAllowance for Loan Losses, End of Quarter\n$\n18,586\n$\n17,012\nNonperforming Assets\nNonaccrual Loans\n$\n5,526\n$\n4,193\nLoans Past Due 90 or More Days and Accruing\n319\n1,201\nLoans Restructured and in Compliance with Modified Terms\n105\n106\nTotal Nonperforming Loans\n5,950\n5,500\nRepossessed Assets\n109\n101\nOther Real Estate Owned\n1,738\n1,585\nTotal Nonperforming Assets\n$\n7,797\n$\n7,186\nKey Asset Quality Ratios\nNet Loans Charged-off to Average Loans, Quarter-to-date\nAnnualized\n0.05\n%\n0.10\n%\nProvision for Loan Losses to Average Loans, Quarter-to-date\nAnnualized\n0.24\n%\n0.11\n%\nAllowance for Loan Losses to Period-End Loans\n0.95\n%\n0.97\n%\nAllowance for Loan Losses to Period-End Nonperforming Loans\n312.37\n%\n309.31\n%\nNonperforming Loans to Period-End Loans\n0.31\n%\n0.31\n%\nNonperforming Assets to Period-End Assets\n0.28\n%\n0.28\n%\nTwelve-Month Period Ended:\nAllowance for Loan Losses\nAllowance for Loan Losses, Beginning of Year\n$\n17,012\n$\n16,038\nLoans Charged-off\n(1,559)\n(1,270)\nRecoveries of Loans Previously Charged-off\n397\n211\nNet Loans Charged-off\n(1,162)\n(1,059)\nProvision for Loan Losses\n2,736\n2,033\nAllowance for Loan Losses, End of Year\n$\n18,586\n$\n17,012\nKey Asset Quality Ratios\nNet Loans Charged-off to Average Loans\n0.06\n%\n0.06\n%\nProvision for Loan Losses to Average Loans\n0.15\n%\n0.12\n%\nView original content: http://www.prnewswire.com/news-releases/arrow-reports-record-net-income-for-2017-continues-double-digit-loan-growth-300590341.html\nSOURCE Arrow Financial Corporation", "external_links": ["http://www.prnewswire.com/news-releases/arrow-reports-record-net-income-for-2017-continues-double-digit-loan-growth-300590341.html"], "published": "2018-01-30T18:55:00.000+02:00", "crawled": "2018-01-30T20:50:46.005+02:00", "highlightTitle": ""}