{"organizations": [], "uuid": "1e5900069f68632a9abf6aff3880bdbd413aee47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-the-latest-senate-democrats-derail-bill-to-avert-shutdown.html", "country": "US", "domain_rank": 767, "title": "The Latest: Senate Democrats derail bill to avert shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T14:42:00.000+02:00", "replies_count": 0, "uuid": "1e5900069f68632a9abf6aff3880bdbd413aee47"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-the-latest-senate-democrats-derail-bill-to-avert-shutdown.html", "ord_in_thread": 0, "title": "The Latest: Senate Democrats derail bill to avert shutdown", "locations": [], "entities": {"persons": [{"name": "mitch mcconnell", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "democratic", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The Latest on the budget battle in Congress (all times local):\n11 p.m.\nSenate Democrats appear to have derailed a Republican bill aimed at preventing a federal shutdown set to begin as soon as the calendar flips to Saturday.\nFriday's late-night vote means at least a short government closure is all but unavoidable. There have been no clear public signs that the two parties have significantly narrowed their disputes over immigration and the budget.\nThe House approved the measure Thursday over Democratic opposition. It would keep agencies afloat through Feb. 16, but Democrats want a package lasting just days in hopes of intensifying pressure on the GOP to compromise.\nRepublicans control the Senate 51-49. The GOP needed 60 votes to prevail, but the tally was 50-48 as of 11 p.m. Eastern time. The Senate is awaiting a final vote from Majority Leader Mitch McConnell.\n10:30 p.m.\nThe Trump administration will exempt several hundred presidential staffers from mandatory furloughs if the government shuts down at midnight.\nContingency plans released Friday night show that 659 Executive Office of the President staffers would be allowed to report to duty because they are considered essential workers. More than 1,000 of 1,700 staffers would be furloughed.\nThe number is higher than the Obama administration, which deemed 545 staffers essential in 2015.\nThe Executive Office of the President includes those who work in White House Office, the Office of the Vice President and the National Security Council, among others.\n9:30 p.m.\nPresident Donald Trump says efforts to avert a government shutdown are \"Not looking good.\"\nTrump says in a tweet late Friday evening that it's \"Not looking good for our great Military or Safety & Security on the very dangerous Southern Border.\"\nAnd he's blaming Democrats, saying they want a federal government shutdown \"in order to help diminish the great success of the Tax Cuts, and what they are doing for our booming economy.\"\nLawmakers are trying to hash out a deal to keep the federal government open. A partial shutdown will begin at midnight if Congress doesn't pass a funding bill.\n8:55 p.m.\nNewly minted Alabama Democratic Sen. Doug Jones is breaking ranks with party leaders and will vote for the House-passed Republican bill preventing a federal shutdown.\nJones tells The Associated Press he will \"reluctantly\" vote for the measure late Friday. He says he's backing it because the measure contains fresh financing for the Children's Health Insurance Program, which helps low-income children.\nIt will be Jones' highest-profile vote since he joined the Senate Jan. 3 after his upset special election victory over conservative Roy Moore.\nDemocrats say they have the votes to block the GOP measure. Republicans control the Senate 51-49 but need 60 votes to prevail.\nJones joins at least three other Democrats saying they'll support the bill: North Dakota's Heidi Heitkamp, Indiana's Joe Donnelly and West Virginia's Joe Manchin.\n7:30 p.m.\nAdministration officials say President Donald Trump would be allowed to travel to Davos, Switzerland, next week even if the government has been partially shut down.\nSenior administration officials told reporters in a background briefing call that the president is permitted to continue to exercise his constitutional duties during a funding lapse. That includes carrying out diplomacy.\nThe officials declined to comment on whether the president would be able to travel to Florida this weekend to spend time at his Mar-a-Lago club.\nTrump is planning to attend the World Economic Forum Annual Meeting next week in Switzerland. He plans to meet with British Prime Minister Theresa May, among others.\n7:20 p.m.\nThe Senate has scheduled a showdown vote for 10 p.m. EST on preventing a federal government shutdown. Democrats are ready to block the Republican measure.\nUnless Congress approves some legislation providing money, government agencies will begin shutting down at midnight.\nThe initial impact on most people will be slight, but the closure will raise the stakes in a partisan fight over immigration and the budget.\nThe House approved a bill Thursday keeping agencies open through Feb. 16.\nLed by Senate Minority Leader Chuck Schumer, most Democrats are opposing the measure.\nRepublicans control the Senate 51-49 but need 60 votes to prevail. More than enough Democrats appear ready to vote \"no.\"\n5:25 p.m.\nPresident Donald Trump is striking an optimistic tone as the deadline for a federal government shutdown nears.\nTrump tweeted Friday afternoon, less than seven hours before the midnight deadline, that he had \"an excellent preliminary meeting\" in the Oval Office with Senate Minority Leader Chuck Schumer.\nHe is also praising the role being played by fellow Republicans, Senate Majority Leader Mitch McConnell and House Speaker Paul Ryan.\nTrump says negotiators are \"making progress\" and says a four-week spending extension \"would be best.\" That's what the House passed Thursday.\nSchumer told reporters after the White House meeting that progress had been made but a deal had not yet been reached.\n2:45 p.m.\nTop Senate Democrat Chuck Schumer says he and President Donald Trump \"made some progress\" at a White House meeting, \"but we still have a good number of disagreements.\"\nThe New York Democrat said \"discussions will continue.\"\nTrump asked Schumer to the White House for a meeting that lasted more than an hour.\nThe Oval Office session came with hours to go before a partial government shutdown at midnight.\nSchumer'ss pressing for protections for younger immigrants brought to the country illegally as children, but the White House and Republicans say talks on that issue should be kept separate from legislation to prevent a shutdown.\n2:30 p.m.\nSenate Democratic Leader Chuck Schumer has left the White House after a lengthy meeting with President Donald Trump.\nTrump invited the Senate's top Democrat to try to reach a deal to avert a government shutdown.\nSchumer did not address reporters as he left the building.\n12:45 a.m.\nPresident Donald Trump has invited Senate Democratic leader Chuck Schumer to the White House to try to reach a deal to avoid a government shutdown.\nThat's according to a person familiar with Trump's outreach who spoke on condition of anonymity to discuss the private conversation.\nSchumer is expected to meet with Trump shortly.\n12:20 p.m.\nThe House has voted to remain in session — for now at least — while a Senate vote to avert a government shutdown looms.\nRepublican leaders planned to adjourn Friday after approving a four-week spending bill Thursday night that would avert a government shutdown. They changed course Friday after Democrats forced a formal vote on adjournment. Rep. Steny Hoyer of Maryland, the No. 2 House Democrat, said lawmakers have not completed their work and should not leave Washington.\nHouse Democratic Leader Nancy Pelosi said House Majority Leader Kevin McCarthy and other Republicans want to go to Davos, Switzerland \"hobnobbing with their elitist friends instead of honoring their responsibilities to the American people.\"\nA GOP aide said McCarthy won't attend the World Economic Forum in Davos if the gov", "external_links": [], "published": "2018-01-19T14:42:00.000+02:00", "crawled": "2018-01-20T06:21:49.030+02:00", "highlightTitle": ""}