{"organizations": [], "uuid": "c450dd858c9b870510a3e72e35c1039784646647", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224050262&w=1200&r=LYNXMPEE0L0BL", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-asia-media-fakenews/fake-news-crutch-used-by-se-asian-leaders-to-control-media-critics-charge-idUKKBN1FB0FC", "country": "US", "domain_rank": 408, "title": "\"Fake news\" crutch used by SE Asian leaders to control media, critics charge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T07:08:00.000+02:00", "replies_count": 0, "uuid": "c450dd858c9b870510a3e72e35c1039784646647"}, "author": "", "url": "https://uk.reuters.com/article/uk-asia-media-fakenews/fake-news-crutch-used-by-se-asian-leaders-to-control-media-critics-charge-idUKKBN1FB0FC", "ord_in_thread": 0, "title": "\"Fake news\" crutch used by SE Asian leaders to control media, critics charge", "locations": [], "entities": {"persons": [{"name": "karen lema", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "shawn crispin", "sentiment": "none"}, {"name": "panu", "sentiment": "none"}], "locations": [{"name": "southeast asia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "committee to protect journalists", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 5:08 AM / Updated an hour ago \"Fake news\" crutch used by SE Asian leaders to control media, critics charge Karen Lema , Panu Wongcha-um 7 Min Read \nMANILA/BANGKOK (Reuters) - Governments across Southeast Asia have a history of using laws and the judiciary to curb press freedoms - now, they have found a handy crutch to lean on as they intensify clampdowns: U.S. President Donald Trump’s “fake news” mantra. \nMost worrying to media rights advocates is that several countries are promoting new legislation or expanding existing regulations to make publishing fake news an offence. The fear is that, rather than focusing on false stories published on social media, authoritarian leaders will use the new laws to target legitimate news outlets that are critical of them. \n“When the leadership of the United States consistently targets legitimate media reporting as fake, it opens the way for leaders the world over to do the same,” said Shawn Crispin, who represents the Committee to Protect Journalists in the region. “It’s a dangerous trend that is giving authoritarian and democratic regimes alike justification for targeting or shutting down reporting they don’t like.” \nThe term “fake news” has entered the lexicon of the Association of Southeast Asian Nations (ASEAN), whose leaders commended the work done by their governments in countering its spread in a statement issued at the end of a November summit. \nLike everywhere else, Southeast Asia does sometimes have a problem with information on social media that is intentionally false. But there is little sign that the problem has been anywhere as bad as it was, for example, in the run-up to the November 2016 U.S. presidential election. \nLast week, after the Philippines’ corporate regulator revoked the operating licence of Rappler, a news site whose scrutiny of President Rodrigo Duterte’s deadly war on drugs has been a thorn in his side, Duterte told reporters it was “a fake news outlet” that had been “throwing trash and shit all along”. \nDuterte denied influencing the regulator’s decision, which was followed by the justice minister ordering an investigation into Rappler for possible criminal liability and the National Bureau of Investigation summoning its CEO to answer a complaint related to cyber-crime. \nJohn Nery, associate editor and a columnist at the Philippine Daily Inquirer, which has also come under attack from the government, said “fake news” is now glibly used by people who don’t like what they hear. \n“Unfortunately for us, those parties include the government of the Philippines. So it is used to intimidate,” he said. \nAnti-fake news legislation, which would impose fines and prison terms of up to 20 years for spreading false information, is under consideration in the Philippines. \nPhilippines presidential spokesman Harry Roque said the legislation was being promoted by two senators not the Duterte administration. \nAsked if the government felt the need to regulate fake news, Roque said: “We believe in free market place of ideas.” \n“LIKE POISON OR A GUN” \nStrongman Cambodian Prime Minister Hun Sen regularly accuses critical media outlets of spreading “fake news”. \nIn his latest attack on Saturday, he backed Trump for announcing “fake news” awards. “I think President Donald Trump has correctly created an award that he just announced in recent days, the Fake News Award,” he said. “And in Cambodia there is also this type of media.” FILE PHOTO: U.S. President Donald Trump accuses a CNN reporter of being \"fake news\" after signing a memorandum directing the U.S. Trade Representative to complete a review of trade issues with China at the White House in Washington, U.S. August 14, 2017. REUTERS/Jonathan Ernst/File Photo \nHuy Vannak, undersecretary of state in Cambodia’s Interior Ministry, told Reuters: “Everyone, including ordinary citizens, has to fight against fake news because fake news is like poison or a gun and it can kill our beautiful society.” \nIn Malaysia, Prime Minister Najib Razak has accused opponents of using the media to spread fake news on a scandal over state fund 1Malaysia Development Berhad (1MDB). \n1MDB is being investigated in at least six countries for money-laundering and misappropriation of funds, including an alleged $681 million transfer into Najib’s personal account. The U.S. Department of Justice filed several lawsuits last year to seize more than $1.7 billion in assets believed to have been stolen from the sovereign fund that was set up by Najib. \nThe prime minister denies any wrongdoing. \nNajib’s government has suspended media and blocked websites that hounded him over 1MDB, and - with elections looming - he recently launched a website to counter “fake news”. FILE PHOTO: Cambodia's Prime Minister Hun Sen arrives to attend the Cambodian People's Party (CPP) congress in Phnom Penh, Cambodia January 19, 2018. REUTERS/Samrang Pring/File Photo \nThe government of Singapore, where curbs on free speech have often been criticised by human rights advocates, is planning legislation to tackle fake online information it says could threaten national security. \nSingapore’s Straits Times newspaper this month cited seven cases of “fake news” that came up in a parliament discussion: three were about other countries and one was about an image of ‘halal pork’ allegedly being sold in supermarkets that went viral in 2007. \nLaw and Home Affairs Minister Kasiviswanathan Shanmugam told lawmakers that combating falsehoods is not contrary to the exercise of freedom of speech but, rather, it “enables freedom of speech to be meaningfully exercised”. \nA Singapore government spokesperson, asked to comment, referred Reuters to Shanmugam’s speech and to a paper presented to parliament that said “the dissemination of deliberate falsehoods ... attacks the very heart of democracy” and, if unchecked, undermines faith in the country and its institutions. LOCKING UP REPORTERS \nThailand already has a cyber-security law under which the spread of false information carries a jail sentence of up to seven years, and the military government strictly enforces lese majeste laws that shield the royal family from insult. \nStill, junta leader Prayuth Chan-ocha has warned that tough action will be taken to enforce laws against “fake news and hate speech”. \nMyanmar has assailed foreign news organisations for “fake news” about a military crackdown in Rakhine state that triggered the exodus of more than 650,000 Rohingya Muslims to Bangladesh. \nIt has detained at least 29 journalists since Nobel peace laureate Aung San Suu Kyi came to power in 2016. Among them are two Reuters reporters who had covered the crisis in Rakhine and are being investigated for alleged breaches of the Official Secrets Act. \nPhilip Bowring, a former editor of the news magazine Far Eastern Economic Review, which closed in 2009, said “fake news” is “a convenient phrase” for governments that would in any case find ways to crimp press freedom. He sees the mantra as “just a new gimmick” that allows governments to justify their behaviour. Additional reporting by John Chalmers in JAKARTA, Matthew Tostevin in BANGKOK, Chan Thul Prak in PHNOM PENH, Praveen Menon in KUALA LUMPUR and Jack Kim in SINGAPORE; Writing by John Chalmers; Editing by Martin Howell", "external_links": [], "published": "2018-01-22T07:08:00.000+02:00", "crawled": "2018-01-22T07:25:25.002+02:00", "highlightTitle": ""}