{"organizations": [], "uuid": "437e7eb2c33e779224d6674e36448994a17a5e2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226358204&w=1200&r=LYNXMPEE0S1BQ", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-colombia-rebels/colombia-suspends-peace-talks-with-eln-rebels-after-bomb-attacks-idUKKBN1FI27S", "country": "US", "domain_rank": 408, "title": "Colombia suspends peace talks with ELN rebels after bomb attacks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T19:18:00.000+02:00", "replies_count": 0, "uuid": "437e7eb2c33e779224d6674e36448994a17a5e2d"}, "author": "", "url": "https://uk.reuters.com/article/uk-colombia-rebels/colombia-suspends-peace-talks-with-eln-rebels-after-bomb-attacks-idUKKBN1FI27S", "ord_in_thread": 0, "title": "Colombia suspends peace talks with ELN rebels after bomb attacks", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}, {"name": "santos", "sentiment": "none"}, {"name": "juan manuel santos", "sentiment": "none"}, {"name": "helen murphy", "sentiment": "none"}], "locations": [{"name": "colombia", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}], "organizations": [{"name": "eln", "sentiment": "negative"}, {"name": "national liberation army", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 5:18 PM / Updated 2 hours ago Colombia suspends peace talks with ELN rebels after bomb attacks Julia Symmes Cobb , Helen Murphy 4 Min Read \nBOGOTA (Reuters) - Colombia’s President Juan Manuel Santos on Monday suspended peace talks with Marxist ELN rebels after a series of bombings over the weekend killed seven police officers and injured dozens. \nThe government and the National Liberation Army (ELN) have been in talks since February 2017 to end a five decade war, but Santos said he will not accept the group’s continued violence after it launched attacks on three police stations nationwide on Saturday and Sunday. \n“My patience and the patience of the Colombian people has its limits, so I have taken the decision to suspend the start of the fifth cycle of negotiations, which was scheduled for the coming days, until we see coherence between the ELN’s words and its actions,” Santos said at an event close to Bogota. \nFive police officers were killed and more than 40 wounded on Saturday morning when the ELN detonated a bomb in the northern port city of Barranquilla as they lined up to receive orders. \nTwo more died and one was wounded just before midnight on Saturday in rural Bolivar province, and the third attack took place about four hours later in the city of Soledad, close to Barranquilla, injuring five police and one civilian. \n“The authorship of these terrible actions is on the head of the National Liberation Army,” Defense Minister Luis Carlos Villegas said earlier on Monday, adding that the violence raised the question of whether the group wants peace. FORMAL TALKS \nThe 2,000-strong ELN and the government have been in formal peace talks for nearly a year, and the two sides agreed to their first-ever ceasefire in October. But the rebels launched a new offensive when the ceasefire expired earlier this month, killing security force members, bombing major oil pipelines and kidnapping an oil contractor. \nA larger rebel group, the Revolutionary Armed Forces of Colombia (FARC), demobilized under a 2016 peace deal with the government. It is now a political party known as the Revolutionary Alternative Common Force. \nIn a statement on Monday, the ELN said it would support a new ceasefire but that attacks would continue in the absence of one. \nSantos, who won a Nobel Peace prize in 2016 for clinching peace with the FARC, had already recalled his negotiator from Quito talks after the ELN rebels launched this month’s offensive. \n“I will continue to work for peace, to build peace, until the final day of my government and until the final day of my life, because nothing is more important,” Santos said. \nSantos leaves office in August after two four-year terms. \nThe ELN, founded by radical Roman Catholic priests in 1964, has sought peace with the government before but made little progress. It is considered a terrorist group by the United States and European Union. \nThe ELN are considered more radical than the FARC and are less centralized. ELN spokespeople in Quito could not confirm on Sunday whether a statement from the group’s urban unit claiming responsibility for the Barranquilla attack was genuine. \nThe group opposes the presence of foreign companies in Colombia and regularly bombs pipelines and other oil infrastructure, which the state oil company Ecopetrol says has caused significant environmental damage. \nA man arrested after the first bombing in Barranquilla had been detained in 2015 in connection with an ELN cell, Villegas said. Reporting by Helen Murphy; Editing by Alistair Bell", "external_links": [], "published": "2018-01-29T19:18:00.000+02:00", "crawled": "2018-01-29T19:50:44.013+02:00", "highlightTitle": ""}