{"organizations": [], "uuid": "b807ff3d9473a66c9e04f91f18da29a4892d483d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 187, "shares": 187, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-canada-politics-senator/canadas-conservatives-expel-senator-over-indigenous-comments-idUSKBN1EU0D1", "country": "US", "domain_rank": 408, "title": "Canada's Conservatives expel senator over indigenous comments", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T06:26:00.000+02:00", "replies_count": 0, "uuid": "b807ff3d9473a66c9e04f91f18da29a4892d483d"}, "author": "", "url": "https://www.reuters.com/article/us-canada-politics-senator/canadas-conservatives-expel-senator-over-indigenous-comments-idUSKBN1EU0D1", "ord_in_thread": 0, "title": "Canada's Conservatives expel senator over indigenous comments", "locations": [], "entities": {"persons": [{"name": "andrew scheer", "sentiment": "none"}, {"name": "anna mehler paperny", "sentiment": "none"}, {"name": "lynn beyak", "sentiment": "none"}, {"name": "scheer", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 4:27 AM / Updated 15 hours ago Canada's Conservatives expel senator over indigenous comments Anna Mehler Paperny 2 Min Read \nTORONTO (Reuters) - Canada’s opposition Conservatives kicked a lawmaker out of the party after she posted letters on her official government website that derided indigenous people and then refused to take them down from the site. \nConservative Party leader Andrew Scheer said Thursday evening that he ejected Senator Lynn Beyak over the letters posted on her website. The letters claimed that indigenous Canadians were “pampered” in abusive residential schools and that they were looking for government handouts. \n“Promoting this comment is offensive and unacceptable for a Conservative Parliamentarian,” Scheer said in a statement. “To suggest that indigenous Canadians are lazy compared to other Canadians is simply racist.” \nCanadian Senators are appointed for life, though they can be expelled from political parties. \nSome people have called for Beyak’s resignation since she last year defended residential schools. \nSome 150,000 children were taken from their families and sent to assimilationist schools where they were physically and sexually abused. A government commission that investigated the schools determined that their treatment of indigenous children amounted to “cultural genocide.” \nFormer Prime Minister Stephen Harper formally apologized for the schools in 2008 and Canada has provided billions of dollars in compensation to victims. \nAboriginal people continue to be over-represented among Canada’s poor, victims of violence and its prison population. People on reserves often lack clean drinking water and education for indigenous children is under-funded. \nPrime Minister Justin Trudeau in November told the United Nations General Assembly that his government would do better to improve the lives of aboriginals and achieve reconciliation. By Anna Mehler Paperny in Toronto; Editing by Jim Finkle and Michael Perry", "external_links": [], "published": "2018-01-05T06:26:00.000+02:00", "crawled": "2018-01-05T06:43:12.000+02:00", "highlightTitle": ""}