{"organizations": [], "uuid": "486b50ddd1af60c840a53ef8911d5449f3d8ebe7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 359, "shares": 359, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225797106&w=1200&r=LYNXMPEE0Q0JL", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey/turkey-says-u-s-has-promised-to-stop-arming-ypg-warns-washington-on-manbij-idUSKBN1FG0P4", "country": "US", "domain_rank": 408, "title": "Turkey says U.S. has promised to stop arming YPG, warns Washington on Manbij", "performance_score": 3, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T17:29:00.000+02:00", "replies_count": 0, "uuid": "486b50ddd1af60c840a53ef8911d5449f3d8ebe7"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey/turkey-says-u-s-has-promised-to-stop-arming-ypg-warns-washington-on-manbij-idUSKBN1FG0P4", "ord_in_thread": 0, "title": "Turkey says U.S. has promised to stop arming YPG, warns Washington on Manbij", "locations": [], "entities": {"persons": [{"name": "manbij tuvan gumrukcu", "sentiment": "none"}, {"name": "angus mcdowall", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "manbij", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "pkk", "sentiment": "none"}, {"name": "kurdistan workers party", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 3:29 PM / in an hour Turkey says U.S. has promised to stop arming YPG, warns Washington on Manbij Tuvan Gumrukcu , Angus McDowall 5 Min Read \nANKARA/BEIRUT (Reuters) - The United States has pledged to stop supplying weapons to a Kurdish militia in Syria, Turkey said on Saturday, calling on Washington to immediately remove its troops from a Syrian town of Manbij that Turkish forces plan to target. \nTurkey’s air and ground offensive in northwest Syria’s Afrin region against the Kurdish YPG militia has opened a new front in the seven-year, multi-sided Syrian civil war and strained ties with NATO ally Washington. \nAnkara views the YPG as terrorists and as an extension of the outlawed Kurdistan Workers Party (PKK) and has been infuriated by U.S. support, including arms and training, for the militia. The Kurdish fighters have played a prominent role in U.S.-led efforts to combat the hardline Islamic State in Syria. \nSince the start of the eight-day-old incursion, dubbed “Operation Olive Branch” by Ankara, President Tayyip Erdogan has said Turkish forces would push east toward the town of Manbij, potentially putting them in confrontation with U.S. troops deployed there. \nU.S. National Security Adviser H.R. McMaster told Erdogan’s spokesman, Ibrahim Kalin, in a telephone call that the United States would no longer provide weapons to the YPG, the Turkish presidency said on Saturday. \n“It was emphasized that Turkey’s legitimate security concerns must be paid attention to. It was agreed that close coordination would be carried out in order to avoid misunderstandings,” it said. \nThe agreement is likely to be seen by Ankara as a substantial diplomatic victory from the incursion, where Turkish troops and their Syrian rebel allies appear to have made modest advances, as heavy rain and poor weather have hampered air strikes and progress on the ground. \nTurkey’s foreign minister said the United States needed to follow up its promise with concrete action, including the immediate withdrawal of its troops from the vicinity of Manbij. \n“The United States needs to break its link with (the) terrorist organization and make them drop their weapons completely. They need to collect the weapons they gave, they need to withdraw from Manbij immediately,” Mevlut Cavusoglu told reporters on Saturday. \nThe U.S. State Department did not immediately respond to requests for comment about ending arms to the YPG or exiting Manbij. ERDOGAN LOOKS EAST A member of Turkey-backed Free Syrian Army police forces stands guard on the road near Azaz, Syria January 27, 2018. REUTERS/Yesim Dikmen \nErdogan said this week that Turkish forces would sweep Kurdish fighters from the length of Syrian border and could push all the way east to the frontier with Iraq, a move that would risk a possible confrontation with U.S. forces allied to the Kurds. \nAny drive by Turkish forces toward Manbij, part of Kurdish-held territory some 100 km (60 miles) east of Afrin, could also threaten U.S. efforts to stabilize northern Syria. The United States has about 2,000 troops in Syria, officially as part of the international coalition against Islamic State. \nU.S. forces were deployed in and around Manbij to deter Turkish and U.S.-backed rebels from attacking each other and have also carried out training missions in the area. \nA senior official for the U.S.-backed Syrian Democratic Forces (SDF), an alliance of Syrian fighters spearheaded by the Kurdish YPG, said any wider Turkish assault would face an “appropriate response”. Slideshow (4 Images) \nRedur Xelil also said in an interview that he was sure the U.S.-led coalition against Islamic State, which has backed the SDF in its battle against the jihadists, was trying to put pressure on Turkey to limit its offensive. DEATH TOLL \nTurkey and its Free Syrian Army (FSA) rebel allies have killed a total of 394 militants since the incursion began, Erdogan said on Saturday. Turkey and the FSA rebel factions have together lost 20 people he said, without giving a breakdown. \nLater on Saturday, the Turkish military said that two soldiers and two FSA fighters had been killed and another 11 soldiers and four FSA fighters had been lightly wounded in clashes on Saturday. \nIn a statement, the military also said 447 militants had been “neutralized” since the operation had started, with 57 of those on Saturday. \nThe SDF has accused Turkey of exaggerating the number of Kurdish fighters it has killed. \nThe Syrian Observatory for Human Rights, a Britain-based war monitoring group, said that 36 civilians in Afrin, including 10 children, have died so far. \nA total of 59 YPG fighters and at least 69 fighters from the Turkey-backed FSA have died in clashes, the Observatory said. Seven Turkish soldiers have been killed and another seven are missing, it said. Additional reporting by Yeganeh Torbati in Washington; Writing by David Dolan; Editing by Louise Heavens", "external_links": [], "published": "2018-01-27T17:29:00.000+02:00", "crawled": "2018-01-27T17:37:21.011+02:00", "highlightTitle": ""}