{"organizations": [], "uuid": "9be338fcb9ec9aeace39620b528fe39fb1a1a08f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226249129&w=1200&r=LYNXMPEE0S0L6", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-volkswagen-emissions-monkey/vw-supervisory-board-members-demand-inquiry-into-diesel-fume-tests-on-monkeys-idUKKBN1FI0VR", "country": "US", "domain_rank": 408, "title": "VW supervisory board members demand inquiry into diesel fume tests on monkeys", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T11:29:00.000+02:00", "replies_count": 0, "uuid": "9be338fcb9ec9aeace39620b528fe39fb1a1a08f"}, "author": "", "url": "https://uk.reuters.com/article/us-volkswagen-emissions-monkey/vw-supervisory-board-members-demand-inquiry-into-diesel-fume-tests-on-monkeys-idUKKBN1FI0VR", "ord_in_thread": 0, "title": "VW supervisory board members demand inquiry into diesel fume tests on monkeys", "locations": [], "entities": {"persons": [], "locations": [{"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "vw", "sentiment": "negative"}, {"name": "european research group on environment and health", "sentiment": "none"}, {"name": "daimler", "sentiment": "none"}, {"name": "volkswagen", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "eugt", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 9:33 AM / Updated 2 hours ago VW faces inquiry call over diesel fumes test on monkeys Jan Schwartz , Edward Taylor 4 Min Read \nFRANKFURT (Reuters) - Volkswagen’s ( VOWG_p.DE ) supervisory board called for an immediate inquiry into who commissioned tests in which monkeys were exposed to toxic diesel fumes, while the German government said such studies were unjustifiable. \n“I will do everything possible to ensure that this matter is investigated in detail,” Volkswagen supervisory board Chairman Hans Dieter Poetsch said in a statement on Monday. \n“Whoever is responsible for this must of course be held accountable,” Poetsch said in response to a New York Times report on Friday that German carmakers had used an organization called European Research Group on Environment and Health in the Transport Sector (EUGT) to commission the tests. \nThe study, conducted in 2014, was designed to defend diesel following revelations that the fuel’s exhaust fumes were carcinogenic, the newspaper reported. \nReuters could not immediately confirm the details and purpose of the study and EUGT, which was dissolved last year, could not be reached for comment. \nEUGT received all of its funding from VW and fellow German carmakers Daimler and BMW, the New York Times said. UNJUSTIFIABLE TESTS \nVolkswagen, Daimler and BMW on Saturday denounced the study, whose revelation is the latest aftershock from the VW emissions-rigging scandal, which continues to rock the auto industry. \nVolkswagen has pledged never to test with animals again, Thomas Steg, VW’s chief lobbyist, told German daily Bild in an interview to be published on Tuesday. “We want to absolutely rule out testing on animals for the future so that this doesn’t happen again,” Bild quoted Steg as saying. A car with the Volkswagen VW logo badge is seen on display at the North American International Auto Show in Detroit, Michigan, U.S., January 16, 2018. REUTERS/Jonathan Ernst \nOn Monday Volkswagen said that some staff members, whom it did not identify, including some in its legal department, at the VW brand’s technical development division and at Volkswagen of America, had been aware of the tests at the time. \nBut Volkswagen said the study was never discussed in any management board meetings, after Bild earlier reported that an internal e-mail showed that at least some senior managers were informed about the design of the research. \nIn another related development, German daily Stuttgarter Zeitung reported on Sunday that EUGT also sponsored scientific studies testing nitrogen dioxide, a gas found in exhaust fumes, on people. \nAachen University’s research hospital confirmed on Monday that EUGT had sponsored a study in 2013 and 2014 but said it was related to workplace safety, not diesel emissions. \nAs part of the study, 25 people were exposed to varying levels of nitrogen dioxide for three hours to investigate the possible health effects of the chemical compound in concentrations below the limit for workplaces, Uniklinik RWTH Aachen said in a statement. \nThe German government said on Monday that any auto emissions testing on monkeys or people was unjustifiable. \n“These tests on monkeys or even people are in no ethical way justifiable and raise many critical questions about those who are behind the tests,” government spokesman Steffen Seibert told a regular government news conference in Berlin. \nStephan Weil, who represents the German state of Lower Saxony, a VW shareholder, on the carmaker’s supervisory board, said the board was pressing the carmaker to urgently provide information about what the aim of the studies was. \n“After the matter has been cleared up there will also be the question of who was personally responsible,” he said at a news conference on Monday. Related Coverage", "external_links": [], "published": "2018-01-29T11:29:00.000+02:00", "crawled": "2018-01-29T11:58:10.021+02:00", "highlightTitle": ""}