{"organizations": [], "uuid": "c9d7f276aaec38b391b96e25c982b802619f68e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225142803&w=1200&r=LYNXMPEE0O0X7", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/davos-meeting-dollar/u-s-sparks-fears-of-trade-war-as-trump-arrives-in-davos-idINKBN1FE1P8", "country": "US", "domain_rank": 408, "title": "U.S. sparks fears of trade war as Trump arrives in Davos", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:44:00.000+02:00", "replies_count": 0, "uuid": "c9d7f276aaec38b391b96e25c982b802619f68e6"}, "author": "", "url": "https://in.reuters.com/article/davos-meeting-dollar/u-s-sparks-fears-of-trade-war-as-trump-arrives-in-davos-idINKBN1FE1P8", "ord_in_thread": 0, "title": "U.S. sparks fears of trade war as Trump arrives in Davos", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "yara bayoumy", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "davos noah barkin", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "mnuchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}, {"name": "u.s treasury", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - U.S. President Donald Trump said on Thursday he ultimately wants the dollar to be strong, lifting the greenback and contradicting comments made by Treasury Secretary Steven Mnuchin one day earlier.\n“The dollar is going to get stronger and stronger and ultimately I want to see a strong dollar,” Trump said in an interview with CNBC, adding that Mnuchin’s comments had been misinterpreted.\nFollowing the president’s comments, the dollar pared losses against major currencies.\nTrump said he believed Mnuchin’s comments were taken out of context, the United States was strong economically and in other ways, and that nobody should be talking about the dollar.\n“It should be what it is, it should also be based on the strength of the country - we are doing so well,” Trump said in the interview after he arrived at the World Economic Forum in Davos, Switzerland.\nA day after sending the dollar reeling with comments supportive of a weak U.S. currency, Mnuchin played down his comments on Wednesday that a weaker dollar was “good for us as it relates to trade and opportunities,” saying they had been “balanced and consistent”.\nThe remarks were seen by markets as departing from traditional U.S. currency policy and elicited thinly veiled warnings from European finance ministers as Trump arrived in Davos to promote his “America First” agenda.\n“I thought my comment on the dollar was actually quite clear yesterday,” Mnuchin told reporters. “I thought it was actually balanced and consistent with what I’ve said before, which is, we are not concerned with where the dollar is in the short term.”\nMnuchin said there were “both advantages and disadvantages of where the dollar is in the short term” and stressed that the United States wanted fair economic competition.\n“We want free and fair and reciprocal trade. So I think it’s very clear. We’re not looking to get into trade wars. On the other hand, we are looking to defend America’s interests.”\nBut the finance ministers of France and Italy expressed concerns about Mnuchin’s remarks, which pushed the dollar down to multiyear lows.\n“It’s not clear what kind of dollar the president and the Treasury want, but it still doesn’t sound like they really want a strong dollar given the fact that they are aiming to boost exports,” said foreign exchange strategist Vassili Serebriakov of Credit Agricole in New York.\nThe dollar index, which measures the greenback against a basket of six major currencies, edged up after slipping nearly 1 percent to a fresh three-year low. The index has fallen about 12 percent since April 12 when Trump told the Wall Street Journal that the dollar “is getting too strong.”\nA stronger euro, hovering at a three-year peak against the dollar, could hurt the European economy by making its exports less competitive. It also risks complicating the European Central Bank’s exit from years of ultra-loose monetary policy.\n“We want currency levels to reflect economic fundamentals,” French Finance Minister Bruno Le Maire told reporters in Davos, saying this was the official position of the Group of Seven, of which the United States is a member.\n“We hope that it remains the common position because it is the responsible position from an economic point of view.”\nU.S. President Donald Trump waves as he arrives in Zurich, Switzerland January 25, 2018. REUTERS/Carlos Barria His Italian counterpart, Pier Carlo Padoan, said Mnuchin’s comments reminded him of American policy in the 1970s, and expressed concern about a trade war.\n“I hope not. But history tells us that if there is a move which impacts trade toward more protectionism in one country, then the temptation for the other partner to do the same or to retaliate is very high and increases, so things may get out of hand,” he told Reuters in an interview.\nBritish Chancellor of the Exchequer Philip Hammond, on a panel with Mnuchin, said that the British pound, which tumbled after the 2016 Brexit vote to leave the European Union, had been appreciating.\nHe turned to Mnuchin and added: “And we seem to be recovering quite a bit more, Steve, thanks very much.”\nPREDATORY\nSlideshow (4 Images) After Mnuchin’s remarks on Wednesday, Commerce Secretary Wilbur Ross denied his colleague was advocating a weaker dollar, but when asked about the risk of trade wars, he told CNBC: “Trade war has been in place for quite a little while, the difference is the U.S. troops are now coming to the ramparts.”\nSpeaking at the Thursday morning news conference, Ross said: “People are using some predatory practices against us, and we’re not flinching from that.”\nThe comments came a day after European leaders, without specifically mentioning the United States, warned against a rise in nationalism and protectionism.\nChinese Foreign Ministry spokeswoman Hua Chunying said in Beijing on Thursday that the country’s leaders were committed to openness.\n“I believe everyone has already noticed that at the end of last year China has taken real steps to greatly loosen its financial industry, market access and others,” she said.\nTrump is due to speak on Friday, the final day of the four-day gathering of chief executives, bankers, academics and celebrities which has become a synonymous with the “global elite” that he railed against.\nMnuchin said he had met the economic adviser to Chinese President Xi Jinping and had a “very good and open dialogue”, talking about North Korea sanctions and trade.\n“We’re working together on the issue of the trade deficit in a mutual desire to shrink the trade deficit. We talked about some very specific ideas that we both have on that.”\nAsked about negotiations between the United States, Canada and Mexico to rework the North American Free Trade Agreement (NAFTA), Ross said it was more important to get a “proper deal” than a quick agreement.\nBut he conceded that a Mexican presidential election, Canadian provincial elections and the U.S. congressional elections - all this year - could complicate the talks if they drag on.\n“As we move further into the year, the political calendar gets more complicated,” Ross said.\nAdditional reporting by Alessandra Galloni, Soyoung Kim, Silvia Aloisi; Makini Brice in Washington, Megan Davies in New York; Writing by Noah Barkin and Yara Bayoumy,; Editing by William Maclean, Angus MacSwan and Jonathan Oatis\n ", "external_links": [], "published": "2018-01-25T14:44:00.000+02:00", "crawled": "2018-01-25T15:35:46.002+02:00", "highlightTitle": ""}