{"organizations": [], "uuid": "a146b471d6c094f3242bcfe91ac36bc903dd4e07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-ap-fact-check-shutdown-wouldnt-halt-military.html", "country": "US", "domain_rank": 767, "title": "AP FACT CHECK: Shutdown wouldn't halt military", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T07:40:00.000+02:00", "replies_count": 0, "uuid": "a146b471d6c094f3242bcfe91ac36bc903dd4e07"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-ap-fact-check-shutdown-wouldnt-halt-military.html", "ord_in_thread": 0, "title": "AP FACT CHECK: Shutdown wouldn't halt military", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "jim mattis", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "pentagon", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "pentagon", "sentiment": "none"}, {"name": "defense", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — It's a stretch, at best, to think the military would bear the brunt of a partial government shutdown, as President Donald Trump asserted Thursday at the Pentagon.\nAlthough he was meeting Defense Secretary Jim Mattis and other senior Pentagon officials to get briefed on two key defense reports — on nuclear policy and defense strategy — Trump emphasized in remarks to reporters that the budget showdown was uppermost on his mind. Republicans and Democrats were scrambling to avert a shutdown, which could come at midnight Friday if no deal is made.\nHe mischaracterized the dispute as something that could shut down \"the country,\" not just parts of the government. That might be written off as a slip of the tongue, but his statements about the consequences to the armed forces were deliberate, and off base. Meantime, the blame game raged between Democrats and Republicans.\nA look at his comments:\nTRUMP: \"If for any reason it shuts down, the worst thing is what happens to the military.\" He added, \"The group that loses big would be the military.\"\nTHE FACTS: Actually, the military would continue to operate normally, at least in the near term, in the event of a partial government shutdown. All military members would be required to report for work as usual. Paychecks would be delayed only if the shutdown lasted beyond Feb. 1, because pay is issued only twice a month, on the first and the 15th.\nTrump appeared to be making a larger political point — that the military has been hurt by years of short-term budget fixes that have forced curtailment of investments in modernizing the force and have prevented the Pentagon from executing a long-term budget plan. And he was pointing a finger at his political opposition — the Democrats in Congress who, along with Republicans, were working to pass a stopgap spending bill to avert a shutdown.\n\"We're rebuilding our military, we're making us — we're bringing it to a level that it's never been at,\" Trump said. \"And the worst thing is for our military; we don't want that to happen.\"\nBut the effort to boost military spending substantially continues as part of the budget process and would not be crushed by a partial shutdown that actually exempts the 1.3 million uniformed military personnel and some of the Pentagon's civilian workforce.\nTrump has made a military buildup a centerpiece of his agenda, but it has not happened. The 2011 Budget Control Act forced across-the-board budget cuts and has constrained military spending ever since. Ending those constraints is part of the current budget debate.\nHouse Speaker Paul Ryan, a Wisconsin Republican, focused Thursday on the broader issue of fully funding the military, which he said has been shortchanged.\n\"An adequate budget agreement means lifting the spending caps that disproportionately hamstring the defense budget, holding our national security hostage,\" Ryan said in remarks at the Center for Strategic and International Studies. \"The Pentagon cannot plan for the future if it keeps operating under these short-term spending bills.\"\nTRUMP: \"If the country shuts down, which could very well be, the budget should be handled a lot differently than it's been handled over the last long period of time — many years.\"\nTHE FACTS: The United States is not at risk of shutting down at all. Neither is the entire government, for that matter.\nIn a nutshell, a partial shutdown would mean that hundreds of thousands of federal workers would be idled, some national parks could close, and certain other services, deemed non-essential, would stop.\nBut the air traffic control system, food inspection, Medicare, veterans' health care and many other essential government programs would run as before. The Social Security Administration would continue to pay benefits and take applications. The Postal Service would run as usual, and the 1.3 million uniformed military personnel would still be on duty. National security operations would continue.\nWhether they work through a partial shutdown or not, federal workers can't get paid during a lapse in funding. In the past, however, they have been repaid retroactively even if they were ordered to stay home.\nSENATE MAJORITY LEADER MITCH MCCONNELL: \"Senate Democrats represent tens of thousands of children who depend on #CHIP. Why they would threaten to turn their backs on children?\" ''Stop playing political football with the health care of our children.\" — tweets Thursday.\nSENATE DEMOCRATIC LEADER CHUCK SCHUMER: \"Of course Democrats support CHIP, Sen. McConnell, you know that darn well. If we were in charge of this chamber, we would never, never have let it expire. But your majority did. ... And Republicans pretend that Democrats are against CHIP.\" — remarks Thursday on Senate floor.\nTHE FACTS: McConnell's statements gloss over Republicans' role in leaving the Children's Health Insurance Program in its current predicament. Covering nearly 9 million children from low-income families, the program expired in October and has lacked long-term money ever since as the GOP-controlled Congress focused on passing a tax overhaul plan and attempting to repeal former President Barack Obama's health care law.\nBut when both parties support a program yet can't get it done, there's usually blame to spread around. Democrats and Republicans agree that financing for CHIP should be renewed, but they've clashed over how to pay for it.\nOriginally insisting on offsets such as cuts to \"Obamacare\" and Medicare to pay for CHIP, Republicans now say they are willing to provide a six-year extension without spending cuts and attached it to the short-term spending bill that would avoid a government shutdown. Democrats, meantime, have insisted on a deal that would also protect young immigrants who came to the country illegally as children.\nAn initial bipartisan deal to extend the program for five years, led by Senate Finance Committee Chairman Orrin Hatch, R-Utah, and that panel's top Democrat, Ron Wyden of Oregon, was struck in September.\nSchumer's claim that Democrats would never let the program expire is partly true. The last time CHIP funding lapsed came after Republican President George W. Bush in 2007 vetoed long-term authorization bills that had been approved by a Democratic-controlled Congress. A reauthorization to CHIP at that time was finally signed into law when Obama became president in 2009.\nA report this month by the Georgetown University Center for Children and Families estimates states would probably begin to feel the impact of dwindling CHIP funds next month — 11 states could face shortfalls before the end of February and a total of 24 in March.\nFind AP Fact Checks at http://apne.ws/2kbx8bd \nFollow @APFactCheck on Twitter: https://twitter.com/APFactCheck \nAssociated Press writer Cal Woodward contributed to this report.\nEDITOR'S NOTE _ A look at the veracity of claims by political figures", "external_links": [], "published": "2018-01-19T07:40:00.000+02:00", "crawled": "2018-01-19T09:50:05.006+02:00", "highlightTitle": ""}