{"organizations": [], "uuid": "e9b4720e6316b27c180354e3bb86839eb62edc2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225667110&w=1200&r=LYNXMPEE0Q03D", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-southkorea-fire/south-korea-agonises-over-latest-tragedy-as-it-probes-hospital-blaze-idUKKBN1FG045", "country": "US", "domain_rank": 408, "title": "South Korea agonises over latest tragedy as it probes hospital blaze", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T05:06:00.000+02:00", "replies_count": 0, "uuid": "e9b4720e6316b27c180354e3bb86839eb62edc2a"}, "author": "", "url": "https://uk.reuters.com/article/uk-southkorea-fire/south-korea-agonises-over-latest-tragedy-as-it-probes-hospital-blaze-idUKKBN1FG045", "ord_in_thread": 0, "title": "South Korea agonises over latest tragedy as it probes hospital blaze", "locations": [], "entities": {"persons": [{"name": "lee byung-hee", "sentiment": "none"}, {"name": "yuna park", "sentiment": "none"}, {"name": "lee", "sentiment": "none"}, {"name": "cynthia kim", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "sejong hospital", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "miryang", "sentiment": "none"}], "organizations": [{"name": "min read  seoul", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 3:09 AM / Updated an hour ago South Korea's Moon visits hospital fire scene, agonises over series of disasters Cynthia Kim , Yuna Park 4 Min Read \nSEOUL (Reuters) - South Korean officials rushed to identify 37 victims of a hospital blaze and pinpoint the cause on Saturday as President Moon Jae-in visited the burnt-out building and decried “one tragedy after another” to strike the country. \nFlames and toxic smoke swept through the Sejong Hospital in the southern city of Miryang on Friday, injuring more than 150 people, just weeks after a fire killed 29 people at a fitness centre. All the hospital victims died from smoke inhalation. \nMoon visited the fire scene where he spoke to grieving family members and firefighters. \n“Its tragic, and it hurts me to see this kind of one tragedy after another, even as the government has vowed to make this country safe,” Moon said. \nHe ordered a full inquiry and said “utmost government efforts” were needed to support the injured and families of the victims. \nThe government of Asia’s fourth-largest economy, with one of the world’s fastest ageing populations, has faced criticism in recent years over poor safety standards, including the Sewol ferry disaster of 2014 in which more than 300 people, mostly schoolchildren, drowned. \nHospital director Song Byeong-cheol said the six-storey hospital did not have a sprinkler system and was not large enough to require one under the law. \nThe opposition Liberal Party was quick to condemn Moon for the disaster. \n“The Moon administration should have at least kept South Koreans safe, to justify the launch of this government,” the party said in a statement, demanding a “master plan” to protect citizens. \nMoon’s ruling Democratic Party said it would “embark on parliamentary discussions to legally support and protect citizens lives and safety”, a spokesman said. \nHam Eun-gu, a professor at Open Cyber University of Korea, said safety checks at many private hospitals, including Sejong Hospital, were often carried out as a formality and not strictly enforced. Firefighters rescue a patient from a hospital in Miryang, South Korea. Flames and toxic smoke swept through the hospital on Friday, killing at least 37 people and injuring more than 140. Kim Gu-Yeon/Gyeongn Domin Ilbo/via REUTERS \n“Given that there has been a string of big fire accidents, the Moon administration won’t be able to just overlook this and let it go. (The government) will need to toughen fire safety regulations,” Ham said. \nLast month, 29 people were killed in a blaze at an eight-storey fitness centre in Jecheon City, most of them women trapped in a sauna. That disaster fuelled anger over reports of shoddy construction, among other shortcomings. \nIn 2014, a fire at a rural hospital killed 21 people, while a 2008 warehouse fire outside Seoul killed 40. Slideshow (4 Images) \nMany survivors of Friday’s blaze “walked though fire and smoke” to escape, a city official told Reuters on Friday. \nThose on upper floors used fire engine ladders and plastic escape slides, while firefighters carried some who could not walk. \n“I saw elderly patients scrambling out through the windows and had to help,” said Woo Young-min, 25, as he stood in his pyjamas outside the hospital. \nThe fire broke out at the rear of the emergency room on the hospital’s first floor, fire official Choi Man-woo told reporters. \nTelevision broadcast images of black smoke billowing from the windows and entrance. \nAt least 177 patients, most of them elderly, were in the hospital and a nursing home next door when the fire broke out, hospital director Song told reporters. \nSong said three of the nine hospital staff on duty at the time died - at least one doctor, a nurse and a nurse’s aide. \nMost of those who died were on the first and second floors, said Choi. Reporting by Cynthia Kim and Yuna Park; Additional reporting by Christine Kim; Editing by Nick Macfie; Editing by Nick Macfie", "external_links": [], "published": "2018-01-27T05:06:00.000+02:00", "crawled": "2018-01-27T05:27:42.004+02:00", "highlightTitle": ""}