{"organizations": [], "uuid": "3aa7a5cb45ba067db6fbd1b1a6b47a9fd2895d64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-2-chile-open-to-increasing-sqm-lithium-quota-to-satisfy-tesla-corfo.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-Chile open to increasing SQM lithium quota to satisfy Tesla -Corfo", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T23:39:00.000+02:00", "replies_count": 0, "uuid": "3aa7a5cb45ba067db6fbd1b1a6b47a9fd2895d64"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-2-chile-open-to-increasing-sqm-lithium-quota-to-satisfy-tesla-corfo.html", "ord_in_thread": 0, "title": "UPDATE 2-Chile open to increasing SQM lithium quota to satisfy Tesla -Corfo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds no comment from Tesla)\nSANTIAGO, Jan 29 (Reuters) - Chile is open to negotiating an additional quota of lithium for local miner SQM to meet potential demand from U.S. electric car-maker Tesla, Eduardo Bitran, head of Chilean development agency Corfo, told Reuters on Monday.\nBitran said Tesla and SQM were \"exploring\" opportunities after Tesla expressed interest in buying \"important volumes\" of lithium hydroxide, a key ingredient in the batteries used in electric vehicles, from SQM.\nTesla declined comment. SQM did not immediately respond to request for comment.\nThe talks between SQM, one of the world's top lithium producers, and Tesla, a leading electric-vehicle manufacturer, follow an agreement struck earlier this month between the miner and the Chilean government that will allow the company to increase its quota in the Salar de Atacama, one of the world's richest lithium deposits.\nThe agreement between the government and SQM, which ended a multi-year spat over royalty payments, also seeks to incentivize value-added production in Chile by requiring SQM to supply the country with 25 percent of its lithium output at a favorable price.\nBitran said he had met recently with Tesla in the United States to discuss potential investments by the automaker in Chile.\nDuring that meeting, Bitran said he had proposed a project to Tesla in which SQM would provide brine, the raw material from which lithium is produced, to the carmaker for refining into battery component lithium hydroxide in Chile.\n\"What we said is that we would be willing to negotiate additional quota to make this possible,\" said Bitran, referencing the meeting.\nBitran had previously said Chile could earn up to $7.5 billion in royalties by 2030 from a new contract with SQM . (Reporting by Felipe Iturrieta; Additional reporting by Alexandria Sage in San Francisco; Writing by Dave Sherwood; Editing by Andrea Ricci and Sandra Maler)", "external_links": [], "published": "2018-01-29T23:39:00.000+02:00", "crawled": "2018-01-30T05:25:55.007+02:00", "highlightTitle": ""}