{"organizations": [], "uuid": "c8a9307a724119ca5defdfd8bbaf40da57743378", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 161, "shares": 161, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226214748&w=1200&r=LYNXMPEE0S0EV", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-philippines-transport-jeepneys/philippines-to-phase-out-its-beloved-cheap-but-rickety-jeepneys-idUSKBN1FI0IJ", "country": "US", "domain_rank": 408, "title": "Philippines to phase out its beloved cheap but rickety jeepneys", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T08:45:00.000+02:00", "replies_count": 0, "uuid": "c8a9307a724119ca5defdfd8bbaf40da57743378"}, "author": "", "url": "https://www.reuters.com/article/us-philippines-transport-jeepneys/philippines-to-phase-out-its-beloved-cheap-but-rickety-jeepneys-idUSKBN1FI0IJ", "ord_in_thread": 0, "title": "Philippines to phase out its beloved cheap but rickety jeepneys", "locations": [], "entities": {"persons": [{"name": "ronn bautista", "sentiment": "negative"}, {"name": "karen lema", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANILA (Reuters) - Jeepneys, the flamboyant passenger trucks of the Philippines, are nearing the end of their reign as the “Kings of the Road”, but they’re not going down without a fight.\nGovernment moves to overhaul outdated public transport, making it safer and more environment friendly, will put the brakes on a mode of travel that has long been the surest and cheapest option in a country of 105 million people.\nBut the operators and drivers of the 200,000 jeepneys that have plied the nation’s roads and highways for decades are defiant, denouncing moves to oust them as “anti-poor” and a threat to their livelihoods.\n“It is a big hassle to us poor people since we are the ones suffering,” said one jeepney driver, upset after traffic police pulled him over because his vehicle was belching black smoke.\nJeepneys have evolved from surplus army jeeps left behind by the U.S. military after World War Two to become brightly-painted vehicles festooned with religious slogans, horoscope signs or family names.\nAt a cost of 8 pesos ($0.16) for a journey of 4 km (2.5 miles) in Manila, the capital, they are easily affordable, but the ride is far from comfortable.\nA typical jeepney packs in 10 to 16 commuters, sitting knee-to-knee on twin benches, and lacks air-conditioning or windows to shield occupants from the heat, rain and choking fumes.\nIn Metro Manila, one of Asia’s most gridlocked mega-cities, passengers can sit there for hours.\nThere are no seatbelts and commuters have only ceiling bars to keep from being thrown off their seats as drivers race to beat traffic lights or edge out competitors for waiting passengers.\nA jeepney prototype is painted by a worker at an assembly plant in Valenzuela City, Metro Manila Philippines October 5, 2017. Picture taken October 5, 2017. REUTERS/Dondi Tawatao The government wants to force unsound and shabby jeepneys off the streets in favor of bigger, cleaner, safer and more modern replacements, some electric, others using cleaner fuel.\nBut drivers complain that the newer units, priced around 1.8 million pesos ($35,327), are prohibitively expensive, and government subsidies are paltry.\nSome fear vested interests are at play.\nSlideshow (2 Images) “They only want to kick out the operators so they could let corporations take over,” said George San Mateo, head of transport group PISTON, as he led a protest last week outside the transport regulator’s office.\n“The government is using this crackdown on dilapidated and smoke-belching jeepneys to force poor operators to buy new ones they cannot afford.”\nRegulators have said the plan, backed by President Rodrigo Duterte, aims simply to modernize public transport.\n“There’s a lot of public utility jeepneys which are old and dirty, so we have to address it,” Martin Delgra, chairman of the Land Transportation Franchising and Regulatory Board, told reporters.\n“We cannot compromise safety when it comes to roadworthiness.”\n($1=50.9530 pesos)\nEditing by Martin Petty and Clarence Fernandez\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-29T08:45:00.000+02:00", "crawled": "2018-01-29T08:53:55.021+02:00", "highlightTitle": ""}