{"organizations": [], "uuid": "161e89bdcabd496cd852b58fa2400b16362fba1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225957710&w=1200&r=LYNXMPEE0R040", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-russia-election-navalny-office/russian-police-seek-forced-entry-to-opposition-leader-navalnys-office-opposition-spokeswoman-idUSKBN1FH04Z", "country": "US", "domain_rank": 408, "title": "Russian police seek forced entry to opposition leader Navalny's office: opposition spokeswoman", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T08:56:00.000+02:00", "replies_count": 0, "uuid": "161e89bdcabd496cd852b58fa2400b16362fba1c"}, "author": "", "url": "https://www.reuters.com/article/us-russia-election-navalny-office/russian-police-seek-forced-entry-to-opposition-leader-navalnys-office-opposition-spokeswoman-idUSKBN1FH04Z", "ord_in_thread": 0, "title": "Russian police seek forced entry to opposition leader Navalny's office: opposition spokeswoman", "locations": [], "entities": {"persons": [{"name": "navalny", "sentiment": "negative"}, {"name": "denis pinchuk", "sentiment": "none"}, {"name": "alexei navalny", "sentiment": "none"}, {"name": "yarmysh", "sentiment": "none"}, {"name": "kira yarmysh", "sentiment": "none"}, {"name": "andrew osborn", "sentiment": "none"}, {"name": "katya golubkova", "sentiment": "none"}], "locations": [{"name": "navalny", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 6:47 AM / Updated 20 minutes ago Russia's Navalny detained as protesters point to poll fraud threat Maria Tsvetkova , Denis Pinchuk 4 Min Read \nMOSCOW (Reuters) - Russian police wrestled opposition leader Alexei Navalny into a patrol wagon on Sunday moments after he appeared at a rally to urge voters to boycott what he said would be a rigged presidential election in March. \nNavalny has little chance of influencing the election, likely to be won comfortably by President Vladimir Putin, but his ability to use social media to mobilize crowds of mostly young protesters in major cities has irked the Kremlin. \nThe numbers attending Sunday’s protests across Russia -- some shouting “Putin is a thief” -- appeared lower than previous demonstrations staged by Navalny, Reuters reporters said, suggesting momentum may have shifted away from him. \nVideo footage posted on social media showed Navalny appear on Moscow’s main thoroughfare, Tverskaya Street, a few hundred meters from the Kremlin, to join several hundred supporters taking part in the protest, which the authorities had said was illegal. \nHe had only walked a short distance when he was surrounded by police officers wearing helmets. They grabbed him and forced him to the ground on the pavement, and then dragged him feet first into the patrol wagon, the video footage showed. \nHe was held at a police precinct in central Moscow for several hours before being released without charges, his lawyer Olga Mikhailova told Reuters, adding that Navalny would face court at a later date. \nIf charged with violating laws on holding demonstrations, Navalny could face up to 30 days in prison. PROTEST NUMBERS \nNavalny emerged as a threat to the Kremlin’s tight grip on power on June 12 last year, when thousands of his followers defied police prohibitions to protest in cities across Russia. \nOn Sunday, around 1,500 protesters converged at Manezh Square, adjacent to the Kremlin, but were blocked from getting any further by metal barriers and dozens of police in riot gear. \nHundreds of people also protested in St. Petersburg, Russia’s second-biggest city, in Yekaterinburg in the Ural mountains, and other major centers. A still image taken from a video footage shows Russian Interior Ministry members detaining opposition leader Alexei Navalny during a rally for a boycott of a March 18 presidential election in Moscow, Russia January 28, 2018. NAVALNY.COM/Handout/Reuters TV via REUTERS \nBy 1830 Moscow time (1530 GMT), police had detained 257 protesters nationwide, according to OVD-Info, a non-governmental group that tracks the arrests. \nNavalny, who says he has faced a campaign of harassment from the authorities, has struggled to mobilize the same numbers in the two nationwide protests he has called since the breakthrough protest in June. \nIn Moscow on Sunday, the protesters who had accompanied Navalny until his detention were at times hard to distinguish from the flow of shoppers and sight-seers on Tverskaya Street. \nA Reuters reporter heard two American tourists asking if Putin “is coming to this parade?” A few meters from where Navalny was detained, a tour guide was telling a group of clients about the history of a pre-revolutionary mansion. Slideshow (27 Images) DOMINANT LEADER \nPutin, 65, has been in power, either as president or prime minister, since 2000, longer than veteran Soviet leader Leonid Brezhnev and outstripped only by dictator Josef Stalin. \nMany voters credit him with restoring stability after the turbulence following the collapse of the Soviet Union, and of rebuilding Russia’s influence abroad through his foreign policy. \nPutin has said the presidential election will be fair, and that Navalny, lacking real popular support, is irresponsibly trying to foment social anger which could tip Russia back into instability. \nPutin’s opponents say he is maintaining his grip on power by eroding democracy. \nAbout 200 protesters gathered in Vladivostok, on Russia’s Pacific coast, alleging that the election would be skewed in Putin’s favor. \n“We have not been given any choice,” said local resident Vladimir Redko, who turned up to the protest carrying a small child in his arms. \n“And as a citizen of the Russian Federation, I feel it is my civic duty to declare my position, to say I disagree.” Additional reporting by Katya Golubkova, Gabrielle Tetrault-Farber, Polina Ivanova and Jack Stubbs in Moscow, Natalia Shurmina and Anastasia Teterevleva in Yekaterinburg, and Mikhail Antonov in St Petersburg; Writing by Andrew Osborn and Christian Lowe; Editing by Jon Boyle", "external_links": [], "published": "2018-01-28T08:56:00.000+02:00", "crawled": "2018-01-28T09:07:56.000+02:00", "highlightTitle": ""}