{"organizations": [], "uuid": "89caebe3cb3381644a5adcd43f6fc30b6a5b81e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/britain-stocks-factors/uk-stocks-factors-to-watch-on-jan-29-idUSL4N1PO2A8", "country": "US", "domain_rank": 408, "title": "UK Stocks-Factors to watch on Jan 29", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T08:14:00.000+02:00", "replies_count": 0, "uuid": "89caebe3cb3381644a5adcd43f6fc30b6a5b81e7"}, "author": "", "url": "https://www.reuters.com/article/britain-stocks-factors/uk-stocks-factors-to-watch-on-jan-29-idUSL4N1PO2A8", "ord_in_thread": 0, "title": "UK Stocks-Factors to watch on Jan 29", "locations": [], "entities": {"persons": [{"name": "paul singer", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "minas-rio", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "parliament's work", "sentiment": "none"}, {"name": "minas gerais", "sentiment": "none"}, {"name": "anglo", "sentiment": "none"}, {"name": "the times", "sentiment": "none"}, {"name": "gkn", "sentiment": "none"}, {"name": "sky plc", "sentiment": "none"}, {"name": "elliott management corp", "sentiment": "none"}, {"name": "carillion plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 29 (Reuters) - Britain's FTSE 100 index is seen opening 18 points higher at 7,683.7 on Monday, according to financial bookmakers. * CARILLION: British construction outsourcing company Carillion Plc attempted to \"wriggle out of its obligations\" to pensioners for the last decade, according to Parliament's Work and Pensions Select Committee. * PROVIDENT FINANCIAL: Four former executives have raised employment tribunal claims for unfair dismissals against Provident Financial, dealing a fresh blow to a company struggling to revive its door-to-door operations, The Times reported. * SKY: Hedge fund Elliott Management Corp, founded by Paul Singer, has built a stake in Sky Plc, according to a regulatory filing published on Friday. * ANGLO AMERICAN: Anglo American on Friday clinched two long-awaited environmental licenses that pave the way for the global mining company to expand its Minas-Rio iron ore mine in the Brazilian state of Minas Gerais. * GKN: British engineering company GKN, which is facing a hostile bid from Melrose Industries, has received several approaches for its individual business, the Financial Times reported on Friday. * HSBA/QATAR: A boycott of Qatar by its neighbours has prompted HSBC to turn down a leading role on Doha's new dollar bond as the bank treads a political tightrope in the Gulf, four banking sources familiar with the decision told Reuters. * US CFTC/HSBA: The U.S. derivatives regulator is set to announce it has fined European lenders UBS,HSBC and Deutsche Bank millions of dollars each for so-called \"spoofing\" and manipulation in the U.S. futures market, three people with direct knowledge of the matter told Reuters. * BRITAIN ENERGY: Britain's decision to leave the European Union could lead to higher energy prices and energy supply shortages if the exit is not managed properly, a report by an upper-house parliamentary committee report said on Monday. * BREXIT: Britain could make it a requirement for regulators to help London remain a top global financial centre after Brexit, lawmakers said on Saturday in a report pitting parliament against the Bank of England. * The UK blue chip index closed 0.65 percent on Friday with healthcare shares contributing most to the broader rise and as buyers returned to the market following two days of declines driven by a strengthening sterling. * For more on the factors affecting European stocks, please click on: cpurl://apps.cp./cms/?pageId=livemarkets * UK CORPORATE DIARY: SThree 2017 Final Results TODAY'S UK PAPERS > Financial Times > Other business headlines Multimedia versions of Reuters Top News are now available for: * 3000 Xtra : visit topnews.session.rservices.com * For Top News : topnews.reuters.com (Reporting by Rahul B in Bengaluru)\n ", "external_links": [], "published": "2018-01-29T08:14:00.000+02:00", "crawled": "2018-01-29T08:21:57.111+02:00", "highlightTitle": ""}