{"organizations": [], "uuid": "b3a2e48832c253412fa588dd87243a3e6f5ca076", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/02/104442402-IMG_2233.1910x1000.JPG", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/sen-portman-the-biggest-tax-reform-story-is-flying-under-the-radar.html", "country": "US", "domain_rank": 767, "title": "Sen. Portman: The biggest tax reform story is flying under the radar", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.931, "site_type": "news", "published": "2018-01-04T18:17:00.000+02:00", "replies_count": 0, "uuid": "b3a2e48832c253412fa588dd87243a3e6f5ca076"}, "author": "Kevin Breuninger", "url": "https://www.cnbc.com/2018/01/04/sen-portman-the-biggest-tax-reform-story-is-flying-under-the-radar.html", "ord_in_thread": 0, "title": "Sen. Portman: The biggest tax reform story is flying under the radar", "locations": [], "entities": {"persons": [{"name": "rob portman", "sentiment": "negative"}, {"name": "portman", "sentiment": "negative"}], "locations": [{"name": "r-ohio", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "7 Hours Ago | 03:14 \nSome corporations have reacted to the passage of sweeping tax reform legislation by announcing stock buybacks, raising wages or planning to give bonuses. Sen. Rob Portman , R-Ohio, says the best news is yet to come. \n\"I've talked to a number of CEOs over the past several months about the tax reform as it relates to international business. They can now be competitive here in America,\" Portman told CNBC's \" Squawk Box \" on Thursday. \n\"I think you'll see some big news coming up as to companies that are literally moving factories from overseas back to the United States,\" he said. \nA bevy of changes to the tax code at the individual, corporate and international level came into effect at the start of 2018. Large companies are getting a big cut to the corporate tax rate — down to 21 percent from 35 percent — and a new expensing period that allows them to deduct the cost of some assets. \nAnd a number of companies have announced perks and financial gifts for employees. Some of them have directly cited the new tax law as the reason for giving out bonuses or buying back stock. \nIn Portman's state, for instance, Columbus-based Nationwide Insurance announced on Wednesday that it will give a $1,000 bonus to most of its 33,000 employees. \nOther companies, such as Wells Fargo and Fifth Third , promised to raise their minimum wages in the wake of the new tax law. \nIndividual tax cuts and beefed-up deductions have also come into effect, though most of them will expire in 2025. \nPortman chalked up the unpopularity of the tax bill to the general distrust surrounding Washington, but reiterated the sense of corporate optimism he said he's witnessed since it became law. \n\"Companies that are invested in Ohio are now saying they're going to put more money into Ohio,\" Portman said. \"They're telling me that because the lower rates and the expensing makes it better to put an investment in America rather than in Japan or in China or in Germany.\" Kevin Breuninger Special to CNBC.com Related Securities", "external_links": [], "published": "2018-01-04T18:17:00.000+02:00", "crawled": "2018-01-04T18:18:02.001+02:00", "highlightTitle": ""}