{"organizations": [], "uuid": "65eb733f05a05c475baa37ac2bbb40194b4c4aec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-thailand-south/history-of-thai-kings-a-new-topic-in-schools-of-conflict-torn-south-idUKKBN1EZ0WC", "country": "US", "domain_rank": 408, "title": "History of Thai kings a new topic in schools of conflict-torn south", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T11:46:00.000+02:00", "replies_count": 0, "uuid": "65eb733f05a05c475baa37ac2bbb40194b4c4aec"}, "author": "", "url": "https://uk.reuters.com/article/uk-thailand-south/history-of-thai-kings-a-new-topic-in-schools-of-conflict-torn-south-idUKKBN1EZ0WC", "ord_in_thread": 0, "title": "History of Thai kings a new topic in schools of conflict-torn south", "locations": [], "entities": {"persons": [{"name": "suraporn prommool", "sentiment": "none"}, {"name": "panu wongcha-um", "sentiment": "none"}, {"name": "artef", "sentiment": "none"}], "locations": [{"name": "narathiwat", "sentiment": "none"}, {"name": "pattani", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "bangkok", "sentiment": "none"}, {"name": "buddhist-majority", "sentiment": "none"}], "organizations": [{"name": "history of thai kings", "sentiment": "negative"}, {"name": "suphanida thakral", "sentiment": "none"}, {"name": "yala", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 9:47 AM / Updated 26 minutes ago History of Thai kings a new topic in schools of conflict-torn south Panu Wongcha-um , Suphanida Thakral 3 Min Read \nBANGKOK (Reuters) - Private Islamic schools in Thailand’s Muslim-dominated south will teach the history of past kings, a governor said on Wednesday, the Buddhist-majority nation’s latest bid to bring peace to the strife-torn region, but one that could backfire. \nThe mostly Muslim southern provinces of Narathiwat, Pattani and Yala are home to an insurgency by ethnic Malay Muslims fighting for autonomy, in which more than 6,000 people have been killed since 2004. \nNarathiwat governor Suraporn Prommool said 62 Islamic schools in the province would introduce the subject, dealing with the merits of Thai kings and national history, this year. \n“There are a few people who do not understand Thai history and use it to create conflict and violence,” he told Reuters. \n“This initiative will teach the merits of the kings and will create unity and love amongst Thai people.” \nThe move has provoked mixed feelings, however, said Artef Sokho, the head of a support group for conflict victims, the Network of Pattanians outside the Motherland. \n“I don’t understand what the Thai government wants out of this,” Artef told Reuters, adding that some people in the region see the history as imposing on their Malay-Muslim identity. \n“Thai nation-building history and the history of Pattani are incompatible ... people here feel they have more of a shared history with the Malay peninsula,” Artef said. \nYala, Pattani and Narathiwat were part of an independent Malay Muslim sultanate before Thailand annexed them in 1909. \nInsurgent attacks have long targeted government schools and teachers in the deep south, because they are seen as representatives of the Thai state. \n“History in the Thai school curriculum is a centralized, Bangkok-focused version which doesn’t give importance to the southern provinces,” said independent analyst Rungrawee Chalermsripinyorat. \nSuccessive Thai governments have initiated talks to reach peace with insurgent groups operating in the south but the talks have gone almost nowhere. \nThe military has also tried programmes to win “hearts and minds” in the region. \nBut several rights groups have accused the authorities of heavy-handed tactics, such as torturing suspected insurgents in custody. \nDespite court rulings that Muslim detainees were tortured in the south while in custody, no troops have ever been prosecuted. Additional Reporting by Surapan Boonthanom; Editing by Amy Sawitta Lefevre and Clarence Fernandez", "external_links": [], "published": "2018-01-10T11:46:00.000+02:00", "crawled": "2018-01-10T12:04:05.000+02:00", "highlightTitle": ""}