{"organizations": [], "uuid": "c7434d75a06660acc8efdc88a40a52d37a9aafa1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-collibra-closes-58-million-series-d-financing-led-by-iconiq-capital-and-battery-ventures.html", "country": "US", "domain_rank": 767, "title": "Collibra Closes $58 Million Series D Financing, Led by ICONIQ Capital and Battery Ventures", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.067, "site_type": "news", "published": "2018-01-08T15:00:00.000+02:00", "replies_count": 0, "uuid": "c7434d75a06660acc8efdc88a40a52d37a9aafa1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-collibra-closes-58-million-series-d-financing-led-by-iconiq-capital-and-battery-ventures.html", "ord_in_thread": 0, "title": "Collibra Closes $58 Million Series D Financing, Led by ICONIQ Capital and Battery Ventures", "locations": [], "entities": {"persons": [{"name": "collibra", "sentiment": "negative"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "index ventures", "sentiment": "none"}, {"name": "iconiq capital and battery ventures", "sentiment": "none"}, {"name": "collibra", "sentiment": "none"}, {"name": "newion investments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Collibra, leader in enterprise data governance and catalog software, today announced it has closed $58 million in Series D financing. This round was led by existing Collibra investors ICONIQ Capital and Battery Ventures, with participation from early Collibra investors Dawn Capital, Index Ventures and Newion Investments, bringing the total funding for Collibra to over $133 million.\nThis Series D investment will help Collibra accelerate its ambitious growth plans – including a significant number of new hires in 2018 – and fuel its rapid global growth and industry leadership as a premier provider of data governance and catalog solutions. Collibra will use this investment to expand staff and scale operations, including advancing product development, supporting and growing the customer base and increasing customer success and adoption, and building strategic partnerships and alliances.\n“Data governance is evolving from a focus on compliance and regulation to one of engagement and data consumerization, enabling all business users across an organization to leverage the data they need to collaborate, make strategic decisions, and accelerate the move to being a digital business,” said Felix Van de Maele, CEO and co-founder of Collibra. “This Series D investment from some of the industry’s most highly respected and successful investment firms is strong validation of the ongoing adoption of data governance as a corporate discipline. This investment also speaks volumes to our investors’ confidence in the leadership Collibra has established in the data governance space and of our continued rapid growth.”\nAdditionally, Collibra today announced Phil Fernandez has joined its board of directors as an independent director. Fernandez is a veteran Silicon Valley entrepreneur with more than 35 years of experience building and leading breakout technology companies. He recently retired from Marketo, where he served as Chairman and CEO since co-founding the company in 2006. Fernandez is an active writer and speaker on topics related to digital marketing, big data and analytics, subscription business models, and entrepreneurial innovation, and is the author of Revenue Disruption .\nCollibra: The Leading Data Governance Platform for the Modern Enterprise\nPremier organizations across the globe in industries including financial services, retail, healthcare, telco, manufacturing, technology, government, and others use Collibra to enable all data citizens – anyone in an organization who uses data to make business decisions or do their jobs – to find, understand, and trust the data they need to be truly data-driven enterprises. Companies also rely on Collibra to help them comply with a growing host of critical global regulations, including the General Data Protection Regulation (GDPR), BCBS 239, and CCAR.\nCollibra continued its rapid growth during the past year, including well over 100% annual recurring revenue growth, opening a new, significantly larger co-headquarters location in Brussels, and adding nearly 50 personnel globally. In 2017, Collibra released two new versions of the Collibra platform, delivering the industry's most sophisticated yet easy-to-use data governance and catalog functionality. Collibra Catalog takes an advanced “consumerized” approach to data governance that enables business users to “shop” for and find data in much the same way as they shop for products on sites like Amazon. This allows them to spend less time looking for data and more time solving critical business challenges.\nIndustry influencers also continue to recognize the strength of the Collibra solution. Gartner Inc. named Collibra a leader for the third consecutive year in its August 2017 Gartner Magic Quadrant for Metadata Management Solutions. Forrester also recognized Collibra as a leader in its Forrester Wave: Data Governance Stewardship and Discovery Providers Q2 2017. Collibra was also named Winner of the 2017 Datanami Editors’ Choice Award for “Best Big Data Product or Technology: Data Management (Cataloging).”\nIn May 2018, Collibra will host its third annual Data Citizens Conference, the industry’s largest gathering focused exclusively on data governance. The event is scheduled for May 1-2 in Jersey City, NJ.\nComments on Today’s News\n“We are thrilled to grow our partnership with Collibra following a year of tremendous execution and strong leadership,” said Matt Jacobson, General Partner, ICONIQ Capital and Collibra board member. “Data and analytics is becoming more and more pervasive in large global enterprises, and we are very excited about the positioning and plans for future innovation that Collibra has.”\n“The process of digital transformation across industries today relies on access to trusted data and collaboration among various stakeholders – but organizations also must comply with new regulations like the EU’s General Data Protection Regulation,” says Dharmesh Thakker, a General Partner at Battery Ventures and Collibra board member. “Collibra has already enabled data-driven decision making at hundreds of Fortune 500 companies, and we are thrilled to extend our support to the company as it drives further value for customers by surfacing insights via data catalogs, enabling compliance, and becoming the primary system of data engagement at leading organizations worldwide.”\n“As someone who’s passionate about building disruptive, high-growth companies, I couldn’t be more excited to be joining the Collibra board of directors at this pivotal moment in the company’s history,” said Phil Fernandez. “Felix and his team have created a company that offers the right data governance solution for businesses that want to take advantage of the power of big data and analytics to drive competitive edge. I’m excited to lend my insights to help fuel the company’s continued growth and industry leadership.”\nAbout ICONIQ\nICONIQ Capital is a global multi-family office and merchant bank for a group of influential families.\nAbout Battery\nBattery strives to invest in cutting-edge, category-defining businesses in markets including software and services, Web infrastructure, consumer Internet, mobile and industrial technologies. Founded in 1983, the firm backs companies at stages ranging from seed to private equity and invests globally from offices in Boston, the San Francisco Bay Area, Israel, and London. Follow the firm on Twitter @BatteryVentures, visit our website at www.battery.com and find a full list of Battery's portfolio companies here .\nAbout Collibra\nAs the leader in data governance, Collibra helps organizations across the world gain competitive advantage by maximizing the value of their data across the enterprise. Collibra is the only solution purpose-built to address the gamut of data stewardship, governance, and management needs of the most complex, data-intensive industries. Our flexible and configurable cloud-based or on-premises solution puts people and processes first – automating data governance and management to quickly and securely deliver trusted data to the business users who need it. Learn more at www.collibra.com .\nMedia Contact:\nColleen Irish\n617-842-1511\ncirish@tieronepr.com\nSource: Collibra", "external_links": ["https://www.globenewswire.com/Tracker?data=x6Y6OtMx9xuIXQs1BRkfGWo0Lxg5zPbmD7QTE265EjG7FVHeBru5pWO6Qf8DqD4qGqD5DY_xfBp6FrSCsl4iiTiSHsgoGBb5-tsKKnHzSreqBNAswSeawd6ttq7KVMttZ184yH6Gr5S-4igkgSvBnPd_ySZ-jyrwpOot5IQ8hPy1_jYv3ic19t71nq38MOH7", "https://www.globenewswire.com/Tracker?data=wVHLPHvFgA4EmZaakq7HlZ7_ojKBcZo4Gv8RcGm2muowgU-dK5kcuxy0E0s8Xov8GcKn7aWSgmErHVydqP4_Hw==", "https://www.globenewswire.com/Tracker?data=D2fFx11X3OLJMjNJYtMSf66EK9txzVV_X1j4D670qf-G4xc6CsGzMLtYJ_YbGQX80sswohRoi5hBTS-kuFGBaBxMjK_33nWX0o1T3DveQicpMgpt6PweODB_ZIBJButZPXwiUOLhIB6PbrGiiVH8pUAWQWTo2JUJBpwYe88zYTaYnyurq035zxQZ0n_aHUHSxQt3xOUHPCyWXaHTNkG0Gw==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2a51874d-6a83-43e4-9723-a4ef808ec2cb"], "published": "2018-01-08T15:00:00.000+02:00", "crawled": "2018-01-08T15:20:02.000+02:00", "highlightTitle": ""}