{"organizations": [], "uuid": "7f6f336fd9a0d82903b0ce8184aeb189e10bcc20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955748-GettyImages-460886661.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/wef-2018-looking-back-at-key-life-advice-from-leading-davos-attendees.html", "country": "US", "domain_rank": 767, "title": "WEF 2018: Looking back at key life advice from leading Davos attendees", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.502, "site_type": "news", "published": "2018-01-22T14:57:00.000+02:00", "replies_count": 0, "uuid": "7f6f336fd9a0d82903b0ce8184aeb189e10bcc20"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/22/wef-2018-looking-back-at-key-life-advice-from-leading-davos-attendees.html", "ord_in_thread": 0, "title": "WEF 2018: Looking back at key life advice from leading Davos attendees", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "james o'neil", "sentiment": "none"}, {"name": "meg whitman", "sentiment": "none"}, {"name": "andrew burton", "sentiment": "none"}, {"name": "alexandra gibbs", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "hewlett packard enterprise ceo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Davos flashback: 7 inspiring life advice quotes from major leaders Share Davos flashback: 7 inspiring life advice quotes from major leaders James O'Neil | Stone | Getty Images SHARES Alexandra Gibbs | @alexgibbsy 2 Hours Ago \nTuesday marks the start of the 2018 World Economic Forum's (WEF) annual meeting in Davos, Switzerland, where thousands of leaders are set to participate in key discussions. \nFrom commenting on global issues such as gender disparity and geopolitical tensions, to delivering advice on the workplace and healthy living, Davos has a topic for everyone. \nIn anticipation of what this year's summit may bring, CNBC draws together seven quotes from previous WEF meetings, where leading figures have given advice on a range of topics that can be applicable to any individual. Don't hit the brakes \n\"You can always go faster than you think you can.\" \n— Meg Whitman, outgoing Hewlett Packard Enterprise CEO , during a discussion on digital transformation of industries and the role of leadership in 2016 Andrew Burton | Getty Images Overcoming obstacles \n\"No difficulty, however daunting, will stop mankind from advancing. When encountering difficulties, we should not complain about ourselves, blame others, lose confidence or run away from responsibilities. Instead, we should join hands and rise to the challenge. History is created by the brave.\" \n— Xi Jinping, president of the People's Republic of China, discusses globalization in 2017 Xinhua | Ju Peng | Getty Images Making a plan \n\"Goals are only wishes, unless you have a plan.\" \n— Melinda Gates, co-chair of the Bill and Melinda Gates Foundation, on the progress towards parity in 2016 Kris Connor | Getty Images Entertainment | Getty Images Don't judge a book by its cover \n\"When you encourage folks and you have willing people that are dedicated, look at what you can do. Look at Uber, look at what they did. Look at the unlikely candidate — Apple, they were not in the phone business, they changed phones forever. \n\"The same thing could happen to folks that were always left behind. As soon as you push them, you give them the tools: 'Poof!' Watch what happens.\" \n— will.i.am, musician, entrepreneur, and philanthropist, discusses the 21st century dream in 2016 Stephane Cardinale | Corbis | Getty Images Allow yourself time to recharge your batteries \n\"Since the industrial revolution, we've been living under this delusion that burnout is necessary to succeed, that human beings can minimize downtime the way we try to do with machines. \n\"When, in fact, scientists will tell us that the human operating system needs downtime. We need time to unplug, to recharge, sleep deeply.\" \n— Arianna Huffington, Thrive Global founder and CEO, speaks to CNBC at WEF 2017 Kate Rooney | CNBC Evoking change \n\"Throughout history, progress happens when ordinary women and men come together and decide to become the change that they want to see in the world.\" \n— Forest Whitaker, actor and UNESCO special envoy for peace and reconciliation, speaks at the 2017 Crystal Awards Michael Kovac | Getty Images Entertainment | Getty Images The power of teaching \n\"Good teachers teach. Great teachers transform and they can really be drivers of change, not just in schools but across society.\" \n—Queen Rania Al Abdullah of the Hashemite Kingdom of Jordan on the global development outlook in 2013 Jamie McCarthy | Getty Images Entertainment | Getty Images ", "external_links": [], "published": "2018-01-22T14:57:00.000+02:00", "crawled": "2018-01-22T17:03:01.009+02:00", "highlightTitle": ""}