{"organizations": [], "uuid": "36163c4adbb6d1f386036c0a668afa59b10c603b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222065036&w=1200&r=LYNXMPEE0E08Y", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-softbank-group-ipo-breakingviews/breakingviews-telecoms-ipo-would-be-a-smart-step-for-softbank-idUSKBN1F40HO", "country": "US", "domain_rank": 408, "title": "Telecoms IPO would be a smart step for SoftBank", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T14:12:00.000+02:00", "replies_count": 0, "uuid": "36163c4adbb6d1f386036c0a668afa59b10c603b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-softbank-group-ipo-breakingviews/breakingviews-telecoms-ipo-would-be-a-smart-step-for-softbank-idUSKBN1F40HO", "ord_in_thread": 0, "title": "Telecoms IPO would be a smart step for SoftBank", "locations": [], "entities": {"persons": [{"name": "masayoshi son", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "softbank group", "sentiment": "negative"}, {"name": "softbank", "sentiment": "negative"}, {"name": "softbank corp", "sentiment": "none"}, {"name": "moody’s investors service", "sentiment": "none"}, {"name": "s&p global", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG A mobile float might be a smart call by Japan’s SoftBank Group. A separate listing for the company’s domestic telecoms business could unlock fresh funds for boss Masayoshi Son, prod the unit into better performance, and shrink the “conglomerate discount” applied to the parent’s shares.\nThe Nikkei newspaper says Son aims to list the unit, SoftBank Corp, later this year in Tokyo and maybe in London too, raising about 2 trillion yen($18 billion). SoftBank says in response that it is considering such a move but has taken no decision.\nThe deal would unlock cash for more tech investment by the unstoppable Son. Having amassed an unprecedented $98 billion capital pool known collectively as the Vision Fund, he is already eyeing sequels. This way, he avoids further balance-sheet strain at a time when SoftBank already is rated below investment-grade by S&P Global and Moody’s Investors Service. Whether this will be money well spent is another matter. Son’s cheques are probably inflating valuations for big startups, which have already secured high valuations and plenty of funding from other venture capitalists.\nAn offering would also entail more detailed scrutiny of the subsidiary, which ranks third in Japan’s mobile market behind NTT Docomo and KDDI. The business could attract shareholders who prefer a straightforward, high-yielding telco to Son’s futuristic enthusiasms. Indeed, as SoftBank transforms into the world’s largest venture capital outfit, it is becoming an increasingly anomalous holding in many telecoms investor portfolios. Some will probably sell the parent to buy the subsidiary.\nThe deal could also relieve one of SoftBank’s enduring headaches: the persistent discount applied to its stock. In October, when the shares were about 6 percent higher than they are now, Bernstein analysts estimated that price represented a 40 percent discount to the theoretical sum of the parts, setting aside the Vision Fund.\nThe flotation could help by creating an independent valuation and extra demand for the telecoms arm, while sharpening the parent’s focus on technology. But SoftBank would still be heavily dependent on its charismatic founder, and it would remain a complicated animal, with holdings spanning Yahoo Japan, Britain’s ARM, U.S. and Japanese telecoms, a stake in China’s Alibaba, plus the Vision Fund and more. This is a useful step but not a full solution.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-15T14:12:00.000+02:00", "crawled": "2018-01-15T09:36:35.026+02:00", "highlightTitle": ""}