{"organizations": [], "uuid": "855fa12a55b3772d30ca09c63c96363eebf4fc45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/trump-lawyer.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/trump-michael-cohen-buzzfeed-defamation-suit-russia-fusion-gps-dossier/", "country": "US", "domain_rank": 1196, "title": "Trump’s Personal Lawyer Suing BuzzFeed Over Russia Dossier | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.276, "site_type": "news", "published": "2018-01-10T09:56:00.000+02:00", "replies_count": 0, "uuid": "855fa12a55b3772d30ca09c63c96363eebf4fc45"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/10/trump-michael-cohen-buzzfeed-defamation-suit-russia-fusion-gps-dossier/", "ord_in_thread": 0, "title": "Trump’s Personal Lawyer Suing BuzzFeed Over Russia Dossier | Fortune", "locations": [], "entities": {"persons": [{"name": "michael cohen", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "cohen", "sentiment": "none"}, {"name": "ben smith", "sentiment": "none"}, {"name": "ken bensinger", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "fusion gps", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 7:56 AM EST \nDonald Trump’s personal attorney Michael Cohen sued Buzzfeed on Tuesday for defamation over allegations about him in a dossier the news organization published that was commissioned in 2016 by the president’s political opponents. \nCohen said he also filed a second defamation suit against political intelligence firm Fusion GPS, which compiled the dossier, in federal court. Buzzfeed published the dossier in its entirety nearly a year ago, which it said it obtained from a source it didn’t identify. \nThe dossier contains unverified claims that Cohen and Trump had suspicious connections with Russian figures. Most other U.S. news organizations declined to publish the document because many of its claims — some of them salacious — haven’t been substantiated. \n“It will be proven that I had no involvement in this Russian collusion conspiracy,” Cohen said in an interview on Tuesday. “My name was included only because of my proximity to the president.” Figure of Interest \nCohen’s complaint against Buzzfeed names editor-in-chief Ben Smith, reporter Ken Bensinger and editors Miriam Elder and Mark Schoofs, who were the bylines on the article Buzzfeed published accompanying the dossier. He provided the complaint and a confirmation email from the court system that he had filed the suit to Bloomberg News. \nCohen said he’s mentioned in the dossier 15 times. \n“The dossier is, and continues to be, the subject of active investigations by Congress and intelligence agencies. It was presented to two successive presidents, and has been described in detail by news outlets around the world. Its interest to the public is obvious,” Buzzfeed spokesman Matt Mittenthal said in a statement. “We look forward to defending the free press and our First Amendment rights in court.” \nThe suit against Fusion GPS and its co-founder Glenn Simpson was filed in federal court in the Southern District of New York. \nRead: A Russian Hacker Confessed to Hacking the DNC During the Election Campaign \nFusion’s lawyer, Joshua Levy, said he had not seen the suit and that he had “not received a letter from counsel on anything.” \nCohen has emerged as a figure of interest to congressional investigators probing Russian interference in the 2016 election. Cohen testified to the House Intelligence Committee on Oct. 24 and to the Senate Intelligence Committee on Oct. 25. Both sessions were held behind closed doors. \nHe declined to say whether he has been interviewed by Special Counsel Robert Mueller, who is directing the FBI’s investigation of Russia’s activities in the election . \nCohen said he told the panels that he never engaged with, was paid by, or communicated with anyone representing the Russian government, or anyone else, about hacking or interfering with the U.S. election, hacking the Democratic Party, or about creating fake news stories to assist the Trump campaign or to damage the Clinton campaign. \nHe said that he and Trump “don’t talk about” the Russia investigations. “Why waste time talking about something that’s not legitimate,” he said. \nMueller has so far secured two guilty pleas and two indictments in the investigation. Trump has said he expects Mueller to be fair to him and that he and his campaign never colluded with the Russian government. His legal team is preparing for a potential interview with the special counsel and is in preliminary discussions with Mueller’s office about the parameters of such a discussion, a person familiar with the matter said Tuesday. \n“We’re a year down the road now,” Cohen said. “I, like all Americans — Republicans and Democrats alike — want to know to what extent Russia involved themselves in our democratic process, and more importantly what can be done to stop future involvement by foreign governments.” Steele Dossier \nFusion GPS hired a former British spy, Christopher Steele, to compile the dossier. Fusion was first commissioned to investigate Trump in 2016 by the Washington Free Beacon newspaper, which has said that none of the information it received from the firm was included in the dossier. Hillary Clinton’s campaign and the Democratic National Committee later commissioned Fusion and the work that led to the dossier, according to the Washington Post. \nThe document has become a focus of Republican-led investigations into Russian meddling in the 2016 election. Steele is reported to have provided the dossier to the FBI in 2016, and some Republicans allege that the document prompted the agency to open a counter-intelligence investigation into the Trump campaign. \nThe New York Times reported Dec. 30 that the investigation began after a Trump campaign adviser, George Papadopoulos, revealed to an Australian diplomat in London that Russia had political dirt on Democrat Hillary Clinton. Australian officials then passed the information to their American counterparts, the Times reported. ", "external_links": [], "published": "2018-01-10T09:56:00.000+02:00", "crawled": "2018-01-10T16:52:34.003+02:00", "highlightTitle": ""}