{"organizations": [], "uuid": "3eea8ffea3e45cb57273d2fb87db0b51bc657c83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-zais-group-holdings-inc-enters-into-definitive-merger-agreement-transaction-would-result-in-company-going-private.html", "country": "US", "domain_rank": 767, "title": "ZAIS Group Holdings, Inc. Enters Into Definitive Merger Agreement; Transaction Would Result In Company Going Private", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.051, "site_type": "news", "published": "2018-01-12T14:00:00.000+02:00", "replies_count": 0, "uuid": "3eea8ffea3e45cb57273d2fb87db0b51bc657c83"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-zais-group-holdings-inc-enters-into-definitive-merger-agreement-transaction-would-result-in-company-going-private.html", "ord_in_thread": 0, "title": "ZAIS Group Holdings, Inc. Enters Into Definitive Merger Agreement; Transaction Would Result In Company Going Private", "locations": [], "entities": {"persons": [{"name": "daniel curry", "sentiment": "none"}, {"name": "zugel", "sentiment": "none"}, {"name": "christian zugel", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "red bank", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}], "organizations": [{"name": "zais group holdings, inc", "sentiment": "neutral"}, {"name": "zais group holdings, inc.", "sentiment": "neutral"}, {"name": "llc", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "zais group", "sentiment": "none"}, {"name": "zais", "sentiment": "none"}, {"name": "zgh merger sub, inc.", "sentiment": "none"}, {"name": "acquisition llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RED BANK, N.J., ZAIS Group Holdings, Inc. (NASDAQ: ZAIS) (\"ZAIS\" or the \"Company\") today announced that it has signed a definitive merger agreement with Z Acquisition LLC, a Delaware limited liability company (\"Z Acquisition\"), and ZGH Merger Sub, Inc., a wholly-owned subsidiary of ZAIS. Christian Zugel, the founder of ZAIS Group, LLC, the Company's operating subsidiary, and the Company's Chairman and Chief Investment Officer, is the sole managing member of Z Acquisition. Pursuant to the merger agreement, all of the outstanding common stock of ZAIS that is not (i) beneficially owned by (A) Z Acquisition, the members of Z Acquisition (including Mr. Zugel and Daniel Curry, the Company's President and Chief Executive Officer), certain trusts for members of Mr. Zugel's family, and Mr. Zugel's current spouse (collectively, \"Purchaser Group\"), or (B) any person who, after the date hereof, acquires common stock of ZAIS through certain issuances pursuant to an exercise of exchange rights, or (ii) owned by certain stockholders who agree with Z Acquisition to retain certain of their common stock in connection with the merger, will be converted into the right to receive $4.10 per share in cash, less any required withholding taxes (the \"Merger\").\nThe $4.10 per share price represents a premium of more than 138% to the closing price of the Company's shares of Class A common stock (\"Class A Common Stock\") on September 5, 2017, the last trading day before the initial proposal from Mr. Zugel and Z Acquisition was publicly disclosed. The majority of the funding for payments required to be made to stockholders of the Company in the Merger will be provided by existing cash of the Company, but a portion of the funding for such payments will be provided by Z Acquisition by means of an acquisition of Class A Units of the Company's majority-owned subsidiary, ZAIS Group Parent, LLC (\"ZGP\").\nAs previously disclosed on September 5, 2017, Z Acquisition and Mr. Zugel entered into a Share Purchase Agreement (as amended, the \"Share Purchase Agreement\") with Ramguard LLC (\"Ramguard\") to purchase from Ramguard 6,500,000 shares of Class A Common Stock at $4.00 per share. That agreement has been amended and restated to provide that the purchase price for the Ramguard shares will be the same $4.10 per share price to be paid in the Merger. Once this share purchase is completed, Z Acquisition will own, before consummation of the Merger, approximately 44.66% of the Company's currently outstanding Class A Common Stock and Purchaser Group overall will own approximately 48.01% of the currently outstanding Class A Common Stock.\nThe Company's Board of Directors, acting on the unanimous recommendation of the special committee formed by the Board of Directors (the \"Special Committee\"), approved the merger agreement and the transactions contemplated by the merger agreement and resolved to recommend that the Company's stockholders adopt the merger agreement and the transactions contemplated by the merger agreement. The Special Committee, which is comprised solely of independent and disinterested directors of the Company who are unaffiliated with Purchaser Group and management of the Company, negotiated the terms of the merger agreement with Purchaser Group, with the assistance of its legal and financial advisors.\nPaul Guenther, Chairman of the Special Committee, said, \"We are confident that we have negotiated a fair price and that this merger is in the best interest of our minority stockholders. The price of $4.10 is an approximately 138% premium over the last trading day before the offer.\"\nMr. Zugel said, \"On behalf of Z Acquisition, we are pleased to have reached this agreement, which we believe is in the best interests of unaffiliated stockholders of the Company.\"\nImmediately after the closing of the Merger, ZAIS will become a subsidiary of Z Acquisition. ZAIS is expected to continue its operations and remain headquartered in New Jersey. ZAIS's executive management team generally is expected to remain in place.\nThe Merger is subject to approval by the Company's stockholders (including a non-waivable condition requiring approval by the holders of a majority of the outstanding shares of Class A Common Stock that are not beneficially owned by the members of Purchaser Group, any director or executive officer of the Company, Ramguard, holders of shares that will remain outstanding following the Merger, or any of their respective affiliates), as well as fulfillment of certain other closing conditions. The merger agreement provides for a non-solicitation covenant on the part of the Company, subject to customary \"fiduciary out\" provisions. If Z Acquisition or the Company, pursuant to a resolution of the Special Committee, were to terminate the merger agreement under certain circumstances, the Company will be required to reimburse the members of Purchaser Group up to a maximum of $1,500,000, in the aggregate, for costs relating to the merger agreement and the Merger. The Merger is not subject to a financing condition.\nThe Company will in due course call a meeting of stockholders for the purpose of voting on the adoption of the merger agreement. If completed, the Merger will result in the Company becoming a privately-held company and the Company's common stock would no longer be listed on NASDAQ. Furthermore, if the Merger is completed, current financial and business information of the Company would no longer be available because the Company would no longer be required to file periodic reports.\nHoulihan Lokey is serving as financial advisor to the Special Committee, and Alston & Bird LLP is serving as legal counsel to the Special Committee. McDermott Will & Emery LLP is serving as legal counsel to the Company. Fried, Frank, Harris, Shriver & Jacobson LLP is serving as legal counsel to Purchaser Group.\nABOUT Z ACQUISITION AND PURCHASER GROUP\nZ Acquisition was formed as a special-purpose vehicle for Mr. Zugel and the other members of Purchaser Group, for the primary purpose of entering into the Share Purchase Agreement and the merger agreement. Mr. Zugel is (i) the founder of ZAIS Group, LLC, the Company's operating subsidiary; (ii) the holder, in his capacity as voting trustee of a trust, the beneficiaries of which are members of Mr. Zugel's family and his former spouse, of 100% of the Company's Class B common stock (which provides Mr. Zugel effective voting control over matters put to a vote of the Company's stockholders, including the election of directors); (iii) the Chairman of the Board of Directors of the Company; (iv) the Company's Chief Investment Officer; and (v) the sole managing member of Z Acquisition. Mr. Zugel is also the owner of 3,325,000 Class A Units of ZAIS Group Parent, LLC, the Company's majority owned subsidiary, which are exchangeable, under certain circumstances, for, at the Company's option, cash, shares of Class A Common Stock (on a one-for-one basis), or a combination of the two, and family members and affiliates of Mr. Zugel (including his former spou", "external_links": ["http://www.prnewswire.com/news-releases/zais-group-holdings-inc--enters-into-definitive-merger-agreement-transaction-would-result-in-company-going-private-300581814.html", "http://www.sec.gov/", "http://www.zaisgroup.com/"], "published": "2018-01-12T14:00:00.000+02:00", "crawled": "2018-01-12T16:05:12.004+02:00", "highlightTitle": ""}