{"organizations": [], "uuid": "221a80ffb1abd654ad46c21b207cee14e547a49e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/22/104858264-GettyImages-877362000.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/09/donald-trumps-phony-war-with-the-press-explained.html", "country": "US", "domain_rank": 767, "title": "Donald Trump's phony war with the press, explained", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:40:00.000+02:00", "replies_count": 0, "uuid": "221a80ffb1abd654ad46c21b207cee14e547a49e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/donald-trumps-phony-war-with-the-press-explained.html", "ord_in_thread": 0, "title": "Donald Trump's phony war with the press, explained", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}], "locations": [], "organizations": [{"name": "house", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Next week, President Trump is poised to take his ongoing battles with mainstream political journalism to a new level by handing out what he's calling the \"Fake News Awards,\" bestowed on \"the most corrupt and biased\" reporters and outlets around.\nTrump Tweet \nThe whole spectacle is emblematic of Trump's unusual relationship to the news media.\nAll presidents complain, to some extent, about the press coverage they receive. But none of Trump's predecessors have been even remotely in the neighborhood of this aggressive in his denunciations of the press and his overt hostility to mainstream journalistic institutions.\nRead more from Vox: \nMore and more House Republicans are deciding they want no part of the 2018 elections\nTrump's attacks on humanitarian immigration just became a full-blown war \nBeyond the gossip, Michael Wolff's Fire and Fury reveals a president in crisis \nThe press has responded with an attitude of righteous indignation, skewering the White House (rightly) for an unprecedented volume of dishonesty and generating a ton of compulsively readable copy. But by the same token, in a concrete financial sense, Trump is one of the best things that's happened to the media in years — generating a steady stream of audience interest in his antics and doling out a reliable stream of in-person and social media chum for journalists to swarm over. And while Trump really has followed through on his promises to dole out harsh treatment to immigrants , none of his threatened legal actions against reporters have actually come to pass.\nWhat Trump enjoys is a political pretense of a war with the press. Meanwhile, the business operations of the press have used the pretense of conflict with the Trump administration as a gimmick. But the whole conflict has a kayfabe aspect to it, in which the appearance of a feud is entertaining for the audience and mutually beneficial to the practitioners.\nThe media uses Trump as a marketing tool What's particularly striking about Trump's relationship with the mainstream press is the extent to which the pretense of an oppositional relationship with the White House has become a marketing tool.\nAll of these institutions, from the Washington Post to CNN, have a real interest in rigorous journalism — as their actual reporting clearly shows.\nBut their explicit marketing around the White House is undeniable.\nCNN's \"facts first\" branding campaign, rolled out last fall, was pitched to the press as an effort to \"blunt Trump attacks\" on the network, but the reference to Kellyanne Conway's infamous alternative facts gaffe belies the fact that CNN isn't so much countering Trump's anti-CNN rhetoric as feasting off it.\nThe Washington Post, similarly, newly adopted the slogan \"Democracy Dies in Darkness\" last year, pitching reading the Post not only as a way to be informed or entertained but also as a form of civic duty and obligation.\nThe New York Times, a for-profit, publicly traded company, last year began soliciting money from readers with a quasi-charitable pitch, emphasizing the idea that buying gift subscriptions is a means of supporting the company's \"mission.\"\nThe marketing pitches underscore that in concrete dollars-and-cents terms, Trump has been very good to the mainstream news media — driving clicks, ratings, and subscriptions at a time when the broader economics of the industry have grown difficult, due to Facebook and Google hoovering up a rising share of advertising revenue.\nTrump's war on the media hasn't materialized In this context, it's worth noting that once upon a time, Trump seemed to genuinely threaten a crackdown on press freedoms.\nHe spoke of a desire to \"open up\" libel laws, and threatened regulatory retaliation against Amazon for Post articles he didn't like , as well as lawsuits against the Times . There are very real things that a president could at least try to do to coerce media outlets into delivering favorable coverage. Lyndon Johnson, for example, appears to have used a proposed bank merger as leverage with the owner of the Houston Chronicle to gain the Texas newspaper's support for his legislative agenda.\nBut Trump does not appear to be doing any of these things. There is no indication that his Supreme Court nominee, Neil Gorsuch, has any unusual opinions on the First Amendment's limitations on libel lawsuits. The regulators he has thus far appointed seem to be very conventional pro-business Republicans who are inclined to make business-friendly rulings without a lot of interest in disciplining companies for editorial content. Trump, for example, signed a very unpopular bill rolling back broadband privacy regulations rather than using it as leverage to try to get Comcast to deliver more Trump-friendly coverage on NBC properties.\nTrump has idly threatened Michael Wolff with a civil lawsuit to block the publication of his dishy exposé of the Trump White House's first year, but actually has not thus far matched either the George W. Bush or Barack Obama administrations in terms of concrete legal action against journalists.\nJeremy Scahill Tweet \nIndeed, the reality is that Trump's attacks on Wolff's Fire and Fury have been the greatest marketing coup the book's publisher could possibly have hoped for. Meanwhile, Trump continues to at least sporadically dole out exclusive interviews to various outlets — including the New York Times — during which journalists generally ask him rather relaxed softball questions in the knowledge that simply getting the president talking makes for good copy.\nTrump's December 28 interview with the NYT's Michael Schmidt was fairly typical of the genre. Vox's Ezra Klein and many other Trump critics viewed it as discrediting, revealing once again the president's shallow understanding of the issues and his constitutional responsibilities. Meanwhile, according to the Washington Post, Trump himself was pleased with the results , and he \"enjoyed the coverage afterward and noted that it dominated TV most of Friday.\"\nThe media is a convenient foil for Trump Sparring with the press is useful for Trump in part because it tends to drive media coverage of him, which to an extent he sees as its own reward. Dating back to The Art of the Deal , Trump has frequently espoused a \"no such thing as bad publicity\" theory of media relations, and that tactic served him extremely well in the Republican Party presidential primary when press attention was a genuinely scarce resource amid a crowded field.\nIt's doubtful that the same approach was genuinely advantageous to him during the general election against Hillary Clinton, but the fact is that he won when almost everyone (myself included) expected him to lose — so it's hardly surprising that Trump is inclined to stick with the tactics that brought him to where he is today.\nBut more broadly, to cast the press as the real \"opposition party\" in America — as Trump has — offers some meaningful tactical advantages. Trump, in an unusual way, won the 2016 presidential election without being popular. Not only did he win fewer votes than Hillary Clinton on Election Day, but his favorability rating was lower than that of the losing candidates from the 2012, 2008, 2004, and 2000 presidential elections.\nThe nonpartisan press can (and does) report facts that are unflattering to Trump. But a lack of unflattering facts or a failure by the public to appreciate thei", "external_links": [], "published": "2018-01-09T19:40:00.000+02:00", "crawled": "2018-01-09T20:28:59.014+02:00", "highlightTitle": ""}