{"organizations": [], "uuid": "ca2db2a5c7beee02a6e6e01f01d3c3f45c165876", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-the-simply-good-foods-company-reports-first-quarter-2018-financial-results.html", "country": "US", "domain_rank": 767, "title": "The Simply Good Foods Company Reports First Quarter 2018 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-09T15:00:00.000+02:00", "replies_count": 0, "uuid": "ca2db2a5c7beee02a6e6e01f01d3c3f45c165876"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-the-simply-good-foods-company-reports-first-quarter-2018-financial-results.html", "ord_in_thread": 0, "title": "The Simply Good Foods Company Reports First Quarter 2018 Financial Results", "locations": [], "entities": {"persons": [{"name": "joseph e. scalzo", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "simply good foods company reports first", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, Jan. 09, 2018 (GLOBE NEWSWIRE) -- The Simply Good Foods Company (NASDAQ:SMPL) (NASDAQ:SMPL.W) (“Simply Good Foods,” or the “Company”), a developer, marketer and seller of branded nutritional foods and snacking products, today reported financial results for the 13 week first quarter ended November 25, 2017.\n“We are off to a solid start for fiscal year 2018 as we benefited from increased sales volume and gross margin expansion resulting in solid profit growth,” commented Joseph E. Scalzo, President and Chief Executive Officer of Simply Good Foods. “We are particularly pleased with our strong retail performance for the thirteen weeks ended November 25, 2017, which grew 5.5% in the U.S. despite a very difficult comparison in the same period a year ago. We remain confident in our business growth opportunities moving forward and our ability to execute against our four strategic growth initiatives to create value for our shareholders.”\nResults for the Successor Period for the Thirteen Weeks Ended November 25, 2017, and Predecessor Period for the Thirteen Weeks Ended November 26, 2016 (1)\n• Successor net sales were $106.6 million and Predecessor net sales were $99.8 million\n• Successor net income was $10.2 million and Predecessor net income was $6.8 million\nIn order to present comparable financial information, the Company has also presented supplemental unaudited pro forma financial information for the thirteen weeks ended November 26, 2016, giving effect to the business combination (the “Business Combination”) with Conyers Park Acquisition Corp. (“Conyers Park”) and NCP-ATK Holdings, Inc. (“Atkins”) as if it had occurred on August 28, 2016. All references in this press release to results for the first quarter ended November 26, 2016, refer to such unaudited pro forma results. The Company believes this pro forma information provides helpful supplemental information with respect to the performance of Simply Good Foods, and particularly the Atkins business, during this period.\nFirst Quarter 2018 Financial Highlights vs. First Quarter 2017 Pro-Forma\n• Net sales increased 6.8%, or $6.8 million, to $106.6 million\n• Gross profit margin of 49.5%, an increase of 70 basis points\n• Net income increased 11.7% to $10.2 million, an increase of $1.1 million\n• Earnings per diluted share (“EPS”) of $0.14, an increase of $0.01 per fully diluted share\n• Adjusted EBITDA (2) increased 6.6%, to $23.7 million.\n(All comparisons above are with respect to the Predecessor's thirteen week pro forma first fiscal quarter ended November 26, 2016)\n(1) On July 7, 2017, the Company completed the Business Combination between Atkins and Conyers Park, and as a result of the Business Combination, both Conyers Park and Atkins became wholly-owned subsidiaries of Simply Good Foods. Pursuant to GAAP and SEC requirements and the application of acquisition accounting, the Company's consolidated financial results are presented: (i) as of and for the thirteen weeks ended November 25, 2017 (Successor); and (ii) as of and for the thirteen weeks ended November 26, 2016 (Predecessor). All references to “Successor” refers to Simply Good Foods, and all references to “Predecessor” refers to Atkins prior to the Business Combination.\n(2) Adjusted EBITDA is a non-GAAP financial measure. Please refer to “Non-GAAP Financial Measure and Related Information” and “Reconciliation of Adjusted EBITDA” in this press release for an explanation and reconciliations of this non-GAAP financial measure.\nFirst Quarter 2018 Financial Results vs. First Quarter 2017 Pro-Forma\nNet sales increased $6.8 million, or 6.8%, to $106.6 million driven by organic sales growth of 4.0%, and the acquisition of Wellness Foods, Inc., and its Simply Protein brand, which added a 2.8% increase to net sales.\nGross profit was $52.8 million for the first quarter of 2018, an increase of $4.0 million or 8.3%. Gross profit margin was 49.5% compared to 48.8% for the pro forma thirteen weeks ended November 26, 2016 driven primarily by favorable product mix and a reduction in input costs.\nNet income increased $1.1 million, or 11.7%, to $10.2 million. The increase was primarily driven by the gross profit improvement, partially offset by a 7.0% increase in marketing spend and a 17.5% increase in general and administrative expenses as a result of public company costs and the addition of Wellness Foods.\nAdjusted EBITDA, a non-GAAP financial measure used by the Company that makes certain adjustments to net income calculated under GAAP, increased 6.6% to $23.7 million.\n(All comparisons above are with respect to the Predecessor's thirteen week pro forma first fiscal quarter ended November 26, 2016)\nBalance Sheet and Cash Flow\nAs of November 25, 2017, the Company had cash and cash equivalents of $62.9 million and a $200.0 million term loan outstanding, resulting in a trailing twelve month pro forma combined Net Debt to Adjusted EBITDA ratio of 1.9x. The Company also has a $75.0 million revolving line of credit available for borrowing which is not currently being utilized, with no borrowings outstanding as of November 25, 2017.\nTax Cuts and Jobs Act\nOn December 22, 2017, President Trump signed the Tax Cuts and Jobs Act into law. The change in the tax law will be partially effective in the current 2018 fiscal year and fully effective in the 2019 fiscal year. The primary impacts to the Company include repeal of the alternative minimum tax regime, decrease of the corporate income tax rate structure, and net operating loss limitations. These changes will have a material impact to the value of deferred tax assets and liabilities, the value of the Company’s TRA, and the Company’s future taxable income and effective tax rate.\nAdditionally, we currently anticipate the enacted changes in the corporate tax rate and calculation of taxable income will have a favorable effect on our financial condition, profitability, and/or cash flows. The Company is analyzing the Tax Cuts and Jobs Act with its professional advisers. Until such analysis is complete, the full impact of the new tax law on the Company in future periods is uncertain, and no assurances can be made by the Company on any potential impacts.\nOutlook\nSimply Good Foods reaffirms its outlook for fiscal year 2018. The Company continues to expect net sales growth to be consistent with its previously stated long-term growth algorithm of 4% to 6% and Adjusted EBITDA growth at a slightly higher rate than net sales, including the impact of an incremental $2.0 million of public company expenses.\nConference Call and Webcast Information\nThe Company will host a conference call with members of the executive management team to discuss these results today, Tuesday, January 9, 2018 at 6:30 a.m. Mountain time (8:30 a.m. Eastern time). Investors interested in participating in the live call can dial 877-407-0792 from the U.S and International callers can dial 201-689-8263.\nIn addition, the call and supplementary presentation slides will be broadcast live over the Internet hosted at the “Investor Relations” section of the Company's website at http://www.thesimplygoodfoodscompany.com . The webcast will be archived for 30 days. A telephone replay will be available approximately two hours ", "external_links": [], "published": "2018-01-09T15:00:00.000+02:00", "crawled": "2018-01-09T15:28:15.034+02:00", "highlightTitle": ""}