{"organizations": [], "uuid": "fa1e9ce1dfcc41d8cebb6b41569e70691cbc3e95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/business-news-schedule-at-1330-gmt/reuters-business-news-schedule-at-1330-gmt-830-am-et-idUSL8N1P73RK", "country": "US", "domain_rank": 408, "title": "Reuters Business News Schedule at 1330 GMT/830 AM ET", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.941, "site_type": "news", "published": "2018-01-12T21:32:00.000+02:00", "replies_count": 0, "uuid": "fa1e9ce1dfcc41d8cebb6b41569e70691cbc3e95"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/business-news-schedule-at-1330-gmt/reuters-business-news-schedule-at-1330-gmt-830-am-et-idUSL8N1P73RK", "ord_in_thread": 0, "title": "Reuters Business News Schedule at 1330 GMT/830 AM ET", "locations": [], "entities": {"persons": [{"name": "keith weir", "sentiment": "negative"}, {"name": "brenda goh", "sentiment": "none"}, {"name": "david henry", "sentiment": "none"}, {"name": "alexandra harney", "sentiment": "none"}, {"name": "allison lampert", "sentiment": "none"}, {"name": "heekyong yang", "sentiment": "none"}, {"name": "sweta singh", "sentiment": "none"}, {"name": "cynthia kim", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "s.korea seoul", "sentiment": "none"}], "organizations": [{"name": "reuters business news schedule", "sentiment": "negative"}, {"name": "jpmorgan chase & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Editor: Keith Weir, +44 207 542 8022\nGlobal Picture Desk: +65 6870 3775\nGlobal Graphics Desk: + 65 6870 3595\n(All times GMT / ET)\nReceive this schedule by email:\nmediaexpress.reuters.com\nTOP STORIES JPMorgan profit beats on higher interest rates; debt trading down\nJPMorgan Chase & Co, the biggest U.S. bank by assets, reports a higher-than-expected quarterly profit as gains in net interest income offset a slowdown in trading revenue. (JPMORGAN-RESULTS/ (UPDATE 2), moved, by Sweta Singh and David Henry, 360 words)\nUproar over crackdown on cryptocurrencies divides S.Korea\nSEOUL - With a tech-savvy population quick to adopt the latest gadgets and a young generation facing dim prospects in the conventional workplace, South Korea has been a fertile ground for virtual currencies. (SOUTHKOREA-BITCOIN/ (PIX), moved, by Cynthia Kim and Heekyong Yang, 790 words)\n+ See also:\nCANADA-BITCOIN/CHINA (PIX), moved, by Allison Lampert, Alexandra Harney and Brenda Goh, 830 words\nEuro soars to 3-year high, stocks shatter records\nLONDON - Record high world stocks head for an eighth straight week of gains, while the euro sails to a three-year high as progress on forming a German government added to signs the ECB may accelerate an end to its stimulus. (GLOBAL-MARKETS/ (WRAPUP 7, PIX), moved, by Helen Reid, 810 words)\n+ See also:\nASIA-OIL/, moved, by Henning Gloystein, 663 words\nChina’s trade boom hits speed bump as Dec import growth slows sharply\nBEIJING - China’s export and import growth slowed in December after surging in the previous month, adding to signs of ebbing economic momentum as the government extends a crackdown on financial risks and factory pollution. (CHINA-ECONOMY/TRADE (UPDATE 2, PIX), moved, 735 words)\nMARKETS Oil retreats from $70 highs but set for fourth week of gains\nLONDON - Oil prices fall after hitting a three-year high over $70 a barrel the previous day, but remain on track to post a fourth straight week of gains. (GLOBAL-OIL/ (UPDATE 6), moved, by Ahmad Ghaddar, 395 words)\nEuro surges above $1.21 to 3-year high; yuan hits 4-month peak\nLONDON - The euro surges above $1.21 to a three-year high on Friday on bets the European Central Bank is getting ready to wind down its huge monetary stimulus, and after German Chancellor Angela Merkel reached a deal that should lead to the formation of a “grand coalition” government. (GLOBAL-FOREX/ (UPDATE 4), moved, by Jemima Kelly, 490 words)\nGold set for 5th week of gains, buoyed by slump in dollar\nGold prices rise for a third session to hit their highest since September, with a slump in the U.S. dollar helping drive bullion towards its fifth straight weekly gain. (GLOBAL-PRECIOUS/ (UPDATE 1), updating throughout the day, by Sethuraman N R, 451 words)\nECONOMY Germans seek labour deal by early next month as car workers strike\nHAMBURG - Workers at carmakers Audi and BMW stage further strikes but German labour leaders and employers are aiming for a deal on wages and working hours by early February, representatives of both sides tell Reuters. (GERMANY-WAGES/ (UPDATE 1, PIX), moved, by Jan Schwartz, 410 words)\nJapan’s retailers struggle to raise prices, even as economy gains momentum\nTOKYO - Japan’s economy is gathering steam, profits are at record levels and companies are poised to raise wages — yet retailers and restaurant chains are struggling to lift prices for fear of losing customers conditioned by nearly two decades of deflation. (JAPAN-PRICES/, moved, by Sam Nussey and Stanley White, 785 words)\nCOMPANIES GKN shares jump on Melrose bid, plans to split in two\nLONDON - GKN has rejected as “entirely opportunistic” a 7 billion-pound takeover offer from turnaround specialist Melrose and set out plans to split its business to boost profitability, sending shares in the British engineering firm up 30 percent. (GKN-M&A/MELROSE INDS (UPDATE 3), moving shortly, by Kate Holton and Ben Martin, 620 words)\nBritish government prepares for collapse of Carillion\nLONDON - Senior British ministers held crisis talks this week to discuss the fate of key infrastructure partner Carillion as fears grow at the highest levels of government that the debt-laden group could collapse. (CARILLION-RESTRUCTURING/ (UPDATE 2), moving shortly, by Kate Holton, 460 words)\nPuma shares slump as luxury group Kering plans spin-off\nPARIS/BERLIN - Puma shares tumble after French parent Kering says it will spin off the German sportswear group to its shareholders and focus solely on its luxury fashion and jewellery labels. (KERING-PUMA DE/SPIN-OFF (UPDATE 2, PIX), moved, by Sarah White and Emma Thomasson, 620 words)\nInfosys’ new CEO to roll-out priorities by April as Q3 boosted by tax deal\nBENGALURU - The new chief executive of Infosys Ltd says he would lay out by April fresh strategic priorities for India’s second-biggest software services exporter after it maintained its full-year revenue outlook. (INFOSYS-RESULTS/ (UPDATE 2, PIX), moving shortly, by Sankalp Phartiyal and Tanvi Mehta, 510 words)\nFacebook to emphasize friends, not news, in series of changes\nSAN FRANCISCO/LONDON - Facebook Inc begins to change the way it filters posts and videos on its centerpiece News Feed, the start of what Chief Executive Mark Zuckerberg says will be a series of changes in the design of the world’s largest social network. (FACEBOOK-ZUCKERBERG/ (UPDATE 1, PIX), moved, by David Ingram and Paul Sandle, 500 words)\nFiat Chrysler to invest $1 bln in Michigan plant, add 2,500 jobs\nDETROIT - Fiat Chrysler Automobiles says it will shift production of Ram heavy-duty pickup trucks from Mexico to Michigan in 2020, a move that lowers the risk to the automaker’s profit should President Donald Trump pull the United States out of the North American Free Trade Agreement. (FIAT CHRYSLER-INVESTMENT/ (UPDATE 3, PIX), moved, by Paul Lienert and Joseph White, 570 words)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T21:32:00.000+02:00", "crawled": "2018-01-13T14:51:15.002+02:00", "highlightTitle": ""}