{"organizations": [], "uuid": "6c528e5619e912876df855e164af0f43ea801334", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 54}, "facebook": {"likes": 16, "shares": 16, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223442033&w=1200&r=LYNXMPEE0I1NC", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/uk-usa-dollar-explainer/the-u-s-dollars-slide-and-what-lies-ahead-idUSKBN1F82MC", "country": "US", "domain_rank": 408, "title": "The U.S. dollar's slide and what lies ahead", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T05:07:00.000+02:00", "replies_count": 0, "uuid": "6c528e5619e912876df855e164af0f43ea801334"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-usa-dollar-explainer/the-u-s-dollars-slide-and-what-lies-ahead-idUSKBN1F82MC", "ord_in_thread": 0, "title": "The U.S. dollar's slide and what lies ahead", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - The U.S. dollar took a harsh beating in 2017, on the way to its nearly 10 percent fall, its worst annual performance since 2003. The currency is still reeling this year.\nThe dollar index, which measures the greenback against a basket of major currencies, recently fell to a three-year low.\nMoves by central banks around the world toward monetary policy normalization, increased political uncertainty in the United States and the dearth of volatility across markets have hurt the greenback. Worries about a possible U.S. government shutdown is just the latest factor that could weigh on sentiment for the dollar in the near term.\nSO WHAT‘S AILING THE DOLLAR?\nPresident Donald Trump’s election victory had boosted hopes of American outperformance at the beginning of 2017 and drove the dollar index to a 14-year high. Market participants were betting that the U.S. economy would outperform its European, Japanese and Chinese counterparts and that U.S. monetary policy would tighten much more aggressively than it would elsewhere in the global economy.\nBut there has been a big repricing of those assumptions over the last thirteen months.\nThe slower-than-expected delivery by the Trump administration on some of its economic promises hurt the dollar, reversing its initial post-election rally.\nMeanwhile, the euro area economy, which had been in the doldrums about a year ago, perked up.\nThe respective election victories of French President Emmanuel Macron and Germany’s Chancellor Angela Merkel thwarted the threat of right-wing populism and helped support the euro. This ignited hopes of an end to the European Central Bank’s bond purchases in 2018 and a rate hike soon after.\nOther central banks including the Bank of Canada, Bank of England and Bank of Japan also started talking about tighter monetary policy and even the People’s Bank of China moved to reduce monetary stimulus.\nExceptionally low volatility across the market also diminished the safe-haven allure of the U.S. dollar.\nWHY IS THE DOLLAR SENSITIVE TO CENTRAL BANK POLICY DECISIONS?\nCentral banks influence the cost of capital - the price of money - in a given market. Rising interest rates boost the allure of the dollar and attract foreign investment, increasing the demand for the greenback and thus its value.\nInterest rate differentials lead to traders selling lower- yielding currencies to fund the purchase of higher-yielding currencies.\nWith other major central banks looking at policy normalization, the dollar is no longer the only game in town.\nWHAT IMPACT DOES THE WEAKER DOLLAR HAVE ON U.S. COMPANY EARNINGS AND THE ECONOMY?\nU.S. multinational companies can benefit from declines in the dollar, which make overseas sales more valuable when translated back into the U.S. currency.\nThe weaker currency is also a boon for exporters and manufacturers as it places them at a competitiveness advantage with respect to overseas rivals.\nBut a weaker dollar makes imported goods more expensive for U.S. consumers and hurts companies that rely on foreign goods, such as retailers. It can also make U.S. assets less attractive to foreign investors.\nWHAT COULD EXERT MORE PRESSURE ON THE GREENBACK? So far the currency market has largely discounted the prospect of trade war with China or the heated rhetoric around the North American Free Trade Agreement negotiations. If the chances of a trade war rise it could hurt the dollar in the longer term.\nIf the U.S. economy fails to show any meaningful uptick in inflation, which has been stubbornly weak despite the declining dollar, that could tie the Fed’s hands when it comes to interest rate hikes and drag the dollar lower. This could be aggravated if it comes at a time when the ECB turns more hawkish.\nInvestors looking for the dollar to see a boost from multinational companies converting foreign profits into dollars may have to temper their hopes for a prolonged rebound.\nIf global investors look to diversify their dollar holdings into other currencies such as the euro, that could weigh on the dollar.\nAn analysis of the quarterly data published by the International Monetary Fund of the currency composition of the world’s foreign exchange reserves held by global central banks showed that reserve managers were increasing the pace of adding non-dollar based currencies to their reserves.\nTo be sure, some analysts warn that the dollar’s weakness is overdone and excessive bearish bets against the dollar could spur a short squeeze in the event of any positive news for the dollar.\nThe rough patch for the U.S. dollar, while not over yet, is forecast to ease in 2018, according to a majority of foreign exchange analysts in a recent Reuters poll.\nReporting by Saqib Iqbal Ahmed; Editing by Andrea Ricci\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T05:07:00.000+02:00", "crawled": "2018-01-20T03:01:57.000+02:00", "highlightTitle": ""}