{"organizations": [], "uuid": "ff5dc10fb19e546d4388cf913a53c66aa986a454", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-stocks-retreat-czech-crown-gives-up-some-ground-idUSL8N1PJ2RV", "country": "US", "domain_rank": 408, "title": "CEE MARKETS-Stocks retreat, Czech crown gives up some ground", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T13:11:00.000+02:00", "replies_count": 0, "uuid": "ff5dc10fb19e546d4388cf913a53c66aa986a454"}, "author": "", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-stocks-retreat-czech-crown-gives-up-some-ground-idUSL8N1PJ2RV", "ord_in_thread": 0, "title": "CEE MARKETS-Stocks retreat, Czech crown gives up some ground", "locations": [], "entities": {"persons": [{"name": "sandor peto", "sentiment": "none"}], "locations": [{"name": "budapest", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}], "organizations": [{"name": "cnb", "sentiment": "none"}, {"name": "otp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 11:13 AM / in 8 minutes CEE MARKETS-Stocks retreat, Czech crown gives up some ground Reuters Staff 8 Min Read * Budapest, Warsaw stock indexes retreat from record highs * Polish stocks, top performers in 2017, seen rising further * Crown retreats, but near 5-year highs, CNB rate hike seen By Sandor Peto BUDAPEST, Jan 24 (Reuters) - Central European stocks retreated on Wednesday, taking a pause like their Asian and Western European counterparts, after Budapest and Warsaw indexes hit record highs. After strong gains last year, the Czech, Hungarian and Polish indexes have risen 5-6 percent so far in 2018, driven by a global rally in shares and sound economic fundamentals in the region and its main trade partner, the euro zone. As a global rally lost steam, the region's biggest independent bank, OTP, led a retreat in Central European markets. Instead of pushing to the key technical level of 12,000 forints ($47.97) as some analysts had expected, the stock had shed 1.7 percent by 1017 GMT to trade at 11,530 forints. That contributed to Budapest's main index, which in early trade hit a new record high, losing 0.6 percent. Warsaw's all-share index eased 0.2 percent, off Wednesday's record high. Prague's bluechip index, which in early trade hit its highest since August 2011, shed 0.1 percent. The Czech crown was marginally weaker against the euro. On Tuesday it approached 5-year highs. It received some support from comments from Czech central bank (CNB) board member Marek Mora who said positive data from the Czech and European economies warranted a 25 basis point interest rate hike at the bank's meeting next week. The comments came as no surprise, though, a markets had more or less priced in a rate increase, after two hikes since August as the bank defends its inflation target. Expectations for further hikes buoy the Czech crown. January business and consumer confidence figures released on Wednesday were mixed. A CNB lending survey published early this week was negative for the crown, showing banks further tightened credit standards for housing loans, under pressure from CNB regulations, Raiffeisen analyst Frantisek Taborsky said in a note. \"Given the set of macroprudential measures in place, the CNB does not have to necessarily tackle these (lending overheating) risks via conventional rate hikes,\" he said. Czech Prime Minister Andrej Babis is expected to deliver his government's resignation to President Milos Zeman on Wednesday, after the minority government lost a parliament confidence vote last week. Investors usually shrug off political developments in the region. They have also mostly ignored Warsaw's tension with the European Commission over Poland's judicial reforms which Brussels said threatened the rule of law. Warsaw stocks were the top performer last year among all emerging markets in MSCI's country indices, and analysts and fund managers expect another strong performance this year. CEE SNAPSHOT AT MARKETS 1117 CET CURRENCI ES Latest Previous Daily Change bid close change in 2018 Czech <EURCZK= 25.3850 25.3690 -0.06% +0.62% crown > Hungary <EURHUF= 309.0900 309.8500 +0.25% +0.59% forint > Polish <EURPLN= 4.1628 4.1683 +0.13% +0.33% zloty > Romanian <EURRON= 4.6675 4.6660 -0.03% +0.26% leu > Croatian <EURHRK= 7.4305 7.4305 +0.00% -0.00% kuna > Serbian <EURRSD= 118.5500 118.6800 +0.11% -0.04% dinar > Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2018 Prague 1135.81 1137.060 -0.11% +5.35% 0 Budapest 41269.30 41516.41 -0.60% +4.80% Warsaw 2624.31 2630.37 -0.23% +6.63% Bucharest 8436.41 8436.41 +0.00% +8.80% Ljubljana <.SBITOP 831.84 835.90 -0.49% +3.16% > Zagreb 1868.61 1867.09 +0.08% +1.40% Belgrade <.BELEX1 772.26 775.16 -0.37% +1.64% 5> Sofia 708.32 709.28 -0.14% +4.56% BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT=R 0.4580 -0.1260 +105bps -13bps R> 5-year <CZ5YT=R 1.0190 0.0320 +114bps +1bps R> 10-year <CZ10YT= 1.7840 -0.0130 +120bps -3bps RR> Poland 2-year <PL2YT=R 1.5740 0.0230 +216bps +2bps R> 5-year <PL5YT=R 2.6730 0.0310 +279bps +1bps R> 10-year <PL10YT= 3.3480 0.0290 +277bps +1bps RR> FORWARD RATE AGREEMEN T 3x6 6x9 9x12 3M interban k Czech Rep 1.01 1.17 1.32 0.77 <PRIBOR= > Hungary 0.10 0.15 0.23 0.02 Poland 1.75 1.76 1.86 1.72 Note: FRA are for ask prices quotes", "external_links": [], "published": "2018-01-24T13:11:00.000+02:00", "crawled": "2018-01-24T13:31:54.008+02:00", "highlightTitle": ""}