{"organizations": [], "uuid": "0d336529d4bfad89d5def8daa19c490b51ea27ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-897614860.jpg", "site_section": "http://news.google.com/news?hl=en&tok=Ueiah6PIMCzoHf7CCgJUvQ&ds=n&pq=technology&cp=2&gs_id=9&xhr=t&q=apple&newwindow=1&gl=us&pws=0&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=38093640&biw=1366&bih=653&um=1&ie=UTF-8&output=rss", "section_title": "apple - Google News", "url": "http://fortune.com/2018/01/03/apple-stock-iphone-battery-replacement/", "country": "US", "domain_rank": 1196, "title": "Why the $29 iPhone Battery Replacement Deal Could Hurt Apple's Stock - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T17:50:00.000+02:00", "replies_count": 0, "uuid": "0d336529d4bfad89d5def8daa19c490b51ea27ea"}, "author": "", "url": "http://fortune.com/2018/01/03/apple-stock-iphone-battery-replacement/", "ord_in_thread": 0, "title": "Why the $29 iPhone Battery Replacement Deal Could Hurt Apple's Stock - Fortune", "locations": [], "entities": {"persons": [{"name": "aaron pressman", "sentiment": "negative"}, {"name": "mark moskowitz", "sentiment": "none"}, {"name": "moskowitz", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "barclays", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman 10:50 AM EST \nAfter years of conspiracy theories that Apple was purposely slowing older iPhones to prompt upgrade purchases, the opposite effect may be in play now, according to one Wall Street analyst. \nApple last month admitted that in recent years its iOS software intentionally slow the performance of older iPhones when the batteries degraded. Without the slowdown, the iPhones would suddenly shutdown when the aged batteries couldn’t provide enough power for peak performance. Along with an apology, Apple said it would replace the battery on any model of the iPhone 6 or later for just $29. \nThe offer, and the resulting improvement in performance for older iPhones, may prompt millions of people to forgo an upgrade to a new phone this year, Barclays analyst Mark Moskowitz says. “Our August Wireless survey suggests battery drain is No. 1 reason for users to upgrade to new device – therefore, a new battery may deter some upgrade intention,” Moskowitz writes in a research note on Wednesday. The analyst, who says he is worried Wall Street is “too optimistic” about iPhone sales, rates Apple’s stock “neutral.” \nAbout three-quarters of the 675 million iPhones currently in use would be eligible and potentially in need of the battery upgrade, Moskowitz estimates. “Due to the large base, even a small percentage opting for battery replacement over upgrade could have meaningful impact on iPhone sales,” the analyst writes. \nGet Data Sheet , Fortune’s technology newsletter. \nAssuming just 10% of those eligible take the offer, and about one-third of the battery seekers would have otherwise bought a new iPhone this year, then Apple will lose out on sales of 16 million devices and $10.3 billion of annual revenue, the Barclays analyst forecasts. If half the battery swaps would have otherwise upgraded, Apple loses out on 27 million sales and $18.2 billion in revenue. \nFor context, Wall Street assumes Apple will bring in $274 billion of revenue in its 2018 fiscal year, according to FactSet Research, including sales of 241 million iPhones. \nShares of Apple (aapl) were up 1% to $173.94 in midday trading on Wednesday. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T17:50:00.000+02:00", "crawled": "2018-01-03T18:48:51.084+02:00", "highlightTitle": ""}