{"organizations": [], "uuid": "8a49b18ab2b43798c4673c2eec6e500c199699fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-toll-brothers-inc-prices-400-million-of-senior-notes.html", "country": "US", "domain_rank": 767, "title": "Toll Brothers, Inc. Prices $400 Million of Senior Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.45, "site_type": "news", "published": "2018-01-18T07:12:00.000+02:00", "replies_count": 0, "uuid": "8a49b18ab2b43798c4673c2eec6e500c199699fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-toll-brothers-inc-prices-400-million-of-senior-notes.html", "ord_in_thread": 0, "title": "Toll Brothers, Inc. Prices $400 Million of Senior Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "pa.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "toll brothers, inc", "sentiment": "neutral"}, {"name": "citigroup global markets inc.", "sentiment": "none"}, {"name": "pnc capital markets llc", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "wells fargo securities", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "bancorp investmen", "sentiment": "none"}, {"name": "smbc nikko securities america, inc.", "sentiment": "none"}, {"name": "capital one securities, inc.", "sentiment": "none"}, {"name": "deutsche bank securities inc.", "sentiment": "none"}, {"name": "suntrust robinson humphrey, inc.", "sentiment": "none"}, {"name": "mizuho securities usa llc", "sentiment": "none"}, {"name": "toll brothers finance corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HORSHAM, Pa., Jan. 17, 2018 (GLOBE NEWSWIRE) -- Toll Brothers. Inc. (the \"Company\" or \"we\") (NYSE:TOL), announced today that it has priced an underwritten public offering (the \"Offering\") of $400 million of 4.350% Senior Notes due 2028 (the \"Notes\") issued by Toll Brothers Finance Corp., a wholly-owned subsidiary of the Company. Settlement of the Notes is anticipated to occur on January 22, 2018, subject to satisfaction of customary closing conditions.\nThe Notes have a coupon of 4.350% and will pay interest semi-annually on February 15 and August 15, commencing August 15, 2018.\nThe Company expects to use the net proceeds from the Offering for general corporate purposes, which may include repayment of indebtedness.\nCitigroup Global Markets Inc., Deutsche Bank Securities Inc., Mizuho Securities USA LLC, SunTrust Robinson Humphrey, Inc. and Wells Fargo Securities, LLC are acting as Joint Active Book-Running Managers in the Offering. PNC Capital Markets LLC is acting as Lead Manager in the Offering. Capital One Securities, Inc., SMBC Nikko Securities America, Inc., U.S. Bancorp Investments, Inc., BB&T Capital Markets, a division of BB&T Securities, LLC, BNY Mellon Capital Markets, LLC, Citizens Capital Markets, Inc., Comerica Securities, Inc., Fifth Third Securities, Inc., Regions Securities LLC and TD Securities (USA) LLC are acting as Co-Managers in the Offering.\nThe Offering is being made pursuant to a prospectus supplement and an accompanying prospectus filed as part of an effective shelf registration statement filed by the Company (\"SEC\") on Form S-3 (File No. 333-202046). You may obtain a copy of the preliminary prospectus supplement, the accompanying prospectus and the final prospectus supplement, when available, for free by visiting EDGAR on the SEC website at www.sec.gov . Alternatively, the Company, any underwriter or any dealer participating in the Offering will arrange to send you any of those documents upon request by contacting Citigroup Global Markets Inc. toll free at (800) 831-9146, Deutsche Bank Securities Inc. toll free at (800) 503-4611, Mizuho Securities USA LLC toll free at (866) 271-7403, SunTrust Robinson Humphrey, Inc. toll free at (800) 685-4786, or Wells Fargo Securities, LLC, toll free at (800) 645-3751.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy the securities described herein, nor shall there be any sale of these securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction.\nAbout Toll Brothers, Inc.\nToll Brothers, Inc., A FORTUNE 500 Company, is the nation's leading builder of luxury homes. The Company began business fifty years ago in 1967 and became a public company in 1986. Its common stock is listed on the New York Stock Exchange under the symbol “TOL.” The Company serves move-up, empty-nester, active-adult, and second-home buyers and operates in 20 states: Arizona, California, Colorado, Connecticut, Delaware, Florida, Idaho, Illinois, Maryland, Massachusetts, Michigan, Minnesota, Nevada, New Jersey, New York, North Carolina, Pennsylvania, Texas, Virginia, and Washington, as well as in the District of Columbia.\nForward-Looking Statements\nThis release contains or may contain forward-looking statements within the meaning of Section 27A of the Securities Act and Section 21E of the Exchange Act. One can identify these statements by the fact that they do not relate to matters of a strictly historical or factual nature and generally discuss or relate to future events. These statements contain words such as “anticipate,” “estimate,” “expect,” “project,” “intend,” “plan,” “believe,” “may,” “can,” “could,” “might,” “should” and other words or phrases of similar meaning. Such statements may include, but are not limited to, information related to the anticipated closing of the Offering; anticipated operating results; home deliveries; financial resources and condition; changes in revenues; changes in profitability; changes in margins; changes in accounting treatment; cost of revenues; selling, general and administrative expenses; interest expense; inventory write-downs; home warranty and construction defect claims; unrecognized tax benefits; anticipated tax refunds; sales paces and prices; effects of home buyer cancellations; growth and expansion; joint ventures in which we are involved; anticipated results from our investments in unconsolidated entities; the ability to acquire land and pursue real estate opportunities; the ability to gain approvals and open new communities; the ability to sell homes and properties; the ability to deliver homes from backlog; the ability to secure materials and subcontractors; the ability to produce the liquidity and capital necessary to expand and take advantage of opportunities; and legal proceedings, investigations and claims.\nAny or all of the forward-looking statements included in this release are not guarantees of future performance and may turn out to be inaccurate. Consequently, actual results may differ materially from those that might be anticipated from our forward-looking statements. Therefore, we caution you not to place undue reliance on our forward-looking statements.\nThe factors that could cause actual results to differ from those expressed or implied by our forward-looking statements include, among others: demand fluctuations in the housing industry; adverse changes in economic conditions in markets where we conduct our operations and where prospective purchasers of our homes live; increases in cancellations of existing agreements of sale; the competitive environment in which we operate; changes in interest rates or our credit ratings; the availability of capital; uncertainties in the capital and securities markets; the ability of customers to obtain financing for the purchase of homes; the availability and cost of land for future growth; the ability of the participants in various joint ventures to honor their commitments; effects of governmental legislation and regulation; effects of increased taxes or governmental fees; weather conditions; the availability and cost of labor and building and construction materials; the cost of raw materials; the outcome of various product liability claims, litigation and warranty claims; the effect of the loss of key management personnel; changes in tax laws and their interpretation; construction delays; and the seasonal nature of our business. For a more detailed discussion of these factors, see the risk factors in the prospectus supplement and the information under the captions “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our most recent annual report on Form 10-K filed with the SEC.\nFrom time to time, forward-looking statements also are included in our periodic reports on Forms 10-K, 10-Q and 8-K, in press releases, in presentations, on our website and in other materials released to the public.\nAny or all of the forward-looking statements included in this release, our reports or public statements made by us are not guarantees of future performance and may turn out to be inaccurate. This can occur as a result of incorrect assumptions or as a consequence of known or unknown risks and uncertainties. Many factors mentioned in this release, our reports or", "external_links": ["http://www.globenewswire.com/NewsRoom/AttachmentNg/9b38880f-c984-4274-874b-9decf9cfc687", "https://www.globenewswire.com/Tracker?data=vDUuMxC58g9KYDIxRkr5Yv6pRcaEojMSjaIJqU544hWeDN7jhSzK769q60adfVRo6h5SYBDe-oVx5C20N8vFolnTTLq85i6ycHcdaPBfF-SxD9nuNeCgUMM8UFtA7oVUgiUrIHWJCLfrD4fP6C7jaxClOSlB17AvgD76MQHc4Kp0dneSlVKtwpErYLNzattbbHBJ308oGegevbQfrcKmZn5kaRXgJxGshotqIX7Gt6pEAZdj06NbihmLtBN2Y4aQH9XS4lfopX4b1KZfdxYFkg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/82ad3583-546d-4260-8f42-74629474c2b7", "https://www.globenewswire.com/Tracker?data=Ylm-YKfC2etLiUikw6EWK8Dog4jIjNCEiZjzRYJ4zcD0heiYJruEvXDI5kTi1CskLBI7zmxLXKMWi-ecxDEFeZIapITqWbfQ62WZnJ0ZpFI="], "published": "2018-01-18T07:12:00.000+02:00", "crawled": "2018-01-18T08:20:01.021+02:00", "highlightTitle": ""}