{"organizations": [], "uuid": "2a639a761e76db3d6e28a032bbb70a77ddc6c39d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224926191&w=1200&r=LYNXMPEE0N24B", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews\r", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-autos-congress/senate-looks-for-way-out-of-gridlock-on-self-driving-car-bill-idUSKBN1FD2ZF", "country": "US", "domain_rank": 408, "title": "Senate looks for way out of gridlock on self-driving car bill", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T22:56:00.000+02:00", "replies_count": 0, "uuid": "2a639a761e76db3d6e28a032bbb70a77ddc6c39d"}, "author": "", "url": "https://www.reuters.com/article/us-autos-congress/senate-looks-for-way-out-of-gridlock-on-self-driving-car-bill-idUSKBN1FD2ZF", "ord_in_thread": 0, "title": "Senate looks for way out of gridlock on self-driving car bill", "locations": [], "entities": {"persons": [{"name": "david shepardson", "sentiment": "none"}, {"name": "thune", "sentiment": "none"}, {"name": "john thune", "sentiment": "none"}, {"name": "gary peters", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "commerce committee", "sentiment": "none"}, {"name": "u.s. senate commerce committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 8:57 PM / in 31 minutes Senate looks for way out of gridlock on self-driving car bill David Shepardson 3   The chairman of the U.S. Senate Commerce Committee is pursuing different strategies to win approval this year of landmark self-driving car legislation that could make it easier for automakers to get thousands of cars on the road without human controls. \nSelf-driving cars could reduce the 37,000 annual U.S. road deaths and provide mobility to the disabled and blind, Senator John Thune, a Republican who chairs the Commerce Committee, said in an interview on Tuesday. \nThune said he is trying to convince Democrats to agree to limit debate on the floor. A second option is to attach the self-driving measure to another bill like a forthcoming infrastructure proposal, he added. \nThe move is a shift in the prior effort over the last three months to win unanimous consent from colleagues. \nThune, who is working with Democrat Gary Peters, said he believes if the bill comes to the Senate floor it would win 75 or 80 votes in the 100-member chamber. Senators are considering some changes to win support of the remaining holdouts. \n“We could save a lot of lives,” Thune said, noting government findings that 94 percent of car crashes are caused by human error. “It is cutting-edge technology, transformational in terms of the economy.” \nA few blocks from the Capitol, the committee convened on Wednesday at the site of the Washington auto show for a two-hour field hearing on self-driving cars and other auto technologies that included executives from auto supplier Robert Bosch, Audi and Zoox Inc. \nIn September, the U.S. House of Representatives unanimously passed a measure that would allow automakers to win exemptions from safety rules that require human controls. \nThe self-driving reform bill’s future in the Senate has been complicated by a handful of Democratic senators raising questions about whether the technology is ready and seeking changes. The Senate Commerce Committee approved a similar bill in October. \nSenate Majority Leader Mitch McConnell, a Republican, has not committed to bringing the bill up. \nPeters and his staff have held 1,000 meetings with various groups on the subject to try to win consensus. “Now we are just down to a few folks that have concerns,” Peters said after Wednesday’s hearing. \nGeneral Motors Co, Alphabet Inc, Ford Motor Co and others have lobbied for the landmark legislation, while auto safety groups urged more safeguards. \nWithin three years, the Senate bill would allow automakers to each sell up to 80,000 self-driving vehicles annually if they could demonstrate to regulators they are as safe as current vehicles. States could set rules on registration, licensing, liability and insurance, but not performance standards. Reporting by David Shepardson;   and Cynthia Osterman", "external_links": [], "published": "2018-01-24T22:56:00.000+02:00", "crawled": "2018-01-24T23:03:35.007+02:00", "highlightTitle": ""}