{"organizations": [], "uuid": "66332410f93ac37a3a634997ce4dcda6be367619", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 144, "shares": 144, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222061126&w=1200&r=LYNXMPEE0E088", "site_section": "http://feeds.reuters.com/Reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-indonesia-stock-exchange/people-evacuated-from-indonesia-stock-exchange-after-reports-of-collapsed-structure-metro-tv-idUSKBN1F40G2", "country": "US", "domain_rank": 408, "title": "People evacuated from Indonesia Stock Exchange after reports of collapsed structure: Metro TV", "performance_score": 1, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-15T13:47:00.000+02:00", "replies_count": 0, "uuid": "66332410f93ac37a3a634997ce4dcda6be367619"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-indonesia-stock-exchange/people-evacuated-from-indonesia-stock-exchange-after-reports-of-collapsed-structure-metro-tv-idUSKBN1F40G2", "ord_in_thread": 0, "title": "People evacuated from Indonesia Stock Exchange after reports of collapsed structure: Metro TV", "locations": [], "entities": {"persons": [{"name": "kanupriya kapoor", "sentiment": "none"}, {"name": "fransiska nangoy", "sentiment": "none"}, {"name": "michael perry", "sentiment": "none"}], "locations": [{"name": "jakarta", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "indonesia stock exchange", "sentiment": "negative"}, {"name": "metro tv jakarta", "sentiment": "negative"}, {"name": "metro tv", "sentiment": "none"}, {"name": "alpino kianjaya", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JAKARTA (Reuters) - A mezzanine floor overlooking the main lobby of the Indonesian Stock Exchange building collapsed on Monday, injuring scores of people, many of them students, under slabs of concrete and other debris.\nThe high-rise building, constructed in the late 1990s, is part of a two-tower complex in the heart of the financial district and houses dozens of other offices including the World Bank. It was the target of a car bombing by Islamist militants in September 2000.\nPolice ruled out a bomb as a cause of Monday’s collapse. They said more than 70 people had been injured, but no deaths had been reported.\nJakarta governor Anies Baswedan visited the site and said the city will “audit the building”, which was last inspected by authorities in May.\n“I have conveyed to the building’s management that the audit of the construction should start tonight so that the activities of the stock exchange are not disturbed,” Baswedan told reporters.\nSafety standards are often loosely enforced in Indonesia. Last year, a fire that ripped through a fireworks factory on the outskirts of Jakarta killed around 50 people in one of the country’s worst industrial accidents. A police investigation found multiple safety violations.\nMany of the injured were university students who were on the mezzanine floor when it collapsed.\nInjured people are treated outside the Indonesian Stock Exchange building following reports of a collapsed structure inside the building in Jakarta, Indonesia January 15, 2018. REUTERS/Darren Whiteside “There was a rumbling noise but it wasn’t an explosion. It was like something had fallen, and suddenly the floor we were standing on fell away,” said student Alfita, 20, who uses one name. She escaped with light bruises.\nDramatic CCTV footage aired on television showed a floor shearing away in a matter of seconds under the students. Reuters could not immediately authenticate the video.\n“Slabs of concrete started to fall, there was lots of dust. Water pipes had burst,” said Megha Kapoor, who works in the building and was in the lobby at the time.\nSlideshow (3 Images) Police cordoned off the complex as people fled the building and the more seriously injured were taken away by stretcher.\nTriana Tambunan, business development manager at MRCC Siloam hospital, one of the hospitals near the building, said 30 people had been admitted so far. Victims were being treated at four hospitals.\n“The bone fractures may be serious. We need to carry out further evaluations,” she said, adding there were at least three suspected fractures.\nStock exchange president director Tito Sulistio said the exchange would pay for the treatment of the visiting students.\nFinance Minister Sri Mulyani Indrawati said she hoped the collapse would not affect investor confidence in the tropical Southeast Asian archipelago. The exchange resumed business in the afternoon as per schedule.\nAdditing reporting by Cindy Silviana, Kanupriya Kapoor, Maikel Jefriando and Fransiska Nangoy; Writing by Ed Davies; Editing by Nick Macfie\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T13:47:00.000+02:00", "crawled": "2018-01-15T07:59:34.098+02:00", "highlightTitle": ""}