{"organizations": [], "uuid": "37985ea0513bc8805c16caa49c734575835856f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/15/104170506-GettyImages-629845362.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/23/apple-amazon-facebook-and-google-spent-nearly-50-million--a-record--to-influence-the-u-s-government-in-2017.html", "country": "US", "domain_rank": 767, "title": "Tech lobbying reached a record $50 million in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T15:31:00.000+02:00", "replies_count": 0, "uuid": "37985ea0513bc8805c16caa49c734575835856f3"}, "author": "Tony Romm", "url": "https://www.cnbc.com/2018/01/23/apple-amazon-facebook-and-google-spent-nearly-50-million--a-record--to-influence-the-u-s-government-in-2017.html", "ord_in_thread": 0, "title": "Tech lobbying reached a record $50 million in 2017", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Apple , Amazon , Facebook and Google cumulatively racked up a roughly $50 million tab fighting off President Donald Trump and an onslaught of new federal regulations last year — a reflection that the tech industry is increasingly under political siege in the nation's capital.\nOver the course of 2017, the biggest brands in tech warred with the White House over immigration, tried and failed to save net neutrality and weathered a congressional investigation into the ways in which Russian trolls spread propaganda on their sites during the last election.\nThe heightened scrutiny and withering criticism — targeting tech on everything from sex trafficking to fake news — prompted many companies to spend more money than ever to lobby the government, according to official ethics forms filed at midnight. And yet the industry's political activities in 2017 may only presage a tougher and costlier clash with Washington, D.C., in the year to come.\nTech's most prolific political spender last year was Google, which dedicated more than $18 million to lobby the U.S. government. That's more than its tech peers, not to mention much of corporate America.\nMore from Recode:\nHere's why people on Twitter are seeing news alerts that they didn't ask for Netflix now has nearly 118 million streaming subscribers globally Bitcoin broker Coinbase booked $1 billion in revenue last year — so the company has told hovering VCs to back off Like other tech giants, Google sought to stave off new regulations targeting the content and ads that appeared on sites and services like search and YouTube. Meanwhile, the company pitched its own wares, like self-driving cars, as lawmakers and other federal officials debated the new technology .\nAmazon, meanwhile, spent more than $12.8 million in lobbying last year — nearly four times what it spent four years earlier — as it continued to advocate for friendlier federal rules around everything from online sales taxes and cloud computing to package-delivering drones . The company also had to contend in 2017 with fresh questions about the size of its corporate footprint, particularly after acquiring Whole Foods.\nFacebook spent a record amount last year — roughly $11.5 million — as lawmakers railed on the social giant for the \"fake news\" and other content that appeared in users' feeds.\nAnd Apple shelled out $7 million — again, more than ever — to lobby the U.S. government over the same period. The iPhone giant continued to press forward on issues like encryption and immigration. And the company — like the rest of the industry — advocated for the tax reform law recently signed by Trump.\nApple and Facebook declined to comment for this story; Amazon and Google did not immediately respond to emails seeking comment.\nFor much of tech, the industry's tough 2017 began as soon as Trump entered the White House and signed an executive order restricting immigrants and refugees from majority-Muslim countries. While federal courts later tossed that initial directive, Trump's early, aggressive stance on immigration only foreshadowed further restrictions, including those targeting high-skilled foreign workers and their spouses.\nMore recently, tech giants like Amazon, Apple, Facebook, Google and Microsoft have tapped their vast lobbying armies to revive a program known as DACA . Scrapped by Trump in 2017, it had protected young immigrants who had been brought illegally to the U.S. as children from being deported. The future of DACA fed a stalemate in Congress this January that briefly caused the U.S. government to shut down.\nWeb companies, meanwhile, faced unfamiliar calls for fresh regulation in the nation's capital last year. For Facebook, Google and Twitter , it primarily came in the form of an investigation that found that hundreds of millions of their U.S. users had", "external_links": [], "published": "2018-01-23T15:31:00.000+02:00", "crawled": "2018-01-23T16:07:15.019+02:00", "highlightTitle": ""}