{"organizations": [], "uuid": "5b419d5a2420f6693e9f510768245f7621cc8d99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/23/104860112-GettyImages-850578376.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/29/david-beckham-co-owners-awarded-major-league-soccer-team-in-miami.html", "country": "US", "domain_rank": 767, "title": "David Beckham, co-owners awarded Major League Soccer team in Miami", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T03:21:00.000+02:00", "replies_count": 0, "uuid": "5b419d5a2420f6693e9f510768245f7621cc8d99"}, "author": "Kellie Ell", "url": "https://www.cnbc.com/2018/01/29/david-beckham-co-owners-awarded-major-league-soccer-team-in-miami.html", "ord_in_thread": 0, "title": "David Beckham, co-owners awarded Major League Soccer team in Miami", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "British soccer star David Beckham said his new Major League Soccer team couldn't have been anywhere else but Miami .\n\"We've got a hotbed of young talent in this city, and that's what we want,\" Beckham told CNBC's \" Power Lunch \" on Monday, after MLS formally announced the award of an expansion franchise to Beckham's ownership group.\nCo-owner Jorge Mas, a well-known Miami businessman, was on \"Power Lunch\" with Beckham and agreed the team is great for the city.\n\"We deserve a soccer franchise,\" Mas said. \"The cultural mosaic that is Miami, with the Latin community and the makeup of it — soccer runs in their blood.\"\nA 25,000-seat, $225 million stadium will be built under Beckham's ownership group in Overtown, a neighborhood of Miami. Details such as the team's name, colors, logo and start date have not yet been revealed. The owners said they envision the team competing globally, but first need to let the league grow locally.\n\"The viewers, the fans, they love this game, and they'll come,\" Beckham said.\n\"[But] these things take time,\" Beckham said. \"We need to let the [MLS] grow in a very organic way. At the end of the day it's a very young league.\"\nThis will be South Florida's first MLS team since Fort Lauderdale's Miami Fusion, which flopped in 2001 after only a few short years.\nGetty Images David Beckham addresses the crowd during the press conference announcing an MLS franchise in Miami at the Knight Concert Hall on January 29, 2018 in Miami, Florida. \"That was back in the day, when the league wasn't so stable,\" Beckham said. He credits his co-owners — including Mas and Mas' brother Jose, who \"live and breathe this city\" — as a major force that will ensure the team's success.\nThe location of the team, along with Beckham's prestige in the industry, will also help the team thrive, Mas said.\n\"I think we can do great things in Miami that we can't do in any other city,\" he said.\nBeckham, who retired from the sport in 2013 following a 20-year career, announced he would form his own team that same year. He is the first former MLS player to own a team in the league.\nHowever, the road to a new team wasn't easy. Residents in South Florida rejected multiple proposals for the location of the stadium. Beckham and his investors finally secured a site in December 2015 after three failed attempts.", "external_links": [], "published": "2018-01-30T03:21:00.000+02:00", "crawled": "2018-01-30T04:50:44.016+02:00", "highlightTitle": ""}