{"organizations": [], "uuid": "3a32d1c9943f14298f1b1d2746533243eb62c91b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104962038-9I9B0008.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/bitcoin-criticized-at-wef-in-davos-but-cryptocurrency-world-fights-back.html", "country": "US", "domain_rank": 767, "title": "Bitcoin criticized at WEF in Davos but cryptocurrency world fights back", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-01-26T13:22:00.000+02:00", "replies_count": 0, "uuid": "3a32d1c9943f14298f1b1d2746533243eb62c91b"}, "author": "Arjun Kharpal", "url": "https://www.cnbc.com/2018/01/26/bitcoin-criticized-at-wef-in-davos-but-cryptocurrency-world-fights-back.html", "ord_in_thread": 0, "title": "Bitcoin criticized at WEF in Davos but cryptocurrency world fights back", "locations": [], "entities": {"persons": [{"name": "patrick bucci", "sentiment": "negative"}, {"name": "stephen poloz", "sentiment": "none"}, {"name": "shiller", "sentiment": "none"}, {"name": "robert shiller", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}], "organizations": [{"name": "wef", "sentiment": "negative"}, {"name": "cnbc  bitcoin", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}, {"name": "bank of canada", "sentiment": "none"}, {"name": "crypto hq", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bitcoin was hammered by top business leaders at the World Economic Forum in Davos, but those in the cryptocurrency world had a message of their own.\nCryptocurrencies were one of the biggest topics at the Forum. There was an official session on it, CNBC ran a few panels about the subject in The Sanctuary, and there was even a dedicated spaced called Crypto HQ, which focuses on blockchain technology.\nWhile the potential of blockchain, the underlying technology behind cryptocurrencies, was praised, bitcoin got slammed.\n\"There is no intrinsic value for something like bitcoin so it's not really an asset one can analyze. It's just essentially speculative or gambling,\" Stephen Poloz, the governor of the Bank of Canada, told CNBC Thursday. \nNobel Prize-winning economist Robert Shiller told CNBC ahead of Davos that it may be around for 100 years, though it's more likely to collapse.\n\"(Bitcoin) might totally collapse and be forgotten and I think that's a good likely outcome but it could linger on for a good long time, it could be here in 100 years,\" Shiller told CNBC.\nBitcoin's reputation as a currency that is primarily used for illicit activities still lingered too.\n\"The fact that the anonymity, the lack of transparency and the way in which it conceals and protects money laundering and financing of terrorism and all sorts of dark trades is just not acceptable,\" Christine Lagarde, managing director of the International Monetary Fund, said during a panel talk in Davos earlier this week.\nshow chapters Should you invest in a cryptocurrency?      9:27 AM ET Thu, 26 Oct 2017 | 05:22 Bitcoin saw a massive price rise last year but has had a tough start to the year. The price of the cryptocurrency is down over 21 percent since January 1.\nCryptocurrencies are extremely volatile and many have called the space a bubble. But in Davos, there were a large number of leaders in the crypto space attending the Forum.\nThey were bullish on the potential of the technology and countered the views of Poloz and Shiller.\n\"We are still not in the kind of dotcom bubble territory in terms of the overall market capitalization,\" Richard Muirhead, general partner at Fabric Ventures, told CNBC during a session at The Sanctuary on Thursday.\nHis sentiment was echoed by Nic Cary, co-founder of cryptocurrency wallet Blockchain.\n\"You have to look at the fundamentals,\" he said. \"To us, we are seeing increases in transaction volume and to me that's one of the first indicators that more people are using this in their daily lives and that's really interesting to me.\"\nCryptocurrency is a truly divisive topic and discussions in Davos have further brought it on to the world stage.", "external_links": [], "published": "2018-01-26T13:22:00.000+02:00", "crawled": "2018-01-26T13:24:40.040+02:00", "highlightTitle": ""}