{"organizations": [], "uuid": "64383ea3d3ddd27409fdcf90d4eab1156bd1c7fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-aon-completes-acquisition-of-leading-alternative-investment-advisor-townsend-group.html", "country": "US", "domain_rank": 767, "title": "Aon completes acquisition of leading alternative investment advisor Townsend Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:00:00.000+02:00", "replies_count": 0, "uuid": "64383ea3d3ddd27409fdcf90d4eab1156bd1c7fe"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-aon-completes-acquisition-of-leading-alternative-investment-advisor-townsend-group.html", "ord_in_thread": 0, "title": "Aon completes acquisition of leading alternative investment advisor Townsend Group", "locations": [], "entities": {"persons": [{"name": "townsend", "sentiment": "none"}, {"name": "cary grace", "sentiment": "none"}], "locations": [], "organizations": [{"name": "aon", "sentiment": "negative"}, {"name": "townsend group chicago", "sentiment": "negative"}, {"name": "the townsend group", "sentiment": "none"}, {"name": "colony northstar, inc", "sentiment": "none"}, {"name": "global retirement & investment solutions", "sentiment": "none"}, {"name": "ocio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 2, 2018 /PRNewswire/ -- Aon, the leading global professional services firm providing a broad range of risk, retirement and health solutions, today announced it has completed its acquisition of The Townsend Group (Townsend), majority owned by Colony NorthStar, Inc. Townsend is a leading provider of global investment management and advisory services primarily focused on real estate and real assets.\n\"We are excited to welcome the Townsend organization into Aon and further enhance our investment solutions in areas that are of increasing importance to our clients,\" said Cary Grace, chief executive officer of Global Retirement & Investment Solutions at Aon. \"Working together, our combined teams will continue to expand our capabilities and expertise in alternative investments to create sophisticated and transparent offerings that provide our clients with objective advice and solutions.\"\nAon is currently one of the top three outsourced chief investment officer (OCIO) providers in the world measured by global assets under management. 1,2 After the closing, Aon's Investment organization, including Townsend, manages more than $130 billion of worldwide assets under management 1,3 and has advised on more than $240 billion 4,5 of real estate assets, confirming Aon's commitment to the alternative investments space.\nAbout Aon\nAon plc (NYSE:AON) is a leading global professional services firm providing a broad range of risk, retirement and health solutions. Our 50,000 colleagues in 120 countries empower results for clients by using proprietary data and analytics to deliver insights that reduce volatility and improve performance.\nFor further information on our capabilities and to learn how we empower results for clients, please visit http://aon.mediaroom.com .\nFollow Aon on Twitter: https://twitter.com/Aon_plc\nSign up for News Alerts: http://aon.mediaroom.com/index.php?s=58\nAon Media Contact:\nMaurissa Kanter\nmaurissa.kanter@aon.com\n+1.847.442.0952\n1 As of 9/30/17, $118 B in global assets under management advised by AHIC ($89.9 B) and its global advisory affiliates.\n2 Pension & Investments, 2017 Investment Outsourcing Survey, 68 firms participated in the survey. The rankings are based on the industry data reported by Pensions & Investments as of 03/31/2017. The rankings are based on the worldwide assets under management in investment outsourcing programs reported by each advisor who supplied data to Pensions & Investments. As of 3/31/2017, Aon's global asset under management was approximately $102.9 billion. Assets under management is calculated based on assets in which Aon has full discretion. The survey does not report on any undisclosed facts about any of the advisors who participated in the survey that could call into question the validity of the underlying data. The survey does not state or imply that the rankings represent the quality of advice provided by any advisor who participated in the survey. The survey discloses the complete list of advisors who participated in the survey. The data may not represent any one client's experience because the data reflects the cumulative asset growth across the entire sampling of the clients of each advisor who participated in the survey. The data is not indicative of the future performance of advisors who participated in the survey. The survey was conducted by Pensions & Investments. No advisor paid a fee to participate in the survey.\n3 As of June 30, 2017, Townsend had assets under management of approximately $14.8 billion. When calculating assets under management, Townsend aggregates net asset values and unfunded commitments on a quarterly basis. Townsend relies on third parties to provide asset valuations, which typically takes in excess of 90 days after the quarter end. Therefore, assets under management have been calculated using June 30, 2017 figures where available but may also include March 31, 2017 figures. Assets under management are calculated quarterly. Regulatory AUM is calculated annually and available in our ADV or upon request.\n4 As of June 30, 2017, Townsend provided advisory services to clients who had real estate allocations of approximately $167.1 billion. Advised assets includes real estate allocations as reported by clients for whom Townsend provides multiple advisory services—including strategic and underwriting advice for the entire portfolio. Advised assets are based on totals reported by each client to Townsend or derived from publicly available information. Advised assets are calculated quarterly. Select clients report less frequently than quarterly in which case Townsend rolls forward prior quarter totals. The recent change in Advised Assets is due to a change in the reporting of certain special projects.\n5 As of June 30, 2017, AHIC (U.S. only advised real estate assets) provided non-discretionary advisory services to clients who had $76.3 billion in real estate allocations. AHIC relies on third parties to provide asset valuations, which typically takes in excess of 90 days after the quarter end. Therefore, assets under management have been calculated using June 30, 2017 figures where available but may also include March 31, 2017 figures. Regulatory AUM is calculated annually and is available in AHIC's ADV or upon request.\nView original content: http://www.prnewswire.com/news-releases/aon-completes-acquisition-of-leading-alternative-investment-advisor-townsend-group-300576303.html\nSOURCE Aon plc", "external_links": ["http://www.prnewswire.com/news-releases/aon-completes-acquisition-of-leading-alternative-investment-advisor-townsend-group-300576303.html", "https://twitter.com/Aon_plc", "https://c212.net/c/link/?t=0&l=en&o=2023596-1&h=2682196009&u=https%3A%2F%2Ftwitter.com%2FAon_plc&a=https%3A%2F%2Ftwitter.com%2FAon_plc", "http://aon.mediaroom.com/index.php?s=58", "https://c212.net/c/link/?t=0&l=en&o=2023596-1&h=1534325725&u=http%3A%2F%2Faon.mediaroom.com%2Findex.php%3Fs%3D58&a=http%3A%2F%2Faon.mediaroom.com%2Findex.php%3Fs%3D58", "https://c212.net/c/link/?t=0&l=en&o=2023596-1&h=501478585&u=http%3A%2F%2Faon.mediaroom.com%2F&a=http%3A%2F%2Faon.mediaroom.com"], "published": "2018-01-02T16:00:00.000+02:00", "crawled": "2018-01-02T16:20:51.002+02:00", "highlightTitle": ""}