{"organizations": [], "uuid": "9f1d8f04ed05e6febf4fffcf3952d0d4d188ece7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/28/104309892-GettyImages-466326198.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/how-much-money-millennials-think-they-need-to-retire.html", "country": "US", "domain_rank": 767, "title": "How much money millennials think they need to retire", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-17T15:00:00.000+02:00", "replies_count": 0, "uuid": "9f1d8f04ed05e6febf4fffcf3952d0d4d188ece7"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/16/how-much-money-millennials-think-they-need-to-retire.html", "ord_in_thread": 0, "title": "How much money millennials think they need to retire", "locations": [], "entities": {"persons": [], "locations": [{"name": "international longevity centre", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "aarp", "sentiment": "none"}, {"name": "aperion care", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Young people may be underestimating how much money they need to fund their futures.\n\"As many as 34 percent of millennials believe they only need $200,000 or less to retire comfortably,\" reports Aperion Care , which surveyed 2,000 millennials to get a sense of what they think about aging, retirement and their future in general.\n\"The reality, however, is they need much more. According to AARP , in order to live off of $40,000 a year, a retiree needs to save about $1.18 million for a 30-year retirement.\"\nThe same report found that only 25 percent of millennials think they need $1 million or more to retire comfortably. The chart below comes from Aperion Care:\nHow much you will need in your golden years is highly personal and depends on your lifestyle and spending habits, but there are a few basic guidelines to follow if you want to retire comfortably.\nMany experts recommend setting aside at least 10 percent of your income as soon as possible. And a 2017 report from the International Longevity Centre — UK (ILC-UK) finds that people should be saving at least 11 percent , and ideally more like 20 percent, of their income if they want \"to achieve an adequate retirement income,\" which it defines as 70 percent of your earnings throughout your working life.\nWhile millennials tend to get a bad rap for how they manage their money — and may indeed be underestimating how much they need for their future — many young people actually have six-figure retirement savings accounts .\nAccording to a 2017 Fidelity Investments analysis of 59,000 millennials who have contributed to a 401(k) plan for 10 years, the average balance was $109,400 at the end of June 2017, NerdWallet reports .\nshow chapters The definitive guide to retirement savings plans      10:50 AM ET Wed, 9 Aug 2017 | 01:51 No matter how much you have set aside, start building a suitable nest egg today by following these three steps:\nContribute as much of your income as you can. If you're funding a 401(k), the contribution limit for 2018 is $18,500 for workers under age 50. If you're funding a Roth IRA or traditional IRA, the maximum yearly contribution is $5,500 for workers under 50. Automate your contributions . Have your employer do a payroll deduction or have your money taken out of your checking account and sent straight to your retirement account. After all, you can't spend money you don't see. Get in the habit of upping your savings consistently, either every six months, at the end of each year or whenever you get a raise. Again, if you make this automatic by setting up \"auto-increase,\" you won't forget to up your contributions, or talk yourself out of setting aside a larger chunk. Like this story? Like CNBC Make It on Facebook ! \nDon't miss: Here's how many millennials are actually saving for retirement \n\nshow chapters See the simple formula one self-made millionaire created to get rich      6:34 PM ET Wed, 11 Jan 2017 | 00:56", "external_links": [], "published": "2018-01-17T15:00:00.000+02:00", "crawled": "2018-01-17T16:04:03.000+02:00", "highlightTitle": ""}