{"organizations": [], "uuid": "1aaf09fe9f7d46860e09b3d7a50098c2c9dd9c2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222776325&w=1200&r=LYNXMPEE0G1BD", "site_section": "http://feeds.feedburner.com/reuters/euzPJ", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-northkorea-missiles-diplomacy/russia-vancouver-meeting-is-aggravating-situation-around-north-korea-idUSKBN1F626U", "country": "US", "domain_rank": 408, "title": "Russia: Vancouver meeting is aggravating situation around North Korea", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T23:42:00.000+02:00", "replies_count": 0, "uuid": "1aaf09fe9f7d46860e09b3d7a50098c2c9dd9c2d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-northkorea-missiles-diplomacy/russia-vancouver-meeting-is-aggravating-situation-around-north-korea-idUSKBN1F626U", "ord_in_thread": 0, "title": "Russia: Vancouver meeting is aggravating situation around North Korea", "locations": [], "entities": {"persons": [{"name": "catherine evans", "sentiment": "none"}, {"name": "jack stubbs", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "north korea moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "foreign ministry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 4:42 PM / Updated 7 minutes ago Russia says North Korea summit undermines U.N., aggravates situation Reuters Staff 3 Min Read \nMOSCOW (Reuters) - Russia hit out on Wednesday at a U.S.-led effort to increase international pressure on North Korea, saying it was making the situation worse and undermining the United Nations. \nTwenty nations hosted by the United States and Canada in Vancouver agreed on Tuesday to consider tougher sanctions to press North Korea to give up its nuclear weapons. \nNorth Korean leader Kim Jong Un has refused to give up development of nuclear missiles capable of hitting the United States in spite of increasingly severe U.N. sanctions, raising fears of a new war on the Korean peninsula. \nThe Russian Foreign Ministry said top diplomats from Moscow and Beijing had not been invited to the meeting, which was made up of countries that backed South Korea during the 1950-53 Korea War, and that the events were damaging the authority of the United Nations. \n“It is an absolutely unacceptable situation, when 17 countries take upon themselves the role of ‘helper’ to the UN Security Council and interpreter of its resolutions, thereby actually putting its authority into doubt,” the ministry said in a statement. \n“Such events, conducted hastily and to the detriment of functioning multilateral formats, are not contributing to the normalisation of the situation around the Korean peninsula, but on the contrary, aggravating it.” \nIn Washington, a senior U.S. official said that the meeting had been planned for months and sought to push back against the idea that it would aggravate tensions on the peninsula. \n“It is not factually accurate to say that the event was conducted hastily. This has been many months in the planning,” said Under Secretary of State Steve Goldstein, responding to the Russian foreign ministry’s statement. \n“We believe that this is another step forward in ensuring that the sanctions hold tight,” he added, saying Washington would brief Beijing and Moscow. “We all share the same view that it is time for North Korea to come to the table and let’s negotiate a complete denuclearization of the Korean Peninsula.” \nNorth and South Korea began talks last week for the first time in more than two years and agreed on Wednesday to field a combined women’s ice hockey team and march together under one flag at next month’s Winter Olympics in Pyeongchang, South Korea. Reporting by Jack Stubbs; Additional reporting by Arshad Mohammed in Washington; Editing by Catherine Evans and James Dalgleish", "external_links": [], "published": "2018-01-17T23:42:00.000+02:00", "crawled": "2018-01-17T19:06:53.024+02:00", "highlightTitle": ""}