{"organizations": [], "uuid": "55a08be9e5552d8daeba02830b033a3a57f78ec0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/15/103869980-GettyImages-113816576-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/25/thinking-of-buying-an-electric-vehicle-heres-what-you-need-to-know-about-charging.html", "country": "US", "domain_rank": 767, "title": "Thinking of buying an electric vehicle? Here's what you need to know about charging", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:54:00.000+02:00", "replies_count": 0, "uuid": "55a08be9e5552d8daeba02830b033a3a57f78ec0"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/thinking-of-buying-an-electric-vehicle-heres-what-you-need-to-know-about-charging.html", "ord_in_thread": 0, "title": "Thinking of buying an electric vehicle? Here's what you need to know about charging", "locations": [], "entities": {"persons": [{"name": "macy claprood", "sentiment": "neutral"}, {"name": "rosemarie aquilina", "sentiment": "none"}, {"name": "nassar", "sentiment": "none"}, {"name": "claprood", "sentiment": "none"}], "locations": [{"name": "miami", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "fort lauderdale", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "amazon  amazon", "sentiment": "none"}, {"name": "kroger", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}, {"name": "nissan leaf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When Macy Claprood was making the commute to Miami for her summer job, she glanced at the instrument panel in her Nissan Leaf and realized she had to fill up — on electricity.\nClaprood, 21, of Fort Lauderdale, had to stop halfway at a mall parking lot to top off the batteries in her electric car.\nShe didn't have a choice \"because I wasn't going to make it,\" she said.\nEvery driver who decides to go electric faces the same anxieties about charging. It's the more complicated part of owning an electric car, especially since outside the home garage, charging stations can be few and far between.\nThe good news is that powering up is only going to get easier and more convenient. Plus, there's the payoff: the money saved by not having to buy gasoline.\nRead more from USA Today: \nReport: Kroger considers teaming up with China's Alibaba against Amazon \nAmazon headquarters finalists: Some say winning would come at too high a price \nJudge Rosemarie Aquilina: Who is the woman who signed Nassar's 'death warrant'? \nClaprood paid $10 each time she used a station to recharge her Nissan Leaf in Miami — and she appreciates the savings. On the Fort Lauderdale-to-Miami commute she was making last summer to her job teaching lifeguard lessons, she estimates she would have spent about $20 round-trip on gas in a conventional car.\nThat's one reason she loves her Leaf, which tops out at an electric range of about 107 miles.\n\"The gas just costs so much money,\" she said. \"It definitely pays off.\"\nMost electric-car drivers are like her, using public charging stations only when they occasionally need them. They love the quiet power that their cars provide.\n\"I don't know that I could ever go back to gas,\" Claprood said. \"I like the car.\"\nWith the current shortfall of charging stations, though, electric-car drivers admit to a hassle factor.\nMore stations are coming, potentially making things easier for Claprood. Tesla is tripling its fleet of fast-chargers by the end of 2018, Volkswagen is spending heavily on new stations, and the U.S. government is backing new infrastructure plans, among many other investments. But it's not clear if they will be enough.\nHoping to go electric? Here's what to expect:\nAutomakers step up their own charging plans Volkswagen's emissions scandal turned out to be good news for electric-car charging.\nThe German automaker agreed to invest $2 billion over 10 years in U.S. electric-car infrastructure, including new stations and educational initiatives, as part of a federal settlement over its diesel emissions scandal.\nMark McNabb, CEO of the VW-funded Electrify America program, said the company is spending $500 million apiece in four 30-month cycles. The first round of investments is focusing heavily on installation of stations in 17 metro areas, including six in California.\nAnd the terms of the settlement prevent VW from favoring its own technology.\nTesla makes sure vehicles get special treatment Tesla continues to develop its own nationwide network of electric-car stations, dubbed superchargers. Usage is free to buyers of the company's Model S sedan and Model X crossover for the first 1,000 miles annually and available to buyers of the new, lower-priced Model 3 for a fee.\nThe company started 2017 with 5,000 superchargers globally and projected in April that it would finish the year with 10,000. CEO Elon Musk told analysts in August that the company would triple its network by 2018.\nSome Tesla superchargers have been busy for long periods, angering owners. But Musk said in August that \"we're confident that will address the supercharging needs of S, X and 3.\"\nTesla vehicles can also charge at public outlets and in the home.\nHome charging will be critical For a few hundred or thousand dollars, electric-car owners can install a charging station at home. Since charging overnight is easy — it can even be done with a standard outlet — the Department of Energy projects that more than 90% of charging will take place in a residential setting, up from about 80% today.\nAutomakers are beginning to deliver electric cars that alleviate a condition known as \"range anxiety,\" which afflicts electric-car owners who fear they'll run out of electricity on the road with nowhere to charge.\nThe Tesla Model 3, which began shipping to customers this fall at a starting price of $35,000 before tax incentives, is able to travel at least 220 miles on a charge. Musk originally projected weekly production of 5,000 vehicles by the end of December but has since revised that target to the end of the second quarter after hitting manufacturing snags.\nGM's Bolt, which is available for sale nationwide for $37,500 before incentives, goes at least 238 miles on a charge. Most major automakers are working on longer-range electric vehicles at similar or even lower prices.\nSince the average commute is about 25 miles per day, \"running out of energy is just not going to be that common,\" said John Nielsen, managing director of automotive engineering for AAA.\nWorkplace charging is becoming more common Aside from the home, the workplace is the most common place for drivers to charge up.\nExperts said employers are increasingly installing charging units as they realize it's an amenity that helps keep workers happy.\n\"You're going to charge wherever your car naturally parks, and where it parks the most is at home and work,\" said Pasquale Romano, CEO of ChargePoint, which operates a network of charging stations and facilitates payments.\nDrivers who rely on street parking might have to wait longer to go electric.\nAlthough some foreign cities are experimenting with curbside charging stations, it's unlikely to come to U.S. streets anytime soon.\n\"That's an area of the ecosystem that's really underserved right now,\" said Simon Ouellette, CEO of Mogile Tech, which runs the EV station-finding ChargeHub app.\nBut VW's McNabb said people who don't have access to a garage or parking lot charger can access \"community depots\" with super-fast charging where they can pop in and out for a quick fill-up.\nFaster charging will speed electric-car sales Technologists are aiming for systems that could eventually charge electric vehicles in as little as 10 minutes.\nBut that will require automotive companies to reconfigure battery chemistry and vehicle electronics to accommodate the intense power demands of extremely fast charging, said Michael Berube, director of the Department of Energy's Vehicle Technologies Office.\nMcNabb said it's important for stations to be \"future-proof,\" meaning capable of making upgrades as batteries improve.\n\"What was technologically advanced three years ago is not really even relevant today, so I think it's important we keep our eye on that so we end up continually adapting to changing technologies,\" McNabb said.\nPublic stations may become unnecessary Eventually, it's possible no one will charge their vehicles — and all those public charging stations could become unnecessary.\nIf auto futurists are right that we're headed toward a world in which people no longer own cars and instead hire self-driving, electric vehicles through ride-hailing apps, fleet operators likely will charge up the vehicles.\n\"Something like that would reduce the need for public charging,\" Ouellette said.\nSomeday, electric cars could even charge wirelessly through so-called inductive systems — chargers embedded in parking spots or the roadway itself. Proponents of inductive charging say the technology's first application could be for city buses or trucks.\nIf inductive charging ever becomes available, the very concept of a charging station could go by the wayside.", "external_links": [], "published": "2018-01-25T18:54:00.000+02:00", "crawled": "2018-01-25T20:53:52.010+02:00", "highlightTitle": ""}