{"organizations": [], "uuid": "8b6684914b58366e32111bb889e55b92ec50e7c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225556428&w=1200&r=LYNXMPEE0P14W", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/trade-nafta/as-nafta-talks-drag-mexico-suggests-timeline-could-be-extended-idINKBN1FF2FI", "country": "US", "domain_rank": 408, "title": "At NAFTA talks, Canada hails jet case as victory for free trade", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:09:00.000+02:00", "replies_count": 0, "uuid": "8b6684914b58366e32111bb889e55b92ec50e7c7"}, "author": "", "url": "https://in.reuters.com/article/trade-nafta/as-nafta-talks-drag-mexico-suggests-timeline-could-be-extended-idINKBN1FF2FI", "ord_in_thread": 0, "title": "At NAFTA talks, Canada hails jet case as victory for free trade", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "david ljunggren", "sentiment": "none"}, {"name": "anthony esposito", "sentiment": "none"}, {"name": "chrystia freeland", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "canada-united states", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "boeing co", "sentiment": "none"}, {"name": "delta", "sentiment": "none"}, {"name": "min read  montreal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bombardier", "sentiment": "none"}, {"name": "bombardier inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 6:10 PM / Updated 12 minutes ago At NAFTA talks, Canada hails jet case as victory for free trade David Ljunggren , Anthony Esposito 4 Min Read \nMONTREAL (Reuters) - Canadian plane maker Bombardier Inc ( BBDb.TO ) won a major U.S. case on Friday, which government officials said showed the importance of free trade at a time when talks to modernize the NAFTA pact are moving slowly. \nA U.S. tribunal unexpectedly dismissed a complaint by Boeing Co ( BA.N ) against alleged dumping by Bombardier in the case of 75 jets it sold to Delta. The ruling allows the Canadian firm to pursue other orders in the lucrative U.S. market. \n“Canada-United States trade is important to the prosperity of both our countries. This decision will support well-paying middle-class jobs on both sides of the border,” Canadian Foreign Minister Chrystia Freeland said in a statement. \nThe United States, which has taken a more isolationist stance under President Donald Trump, wants big changes to the trilateral North American Free Trade Agreement. \nTeams from the United States, Canada and Mexico are in Montreal for the sixth of seven planned rounds on how to revamp the 1994 pact but progress is slow. \nMexico on Friday suggested the talks could be extended to give officials more time to address disagreements threatening to undermine the $1.2 trillion treaty. \nAs the negotiations grind on, officials are looking at an extra round in Mexico at the end of February, according to sources close to the process. \nAlthough the process was initially scheduled to finish by the end of March to avoid clashing with Mexican presidential elections in July, Economy Minister Ildefonso Guajardo said the timeline could be extended. \n“This negotiation has a window of opportunity to reach a deal between February and the end of July,” he told Reuters. \nCanada, which this week presented a series of suggestions on how to unfreeze the talks, quickly welcomed the idea. \n“Canada does not believe that we need put an arbitrary deadline on these negotiations at the cost of a good deal for all three countries. ‎We are happy to continue negotiating,” said a government source. \nU.S. chief negotiator John Melle, asked about a possible extension, told Reuters, “I have nothing to say on that. We are pushing ahead.” \nA Mexican source briefed on the talks said once the election campaign has started, negotiators could still continue their work but without holding formal rounds. \nMexican deputy economy minister Juan Carlos Baker hit back at the idea that progress was slow. \n“I would dispute the notion that talks are not moving forward, or have not progressed, or are in any way, shape or form swamped,” said Baker, adding that he was “optimistic” that the results from the round would please ministers from the three nations when they meet on Monday to review the week’s work. \nThe three nations are now looking at an extra week of talks in Mexico, possibly starting Feb. 26, ahead of the last round in Washington at the end of March, said the sources. \nWhether more talks can help forge an agreement is unclear, given the gulf between the United States and its two partners. \nThe Trump administration, which blames NAFTA for hurting U.S. manufacturing, wants the North American content of autos to be raised. \nCanada responded by suggesting that content would be higher if the value of software and other high-tech materials made by the three nations were taken into account. \nAn auto industry source said U.S. and Mexican negotiators found the idea interesting but gave no details. Canadian chief negotiator Steve Verheul said on Thursday “there is a lot more thinking” to do about the idea. Additional reporting by Anthony Esposito in Montreal and Dave Graham in Mexico City; Editing by Jeffrey Benkoe and Alistair Bell", "external_links": [], "published": "2018-01-27T00:09:00.000+02:00", "crawled": "2018-01-27T00:32:26.011+02:00", "highlightTitle": ""}