{"organizations": [], "uuid": "fc02d82014fdbfe3be9c4981f874459bc931fc58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/entertainment", "section_title": "Entertainment Industry &amp; Celebrity News | Reuters.com", "url": "https://www.reuters.com/article/us-awards-oscars-reactions-factbox/factbox-oscar-nominations-greeted-with-pride-gratitude-and-delight-idUSKBN1FC262", "country": "US", "domain_rank": 408, "title": "Factbox: Oscar nominations greeted with pride, gratitude and delight", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:01:00.000+02:00", "replies_count": 0, "uuid": "fc02d82014fdbfe3be9c4981f874459bc931fc58"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-awards-oscars-reactions-factbox/factbox-oscar-nominations-greeted-with-pride-gratitude-and-delight-idUSKBN1FC262", "ord_in_thread": 0, "title": "Factbox: Oscar nominations greeted with pride, gratitude and delight", "locations": [], "entities": {"persons": [{"name": "gary oldman", "sentiment": "none"}, {"name": "meryl streep", "sentiment": "none"}, {"name": "sally hawkins", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "academy of motion picture arts and sciences", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (Reuters) - Nominees for the Academy Awards, which will be presented on March 4, greeted the honors with pride, delight and gratitude.\nThe following are some reactions - through statements, telephone calls and social media - to the Oscar nominations announced on Tuesday by the Academy of Motion Picture Arts and Sciences.\n- Meryl Streep, best actress for “The Post,” her 21st nomination\n”I am honored beyond measure by this nomination for a film I love, a film that stands in defense of press freedom, and inclusion of women’s voices in the movement of history - Proud of the film, and all her filmmakers. Thank you from a full heart.”\n- Sally Hawkins, nominated for best actress for “The Shape of Water”\n“I am so delighted for us all. To be honored by the acknowledgement of my colleagues of fellow actors, filmmakers, writers, crew members is truly humbling. It is a privilege to tell such stories and to be able to make films that show there is a life beyond the life that people know – one that is not always seen.”\n- Gary Oldman, best actor nominee for “Darkest Hour”\n“To have the chance to play an iconic leader like Winston Churchill at this point in my career, was the opportunity of a lifetime and I am so happy that my colleagues and partners on this wonderful film have also been honored with nominations. I am overjoyed to be nominated, and proud to be part of this wonderful thing known as movie making!”\n- Lesley Manville, best supporting actress nominee for “Phantom Thread”\n”I am rather giddy with excitement at the wonderful news and extremely thankful ... It is also quite a day for my son Alfie Oldman - having both parents nominated in the same year.”\n- Greta Gerwig, nominated for best director and best original screenplay for “Lady Bird,” which is also up for best picture\n“This is an unbelievable honor and I am beside myself with joy and gratitude. The entire team who made ‘Lady Bird’ poured their heart and soul into it, and I am so deeply grateful to the Academy for their recognition.”\n- Saoirse Ronan, best actress nominee for “Lady Bird”\n“To have been a part of a film like ‘Lady Bird’ was a true privilege and I am incredibly grateful to the Academy for recognizing this wonderful story about the beauty and strength of women.”\n- Laurie Metcalf, best supporting actress nominee for “Lady Bird”\n“What a morning. I’m thrilled to be recognized with the incredible actresses in my category, and am grateful to the Academy for this amazing honor.”\n- Richard Jenkins, best supporting actor nominee for Guillermo del Toro’s “The Shape of Water”\n“I’m so excited and thrilled by the nomination and for “The Shape of Water” team lead by Guillermo the Great. It is rare and humbling to be part of something so special.”\n- Martin McDonagh, director of “Three Billboards Outside Ebbing, Missouri,” which received seven nominations including best picture, best actress and best supporting actor\n“I‘m thrilled that our film has received seven nominations from the Academy, and that the beautiful work of our editor Jon Gregory, our composer Carter Burwell, my gentle brothers-in-arms Woody Harrelson and Sam Rockwell, and our fearless leader Frances McDormand, have all been recognized so wonderfully.”\n- Octavia Spencer, best supporting actress nominee for “The Shape of Water”\n“My heart is bursting with pure elation for the cast and crew of ‘The Shape Of Water.’ Guillermo has given us all a dream job and to be recognized by the Academy is so deeply moving.”\n- Aaron Sorkin, best adapted screenplay nominee for “Molly’s Game”\n“This nomination represents the great work of hundreds of people—from STX and our producers to Jessica Chastain and the entire cast and crew. I couldn’t ask for a greater gang of people with whom to share this incredible honor.”\n- Carlos Saldanha, director of “Ferdinand” nominated for best animated feature film\n“I was just going through airport security when my phone started buzzing!! Thankfully they didn’t stop me and I was able to celebrate!!! I thought they would arrest me for looking like a crazy man laughing and screaming!!!”\n- Dorota Kobiela, co-director of best animated feature film nominee “Loving Vincent”\n“I am so proud we are the first Polish animation feature film to be nominated for an Oscar. I am equally proud that this year I am one of two women directors nominated in this category, which until now only had four women nominated out of 72 directors nominated.”\nCompiled by Patricia Reaney; Editing by Frances Kerry\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T00:01:00.000+02:00", "crawled": "2018-01-23T20:46:39.012+02:00", "highlightTitle": ""}