{"organizations": [], "uuid": "a6dbe55835b962a2b9d265e626d36831df7d4b4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-discover-the-world-usa-appointed-to-represent-great-events-uk.html", "country": "US", "domain_rank": 767, "title": "Discover the World USA appointed to represent Great Events UK", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:26:00.000+02:00", "replies_count": 0, "uuid": "a6dbe55835b962a2b9d265e626d36831df7d4b4d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-discover-the-world-usa-appointed-to-represent-great-events-uk.html", "ord_in_thread": 0, "title": "Discover the World USA appointed to represent Great Events UK", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SCOTTSDALE, Ariz., Jan. 31, 2018 /PRNewswire/ -- Discover the World USA has been appointed to represent Great Events UK, a DMC specialised in professional travel and destination management in London, Cambridge and the South of England.\nFergus Wilson, Business Development Manager at Great Events UK explains, \"Great Events UK specialises in delivering totally unique and customised itineraries for UK bound MICE, group travel and leisure industries. With 20 years of experience working with our domestic clients, we are excited to be partnering with Discover the World to be able to offer our unrivalled knowledge, connections and expertise to the US market. Their proactive sales strategy, the time taken to understand us, our objectives, our product and expertise, as well as their deep knowledge and close connections with the US outbound market made Discover the World an easy choice when seeking overseas representation.\"\n\"We are excited to represent this truly exceptional Destination Management Service and help further develop awareness of their brand within the US market,\" said Ian Murray, Executive Vice President Discover the World. \"Our Discover the World operation continues to grow, and we are delighted to represent Great Events UK. MICE is a vibrant and fast-growing sector and we will be using our contacts and expertise to generate new business for Great Events across the US.\"\nFor more information about Discover the World, visit discovertheworld.com or call (480) 707-5566 or +44 203 598 8030.\nAbout Discover the World\nDiscover the World has earned a reputation as a leader in global travel distribution and its success in developing a worldwide network of 85 offices in more than 60 countries capable of exceptional representation performance is unmatched. With a portfolio of nearly 100 clients utilizing its sales, marketing and business process outsourcing services, Discover the World remains a dominant innovator for the travel industry.\nAbout Great Events UK\nGreat Events UK is known for their unprecedented local knowledge, resources and team of experts to help organise unforgettable corporate events for clients. Whether the client is looking for a tailored meeting, a conference, or an incentive programme, Great Events UK will deliver a unique, bespoke experience with exclusive rates due to their buying power in the UK market. Their services include excursions, tours, activities, hotel bookings, dining and transfers. For more information, please visit www.greateventsuk.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/discover-the-world-usa-appointed-to-represent-great-events-uk-300591238.html\nSOURCE Discover the World", "external_links": ["http://www.greateventsuk.com/", "http://www.prnewswire.com/news-releases/discover-the-world-usa-appointed-to-represent-great-events-uk-300591238.html"], "published": "2018-01-31T19:26:00.000+02:00", "crawled": "2018-01-31T20:33:50.006+02:00", "highlightTitle": ""}