{"organizations": [], "uuid": "306e0a8b74f9e7eeb2e97d89889a1484c3fc0d9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-eu-grains-analyst/eu-cereal-crops-in-good-shape-after-mild-wet-weather-analyst-idUSKBN1F71BP", "country": "US", "domain_rank": 408, "title": "EU cereal crops in good shape after mild, wet weather - analyst", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T13:09:00.000+02:00", "replies_count": 0, "uuid": "306e0a8b74f9e7eeb2e97d89889a1484c3fc0d9e"}, "author": "", "url": "https://www.reuters.com/article/us-eu-grains-analyst/eu-cereal-crops-in-good-shape-after-mild-wet-weather-analyst-idUSKBN1F71BP", "ord_in_thread": 0, "title": "EU cereal crops in good shape after mild, wet weather - analyst", "locations": [], "entities": {"persons": [{"name": "strategie", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "strategie grains", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 11:10 AM / Updated 8 hours ago EU cereal crops in good shape after mild, wet weather - analyst Reuters Staff 2 Min Read \nPARIS (Reuters) - Cereal crops in the European Union are in decent condition after mild temperatures and abundant rainfall so far this winter, analyst firm Strategie Grains said on Thursday. \nThe rain has boosted groundwater reserves - an important factor for crop development during spring and summer - including in Spain where water reserves had been partially replenished after drought last year, it said in a monthly report. \nLike other analysts, Strategie Grains noted that the mild, wet winter so far could bring risks later on. \n“At this stage, the winter cereals are in good condition across the EU. However, having not yet reached their full capability to withstand the cold, the plants are more vulnerable to frost damage in the event that Europe were hit by a severe cold spell in the coming weeks,” it said in a monthly report. \n“A continuation of the mild, damp weather could also increase potential parasite problems in the spring.” \nStrategie Grains trimmed its forecast for 2018 soft wheat production in the EU to 141.6 million tonnes, from 142.3 million projected last month. \nThe reduced outlook for this year’s soft wheat crop was mainly due to downward revisions to area in France and Germany, it said. \nIt also cut its estimate of 2017 soft wheat production, by 500,000 tonnes to 142.0 million, mostly to factor in a lower figure for France. \nAnd it left almost unchanged its 2018 EU barley production forecast at 62.1 million tonnes, up 6 percent from last year’s crop. It continued to expect a rebound in Spain after the drought-hit 2017 harvest and higher spring barley area in northern Europe after rain prevented some winter grain sowings. \nStrategie Grains’ outlook for EU 2018 production of maize, which is not planted until spring, was unchanged from last month at 59.9 million tonnes, up 1 percent from 2017 output. Reporting by Gus Trompiz; editing by Alexander Smith", "external_links": [], "published": "2018-01-18T13:09:00.000+02:00", "crawled": "2018-01-18T13:23:38.000+02:00", "highlightTitle": ""}