{"organizations": [], "uuid": "e04725f62bba4a0c0e2482a4a1f71c84ab011165", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 42, "shares": 42, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226162840&w=1200&r=LYNXMPEE0S03U", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-hdd-wagner/klopps-advice-helped-wagner-make-best-decision-of-career-idUKKBN1FI05W", "country": "US", "domain_rank": 408, "title": "Klopp's advice helped Wagner make 'best decision' of career", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T04:12:00.000+02:00", "replies_count": 0, "uuid": "e04725f62bba4a0c0e2482a4a1f71c84ab011165"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-hdd-wagner/klopps-advice-helped-wagner-make-best-decision-of-career-idUKKBN1FI05W", "ord_in_thread": 0, "title": "Klopp's advice helped Wagner make 'best decision' of career", "locations": [], "entities": {"persons": [{"name": "wagner", "sentiment": "neutral"}, {"name": "klopp", "sentiment": "neutral"}, {"name": "john smith", "sentiment": "none"}, {"name": "david wagner", "sentiment": "none"}, {"name": "simon evans", "sentiment": "none"}, {"name": "juergen klopp", "sentiment": "none"}], "locations": [{"name": "huddersfield", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "huddersfield town", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "none"}, {"name": "borussia dortmund", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mainz", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 2:13 AM / Updated 7 hours ago Klopp's advice helped Wagner make 'best decision' of career Simon Evans 5 Min Read \nHUDDERSFIELD, England (Reuters) - The Premier League’s two German managers come face-to-face on Tuesday when David Wagner’s Huddersfield Town host Juergen Klopp’s Liverpool at the John Smith’s Stadium -- and the pair share much more than nationality. \nKlopp and Wagner enjoy a friendship dating back to their time playing at Mainz 05 in Germany’s second tier and indeed Wagner was chosen by Klopp as the best man for his wedding. \nNot surprisingly, when in late 2015, Wagner had the opportunity to leave his coaching job with Borussia Dortmund’s second team, he called Klopp, who just a few weeks earlier had joined Liverpool, and asked him for his advice. \nThe response from Klopp was to the point: “Just do it”. \nWagner took the advice and last year led the Yorkshire club to promotion to the Premier League. In their first season in the top flight since 1972, his side are holding their own in 14th place. \nSat in his small, modest office, amidst the noise of the construction work still going on at Huddersfield’s training centre, Wagner laughs when he was asked whether Klopp had given him any insight into what awaited him at the club. \n“No! He had no knowledge. He knew nothing about Huddersfield And more or less nothing about the Championship,” he told Reuters in an interview. \nWhat Klopp had sensed was that after four years coaching Dortmund’s reserve squad, in the German third-tier, Wagner needed a new challenge and that England would be ideal for him. \n”He knew more or less the circumstance that I was in Dortmund,“ Wagner says. ”I‘m also sure that he’d seen after he was here a month that there is emotion in England in football. So he said ‘if you if you have the chance -- do it, try it.’ \n“What I do know now, after nearly two and a half years in this job, I can say for sure it was one of my best work decisions I made in my life.” POSITIVE OUTLOOK \nThe 46-year-old is hugely admired in Huddersfield. Not only did he achieve the previously unthinkable and guide a team on one of the Championship’s lowest budgets into the Premier League, but he has done so with an infectious positivity. \nHe may not be as extrovert as Klopp but he shares a similar ability to transmit his evidently genuine enthusiasm to supporters as well as players. \nThe club’s training facility has been built on the grounds of a former factory social club. But rather than simply take-over and move in, Huddersfield have ensured that the former occupants remain welcome. Soccer Football - FA Cup Fourth Round - Liverpool vs West Bromwich Albion - Anfield, Liverpool, Britain - January 27, 2018 Liverpool manager Juergen Klopp reacts Action Images via Reuters/Jason Cairnduff \nThe social club bar remains while the canteen is shared between Premier League players and club members popping in for some lunch. The players have the option to eat in a private area or with the public. \nWagner thinks such an unusually open approach is healthy for his players. \n“I think you are still part of the community and you can feel what the community feels, if you would like to,” he says. \n”I like it because I am not often in the city centre to get a feel for the vibe in the community but you can take a lunch in the canteen and you really get some comments, positive or negative, what is going on. Huddersfield Town manager David Wagner gestures during an interview with Reuters at the club's training complex in Huddersfield, Britain, January 25, 2018. Picture taken January 25, 2018. REUTERS/Phil Noble \n“I think it helps to get a feeling what is going on, outside this inner circle of football.” HEAVILY INVOLVED \nWagner is certainly engaged outside of the ‘bubble’ of the game and in contrast to the modern trend for specialisation with managers becoming effectively first-team coaches, he takes a role in the development of the club’s training centre and a host of other projects. \n”I am heavily involved in more or less everything that happens here. I meet the builders, I meet the architects, they ask me questions what my thoughts are, what is the next step and so on. \n“I really like that we are still a community club and we have meetings and connection points with the community. This is extraordinary, yes it is,” he says. \nUltimately though, Wagner’s prime focus is on getting his squad, an alliance of last year’s promotion team with new recruits from Europe, to pull off enough upsets, such as October’s win over Manchester United, to secure survival. \n“We know we have to over-perform in every single game. If we only perform on an average level it will not be enough, this is the truth,” he says. \n“My message has been - don’t be happy with the ordinary, try to work on the extraordinary. Try to give yourself no limits and make sure you know you have to over-perform.” \nWagner talks eloquently about Liverpool’s performance in their recent 4-3 win over Manchester City in the league and Klopp’s work but, as always, he senses a chance remains for his team. \n“I think it is exceptional what he has done so far. He was able to give this team his thoughts. But when we play them, we will be less focused on their game against City and more their loss against Swansea (City) – this gives us hope!” Reporting by Simon Evans; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-29T04:12:00.000+02:00", "crawled": "2018-01-29T05:00:01.007+02:00", "highlightTitle": ""}