{"organizations": [], "uuid": "b9a00b76128bea19f1a6c51a8ccf63e5b71747aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-b-riley-financial-inc-acquires-29-percent-of-bebe-stores-inc.html", "country": "US", "domain_rank": 767, "title": "B. Riley Financial, Inc. Acquires 29% of bebe stores, inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-16T16:00:00.000+02:00", "replies_count": 0, "uuid": "b9a00b76128bea19f1a6c51a8ccf63e5b71747aa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-b-riley-financial-inc-acquires-29-percent-of-bebe-stores-inc.html", "ord_in_thread": 0, "title": "B. Riley Financial, Inc. Acquires 29% of bebe stores, inc.", "locations": [], "entities": {"persons": [{"name": "b. riley", "sentiment": "negative"}, {"name": "b. ri", "sentiment": "negative"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "brisbane", "sentiment": "none"}], "organizations": [{"name": "financial, inc", "sentiment": "neutral"}, {"name": "bb brand holdings llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES and BRISBANE, Calif., B. Riley Financial, Inc. (“B. Riley”) (NASDAQ:RILY), a diversified financial services company, and bebe stores, inc. (“bebe”), announced today that B. Riley has made an equity investment in bebe to create a tax efficient platform which is intended to be leveraged for investments in profitable businesses. B. Riley has converted its existing loan to bebe into shares of bebe common stock and has acquired additional shares resulting in B. Riley’s ownership of approximately 29% of bebe’s shares outstanding. Simultaneously with the investment, B. Riley was granted two of five seats on the bebe Board of Directors. B. Riley expects bebe to generate dividends through the acquisition of cash-generating companies and the utilization of its net operating losses.\nThe bebe investment represents an attractive opportunity for B. Riley. After successfully divesting its retail stores, bebe contributed all of its intellectual property rights including licensing revenue to BB Brand Holdings LLC, bebe’s operating subsidiary which is 50% jointly owned by Bluestar Alliance LLC and generated approximately $2.9 million in revenue during the quarter ended September 30, 2017. As a result of these transactions, bebe has minimal expenses and has maintained approximately $340 million net operating loss carryforwards. bebe also owns its former corporate headquarters free and clear of any debt obligations, and this significant real estate asset, which is currently held for sale, is believed to be valued at approximately $30 million.\n“Our relationship with bebe illustrates our strong platform of retail services. Great American Group was instrumental in helping bebe with its retail strategy, while B. Riley FBR and Great American Capital Partners played a pivotal role in transforming the business and providing the capital it needed to explore other strategies,” said Bryant Riley, Chairman and CEO of B. Riley Financial. “This investment reflects the core strategy of B. Riley Principal Investments which is to invest in companies or corporate assets that present attractive cash flows to generate dividends for shareholders. By leveraging bebe’s net operating losses and new tax laws for cash and dividend investments, our focus is to produce attractive investment yields for bebe and B. Riley shareholders.”\nManny Mashouf, founder, Chairman of the Board and Chief Executive Officer of bebe, stated, “I am delighted to have B. Riley as a partner and major investor in bebe. Their investment represents significant value for bebe’s shareholders with an approximately 35% premium over bebe’s trading price and will provide an added level of strategic direction to our business as well as further stabilization to the investor base. We look forward to having B. Riley’s leadership on the board, and to the incremental shareholder value we expect they will create. I would also like to thank our current board members for their guidance and support in the strategic transition of bebe and for making this investment possible.”\nB. Riley’s investment in bebe involved the conversion of all outstanding principal and accrued interest owed by bebe to B. Riley under an outstanding loan in the aggregate amount of approximately $16.9 million into approximately 2.82 million newly issued shares of bebe common stock at a conversion price of $6.00 per share, which represents a premium of approximately 35% over bebe’s trading price of $4.44 at the close of business on January 12, 2018. Additionally, B. Riley purchased 250,000 shares of newly issued common stock from bebe and an additional 250,000 shares of common stock from a family trust formed by Mr. Mashouf, in each case for cash in the amount of $6.00 per share. In total, B. Riley acquired 3,319,528 shares of bebe common stock as a result of these transactions. As part of the agreement with bebe, B. Riley Principal Investments’ Chief Executive Officer, Kenny Young, and Chief Investment Officer, Nick Capuano, have joined bebe’s Board of Directors. In addition, two existing members of bebe’s board of directors have tendered irrevocable written resignations effective on the earlier of a notice from bebe accepting the resignation of such director or October 1, 2018.\nIt is anticipated that the bebe shares will be contributed to B. Riley’s subsidiary, B. Riley Principal Investments, LLC, joining its growing portfolio of cash-flow rich business. B. Riley Principal Investments owns and operates United Online, Inc. and is expected to close its acquisition of magicJack VolcalTec Ltd. later this year.\nSullivan & Cromwell LLP served as legal counsel to B. Riley. Latham & Watkins LLP advised bebe on the transaction.\nAbout B. Riley Financial, Inc.\nB. Riley Financial, Inc. is a publicly traded, diversified financial services company which takes a collaborative approach to the capital raising and financial advisory needs of public and private companies and high net worth individuals. The company operates through several wholly-owned subsidiaries, including B. Riley FBR, Inc ., Wunderlich Securities, Inc. , Great American Group, LLC , B. Riley Capital Management, LLC (which includes B. Riley Asset Management , B. Riley Wealth Management , and Great American Capital Partners, LLC ) and B. Riley Principal Investments, a group that makes proprietary investments in other businesses, such as the acquisition of United Online, Inc.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact are forward-looking statements. These forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause B. Riley's or bebe's performance or achievements to be materially different from any expected future results, performance, or achievements. Forward-looking statements speak only as of the date they are made and neither B. Riley nor bebe assume any duty to update forward looking statements. We caution readers that a number of important factors could cause actual results to differ materially from those expressed in, or implied or projected by, such forward-looking statements. Such forward-looking statements include, but are not limited to, statements about the benefits of B. Riley’s investment in bebe, including future financial and operating results, B. Riley’s or bebe’s plans, objectives, expectations and intentions and other statements that are not historical facts and statements regarding the value, treatment and availability of bebe’s net operating loss carryforwards. The following factors, among others, could cause actual results to differ from those set forth in the forward-looking statements: (i) the risk that the benefits from the transaction may not be fully realized or may take longer to realize than expected, including as a result of changes in general economic and market conditions, interest and exchange rates, monetary policy, laws and regulations and their enforcement, the degree of competition in the geographic and business areas in which B. Riley a", "external_links": ["https://www.globenewswire.com/Tracker?data=ga8ahYzCCTp4fAGuCABeY9bI0wUiiUKNCzuOkAoBUrJFm2dplbpHHOKyiRMZR8ZdFXbjL6ajQbVSDVPmYVAtiC7SHu7eIfBUBueor-bLWP4s8sKFwpeuDxo94jHo9LXPOGnS2qicksKv2v1-dPMshQYeNPYKu-cFkJg6RQugEY-wOc9G6fZ5mfKoNHnckiv9HtuF9Tf9KZGQAO65gsxO0y-woVt5nKgys1NgUuKYH8uKqFRK5v4DTQ6S3PvW1hZ5qfEPyWhW-HEQ65nRhIZjvDc7OK9eqpbSIhtrkFdUOCXcm82ozT51oMavTDecDHlDRgc9j-LOzsyiTFZUl2IiXBGdnihZ2J1MwkHw7MCKkxSZ9nYdkjlo03ZyGFcHp2nU1k0PzadaJnyDI6JdZiQQxtmgea49y9_tcF9Q1Lxr3ZifM_AGOyWgzvS31vTTZ4UwsKsenvi6G0iJ-KGigzA_m7ltXmb39TflsAqAkLs", "https://www.globenewswire.com/Tracker?data=TCCSPMEgc5Wu8m9PcePuFcoP9Sky68eqwbTXjl-bFB1GpDjdGpAiPf6R9boMkAGBimYyr6YTISkR07CxZ5qxlecU4EndfRyjc5IwJNxC-hybQ-V4o-PHL04y8Yll-DS5T2m3JmrAx8XDstT-yJPIL9ZZ0s2crQ9Dhz_7yoFTtk8TchVKrcnsFLnQ59ZUzwVeVuAHrNjXdezCZf9lYqQn1aio2F4kebNFKMo7Y-orC40r-gYxAn3IKqZHJjnZMh-7SddJHgf0y1f1OVVxIiIyVNUajx071RG9PW6GQpd_9I8tprveuTabYuD6qYMCliGyeiCBmxIQtXO5skxgWLwV5Paf-i0Jz0cXWp-X-rAvRXZUCoiH6nIE2q4k_fgOxurg9PmTyff6fdNgEpE8qHT-OPQJme-cW_S0DRXQPcMS1e0BTRLyVgdFz1S1e-JLhgMnOxT8eSmM4FOa3F41PPK65U35ffWGiz0ktN5jV0K", "https://www.globenewswire.com/Tracker?data=bVabfTSpLyuaCn4-_U-EPNSjDbiOTW32J92Spp_27QWcWnisUDSvt7GATDUYXhAGHRZ_iny1UxmpAIf_gV8iVuvbXAtYBzsCwYBPtS9wjRGfcOuTsLyWULv45qFr6bzS612JyRDIDPKI64TpAutciQsvstVROYV9oQrniwYAyMrDQGSQlq0p-9IZMp-13x2TTkNqVDKBSqHSQ3GZn4sLDLKqbBlkq_UV1u50LmH7TOUZnaThL7FZHV5BTIxS8eqfPrvrxtynmWQgg1xllQ-9BBRLGGlz3G8i4GmUB_sGadzUBpgIT14VZRyumvOxenlrQzUARXjD9uvYxPUvW_BNpwPmL1OM-_vnWFMbjSF8RwnMWLjrSR8YlY783eVnkzN69VfIHUtxScYQWuTbqtA-mrCfoT1IMEDwTuOyW6_yDphgtGpcLxNk1pY3nmJriU8bfvQr39_Zc_ungvD6bmYujF9fjtcs6wZcjrzewnb", "https://www.globenewswire.com/Tracker?data=BxzfcuT3S5DcMsct69rIemxhwqsDFF0V6oPdgkON3wOg1b2iAcHzK8ssBhlGqi2wieQeehRkv2jo6jIhSI5XSrmUY3V8NQVar2ykByzY0IQzV3ooK94Q8U3Gx7z7pLgkw5CMop8LTilpWzpiCAygeQ51sGKyc4bgTLmMi9tREQWRbxaABGc_ff5jLqZz-v0m3kmH6yKl51sZPvIN9enMA3_nBnuoBBjeEJqd0oWZkLHqJbM45YUzZjNeKvhpby0cTghu3RnTMXahOex-2qb3wvc6fd3-8dOZqwF4fpGmVrf7SyfdCYn28IFVNEGSgScrST6wmASVat9l_ZWxwCS7hU5ex995x6-PihgYZyhkV8um7Hn2lz5z2wure1AWe6789m7_HN2xl0qga0L6pL-GsGVXXq0WgNayMnwiFZ306gTOidv6yvXNpy3FZpZhHXOugl5CAqW8wvwWDkln2gkb9JkNVa7Y2EXahJI1ziS", "https://www.globenewswire.com/Tracker?data=ga8ahYzCCTp4fAGuCABeYxTA09flWjYpNvBfHSLWT2xuSnlo12od98WGkp1agMsUyTsR_TMRAwssQ2W25cX7KwqsICEo2KBTWNyi3tidmzgt-lEquomfq93t38jOMP0SK8BEC_-R8dwYWJmC6vOXfDlffLZUaysaFvTMtWZ2S5S8nl9eQNJyEMLxqdgJNdNy6ZLXnK0ARBv94WnNEJCFLgFHuQMuKx6cvjgmBG4ialMgBRjfLyKC1VoPj4PKud_eZK2JasB5Ollm_rxjCf8Xi4T-JIORyhfhjhiuhkpLKOBM0mzrdkfH0yySbG9tOi4aZecai5mIlcDzYYAjcFEGJVMCpmoAOtl_5IWFAC9LByg9eIvlbj2gOVkBU5BFTJKBqLlDXJI1SD8A766SHSW68N8uvq2qbwdCRw2YRRB-q9Ry9qr3eANUqZL-4F1pCZtoFTmukj6tFnexchwA0E_JiSK36vnpOmbBlYjptVT", "https://www.globenewswire.com/Tracker?data=-y3entgpbpE9FzsA9Qjw27ItIgKDkMdcLWrTyZhm93-azn7EITHw57Gi81CjF562zaauZUNGMWD78LE6ckvziS-O_Y1JGiZSB7OSACoiy5JIDQgbSpauWXMteMwG7CuyxCoB-c7rjk904TKVb9esseGNe8HIU44ESTMuPeArG6jNfzEm1upDx2ARluBiw2FOtC9izl-N78S2yKuUGHzaZaAHKtV6mwdeoF9PDjJDwwtdB5V9HdtKaTf3ILxphe-xlmp64uyrhlAPoKt5sMIXIwn90rethbQFGv-Vk5pbvHg=", "https://www.globenewswire.com/Tracker?data=xnnb3qtwrBqV_mBUw8H-3XjxeTcZZe4qMjz_4K42W9YESRLDZicAjSH5djJo0-BpYqOP9PIIwOsywwJ_phvAUwT4SIqYsFpiCdj9puGDThcdeJNfsVi8ADRIdO4a4FkJlGRPHErIAD_rdpcZid1eNyENPJ399jk3Vw4pjWs1ub0YqmJDDthmZFIR-ZXu3F1UME3p2W_Y0Jp6nDow-rVkHZfR1bCCpU2j8RRP2KSK8BU=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/809e63a7-293e-466d-9c30-63f160fe91e6", "https://www.globenewswire.com/Tracker?data=BxzfcuT3S5DcMsct69rIeoL0Ug3JzcNuYRaKLzWYy2EdtN0cYLtnER-RoaztEKtmlov3H00f43PE2EsMgF6kIg1j2Czhjo4-GwY7H9aFkRQAYwAGtpHHUSUSCaLXR8PqlVxXqTs05aSNFP68HIrrA0JYeQKLAV0VGp6tlSyJZZx6oSUq9Re1lDUgB-QYkbb7N-Sc5yARw_q6fm7ge5WRyHu5Ntq5kEc0lFca-01K0aHTtHoTWsPOKuYIXIp74hBbcsJV9bX6pSaJL6O29qXnTVYSiOy0UKe20Icvx8zx4GUeYGWOP-Q76hoqDcLySUip9MJFetEd5qFKsdx_lsaQlhEvZz1mozkbDYwNJoZYqRuvyCthwT26sY-6AZvFvBAstl0_dGrUTRMGXVHb2y4da2VzdabCDhm8ASTb8Bhu6kal0dO5TPoGlSugDEsiBydB5492UXpyHGgxYMzB46WI9igyWP5rlA9_RmVXzso"], "published": "2018-01-16T16:00:00.000+02:00", "crawled": "2018-01-16T16:17:53.005+02:00", "highlightTitle": ""}