{"organizations": [], "uuid": "6d7851b7751c7d9e8b8b922d0b9dd18ffc772936", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219276976&w=1200&r=LYNXMPEE030HO", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-britain-economy-lending/uk-consumer-lending-growth-slows-to-weakest-since-2015-boe-idINKBN1ET0Y1", "country": "US", "domain_rank": 408, "title": "UK consumer lending growth slows to weakest since 2015 - BoE", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T11:33:00.000+02:00", "replies_count": 0, "uuid": "6d7851b7751c7d9e8b8b922d0b9dd18ffc772936"}, "author": "", "url": "https://in.reuters.com/article/us-britain-economy-lending/uk-consumer-lending-growth-slows-to-weakest-since-2015-boe-idINKBN1ET0Y1", "ord_in_thread": 0, "title": "UK consumer lending growth slows to weakest since 2015 - BoE", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "melville  britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "boe reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 9:44 AM / in 31 minutes UK consumer lending growth slows to weakest since 2015: BoE Reuters Staff 3 Min Read \nLONDON (Reuters) - British consumers increased their borrowing by the smallest amount since mid-2015 in the three months to November, suggesting households are slowly reining in spending, Bank of England figures showed on Thursday. Property sale signs are seen outside of a group of newly built houses in west London, Britain, November 23, 2017. REUTERS/Toby Melville \nBritain’s economy saw lackluster growth for most of 2017 - especially compared to its faster-growing neighbors - and Thursday’s BoE data suggest this pattern continued toward the end of the year. \nThe central bank said unsecured consumer lending in the three months to November grew at an annualized rate of 8.5 percent, down from 9.3 percent in the three months to October and its weakest since June 2015. \nThe BoE has played down any suggestion of a debt bubble, though it has acknowledged pockets of risk and required banks to set aside more money against the risk of bad loans. \nIn cash term, borrowing was up by 1.4 billion pounds in November alone, compared with economists’ forecasts of a 1.5 billion pound rise in a Reuters poll. \nNet mortgage approvals for house purchase were at the higher end of economists’ forecasts at 65,139 in November compared with 64,887 in October. \nEarlier on Thursday major mortgage lender Nationwide said house prices overall last year grew at their slowest pace since 2012 and fell in London for the first time since 2009. \nThe central bank raised interest rates for the first time in more than a decade in November, reversing a cut made in August 2016, and indicated that further increases were likely in the coming years to keep inflation under control. \nFigures last week from industry group UK Finance showed mortgage approvals by major banks dropped to a 15-month low. \nConsumer credit growth has been slowing gradually since it peaked at nearly 11 percent in November 2016. \nWith Britain’s consumers being squeezed by slow wage growth and the jump in inflation that followed the 2016 Brexit vote, expectations for Christmas spending had been subdued. \nHowever, major clothing retailer Next ( NXT.L ) reported stronger than expected Christmas sales on Wednesday and the Confederation of British Industry said sales growth had been solid in the early part of December. Reporting by David Milliken and William Schomberg", "external_links": [], "published": "2018-01-04T11:33:00.000+02:00", "crawled": "2018-01-04T12:04:47.013+02:00", "highlightTitle": ""}