{"organizations": [], "uuid": "5b0e95f817fe45d3cfa9f49eea6b03fe15541416", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224493992&w=1200&r=LYNXMPEE0M0M7", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/us-russia-election-film/we-are-the-champions-basketball-film-wows-russians-before-election-idUKKBN1FC15A", "country": "US", "domain_rank": 408, "title": "We are the champions - basketball film wows Russians before election", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T12:35:00.000+02:00", "replies_count": 0, "uuid": "5b0e95f817fe45d3cfa9f49eea6b03fe15541416"}, "author": "", "url": "https://uk.reuters.com/article/us-russia-election-film/we-are-the-champions-basketball-film-wows-russians-before-election-idUKKBN1FC15A", "ord_in_thread": 0, "title": "We are the champions - basketball film wows Russians before election", "locations": [], "entities": {"persons": [{"name": "vladimir putin", "sentiment": "none"}, {"name": "andrew osborn", "sentiment": "none"}], "locations": [{"name": "munich", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 2:39 PM / Updated 3 hours ago We are the champions: basketball film wows Russians before election Andrew Osborn 5 Min Read \nMOSCOW (Reuters) - A Russian film about a Soviet Cold War sports victory over the United States has broken box office records months before a presidential election by borrowing a page from Vladimir Putin’s play book: appealing to Russian patriotism. \nThe film, “Going Vertical” in Russian or “Three Seconds” as it has been branded in English, mixes fact with a dose of artistic license to tell the story of how the Soviet basketball team, in a major upset, controversially beat the U.S. national team at the 1972 Munich Olympics. \nAfter taking more than 2.2 billion roubles ($38.88 million)at the box office in just over three weeks, the film, financed by the state, has become the country’s most successful home grown production in rouble terms, watched by more than 8.7 million people or approximately one in 13 registered voters. \nDuring one packed Moscow showing this week, some audience members broke into spontaneous applause and others wiped tears from their eyes at decisive moments in the narrative. \nThe studio behind the film is controlled by Nikita Mikhalkov, an ardent Putin supporter and nationalist whose father wrote the lyrics for the Soviet national anthem under Stalin. One of the main roles, the Soviet team coach, is played by Vladimir Mashkov, who formally nominated Putin for re-election ahead of a March 18 ballot Putin is expected to coast. \nThe film has added piquancy because Russian sport is now mired in an international doping scandal that has seen its team banned from the forthcoming winter Olympics in South Korea, an act Moscow has cast as part of a U.S.-backed plot. \nRussia, its economy growing modestly after a downturn, is also bracing for a new wave of U.S. sanctions over its alleged meddling in the 2016 U.S. presidential election, a charge it denies. \nThe Soviet Union won the 1972 Olympic match with a last gasp basket after a controversial decision to replay the last three seconds. The U.S. team refused to accept their silver medals, arguing they had been robbed of victory. \nThe movie portrays the Soviets as plucky underdogs held back by a lack of resources, scheming sports bureaucrats, and health problems. The U.S. team is cast as a bunch of arrogant rule breakers who resort to fouling to try to claw back the Soviet lead only to end up losing 51-50. \nWidows of two of the Soviet sportspeople portrayed in the film - the coach and a star player - have complained it invents numerous episodes to pull on people’s heart strings, while a small minority of critics have condemned it as Soviet-style propaganda likely to boost already burgeoning anti-Americanism. \n“The film in actual fact doesn’t have anything to do with sport or basketball,” wrote Russian blogger Kirill Shulik. “It’s ... an example of propaganda. Soviet style and Soviet victories are fashionable right now.” FILE PHOTO: Incoming Russian Prime Minister Vladimir Putin (R) listens to explanations from film director Nikita Mikhalkov at a shooting area of the movie \"Burnt by the Sun\" Part Two in Shushary settlement outside St.Petersburg May 13, 2008. RIA Novosti/Kremlin/Sergei Subbotin/Pool/File Photo via REUTERS ANTI-AMERICANISM \nAn opinion poll from the independent Levada Center this month showed that 68 percent of Russians who thought Russia had enemies named the United States as enemy number one, up from 22 percent in March 1999 before Putin became president. \nPutin, whose decision to annex Ukraine’s Crimea in 2014 and back pro-Russian separatists in east Ukraine prompted the West to hit Moscow with sanctions, has dialed up his anti-U.S. rhetoric, casting his country as a besieged fortress, a state of affairs he argues requires national unity. \nMikhalkov, the film’s pro-Putin producer, told an audience at its Moscow premiere in December that the movie was designed to dilute what he described as Western hostility toward Russia as shown by the banning of its Olympic and Para-Olympian teams. Slideshow (4 Images) \n“It is a counterweight to what is happening to us with sanctions, double standards, untruth, fakes and lies,” said Mikhalkov, who has a regular TV show which he often uses to berate the West. \n“It’s a film that like an arrow pierces all of this.” \nVladimir Medinsky, the country’s culture minister, has lauded the film as the most successful home grown production ever, saying it feeds “an appetite to feel pride in ones country,” something he said his ministry sponsored. \nIt has also been hailed as a welcome boost to waning morale. \n“It has come to give us faith in a difficult moment when our reserves of faith are running low,” wrote Elena Yampolskaya, a lawmaker from the ruling pro-Putin United Russia Party and editor of the newspaper “Culture”. The message was that “anything was possible” for Russia, she said. \nThe film’s box office success is partly due to a state campaign to promote home grown films, sometimes at the expense of foreign ones. Paddington 2 fell victim to that policy last week. \nDue to be released on Jan. 18, the authorities changed its release date to Feb. 1 at the last minute in a move critics said was designed to allow “Going Vertical” a longer run without foreign competition. \nAfter cinema owners accused the culture ministry of censorship, it relented and okayed a Jan. 20 release date. Editing by Philippa Fletcher", "external_links": [], "published": "2018-01-23T12:35:00.000+02:00", "crawled": "2018-01-23T19:39:14.057+02:00", "highlightTitle": ""}