{"organizations": [], "uuid": "2be19bfd5767e0843f885227fd9444f449681950", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-daniel-lieberberg-named-president-continental-europe-and-africa-sony-music-entertainment.html", "country": "US", "domain_rank": 767, "title": "Daniel Lieberberg Named President, Continental Europe and Africa, Sony Music Entertainment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T11:00:00.000+02:00", "replies_count": 0, "uuid": "2be19bfd5767e0843f885227fd9444f449681950"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-daniel-lieberberg-named-president-continental-europe-and-africa-sony-music-entertainment.html", "ord_in_thread": 0, "title": "Daniel Lieberberg Named President, Continental Europe and Africa, Sony Music Entertainment", "locations": [], "entities": {"persons": [{"name": "rob stringer", "sentiment": "negative"}, {"name": "daniel lieberberg", "sentiment": "negative"}, {"name": "stringer", "sentiment": "none"}, {"name": "lieberberg", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "continental europe", "sentiment": "negative"}, {"name": "sony music entertainment", "sentiment": "negative"}, {"name": "sony music", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 12, 2018 /PRNewswire/ -- Rob Stringer, CEO, Sony Music Entertainment today announced that Daniel Lieberberg has been named President, Continental Europe and Africa, Sony Music Entertainment.\nIn this role, Lieberberg will oversee Sony Music's operations across the two regions, with the exception of Spain and Portugal. Based in Berlin, he will report directly to Stringer and will be responsible for breaking artists and driving strategic business initiatives across the territories within these regions.\nStated Stringer, \"Daniel is one of the most outstanding creative and futuristic executives in Europe, and I am very happy that he will now lead a group of territories that contribute significantly to our global business. Not only does revolutionary music technology come from some of these countries, but the adage 'hits can come from anywhere' has never been truer, and Daniel is uniquely capable of building on this momentum for our company.\"\nStated Lieberberg, \"I would like to thank Rob Stringer for this fantastic opportunity. I am excited to be leading such a successful group of territories. I look forward to working with the many talented executives across the company to take advantage of the vast creative and technological opportunities in Europe and Africa to aggressively build on Sony Music's global artist development successes.\"\nPreviously, Lieberberg was at Universal Music Germany where since 2014 he oversaw the company's domestic business in Berlin, including the Vertigo/Capitol & Polydor/Island labels. Under his leadership, numerous local and international artists were signed directly to the German company, including Lana Del Rey, Volbeat, Unheilig, Andreas Bourani, and Felix Jaehn. Lieberberg held a number of leadership roles over the course of his career at Universal. After joining the company in 2002, he was named head of the Vertigo label in 2008, and appointed to the Universal Music Germany Management Board in 2011. He began his career as a booker and talent buyer for Marek Lieberberg Konzertagentur, Germany's leading concert promoter. In this role, he was responsible for booking Germany's biggest festivals, Rock am Ring/Rock im Park, working with artists like the Fugees, Weezer, Alanis Morissette, Faithless and Linkin Park.\nAbout Sony Music Entertainment\nSony Music Entertainment is a global recorded music company with a current roster that includes a broad array of both local artists and international superstars. The company boasts a vast catalog that comprises some of the most important recordings in history. It is home to premier record labels representing music from every genre, including Arista Nashville, Beach Street Records, Black Butter Records, BPG Music, Bystorm Entertainment, Century Media, Columbia Nashville, Columbia Records, Day 1, Descendant Records, Disruptor Records, Epic Records, Essential Records, Essential Worship, Fo Yo Soul Recordings, House of Iona Records, Insanity Records, Kemosabe Records, Legacy Recordings, Masterworks, Masterworks Broadway, Ministry of Sound Recordings, Monument Records, OKeh, Polo Grounds Music, Portrait, RCA Inspiration, RCA Nashville, RCA Records, Relentless Records, Reunion Records, Sony Classical, Sony Music Latin, Star Time International, Syco Music and Verity Records. Sony Music Entertainment is a wholly owned subsidiary of Sony Corporation of America.\nView original content with multimedia: http://www.prnewswire.com/news-releases/daniel-lieberberg-named-president-continental-europe-and-africa-sony-music-entertainment-300581373.html\nSOURCE Sony Music Entertainment", "external_links": ["http://www.prnewswire.com/news-releases/daniel-lieberberg-named-president-continental-europe-and-africa-sony-music-entertainment-300581373.html"], "published": "2018-01-12T11:00:00.000+02:00", "crawled": "2018-01-12T13:12:08.013+02:00", "highlightTitle": ""}