{"organizations": [], "uuid": "49edf508b5ddb47e02144f792cce7bf83fea6bee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-illinois-bone-joint-institute-appoints-william-j-robb-iii-md-to-the-position-of-orthopedic-director-chief-medical-officer-cmo.html", "country": "US", "domain_rank": 767, "title": "Illinois Bone & Joint Institute Appoints William J. Robb, III, MD, to the position of Orthopedic Director, Chief Medical Officer (CMO)", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T17:58:00.000+02:00", "replies_count": 0, "uuid": "49edf508b5ddb47e02144f792cce7bf83fea6bee"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-illinois-bone-joint-institute-appoints-william-j-robb-iii-md-to-the-position-of-orthopedic-director-chief-medical-officer-cmo.html", "ord_in_thread": 0, "title": "Illinois Bone & Joint Institute Appoints William J. Robb, III, MD, to the position of Orthopedic Director, Chief Medical Officer (CMO)", "locations": [], "entities": {"persons": [{"name": "william j. robb, iii", "sentiment": "neutral"}, {"name": "robb", "sentiment": "none"}, {"name": "andre blom", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "ibji", "sentiment": "neutral"}, {"name": "illinois bone & joint institute", "sentiment": "neutral"}, {"name": "cmo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 5, 2018 /PRNewswire/ -- Illinois Bone & Joint Institute (IBJI), one of the largest independent, physician-owned orthopedic practices in the U.S., announced today the appointment of William J. Robb, III, MD to the position of orthopedic director, chief medical officer (CMO). Dr. Robb joined IBJI in 1995 and has 40 years of surgical experience, specializing in adult knee disorders.\n\"Dr. Robb is one of America's leading orthopedic surgeons and has been repeatedly recognized for his leadership qualities and contributions to the orthopedics field. Since joining IBJI he has played an integral role in directing the mission, focus and growth of our practice,\" said Andre Blom, chief operating officer of IBJI. \"In his new role as orthopedic director, chief medical officer, Dr. Robb will take the lead in overseeing clinical operations as IBJI continues to deliver optimal outcomes for our patients.\"\nSpecifically, Dr. Robb will play a key role in strategic planning, maintaining and improving clinical quality and safety, advancing development of sub-specialty excellence in service-line programs, overseeing implementation of quality improvement programs and serving as lead orthopedic liaison within provider and payer markets.\n\"IBJI has long had a unique model of affordable, effective, coordinated and accessible care, from diagnosis, to treatment, to rehabilitation. For this very reason, during this evolutionary period in our nation's healthcare, I feel IBJI is uniquely positioned to best serve patient needs and I'm looking forward to pursuing the many opportunities ahead,\" Dr. Robb commented.\nDr. Robb, a graduate of University of Iowa Medical School, completed his internship and initial residency in general surgery at Duke University Medical Center in North Carolina, then returned to Iowa to complete the orthopaedic surgery residency at University of Iowa Hospitals and Clinics. He has published numerous pieces of scholarly research and his contributions to the field have been lauded with a number of industry awards, including the 2017 W.W. Tipton Leadership Award from the American Academy of Orthopaedic Surgeons. He has held leadership positions at the American Association of Hip and Knee Surgeons, the American Academy of Orthopaedic Surgeons and Illinois Orthopaedic Society; and from 2005-2012, he served as Chairman of the NorthShore University Health System's Department of Orthopaedic Surgery.\nAbout Illinois Bone & Joint Institute\nIllinois Bone & Joint Institute (IBJI) is one of the largest independent, physician-owned orthopedic practices in the U.S. More than 100 board-certified and fellowship-trained physicians and surgeons currently treat children and adults, with expertise in every orthopedic specialty. IBJI offers patients collaborative, integrated care including advanced MRI, CT and bone density diagnostics, sports training, sport medicine, sports neurology, rheumatology, podiatry, pain management, rehabilitation and surgical and non-surgical treatments and therapies. IBJI has locations throughout Chicago and the north/northwest suburbs. Additionally, IBJI's OrthoAccess® walk-in clinics offer same-day immediate orthopedic care. IBJI was founded in 1990 and incorporates decades of experience from highly skilled and respected provider teams. For more information, please visit ibji.com .\nMedia Inquiries:\nChelsea Katz\nReputation Partners\nchelsea@reputationpartners.com\n312-222-9131\nView original content with multimedia: http://www.prnewswire.com/news-releases/illinois-bone--joint-institute-appoints-william-j-robb-iii-md-to-the-position-of-orthopedic-director-chief-medical-officer-cmo-300578230.html\nSOURCE Illinois Bone & Joint Institute", "external_links": ["https://www.ibji.com/", "https://www.ibji.com/doctors/robb-william-md/", "http://www.prnewswire.com/news-releases/illinois-bone--joint-institute-appoints-william-j-robb-iii-md-to-the-position-of-orthopedic-director-chief-medical-officer-cmo-300578230.html", "https://www.ibji.com/?gclid=Cj0KCQiAvrfSBRC2ARIsAFumcm_zd8rXdeq4uIyUswywdQkm9Ne8m0rEnQCSDLgaMLSOE82jQKg4oZwaAo7iEALw_wcB", "https://www.ibji.com/services/orthoaccess-immediate-care/"], "published": "2018-01-05T17:58:00.000+02:00", "crawled": "2018-01-05T20:22:13.009+02:00", "highlightTitle": ""}