{"organizations": [], "uuid": "7fe0743f5898719ee604ad10110e71c6beb8e16d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/09/gettyimages-8501546581.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/bill-gates-jpm18-keynote/", "country": "US", "domain_rank": 1196, "title": "Bill Gates JPM2018 Keynote Issues Challenge to Drug Makers | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.914, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "7fe0743f5898719ee604ad10110e71c6beb8e16d"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/09/bill-gates-jpm18-keynote/", "ord_in_thread": 0, "title": "Bill Gates JPM2018 Keynote Issues Challenge to Drug Makers | Fortune", "locations": [], "entities": {"persons": [{"name": "jamie mccarthy/getty", "sentiment": "none"}, {"name": "jamie mccarthy", "sentiment": "none"}, {"name": "bill gates", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "york", "sentiment": "none"}], "organizations": [{"name": "bill & melinda gates foundation", "sentiment": "none"}, {"name": "lincoln center", "sentiment": "none"}, {"name": "jpmorgan healthcare", "sentiment": "none"}, {"name": "getty images for bill & melinda gates foundation", "sentiment": "none"}, {"name": "images for bill & melinda gates foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "jpmorgan healthcare conference Bill Gates Just Delivered a Powerful Message to the Drug Industry NEW YORK, NY - SEPTEMBER 20: Bill & Melinda Gates Foundation co-founder Bill Gates speaks speaks at Goalkeepers 2017, at Jazz at Lincoln Center on September 20, 2017 in New York City. Goalkeepers is organized by the Bill & Melinda Gates Foundation to highlight progress against global poverty and disease, showcase solutions to help advance the Sustainable Development Goals (or Global Goals) and foster bold leadership to help accelerate the path to a more prosperous, healthy and just future. (Photo by Jamie McCarthy/Getty Images for Bill & Melinda Gates Foundation) Jamie McCarthy Getty Images for Bill & Melinda Gates Foundation By Sy Mukherjee January 9, 2018 \nThe 36th annual JPMorgan Healthcare conference is under way in San Francisco this week. The medical confab draws from the gamut of stakeholders in health care and drug development, including executives from top pharma giants, fledgling biotechs, the investor class, and thousands of others who flock to the city to hobnob and, occasionally, make major announcements. It also comes with marquee keynote speeches—such as Monday afternoon’s talk by tech legend and philanthropist Bill Gates . \nGates, known in the health care world for his efforts through his eponymous Bill & Melinda Gates Foundation, delivered the biopharmaceutical industry a reminder about the key role they play alongside charitable organizations, including the basic business case for tackling diseases that afflict emerging economies, during his keynote: “The fact is that global health needs the private sector. And, frankly, the private sector has much to gain from pursuing breakthroughs in global health,” said Gates. \nThe crux of Gates’ message was three-fold: 1) Emerging markets in Africa, Asia, and South America afflicted by these diseases will see booming populations in the coming decades; 2) Tackling the conditions, including infectious diseases, that disproportionately afflict these areas isn’t just the right thing to do, but a palatable business proposition; and 3) Current medical technologies being tested in fields like cancer immunotherapy may well prove effective against HIV/AIDS, malaria, and other scourges round the world. \n“Even in the shorter term, impact and earnings are not mutually exclusive for the private-sector,” said Gates. “We are backing companies like CureVac and Moderna on mRNA approaches for vaccine and drug development, which have the potential to help us tackle cancer. This approach is also intriguing as a potential immunological intervention for HIV, malaria, flu, and the Zika virus,” Gates asserted. \nYou can read Gates’ full prepared keynote remarks, which address the Gates Foundations’ various initiatives, in greater detail here . But Gates’ larger point seems to be: It’s entirely possible for the drug industry to do well by doing good. \nThis essay appears in today’s edition of the Fortune Brainstorm Health Daily. Get it delivered straight to your inbox. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-10T07:24:35.040+02:00", "highlightTitle": ""}