{"organizations": [], "uuid": "5f8ebaa8bfecf0a60a3c4e405bf69850028bcc96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224067859&w=1200&r=LYNXMPEE0L0F9", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-olympics-2018-northkorea/protesters-greet-north-korean-olympic-delegation-touring-seoul-idUKKBN1FB0KV", "country": "US", "domain_rank": 408, "title": "Protesters greet North Korean Olympic delegation touring Seoul", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T08:44:00.000+02:00", "replies_count": 0, "uuid": "5f8ebaa8bfecf0a60a3c4e405bf69850028bcc96"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-northkorea/protesters-greet-north-korean-olympic-delegation-touring-seoul-idUKKBN1FB0KV", "ord_in_thread": 0, "title": "Protesters greet North Korean Olympic delegation touring Seoul", "locations": [], "entities": {"persons": [{"name": "hyon", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "hyon song-wol", "sentiment": "none"}], "locations": [{"name": "seoul", "sentiment": "none"}, {"name": "seoul yuna park", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "gangwon province", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "hyonhee shin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ioc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 6:43 AM / Updated 19 minutes ago South Korea's Moon hopes inter-Korean thaw \"opens door\" for nuclear talks with U.S. Hyonhee Shin , Yuna Park 3 Min Read \nSEOUL (Reuters) - South Korean President Moon Jae-in said on Monday a thaw in relations between the two Koreas ahead of next month’s Winter Olympics presented a “precious chance” to bring about talks between the United States and North Korea over Pyongyang’s nuclear and missile programmes. \nAfter a year of mounting tension on the Korean peninsula, diplomacy focused on sport enabled the International Olympic Committee to announce on Saturday that North Korea will send 22 athletes to the Winter Games, being held on from Feb. 9-25. \nThe Olympics are providing a “precious chance to open the door” for talks to resolve the nuclear issue and establish peace on the peninsula, Moon said at a meeting of senior officials at the presidential Blue House. \n“But no one can be optimistic about how long the current mood for dialogue will last”, Moon said. \n“We need wisdom and efforts to sustain the dialogue opportunities ... beyond the Olympics so that the inter-Korean talks will lead to talks between the United States and North Korea and other forms of dialogue”. \nWhile a recent opinion poll showed most South Koreans welcome the North’s participation in the Games, conservative opponents staged a small, but noisy rally as a North Korean delegation inspected venues in Seoul for cultural events to be held on the sidelines of the Olympics. \nSouth Korean police intervened when one group of protesters burned a picture of North Korean leader Kim Jong Un on the steps of Seoul’s central train station where a delegation from the North had arrived earlier. \nHolding a sign saying “We’re opposed to Kim Jong Un’s Pyongyang Olympics!”, the protesters chanted that the North had “snatched” attention for the showpiece event from South Korea. \nA series of events including concerts, joint training exercises and sporting demonstrations are planned around Olympics. \nThe North Korean delegation was led by Hyon Song-wol, a popular female singer, who smiled and waved to a crowd at the train station before the protest began. \n“Seeing the citizens here welcoming us, I feel we will be able to successfully complete the concert”, Hyon was quoted as saying by a Seoul official, according to a South Korean media pool report. Writing by Josh Smith and Hyonhee Shin; Editing by Simon Cameron-Moore", "external_links": [], "published": "2018-01-22T08:44:00.000+02:00", "crawled": "2018-01-22T08:53:07.001+02:00", "highlightTitle": ""}