{"organizations": [], "uuid": "61d1ac4b8abe3c9d94926a0f4d8f9eb3f64e51f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-delta-apparel-announces-preliminary-first-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Delta Apparel Announces Preliminary First Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-08T15:00:00.000+02:00", "replies_count": 0, "uuid": "61d1ac4b8abe3c9d94926a0f4d8f9eb3f64e51f1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-delta-apparel-announces-preliminary-first-quarter-results.html", "ord_in_thread": 0, "title": "Delta Apparel Announces Preliminary First Quarter Results", "locations": [], "entities": {"persons": [{"name": "robert w. humphreys", "sentiment": "none"}], "locations": [{"name": "s.c.", "sentiment": "none"}, {"name": "greenville", "sentiment": "none"}], "organizations": [{"name": "delta apparel announces preliminary first quarter results", "sentiment": "negative"}, {"name": "dla", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "delta apparel, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "delta appa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GREENVILLE, S.C., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Delta Apparel, Inc. (NYSE American:DLA), a leading provider of basic and branded apparel, headwear and related accessories, today announced preliminary results for its 2018 fiscal first quarter ended December 30, 2017.\nThe Company expects overall net sales for the first quarter of its 2018 fiscal year to be in the range of $88 to $90 million, a 3-5% increase from the $85.3 million in revenue in the prior year quarter, and 16-18% sales growth after adjusting for the $9.4 million in revenue in the prior year quarter from the since-divested Junkfood Clothing business. Notable to the overall sales increase is that each business unit achieved double-digit sales growth over the prior year. Driven by the strong sales performance, the Company expects to show pre-tax profitability in the fiscal 2018 first quarter, which is typically its most challenging quarter, compared to a net loss of $0.08 per diluted share in the prior year period.\n“We are extremely pleased with our strong start to fiscal year 2018,” said Robert W. Humphreys, Delta Apparel, Inc.’s Chairman and Chief Executive Officer. “Our double-digit revenue growth and expected profitability in our seasonally slowest quarter reflects solid execution within each of our businesses and builds upon our strong finish to fiscal year 2017. Our team has done an excellent job of expanding product offerings, increasing distribution, and winning market share. Our brands continue to resonate with consumers and the new Salt Life and Soffe retail stores opened during the quarter provide exciting brand-building and consumer awareness opportunities in key markets for those businesses. We look forward to providing our full results for the first quarter during our upcoming earnings call.”\nThe Company continued to repurchase its shares during the fiscal year 2018 first quarter, acquiring 145 thousand shares on the open market at a cost of $3.0 million, or an average price of $20.69 per share. As of December 30, 2017, the Company had 7.2 million shares outstanding.\nConference Call\nFinal and complete financial results for the fiscal year 2018 first quarter ended December 30, 2017, will be released after the market close on February 5, 2018. At 4:30 p.m. ET on that day, the Company will also hold a conference call with senior management to discuss its financial results and business outlook. The Company invites you to join the call by dialing 800-281-7973. If calling from outside the United States, please dial 323-794-2093. A live webcast of the conference call will be available at www.deltaapparelinc.com . Please visit the website at least 15 minutes early to register for the teleconference webcast and download any necessary software. A replay of the call will be available through March 5, 2018. To access the telephone replay, participants should dial toll-free 844-512-2921. International callers can dial 412-317-6671. The access code for the replay is 9469905.\nAbout Delta Apparel, Inc.\nDelta Apparel, Inc., along with its operating subsidiaries, M. J. Soffe, LLC, Salt Life, LLC and Art Gun, LLC, is an international design, marketing, manufacturing, and sourcing company that features a diverse portfolio of lifestyle basic and branded activewear apparel, headwear and related accessories. The Company specializes in selling casual and athletic products across distribution tiers, including specialty stores, boutiques, department stores, mid-tier and mass chains, and the U.S. military. The Company’s products are made available direct-to-consumer on its websites at www.saltlife.com , www.coastapparel.com , www.soffe.com , and www.deltaapparel.com . The Company's operations are located throughout the United States, Honduras, El Salvador, and Mexico, and it employs approximately 7,700 people worldwide. Additional information about the Company is available at www.deltaapparelinc.com .\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains “forward-looking” statements that involve risks and uncertainties. Any number of factors could cause actual results to differ materially from anticipated or forecasted results, including, but not limited to, the volatility and uncertainty of cotton and other raw material prices, the general U.S. and international economic conditions, the competitive conditions in the apparel industry, restrictions on our ability to borrow capital or service our indebtedness, deterioration in the financial condition of our customers and suppliers and changes in the operations and strategies of our customers and suppliers, our ability to predict or react to changing consumer preferences or trends, our ability to successfully open and operate new retail stores in a timely and cost-effective manner, pricing pressures and the implementation of cost reduction strategies, changes in economic, political or social stability at our offshore locations, disruptions at our manufacturing and other facilities, our ability to attract and retain key management, the effect of unseasonable or significant weather conditions on purchases of our products, and other factors set forth in the \"Risk Factors\" contained in our Annual Reports on Form 10-K filed with the Securities and Exchange Commission. Except as may be required by law, Delta Apparel, Inc. expressly disclaims any obligation to update these to reflect events or circumstances after the date of this press release or to reflect the occurrence of unanticipated events.\nCompany Contact:\nDeborah Merrill\nChief Financial Officer\n(864) 232-5200 x6620\nInvestor Relations Contact:\nSally Wallick, CFA\n(404) 806-1398\ninvestor.relations@deltaapparel.com\nSource:Delta Apparel, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=2XrnFRkqXWyrkYQPTDwJK44VHlZ4w57CSBybdQ-rjN8TV7HIxnVEruStDn42i9FoN37WNtqieOH4eb8FDlH6xVtnyINvI474PjCWbEf1KbG2ZJdNiP_LZstYCXXjMAUdSYenGIPZ6JQCqVLECvC3Oluj8Mz-6aIV4cJ3tRVF_LXOdsXejGd4UafYAmhtMIrBr97lC25KR42uRMg09lNcZT-tM28xZAULzREzhUKiZgi8DbDV_GaKLcG7U0-7nTOu6vj49kxJmUZz7Yc3aJETrQ==", "https://www.globenewswire.com/Tracker?data=XO_16KycAgcaogCy6l64sKEATCs1WGwydxTtzfYTDoI-qnz8Vk0oXenwZOuYdgK5pWUbDuUQCusgXwIy2pyMgqGPbrU_Eg1z5KpLZEKy_NVi0fF3vCm9nONyPqlWQ78IDm9skMKm1HX3Rm0g8tI3ZQ==", "https://www.globenewswire.com/Tracker?data=6FYWbS29NRjI7lUaZPO_2HWCkuD1uJthdkLKVXHIpo3MN4XBCmcpq8XIg1AkQPG59494mV25d5F-6nIa4Jjl0wt2jsT3nZW4r0Ke4Q4Z3NjCPtDlKi_LGe5iSGqIzj1wFwS2EhrTHWIKUUvGJdd9LEd-jpqOnFApqBJZwkrs7S_alfRKY0zO65g2uL7Ac1JFoD1vqOK32QgW_mZsFRcBB08O67xe0OxU4IercrY52O4=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/09e3e4fe-a4dc-4f89-b0ba-70edc9c981a7", "https://www.globenewswire.com/Tracker?data=H2vfr_RPYZl-ZJ7tUTnC-R2PfhfRBRPr-SRvKYPDP7tdfhN9bcBRwAAPQ7VyRvdUZQgGA-vyvmj7o2HYUvcuIiRDKabscczLUy6VUAnTr13O-AHH-pp8Mn45UJQGczPD3VvwEPu4Y8tDJvHUNL5DgKzH4jJmqdj_aVFN5WuNPOAAuQnJI2_JN8VUh64bC7qrWjuslrm_rWqo7lJN-alK0k_O6EP4scZstU7bsTWYkqNwWf-nbYMlEKPdH_n4CUfbzqS346kMFHNIaSTdOijk5g==", "https://www.globenewswire.com/Tracker?data=CLbaWDXiruz-ZHbejIzF_GvvhYR3VexRGbT18fE91AezsDMLnXY9vibzhDLyD5DpiRyywR1nesuyvMSas8LjeknEf-82_IeJ0Dwyp4EvER9XZorSpkRqu0uorw9AEfLgJs2SBbrqMGlZvUJYZwdevfJ0pXTQb5VxRqHCvNik0Zteg60vROsLD20QDWcq51k5hDGIgEbeC8PKeHtnUwO11Qe1AdzneMhM8qRG-bSLbSk=", "https://www.globenewswire.com/Tracker?data=H2vfr_RPYZl-ZJ7tUTnC-Wm8WWu7WXCFExcaU_5HaDb2qGR7hMUEBp4OjbHfBSdQhpLh7Oc1pfOuMCZS_dJrivCz0cypvr2H4BiJZsP7C5HnLZgyVDy68YxuikGucFwmsKmnCOrP21HVNoPeb9NiKb9LxudNbIc-XhJ5YzEdWPBLDzjc--zo7NzKHiRRIAzj8KNXtPNTaoPvB7BSoBoaPYrvE_lBMD0xGP019jyVfdV8Pr_sMASiFj5JfL6w25KJW7o8biEOrZEVA7dUcnR4iQ=="], "published": "2018-01-08T15:00:00.000+02:00", "crawled": "2018-01-08T15:21:26.020+02:00", "highlightTitle": ""}