{"organizations": [], "uuid": "9f91ec70337ecdad6d0545ff6e3bb4882c45d710", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-colfax-schedules-fourth-quarter-2017-earnings-release-and-conference-call.html", "country": "US", "domain_rank": 767, "title": "Colfax Schedules Fourth Quarter 2017 Earnings Release and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-19T23:29:00.000+02:00", "replies_count": 0, "uuid": "9f91ec70337ecdad6d0545ff6e3bb4882c45d710"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-colfax-schedules-fourth-quarter-2017-earnings-release-and-conference-call.html", "ord_in_thread": 0, "title": "Colfax Schedules Fourth Quarter 2017 Earnings Release and Conference Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "annapolis junction", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "colfax", "sentiment": "none"}], "organizations": [{"name": "colfax corporation", "sentiment": "negative"}, {"name": "colfax corporation colfax corporation", "sentiment": "none"}, {"name": "colfax", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Annapolis Junction, MD, Jan. 19, 2018 (GLOBE NEWSWIRE) -- Colfax Corporation (“Colfax”) (NYSE: CFX), a leading diversified industrial technology company, today announced that it will issue a press release providing financial results for the fourth quarter of 2017 on the morning of Tuesday, February 6, 2017. The Company will hold a conference call to discuss these results beginning at 9:00 a.m. Eastern on that day, which will be open to the public through 877-303-7908 (U.S. callers) and +1-678-373-0875 (international callers) and referencing the conference ID number 6555209 or through webcast via Colfax’s website www.colfaxcorp.com under the “Investors” section.\nColfax’s financial results press release and supplemental financial information referenced on the call, if any, for the fourth quarter of 2017 will be available under the “Investors” section of Colfax’s website prior to the conference call. A link to a replay of the call will also be available on the Colfax website later that day.\nABOUT COLFAX CORPORATION\nColfax Corporation is a leading diversified industrial technology company that provides air and gas handling and fabrication technology products and services to customers around the world under the Howden and ESAB brands. Colfax believes that its brands are among the most highly recognized in each of the markets that it serves. Colfax is traded on the NYSE under the ticker “CFX.” Additional information about Colfax is available at www.colfaxcorp.com .\nCAUTIONARY NOTE CONCERNING FORWARD LOOKING STATEMENTS\nThis press release may contain forward-looking statements, including forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. Such forward-looking statements include, but are not limited to, statements concerning Colfax’s plans, objectives, expectations and intentions and other statements that are not historical or current fact. Forward-looking statements are based on Colfax’s current expectations and involve risks and uncertainties that could cause actual results to differ materially from those expressed or implied in such forward-looking statements. Factors that could cause Colfax’s results to differ materially from current expectations include, but are not limited to factors detailed in Colfax’s reports filed with the U.S. Securities and Exchange Commission including its 2016 Annual Report on Form 10-K and Quarterly Report on Form 10-Q for the period ended September 29, 2017 under the caption “Risk Factors.” In addition, these statements are based on a number of assumptions that are subject to change. This press release speaks only as of the date hereof. Colfax disclaims any duty to update the information herein .\nThe term “Colfax” in reference to the activities described in this press release may mean one or more of Colfax’s global operating subsidiaries and/or their internal business divisions and does not necessarily indicate activities engaged in by Colfax Corporation.\nInvestor Contact: Kevin Johnson, Vice President of Financial Planning & Analysis Colfax Corporation +1 (302) 483-7761 kevin.johnson@colfaxcorp.com\nSource:Colfax Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/b70634fd-f496-41ac-9116-6a423da33ea5"], "published": "2018-01-19T23:29:00.000+02:00", "crawled": "2018-01-20T00:52:53.018+02:00", "highlightTitle": ""}