{"organizations": [], "uuid": "92fcc41fc36e5cbd4d5d58f12b4e5965f366ac16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224086919&w=1200&r=LYNXMPEE0L0JM", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-mun-irwin/manchester-united-simply-had-to-go-for-sanchez-says-irwin-idUKKBN1FB0S7", "country": "US", "domain_rank": 408, "title": "Manchester United simply had to go for Sanchez, says Irwin", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T10:17:00.000+02:00", "replies_count": 0, "uuid": "92fcc41fc36e5cbd4d5d58f12b4e5965f366ac16"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-mun-irwin/manchester-united-simply-had-to-go-for-sanchez-says-irwin-idUKKBN1FB0S7", "ord_in_thread": 0, "title": "Manchester United simply had to go for Sanchez, says Irwin", "locations": [], "entities": {"persons": [{"name": "sanchez", "sentiment": "negative"}, {"name": "irwin", "sentiment": "negative"}, {"name": "irwin sudipto ganguly", "sentiment": "none"}, {"name": "denis irwin", "sentiment": "none"}, {"name": "manchester uni", "sentiment": "none"}, {"name": "alexis sanchez", "sentiment": "none"}, {"name": "henrikh mkhitaryan", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "old trafford", "sentiment": "none"}], "organizations": [{"name": "manchester united", "sentiment": "negative"}, {"name": "crystal palace", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "min read  mumbai", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 8:17 AM / Updated 9 hours ago Manchester United simply had to go for Sanchez, says Irwin Sudipto Ganguly 4 Min Read \nMUMBAI (Reuters) - Players of the calibre of Alexis Sanchez do not become available very often so Manchester United had no choice but to make a move for the Arsenal forward, former Ireland defender Denis Irwin has said ahead of the Chilean’s expected move to Old Trafford. \nThe 29-year-old Sanchez, who is out of contract at the end of the season and was also a target for leaders Manchester City, missed Arsenal’s 4-1 league win over Crystal Palace on Saturday. \nBritish media reports say he will seal his move to United this week with Armenian midfielder Henrikh Mkhitaryan joining Arsenal in a swap deal. \n“When a player of that ability comes along, I think you got to be in the market for him,” Irwin, who played over 500 games for United during 12 trophy-laden seasons, told Reuters. \n”He’s a player who knows the Premier League, his goal record ... he’s an experienced international. He’s quick, he’s strong. \n“It would be great if he comes to Manchester United because he would not just add to our squad but our team. He’s a really good player and I think he will be a good addition, really good.” \nThe Chile international has scored 80 goals in 166 appearances in all competitions for Arsenal since joining from Barcelona for 35 million pounds ($48.52 million) in July 2014. \nThe 52-year-old Irwin, now working a United ambassador, was speaking in Mumbai as part of Gulf Oil’s fan-building campaign for the club’s supporters, who were invited to a live screening of the Premier League away fixture against Burnley on Saturday. CONTRACT EXTENSION \nIrwin lauded Jose Mourinho’s ability to attract top players and said the Portuguese manager had done enough to warrant an extension to the three-year contract he signed in 2016. \n“Since he’s come in 16-17 months back, he’s brought in some really good players,” said the former left-back, who was one of Alex Ferguson’s key players. \n”He attracts good players and all of them have strengthened us. He knows he’s not there yet but we are getting back to where we should be. \n“I feel we are lot more competitive that 16 months ago. For me, he’s been fantastic. Two trophies last season, progression on the field, we are getting better and stronger, I don’t see any reason why not (give him an extension)?” \nUnited struggled in the transition after Ferguson left Old Trafford following their 20th and most recent Premier League title in 2013. \nDavid Moyes replaced Ferguson but was sacked after 10 months to be replaced by Dutchman Louis van Gaal, who then made way for Mourinho after two seasons. \nThe former Chelsea, Real Madrid and Inter Milan coach has led the club to two trophies, plus the Community Shield, but United failed to challenge for the league title. \nCurrently second in the league with 53 points, they sit 12 points behind rivals City after 24 games. \n“We are in a much better position than last season. We were forever in sixth and finished sixth,” Irwin added. \n“Yes Manchester City have played very, very well this year and very much look odds-on to win the title. Can you see them lose four or five games? Probably not. You never know in football but they are in a very, very strong position.” \n($1 = 0.7213 pounds)", "external_links": [], "published": "2018-01-22T10:17:00.000+02:00", "crawled": "2018-01-22T12:51:56.015+02:00", "highlightTitle": ""}