{"organizations": [], "uuid": "9c90b0b05ebb11fe313e9faf2638269cd15bbfa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220613677&w=1200&r=LYNXMPEE081C9", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-eu-internet-meeting/internet-giants-not-doing-enough-to-take-down-illegal-content-eu-idUSKBN1EY2BL", "country": "US", "domain_rank": 408, "title": "Internet giants not doing enough to take down illegal content - EU", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:57:00.000+02:00", "replies_count": 0, "uuid": "9c90b0b05ebb11fe313e9faf2638269cd15bbfa6"}, "author": "", "url": "https://www.reuters.com/article/us-eu-internet-meeting/internet-giants-not-doing-enough-to-take-down-illegal-content-eu-idUSKBN1EY2BL", "ord_in_thread": 0, "title": "Internet giants not doing enough to take down illegal content - EU", "locations": [], "entities": {"persons": [{"name": "julia fioretti", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 7:02 PM / Updated 2 hours ago Internet giants not doing enough to take down illegal content: EU Julia Fioretti 3 Min Read \nBRUSSELS (Reuters) - Internet giants like Facebook, Google’s YouTube and Twitter are not taking down illegal content from their websites fast enough, the European Union executive said on Tuesday after meeting with the companies. \nSeveral European governments have increased pressure on social media companies to do more to remove illegal content - from incitement to hatred and racism to extremist material to counterfeit products being sold online - and the companies have gone to greater efforts to detail the changes they are making. \nFive EU Commissioners met with representatives from companies including Facebook, Google, YouTube, and Twitter in Brussels to discuss the progress they had made in removing illegal content quicker and more effectively. \n“What is illegal, also has consequences. We need to find ways to remove this content. We want voluntary measures to work, but the progress has to be faster, it’s currently not going fast enough and we need to do something about it,” Julian King, EU security commissioner, said. \nThe tech companies have stepped up their efforts to tackle illegal content online in the face of sustained political pressure, particularly as attacks in Western Europe over the past years shone a spotlight on militants’ use of social networks. \nFacebook said last year it was removing 99 percent of content from militant groups Islamic State and al Qaeda before being told of it, while Twitter said 95 percent of account suspensions were thanks to its internal efforts. \nYouTube broadened its takedown of extremist videos last year in a major policy shift. \nThe EU has been weighing up legislation both to force the companies to do more and ensure there is no fragmentation across the bloc. A German hate speech law came into effect this year while France is planning a law tackling the spread of “fake news” on social media. \n“Online platforms have been removing more legal content than ever before showing that self-regulation can work, but regulation remains an option,” Andrus Ansip, Commission Vice-President for the digital single market, said. \n“While the progress is good, this is not enough according to public opinion,” Ansip said. He said fragmentation was an issue and would increasingly be so, and he encouraged the companies to be proactive to detect, remove or disable access to illegal content on a voluntary basis. \nOne EU official described the meeting as a “last chance” for the companies to show they were doing enough to tackle the problem without the EU needing to resort to legislation. \nThe tech companies, on the other hand, feel that there is not enough clarity on what additional measures they should be taking or how any legislation would look like in practice. \nTwitter declined to comment on Tuesday. Facebook and Google were not immediately available to comment. Reporting by Julia Fioretti. Editing by Jane Merriman", "external_links": [], "published": "2018-01-09T20:57:00.000+02:00", "crawled": "2018-01-09T21:14:18.037+02:00", "highlightTitle": ""}