{"organizations": [], "uuid": "afdf63152f7284e82c00d674d92e110fe019eac1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-great-southern-bancorp-inc-reports-preliminary-fourth-quarter-and-annual-earnings-of-0-point-86-and-3-point-65-per-diluted.html", "country": "US", "domain_rank": 767, "title": "Great Southern Bancorp, Inc. Reports Preliminary Fourth Quarter and Annual Earnings of $0.86 and $3.65 Per Diluted Common Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-24T03:00:00.000+02:00", "replies_count": 0, "uuid": "afdf63152f7284e82c00d674d92e110fe019eac1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-great-southern-bancorp-inc-reports-preliminary-fourth-quarter-and-annual-earnings-of-0-point-86-and-3-point-65-per-diluted.html", "ord_in_thread": 0, "title": "Great Southern Bancorp, Inc. Reports Preliminary Fourth Quarter and Annual Earnings of $0.86 and $3.65 Per Diluted Common Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "springfield", "sentiment": "none"}, {"name": "mo.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "great southern bancorp, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SPRINGFIELD, Mo., Jan. 23, 2018 /PRNewswire/ --\nPreliminary Financial Results and Other Matters for the Quarter and Year Ended December 31, 2017:\nSignificant Unusual Income or Expense Items: During the three months ended December 31, 2017, the Company recorded the following unusual items: (1) The Company announced that following the enactment of the Tax Cuts and Jobs Act of 2017 (the \"Act\") federal tax reform legislation on December 22, 2017, it will distribute special cash bonuses to its more than 1,200 employees. The Company recorded a pre-tax expense of $1.1 million, which is included in the Consolidated Statements of Income under \"Noninterest Expense – Salaries and employee benefits.\" This decreased diluted earnings per share by $0.05 in the three months ended December 31, 2017; and (2) Among other things, the Act permanently lowers the corporate federal income tax rate to 21% from the existing maximum rate of 35% in future periods. As a result of this reduction of the corporate federal income tax rate, U.S. generally accepted accounting principles require companies to perform a revaluation of their deferred tax assets and liabilities as of the date of enactment, with the resulting tax effects accounted for in the reporting period of enactment (the three months and year ended December 31, 2017). The effect of the tax legislation resulted in a net decrease in the Company's income tax expense of $250,000, or a $0.02 increase in diluted earnings per share in the three months ended December 31, 2017. Total Loans: Total gross loans (including the undisbursed portion of loans), excluding FDIC-assisted acquired loans and mortgage loans held for sale, increased $248.9 million, or 6.1%, from December 31, 2016, to December 31, 2017. This increase was primarily in construction loans, other residential (multi-family) real estate loans and commercial real estate loans. The FDIC-acquired loan portfolios had net decreases totaling $73.5 million during the year ended December 31, 2017. Outstanding net loan receivable balances decreased $33.7 million, from $3.76 billion at December 31, 2016 to $3.73 billion at December 31, 2017, and decreased $74.7 million, from $3.80 billion at September 30, 2017. Asset Quality: Non-performing assets and potential problem loans, excluding those previously covered by FDIC loss sharing agreements and those acquired in the FDIC-assisted transaction with Valley Bank, which are accounted for and analyzed as loan pools rather than individual loans, totaled $35.8 million at December 31, 2017, a decrease of $10.5 million from $46.3 million at December 31, 2016 and a decrease of $5.1 million from $40.9 million at September 30, 2017. Non-performing assets at December 31, 2017 were $27.8 million (0.63% of total assets), down $11.5 million from $39.3 million (0.86% of total assets) at December 31, 2016 and down $5.1 million from $32.9 million (0.73% of total assets) at September 30, 2017. Capital: The capital position of the Company continues to be strong, significantly exceeding the thresholds established by regulators. On a preliminary basis, as of December 31, 2017, the Company's Tier 1 Leverage Ratio was 10.9%, Common Equity Tier 1 Capital Ratio was 10.9%, Tier 1 Capital Ratio was 11.4%, and Total Capital Ratio was 14.1%. Net Interest Income: Net interest income for the fourth quarter of 2017 decreased $975,000 to $39.3 million compared to $40.2 million for the fourth quarter of 2016. Net interest income was also $39.3 million for the third quarter of 2017. Net interest margin was 3.75% for the quarter ended December 31, 2017, compared to 3.87% for the fourth quarter of 2016 and 3.77% for the quarter ended September 30, 2017. The decrease in the margin from the prior year fourth quarter was primarily the result of a reduction in the additional yield accretion recognized in conjunction with updated estimates of the fair value of the acquired loan pools compared to the prior periods, partially offset by increased total average loans. Increased average interest rates on deposits and other borrowings also contributed to lower net interest margin compared to the year ago quarter. The decrease in the margin from the quarter ended September 30, 2017 to the quarter ended December 31, 2017 was primarily due to a reduction in the additional yield accretion recognized. The positive impact on net interest margin from the additional yield accretion on acquired loan pools that was recorded during the period was 7, 30 and 9 basis points for the quarters ended December 31, 2017, December 31, 2016, and September 30, 2017, respectively. For further discussion of the additional yield accretion of the discount on acquired loan pools, see \"Net Interest Income.\"\nGreat Southern Bancorp, Inc. (NASDAQ:GSBC), the holding company for Great Southern Bank, today reported that preliminary earnings for the three months ended December 31, 2017, were $0.86 per diluted common share ($12.2 million available to common shareholders) compared to $0.83 per diluted common share ($11.8 million available to common shareholders) for the three months ended December 31, 2016.\nPreliminary earnings for the year ended December 31, 2017, were $3.65 per diluted common share ($51.6 million available to common shareholders) compared to $3.21 per diluted common share ($45.3 million available to common shareholders) for the year ended December 31, 2016.\nFor the quarter ended December 31, 2017, annualized return on average common equity was 10.37%, return on average assets was 1.10%, and net interest margin was 3.75%, compared to 10.98%, 1.05% and 3.87%, respectively, for the quarter ended December 31, 2016. For the year ended December 31, 2017, annualized return on average common equity was 11.32%, annualized return on average assets was 1.16%, and net interest margin was 3.74% compared to 10.93%, 1.04% and 4.05%, respectively, for the year ended December 31, 2016.\nPresident and CEO Joseph W. Turner commented, \"We are pleased with our results in the fourth quarter, especially as the competition for loans and deposits continues to increase in our markets. Strong commercial and construction loan production, solid credit quality, a stable core net interest margin, and expense containment were highlights from the 2017 fourth quarter. In addition, in the fourth quarter and into future periods, the Company was and will be impacted by the recent federal tax reform legislation. We anticipate that the tax changes will lower our effective tax rate in 2018 and future periods, benefitting our net income. Discussion of the tax reform impact can be found later in this earnings release.\n\"We continued to see good commercial and construction loan production during the fourth quarter as we've seen all year. For the second year in a row, our lenders have originated more than $1 billion in loans with commercial clients throughout our franchise footprint. Total gross loans, including the undisbursed portion of loans and excluding FDIC-assisted acquired loans and mortgages held for sale, increased $248.9 million, or 6.1%, from the end of 2016. This increase was partially offset by expected decreases in the consumer loan portfolio (down about $144 million) and one- to four-family residential loans. Outstanding loan balances were also negatively impacted by significant loan payoffs during 2017, resulting in our outstanding loan balance at the end of 2017 being down slightly from the end of 2016.\"\nTurner said, \"Our level of non-performing assets decreased $5.1 million and $11.5 million, from the end of the third quarter of 2017 and the end of 2016, respectively. The level of potential problem loans remained fairly consistent with balances at September 30, 2017 and December 31, 2016 of $8.0 million and $7.0 million, respectively. Foreclosed assets, excluding those acquired in FDIC-assisted transactions, were reduced by $6.8 million during the fourth quarter as we continue to resolve these credits, primarily through property sales.\n\"Core net interest margin improved by 11 basis points compared to the year ago quarter and was stable from the previous linked quarter. Expense containment remains a major focus for the Company. Total non-interest expenses were $29.3 million in the 2017 fourth quarter as compared to $28.0 million in the 2017 third quarter. Fourth quarter expenses include $1.1 million in special cash bonuses to be paid to Great Southern employees at the end of January 2018.\"\nSelected Financial Data:\n(In thousands, except per share data)\nThree Months Ended\nDecember 31,\nYear Ended\nDecember 31,\n2017\n2016\n2017\n2016\nNet interest income\n$ 39,273\n$ 40,248\n$ 155,156\n$ 163,056\nProvision for loan losses\n1,950\n2,380\n9,100\n9,281\nNon-interest income\n7,374\n7,528\n38,527\n28,510\nNon-interest expense\n29,284\n29,041\n114,261\n120,427\nProvision for income taxes\n3,207\n4,561\n18,758\n16,516\nNet income and net income available to common shareholders\n$ 12,206\n$ 11,794\n$ 51,564\n$ 45,342\nEarnings per diluted common share\n$ 0.86\n$ 0.83\n$ 3.65\n$ 3.21\nNET INTEREST INCOME\nNet interest income for the fourth quarter of 2017 decreased $975,000 to $39.3 million compared to $40.2 million for the fourth quarter of 2016. Net interest margin was 3.75% in the fourth quarter of 2017, compared to 3.87% in the same period of 2016, a decrease of 12 basis points. For the three months ended December 31, 2017, the net interest margin decreased two basis points compared to the net interest margin of 3.77% in the three months ended September 30, 2017. The decrease in the margin from the prior year fourth quarter was primarily the result of a reduction in the additional yield accretion recognized in conjunction with updated estimates of the fair value of the acquired loan pools compared to the prior periods, partially offset by increased total average loans. Increased average interest rates on deposits and other borrowings also contributed to lower net interest margin compared to the year ago quarter. The small decrease in the margin from the quarter ended September 30, 2017 to the quarter ended December 31, 2017 was primarily due to a reduction in the additional yield accretion recognized. The average interest rate spread was 3.58% for the three months ended December 31, 2017, compared to 3.74% for the three months ended December 31, 2016 and 3.60% for the three months ended September 30, 2017.\nNet interest income for the year ended December 31, 2017 decreased $7.9 million to $155.2 million compared to $163.1 million for the year ended December 31, 2016. Net interest margin was 3.74% in the year ended December 31, 2017, compared to 4.05% for the year ended December 31, 2016, a decrease of 31 basis points. The average interest rate spread was 3.59% for the year ended December 31, 2017, compared to 3.93% for the year ended December 31, 2016. The decrease in the margin from the prior year was primarily the result of a reduction in the additional yield accretion recognized in conjunction with updated estimates of the fair value of the acquired loan pools compared to the prior periods, partially offset by increased total average loans. Increased average interest rates on deposits and other borrowings also contributed to lower net interest margin compared to the prior year.\nThe Company's net interest margin has been positively impacted by significant additional yield accretion recognized in conjunction with updated estimates of the fair value of the loan pools acquired in the 2009, 2011, 2012 and 2014 FDIC-assisted transactions. On an on-going basis, the Company estimates the cash flows expected to be collected from the acquired loan pools. For each of the loan portfolios acquired, the cash flow estimates increased during the current and prior periods presented below, based on payment histories and reduced credit loss expectations. This resulted in increased income that has been spread, on a level-yield basis, over the remaining expected lives of the loan pools (and, therefore, has decreased over time). In the prior period, the increases in expected cash flows also reduced the amount of expected reimbursements under the loss sharing agreements with the FDIC (when such agreements were in place), which were recorded as indemnification assets, with such reductions amortized on a comparable basis over the remainder of the loss sharing agreements or the remaining expected lives of the loan pools, whichever was shorter. Additional estimated cash flows totaling approximately $706,000 and $1.3 million were recorded in the three months and year ended December 31, 2017, respectively, related to all of these loan pools.\nThe impact of adjustments on all portfolios acquired in FDIC-assisted transactions for the reporting periods presented is shown below:\nThree Months Ended\nDecember 31, 2017\nDecember 31, 2016\n(In thousands, except basis points data)\nImpact on net interest income/\nnet interest margin (in basis points)\n$ 776\n7 bps\n$ 3,142\n30 bps\nNon-interest income\n—\n(1,014)\nNet impact to pre-tax income\n$ 776\n$ 2,128\nYear Ended\nDecember 31, 2017\nDecember 31, 2016\n(In thousands, except basis points data)\nImpact on net interest income/\nnet interest margin (in basis points)\n$ 5,014\n12 bps\n$ 16,393\n41 bps\nNon-interest income\n(634)\n(7,033)\nNet impact to pre-tax income\n$ 4,380\n$ 9,360\nBecause these adjustments will be recognized generally over the remaining lives of the loan pools, they will impact future periods as well. The remaining accretable yield adjustment that will affect interest income is $2.6 million. As there is no longer, nor will there be in the future, indemnification asset amortization related to Team Bank, Vantus Bank, Sun Security Bank or InterBank due to the termination or expiration of the related loss sharing agreements for those transactions, there is no remaining indemnification asset or related adjustments that will affect non-interest income (expense). Of the remaining adjustments affecting interest income, we expect to recognize $1.7 million of interest income during 2018. Additional adjustments may be recorded in future periods from the FDIC-assisted transactions, as the Company continues to estimate expected cash flows from the acquired loan pools.\nExcluding the impact of the additional yield accretion, net interest margin for the three months and year ended December 31, 2017, increased 11 and decreased two basis points, respectively, when compared to the year-ago periods. The decrease in net interest margin in the twelve month period is primarily due to the interest expense associated with the issuance of $75.0 million of subordinated notes in the third quarter of 2016 and an increase in the average interest rate on deposits and other borrowings.\nFor additional information on net interest income components, see the \"Average Balances, Interest Rates and Yields\" tables in this release.\nNON-INTEREST INCOME\nFor the quarter ended December 31, 2017, non-interest income decreased $154,000 to $7.4 million when compared to the quarter ended December 31, 2016, primarily as a result of the following items:\nAmortization of income related to business acquisitions: Because of the termination of the loss sharing agreements in previous periods, the net amortization expense related to business acquisitions was $-0- for the quarter ended December 31, 2017, compared to $848,000 for the quarter ended December 31, 2016, which reduced non-interest income by that amount in the previous year. Other income: Other income decreased $426,000 compared to the prior year quarter. This decrease was primarily due to the loss on disposal of certain fixed assets, including ATMs, during the quarter.\nFor the year ended December 31, 2017, non-interest income increased $10.0 million to $38.5 million when compared to the year ended December 31, 2016, primarily as a result of the following items:\nGain on early termination of FDIC loss sharing agreement for Inter Savings Bank: As previously disclosed in the Company's Current Report on Form 8-K filed on June 9, 2017, the Company's loss sharing agreement with the FDIC related to Inter Savings Bank was terminated early and the Company received a payment of $15.0 million to settle all outstanding items related to the terminated agreement. The Company recognized a one-time gross gain of $7.7 million related to the termination, which was recorded in the accretion of income related to business acquisitions line item of the consolidated statements of income during the year ended December 31, 2017. Amortization of income related to business acquisitions: Because of the termination of FDIC loss sharing agreements in previous periods, the net amortization expense related to business acquisitions was $486,000 for the year ended December 31, 2017, compared to $6.4 million for the year ended December 31, 2016. The amortization expense for the year ended December 31, 2017, consisted of the following items: $504,000 of amortization expense related to the changes in cash flows expected to be collected from the FDIC-covered loan portfolios acquired from InterBank and $140,000 of amortization of the clawback liability. Partially offsetting the expense was income from the accretion of the discount related to the indemnification asset for the InterBank acquisition of $158,000. Late charges and fees on loans: Late charges and fees on loans increased $484,000 compared to the prior year. The increase was primarily due to fees totaling $632,000 on loan payoffs received on four loan relationships, partially offset by a decrease in late charges and fees during the fourth quarter of 2017. Net gains on loan sales: Net gains on loan sales decreased $791,000 compared to the prior year. The decrease was due to a decrease in originations of fixed-rate loans in 2017 compared to 2016. Fixed rate single-family loans originated are generally subsequently sold in the secondary market. Other income: Other income decreased $825,000 compared to the prior year. During 2016, the Company recognized gains of $367,000 on the sale of the two branches in Southwest Missouri. In addition, a gain of $238,000 was recognized on sales of fixed assets unrelated to the branch sales during 2016. There were no similar transactions during 2017. There were net losses on the disposal of certain fixed assets, including ATMs, during the fourth quarter of 2017 of approximately $114,000, with no significant losses on the disposal of fixed assets in the comparable prior year period. Net realized gains on sales of available-for-sale securities: During 2016, the Company sold an investment held by Bancorp for a gain of $2.7 million and sold other investment securities for a net gain of $144,000. There were no gains on sales of investments in the current year.\nNON-INTEREST EXPENSE\nFor the quarter ended December 31, 2017, non-interest expense increased $243,000 to $29.3 million when compared to the quarter ended December 31, 2016, primarily as a result of the following items:\nSalaries and employee benefits: Salaries and employee benefits increased $833,000 from the prior year quarter. This increase is due to $1.1 million of expense for the special cash bonuses to be paid to all employees who were employed by the Company on December 31, 2017. These bonuses were in response to the new federal tax reform legislation. Partially offsetting that increase was a decrease in incentive compensation for loan originators and staff due to fewer residential loan originations in the 2017 period than in the prior year period. The Company also recently reorganized some staff functions in certain areas to operate more efficiently. In addition, there are budgeted but unfilled positions in various areas of the Company that have resulted in lower compensation costs in these areas. Net occupancy and equipment expense: Net occupancy expense decreased $327,000 in the quarter ended December 31, 2017 compared to the same quarter in 2016. The decrease was primarily due to furniture, fixtures and equipment, and computer equipment which became fully depreciated during the past year resulting in less depreciation expense during the quarter ended December 31, 2017. Expense on foreclosed assets: Expense on foreclosed assets increased $307,000 compared to the prior year period primarily due to valuation write-downs of certain foreclosed assets during the current period, totaling approximately $680,000, and higher levels of expense related to consumer repossessions than in the year ago quarter. Other operating expenses: Other operating expenses decreased $590,000 in the quarter ended December 31, 2017 compared to the same period in 2016. The decrease in other operating expenses was primarily due to higher levels of debit card and check fraud losses in the prior year period. In the 2016 period, the Company experienced debit card and check fraud losses totaling $566,000. These losses totaled $151,000 in the current year quarter.\nFor the year ended December 31, 2017, non-interest expense decreased $6.2 million to $114.3 million when compared to the year ended December 31, 2016, primarily as a result of the following items:\nFifth Third Bank branch acquisition expenses: During 2016, the Company incurred approximately $1.4 million of one-time expenses related to the acquisition of certain branches from Fifth Third Bank. Those expenses included approximately $124,000 of compensation expense, approximately $385,000 of legal, audit and other professional fees expense, approximately $294,000 of computer license and support expense, approximately $436,000 in charges to replace former Fifth Third Bank customer checks with Great Southern Bank checks, and approximately $79,000 of travel, meals and other expenses related to the transaction. Salaries and employee benefits: Salaries and employee benefits decreased $343,000 from the prior year. In 2016, the Company incurred one-time acquisition related net salary and retention bonus and other compensation expenses paid as part of the Fifth Third branch transaction totaling $124,000. Subsequent to the transaction, some employees related to those operations left the Company and many were not replaced. Compensation expense also decreased for the reasons outlined in the quarter discussion above. These decreases were partially offset by the increase of $1.1 million related to the special employee bonuses as noted in the fourth quarter discussion above. Net occupancy expense: Net occupancy expense decreased $1.5 million in the year ended December 31, 2017 compared to 2016. As noted above, there were furniture, fixtures and equipment, and computer equipment which became fully depreciated during the past year resulting in less depreciation expense during the current year. During 2016, the Company had one-time expenses as part of the acquisition of the Fifth Third banking centers of $279,000 and increased computer license and support costs of $247,000 with no similar expenses in the current year. Partnership tax credit: Partnership tax credit expense decreased $751,000 in the year ended December 31, 2017 compared to 2016. The decrease was primarily due to the end of the amortization period for some of the Company's new market tax credits and the investment in those tax credits has been written off. Insurance expense: Insurance expense decreased $523,000 in the year ended December 31, 2017 compared to the prior year primarily due to a reduction in FDIC insurance premiums resulting from a change in the FDIC insurance assessment rates, which went into effect during the fourth quarter of 2016. Postage: Postage decreased $330,000 from the prior year. During 2016, the Company incurred significant postage costs due to branch acquisitions and sales and the mailing of chip enabled debit cards. Legal, audit and other professional fees: Legal, audit and other professional fees decreased $329,000 from the prior year period due to additional expenses in 2016 related to the Fifth Third transaction, as noted in the Fifth Third Bank branch acquisition expenses above. Other operating expenses: Other operating expenses decreased $1.5 million in the year ended December 31, 2017 compared to the prior year. The decrease in other operating expenses was primarily due to higher levels of debit card and check fraud losses in the prior year. In 2016, the Company experienced debit card and check fraud losses totaling $1.9 million, a significant portion of which resulted from a data security breach at a national retail merchant which operates stores in many of our markets, affecting some of our debit card customers who transacted business with the merchant. In the 2017 period, the Company experienced debit card and check fraud losses totaling $1.0 million. Additionally, $436,000 of the decrease in operating expenses is the charge in 2016 to replace Fifth Third customer checks as discussed above.\nThe Company's efficiency ratio for the quarter ended December 31, 2017, was 62.78% compared to 60.78% for the same quarter in 2016. The increase in the ratio in the 2017 three month period was primarily due to a small increase in non-interest expense, along with a decrease in net interest income. The Company's ratio of non-interest expense to average assets increased from 2.59% for the three months ended December 31, 2016, to 2.63% for the three months ended December 31, 2017. The increase in the current three month period ratio was due to the increase in non-interest expense and a decrease in average assets in the 2017 period compared to the 2016 period. Average assets for the quarter ended December 31, 2017, decreased $20.2 million, or 0.5%, from the quarter ended December 31, 2016, primarily due to decreases in investment securities and other interest-earning assets, partially offset by organic loan growth. The Company's efficiency ratio for the year ended December 31, 2017, was 58.99% compared to 62.86% for 2016. The improvement in the ratio in the 2017 twelve month period was primarily due to the decrease in non-interest expense and the increase in non-interest income (significantly impacted by the gain on the termination of the loss sharing agreements for the Inter Savings Bank FDIC-assisted transaction), partially offset by the decrease in net interest income. The Company's ratio of non-interest expense to average assets decreased from 2.76% for the year ended December 31, 2016, to 2.56% for the year ended December 31, 2017. The decrease in the current twelve month period ratio was due to the decrease in non-interest expense and the increase in average assets in 2017 compared to 2016. Average assets for the year ended December 31, 2017, increased $89.4 million, or 2.0%, from the year ended December 31, 2016, primarily due to organic loan growth, partially offset by decreases in investment securities.\nINCOME TAXES\nFor the three months ended December 31, 2017 and 2016, the Company's effective tax rate was 20.8% and 27.9%, respectively. For the years ended December 31, 2017 and 2016, the Company's effective tax rate was 26.7% and 26.7%, respectively. These effective rates were lower than the statutory federal tax rate of 35%, due primarily to the utilization of certain investment tax credits and to tax-exempt investments and tax-exempt loans which reduced the Company's effective tax rate. The Company's effective tax rate may fluctuate as it is impacted by the level and timing of the Company's utilization of tax credits and the level of tax-exempt investments and loans and the overall level of pre-tax income. The Company's effective tax rate was higher than its typical effective tax rate in the 2016 and 2017 years due to increased net income due to the gain on termination of the loss sharing agreements for the Inter Savings Bank FDIC-assisted transaction (2017) and gains on the sales of investments (2016).\nOn December 22, 2017, the Tax Cuts and Jobs Act (the \"Act\") was signed into law. Among other things, the Act permanently lowers the corporate federal income tax rate to 21% from the prior maximum rate of 35%, effective for tax years including or commencing January 1, 2018. As a result of the reduction of the corporate federal income tax rate to 21%, U.S. generally accepted accounting principles require companies to perform a revaluation of their deferred tax assets and liabilities as of the date of enactment, with the resulting tax effects accounted for in the reporting period of enactment (the three months and year ended December 31, 2017). Deferred income taxes result from temporary differences between the tax basis of assets and liabilities and their reported amounts in the financial statements, which will result in taxable or deductible amounts in future years. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in years in which those temporary differences are expected to be recovered or settled. As changes in tax laws or rates are enacted, deferred tax assets and liabilities are adjusted through income tax expense.\nBased upon preliminary estimates and current accounting guidance, and the utilization and recognition of the timing differences referred to above, the Company currently expects to have a net deferred tax liability as of December 31, 2017, which will result in an increase in net income of approximately $250,000, equal to approximately $0.02 per diluted share (through a net decrease in income tax expense). This estimate of the impact on the Company's net deferred tax liabilities, which includes, among other things, the timing of recognition of various revenues and expenses, is based upon a preliminary review and analysis of the Company's net deferred tax liabilities at December 31, 2017, as well as expected adjustments to various deferred tax assets and deferred tax liabilities in the fourth quarter, including those accounted for in accumulated other comprehensive income.\nIn addition, the Company currently expects its effective tax rate (combined federal and state) to decrease from approximately 26.7% in 2017 to approximately 15.5% to 17.5% in 2018, mainly as a result of the Act. The Company's effective income tax rate is expected to continue to be less than the statutory rate due primarily to investments in low-income housing tax credit projects and tax-exempt obligations. The Company's effective tax rate could change in future periods based on changes in the level of investments in tax credit projects and tax-exempt obligations, as well as changes in the level of overall pre-tax earnings.\nThe above information represents the Company's current estimate of the impact of the Act on its financial results. The Company will continue to evaluate the effect of the Act on its financial results. Therefore, the Company's revaluation of its net deferred tax liability and other relevant information remain subject to possible modifications. Additional details will be included in the Company's Annual Report on Form 10-K for the year ended December 31, 2017.\nCAPITAL\nAs of December 31, 2017, total stockholders' equity and common stockholders' equity were $471.7 million (10.7% of total assets), equivalent to a book value of $33.48 per common share. Total stockholders' equity and common stockholders' equity at December 31, 2016, were $429.8 million (9.4% of total assets), equivalent to a book value of $30.77 per common share. At December 31, 2017, the Company's tangible common equity to tangible assets ratio was 10.5%, compared to 9.2% at December 31, 2016.\nOn a preliminary basis, as of December 31, 2017, the Company's Tier 1 Leverage Ratio was 10.9%, Common Equity Tier 1 Capital Ratio was 10.9%, Tier 1 Capital Ratio was 11.4%, and Total Capital Ratio was 14.1%. On December 31, 2017, and on a preliminary basis, the Bank's Tier 1 Leverage Ratio was 11.7%, Common Equity Tier 1 Capital Ratio was 12.3%, Tier 1 Capital Ratio was 12.3%, and Total Capital Ratio was 13.2%.\nLOANS\nTotal gross loans (including the undisbursed portion of loans), excluding FDIC-assisted acquired loans and mortgage loans held for sale, increased $248.9 million, or 6.1%, from December 31, 2016, to December 31, 2017. This increase was primarily in construction loans ($281 million), other residential (multi-family) real estate loans ($82 million) and commercial real estate loans ($48 million). These increases were partially offset by decreases in consumer loans ($144 million) and one- to four-family residential loans ($27 million). The FDIC-acquired loan portfolios had net decreases totaling $73.5 million during the year ended December 31, 2017.\nLoan commitments and the unfunded portion of loans at the dates indicated were as follows (in thousands):\nDecember 31,\n2017\nSeptember 30,\n2017\nJune 30,\n2017\nMarch 31,\n2017\nDecember 31,\n2016\nDecember 31,\n2015\nClosed loans with unused available lines\nSecured by real estate (one- to four-family)\n$ 133,587\n$ 128,184\n$ 129,894\n$ 127,527\n$ 123,433\n$ 105,390\nSecured by real estate (not one- to four-family)\n10,836\n20,425\n17,486\n22,234\n26,062\n21,857\nNot secured by real estate - commercial business\n113,317\n105,941\n99,680\n93,541\n79,937\n63,865\nClosed construction loans with unused available lines\nSecured by real estate (one-to four-family)\n20,919\n7,044\n8,767\n8,419\n10,047\n14,242\nSecured by real estate (not one-to four-family)\n718,277\n652,195\n604,999\n583,396\n542,326\n385,969\nLoan Commitments not closed\nSecured by real estate (one-to four-family)\n23,340\n25,591\n18,769\n20,252\n15,884\n13,411\nSecured by real estate (not one-to four-family)\n156,658\n182,910\n149,317\n61,543\n119,126\n120,817\nNot secured by real estate - commercial business\n4,870\n10,297\n10,244\n4,558\n7,022\n—\n$ 1,181,804\n$ 1,132,587\n$ 1,039,156\n$ 921,470\n$ 923,837\n$ 725,551\nFor further information about the Company's loan portfolio, please see the quarterly loan portfolio presentation available on the Company's Investor Relations website under \"Presentations.\"\nPROVISION FOR LOAN LOSSES AND ALLOWANCE FOR LOAN LOSSES\nManagement records a provision for loan losses in an amount it believes sufficient to result in an allowance for loan losses that will cover current net charge-offs as well as risks believed to be inherent in the loan portfolio of the Bank. The amount of provision charged against current income is based on several factors, including, but not limited to, past loss experience, current portfolio mix, actual and potential losses identified in the loan portfolio, economic conditions, and internal as well as external reviews. The levels of non-performing assets, potential problem loans, loan loss provisions and net charge-offs fluctuate from period to period and are difficult to predict.\nWeak economic conditions, higher inflation or interest rates, or other factors may lead to increased losses in the portfolio and/or requirements for an increase in loan loss provision expense. Management maintains various controls in an attempt to limit future losses, such as a watch list of possible problem loans, documented loan administration policies and a loan review staff to review the quality and anticipated collectability of the portfolio. Additional procedures provide for frequent management review of the loan portfolio based on loan size, loan type, delinquencies, financial analysis, on-going correspondence with borrowers and problem loan work-outs. Management determines which loans are potentially uncollectible, or represent a greater risk of loss, and makes additional provisions to expense, if necessary, to maintain the allowance at a satisfactory level.\nThe provision for loan losses for the quarter ended December 31, 2017, decreased $430,000 to $2.0 million compared with $2.4 million for the quarter ended December 31, 2016. At December 31, 2017 and December 31, 2016, the allowance for loan losses was $36.5 million and $37.4 million, respectively. Total net charge-offs were $1.7 million and $2.0 million for the quarters ended December 31, 2017 and 2016, respectively. During the quarter ended December 31, 2017, $1.4 million of the $1.7 million of net charge-offs were in the consumer auto category. One commercial loan relationship amounted to $476,000 of the total charge-offs during the current quarter. This was partially offset by a recovery of $371,000 on a different unrelated commercial relationship during the quarter. Total net charge-offs were $10.0 million and $10.0 million for the years ended December 31, 2017 and 2016, respectively. During the year ended December 31, 2017, $6.1 million of the $10.0 million of net charge-offs were in the consumer auto category. Five commercial loan relationships amounted to $2.9 million of the net charge-off total for the year ended December 31, 2017. In response to a more challenging consumer credit environment, the Company tightened its underwriting guidelines on automobile lending in the latter part of 2016. Management took this step in an effort to improve credit quality in the portfolio and lower delinquencies and charge-offs. This action also resulted in a lower level of origination volume and, as such, the outstanding balance of the Company's automobile loans declined approximately $137 million in the year ended December 31, 2017. We expect to see further declines in the automobile loan totals through the majority of 2018 as well. General market conditions and unique circumstances related to individual borrowers and projects contributed to the level of provisions and charge-offs. As assets were categorized as potential problem loans, non-performing loans or foreclosed assets, evaluations were made of the values of these assets with corresponding charge-offs as appropriate.\nIn June 2017, the loss sharing agreements for Inter Savings Bank were terminated. In April 2016, the loss sharing agreements for Team Bank, Vantus Bank and Sun Security Bank were terminated. Loans acquired from the FDIC related to Valley Bank did not have a loss sharing agreement. All acquired loans were grouped into pools based on common characteristics and were recorded at their estimated fair values, which incorporated estimated credit losses at the acquisition date. These loan pools are systematically reviewed by the Company to determine the risk of losses that may exceed those identified at the time of the acquisition. Techniques used in determining risk of loss are similar to those used to determine the risk of loss for the legacy Great Southern Bank portfolio, with most focus being placed on those loan pools which include the larger loan relationships and those loan pools which exhibit higher risk characteristics. Review of the acquired loan portfolio also includes review of financial information, collateral valuations and customer interaction to determine if additional reserves are warranted.\nThe Bank's allowance for loan losses as a percentage of total loans, excluding acquired loans that were previously covered by the FDIC loss sharing agreements, was 1.01%, 1.04% and 0.99% at December 31, 2017, December 31, 2016 and September 30, 2017, respectively. Management considers the allowance for loan losses adequate to cover losses inherent in the Bank's loan portfolio at December 31, 2017, based on recent reviews of the Bank's loan portfolio and current economic conditions. If economic conditions were to deteriorate or management's assessment of the loan portfolio were to change, it is possible that additional loan loss provisions would be required, thereby adversely affecting future results of operations and financial condition.\nASSET QUALITY\nFormer TeamBank, Vantus Bank, Sun Security Bank, InterBank and Valley Bank non-performing assets, including foreclosed assets and potential problem loans, are not included in the totals or in the discussion of non-performing loans, potential problem loans and foreclosed assets below. These assets were initially recorded at their estimated fair values as of their acquisition dates and are accounted for in pools; therefore, these loan pools are analyzed rather than the individual loans. The performance of the loan pools acquired in each of the five transactions has been better than expectations at the acquisition date.\nAs a result of changes in balances and composition of the loan portfolio, changes in economic and market conditions that occur from time to time and other factors specific to a borrower's circumstances, the level of non-performing assets will fluctuate.\nNon-performing assets, excluding all FDIC-assisted acquired assets, at December 31, 2017 were $27.8 million, a decrease of $11.5 million from $39.3 million at December 31, 2016 and a decrease of $5.1 million from $32.9 million at September 30, 2017. Non-performing assets, excluding all FDIC-assisted acquired assets, as a percentage of total assets were 0.63% at December 31, 2017, compared to 0.86% at December 31, 2016 and 0.73% at September 30, 2017.\nCompared to December 31, 2016, non-performing loans decreased $2.8 million to $11.3 million at December 31, 2017, and foreclosed assets decreased $8.7 million to $16.6 million at December 31, 2017. Compared to September 30, 2017, non-performing loans increased $1.8 million and foreclosed assets decreased $6.8 million at December 31, 2017. Non-performing consumer loans comprised $3.3 million, or 29.0%, of the total $11.3 million of non-performing loans at December 31, 2017, a decrease of $471,000 from September 30, 2017. Non-performing one- to four-family residential loans comprised $2.7 million, or 24.2%, of the total non-performing loans at December 31, 2017, a decrease of $36,000 from September 30, 2017. Non-performing commercial business loans comprised $2.1 million, or 18.3%, of the total non-performing loans at December 31, 2017, a decrease of $117,000 from September 30, 2017. Non-performing other residential loans comprised $1.9 million, or 16.7%, of the total non-performing loans at December 31, 2017, an increase of $1.8 million from September 30, 2017. Non-performing commercial real estate loans comprised $1.2 million, or 10.9%, of the total non-performing loans at December 31, 2017, an increase of $658,000 from September 30, 2017. Non-performing construction and land development loans comprised $98,000, or 0.9%, of the total non-performing loans at December 31, 2017, a decrease of $38,000 from September 30, 2017.\nCompared to September 30, 2017 and December 31, 2016, potential problem loans decreased $94,000 and increased $975,000, respectively, to $7.9 million at December 31, 2017. The decrease during the quarter was due to $295,000 in loans removed from potential problem loans, $99,000 in payments, and $13,000 in loans transferred to non-performing loans, partially offset by the addition of $313,000 of loans to potential problem loans.\nActivity in the non-performing loans category during the quarter ended December 31, 2017, was as follows:\nBeginning Balance,\nOctober 1\nAdditions to\nNon-\nPerforming\nRemoved\nfrom Non-\nPerforming\nTransfers\nto Potential\nProblem\nLoans\nTransfers to\nForeclosed\nAssets\nCharge-Offs\nPayments\nEnding\nBalance,\nDecember 31\n(In thousands)\nOne- to four-family construction\n$ —\n$ —\n$ —\n$ —\n$ —\n$ —\n$ —\n$ —\nSubdivision construction\n102\n—\n—\n—\n—\n—\n(4)\n98\nLand development\n34\n—\n—\n—\n—\n(34)\n—\n—\nCommercial construction\n—\n—\n—\n—\n—\n—\n—\n—\nOne- to four-family residential\n2,756\n294\n—\n(148)\n(4)\n—\n(178)\n2,720\nOther residential\n77\n2,353\n(77)\n—\n—\n(476)\n—\n1,877\nCommercial real estate\n568\n667\n—\n—\n—\n—\n(9)\n1,226\nCommercial business\n2,180\n—\n—\n—\n—\n(116)\n(1)\n2,063\nConsumer\n3,742\n1,223\n—\n(128)\n(309)\n(782)\n(475)\n3,271\nTotal\n$ 9,459\n$ 4,537\n$ (77)\n$ (276)\n$ (313)\n$ (1,408)\n$ (667)\n$ 11,255\nAt December 31, 2017, the non-performing one- to four-family residential category included 28 loans, three of which were added during the current quarter. The largest relationship in this category, which was added during the quarter ending September 30, 2017, included nine loans totaling $1.4 million, which are collateralized by residential rental homes in the Springfield, Mo. area. The non-performing commercial business category included five loans. The largest relationship in this category totaled $1.5 million, or 73.2% of the total category. This relationship was previously collateralized by commercial real estate which has been foreclosed and subsequently sold. Collection efforts are currently being pursued against the guarantors of the credit relationship. The non-performing other residential category included one loan, which was added during the current quarter. This loan is collateralized by an apartment project in the central Missouri area and was originated in 2004. The non-performing commercial real estate category included six loans, one of which was added during the current quarter, and was the largest relationship in the category totaling $667,000, or 54.4% of the total category. This loan is collateralized by commercial property in the St. Louis, Mo., area. The non-performing consumer category included 255 loans, 116 of which were added during the current quarter, and the majority of which are indirect used automobile loans.\nActivity in the potential problem loans category during the quarter ended December 31, 2017, was as follows:\nBeginning\nBalance,\nOctober 1\nAdditions to\nPotential\nProblem\nRemoved\nfrom\nPotential\nProblem\nTransfers to\nNon-\nPerforming\nTransfers to\nForeclosed\nAssets\nCharge-Offs\nPayments\nEnding\nBalance,\nDecember 31\n(In thousands)\nOne- to four-family construction\n$ —\n$ —\n$ —\n$ —\n$ —\n$ —\n$ —\n$ —\nSubdivision construction\n—\n—\n—\n—\n—\n—\n—\n—\nLand development\n5\n—\n—\n—\n—\n—\n(1)\n4\nCommercial construction\n—\n—\n—\n—\n—\n—\n—\n—\nOne- to four-family residential\n991\n148\n—\n—\n—\n—\n(17)\n1,122\nOther residential\n—\n—\n—\n—\n—\n—\n—\n—\nCommercial real estate\n6,105\n—\n(285)\n—\n—\n—\n(61)\n5,759\nCommercial business\n515\n—\n—\n—\n—\n—\n(12)\n503\nConsumer\n415\n165\n(10)\n(13)\n—\n—\n(8)\n549\nTotal\n$ 8,031\n$ 313\n$ (295)\n$ (13)\n$ —\n$ —\n$ (99)\n$ 7,937\nAt December 31, 2017, the commercial real estate category of potential problem loans included three loans, all part of the same customer relationship. This relationship, totaling $5.8 million, or 100.0% of the total category, is collateralized by theatre and retail property in Branson, Mo. This is a long-term customer of the Bank and these loans were all originated prior to 2008. The borrower is experiencing cash flow issues due to vacancies in some of the properties and the loans were added to potential problem loans during the third quarter of 2017. The one- to four-family residential category of potential problem loans included 16 loans, two of which were added during the current quarter. The commercial business category of potential problem loans included five loans. The consumer category of potential problem loans included 43 loans, 17 of which were added during the current quarter.\nActivity in foreclosed assets during the quarter ended December 31, 2017, excluding $2.1 million in foreclosed assets previously covered by FDIC loss sharing agreements, $1.7 million in foreclosed assets related to Valley Bank and not covered by loss sharing agreements, and $1.6 million in properties which were not acquired through foreclosure, was as follows:\nBeginning\nBalance,\nOctober 1\nAdditions\nORE Sales\nCapitalized\nCosts\nORE Write-\nDowns\nEnding\nBalance,\nDecember 31\n(In thousands)\nOne-to four-family construction\n$ —\n$ —\n$ —\n$ —\n$ —\n$ —\nSubdivision construction\n5,468\n—\n(55)\n—\n—\n5,413\nLand development\n10,052\n—\n(2,250)\n—\n(573)\n7,229\nCommercial construction\n—\n—\n—\n—\n—\n—\nOne- to four-family residential\n203\n47\n(138)\n—\n—\n112\nOther residential\n161\n—\n—\n—\n(21)\n140\nCommercial real estate\n2,864\n—\n(1,080)\n—\n(90)\n1,694\nCommercial business\n2,876\n—\n(2,876)\n—\n—\n—\nConsumer\n1,793\n2,597\n(2,403)\n—\n—\n1,987\nTotal\n$ 23,417\n$ 2,644\n$ (8,802)\n$ —\n$ (684)\n$ 16,575\nAt December 31, 2017, the land development category of foreclosed assets included 17 properties, the largest of which was located in the Branson, Mo., area and had a balance of $1.2 million, or 17.2% of the total category. One property located in the northwest Arkansas area and totaling $1.4 million was sold during the quarter ended December 31, 2017. Of the total dollar amount in the land development category of foreclosed assets, 38.6% and 23.0% was located in the Branson, Mo. and the northwest Arkansas areas, respectively, including the largest property previously mentioned. The subdivision construction category of foreclosed assets included 15 properties, the largest of which was located in the Springfield, Mo. metropolitan area and had a balance of $1.2 million, or 22.8% of the total category. Of the total dollar amount in the subdivision construction category of foreclosed assets, 38.2% and 22.8% is located in Branson, Mo. and Springfield, Mo., respectively, including the largest property previously mentioned. The commercial real estate category of foreclosed assets included four properties. The largest relationship in the commercial real estate category, which was added during the previous quarter, includes a commercial property in Branson, Mo. totaling $300,000, or 17.7% of the total category. One property in the commercial real estate category, which is a hotel located in the western United States totaling $1.1 million, was sold during the quarter ended December 31, 2017. The commercial business category of other real estate has a balance of zero as of December 31, 2017, due to the sale of the one foreclosed property in the category during the quarter totaling $2.9 million, which was collateralized by the borrower's interest in a condominium project in Branson, Mo. The larger amount of additions and sales under consumer loans are due to a higher volume of repossessions of automobiles, which generally are subject to a shorter repossession process. The Company experienced increased levels of delinquencies and repossessions in indirect and used automobile loans throughout 2016 and 2017.\nBUSINESS INITIATIVES\nAt the end of October 2017, a new banking center at 1320 W. Battlefield in Springfield, Mo., opened that replaced a nearby leased office at 1580 W. Battlefield. The new office offers better access and convenience for customers.\nThe Company continually evaluates its various customer access channels to ensure that customers are being effectively served when, where and how they prefer. The Company's ATM network is a part of this ongoing evaluation, which may include upgrading or adding ATM units or removing units from certain sites. Over the next year, 70 ATMs located primarily at Great Southern banking centers will be replaced with upgraded multi-functional deposit-taking machines. In addition, thirteen off-site ATMs with low customer usage have been removed in the last few months. Further evaluation of the ATM network is anticipated in the future. Great Southern customers can also access surcharge-free ATMs worldwide through the Allpoint ATM Network.\nOn January 3, 2018, the Company announced that following the enactment of the new federal tax reform legislation, it will distribute special cash bonuses to its more than 1,200 employees at the end of January 2018. A $1,000 cash payment will be made to all full-time employees and a $500 cash payment will be made to all part-time employees who were employed by the Company on December 31, 2017 and remain employed at January 31, 2018.\nGreat Southern Bancorp, Inc. will hold its 29th Annual Meeting of Shareholders at 10:00 a.m. CDT on Wednesday, May 9, 2018, at the Great Southern Operations Center, 218 S. Glenstone, Springfield, Mo. Holders of Great Southern Bancorp, Inc. common stock at the close of business on the record date, February 28, 2018, can vote at the annual meeting, either in person or by proxy.\nHeadquartered in Springfield, Mo., Great Southern offers a broad range of banking services to customers. The Company operates 104 retail banking centers and more than 200 ATMs in Missouri, Arkansas, Iowa, Kansas, Minnesota and Nebraska and commercial lending offices in Chicago, Dallas and Tulsa, Okla. The common stock of Great Southern Bancorp, Inc. is listed on the Nasdaq Global Select Market under the symbol \"GSBC.\"\nwww.GreatSouthernBank.com\nForward-Looking Statements\nWhen used in this press release and documents filed or furnished by the Company with the Securities and Exchange Commission (the \"SEC\"), in the Company's other press releases or other public or stockholder communications, and in oral statements made with the approval of an authorized executive officer, the words or phrases \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimate,\" \"project,\" \"intends\" or similar expressions are intended to identify \" \" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are subject to certain risks and uncertainties, including, among other things, (i) the possibility that the actual reduction in the Company's effective tax rate expected to result from the Tax Cuts and Jobs Act of 2017 might be different from the reduction estimated by the Company; (ii) expected revenues, cost savings, earnings accretion, synergies and other benefits from the Company's merger and acquisition activities might not be realized within the anticipated time frames or at all, and costs or difficulties relating to integration matters, including but not limited to customer and employee retention, might be greater than expected; (iii) changes in economic conditions, either nationally or in the Company's market areas; (iv) fluctuations in interest rates; (v) the risks of lending and investing activities, including changes in the level and direction of loan delinquencies and write-offs and changes in estimates of the adequacy of the allowance for loan losses; (vi) the possibility of other-than-temporary impairments of securities held in the Company's securities portfolio; (vii) the Company's ability to access cost-effective funding; (viii) fluctuations in real estate values and both residential and commercial real estate market conditions; (ix) demand for loans and deposits in the Company's market areas; (x) the ability to adapt successfully to technological changes to meet customers' needs and developments in the marketplace; (xi) the possibility that security measures implemented might not be sufficient to mitigate the risk of a cyber attack or cyber theft, and that such security measures might not protect against systems failures or interruptions; (xii) legislative or regulatory changes that adversely affect the Company's business, including, without limitation, the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 and its implementing regulations, the overdraft protection regulations and customers' responses thereto and the Tax Cuts and Jobs Act of 2017; (xiii) changes in accounting principles, policies or guidelines; (xiv) monetary and fiscal policies of the Federal Reserve Board and the U.S. Government and other governmental initiatives affecting the financial services industry; (xv) results of examinations of the Company and the Bank by their regulators, including the possibility that the regulators may, among other things, require the Company to limit its business activities, changes its business mix, increase its allowance for loan losses, write-down assets or increase its capital levels, or affect its ability to borrow funds or maintain or increase deposits, which could adversely affect its liquidity and earnings; (xvi) costs and effects of litigation, including settlements and judgments; and (xvii) competition. The Company wishes to advise readers that the factors listed above and other risks described from time to time in documents filed or furnished by the Company with the SEC could affect the Company's financial performance and could cause the Company's actual results for future periods to differ materially from any opinions or statements expressed with respect to future periods in any current statements.\nThe Company does not undertake-and specifically declines any obligation- to publicly release the result of any revisions which may be made to any to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events.\nThe following tables set forth certain selected consolidated financial information of the Company at the dates and for the periods indicated. Financial data at all the dates and for all periods is unaudited. In the opinion of management, all adjustments, which consist only of normal recurring accruals, necessary for a fair presentation of the results at and for such unaudited dates and periods have been included. The results of operations and other data for the three months and years ended December 31, 2017 and 2016, and the three months ended September 30, 2017, are not necessarily indicative of the results of operations which may be expected for any future period.\nDecember 31,\nDecember 31,\n2017\n2016\nSelected Financial Condition Data:\n(In thousands)\nTotal assets\n$ 4,414,521\n$ 4,550,663\nLoans receivable, gross\n3,769,294\n3,802,235\nAllowance for loan losses\n36,492\n37,400\nOther real estate owned, net\n22,002\n32,658\nAvailable-for-sale securities, at fair value\n179,179\n213,872\nDeposits\n3,597,144\n3,677,230\nTotal borrowings\n324,097\n416,786\nTotal common stockholders' equity\n471,662\n429,806\nNon-performing assets (excluding FDIC-assisted transaction assets)\n27,830\n39,330\nThree Months Ended\nYear Ended\nThree Months\nEnded\nDecember 31,\nDecember 31,\nSeptember 30,\n2017\n2016\n2017\n2016\n2017\nSelected Operating Data:\n(Dollars in thousands, except per share data)\nInterest income\n$ 46,537\n$ 46,936\n$ 183,061\n$ 185,175\n$ 46,368\nInterest expense\n7,264\n6,688\n27,905\n22,119\n7,087\nNet interest income\n39,273\n40,248\n155,156\n163,056\n39,281\nProvision for loan losses\n1,950\n2,380\n9,100\n9,281\n2,950\nNon-interest income\n7,374\n7,528\n38,527\n28,510\n7,655\nNon-interest expense\n29,284\n29,041\n114,261\n120,427\n28,034\nProvision for income taxes\n3,207\n4,561\n18,758\n16,516\n4,289\nNet income and net income available to common shareholders\n$ 12,206\n$ 11,794\n$ 51,564\n$ 45,342\n$ 11,663\nAt or For the Three\nMonths Ended\nAt or For the\nYear Ended\nAt or For the\nThree Months Ended\nDecember 31,\nDecember 31,\nSeptember 30,\n2017\n2016\n2017\n2016\n2017\nPer Common Share:\n(Dollars in thousands, except per share data)\nNet income (fully diluted)\n$ 0.86\n$ 0.83\n$ 3.65\n$ 3.21\n$ 0.82\nBook value\n$ 33.48\n$ 30.77\n$ 33.48\n$ 30.77\n$ 32.90\nEarnings Performance Ratios:\nAnnualized return on average assets\n1.10%\n1.05%\n1.16%\n1.04%\n1.05%\nAnnualized return on average common stockholders' equity\n10.37%\n10.98%\n11.32%\n10.93%\n10.09%\nNet interest margin\n3.75%\n3.87%\n3.74%\n4.05%\n3.77%\nAverage interest rate spread\n3.58%\n3.74%\n3.59%\n3.93%\n3.60%\nEfficiency ratio\n62.78%\n60.78%\n58.99%\n62.86%\n59.73%\nNon-interest expense to average total assets\n2.63%\n2.59%\n2.56%\n2.76%\n2.52%\nAsset Quality Ratios:\nAllowance for loan losses to period-end loans (excluding covered/previously covered loans)\n1.01%\n1.04%\n1.01%\n1.04%\n0.99%\nNon-performing assets to period-end assets\n0.63%\n0.86%\n0.63%\n0.86%\n0.73%\nNon-performing loans to period-end loans\n0.30%\n0.37%\n0.30%\n0.37%\n0.25%\nAnnualized net charge-offs to average loans\n0.18%\n0.22%\n0.26%\n0.29%\n0.35%\nGreat Southern Bancorp, Inc. and Subsidiaries\nConsolidated Statements of Financial Condition\n(In thousands, except number of shares)\nDecember 31,\n2017\nDecember 31,\n2016\nSeptember 30,\n2017\nAssets\nCash\n$ 115,600\n$ 120,203\n$ 112,145\nInterest-bearing deposits in other financial institutions\n126,653\n159,566\n144,527\nCash and cash equivalents\n242,253\n279,769\n256,672\nAvailable-for-sale securities\n179,179\n213,872\n183,968\nHeld-to-maturity securities\n130\n247\n130\nMortgage loans held for sale\n8,203\n16,445\n11,133\nLoans receivable (1), net of allowance for loan losses of $36,492 – December 2017; $37,400 – December 2016; $36,243 – September 2017\n3,726,302\n3,759,966\n3,800,988\nFDIC indemnification asset\n—\n13,145\n—\nInterest receivable\n12,338\n11,875\n11,206\nPrepaid expenses and other assets\n47,122\n45,649\n42,762\nOther real estate owned (2), net\n22,002\n32,658\n30,116\nPremises and equipment, net\n138,018\n140,596\n137,537\nGoodwill and other intangible assets\n10,850\n12,500\n11,263\nFederal Home Loan Bank stock\n11,182\n13,034\n13,282\nCurrent and deferred income taxes\n16,942\n10,907\n13,554\nTotal Assets\n$ 4,414,521\n$ 4,550,663\n$ 4,512,611\nLiabilities and Stockholders' Equity\nLiabilities\nDeposits\n$ 3,597,144\n$ 3,677,230\n$ 3,598,213\nFederal Home Loan Bank advances\n127,500\n31,452\n174,000\nSecurities sold under reverse repurchase agreements with customers\n80,531\n113,700\n130,934\nShort-term borrowings\n16,604\n172,323\n22,665\nSubordinated debentures issued to capital trust\n25,774\n25,774\n25,774\nSubordinated notes\n73,688\n73,537\n73,651\nAccrued interest payable\n2,904\n2,723\n1,693\nAdvances from borrowers for taxes and insurance\n5,319\n4,643\n8,825\nAccounts payable and accrued expenses\n13,395\n19,475\n14,736\nTotal Liabilities\n3,942,859\n4,120,857\n4,050,491\nStockholders' Equity\nCapital stock\nPreferred stock, $.01 par value; authorized 1,000,000 shares; issued and outstanding December 2017, December 2016 and September 2017 – -0- shares\n—\n—\n—\nCommon stock, $.01 par value; authorized 20,000,000 shares; issued and outstanding December 2017 – 14,087,533 shares; December 2016 – 13,968,386 shares; September 2017 – 14,044,910 shares\n141\n140\n140\nAdditional paid-in capital\n28,203\n25,942\n27,384\nRetained earnings\n442,077\n402,166\n432,691\nAccumulated other comprehensive gain\n1,241\n1,558\n1,905\nTotal Stockholders' Equity\n471,662\n429,806\n462,120\nTotal Liabilities and Stockholders' Equity\n$ 4,414,521\n$ 4,550,663\n$ 4,512,611\n(1)\nAt December 31, 2017, December 31, 2016 and September 30, 2017, includes loans, net of discounts, totaling $-0-, $134.4 million and $-0-, respectively, which were subject to FDIC support through loss sharing agreements. At December 31, 2017, December 31, 2016 and September 30, 2017, respectively, also includes $155.2 million, $72.6 million and $165.6 million of loans, net of discounts, acquired in FDIC-assisted transactions for which the loss sharing agreements were terminated, or loss sharing agreements had already expired. In addition, as of December 31, 2017, December 31, 2016, and September 30, 2017, includes $54.4 million, $76.2 million and $61.5 million, respectively, of loans, net of discounts, acquired in the Valley Bank transaction which are not covered by an FDIC loss sharing agreement.\n(2)\nAt December 31, 2017, December 31, 2016, and September 30, 2017 includes foreclosed assets, net of discounts, totaling $-0- million, $1.4 million, and $-0-, respectively, which were subject to FDIC support through loss sharing agreements. At December 31, 2017, December 31, 2016 and September 30, 2017, respectively, also includes $2.1 million, $316,000 and $2.9 million of foreclosed assets, net of discounts, acquired in FDIC-assisted transactions, for which the loss sharing agreements were terminated. At December 31, 2017, December 31, 2016, and September 30, 2017, includes $1.7 million, $2.0 million, and $1.8 million, respectively, net of discounts, of foreclosed assets related to the Valley Bank transaction, which are not covered by an FDIC loss sharing agreement. In addition, at December 31, 2017, December 31, 2016, and September 30, 2017, includes $1.6 million and $3.7 million, and $2.1 million, respectively, of properties which were not acquired through foreclosure, but are held for sale.\nGreat Southern Bancorp, Inc. and Subsidiaries\nConsolidated Statements of Income\n(In thousands, except per share data)\nThree Months Ended\nYear Ended\nThree Months Ended\nDecember 31,\nDecember 31,\nSeptember 30,\n2017\n2016\n2017\n2016\n2017\nInterest Income\nLoans\n$ 44,920\n$ 45,423\n$ 176,654\n$ 178,883\n$ 44,824\nInvestment securities and other\n1,617\n1,513\n6,407\n6,292\n1,544\n46,537\n46,936\n183,061\n185,175\n46,368\nInterest Expense\nDeposits\n5,495\n4,907\n20,595\n17,387\n5,131\nFederal Home Loan Bank advances\n471\n259\n1,516\n1,214\n546\nShort-term borrowings and repurchase agreements\n85\n201\n747\n1,137\n118\nSubordinated debentures issued to capital trust\n189\n230\n949\n803\n267\nSubordinated notes\n1,024\n1,091\n4,098\n1,578\n1,025\n7,264\n6,688\n27,905\n22,119\n7,087\nNet Interest Income\n39,273\n40,248\n155,156\n163,056\n39,281\nProvision for Loan Losses\n1,950\n2,380\n9,100\n9,281\n2,950\nNet Interest Income After Provision for Loan Losses\n37,323\n37,868\n146,056\n153,775\n36,331\nNoninterest Income\nCommissions\n190\n334\n1,041\n1,097\n279\nService charges and ATM fees\n5,432\n5,465\n21,628\n21,666\n5,533\nNet gains on loan sales\n808\n879\n3,150\n3,941\n719\nNet realized gains on sales of available-for-sale securities\n—\n(9)\n—\n2,873\n—\nLate charges and fees on loans\n308\n432\n2,231\n1,747\n436\nNet change in interest rate swap fair value\n32\n245\n28\n66\n8\nAccretion (amortization) of income related to business acquisitions\n—\n(848)\n7,219\n(6,935)\n—\nOther income\n604\n1,030\n3,230\n4,055\n680\n7,374\n7,528\n38,527\n28,510\n7,655\nNoninterest Expense\nSalaries and employee benefits\n15,539\n14,706\n60,034\n60,377\n14,664\nNet occupancy expense\n6,194\n6,521\n24,613\n26,077\n6,079\nPostage\n810\n910\n3,461\n3,791\n845\nInsurance\n659\n539\n2,959\n3,482\n755\nAdvertising\n654\n461\n2,311\n2,228\n587\nOffice supplies and printing\n237\n273\n1,446\n1,708\n279\nTelephone\n799\n834\n3,188\n3,483\n790\nLegal, audit and other professional fees\n872\n791\n2,862\n3,191\n610\nExpense on foreclosed assets\n1,334\n1,027\n3,929\n4,111\n1,343\nPartnership tax credit\n217\n420\n930\n1,681\n217\nAcquired deposit intangible asset amortization\n412\n412\n1,650\n1,910\n412\nOther operating expenses\n1,557\n2,147\n6,878\n8,388\n1,453\n29,284\n29,041\n114,261\n120,427\n28,034\nIncome Before Income Taxes\n15,413\n16,355\n70,322\n61,858\n15,952\nProvision for Income Taxes\n3,207\n4,561\n18,758\n16,516\n4,289\nNet Income and Net Income Available to Common Shareholders\n$ 12,206\n$ 11,794\n$ 51,564\n$ 45,342\n$ 11,663\nEarnings Per Common Share\nBasic\n$ 0.87\n$ 0.85\n$ 3.69\n$ 3.26\n$ 0.83\nDiluted\n$ 0.86\n$ 0.83\n$ 3.65\n$ 3.21\n$ 0.82\nDividends Declared Per Common Share\n$ 0.24\n$ 0.22\n$ 0.94\n$ 0.88\n$ 0.24\nAverage Balances, Interest Rates and Yields\nThe following table presents, for the periods indicated, the total dollar amounts of interest income from average interest-earning assets and the resulting yields, as well as the interest expense on average interest-bearing liabilities, expressed both in dollars and rates, and the net interest margin. Average balances of loans receivable include the average balances of non-accrual loans for each period. Interest income on loans includes interest received on non-accrual loans on a cash basis. Interest income on loans includes the amortization of net loan fees, which were deferred in accordance with accounting standards. Net fees included in interest income were $0.6 million and $1.4 million for the three months ended December 31, 2017 and 2016, respectively. Net fees included in interest income were $2.9 million and $5.0 million for the years ended December 31, 2017 and 2016, respectively. Tax-exempt income was not calculated on a tax equivalent basis. The table does not reflect any effect of income taxes.\nDecember 31, 2017 (1)\nThree Months Ended\nDecember 31, 2017\nThree Months Ended\nDecember 31, 2016\nAverage\nYield/\nAverage\nYield/\nYield/Rate\nBalance\nInterest\nRate\nBalance\nInterest\nRate\n(Dollars in thousands)\nInterest-earning assets:\nLoans receivable:\nOne- to four-family residential\n4.16%\n$ 441,726\n$ 5,217\n4.69%\n$ 516,221\n$ 6,572\n5.06%\nOther residential\n4.51\n745,501\n8,593\n4.57\n664,556\n7,459\n4.47\nCommercial real estate\n4.42\n1,246,065\n13,957\n4.44\n1,210,617\n14,031\n4.61\nConstruction\n4.40\n510,241\n6,197\n4.82\n355,167\n4,059\n4.55\nCommercial business\n4.71\n293,668\n3,507\n4.74\n300,212\n4,211\n5.58\nOther loans\n6.04\n576,211\n7,059\n4.86\n710,316\n8,651\n4.85\nIndustrial revenue bonds\n5.20\n24,482\n390\n6.32\n28,028\n440\n6.24\nTotal loans receivable\n4.74\n3,837,894\n44,920\n4.64\n3,785,117\n45,423\n4.77\nInvestment securities\n2.95\n194,570\n1,239\n2.53\n219,905\n1,379\n2.49\nOther interest-earning assets\n1.44\n118,055\n378\n1.27\n130,541\n134\n0.41\nTotal interest-earning assets\n4.56\n4,150,519\n46,537\n4.45\n4,135,563\n46,936\n4.52\nNon-interest-earning assets:\nCash and cash equivalents\n104,465\n112,530\nOther non-earning assets\n201,793\n228,881\nTotal assets\n$4,456,777\n$4,476,974\nInterest-bearing liabilities:\nInterest-bearing demand and savings\n0.32\n$1,567,416\n1,281\n0.32\n$1,520,053\n1,039\n0.27\nTime deposits\n1.24\n1,379,022\n4,214\n1.21\n1,500,064\n3,868\n1.03\nTotal deposits\n0.75\n2,946,438\n5,495\n0.74\n3,020,117\n4,907\n0.65\nShort-term borrowings and repurchase agreements\n0.30\n127,798\n85\n0.26\n243,925\n201\n0.33\nSubordinated debentures issued to capital trust\n2.98\n25,774\n189\n2.91\n25,774\n230\n3.55\nSubordinated notes\n5.57\n73,670\n1,024\n5.51\n73,515\n1,091\n5.90\nFHLB advances\n1.53\n138,516\n471\n1.35\n31,462\n259\n3.27\nTotal interest-bearing liabilities\n0.89\n3,312,196\n7,264\n0.87\n3,394,793\n6,688\n0.78\nNon-interest-bearing liabilities:\nDemand deposits\n648,788\n622,220\nOther liabilities\n24,782\n30,168\nTotal liabilities\n3,985,766\n4,047,181\nStockholders' equity\n471,011\n429,793\nTotal liabilities and stockholders' equity\n$4,456,777\n$4,476,974\nNet interest income:\nInterest rate spread\n3.67%\n$39,273\n3.58%\n$40,248\n3.74%\nNet interest margin*\n3.75%\n3.87%\nAverage interest-earning assets to average interest-bearing liabilities\n125.3%\n121.8%\n*Defined as the Company's net interest income divided by average total interest-earning assets.\n(1)\nThe yield on loans at December 31, 2017, does not include the impact of the adjustments to the accretable yield (income) on loans acquired in the FDIC-assisted transactions. See \"Net Interest Income\" for a discussion of the effect on results of operations for the three months ended December 31, 2017.\nDecember 31, 2017 (1)\nYear Ended\nDecember 31, 2017\nYear Ended\nDecember 31, 2016\nAverage\nYield/\nAverage\nYield/\nYield/Rate\nBalance\nInterest\nRate\nBalance\nInterest\nRate\n(Dollars in thousands)\nInterest-earning assets:\nLoans receivable:\nOne- to four-family residential\n4.16%\n$ 459,227\n$22,102\n4.81%\n$ 538,776\n$28,674\n5.32%\nOther residential\n4.51\n706,217\n31,970\n4.53\n535,793\n25,052\n4.68\nCommercial real estate\n4.42\n1,240,017\n54,911\n4.43\n1,146,983\n53,516\n4.67\nConstruction\n4.40\n454,907\n21,099\n4.64\n394,051\n18,059\n4.58\nCommercial business\n4.71\n295,379\n14,666\n4.97\n316,526\n17,389\n5.49\nOther loans\n6.04\n632,968\n30,356\n4.80\n693,550\n34,176\n4.93\nIndustrial revenue bonds\n5.20\n25,845\n1,550\n6.00\n33,681\n2,017\n5.99\nTotal loans receivable\n4.74\n3,814,560\n176,654\n4.63\n3,659,360\n178,883\n4.89\nInvestment securities\n2.95\n207,803\n5,195\n2.50\n249,484\n5,741\n2.30\nOther interest-earning assets\n1.44\n121,604\n1,212\n1.00\n116,812\n551\n0.47\nTotal interest-earning assets\n4.56\n4,143,967\n183,061\n4.42\n4,025,656\n185,175\n4.60\nNon-interest-earning assets:\nCash and cash equivalents\n103,505\n108,593\nOther non-earning assets\n212,724\n236,544\nTotal assets\n$4,460,196\n$4,370,793\nInterest-bearing liabilities:\nInterest-bearing demand and savings\n0.32\n$1,555,375\n4,698\n0.30\n$1,496,837\n3,888\n0.26\nTime deposits\n1.24\n1,414,189\n15,897\n1.12\n1,370,935\n13,499\n0.98\nTotal deposits\n0.75\n2,969,564\n20,595\n0.69\n2,867,772\n17,387\n0.61\nShort-term borrowings and repurchase agreements\n0.30\n186,364\n747\n0.40\n327,658\n1,137\n0.35\nSubordinated debentures issued to capital trust\n2.98\n25,774\n949\n3.68\n25,774\n803\n3.12\nSubordinated notes\n5.57\n73,613\n4,098\n5.57\n28,526\n1,578\n5.53\nFHLB advances\n1.53\n93,524\n1,516\n1.62\n68,325\n1,214\n1.78\nTotal interest-bearing liabilities\n0.89\n3,348,839\n27,905\n0.83\n3,318,055\n22,119\n0.67\nNon-interest-bearing liabilities:\nDemand deposits\n629,015\n608,115\nOther liabilities\n26,638\n29,824\nTotal liabilities\n4,004,492\n3,955,994\nStockholders' equity\n455,704\n414,799\nTotal liabilities and stockholders' equity\n$4,460,196\n$4,370,793\nNet interest income:\nInterest rate spread\n3.67%\n$155,156\n3.59%\n$163,056\n3.93%\nNet interest margin*\n3.74%\n4.05%\nAverage interest-earning assets to average interest-bearing liabilities\n123.7%\n121.3%", "external_links": ["http://www.greatsouthernbank.com/"], "published": "2018-01-24T03:00:00.000+02:00", "crawled": "2018-01-24T03:26:59.006+02:00", "highlightTitle": ""}