{"organizations": [], "uuid": "bd6cf1e0d719636ae1d453e79c1eea3fe9b0cfc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219266229&w=1200&r=LYNXMPEE030FM", "site_section": "https://www.reuters.com/places/china", "section_title": "China | Reuters.com", "url": "https://www.reuters.com/article/us-china-economy-targets-exclusive/exclusive-china-to-stick-with-around-6-5-percent-growth-goal-in-2018-sources-idUSKBN1ET0S7", "country": "US", "domain_rank": 408, "title": "Exclusive: China to stick with 'around 6.5 percent' growth goal in 2018 - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:36:00.000+02:00", "replies_count": 0, "uuid": "bd6cf1e0d719636ae1d453e79c1eea3fe9b0cfc0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-economy-targets-exclusive/exclusive-china-to-stick-with-around-6-5-percent-growth-goal-in-2018-sources-idUSKBN1ET0S7", "ord_in_thread": 0, "title": "Exclusive: China to stick with 'around 6.5 percent' growth goal in 2018 - sources", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "central economic work conference", "sentiment": "none"}, {"name": "bank for international settlements", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China will keep its target for economic growth at “around 6.5 percent” in 2018, unchanged from last year, policy sources told Reuters, as it seeks to balance efforts to reduce debt risks while keeping the world’s second-largest economy stable.\nThe proposed target, to be unveiled at the annual parliament meeting in March, was endorsed by top leaders at the closed-door Central Economic Work Conference in Dec. 18-20, according to four sources with knowledge of the meeting outcome.\nWhere Beijing’s policymakers set the speedometer on their closely-managed economy is always of crucial interest to global investors because of China’s role as an engine of growth for the world.\nPast stimulus policies to stop growth flagging as the global economy passed through a sticky few years resulted in massive borrowing by state-run firms and local governments.\nTotal debt in the second quarter of last year amounted to 255.9 percent of Gross Domestic Product, according to Bank for International Settlements estimates.\nAnd policymakers are on a mission to reduce the risk of any crisis erupting out of the mountain of debt as the country makes its gradual transition from a command to a market economy.\n“The economic growth target will still be around 6.5 percent as they favor stability,” said one source who requested anonymity due to the sensitivity of the matter.\nChina’s State Council Information Office, the government’s public relations arm, had not yet responded to Reuters’ request for comment on the economic targets for this year.\nThere have been some doubts whether China would be putting a number on its target for 2018, as President Xi Jinping pledged in October to pursue “high quality growth”.\nAnd while Chinese leaders remain committed to meeting a goal set by their predecessors of doubling GDP in the decade to 2020, to turn China into a “modestly prosperous” nation, a senior Communist Party official said in October that goal would not be set for the following decade.\nAnalysts expect final numbers will show the economy grew around 6.8 percent in 2017, beating the target thanks to strong global demand for Chinese exports, and just bettering the 26-year low of 6.7 percent posted in 2016.\nTo hit the 2020 goal, the economy needs to expand at least 6.3 annually over the next three years, officials have said.\nThe government will maintain a 3 percent inflation target for 2018, the sources said, suggesting policymakers are not foreseeing any sharp price rises, as factories struggle to pass on higher costs to consumers.\nNovember consumer inflation slowed to 1.7 percent, while producer price rises eased to a four-month low of 5.8 percent.\nPOLICY MIX While staying upbeat about export prospects, policymakers, according to the sources, are wary of the impact from expected increases in U.S. interest rates and President Donald Trump’s tax cut plans, which might make it more difficult for China to lure foreign investment if U.S firms repatriate more earnings.\nThe government plans keep a budget deficit target of 3 percent of GDP this year in line with a pro-active fiscal policy, spending more on infrastructure, new sectors and social welfare, according to the sources.\nThe central bank is likely to keep its grip on money supply this year to reflect its “prudent and neutral” policy, but no rises in benchmark interest rates are expected soon after a recent increase in borrowing costs for non-financial firms.\n“Monetary policy will be relatively tight to help deleverage, and risk-controls and fiscal policy will be relatively loose to focus on structural needs,” said a second source.\nIn November, China’s broad M2 money supply growth quickened to 9.1 percent from a record low of 8.8 percent in October but remained below the annual target of around 12 percent.\nThe central bank has said slowing M2 growth could be a “new normal” as regulators crack down on riskier banking activities.\nBut the crackdown has forced banks to lend more to households and businesses, with new loans hitting a record 12.94 trillion yuan ($1.99 trillion) in January-November.\nBeijing has made some progress this year reducing corporate debt, which fell to 163.4 percent of GDP in the second quarter from 166.8 percent a year earlier, according to the BIS data.\nTOO EARLY TO DITCH GDP TARGET The International Monetary Fund (IMF) and some economists have urged China to do away with growth targets to reduce the economy’s long reliance on debt-fuelled stimulus.\nAnd last month, Ma Jun - former chief economist at the central bank - said that China should replace this year’s GDP target with an unemployment rate.\nChinese officials have argued that such growth targets are not mandatory and Beijing has been improving the way it assesses local officials’ performance by adding environmental costs and debt levels to dilute GDP’s dominance.\nStill, growth targets remain central to policymakers’ thinking and many state firms still look to Beijing’s guidance.\n“We should have a data system that puts more emphasis on high-quality growth, but scrapping growth targets completely would go too far,” said one of the sources.\nEditing by Simon Cameron-Moore\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T16:36:00.000+02:00", "crawled": "2018-01-04T21:14:33.003+02:00", "highlightTitle": ""}