{"organizations": [], "uuid": "5418222b25e157d3cca0a310609ddd92cf2dbcea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-the9-limited-announces-appointment-of-new-president-and-chief-technology-officer.html", "country": "US", "domain_rank": 767, "title": "The9 Limited Announces Appointment of New President and Chief Technology Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T12:00:00.000+02:00", "replies_count": 0, "uuid": "5418222b25e157d3cca0a310609ddd92cf2dbcea"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-the9-limited-announces-appointment-of-new-president-and-chief-technology-officer.html", "ord_in_thread": 0, "title": "The9 Limited Announces Appointment of New President and Chief Technology Officer", "locations": [], "entities": {"persons": [{"name": "lau", "sentiment": "none"}, {"name": "yue dong", "sentiment": "none"}, {"name": "arthur lau", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "ark pacific", "sentiment": "none"}, {"name": "greater china", "sentiment": "none"}], "organizations": [{"name": "interne", "sentiment": "negative"}, {"name": "citigroup", "sentiment": "none"}, {"name": "the london school of economics", "sentiment": "none"}, {"name": "ark pacific capital management", "sentiment": "none"}, {"name": "elliott advisors", "sentiment": "none"}, {"name": "jpmorgan", "sentiment": "none"}, {"name": "elliott associates", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI, Jan. 26, 2018 /PRNewswire/ -- The9 Limited (\"The9\") (Nasdaq: NCTY), an established Internet company, today announced that Arthur Lau will join The9 in February and Yue Dong has joined The9 recently as the new president and chief technology officer, respectively.\nAs the new president, Mr. Lau is a seasoned finance professional with experience spanning across private equity, hedge fund and investment banking sectors. He is currently the co-founder and partner of Ark Pacific Capital Management (\"Ark Pacific\"), a multi-strategy alternative asset manager focusing in Greater China. Mr. Lau sat on the board of multiple portfolio companies and is experienced in developing new business initiatives. Prior to joining Ark Pacific, he was an investment director of Elliott Advisors, the Asian office of Elliott Associates, a global hedge fund managing over US$30 billion of assets. Before that, Mr. Lau was a technology, media and telecom investment banker at Citigroup and an investment banker at JPMorgan. Mr. Lau graduated from The London School of Economics and Political Science with a Bachelor of Laws degree and holds a Master of Economics degree from The University of Hong Kong. Arthur Lau will utilize his capital market management experience and his experience and resources in developing new business initiatives, to lead the new blockchain business of The9 and bring it to a higher level.\nBefore joining The9 as the new chief technology officer, Yue Dong has been acting as the chief technology officer in various artificial intelligence, big data and blockchain related projects for two years. He has solid experience in blockchain technology, its application, investment and financing. Before that, Mr. Dong served as the chief technology officer of lvmama.com , one of China's largest B2C online travel agencies. Mr. Dong led and completed the buildup of the new generation big data travel platform of lvmama.com . Mr. Dong also worked as the senior vice president and chief technology officer of lashou.com , one of China's largest group coupon companies. Mr. Dong was in charge of the structure administration of the technical platform of lashou.com , and helped lashou.com with the creativity of group coupon and e-commerce technology. Mr. Dong also won careers from both Wall Street and Silicon Valley. Mr. Dong worked at Royal Bank of Scotland (RBS) for a global (fixed income) trading platform and data mining team at Interactive Brokers. At Oracle, Mr. Dong worked at Oracle headquarter for Oracle eBusiness Research and Development, and then Oracle North American consulting team for Business Intelligence/Data Mining and Enterprise Resource Planning Application. During his time at Oracle consulting team, he worked for more than ten Fortune 500 clients. Mr. Dong is a Carnegie Mellon University graduate. He holds seven IT industry certificates. Mr. Dong will help The9 set blockchain business strategy, be in charge of the execution of blockchain related projects of The9, and provide technical support and resources for the platform and project development.\nOn January 16, 2018, The9 announced its plan to step into blockchain related business. The9 will provide global enterprises with a full range of customized services for blockchain related projects, including complete technical solutions, research and development support, and offshore investing and financing deals, to help enterprises building up blockchain technology ecosystem. The9 may further pursue investment opportunities in new blockchain investments with high potential. Blockchain related technology and application has been growing rapidly in recent years. At present, it is generally believed that blockchain technology is the foundation for the development of the next generation Internet.\nMr. Jun Zhu, Chairman of The9, commented: \"The9 is undergoing an important transformation of business. Other than reengineering our previous experience and resources we have cumulated from Internet product content development and operation, we also need to build up our application and execution abilities on new technology and new capital market model. We are very pleased to welcome Arthur and Yue on board to join our management team. I believe The9 will start a new page with the help of their resources, experience and strategic vision.\"\nSafe Harbor Statement\nThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"considers\" and similar statements. Statements that are not historical facts, including statements about The9's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of important factors could cause actual results to differ materially from those contained in any forward-looking statement. Potential risks and uncertainties include, but are not limited to, The9's ability to license, develop or acquire online games that are appealing to users, The9's ability to retain existing players and attract new players, The9's ability to anticipate and adapt to changing consumer preferences and respond to competitive market conditions, political and economic policies of the Chinese government, the laws and regulations governing the online game industry, information disseminated over the Internet and Internet content providers in China, intensified government regulation of Internet cafes, and other risks and uncertainties outlined in The9's filings with the U.S. Securities and Exchange Commission, including its annual reports on Form 20-F. The9 does not undertake any obligation to update any forward-looking statement, except as required under applicable law.\nAbout The9 Limited\nThe9 Limited is an Internet company based in China. The9 is stepping into blockchain related business. The9 also develops and/or operates, directly or through its affiliates, its proprietary mobile games and web games, including the CrossFire brand new shooting mobile game, Audition mobile, Knight Forever, Q Jiang San Guo and Wildlands God of War.\nFor further information, please contact:\nMs. Connie Sun\nInvestor Relations Specialist\nThe9 Limited\nTel: +86 (21) 5172-9990\nEmail: IR@corp.the9.com\nWebsite: http://www.the9.com/\nView original content: http://www.prnewswire.com/news-releases/the9-limited-announces-appointment-of-new-president-and-chief-technology-officer-300588739.html\nSOURCE The9 Limited", "external_links": ["http://www.prnewswire.com/news-releases/the9-limited-announces-appointment-of-new-president-and-chief-technology-officer-300588739.html", "http://www.the9.com/"], "published": "2018-01-26T12:00:00.000+02:00", "crawled": "2018-01-26T12:38:02.006+02:00", "highlightTitle": ""}