{"organizations": [], "uuid": "f946ba248c01f4c375eb69fe04aaf820b155c185", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/24/the-associated-press-senate-confirms-alex-azar-as-trumps-new-health-secretary.html", "country": "US", "domain_rank": 767, "title": "Senate confirms Alex Azar as Trump's new health secretary", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T21:58:00.000+02:00", "replies_count": 0, "uuid": "f946ba248c01f4c375eb69fe04aaf820b155c185"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/24/the-associated-press-senate-confirms-alex-azar-as-trumps-new-health-secretary.html", "ord_in_thread": 0, "title": "Senate confirms Alex Azar as Trump's new health secretary", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "alex azar", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "azar", "sentiment": "none"}, {"name": "tom price", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "r-ga.", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "health and human services department", "sentiment": "none"}, {"name": "medicare", "sentiment": "none"}, {"name": "trump cabinet", "sentiment": "none"}, {"name": "gop-majority senate", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — President Donald Trump's second health secretary won Senate approval Wednesday. Alex Azar will take over a sprawling department shaken by his predecessor's early exit.\nThe GOP-majority Senate voted 55-43, largely along party lines, to confirm the former drug company and government executive to join the Trump Cabinet.\nA 50-year-old Ivy League-educated lawyer, Azar says he has four main priorities for the Health and Human Services Department: help curb the cost of prescription drugs; make health insurance more affordable and available; continue bipartisan efforts to focus Medicare payments on quality; and confront the opioid addiction epidemic.\nTrump's first health chief, former Rep. Tom Price, R-Ga., resigned last fall amid an outcry over his use of costly private charter aircraft for official travel. Price had been an important player in Trump's ill-fated campaign to roll back President Barack Obama's health law, an effort that fell far short of the full \"repeal and replace\" Republicans long promised.\nPrice's sudden departure created concern about the direction of the trillion-dollar department that plays a major role in the economy and accounts for about one-fourth of the federal budget. The department is responsible for health insurance programs covering more than 130 million people, drug and food safety, disease detection and prevention, and advanced medical research.\nAzar had served in senior health jobs under President George W. Bush and had the support of much of the health care industry. Some Democratic health policy experts who had worked with him described him as steady, knowledgeable and willing to hear both sides.\nHis pharmaceutical ties drew opposition from consumer groups. Most Democrats and even some Republicans questioned whether he can deliver on his promise to help lower drug costs.\nSen. Ron Wyden, D-Ore., said Azar \"came up short\" when given a chance to convince Democrats that he would be an independent voice.\nAfter leaving the Bush administration, Azar spent 10 years as a senior executive of drugmaker Eli Lilly, which has been criticized for raising the price of insulin and other widely used medications. Before resigning from Indianapolis-based Lilly last year, Azar built a financial portfolio now worth between $9.5 million and $20.6 million, according to disclosure records filed with the Office of Government Ethics.\nAzar says he's his own man. \"I don't have pharma's policy agenda,\" he told the Senate Health, Education, Labor and Pensions Committee. \"This is the most important job I will have in a lifetime, and my commitment is to the American people.\"\nSix Democratic senators and one independent voted to confirm Azar: Democrats Tom Carper and Chris Coons of Delaware, Joe Donnelly of Indiana, Heidi Heitkamp of North Dakota, Doug Jones of Alabama, Joe Manchin of West Virginia, and independent Angus King of Maine.\n\"I disagree with most of the Trump administration's health care policies, but HHS needs a competent leader,\" Coons said in a statement.\nSen. Rand Paul of Kentucky was the only Republican to vote against the nomination.", "external_links": [], "published": "2018-01-24T21:58:00.000+02:00", "crawled": "2018-01-25T02:51:57.000+02:00", "highlightTitle": ""}