{"organizations": [], "uuid": "a4a0daee71cdc5b6b7fffd172d5e30b181983371", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180114.html", "section_title": "Archive News &amp; Video for Sunday, 14 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/football-nfl-pit-jac-recap/jaguars-withstand-late-rally-topple-steelers-45-42-idUSMTZEE1EKF0RDE", "country": "US", "domain_rank": 408, "title": "Jaguars withstand late rally, topple Steelers 45-42", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T06:03:00.000+02:00", "replies_count": 0, "uuid": "a4a0daee71cdc5b6b7fffd172d5e30b181983371"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/football-nfl-pit-jac-recap/jaguars-withstand-late-rally-topple-steelers-45-42-idUSMTZEE1EKF0RDE", "ord_in_thread": 0, "title": "Jaguars withstand late rally, topple Steelers 45-42", "locations": [], "entities": {"persons": [{"name": "leonard fournette", "sentiment": "negative"}, {"name": "telvin smith", "sentiment": "negative"}, {"name": "fournette", "sentiment": "none"}, {"name": "brown", "sentiment": "none"}, {"name": "antonio brown", "sentiment": "none"}], "locations": [{"name": "tennessee", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}, {"name": "heinz field", "sentiment": "none"}], "organizations": [{"name": "jaguars", "sentiment": "negative"}, {"name": "steelers", "sentiment": "negative"}, {"name": "jacksonville jaguars", "sentiment": "none"}, {"name": "pittsburgh steelers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EditorsNote: Update: Adds Tomlin Quote:\nLeonard Fournette rushed for three touchdowns, Telvin Smith returned a fumble 50 yards for a score and the Jacksonville Jaguars upset the Pittsburgh Steelers 45-42 in the divisional round of the AFC playoffs at Heinz Field on Sunday.\nJacksonville advanced to the AFC Championship for the first time since 1999 and will face New England, which dominated Tennessee 35-14 on Saturday.\nFournette finished with 109 yards on 25 carries. He left in the second quarter with an ankle injury but returned in the second half and finished with 109 yards on a game-high 25 carries.\n“It’s the same ankle that has been bothering me,” said Fournette. “It just landed the wrong way ... every time you re-injure anything, especially the ankle ... it hurt a little bit.”\nSteelers receiver Antonio Brown made his first appearance since Dec. 17 when he injured his left calf against the Patriots. He still managed to lead the league with 1,533 receiving yards despite missing the final two games of the season.\nBrown finished with 132 yards on seven receptions with two touchdowns.\nSteelers quarterback Ben Roethlisberger was 37-of-58 passing and set a franchise playoff record with 469 yards. He also threw for five touchdowns with an interception.\n“We didn’t get it done, we didn’t play well enough today,” said Steelers coach Mike Tomlin. “The effort was there, the resolve was there, but just not enough detailed execution to win against good people in January football. That’s about the only way to cut it.”\nThe game was a rematch from Week 5 when Jacksonville dismantled Pittsburgh 30-9, also at Heinz Field. This time, Jacksonville led by 21 points twice in the first-half lead and then withstood a late rally.\nThe Steelers pulled to within 28-21 on a 19-yard touchdown pass from Roethlisberger to Le‘Veon Bell with 9:09 left in the third quarter.\nThe Jaguars regained the momentum by forcing an incomplete pass on a 4th-and-1 at their own 39 early in the fourth quarter. Blake Bortles threw a 45-yard pass to Keelan Cole to the 3-yard line, setting up Fournette’s career-best third touchdown of the game.\nThe Steelers would not go away, and Roethlisberger threw a 43-yard touchdown pass to Brown on a 4th-and-5, cutting the margin to 35-28 with 9:05 left in the game. Bortles answered with a 14-yard touchdown pass to Tommy Bohanon.\nPittsburgh refused to quit, and a lateral by Roethlisberger to Bell set up an 8-yard score that pulled the Steelers to 42-35. The Jaguars recovered the onside kick and sealed the game on a 45-yard field goal by Josh Lambo.\nRoethlisberger rounded out the scoring with a 4-yard pass to JuJu Smith-Schuster with one second left.\n“They kept fighting throughout the duration,” said Fournette. “We just knew that every time they scored, we had to come back and score and put a drive together to help our defense gather their breaths.”\nBortles completed 14 of 26 pass attempts for 214 yards with the touchdown, a week after becoming just the second quarterback in the past 25 years to have more rushing yards than passing yards in a playoff game.\n“I‘m sure there will still be tons of people that are going to disapprove or talk negative or hate and do whatever they want,” said Bortles. “But we get to keep playing, we get another opportunity to go play in Foxborough next week. Just honored to be able to do it, especially with this group of guys.”\nThe Jaguars took a 7-0 lead on the game’s opening possession on a 1-yard run by Fournette on a 4th-and-goal. An interception by Myles Jack set up an 18-yard touchdown by Fournette, stunning the sell-out crowd.\nJacksonville stuffed Bell for a 4-yard loss on a 4th-and-1 at the Jaguars’ 25 on the ensuing drive. That led to a 4-yard scoring run by T.J. Yeldon, boosting the lead to 21-0 with 11:31 left in the half. Pittsburgh finally got on the board on a 23-yard touchdown pass from Roethlisberger to Brown.\nThe Jaguars regained the momentum when Yannick Ngakoue strip-sacked Roethlisberger and Telvin Smith picked up the loose ball and ran 50 yards for the score and a 28-7 lead. Roethlisberger answered on the next drive with a 36-yard touchdown pass to Martavis Bryant on a 4th-and-11 that cut the margin to 14 at the half.\nJacksonville put 42 points on the board after combining for 20 in its past two weeks.\n“It’s been a lack of execution,” said Bortles. “We’ve just kinda been having some mental errors and not really being able to figure things out. It’s hasn’t been schemes or calls or anything like that. We kinda just put it all together today, and guys played their tails off.”\n--Field Level Media\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T06:03:00.000+02:00", "crawled": "2018-01-15T16:52:10.001+02:00", "highlightTitle": ""}