{"organizations": [], "uuid": "5a84df39383317128b6e6a423a300a3e3812aac3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-2-regulator-opposes-idea-of-u-s-government-anti-spying-5g-network.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-Regulator opposes idea of U.S. government anti-spying 5G network", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:12:00.000+02:00", "replies_count": 0, "uuid": "5a84df39383317128b6e6a423a300a3e3812aac3"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-2-regulator-opposes-idea-of-u-s-government-anti-spying-5g-network.html", "ord_in_thread": 0, "title": "UPDATE 2-Regulator opposes idea of U.S. government anti-spying 5G network", "locations": [], "entities": {"persons": [{"name": "ajit pai", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "verizon", "sentiment": "negative"}, {"name": "federal communications commission", "sentiment": "none"}, {"name": "fcc", "sentiment": "none"}, {"name": "national security council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds ATT, Verizon shares drop, comment from China expert)\nWASHINGTON, Jan 29 (Reuters) - The top U.S. communications regulator on Monday said he opposed an idea by some security officials to counter the threat of China spying on U.S. phone calls by having the government build and run a national, super-fast 5G wireless network.\n\"Any federal effort to construct a nationalized 5G network would be a costly and counterproductive distraction from the policies we need to help the United States win the 5G future,\" Federal Communications Commission (FCC) Chairman Ajit Pai, a Republican, said in a statement.\nThree of the other four FCC commissioners also said Monday they oppose nationalizing the 5G network.\nA U.S. built 5G network could in theory be more resilient to Chinese government intrusions. A leaked National Security Council memo published by Axios news website on Sunday said China is the dominant manufacturer of network infrastructure and notes the importance of building the network with \"equipment from a trusted supply chain.\"\nShares of the biggest U.S. wireless carriers fell at the start of trade on Monday, with Verizon Communications Inc and AT&T Inc down 1.4 percent.\nOn Sunday, Reuters reported that President Donald Trump's national security team was looking at options to counter the threat of China spying on U.S. phone calls that include the government building a 5G network, citing a senior administration official.\nThe official, confirming the gist of the Axios report, said the option was being debated at a low level in the administration and was six to eight months away from being considered by the president himself.\nThe 5G network concept is aimed at addressing what officials see as China's threat to U.S. cyber security and economic security.\nFCC Commissioner Jessica Rosenworcel, a Democrat, said the memo \"correctly diagnoses a real problem. There is a worldwide race to lead in 5G and other nations are poised to win. But the remedy proposed here really misses the mark.\"\nThe Trump administration has taken a harder line with China on policies initiated by predecessor President Barack Obama, a Democrat, on issues ranging from Beijing's role in restraining North Korea to Chinese efforts to acquire U.S. strategic industries.\nBut any plan would likely cost hundreds of billions of dollars, require the government to obtain spectrum and raises questions whether Americans would want to buy service from a government entity, wireless carriers said.\n\"This has been building for months. I don't think the White House options papers do justice to the issue. It goes much deeper,\" said Michael Wessel, a commissioner on the U.S.-China Economic and Security Review Commission, which works for Congress and follows China issues.\nPai, named FCC chairman by Trump in January 2017, has backed 5G and looked for ways to help eliminate barriers to private sector adoption. The next generation of wireless signals will be significantly faster and far more responsive to allow advanced technologies like virtual surgery or controlling machines remotely.\nCTIA, the trade group that represents AT&T, Verizon, Apple Inc, Sprint Corp and others, said in a statement the \"government should pursue the free market policies that enabled the U.S. wireless industry to win the race to 4G.\"\nAnother Republican on the FCC, Mike ORielly, said the leaked proposal was \"nonsensical\" and did not represent what was happening in the marketplace.\n\"U.S. commercial wireless companies are the envy of the world and are already rushing ahead to lead in 5G,\" he said in a statement, adding that the FCC should provide additional spectrum to help facilitate deployment. (Reporting by Susan Heavey, Katanga Johnson and David Shepardson, additional reporting by Diane Bartz; Editing by Andrew Hay and Grant McCool)", "external_links": [], "published": "2018-01-29T18:12:00.000+02:00", "crawled": "2018-01-29T19:26:37.043+02:00", "highlightTitle": ""}