{"organizations": [], "uuid": "5dbab3646c97e3c87c85d98fba596b9ccd3bb96c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-greenfield-farms-food-inc-announces-board-of-directors-approval-for-recapitalization.html", "country": "US", "domain_rank": 767, "title": "Greenfield Farms Food Inc. Announces Board of Director's Approval for Recapitalization", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T19:00:00.000+02:00", "replies_count": 0, "uuid": "5dbab3646c97e3c87c85d98fba596b9ccd3bb96c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-greenfield-farms-food-inc-announces-board-of-directors-approval-for-recapitalization.html", "ord_in_thread": 0, "title": "Greenfield Farms Food Inc. Announces Board of Director's Approval for Recapitalization", "locations": [], "entities": {"persons": [{"name": "luke zouvas", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}, {"name": "noho", "sentiment": "none"}, {"name": "san diego county", "sentiment": "none"}], "organizations": [{"name": "greenfield farms food inc", "sentiment": "neutral"}, {"name": "greenfield farms food, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "apa", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "noho, inc.", "sentiment": "none"}, {"name": "superior court of the state of california", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 17, 2018 (GLOBE NEWSWIRE) -- Via OTC PR Wire -- Greenfield Farms Food, Inc. (\" GRAS \" or the \"Company\") (OTC PINK:GRAS) today announced that the Board of Directors (the \"Board\") of the Company has approved a recapitalization of the Company's common stock (the \"Recapitalization\"). The Board has authorized the Company through June 30, 2018, to restructure the outstanding shares of common stock in a range, whereby, between 350 and 500 shares of common stock will be exchanged for 1 share of common stock. The Board also approved a reduction in the authorized shares of common stock from 6,450,000,000 to 250,000,000 at the time of the Recapitalization.\nThe Company was named in a complaint filed by Noho, Inc. (\"Noho\") and Luke Zouvas (\"Zouvas\") on December 19, 2017, in Superior Court of the State of California, in San Diego County. The suit focused around an Asset Purchase Agreement (APA) dated May 25, 2017. Noho and Zouvas (the \"Plaintiffs\") attempted to get a Temporary Restraining Order (\"TRO\") against the Company. The TRO was denied. On December 27, 2017, the case was moved to Federal Court in the United States District Court for the Southern District of California (the \"Federal Court\"). The Plaintiffs again filed a motion for a TRO on January 12, 2018. On January 16, 2018, the Federal Court denied the TRO motion. The complaint references an APA entered into between Cherry Hill Financial, LLC a subsidiary of NOHO, Inc. and the Company. Closing obligations and conditions under the APA did not materialize resulting in the APA not closing.\nDr. Jason Koo, CEO stated, \"This Recapitalization is needed in order for our Company to execute on its long-term goals and objectives. As we have previously announced, we have begun the process of becoming current with our financial statement filing requirements and anticipate that we would be able to effectuate the Recapitalization during the second quarter of 2018.\"\nDr. Koo, also stated, \"This is the first step in building a strong and loyal shareholder base that can share in the additional value we plan to generate for the Company. We are working on some very exciting developments and will keep you informed as soon as they are finalized.\"\nLastly, Dr. Koo stated, \"Regarding the lawsuit, we believe the claims are without merit and two courts have now denied the Plaintiffs TRO attempts. If needed, we will defend the matter and retain any rights for any damages caused by the Plaintiffs.\"\nAbout Greenfield Farms Food, Inc.\nGreenfield Farms Food, Inc. is a publicly-traded nominally capitalized company that recently acquired assets related to the automotive technology business. The Company designs, develops and manufactures state of the art automotive technologies including our muffler/silencer systems that relieves the back-pressure issue of trucks and automobiles allowing the engine and transmission to perform at maximum efficiency which increases fuel mileage while extending engine and transmission life.\nSafe Harbor for Forward-looking Statements\nThis news release may contain forward-looking statements that are made pursuant to the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. While these statements are made to convey to the public the company's progress, business opportunities and growth prospects, they are based on management's current beliefs and assumptions as to future events. However, since the company's operations and business prospects are always subject to risk and uncertainties, the forward-looking events and circumstances discussed in this news release might not occur, and actual results could differ materially from those described, anticipated or implied. For a more complete discussion of such risks and uncertainties, please refer to the company's filings with the Securities and Exchange Commission.\nFor more information call Edward Carter at 980-348-8825\nSource: Greenfield Farms Food, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=0MpFPG6LgXPub8g3aFjZQ3ShhtU8ilW5rTEOn7KX4bcs5bJwaMR-XZx-5riKnkrlS1APUhNi7kupoEDniHIzIFHbNXCHlxsT_AeSut61aegix-p1AkqDQEb4Vvhe1E0nwvndEvBDFrXkW56UcoaIBQ=="], "published": "2018-01-17T19:00:00.000+02:00", "crawled": "2018-01-17T19:05:18.007+02:00", "highlightTitle": ""}