{"organizations": [], "uuid": "09a10e03e79751f1713d0399a14c9fee96447f7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/cvs-street-corner1.jpeg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/15/cvs-beauty-touch-ups/", "country": "US", "domain_rank": 1196, "title": "CVS seeks to end the use of major photo touch ups by 2020 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.981, "site_type": "news", "published": "2018-01-15T10:15:00.000+02:00", "replies_count": 0, "uuid": "09a10e03e79751f1713d0399a14c9fee96447f7e"}, "author": "Phil Wahba", "url": "http://fortune.com/2018/01/15/cvs-beauty-touch-ups/", "ord_in_thread": 0, "title": "CVS seeks to end the use of major photo touch ups by 2020 | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "cvs", "sentiment": "negative"}, {"name": "fortune 8:15 am est  cvs health", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CVS to Curb Use of Major Photo Alterations in Beauty Products and Ads Pedestrians walk by a CVS store on November 5, 2013 in San Francisco, California. Justin Sullivan/Getty Images 8:15 AM EST \nCVS Health (cvs) wants shoppers to see its beauty products in all their glory, wrinkles and all. \nThe company, which operates about 10,000 CVS pharmacy drugstores, said Monday it aimed to eliminate by the end of 2020 the use of imagery that has been “materially altered” with touch ups on its beauty products like cosmetics, skincare, haircare and personal care items and in its stores’ beauty sections. \nThe move is likely aimed at winning over more female customers at a time of heightened competition in the beauty industry. What’s more, beauty products are a $3.4 billion a year business for CVS, generating 4.2% of retail sales in 2016, but that was a drop from the previous years. \nThe category is essential to generating shopper visits: CVS has struggled for several years with declining sales of general merchandise in its stores, declines offset by its booming prescriptions business. \n“As a woman, mother and president of a retail business whose customers predominantly are women, I realize we have a responsibility to think about the messages we send to customers,” said CVS pharmacy President Helena Foulkes ahead of an announcement of the effort at that National Retail Federation conference in New York. There have been frequent backlashes against the use of major alterations to photos of models in the beauty and fashion industries in recent years. \nThe new standards of photo alterations related to beauty products, whether in its stores, web site or social media feeds, will be showcased by a “CVS Beauty Mark,” a watermark on products that will signal to shoppers that images on a product were not significantly altered. \nCVS says it is lining up some major national brands to also take part in addition to its own brands. But the company will require the no-big-touch-up approach extend to any beauty products it sells by 2020. The watermark will start to appear on CVS’ house brands this year. \nBelow is an example from a previous campaign to show what it would look under the new CVS guidelines. \nThe move is also the latest salvo by CVS in the beauty wars with rivals such as Walgreens (wba) and Target . (tgt) Last year, CVS announced new beauty sections being rolled out at 2,000 its stores. Those featured things like “trend wall” displays added to showcase new products launches n area to showcase Korean products to ride the surge in interest in skin care products from that country. \nCVS, which recently said it would acquire giant health insurer Aetna (aet) , four years ago eliminated tobacco products from its stores as part of its pivot to being seen as a health care company rather than a retailer. The company also owns Caremark, one of the largest pharmacy benefits managers in the country. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-15T10:15:00.000+02:00", "crawled": "2018-01-15T15:42:13.014+02:00", "highlightTitle": ""}