{"organizations": [], "uuid": "20a9dbd64477b128b19c13e8505d66364c608089", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226362241&w=1200&r=LYNXMPEE0S1CG", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-romania-government/romanias-legislators-approve-new-government-eu-ministry-in-spotlight-idUKKBN1FI292", "country": "US", "domain_rank": 408, "title": "Romania's legislators approve new government; EU ministry in spotlight", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T19:34:00.000+02:00", "replies_count": 0, "uuid": "20a9dbd64477b128b19c13e8505d66364c608089"}, "author": "", "url": "https://uk.reuters.com/article/uk-romania-government/romanias-legislators-approve-new-government-eu-ministry-in-spotlight-idUKKBN1FI292", "ord_in_thread": 0, "title": "Romania's legislators approve new government; EU ministry in spotlight", "locations": [], "entities": {"persons": [{"name": "dragnea", "sentiment": "none"}, {"name": "mihai tudose", "sentiment": "none"}, {"name": "viorica dancila", "sentiment": "none"}, {"name": "dancila", "sentiment": "none"}, {"name": "tudose", "sentiment": "none"}, {"name": "sorin grindeanu", "sentiment": "none"}, {"name": "liviu dragnea", "sentiment": "none"}, {"name": "cristian patrasconiu", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "bucharest", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 5:38 PM / Updated 44 minutes ago Romania's legislators approve new government; EU ministry in spotlight Reuters Staff 3 Min Read \nBUCHAREST (Reuters) - Romania’s parliament overwhelmingly endorsed a new Social Democrat-led government on Monday, giving Prime Minister Viorica Dancila a mandate that will be scrutinised closely by the country’s foreign partners and investors. \nDancila was named prime minister earlier this month to replace Mihai Tudose, who quit after a falling out with the powerful leader of the Social Democrats, Liviu Dragnea. Tudose himself became prime minister when Dragnea forced out his predecessor, Sorin Grindeanu, last summer. \nDancila had to be approved in a vote of confidence, which she won easily on Monday - 282 legislators backed her, including some junior opposition groups . The new cabinet retains around a third of the former government’s ministers. \n“This government, as a whole, does not bode well for the rule of law in Romania and its relations with the West, particularly with the European Union,” said independent political commentator Cristian Patrasconiu. \nDancila has set up a new ministry to handle European Union funds and nominated as its head Social Democrat lawmaker Rovana Plumb, whom anti-corruption prosecutors wanted to investigate. Her appointment has fuelled renewed concerns about Romania’s commitment to seriously tackling graft. Romanian Prime Minister Viorica Dancila attends a vote of confidence at the Parliament in Bucharest, Romania January 29, 2018. Inquam Photos/George Calin via REUTERS \nParliament rejected the prosecutors’ attempt to investigate Plumb, who denied any wrongdoing. But then-Prime Minister Tudose sacked her and two other ministers, saying graft allegations were damaging Romania’s relations with the EU. \nOn Monday, Prime Minister Dancila said her cabinet reflected the 2016 general elections. “Together with my colleagues, I do represent the political will of the ruling coalition,” she said. Romanian Prime Minister Viorica Dancila attends a vote of confidence at the Parliament in Bucharest, Romania January 29, 2018. Inquam Photos/Octav Ganea via REUTERS \n“Today, you do not vote for persons but back Romanian citizens’ desire revealed by democracy. We will govern with pride and respect for Romanians, having the government programme in front of us,” Dancila told parliament. \nThe revised governing programme includes plans to further increase pensions and the minimum wage, cut value-added tax by one percentage point to 18 percent from 2019. It also aims to set up a sovereign wealth fund and boost the absorption of EU funds. \nBut leftist legislators aim to change the criminal code that would decriminalise several graft offences, their second attempt in a year to fight off a crackdown on corruption. Last week, Brussels urged parliament to reconsider earlier judicial reforms, which critics say weaken judicial independence. Reporting by Radu Marinas; Additional reporting by Luiza Ilie; editing by", "external_links": [], "published": "2018-01-29T19:34:00.000+02:00", "crawled": "2018-01-29T20:00:57.000+02:00", "highlightTitle": ""}