{"organizations": [], "uuid": "c8f91cf56165725102e10bd70338a095ec0b050d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219585318&w=1200&r=LYNXMPEE040NM", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-trump-energy/cant-please-everyone-trump-energy-policy-riles-competing-sectors-idINKBN1EU145", "country": "US", "domain_rank": 408, "title": "Can't please everyone: Trump energy policy riles competing sectors", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T14:05:00.000+02:00", "replies_count": 0, "uuid": "c8f91cf56165725102e10bd70338a095ec0b050d"}, "author": "", "url": "https://in.reuters.com/article/usa-trump-energy/cant-please-everyone-trump-energy-policy-riles-competing-sectors-idINKBN1EU145", "ord_in_thread": 0, "title": "Can't please everyone: Trump energy policy riles competing sectors", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "robert flexon", "sentiment": "none"}, {"name": "gardner", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "neutral"}, {"name": "department of energy", "sentiment": "none"}, {"name": "dynegy inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - When the administration of U.S. President Donald Trump proposed new subsidies for coal and nuclear plants, it seemed like an obvious way to deliver on campaign promises to boost the nation’s energy industry.\nFILE PHOTO: U.S. President Donald Trump delivers remarks during an 'Unleashing American Energy' event at the Department of Energy in Washington, U.S., June 29, 2017. REUTERS/Carlos Barria/File Photo And yet the plan, announced in September, set off sharp criticism from other sectors that Trump has also vowed to help, such as natural gas and utilities.\n“Subsidies don’t make you competitive - and don’t make you great again,” said Robert Flexon, the president and chief executive of Dynegy Inc, a Houston-based utility that owns both coal- and gas-fired power plants.\nSquabbling over the proposal exemplifies the administration’s larger struggle to deliver on promises of a sweeping “energy renaissance” across the coal, oil, gas and nuclear industries.\nTrouble is, policies that help one of those sectors often hurt another, illustrating the complexity of energy regulation and the difficulty in appeasing competing interests. While election campaigns often seek to neatly divide voters into two camps - those supporting energy vs. those supporting the environment - such rhetoric fails to capture the messier policy impacts on profits, hiring and emissions reductions across the energy landscape.\nThere is little evidence that Trump’s moves so far have aided energy firms of any stripe; some administration proposals have languished amid divisive politics, while other regulatory changes have seen their impact muted by market forces.\nUtilities, for instance, have shown little interest in buying more coal-fired power despite the regulatory rollbacks in Trump’s pro-coal push.\nA broader measure of investor sentiment on the energy industry - the Standard & Poor’s 500 energy index - lost more than 7 percent in 2017 even as stock markets soared.\nWhite House and Energy Department officials did not respond to requests for comment.\nAnother political flashpoint has been the administration’s waffling over proposed changes to biofuels policy.\nTrump’s Environmental Protection Agency initially entertained a plan from oil refiners to upend regulations requiring them to blend ethanol into their gasoline - then rejected it after a backlash from the ethanol industry, rooted in Midwest corn-growing states that supported Trump’s election.\nThe dispute sparked open warfare among the congressional backers of various industry interests, including threats to block Trump’s agency nominations and accusations he had welched on campaign promises.\nEven the coal industry, which played a starring role in Trump’s campaign, has seen a marginal return on its lobbying efforts. It has, for instance, had little success so far in attacking subsidies for wind and solar power.\nTrump and others in his administration have criticized renewable energy as expensive and dependent on government support. But the White House has not sought to repeal tax breaks expected to provide $12.3 billion to renewable energy firms by 2020, which other Republicans continue to support.\nFossil-fuel firms clearly have more influence on policy under Trump and easier access to decision makers. Coal, oil, and gas company executives have met regularly with senior administration officials, according to official agency schedules.\nTheir policy victories include rollbacks of regulations limiting emissions of carbon, methane and other pollutants; the opening of Alaska’s Arctic National Wildlife Refuge to drilling; and the lifting of a coal-mining moratorium on federal lands.\nBut the impact of these moves on production, profits and jobs remains uncertain. Demand for additional drilling and mining leases on federal lands has been thin, and top U.S. oil and gas companies have told shareholders in regulatory filings that environmental regulations have little impact on their business.\nWhile coal advocates have generally cheered Trump’s ascension, White House policies have so far had little effect on U.S. coal consumption.\nRobert Murray, chief executive of private coal company Murray Energy Corp., said Republican efforts to boost coal have addressed only the “low hanging fruit” of overturning a few environmental regulations while avoiding tougher issues.\nThe oil and gas industry, also championed by Trump, similarly feels let down by an administration it had hoped would strip away government interference, said Susan Ginsburg, a senior vice president of regulatory affairs for the Independent Petroleum Association of America, which represents small oil and gas companies.\nFILE PHOTO: People show their support as Donald Trump speaks in Charleston, West Virginia, U.S., May 5, 2016. REUTERS/Chris Tilley/File Photo The industry, she said, expected that “markets would be allowed to work.”\nHELP FOR COAL HURTS NATURAL GAS For the coal industry - which has seen a decade of decline amid competition from cheap natural gas - the wish-list for the Trump administration is long.\nIn the months after Trump was elected, Trump and senior cabinet members including Energy Secretary Rick Perry met with mining executives such as Murray. Other administration officials met with lobbyists for coal firms including Peabody Energy Corp, the nation’s largest miner.\nMurray handed the White House a long list of recommendations, including rescinding pollution controls, slashing the EPA’s size and ending green energy incentives.\nEmails obtained by the Sierra Club in October revealed that Peabody had also given the administration a list of proposals, including a controversial electricity pricing measure based on the argument that coal and nuclear plants improve grid reliability.\nPerry proposed in September that the Federal Energy Regulatory Commission reward coal and nuclear plants that have 90 days of fuel supply in reserve by covering their operating costs through power pricing changes. FERC is expected to decide on the request by Jan. 10.\nSlideshow (2 Images) That proposal irritated oil and gas producers, along with renewable energy firms. Both were caught off guard, said a Washington-based oil-and-gas lobbyist who spoke on condition of anonymity out of concern over offending the administration.\n“Nobody in the oil and gas industry, or in the renewables industry for that matter, was consulted,“ the lobbyist said. ”It just came out of nowhere.”\nThe American Petroleum Institute, which represents major U.S. oil and gas companies, wrote that the plan “upsets the very foundations of the competitive wholesale electricity markets.”\nMichael Steel, a spokesman for the Affordable Energy Coalition, which has oil major BP as a member, called the proposal an unfair subsidy.\n“The Department of Energy is trying to pick winners and losers in a way that will raise costs for consumers by billions of dollars,” Steel said.\n‘BROKEN PROGRAM’\nThe political dustup over biofuels policy provides another telling example of the difficulty appeasing competing industry camps.\nThe Renewable Fuel Standard was introduced under former President Geor", "external_links": [], "published": "2018-01-05T14:05:00.000+02:00", "crawled": "2018-01-05T14:31:35.003+02:00", "highlightTitle": ""}