{"organizations": [], "uuid": "4ffc6761c2203e247a000b1a91fb5b27fd335c97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-mednax-announces-acquisition-of-neonatology-practice-in-california.html", "country": "US", "domain_rank": 767, "title": "MEDNAX Announces Acquisition of Neonatology Practice in California", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T14:45:00.000+02:00", "replies_count": 0, "uuid": "4ffc6761c2203e247a000b1a91fb5b27fd335c97"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-mednax-announces-acquisition-of-neonatology-practice-in-california.html", "ord_in_thread": 0, "title": "MEDNAX Announces Acquisition of Neonatology Practice in California", "locations": [], "entities": {"persons": [{"name": "sukshma sreepathi", "sentiment": "none"}, {"name": "henry mayo", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "california fort lauderdale", "sentiment": "none"}, {"name": "mednax", "sentiment": "none"}, {"name": "van nuys", "sentiment": "none"}, {"name": "calif", "sentiment": "none"}, {"name": "mission hills", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "valencia", "sentiment": "none"}], "organizations": [{"name": "mednax announces acquisition of neonatology practice", "sentiment": "negative"}, {"name": "inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "tri-valley neonatal medical group, inc.", "sentiment": "none"}, {"name": "tri-valley neonatal medical group", "sentiment": "none"}, {"name": "valley presbyterian hospital", "sentiment": "none"}, {"name": "mednax", "sentiment": "none"}, {"name": "newhall hospital", "sentiment": "none"}, {"name": "providence holy cross medical center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT LAUDERDALE, Fla.--(BUSINESS WIRE)-- MEDNAX, Inc. (NYSE: MD), today announced the acquisition of Tri-Valley Neonatal Medical Group, Inc., a private neonatology physician practice based in Van Nuys, Calif.\nTri-Valley Neonatal Medical Group was established in 2002 and employs three full-time and one part-time neonatologists as well as one neonatal nurse practitioner. The practice provides neonatology and newborn nursery services at Valley Presbyterian Hospital in Van Nuys, Henry Mayo Newhall Hospital in Valencia, and Providence Holy Cross Medical Center in Mission Hills.\n“Partnering with the MEDNAX national network will support our continued growth and provide long-term stability in this uncertain health care environment,” said Sukshma Sreepathi, M.D., who will serve as medical director for the practice. “Additionally, MEDNAX’s extensive research, education and quality initiatives will enhance the patient care experience.”\nThis acquisition adds to the services MEDNAX provides in California through its affiliated network of physicians across multiple specialties, which include maternal-fetal medicine, neonatology, newborn hearing screens, obstetric hospitalist, pediatric cardiology, pediatric hospitalist, pediatric intensive care and radiology.\nThis was a cash transaction and it is expected to be immediately accretive to earnings. No additional terms of the transaction were disclosed.\nABOUT MEDNAX\nMEDNAX, Inc. is a national health solutions partner based in Sunrise, Fla. comprised of the nation's leading providers of physician services. Physicians and advanced practitioners practicing as part of MEDNAX are reshaping the delivery of care within their specialties and subspecialties, using evidence-based tools, continuous quality initiatives, clinical research and telemedicine to enhance patient outcomes and provide high-quality, cost-effective care. The Company was founded in 1979, and today, through its affiliated professional corporations, MEDNAX provides services through a network of approximately 4,075 physicians in all 50 states and Puerto Rico. In addition to its national physician network, MEDNAX provides services to healthcare facilities and physicians in over 40 states through two complementary businesses, consisting of a revenue cycle management company and a consulting services company. Additional information is available at www.mednax.com .\nCertain statements and information in this press release may be deemed to contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements may include, but are not limited to, statements relating to our objectives, plans and strategies, and all statements, other than statements of historical facts, that address activities, events or developments that we intend, expect, project, believe or anticipate will or may occur in the future. These statements are often characterized by terminology such as “believe”, “hope”, “may”, “anticipate”, “should”, “intend”, “plan”, “will”, “expect”, “estimate”, “project”, “positioned”, “strategy” and similar expressions, and are based on assumptions and assessments made by MEDNAX’s management in light of their experience and their perception of historical trends, current conditions, expected future developments and other factors they believe to be appropriate. Any forward-looking statements in this press release are made as of the date hereof, and MEDNAX undertakes no duty to update or revise any such statements, whether as a result of new information, future events or otherwise. Forward-looking statements are not guarantees of future performance and are subject to risks and uncertainties. Important factors that could cause actual results, developments, and business decisions to differ materially from forward-looking statements are described in MEDNAX’s most recent Annual Report on Form 10-K and its Quarterly Reports on Form 10-Q, including the sections entitled “Risk Factors”, as well MEDNAX’s current reports on Form 8-K, filed with the Securities and Exchange Commission.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110005205/en/\nMEDNAX, Inc.\nCharles Lynch, 954-384-0175 ext. 5692\nVice President, Strategy and Investor Relations\ncharles_lynch@mednax.com\nSource: MEDNAX, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180110005205/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mednax.com&esheet=51740689&newsitemid=20180110005205&lan=en-US&anchor=www.mednax.com&index=1&md5=f2bf2253739771dd0d5d373760ce486a"], "published": "2018-01-10T14:45:00.000+02:00", "crawled": "2018-01-10T16:31:44.002+02:00", "highlightTitle": ""}