{"organizations": [], "uuid": "761cb7da5f579d5aea320b35e4431f3a4ab7aedd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds-rates/update-1-euro-zone-investors-price-in-70-pct-chance-of-ecb-rate-hike-by-year-end-idUSL8N1P72AE", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Euro zone investors price in 70 pct chance of ECB rate hike by year-end", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:41:00.000+02:00", "replies_count": 0, "uuid": "761cb7da5f579d5aea320b35e4431f3a4ab7aedd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds-rates/update-1-euro-zone-investors-price-in-70-pct-chance-of-ecb-rate-hike-by-year-end-idUSL8N1P72AE", "ord_in_thread": 0, "title": "UPDATE 1-Euro zone investors price in 70 pct chance of ECB rate hike by year-end", "locations": [], "entities": {"persons": [{"name": "dhara ranasinghe", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Money markets price in 70 pct chance of ECB rate-hike\n* Up from 50 pct chance at start of week\n* ECB minutes fuel rate-hike talk (Updates with detail, comment)\nBy Dhara Ranasinghe\nLONDON, Jan 12 (Reuters) - Euro zone money markets now price in a 70 percent chance of a 10 basis point rise in interest rates from the European Central Bank by year-end, as investors ratchet up rate-hike bets in the wake of this week’s hawkish central bank minutes.\nBoth the euro and bond market borrowing costs shot higher on Thursday as the ECB signalled its 2.5 trillion euro stimulus scheme could be wound down relatively swiftly this year.\nMoney market pricing also suggests investors have bought forward their expectations for when the central bank will deliver its first rate rise since 2011.\nThe difference between the overnight bank-to-bank interest rate for the euro zone (Eonia) and forward Eonia rates dated for the ECB’s December 13, 2018, meeting is around 7 basis points, up from around 5 bps at the start of the week.\n“If you think that the ECB will move in 10 basis point increments, then that’s a 70 percent chance of rate hike by year end,” said Benjamin Schroeder, senior rates strategist at ING.\n“The minutes suggested a subtle shift in the guidance could come earlier and that was quite surprising for the market, which was expecting any ECB signalling would come in the summer.”\nThe ECB’s deposit rate is currently at minus 0.40 percent and any rise in rates early next year would could before Mario Draghi’s term as ECB president expires in October 2019.\nThe central bank should revisit its communication stance in early 2018 and gradually adjust its language to reflect improved growth prospects, the ECB’s December policy meeting minutes showed on Thursday.\nWhen the ECB said it would halve monthly bond purchases to 30 billion euros ($36 billion) from Jan. 1 but keep the scheme until Sept. 30, there was an expectation its asset buying would only be wound down gradually thereafter over a period of months.\nGiven the ECB has said rates would remain unchanged until “well past” the programme had ended once and for all, many investors had assumed interest rates would stay on hold at least until late 2019.\nBut in recent weeks, some ECB officials have suggested the asset-purchase programme could end in September - potentially bringing forward the timing of the bank’s first rate.\nThe minutes have stoked that perception at a time when markets are becoming increasingly sensitive to signs that major central banks are getting closer to unwinding stimulus.\nAfter Thursday’s ECB minutes, Eonia forward pricing suggests that the market is fully pricing in 15 bps worth of rate hikes in the first quarter of 2019, said Kim Liu, senior fixed income strategist at ABN AMRO.\n“This means that under an assumption of sequencing and net asset purchases to continue to at least September 2018, (a) that the market expects no taper and a first hike 6 months after the end of the QE programme or (b) a quick taper of say 3 months and a rate hike 3 months after the end of the tapering phase,” he said.\nReporting by Dhara Ranasinghe, Editing by Jeremy Gaunt\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T19:41:00.000+02:00", "crawled": "2018-01-12T18:26:46.039+02:00", "highlightTitle": ""}