{"organizations": [], "uuid": "2f04f1205a81cd852ee2064f36a24187d5c06f45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/03/26/102537884-lima-peru.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/14/strong-7-point-1-magnitude-earthquake-in-peru-leaves-two-dead-17-missing.html", "country": "US", "domain_rank": 767, "title": "Strong 7.1-magnitude earthquake in Peru leaves two dead, 17 missing", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.697, "site_type": "news", "published": "2018-01-14T18:08:00.000+02:00", "replies_count": 0, "uuid": "2f04f1205a81cd852ee2064f36a24187d5c06f45"}, "author": "", "url": "https://www.cnbc.com/2018/01/14/strong-7-point-1-magnitude-earthquake-in-peru-leaves-two-dead-17-missing.html", "ord_in_thread": 0, "title": "Strong 7.1-magnitude earthquake in Peru leaves two dead, 17 missing", "locations": [], "entities": {"persons": [{"name": "yamila osorio", "sentiment": "none"}, {"name": "jorge chavez", "sentiment": "none"}], "locations": [{"name": "peru", "sentiment": "none"}, {"name": "acari", "sentiment": "none"}, {"name": "pacific ocean", "sentiment": "none"}, {"name": "bella union", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "yauca", "sentiment": "none"}], "organizations": [{"name": "published updated moments ago reuters", "sentiment": "none"}, {"name": "rpp", "sentiment": "none"}, {"name": "arequipa", "sentiment": "none"}, {"name": "civil defense institute", "sentiment": "none"}, {"name": "u.s. geological survey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A strong magnitude 7.1 earthquake struck the coast of southern Peru on Sunday morning, leaving two dead, 17 missing and several dozen injured, while causing homes and roads to collapse.\nThe quake hit offshore at 4:18 a.m. local time at a depth of around 36 km (22.4 miles), the U.S. Geological Survey said. Its epicenter was in the Pacific Ocean 40 km from the town of Acari.\nArequipa Governor Yamila Osorio said on Twitter that one 55-year old man died in the town of Yauca after being crushed by rock. Jorge Chavez, chief of Peru's Civil Defense Institute (INDECI), told local radio station RPP that a second death was reported in the town of Bella Union.\nINDECI said on Twitter that 65 people were injured.\n\"There are several homes affected and it is possible that the count of victims and injured will rise,\" Chavez said.\nPeru's health minister said 17 people were missing after an informal mine east of the coastal city of Chala collapsed following the quake.\nSeveral municipalities were without electricity, and many roads and adobe houses had collapsed, Osorio said. Many residents of Lomas, a coastal town, were evacuated after feeling an aftershock, she said.\nEarthquakes are common in Peru, but many homes are built with precarious materials that cannot withstand them.\nIn 2007 an earthquake killed hundreds in the region of Ica.\nPeruvian maritime authorities said the quake did not produce a tsunami on the Peruvian coast.\nPeru is the world's number 2 copper producer, although many of the mines in the south are located far inland from the coastal region where the quake struck. A representative of Southern Copper Corp said there were no reports of damage at its Cuajone and Toquepala mines in the regions of Moguegua and Tacna.\nJesus Revilla, a union leader at the Cerro Verde copper mine in Arequipa, said there were no reports that operations had been affected.\nThe quake was also felt in northern Chile , Peru's southern neighbor. Chile's National Emergency offices said there were no reports of injuries, damage to infrastructure, or interruption of basic services. Chile's navy said the quake did not meet the conditions that would produce a tsunami off its coast.", "external_links": [], "published": "2018-01-14T18:08:00.000+02:00", "crawled": "2018-01-14T18:09:12.021+02:00", "highlightTitle": ""}