{"organizations": [], "uuid": "048264d7f9c0f1c69d6f1d372a1e8d2d05f4f0fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104959507-147577_8346.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/shark-tank-kevin-oleary-invests-150000-in-rounderbum.html", "country": "US", "domain_rank": 767, "title": "'Shark Tank': Kevin O'Leary invests $150,000 in Rounderbum", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-22T21:40:00.000+02:00", "replies_count": 0, "uuid": "048264d7f9c0f1c69d6f1d372a1e8d2d05f4f0fa"}, "author": "Ali Montag", "url": "https://www.cnbc.com/2018/01/22/shark-tank-kevin-oleary-invests-150000-in-rounderbum.html", "ord_in_thread": 0, "title": "'Shark Tank': Kevin O'Leary invests $150,000 in Rounderbum", "locations": [], "entities": {"persons": [{"name": "jonathan diersing", "sentiment": "negative"}, {"name": "rounderbum eddy chen", "sentiment": "negative"}, {"name": "kevin o'leary", "sentiment": "negative"}, {"name": "diersing", "sentiment": "none"}], "locations": [{"name": "southern california", "sentiment": "none"}], "organizations": [{"name": "abc", "sentiment": "negative"}, {"name": "shark tank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When Jonathan Diersing was studying neuroscience at the University of Southern California, he didn't expect his career to veer in the direction it did.\nInstead of becoming a doctor, Diersing found himself creating and selling padded undergarments for men — apparel ranging from briefs to t-shirts — to help men feel more confident in their clothes.\nIt's working out pretty well so far: He expects his company, called Rounderbum, to do $1 million in sales for 2018, he explains while pitching investors on ABC's \" Shark Tank \" on Sunday.\n\"Everybody appreciates the way they look, and everybody wants to look better,\" Diersing says on the show. \"Not everybody has the time to go to the gym.\" Diersing came on \"Shark Tank\" seeking an investment of $150,000 in exchange for 10 percent equity in his business.\nAs a young person, Diersing was inspired to study medicine by his mother.\n\"My mom has multiple sclerosis, and I went to school trying to figure out if I wanted to be a doctor to help her,\" Diersing explains. He says he soon began to question the choice, \"but I couldn't afford to change my major because I paid for school myself.\n\"So I just finished it, and then after school I just started hustling,\" Diersing explains. \"Started sales jobs, and then this was something I was doing at the same time.\"\nHe launched Rounderbum in 2015, only selling online. From May of 2015 until the time of taping, the business has done over $1 million in sales, Diersing says, with $700,000 in the previous 12 months.\nTweet\nOn Rounderbum's website, a pair of briefs ranges in price from $20 to $29. A padded muscle shirt sells for $49. The padding is designed to be seamless and feel real to the touch.\nTo demonstrate his product, Diersing had two identical twin male models show what clothing looked like with Rounderbum products on underneath, and without. (It's a trick that now-billionaire Sara Blakely used to launch Spanx .)\n\"You can really tell the difference!\" investor Robert Herjavec remarked.\nEddy Chen | ABC Shark Tank Episode 917 Herjavec offered to invest $150,000 for 20 percent of the business, an offer Kevin O'Leary declared, \"greedy and savage.\"\nFor Mark Cuban, Rounderbumb wasn't a product he could, well, personally relate to: \"I've got to believe in a product — I go commando,\" Cuban revealed. \"I'm out.\"\nO'Leary made an offer to invest $150,000 for a 5 percent stake in the business, plus O'Leary would collect $300,000 via royalty payments of $2 per unit sold.\n\"That's a dollar for each cheek,\" says O'Leary.\nTweet\nDiersing accepted O'Leary's offer, to some lighthearted ribbing from the other sharks.\n\"I've never heard a deal here being negotiated in cheeks,\" Daymond John laughs. Cuban added, \"Your name is no longer Mr. Wonderful, its 'Cheeks.'\"\nLori Greiner chimed in, \"Mr. Cheeks to you!\"\nTweet\nDon't miss: Why Barbara Corcoran invested $50,000 in a new kind of fidget spinner on 'Shark Tank'\nLike this story? Like CNBC Make It on Facebook !\nDisclaimer: CNBC owns the exclusive off-network cable rights to \"Shark Tank.\"\nshow chapters How to get on 'Shark Tank,' according to those who have been there 12:50 PM ET Fri, 17 March 2017 | 00:50", "external_links": [], "published": "2018-01-22T21:40:00.000+02:00", "crawled": "2018-01-22T21:40:43.014+02:00", "highlightTitle": ""}