{"organizations": [], "uuid": "331bf81f37f4338a2d98fb3bbeb711492e3494cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://static2.businessinsider.com/image/5a578faaa75e2055138b4c61-1190-625/nintendo-just-had-its-best-q3-in-8-years-thanks-to-the-switch.jpg", "site_section": "", "section_title": "", "url": "https://www.reuters.com/article/us-nintendo-results/steered-by-switch-nintendo-posts-best-third-quarter-in-eight-years-ups-outlook-idUSKBN1FK0PW", "country": "US", "domain_rank": 408, "title": "Nintendo just had its best Q3 in 8 years thanks to the Switch - Business Insider", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.216, "site_type": "news", "published": "2018-01-31T02:00:00.000+02:00", "replies_count": 0, "uuid": "331bf81f37f4338a2d98fb3bbeb711492e3494cd"}, "author": "Makiko Yamazaki", "url": "https://www.reuters.com/article/us-nintendo-results/steered-by-switch-nintendo-posts-best-third-quarter-in-eight-years-ups-outlook-idUSKBN1FK0PW", "ord_in_thread": 0, "title": "Nintendo just had its best Q3 in 8 years thanks to the Switch - Business Insider", "locations": [], "entities": {"persons": [{"name": "kim kyung", "sentiment": "positive"}, {"name": "tatsumi kimishima", "sentiment": "negative"}, {"name": "wii u", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nintendo", "sentiment": "negative"}, {"name": "nintendo co ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nintendo's president, Tatsumi Kimishima. Kim Kyung Hoon/Reuters The Nintendo Switch is a massive hit, helping Nintendo post its best Q3 results in eight years. Nintendo posted an operating profit of 116.50 billion yen ($1.07 billion/£756 million) for the third quarter, up almost four-fold year-on-year. Smartphone gaming is producing lacklustre results, however. \nJapanese video games maker Nintendo Co Ltd reported its biggest third-quarter operating profit in eight years, driven by smashing demand for its new Switch games console, and said it now expects annual earnings to outstrip its previous estimate. \nGrowing popularity of the hybrid home-portable Switch has led to a near-doubling of Nintendo's stock price to nine-year highs since the device's launch in March last year. Sales have far exceeded initial estimates, beating those of predecessor Wii U, and leaving suppliers scrambling for parts. \nNintendo posted an operating profit of 116.50 billion yen ($1.07 billion/£756 million) for the third quarter, up almost four-fold from 32.26 billion yen a year ago. This is the highest ever that the company has earned in the October-December period since 2009. \nThat blew past a consensus estimate of around 67 billion yen from six analysts polled by Thomson Reuters I/B/E/S. \nThe Kyoto-based company raised its profit forecast for the year ending March to 160 billion yen ($1.47 billion/£1.03 billion), from 120 billion yen ($1.1 billion/£777 million), versus analysts' estimate of around 144 billion yen ($1.32 billion/£932 million). \n\"Switch sales during the holiday season were stronger than expected in Japan, the United States and Europe,\" Nintendo President Tatsumi Kimishima said at an earnings briefing. \nNintendo sold 7.2 million Switch consoles in the three months through December and raised its annual sales forecast to 15 million units from 14 million units. That already exceeds lifetime sales of 13.56 million consoles for the Wii U that was on the market for about five years. \nThe company expects Switch console sales to further rise to 20 million units or more next year starting April. \nHaving started by making playing cards in the late 19th century, Nintendo now relies heavily on Switch to drive its earnings. It is, however, looking to diversify its revenue sources by moving into new areas such as smartphone gaming and theme parks with its roster of popular characters. Smartphone gaming producing lacklustre results \nBut its efforts in smartphone gaming have produced lacklustre results. The company has released four smartphone titles over the last two years, but recently decided to ditch the first one, a social networking service-style application called Miitomo, due to sluggish demand. \nPokemon GO was a phenomenal success, but Nintendo receives profits only through an affiliate which developed the game with a Google spinoff. \nAs yet another attempt to diversify, Nintendo said this month it would launch in April \"Labo,\" a set of LEGO-style accessories for the Switch console that kids can build themselves on cardboard sheets. \nWhile most analysts see no major earnings impact from the accessories, which range from a fishing rod, piano keyboard to a robot suit, many point to their potential for bringing in younger audience to the Switch. \n\"This is exactly the kind of crazy idea that Nintendo is known for which we believe will help expand the company's audience,\" analysts at Macquarie wrote in a recent research note. It will be \"appealing to younger audience which has not been addressed by Nintendo for some time.\" ", "external_links": [], "published": "2018-01-31T02:00:00.000+02:00", "crawled": "2018-01-31T13:34:40.010+02:00", "highlightTitle": ""}