{"organizations": [], "uuid": "5fcd7880dc4c735bcd54acd366b5691e10e457f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-nigeria-security/nigerian-air-force-killed-dozens-in-attacks-on-villages-amnesty-idUSKBN1FJ00C", "country": "US", "domain_rank": 408, "title": "Nigerian air force killed dozens in attacks on villages: Amnesty", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T02:04:00.000+02:00", "replies_count": 0, "uuid": "5fcd7880dc4c735bcd54acd366b5691e10e457f4"}, "author": "", "url": "https://www.reuters.com/article/us-nigeria-security/nigerian-air-force-killed-dozens-in-attacks-on-villages-amnesty-idUSKBN1FJ00C", "ord_in_thread": 0, "title": "Nigerian air force killed dozens in attacks on villages: Amnesty", "locations": [], "entities": {"persons": [{"name": "osai ojigho", "sentiment": "none"}], "locations": [{"name": "nigeria", "sentiment": "none"}, {"name": "adamawa", "sentiment": "none"}], "organizations": [{"name": "amnesty paul carsten", "sentiment": "none"}, {"name": "amnesty", "sentiment": "none"}, {"name": "amnesty international", "sentiment": "none"}, {"name": "min read  abuja", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ABUJA (Reuters) - Nigeria’s air force killed at least 35 people in attacks on villages in the northeastern state of Adamawa in December, Amnesty International said in a report on Tuesday.\nResidents of the villages described being fired upon by a fighter jet and military helicopter as they attempted to flee, at the same time as hundreds of herdsmen took part in a revenge attack on the communities for earlier killings, Amnesty said.\n“Launching air raids is not a legitimate law enforcement method by anyone’s standard,” said Osai Ojigho, Amnesty’s country director for Nigeria, in Tuesday’s report.\n“Such reckless use of deadly force is unlawful, outrageous and lays bare the Nigerian military’s shocking disregard for the lives of those it supposedly exists to protect,” she said.\nThe report is the latest challenge to the military on human rights and the attacks suggest a deadly crisis between herders and farmers is spiraling out of government control.\nReports of abuses and military excesses rarely result in Nigeria’s military meting out public discipline to officers.\nAir Force spokesman Olatokunbo Adesanya denied it had bombed any locations in the region or fired shots targeting people, saying it had opened fire to dissuade looters and vandals. Adesanya said he was unaware of any human casualties.\nOn Dec. 4, air force fighter jets fired rockets at villages to deter communal clashes as a cycle of violence and revenge attacks gripped Adamawa state, Amnesty said.\nA general view shows the damage in Lawaru village, after herdsmen and Nigeria’s air force attacked the village on December 4 in Adamawa state, Nigeria December 21, 2017. Picture taken December 21, 2017. Amnesty International/Handout via REUTERS The region is a flashpoint for violence between Muslim herders and Christian farmers over rights to grazing land and agriculture. This month at least 168 people have died across five states in such clashes, said Amnesty.\n“The helicopter and the jet started releasing bombs. Houses started burning. Children started running for their lives,” an unnamed farmer from the village of Shafaron told Amnesty.\nSlideshow (2 Images) The report described the “devastating cumulative effect of the herders and Air Force attacks, with at least eight villages heavily damaged or completely destroyed by fire.”\nBurned husks of vehicles and blackened houses reduced in parts to rubble were shown in an accompanying video from Amnesty. Satellite images depicted large swathes of settlements ravaged by fire.\nEighty-six people died, with the Nigerian air force responsible for at least 35 deaths, and some 3,000 homes were destroyed in the five villages visited, said Amnesty.\nNigeria is in the final stages of buying fighter planes from the United States, a deal halted by former president Barack Obama’s administration over concerns about the military’s human rights record.\nPresident Donald Trump’s administration approved the sale. That came after as many as 170 people died last January after Nigeria’s air force bombed a refugee camp.\nNigeria’s military receives regular training from the United States and Britain.\nAdditional reporting by Camillus Eboh; Editing by Matthew Mpoke Bigg\n ", "external_links": [], "published": "2018-01-30T02:04:00.000+02:00", "crawled": "2018-01-30T02:16:29.009+02:00", "highlightTitle": ""}