{"organizations": [], "uuid": "7014754f08a04e0c068623d9708c408355fe956e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 44, "shares": 44, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews/", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-lebanon-cyber/lebanon-spy-agency-targets-smartphone-users-worldwide-researchers-say-idUSKBN1F726S", "country": "US", "domain_rank": 408, "title": "Lebanon spy agency targets smartphone users worldwide, researchers say", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:50:00.000+02:00", "replies_count": 0, "uuid": "7014754f08a04e0c068623d9708c408355fe956e"}, "author": "", "url": "https://www.reuters.com/article/us-lebanon-cyber/lebanon-spy-agency-targets-smartphone-users-worldwide-researchers-say-idUSKBN1F726S", "ord_in_thread": 0, "title": "Lebanon spy agency targets smartphone users worldwide, researchers say", "locations": [], "entities": {"persons": [{"name": "eric auchard", "sentiment": "none"}], "locations": [{"name": "lebanon", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "general directorate of general security", "sentiment": "none"}, {"name": "min read  frankfurt", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "eff", "sentiment": "none"}, {"name": "electronic frontier foundation", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 3:51 PM / in 17 minutes Lebanese security agency turns smartphone into selfie spycam: researchers Eric Auchard 5 Min Read \nFRANKFURT (Reuters) - Lebanon’s intelligence service may have turned the smartphones of thousands of targeted individuals into cyber-spying machines in one of the first known examples of large-scale state hacking of phones rather than computers, researchers say. \nLebanon’s General Directorate of General Security (GDGS) has run more than 10 campaigns since at least 2012 aimed mainly at Android phone users in at least 21 countries, according to a report by mobile security firm Lookout and digital rights group Electronic Frontier Foundation (EFF). \nThe cyber attacks, which seized control of Android smartphones, allowed the hackers to turn them into victim-monitoring devices and steal any data from them undetected, the researchers said on Thursday. No evidence was found that Apple phone users were targeted, something that may simply reflect the popularity of Android in the Middle East. \nThe state-backed hackers, dubbed “Dark Caracal” by the report’s authors - after a wild cat native to the Middle East - used phishing attacks and other tricks to lure victims into downloading fake versions of encrypted messaging apps, giving the attackers full control over the devices of unwitting users. \nMichael Flossman, the group’s lead security researcher, told Reuters that EFF and Lookout took advantage of the Lebanon cyber spying group’s failure to secure their own command and control servers, creating an opening to connect them back to the GDGS. \n“Looking at the servers, who had registered it when, in conjunction with being able to identify the stolen content of victims: That gave us a pretty good indication of how long they had been operating,” Flossman said in a phone interview. \nDark Caracal has focused their attacks on government officials, military targets, utilities, financial institutions, manufacturing companies, and defense contractors, according to the report. \nThe researchers found technical evidence linking servers used to control the attacks to a GDGS office in Beirut by locating wi-fi networks and internet protocol address in or near the building. They cannot say for sure whether the evidence proves GDGS is responsible or is the work of a rogue employee. \nThe malware, once installed, could do things like remotely take photos with front or back camera and silently activate the phone’s microphone to record conservations, researchers said. \nResponding to a question from Reuters about the claims made in the report, Major General Abbas Ibrahim, director general of GDGS, said he wanted to see the report before commenting on its contents. He added: “General Security does not have these type of capabilities. We wish we had these capabilities.” \nIbrahim was speaking ahead of the report’s publication. FLYING BENEATH THE RADAR \nThe EFF/Lookout team said they uncovered spy tools and a massive trove of hundreds of gigabytes of data stolen from the phones of thousands of victims that included text messages, contacts, encrypted conversations, documents, audio and photos. \nTargets were located mainly in Lebanon and the surrounding region, including Syria and Saudi Arabia, but not Iran or Israel, two frequent targets of government cyber spy attacks. Victims also lived in five European countries, Russia, the United States, China, Vietnam and South Korea, researchers said. \nThe researchers notified Google, the developer of the Android operating system, late in 2017. Google worked closely with the researchers to identify the apps associated with this attack, none of which were available on the Google Play Store for Android phone users, a company spokesman said. \nGoogle Play Protect, the internet company’s unified security system that runs on many Android smartphones, has been updated to protect users from these malicious apps and is in the process of removing them from any affected phones, the spokesman said. \nThe attackers borrowed code to create their own malicious software from developer sites, while relying heavily on social engineering to trick people to click on links that sent them to a site called SecureAndroid, a fake Android app store. \nThere, users were encouraged to download fake, but fully functioning versions of encrypted messaging apps and privacy tools including WhatsApp, Viber and Signal, that Flossman said promised victims secure software “better than the original”. \nLookout found links between the Lebanon-linked attacks and ones tied to the Kazakh government in Central Asia in 2016 in a report called “Operation Manual” by EFF and other experts. The two research groups agreed to team up and now believe the Kazakh group was a customer of the Lebanon-based hackers. Reporting by Eric Auchard in Frankfurt with additional reporting by Laila Bassam in Beirut; Editing by Mark Heinrich", "external_links": [], "published": "2018-01-18T17:50:00.000+02:00", "crawled": "2018-01-18T18:06:53.004+02:00", "highlightTitle": ""}