{"organizations": [], "uuid": "0773bb8647126f45242cd8380b41bb4e44880322", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/17/the-associated-press-doe-staffer-claims-retaliation-over-photos-of-secret-meeting.html", "country": "US", "domain_rank": 767, "title": "DOE staffer claims retaliation over photos of secret meeting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T01:47:00.000+02:00", "replies_count": 0, "uuid": "0773bb8647126f45242cd8380b41bb4e44880322"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/17/the-associated-press-doe-staffer-claims-retaliation-over-photos-of-secret-meeting.html", "ord_in_thread": 0, "title": "DOE staffer claims retaliation over photos of secret meeting", "locations": [], "entities": {"persons": [{"name": "edelman", "sentiment": "none"}, {"name": "perry", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "simon edelman", "sentiment": "none"}, {"name": "andrew wheeler", "sentiment": "none"}, {"name": "rick perry", "sentiment": "none"}, {"name": "murray", "sentiment": "none"}, {"name": "robert \"bob", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "department of energy", "sentiment": "negative"}, {"name": "doe", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "associated press", "sentiment": "none"}, {"name": "environmental protection agency", "sentiment": "none"}, {"name": "murray energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — A former photographer at the Department of Energy says he lost his job in retaliation for making public photos of a meeting between Secretary Rick Perry and a coal baron peddling a wish list of policy initiatives that would directly benefit his company.\nSimon Edelman has filed a federal whistleblower complaint alleging he was terminated from the agency after he provided the photos to two media outlets that published them in December. Edelman was at the March 29, 2017, meeting snapping shots as Robert \"Bob\" Murray handed Perry a four-page \"action plan\" to revive the nation's struggling coal industry. Murray is chairman and CEO of Ohio-based Murray Energy, one of the nation's largest coal producers.\nAlso attending the meeting were Perry's chief of staff and Andrew Wheeler, a coal company lobbyist later nominated by President Donald Trump to serve as the second-highest ranking official at the Environmental Protection Agency.\nCopies of the plan were obtained earlier this month by The Associated Press and other media outlets. A review of the plan shows many of the proposals provided by the major GOP political donor were later advanced by the Trump administration.\nEdelman and his lawyer, John Tye, are seeking a formal Justice Department investigation into what they allege was corrupt conduct by a public official. Edelman also filed a complaint with Energy's inspector general and a Senate oversight committee.\nIn an interview with The Associated Press on Wednesday, Edelman said he listened in as Murray detailed the actions he wanted the Trump administration to take. They included replacing members of the Federal Energy Regulatory Commission, pulling the United States out of the Paris climate accords and revoking the Clean Power Plan, former President Barack Obama's signature effort to limit planet-warming emissions from coal-fired power plants.\nEdelman said he heard Perry respond, \"I think we can help you on this.\"\nEnergy Department spokeswoman Shaylyn Hynes denied anything improper occurred during the meeting.\n\"The assertions that this individual has made about Secretary Perry and the Department of Energy are ridiculous,\" Hynes said Wednesday. \"Industry and other stakeholders visit the Department of Energy on a daily basis. The secretary welcomes their input and feedback to strengthen the American energy sector.\"\nHynes did not address Edelman's claims of retaliation.\nGary Broadbent, a spokesman for Murray, said the coal company CEO does not have a recollection of the exact statements he might have made in the meeting, which occurred nearly a year ago.\n\"Mr. Murray has frequently said that the Trump administration must advance reliable and low-cost electricity for all Americans and protect coal mining jobs,\" Broadbent said. \"We applaud the actions taken by President Trump's administration, to date, to protect these jobs and to advance the energy security of the United States.\"\nRecords show Murray Energy contributed $300,000 to Trump's inaugural committee and has financially backed the campaigns of Perry, a former Texas governor and presidential candidate.\nThe AP reported last year that Murray had asked the Trump administration to issue an emergency order protecting coal-fired power plants from closing. Murray warned that failure to act could cause thousands of coal miners to be laid off and force his largest customer, Ohio-based FirstEnergy Solutions, into bankruptcy.\nPerry ultimately rejected Murray's specific request, but later asked FERC to boost coal and nuclear plants by subsidizing their continued operation. The Republican-controlled commission voted unanimously earlier this month to reject Perry's claim that further retirements of coal-fired power plants pose a threat to reliability of the nation's electric grid.\nEdelman said he was placed on administrative leave and subsequently dismissed from the agency in December after the photos of the meeting were published by In These Times, a left-leaning news site. He said he was escorted by the building by security and said some of his personal property was seized, including a laptop computer, photo equipment and three external hard drives. Edelman is demanding the return of his property as part of his complaint.\nThe photographer said he was motivated to make the photos public after seeing a published interview where he believes Murray misrepresented what occurred in the March meeting. Edelman said the free market should determine which sources of energy are profitable, not government regulations favoring a specific industry or company.\nThe photos were not classified and he believes he had a First Amendment right to release them.\n\"They're angry at me, but I didn't do anything wrong,\" Edelman said. \"The Department of Energy are the ones breaking the law. And they kept all my stuff.\"\nFollow AP environmental writer Michael Biesecker at http://twitter.com/mbieseck", "external_links": [], "published": "2018-01-18T01:47:00.000+02:00", "crawled": "2018-01-18T02:47:52.008+02:00", "highlightTitle": ""}