{"organizations": [], "uuid": "7372901dc0293b370a418f2e98ca413313e8bb79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF155_3iAeY_TOP_20180129064848.jpg", "site_section": "https://www.wsj.com/news/markets", "section_title": "Stock Market &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/fitch-looks-to-go-solo-in-china-after-exiting-joint-venture-1517227629", "country": "US", "domain_rank": 387, "title": "Fitch Looks to Go Solo in China After Exiting Joint Venture", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:07:00.000+02:00", "replies_count": 0, "uuid": "7372901dc0293b370a418f2e98ca413313e8bb79"}, "author": "Shen Hong", "url": "https://www.wsj.com/articles/fitch-looks-to-go-solo-in-china-after-exiting-joint-venture-1517227629", "ord_in_thread": 0, "title": "Fitch Looks to Go Solo in China After Exiting Joint Venture", "locations": [], "entities": {"persons": [{"name": "jour", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "fitch", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "gic", "sentiment": "none"}, {"name": "lianhe credit information service co.", "sentiment": "none"}, {"name": "china lianhe credit rating co.", "sentiment": "none"}, {"name": "fitch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS SHANGHAI—Fitch Ratings is poised to become the first of the world’s major bond-rating firms to operate independently in China, after it said Monday it plans to exit its current Chinese joint venture.\nFitch said it has sold its 49% stake in China Lianhe Credit Rating Co. to GIC, Singapore’s sovereign wealth fund, for an undisclosed sum.\nThe sale, which ended an 11-year-old marriage between Fitch and its local partner Lianhe Credit Information Service Co., marks the first substantial shift since Beijing pledged to open up its ratings sector to outsiders in a trade deal struck with Washington in May.\nShortly after President Donald Trump’s visit to Beijing in November, China took a further step in opening up its financial sector, announcing a relaxation of restrictions on foreign ownership in the securities and banking sectors.\nFitch is now preparing to apply for a license from Chinese regulators to operate independently in the country, although the process depends on the release of relevant guidelines from Beijing, two people familiar with the matter told The Wall Street Journal.\n“The changes in the regulatory landscape [in China] provide an opportunity for us to consider and evaluate how we can best serve the needs of local and global capital markets going forward,” said a Fitch spokesperson.\nThe world’s top three credit-rating firms have long coveted China’s $11.7 trillion bond market, although they have had a volatile relationship with Beijing. That relationship soured last year after both Moody’s Investor Service and S&P Global Ratings lowered their view on China’s sovereign debt last year , citing concerns about a swelling debt pile.\nDowngrades Shadow Moody’s, S&P’s Push Into China The downgrades last year initially drew a hostile response from China’s government and at one point even cast doubts on the rating firms’ future prospects in the country.\n“I think the authorities do want the likes of Fitch to come here and help foster a healthier credit culture, but the precise lack of such a culture at the moment means it will be a tough journey for them down the road,” said Qu Qing, chief fixed income analyst at Hua Chuang Securities.\nOne of the biggest challenges for Fitch in China is how it will adjust to a market where most bond issuers—which pay for credit ratings— are used to lofty grades from local assessors .\nAmong the 4,599 corporate bond issuers in China, 4,025 or 88% have a domestic credit rating of AA or higher, grades that Moody’s, S&P and Fitch reserve for only the safest and most financially-sound companies.\nThe same Chinese issuer often carries a more lenient rating from a local assessor than from the three international firms.\nFor example, Zoomlion Heavy Industry Science & Technology Co. , a heavy equipment maker from central Hunan province, is rated AAA by Fitch’s former joint venture Lianhe Credit Rating, compared with B-minus by Fitch itself.\n“A local issuer will say: Why should I pay you a lot more money and get a lower rating when I could easily get a much cheaper and fancier one from the domestic rating firms,” Hua Chuang’s Mr. Qu said.\nTo solve the problem, Fitch is mulling replicating in China its practice in countries like India and Korea, markets where it has a different rating system that caters to the local markets only, said one of the people familiar with the matter.\n“It would be good if Fitch can do that in China because otherwise it could cause enormous confusion among investors and issuers,” said Wang Ming, chief operating officer at Shanghai Yaozhi Asset Management Co.\nAfter going solo, Fitch may find it easier to retain or attract clients such as China’s big state-owned companies and more established private firms, Mr. Wang said. “But it will be a different story for the smaller, riskier companies.”\n—Manju Dalal contributed to this article.", "external_links": [], "published": "2018-01-29T15:07:00.000+02:00", "crawled": "2018-01-29T15:56:59.003+02:00", "highlightTitle": ""}