{"organizations": [], "uuid": "fab6630aa8abfd054110846c8f331b6374755b6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-jordan-border/remote-camp-on-jordan-syria-border-getting-u-n-aid-by-crane-lift-idUKKBN1EX20B", "country": "US", "domain_rank": 408, "title": "Remote camp on Jordan-Syria border getting U.N. aid by crane lift", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:10:00.000+02:00", "replies_count": 0, "uuid": "fab6630aa8abfd054110846c8f331b6374755b6b"}, "author": "", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-jordan-border/remote-camp-on-jordan-syria-border-getting-u-n-aid-by-crane-lift-idUKKBN1EX20B", "ord_in_thread": 0, "title": "Remote camp on Jordan-Syria border getting U.N. aid by crane lift", "locations": [], "entities": {"persons": [{"name": "suleiman al-khalidi", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}], "locations": [{"name": "jordan-syria", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "u.n.", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}, {"name": "foreign ministry", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "min read  amman", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 6:14 PM / Updated 32 minutes ago Remote camp on Jordan-Syria border getting U.N. aid by crane lift Suleiman Al-Khalidi 3 Min Read \nAMMAN (Reuters) - United Nations agencies began on Monday delivering aid for the first time in six months to some 60,000 Syrian refugees stranded in a desolate area near where Syria’s border meets the Jordanian and Iraqi frontiers, aid agencies and Jordanian officials said. \nForeign Ministry sources said Jordan had agreed with U.N. agencies to allow a one-off aid delivery after receiving assurances all future provisions would come from U.N. stores inside Syria. \nThe aid was dropped onto Syrian soil using a crane based on the Jordanian side of the frontier, the absence of direct contact signalling Jordan bears no responsibility for the camp. \nThe kingdom suspended regular aid deliveries to the camp after an Islamic State suicide bomber in June 2016 drove an explosive-laden car from the Syrian side and rammed it into a Jordanian military border post, killing seven guards. \nThe delivery of food and other items covers the needs of around 10,000 households in the makeshift Rubkan camp, where conditions are described as desperate, a senior U.N. source involved in the operation told Reuters. The operation would take a few days to complete. \nRukban lies within a 55 km so-called deconfliction zone set by the U.S. Pentagon designed to ensure the safety of a U.S. garrison near the Syrian town of Tanf close to the Iraqi-Syrian border. \nJordan’s Foreign Minister Ayman Safadi said recently the country, already burdened with hundreds of thousands of refugees fleeing war-torn Syria, could not be made responsible for delivering aid to the camp. \n“This is a Syrian international problem and not Jordanian. The inhabitants of the area are Syrians present on Syrian territory and the U.N. can meet their demands from inside Syria,” Safadi said. \nThe kingdom wants the U.N. and global powers to put pressure on Damascus to give the written authorizations needed to allow supplies into Rukban, where the eastern border area leading to the camp is now in government hands. \n“The only impediment now to supplies being delivered is the Syrian regime and pressure should be applied on it to help its own people,” a Jordanian diplomatic official who asked not to be named told Reuters. \nWashington also assured Amman conditions on the ground were no obstruction to delivery of aid into the “deconfliction” zone from Syria with Russian consent. \nIn the last two years tens of thousands of people seeking shelter in the camp had fled Russian and coalition airstrikes against former Islamic State-held areas in central and eastern Syria. They trekked south across the desert to the Jordanian border, according to U.N. aid workers. \nKing Abdullah had said there were militants among them and Jordan refused to allow them to enter on security grounds. Reporting by Suleiman Al-Khalidi; editing by Ralph Boulton", "external_links": [], "published": "2018-01-08T20:10:00.000+02:00", "crawled": "2018-01-08T20:33:40.010+02:00", "highlightTitle": ""}