{"organizations": [], "uuid": "c7180dbd0582cd106a121ff6c739d07ac0c14a65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 26, "shares": 26, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940779-SG-011118-HouseBitcoin-03.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/why-this-homeowner-will-accept-bitcoin-for-his-45-million-mansion.html", "country": "US", "domain_rank": 767, "title": "Why this homeowner will accept bitcoin for his $45 million mansion", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.686, "site_type": "news", "published": "2018-01-11T16:50:00.000+02:00", "replies_count": 0, "uuid": "c7180dbd0582cd106a121ff6c739d07ac0c14a65"}, "author": "Diana Olick", "url": "https://www.cnbc.com/2018/01/11/why-this-homeowner-will-accept-bitcoin-for-his-45-million-mansion.html", "ord_in_thread": 0, "title": "Why this homeowner will accept bitcoin for his $45 million mansion", "locations": [], "entities": {"persons": [{"name": "wei tzuoh chen", "sentiment": "none"}, {"name": "ed niles", "sentiment": "none"}, {"name": "chen", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "malibu", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "REITs Why this homeowner will accept bitcoin for his $45 million mansion The seller of a 9,000-square-foot Malibu, California, home is willing to accept bitcoin as part of the payment. Buying up brick-and-mortar real estate might take some of the volatility out of a cryptocurrency investment. \"I'm not saying it's safe,\" the seller said. \"I'm just willing to take the risk for investment.\" 4 Hours Ago | 01:39 \nDr. Wei Tzuoh Chen is putting his 9,000-square-foot beachfront Malibu home on the market for $45 million. \nIt's a stunning masterpiece, designed by architect Ed Niles, unlike any other house on the ultra-luxurious strip of California beach. Angles jut out in every direction, most of the walls are windows, and a catwalk crosses the two-story entry foyer connecting the upstairs bedrooms. \nPerhaps most unusal, Chen is willing to accept bitcoin as part of the payment from a buyer. \nThe kidney specialist, who has lived in the United States since the 1970s, says he is fascinated with cryptocurrencies and considers them to be just as legitimate as a dollar, pound or yen. \n\"I've been interested since it started, and I'm always watching what's going on,\" said Chen. \"It's going to be the future. It just depends which one is going to be stabilized in the current market. \nDo his neighbors think he's crazy? CNBC Dr. Wei Tzuoh Chen \n\"Oh yes!\" he laughed. \nChen, who says he has already invested in cryptocurrencies, said he believes banks are on the verge of buying in, which would give more support to the cryptomarket. That, in turn, could push values even higher. \nChen is also quite pragmatic about the benefits of accepting a currency that is largely unregulated. \n\"According to current situation, if you buy the property with cryptocurrency, it's difficult to identify the cost of the real estate because it fluctuates so much,\" he said. \"The government will have a hard time to tax or put a property value on the house you are going to sell.\" \"I'm not saying it's safe. I'm just willing to take the risk for investment. Just like everybody else.\" -Dr. Wei Tzuoh Chen, Malibu home seller \nAnd that opens up the potential buyer market for his home. There may not be a ton of $45 million buyers, but there are more now than there were even a year ago, thanks to cryptocurrencies. \nNew millionaires are now looking for ways to take some of the volatility out of their cryptogains, and brick-and-mortar real estate is the perfect way. CNBC \n\"The majority of bitcoin purchasers are outside of this country,\" Chen said. \"And for this type of house and this amount, I think we'll attract more international buyers than from our country.\" \nChen said if he does get bitcoin in the sale, he will keep some of it and change some for dollars. Given the volatility of bitcoin, he could gain or lose money within days, essentially getting more or less for his home than he intended. \nAnd that's why he only wants part of the payment in cryptocurrency. \n\"I'm not saying it's safe,\" Chen said. \"I'm just willing to take the risk for investment. Just like everybody else.\" Diana Olick CNBC Real Estate Reporter Playing", "external_links": [], "published": "2018-01-11T16:50:00.000+02:00", "crawled": "2018-01-11T16:50:50.018+02:00", "highlightTitle": ""}