{"organizations": [], "uuid": "7af7aa590cec81e11dfc77ce3b861a359fdccb0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-kemet-announces-dates-for-the-december-2017-quarter-earnings-release.html", "country": "US", "domain_rank": 767, "title": "KEMET Announces Dates for the December 2017 Quarter Earnings Release", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.032, "site_type": "news", "published": "2018-01-12T16:30:00.000+02:00", "replies_count": 0, "uuid": "7af7aa590cec81e11dfc77ce3b861a359fdccb0f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-kemet-announces-dates-for-the-december-2017-quarter-earnings-release.html", "ord_in_thread": 0, "title": "KEMET Announces Dates for the December 2017 Quarter Earnings Release", "locations": [], "entities": {"persons": [], "locations": [{"name": "s.c.", "sentiment": "none"}, {"name": "greenville", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "kemet", "sentiment": "negative"}, {"name": "kem", "sentiment": "negative"}, {"name": "kemet corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GREENVILLE, S.C., Jan. 12, 2018 (GLOBE NEWSWIRE) -- KEMET Corporation (NYSE:KEM) will host a conference call at 9:00 AM (EST) on Thursday, February 1, 2018, to discuss its financial results for the third quarter ended December 31, 2017. The call will last approximately one hour.\nTo access the call via telephone, participants in the United States should dial 1-800-416-8033, and participants outside the United States should dial 1-706-643-0979. Participants should reference \"KEMET Corporation\" and Conference ID #5696064. Participants can view a corresponding presentation from the KEMET website at www.kemet.com by clicking on the conference call link in the Investor Relations section of the website. The presentation will be available immediately prior to the beginning of the call. Following management’s comments, there will be an opportunity for questions.\nIn conjunction with the conference call, there will be a simultaneous live broadcast over the internet that can be accessed at http://ir.kemet.com/ . A replay of the conference call will be available until midnight, February 15, 2018, through the same link.\nAbout KEMET\nThe Company's common stock is listed on the NYSE under the ticker symbol \"KEM\" (NYSE:KEM). At the Investor Relations section of our web site at http://www.kemet.com/IR , users may subscribe to KEMET news releases and find additional information about our Company. KEMET offers our customers the broadest selection of capacitor technologies in the industry, along with an expanding range of electromechanical devices, electromagnetic compatibility solutions and supercapacitors. Our vision is to be the preferred supplier of electronic component solutions demanding the highest standards of quality, delivery and service. Additional information about KEMET can be found at http://www.kemet.com .\nCAUTIONARY STATEMENT ON FORWARD-LOOKING STATEMENTS\nCompany operates, as well as management’s beliefs and assumptions. Words such as “expects,” “anticipates,” “believes,” “estimates,” variations of such words and other similar expressions are intended to identify such forward-looking statements. These statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions, which are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed or forecasted in, or implied by, such forward-looking statements. Readers are cautioned not to place undue reliance on these forward-looking statements, which reflect management’s judgment only as of the date hereof. The Company undertakes no obligation to update publicly any of these forward-looking statements to reflect new information, future events or otherwise.\nFactors that may cause actual outcome and results to differ materially from those expressed in, or implied by, these forward-looking statements include, but are not necessarily limited to the following: (i) adverse economic conditions could impact our ability to realize operating plans if the demand for our products declines, and such conditions could adversely affect our liquidity and ability to continue to operate and cause a write down of long-lived assets or goodwill; (ii) an increase in the cost or a decrease in the availability of our principal or single-sourced purchased raw materials; (iii) changes in the competitive environment; (iv) uncertainty of the timing of customer product qualifications in heavily regulated industries; (v) economic, political, or regulatory changes in the countries in which we operate; (vi) difficulties, delays or unexpected costs in completing the restructuring plans; (vii) acquisitions and other strategic transactions expose us to a variety of risks; (viii) acquisition of TOKIN may not achieve all of the anticipated results; (ix) our business could be negatively impacted by increased regulatory scrutiny and litigation; (x) difficulties associated with retaining, attracting and training effective employees and management; (xi) the need to develop innovative products to maintain customer relationships and offset potential price erosion in older products; (xii) exposure to claims alleging product defects; (xiii) the impact of laws and regulations that apply to our business, including those relating to environmental matters; (xiv) the impact of laws relating to trade, export controls and foreign corrupt practices; (xv) changes impacting international trade and corporate tax provisions related to the global manufacturing and sales of our products may have an adverse effect on our financial condition and results of operations; (xvi) volatility of financial and credit markets affecting our access to capital; (xvii) the need to reduce the total costs of our products to remain competitive; (xviii) potential limitation on the use of net operating losses to offset possible future taxable income; (xix) restrictions in our debt agreements that could limit our flexibility in operating our business; (xx) any failure of our information technology systems to function properly or control unauthorized access to our systems may cause business disruptions; (xxi) any economic and demographic experience for our pension plans and other post-retirement benefit plans that is less favorable than our assumptions; (xxii) fluctuation in distributor sales could adversely affect our results of operations, and (xxiii) earthquakes and other natural disasters could disrupt our operations and have a material adverse effect on our financial condition and results of operations.\nContact: William M. Lowe, Jr.\nExecutive Vice President and Chief Financial Officer\nwilliamlowe@KEMET.com\n864-963-6484\nSource:KEMET Corporation", "external_links": ["http://www.kemet.com/IR", "http://ir.kemet.com/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f63aacfd-4fe8-4fdf-a00e-7a6d9b6b6f7f"], "published": "2018-01-12T16:30:00.000+02:00", "crawled": "2018-01-12T17:56:47.012+02:00", "highlightTitle": ""}