{"organizations": [], "uuid": "8910b17a129b637fdb576283087f1b74690b8663", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225151680&w=1200&r=LYNXMPEE0O0ZU", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-stsk-hamelin/hamelin-st-gelais-to-swap-olympic-rings-for-wedding-bands-idUSKBN1FE1SV", "country": "US", "domain_rank": 408, "title": "Hamelin, St-Gelais to swap Olympic rings for wedding bands", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:17:00.000+02:00", "replies_count": 0, "uuid": "8910b17a129b637fdb576283087f1b74690b8663"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-stsk-hamelin/hamelin-st-gelais-to-swap-olympic-rings-for-wedding-bands-idUSKBN1FE1SV", "ord_in_thread": 0, "title": "Hamelin, St-Gelais to swap Olympic rings for wedding bands", "locations": [], "entities": {"persons": [{"name": "st-gelais", "sentiment": "negative"}, {"name": "hamelin", "sentiment": "negative"}, {"name": "steve keat", "sentiment": "negative"}, {"name": "ashton eaton", "sentiment": "none"}, {"name": "lucinda fredericks", "sentiment": "none"}, {"name": "charles", "sentiment": "none"}, {"name": "charles hamelin", "sentiment": "none"}, {"name": "gabby adcock", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "marianne st-gelais", "sentiment": "none"}, {"name": "marianne", "sentiment": "none"}, {"name": "brianne theisen-eaton", "sentiment": "none"}, {"name": "clayton", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 20 PM / Updated 4 minutes ago Hamelin, St-Gelais to swap Olympic rings for wedding bands Steve Keating 4 Min Read \n(Reuters) - Following the Pyeongchang Winter Games Candian short-track speedskaters Charles Hamelin and Marianne St-Gelais will swap the Olympics rings for wedding bands, continuing a practice that is not uncommon. \nSome like Canadian heptathlete Brianne Theisen-Eaton and her husband American decathlete champion Ashton Eaton have won medals. Many do not. \nSome like Britain’s mixed doubles badminton partnership of Chris and Gabby Adcock team up. \nOthers like equestrians Clayton and Lucinda Fredericks competed against each other. \nSome make it work. Some do not. \n“For us it has never been hard to live both sides of that life, being an athlete and in a relationship with an athlete of my sport like Marianne,” the 33-year-old Hamelin told Reuters. \n”For me and Marianne we put things very clear from the beginning that when we are at home doing our normal life we are Marianne and Charles the couple. \n“When we are the rink and training and in competition at the Olympics, yes of course we are still a couple but we are Charles and Marianne athletes who want to perform, who want to win medals.” \nPyeongchang will be Hamelin’s fourth Games, while St-Gelais will be at her third in South Korea. \nTheir relationship is one that has sprouted and grown around competition and often been on public display. \nAt the 2010 Vancouver Games Hamelin jumped into the stands to embrace St-Gelais to the thundering approval of cheering Canadians after winning the 500 meters. \nIn Sochi, where he was tipped to have a shot at four gold medals, Hamelin finished with just one after failing in the 500 and 1,000m and St-Gelais morphed from cheerleader to therapist. \nThe couple, however, quickly put that aside for St-Gelais to clinch a silver in the relay. FILE PHOTO: Winner Canada's Charles Hamelin hugs his girlfriend and compatriot speed skater Marianne St-Gelais after the men's 1,500 metres short track speed skating race finals at the Iceberg Skating Palace during the 2014 Sochi Winter Olympics February 10, 2014. Ê REUTERS/Brian Snyder/File Photo \n“We kind of put the couple mode aside and put on the athlete mode and for us it has always worked like that,” said Hamelin, who started dating St-Gelais in 2007. \n“Even if we are in athlete mode I‘m still the boyfriend of Marianne.” SUCCESS \nOver the years Hamelin and St-Gelais have had far more to celebrate than regret. \nHamelin has won four Olympic medals, including three gold while St-Gelais has contributed three silver, while they have a combined haul of more than 50 world championships medals. FILE PHOTO: Charles Hamelin (L) and his brother Francois of Canada skate together in preparation for the 2014 Sochi Winter Olympics at the Iceberg Skating Palace February 4, 2014. REUTERS/Lucy Nicholson/File Photo \nIt all adds to the family legacy that includes Charles’s brother Francois, a gold medal winner in Vancouver and father Yves, who oversees Canada’s short-track program. \n“We don’t always feel it because we are always in training mode and we don’t really feel the legacy we are leaving behind,” said Hamelin. \n“When you go see kids around the country to see how they look at you is something really special, that is how we realize that is who I am and that is what I left for the sport.” \nThat legacy is likely to carry on after the couple is married later this year. \nBoth are focused on spending much of their free time working with young skaters through clinics and the Quebec and Canadian federations and many expect the coaching reigns will one day pass from Yves to Charles. \n“We have been talking about this (the future) for a year,” said Hamelin. \n”It’s something you need to talk about because if you finish your career and you are not ready for it you can get lost, you can get unsure. \n”Opportunity will come to you, you do things you like and you love and you do things you don’t like and don’t love and that’s where you find your way after this journey of being an athlete. \n“That is how you find your life.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-25T15:17:00.000+02:00", "crawled": "2018-01-25T15:27:03.012+02:00", "highlightTitle": ""}