{"organizations": [], "uuid": "17243a217f8a3dc59bac6b89db7c426f7032c66d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-donald-m-casey-jr-appointed-chief-executive-officer-of-dentsply-sirona-inc.html", "country": "US", "domain_rank": 767, "title": "Donald M. Casey Jr. Appointed Chief Executive Officer of Dentsply Sirona Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T15:30:00.000+02:00", "replies_count": 0, "uuid": "17243a217f8a3dc59bac6b89db7c426f7032c66d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-donald-m-casey-jr-appointed-chief-executive-officer-of-dentsply-sirona-inc.html", "ord_in_thread": 0, "title": "Donald M. Casey Jr. Appointed Chief Executive Officer of Dentsply Sirona Inc.", "locations": [], "entities": {"persons": [{"name": "donald m. casey jr", "sentiment": "neutral"}, {"name": "donald m. casey jr.", "sentiment": "none"}, {"name": "don", "sentiment": "none"}, {"name": "casey", "sentiment": "none"}, {"name": "thierer", "sentiment": "none"}, {"name": "mark a. thierer", "sentiment": "none"}, {"name": "eric k. brandt", "sentiment": "none"}], "locations": [{"name": "york", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "dentsply sirona inc", "sentiment": "negative"}, {"name": "dentsply sirona inc.", "sentiment": "negative"}, {"name": "dentsply sirona", "sentiment": "none"}, {"name": "company’s board of directors", "sentiment": "none"}, {"name": "dental solutions company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YORK, Pa., Jan. 17, 2018 (GLOBE NEWSWIRE) -- DENTSPLY SIRONA Inc. (“Dentsply Sirona”) (NASDAQ:XRAY), The Dental Solutions Company™, today announced that its Board of Directors has appointed Donald M. Casey Jr. as Chief Executive Officer and as a member of the Company’s Board of Directors, effective February 12, 2018. Mr. Casey succeeds Mark A. Thierer, who served as Interim Chief Executive Officer since September 28, 2017. Mr. Thierer will continue to serve as Interim Chief Executive Officer through February 11, 2018 and will work closely with Mr. Casey to ensure a seamless transition.\n“Dentsply Sirona’s Board of Directors is excited to appoint Don as our CEO,” said Eric K. Brandt, Non-Executive Chairman of the Board. “After a comprehensive search and careful consideration, our Board unanimously concluded that Don has the right mix of skills, experience and talent to lead Dentsply Sirona to achieve its full potential. Don has deep experience in global manufacturing, product development and distribution of medical devices and technology. Further, he has a strong track record of managing global healthcare businesses and partnering with healthcare professionals, which will be critical to Dentsply Sirona as we continue to execute our growth strategy, accelerate innovation and advance dental care.”\n\"I would like to thank the Board of Directors for placing their trust and confidence in me,” stated Don Casey. “It is truly an honor to serve as the next Chief Executive Officer of Dentsply Sirona. This is a company that brings over a century of deep understanding of the market, leading brands, an unparalleled track record for innovation and a recognized commitment to clinical education. I firmly believe that Dentsply Sirona is well positioned to serve our customers by bringing comprehensive solutions globally. I look forward to working with the thousands of dedicated employees in driving growth in this attractive market and building on our position as the recognized market leader in the dental industry, empowering dental professionals to provide better, safer and faster dental care worldwide.”\nMr. Brandt added, “On behalf of the Dentsply Sirona Board of Directors, I would like to thank Mark Thierer for his outstanding service as Interim Chief Executive Officer. Under his leadership, the company made meaningful progress on a series of important initiatives, including the merger integration, advancing our operational objectives and setting the company up for long term success and value creation. We appreciate Mark’s contributions and we wish him the best in his future endeavors.”\nAbout Don Casey:\nMr. Casey has more than 30 years of global health care experience and an outstanding track record in identifying and commercializing medical innovations. He most recently served as Chief Executive Officer of the Medical segment of Cardinal Health, a leading manufacturer and provider of medical products and supply chain services to hospitals, laboratories, physician offices, surgery centers and other sites of care across the health care continuum. Under Don Casey's leadership as the CEO of the Medical segment, he repositioned the segment and delivered consistent revenue and operating income growth, meaningful margin expansion and helped position the segment for sustainable growth going forward.\nPrior to Cardinal Health, Mr. Casey served as Chief Executive Officer of the Gary and Mary West Wireless Health Institute, a non-profit research organization focused on lowering the cost of health care through novel technology solutions from 2010 to 2012. Previously, Mr. Casey served as worldwide chairman for Johnson & Johnson's comprehensive care group and a member of the company's executive committee, where he oversaw its cardiovascular, diagnostic, diabetes and vision care franchises around the world. Mr. Casey began his career with Johnson & Johnson in 1985, advancing into executive positions throughout the company's consumer, pharmaceutical and medical device franchises.\nMr. Casey serves on the boards of AdvaMed and the James Foundation. Previously, he also served on the boards of Surgical Specialties (formerly AngioTech) and West Corp. He earned a bachelor’s degree in finance and a master of business administration degree from the University of Notre Dame.\nAbout Dentsply Sirona:\nDentsply Sirona is the world’s largest manufacturer of professional dental products and technologies, with over a century of innovation and service to the dental industry and patients worldwide. Dentsply Sirona develops, manufactures, and markets a comprehensive solutions offering including dental and oral health products as well as other consumable medical devices under a strong portfolio of world class brands. As The Dental Solutions Company™, Dentsply Sirona’s products provide innovative, high-quality and effective solutions to advance patient care and deliver better, safer and faster dentistry. Dentsply Sirona’s global headquarters is located in York, Pennsylvania, and the international headquarters is based in Salzburg, Austria. The company’s shares are listed in the United States on NASDAQ under the symbol XRAY. Visit www.dentsplysirona.com for more information about Dentsply Sirona and its products.\nContact Information:\nJoshua Zable, IRC\nVice President, Investor Relations\n+1-718-482-2184\njoshua.zable@dentsplysirona.com\nSource:DENTSPLY SIRONA Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/91e36dfa-44e3-4905-a186-3a988bd67ab8"], "published": "2018-01-17T15:30:00.000+02:00", "crawled": "2018-01-17T16:34:41.000+02:00", "highlightTitle": ""}