{"organizations": [], "uuid": "6ea660f7c660ac4187cbe41b3ec188c0194fb19a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-first-financial-bancorp-announces-fourth-quarter-and-full-year-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "First Financial Bancorp Announces Fourth Quarter and Full Year 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-19T00:15:00.000+02:00", "replies_count": 0, "uuid": "6ea660f7c660ac4187cbe41b3ec188c0194fb19a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-first-financial-bancorp-announces-fourth-quarter-and-full-year-2017-financial-results.html", "ord_in_thread": 0, "title": "First Financial Bancorp Announces Fourth Quarter and Full Year 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "cincinnati", "sentiment": "none"}], "organizations": [{"name": "first financial bancorp.", "sentiment": "negative"}, {"name": "first financial bancorp", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "first financial", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CINCINNATI, First Financial Bancorp. (Nasdaq: FFBC) (\"First Financial\" or the \"Company\") announced financial results for the fourth quarter and full year 2017. For the three months ended December 31, 2017, the Company reported net income of $24.8 million, or $0.40 per diluted common share. These results compare to net income of $24.8 million, or $0.40 per diluted common share, for the third quarter of 2017 and $23.3 million, or $0.38 per diluted common share, for the fourth quarter of 2016. For the twelve months ended December 31, 2017, First Financial had earnings per diluted common share of $1.56 compared to $1.43 for the same period in 2016.\nReturn on average assets for the fourth quarter of 2017 was 1.13% while return on average tangible common equity was 13.85%. These compare to a return on average assets of 1.13% and return on average tangible common equity of 14.10% in the third quarter of 2017 and a return on average assets of 1.11% and a return on average tangible common equity of 14.19% in the fourth quarter of 2016. The return on average assets and tangible common equity were 1.12% and 14.07%, respectively, for the twelve months ended December 31, 2017.\nFourth quarter 2017 net income totaled $0.40 per share on a GAAP basis, in line with the prior quarter. Fourth quarter 2017 net income totaled $0.45 per share on an adjusted basis as detailed in the accompanying slide presentation, a 15% increase from the prior quarter.\nSignificant items impacting fourth quarter performance include:\nNet interest margin increased 25 basis points to 3.75% on a GAAP basis, 3.82% on a fully tax equivalent basis Elevated loan fees, solid execution of recent deposit strategies and favorable shifts in earning asset and funding mix Noninterest expense increased $28.5 million, or 52.3%, compared to the linked quarter, including: $11.3 million historic tax credit investment write-down $8.4 million of merger-related expenses $5.1 million impairment charge resulting from preliminary agreement to early terminate FDIC loss sharing agreements $3.0 million charitable contribution to the First Financial Foundation Impact of the recent tax reform legislation and historic tax credits on income tax expense Strong credit performance including lower net charge-offs, nonperforming loans and classified assets resulted in provision recapture of $0.2 million\nFull detail of the Company's fourth quarter and full year performance are provided in the accompanying financial statements and slide presentation.\nClaude Davis, Chief Executive Officer, commented, \"Strong earnings, improved net interest margin, continued credit improvement and stable loan growth combined to produce fourth quarter adjusted earnings of $0.45 per share, representing our 109th consecutive quarter of profitability. The increase in net interest margin was driven by the combination of higher loan fees, improved earning asset mix and lower funding costs resulting from deposit strategies implemented during the third quarter.\"\n\"Fourth quarter results were also impacted by the recently enacted tax reform legislation, the preliminary agreement to early terminate our FDIC-loss sharing agreements and the realization of a significant historic tax credit. Additionally, we made a $3.0 million charitable contribution to the newly established First Financial Foundation during the period and continued to make steady progress in our integration efforts as we near our anticipated merger with MainSource Financial Group.\"\n\"We remain extremely excited about our pending merger with MainSource and the formation of a new First Financial with the necessary scale and reach to successfully execute our strategy, deliver exceptional client service and provide solid shareholder returns. Finally, I want to take the opportunity to thank our associates for their efforts in 2017. As the embodiment of our organizational values, the work they do every day adds great value in exceeding client expectations, serving our communities and driving First Financial's current and future success.\"\nThis release announcing our fourth quarter and full year 2017 financial results includes an accompanying slide presentation, which management intends to refer to during the conference call on Friday, January 19, 2018.\nTeleconference / Webcast Information\nFirst Financial's executive management will host a conference call to discuss the Company's financial and operating results on Friday, January 19, 2018 at 8:30 a.m. Eastern Standard Time. Members of the public who would like to listen to the conference call should dial (877) 506-6873 (U.S. toll free), (855) 669-9657 (Canada toll free) or +1 (412) 380-2003 (International) (no passcode required). The number should be dialed five to ten minutes prior to the start of the conference call. The conference call will also be accessible as an audio webcast via the Investor Relations section of the Company's website at www.bankatfirst.com . A replay of the conference call will be available beginning one hour after the completion of the live call at (877) 344-7529 (U.S. toll free), (855) 669-9658 (Canada toll free) and +1 (412) 317-0088 (International); conference number 10115503. The webcast will be archived on the Investor Relations section of the Company's website for 12 months.\nPress Release and Additional Information on Website\nThis press release as well as supplemental information and any non-GAAP reconciliations related to this release is available to the public through the Investor Relations section of First Financial's website at www.bankatfirst.com .\nAbout First Financial Bancorp.\nFirst Financial Bancorp. is a Cincinnati, Ohio based bank holding company. As of December 31, 2017, the Company had $8.9 billion in assets, $6.0 billion in loans, $6.9 billion in deposits and $930.7 million in shareholders' equity. The Company's subsidiary, First Financial Bank, founded in 1863, provides banking and financial services products through its four lines of business: Commercial and Private Banking, Retail Banking, Investment Commercial Real Estate and Commercial Finance. These business units provide traditional banking services to business and retail clients. Commercial and Private Banking includes First Financial Wealth Management, which provides wealth planning, portfolio management, trust and estate, brokerage and retirement plan services and had approximately $2.7 billion in assets under management as of December 31, 2017. The Company's primary operating markets are located in Ohio, Indiana and Kentucky where it operates 94 banking centers, while the Commercial Finance business lends into targeted industry verticals on a nationwide basis. Additional information about the Company, including its products, services and banking locations is available at www.bankatfirst.com .\nForward-Looking Statement\nCertain statements contained in this report which are not statements of historical fact constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, certain plans, expectations, goals, projections and benefits relating to the transaction between the Company and MainSource, which are subject to numerous assumptions, risks and uncertain", "external_links": ["http://www.prnewswire.com/news-releases/first-financial-bancorp-announces-fourth-quarter-and-full-year-2017-financial-results-300584892.html", "http://www.sec.gov/", "http://www.bankatfirst.com/"], "published": "2018-01-19T00:15:00.000+02:00", "crawled": "2018-01-19T00:35:33.001+02:00", "highlightTitle": ""}