{"organizations": [], "uuid": "196b255d03397b5730ff490874ef91d6f4e1cfe8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/noble-debt-restructuring/noble-groups-creditors-in-drivers-seat-as-group-seeks-deal-to-cut-debt-idUSL4N1PP279", "country": "US", "domain_rank": 408, "title": "Noble Group's creditors in driver's seat as group seeks deal to cut debt", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-30T14:32:00.000+02:00", "replies_count": 0, "uuid": "196b255d03397b5730ff490874ef91d6f4e1cfe8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/noble-debt-restructuring/noble-groups-creditors-in-drivers-seat-as-group-seeks-deal-to-cut-debt-idUSL4N1PP279", "ord_in_thread": 0, "title": "Noble Group's creditors in driver's seat as group seeks deal to cut debt", "locations": [], "entities": {"persons": [{"name": "justin tang", "sentiment": "none"}, {"name": "anshuman daga", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "noble group", "sentiment": "negative"}, {"name": "vitol", "sentiment": "none"}, {"name": "glencore", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "united first partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Noble shares fall as much as 23 pct\n* Creditors to take 70 pct of restructured company\n* Analyst sees prospect of turnaround under creditors\n* Debt-for-equity swap agreed in principle\n* Existing equity holders’ stake to fall to 10 pct\nBy Anshuman Daga\nSINGAPORE, Jan 30 (Reuters) - Shares in Noble Group slumped 13 percent on Tuesday after the battered commodity trader proposed a deal under which existing shareholders’ equity would be nearly wiped out, while the restructured company would have much lower debt.\n“This debt for equity swap was something that ought to have been done a long time ago,” said Justin Tang, head of Asian research at United First Partners, a special situations investment and advisory group.\n“There seems no other choice but for stakeholders to acquiesce,” he said.\nSingapore-listed Noble, which had ambitions to rival the likes of global commodity traders such as Glencore and Vitol, has shrunk to its Asian roots, dealing in commodities including metals and owning freight and liquefied natural gas (LNG) businesses.\nThis follows three tumultuous years in which the Hong Kong-headquartered company cut jobs and sold assets, some at losses, taking massive writedowns and raising funds.\nNoble said on Monday it had agreed a restructuring deal with an “ad hoc group” holding about 30 percent of senior bonds and loans, and would halve its senior debt to $1.7 billion. Perpetual bondholders would be offered $15 million, or less than 4 percent of face value.\nCreditors would end up owning 70 percent of the restructured company, management would get up to 20 percent, and existing shareholders would own just 10 percent.\n“The creditors are all savvy operators who will now be in the driver’s seat, which will raise the prospect of a turnaround,” said Tang from United First Partners.\n“Everyone involved has lost - (although) the distressed investors are best positioned when Noble turns around,” Tang said. The company did not name the creditors with which it struck a deal.\nNoble shares fell as much as 23 percent on Tuesday and were last down 13 percent at 0.22 Singapore dollars, giving it a market value of just $263 million. That is in sharp contrast to a valuation of $6 billion that it commanded in February 2015.\nNoble was founded in 1986 by Richard Elman, who rode a commodities bull run to build the company into one of the world’s biggest traders, but it plunged into crisis in February 2015 when Iceberg Research started questioning its books. Noble has stood by its accounting.\nElman is Noble’s biggest shareholder with a stake of just over 18 percent. Other large investors include sovereign wealth fund China Investment Corp and Orbis Investment Management.\nThe proposed debt-for-equity deal has to be approved by regulators and Noble’s shareholders.\n($1 = 1.3127 Singapore dollars)\nReporting by Anshuman Daga; Editing by Tom Hogue\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T14:32:00.000+02:00", "crawled": "2018-01-31T16:41:53.019+02:00", "highlightTitle": ""}