{"organizations": [], "uuid": "7345d8259a75b971e01c76dcb610a1c0a34b491c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-world-stock-rally-rolls-on-with-best-start-in-eight-years-idUSL8N1P31QX", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-World stock rally rolls on with best start in eight years", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-08T20:30:00.000+02:00", "replies_count": 0, "uuid": "7345d8259a75b971e01c76dcb610a1c0a34b491c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-world-stock-rally-rolls-on-with-best-start-in-eight-years-idUSL8N1P31QX", "ord_in_thread": 0, "title": "GLOBAL MARKETS-World stock rally rolls on with best start in eight years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* World stocks enjoy best start to year since 2010\n* European stocks hit highest since 2015\n* Dollar strengthens against euro after recent weakness\n* Commodity prices pause after recent rally\nBy Tommy Wilkes\nLONDON, Jan 8 (Reuters) - World stock markets hovered close to all-time highs on Monday as the best start to a year in eight years showed little sign of running out of steam, with the combination of strong global growth and low inflation powering the appetite for risk.\nEuropean stocks jumped by as much as 0.4 percent, hitting their highest levels since August 2015, before easing slightly.\nA surprise dip in German industrial orders, which fell in November for the first time since July, appeared unlikely to dent growing confidence in the euro zone’s biggest economy after a strong run of positive economic news.\nThe strong showing in European markets followed Asia, where benchmarks inched towards all-time peaks. Wall Street last week had posted its best start to a year in more than a decade; Friday’s U.S. jobs report, while weaker than expected, encouraged hopes that brisk growth and low inflation can be sustained this year.\nThe world index was flat, just below record highs. . It has gained 2.5 percent in the first five trading sessions of the year, its best start since 2010, according to Thomson Reuters data.\nThe U.S. dollar partly recovered on Monday after a weak start to the year, strengthening past $1.20 against the euro, although with bearish positions against the greenback high, many traders are betting on a stronger single currency.\nAgainst a basket of currencies the dollar was up 0.31 percent but close to its weakest level since September.\nPositive euro zone economic data - economic growth in the euro zone is on its best run in a decade - has helped the euro, and investors globally wanting exposure to the economic recovery in the region have piled into European assets.\nThe synchronised global recovery has prompted central banks across the world to follow the Federal Reserve’s lead and start moving towards tighter monetary policy in recent months, supporting their currencies against the dollar.\n“The overall trend is minutely supportive for the U.S. dollar as we are seeing a global recovery led by China and Europe and there is a lot of cash sitting on the sidelines, waiting to buy European assets,” said Peter Chatwell, head of European rates strategy at Mizuho International in London.\nU.S. futures data showed the largest net long euro position by hedge funds and speculative accounts in the single currency’s history in the week to Jan. 2.\nEuro zone blue chip stocks were up 0.23 percent, with France’s CAC 40 ahead by 0.3 percent and Germany’s DAX by 0.31 percent.\n“Growth in the Euro area has outpaced the U.S. for the past two years now and on our forecast this outperformance will extend to four years,” JP Morgan analysts wrote in a note, calling such a scenario “unprecedented”.\nIn U.S. markets, Wall Street’s best start to a year in more than a decade included the Dow rising 2.3 percent last week and the S&P 500 2.6 percent. The tech-heavy Nasdaq soared 3.4 percent.\nAttention in the U.S. now turns to the quarterly earnings season, the biggest event of this week, with Wall Street expecting solid growth of around 10 percent.\nAnalysts at Bank of America Merrill Lynch said that the global economy had entered 2018 “firing on all cylinders”.\n“This growth is keeping our quant models bullish and driving earnings revisions to new highs,” they added. “We stay long outside the U.S., with Asia ex-Japan and Nikkei our growth plays, Europe still for yield.”\nIn commodity markets, many commodities paused after the recent run-up in prices, supported by a broadly weak U.S. dollar and the rise in global growth expectations.\nOil prices held just below the near-three-year highs hit last week. A slight decline in the number of U.S. rigs drilling for new production kept prices in check.\nGold prices dipped after the dollar gained, with spot prices down 0.1 percent. The precious metal has posted four consecutive weeks of gains.\nFor Reuters Live Markets blog on European and UK stock markets, open a news window on Reuters Eikon by pressing F9 and type in ‘Live Markets’ in the search bar.\nReporting by Tommy Wilkes; Additional reporting by Saikat Chatterjee and Wayne Cole; Editing by Kevin Liffey and Peter Graff\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T20:30:00.000+02:00", "crawled": "2018-01-09T09:40:42.563+02:00", "highlightTitle": ""}