{"organizations": [], "uuid": "bae7a98827bfd96d802391dfe89c4a60fa9c44a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-swiss-eu/swiss-campaign-to-curb-immigration-from-eu-gets-go-ahead-idUSKBN1F51UN", "country": "US", "domain_rank": 408, "title": "Swiss campaign to curb immigration from EU gets go-ahead", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:58:00.000+02:00", "replies_count": 0, "uuid": "bae7a98827bfd96d802391dfe89c4a60fa9c44a1"}, "author": "", "url": "https://www.reuters.com/article/us-swiss-eu/swiss-campaign-to-curb-immigration-from-eu-gets-go-ahead-idUSKBN1F51UN", "ord_in_thread": 0, "title": "Swiss campaign to curb immigration from EU gets go-ahead", "locations": [], "entities": {"persons": [], "locations": [{"name": "switzerland", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "swiss people’s party", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "svp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 2:59 PM / Updated an hour ago Swiss campaign to curb immigration from EU gets go-ahead Reuters Staff 3 Min Read \nZURICH (Reuters) - A Swiss far-right campaign to curb immigration from the European Union, potentially unraveling bilateral ties with the bloc, moved ahead on Tuesday when the government gave proponents a green light to start canvassing public support. \nShould the initiative win the required 100,000 signatures by July 2019, it would go to a vote under the Swiss system of direct democracy. That could pave the way to scrapping the free movement of EU citizens now guaranteed under bilateral accords. \nThe populist Swiss People’s Party (SVP) has long sought to limit immigration to neutral, landlocked Switzerland, whose population of 8.4 million is already one-quarter foreign. \nThe European Union insists that its citizens must be able to live and work in non-member Switzerland as the price for enhanced Swiss access to the EU single market, the biggest for Swiss exports. \nThe latest campaign comes at a sensitive time for bilateral ties, which soured last month when Bern promised to retaliate over what it called unacceptable limitations on the access of Swiss stock exchanges to the EU single market. \nVoters approved quotas on immigration in 2014 but parliament instead opted in 2016 for a system giving people registered as unemployed in Switzerland first crack at open jobs. This move skirted a clash with Brussels and averted a threat to bilateral relations. \nThe text of the new initiative states that Switzerland will unilaterally steer immigration and enter no accords granting foreigners free access. It would give the government 12 months to negotiate an end to the current free movement pact, one of more than 100 bilateral accords that regulate ties. \nShould negotiations fail, the government has 30 days to cancel the free movement accord. This would almost certainly prompt Brussels to cancel an entire package of other bilateral agreements that stand or fall together. \nA survey of more than 20,000 people by newspaper publisher Tamedia this week, however, found 55 percent opposed cancelling the free movement deal and 42 percent in favor. Reporting by Michael Shields; editing by John Miller", "external_links": [], "published": "2018-01-16T16:58:00.000+02:00", "crawled": "2018-01-16T17:10:24.008+02:00", "highlightTitle": ""}