{"organizations": [], "uuid": "88cb6efb18a3e6f6c5256c27de623435dcdac885", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224797221&w=1200&r=LYNXMPEE0N14T", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-congo-protests/congo-is-becoming-like-prison-under-kabila-cardinal-idUSKBN1FD1MG", "country": "US", "domain_rank": 408, "title": "Congo is becoming like prison under Kabila: cardinal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T14:24:00.000+02:00", "replies_count": 0, "uuid": "88cb6efb18a3e6f6c5256c27de623435dcdac885"}, "author": "", "url": "https://www.reuters.com/article/us-congo-protests/congo-is-becoming-like-prison-under-kabila-cardinal-idUSKBN1FD1MG", "ord_in_thread": 0, "title": "Congo is becoming like prison under Kabila: cardinal", "locations": [], "entities": {"persons": [{"name": "reut", "sentiment": "negative"}, {"name": "kabila", "sentiment": "negative"}, {"name": "laurent monsengwo", "sentiment": "none"}, {"name": "joseph kabila", "sentiment": "none"}], "locations": [{"name": "congo", "sentiment": "none"}, {"name": "kinshasa", "sentiment": "none"}, {"name": "democratic republic of the congo", "sentiment": "none"}], "organizations": [{"name": "catholic", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  kinshasa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 12:25 PM / in 20 minutes Congo is becoming like prison under Kabila: cardinal Reuters Staff 4 Min Read \nKINSHASA (Reuters) - The head of Congo’s Catholic church condemned President Joseph Kabila’s government on Tuesday for a deadly crackdown on pro-democracy demonstrators, suggesting his country was turning into a prison. \nTensions between the government and one of the Democratic Republic of the Congo’s most powerful institutions has risen as the church has increasingly become a focal point for opposition to Kabila’s efforts to stay in power without a mandate. \nSecurity forces shot dead at least six people and wounded dozens more as they fired tear gas to disperse a protest on Sunday that the Catholic church had organized, drawing widespread international condemnation. \n“We were dispersed by tear gas, stun grenades and live bullets. We have again seen deaths, injuries, priests being arrested, and the theft of citizens’ property,” Cardinal Laurent Monsengwo said at the church in the capital Kinshasa. \n“Christians were prevented from praying. Others were prevented from leaving by...police and military who were armed as if they had been on a battlefield,” he said. \n“How can you kill men, women, children, youths and old people all chanting religious songs, carrying bibles, rosaries and crucifixes? Are we now living in an open prison?” \nA military spokesman did not immediately respond to a request for comment. Kabila’s refusal to step down at the end of his mandate in December 2016 has triggered a series of street protests in which scores have been killed in Kinshasa. It has also emboldened armed rebel groups in different parts of Congo. \nCongo’s influential Roman Catholic Church has emerged as a flashpoint for opposition to Kabila, while his political opposition remains flimsy and divided. The tussle is increasingly a concern for Pope Francis. \n“Unfortunately, worrying news continues to arrive from the Democratic Republic of Congo,” Francis told a crowd in St. Peter’s Square on Wednesday. “I therefore renew my appeal that everyone make all efforts to avoid any form of violence.” \nKabila blames delays in an election meant to replace him - it will not happen until the end of this year at the earliest - on logistical problems registering voters. \nBut the resulting instability has stoked fears that the vast, mineral-rich country could slide back into the wars that killed millions in the 1990s, mostly from hunger and disease. \nSunday’s violence - an echo of bloodshed on New Year’s Eve when Congolese forces killed at least seven people at a Catholic activists’ protest in the capital - prompted condemnation from Western powers. \nFrance “strongly condemns the violence perpetrated by the security forces”, the French Foreign Ministry said on Monday. \nIn a joint statement late on Tuesday, the embassies of the United States and Britain berated the authorities for “using disproportionate and lethal force against Congolese civilians”, and cutting the internet for three days. \n“These government actions hinder the democratic process and ... breach international norms on human rights,” it added. Writing by Tim Cocks; Editing by Mark Heinrich", "external_links": [], "published": "2018-01-24T14:24:00.000+02:00", "crawled": "2018-01-24T14:36:05.041+02:00", "highlightTitle": ""}