{"organizations": [], "uuid": "e0584bb7007f2ec91f216f37066db4f296952a71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-kids-poverty-obesity/severe-obesity-declining-among-low-income-u-s-kids-idUSKBN1EX26A", "country": "US", "domain_rank": 408, "title": "Severe obesity declining among low-income U.S. kids", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T22:02:00.000+02:00", "replies_count": 0, "uuid": "e0584bb7007f2ec91f216f37066db4f296952a71"}, "author": "", "url": "https://www.reuters.com/article/us-health-kids-poverty-obesity/severe-obesity-declining-among-low-income-u-s-kids-idUSKBN1EX26A", "ord_in_thread": 0, "title": "Severe obesity declining among low-income U.S. kids", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "wic", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 8:05 PM / Updated an hour ago Severe obesity declining among low-income U.S. kids Lisa Rapaport 4 Min Read \n(Reuters Health) - The proportion of poor kids receiving government food assistance who are severely obese has declined following benefits changes designed to encourage healthier purchases, a U.S. study suggests. \nThe study focused on 22.6 million young children enrolled in the Special Supplemental Nutrition Program for Women, Infants and Children (WIC), which gives money to low-income families to purchase healthy foods. \nResearchers followed kids from 2000 to 2014, a period spanning a benefits change in 2009 to promote fruits, vegetables and whole grains. \nSevere obesity rates increased from 1.8 percent of kids in 2000 to 2.12 percent in 2010, the study found. But by 2014, the proportion of severely obese children dipped to 1.96 percent, with a decrease seen for both boys and girls across all racial and ethnic groups. \n“Previous studies found that changes to the WIC food packages led to reductions in fruit juice purchases, increases in (healthy eating) and fruit, vegetable and whole grain consumption, better access to healthy foods in communities, and improved WIC staff competence in providing counseling for overweight children,” said study leader Dr. Liping Pan, a researcher at the U.S. Centers for Disease Control and Prevention in Atlanta. \n“The current study found modest declines in severe obesity among children from low-income families, which suggests progress on this important public health issue,” Pan said by email. \nNationwide, approximately 1.7 percent of children 2 to 5 years old had severe obesity during the period from 2011 to 2014, researchers note in JAMA Pediatrics. \nChildren who are severely obese, meaning they are heavier than more than 99 percent of their peers, face an increased risk of cardiovascular disease and other health complications as well as higher odds that they will suffer from obesity as adults. Poverty makes both obesity and the negative health effects of this condition more likely. \nKids in the current study ranged from 2 to 4 years old, and all lived well below the poverty level, which was $24,600 for a family of four in 2017. \nFrom 2000 to 2004, the largest increases in severe obesity occurred among the oldest children in the study and among white children and Native American kids. \nThen, from 2004 to 2010, severe obesity rates decreased for boys, younger kids in the study, black and Asian children. \nIn the final years of the study, from 2010 to 2014, obesity decreased among all demographic groups, with the largest relative declines for two-year-olds and for Hispanic, Native American and Asian children. \nThe study wasn’t designed to prove whether or how changes in WIC benefits might have influenced the odds of severe obesity in children. \nBecause many low-income children who are eligible for WIC don’t receive benefits, it’s also possible that the findings don’t reflect what would happen for all U.S. kids living in poverty. \nHowever, the results do suggest that WIC may be contributing to reductions in severe obesity because other studies done over the same time period haven’t found declines in severe obesity among kids across all income levels, said Myles Faith, a researcher at the University at Buffalo in New York. \n“This is fascinating because, if true, then the findings of this new study do not mirror the general population,” Faith, who wasn’t involved in the study, said by email. “There may be something unique to the WIC and its food package that is driving down severe obesity among its participants.” \nSOURCE: bit.ly/2CSTurk JAMA Pediatrics, online January 8, 2018.", "external_links": [], "published": "2018-01-08T22:02:00.000+02:00", "crawled": "2018-01-08T22:18:12.029+02:00", "highlightTitle": ""}