{"organizations": [], "uuid": "d8daf2b7716d4ca595656adef0cfed7ea2ba9076", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-avis-budget-group-adopts-one-year-stockholder-rights-planato-protect-stockholders-against-acreeping-controlaaby-srs.html", "country": "US", "domain_rank": 767, "title": "Avis Budget Group Adopts One-Year Stockholder Rights Plan to Protect Stockholders Against “Creeping Control” by SRS Investment Management", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:00:00.000+02:00", "replies_count": 0, "uuid": "d8daf2b7716d4ca595656adef0cfed7ea2ba9076"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-avis-budget-group-adopts-one-year-stockholder-rights-planato-protect-stockholders-against-acreeping-controlaaby-srs.html", "ord_in_thread": 0, "title": "Avis Budget Group Adopts One-Year Stockholder Rights Plan to Protect Stockholders Against “Creeping Control” by SRS Investment Management", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "parsippany", "sentiment": "none"}], "organizations": [{"name": "srs investment management company", "sentiment": "negative"}, {"name": "avis budget group", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "avis budget group, inc.", "sentiment": "none"}, {"name": "srs", "sentiment": "none"}, {"name": "srs investment management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Company’s Largest Stockholder Refuses to Renew Cooperation Agreement Expiring Today\nBoard Refreshment Process Underway\nPARSIPPANY, N.J., Jan. 15, 2018 (GLOBE NEWSWIRE) -- Avis Budget Group, Inc. (NASDAQ:CAR) today announced that its Board of Directors has approved the adoption of a one-year Stockholder Rights Plan to protect the interests of all Avis Budget Group stockholders. The Rights Plan is intended to preserve the Company’s ability to evaluate and pursue all strategic actions and prevent SRS Investment Management, the Company’s largest stockholder, from obtaining effective control without paying a control premium.\nSRS has disclosed a 30.7% economic interest in Avis Budget Group, including voting power over 14.7% of the outstanding shares and economic exposure to an additional 16% of the outstanding shares through derivative instruments.\nThe Company and SRS entered into a cooperation agreement in May 2017 containing standstill provisions and ownership limitations which expires today.\nAvis Budget Group made numerous good-faith attempts to enter into a new cooperation agreement with SRS, including offering SRS the ability to nominate an additional SRS director (bringing its total to three designees), as well as a significant role in the Board’s ongoing refreshment process. SRS has been unwilling to enter into a new cooperation agreement on those terms, and has insisted on a veto over any Board refreshment and leadership decisions, as well as the ability to significantly increase its voting power. The Board has therefore determined that the adoption of a new short-term Rights Plan is necessary to protect the interests of all stockholders, including protecting unaffiliated stockholders from any efforts at creeping control which would deny them a fair change in control premium.\n“We are disappointed that SRS has forced us into a position where we need to take this action to protect the interests of all stockholders,” said Leonard S. Coleman, lead independent director of Avis Budget Group. “We have maintained a cooperative relationship with SRS and their representatives on the Board over the past two years, and they recently expressed their support for the management team and the Company. We remain open to entering into a cooperation agreement with SRS on terms that protect all stockholders, and we hope that SRS agrees to continue to be a partner with the rest of the Board.”\nMr. Coleman continued: “We are committed to maintaining a highly qualified, independent Board, and recently retained Heidrick & Struggles, a leading search firm, to assist in our ongoing process of identifying new director candidates with specific skill sets to replace a number of retiring directors.”\nThe Board adopted a similar short-term Rights Plan in January 2017, when SRS was unwilling to renew a previous expiring cooperation agreement. The Board terminated that Rights Plan in May 2017, eight months ahead of its expiration date, when it and SRS entered into a renewed cooperation agreement. If SRS agrees to enter into a new cooperation agreement on mutually acceptable terms, the Company will immediately terminate the Rights Plan as it has in the past.\nThe new Rights Plan is designed to keep any party (including SRS) from obtaining effective control of the Company without paying a fair control premium and to prevent any one stockholder from effectively blocking strategic actions that may be beneficial to all stockholders. The Rights Plan is not intended to prevent any action with respect to the Company (including its acquisition) that the Board determines to be in the best interests of stockholders. The Board and management remain committed to maximizing long-term stockholder value and believe the Rights Plan will ensure the Board remains in the best position to discharge its fiduciary duties to Avis Budget Group and all stockholders.\nThe Rights Plan is similar to plans adopted by other publicly held companies and includes a number of recognized stockholder protections that emphasize its limited focus. The rights will initially trade with the Company’s common stock and will generally become exercisable only if any person (or any persons acting as a group) acquires 15% or more of the Company’s outstanding common stock (the “triggering percentage”), which is similar to the cap in the current SRS standstill. The Rights Plan does not aggregate the ownership of stockholders “acting in concert” unless and until they have formed a group under applicable securities laws. If the rights become exercisable, all holders of rights (other than any triggering person) will be entitled to acquire shares of common stock at a 50% discount or the Company may exchange each right held by such holders for one share of common stock. Under the Rights Plan, any person which currently owns more than the triggering percentage may continue to own its shares of common stock but may not acquire any additional shares without triggering the Rights Plan. Similar to the terms of the existing SRS cooperation agreement, the Rights Plan does not restrict the ownership of cash-settled derivatives. In addition, in order to ensure that the Rights Plan does not discourage prospective acquirers from making offers to acquire the Company that stockholders believe may be in their best interests, the rights automatically expire concurrently with the completion of certain “qualifying offers” for all of the outstanding shares of common stock. The Rights Plan does not contain any dead-hand, slow-hand, no-hand or similar feature that limits the ability of a future Board of Directors to redeem the rights.\nThe Rights Plan is in place for a one-year duration, expiring on January 13, 2019. Should the Board extend or renew the Rights Plan, it will put such extension or renewal to a shareholder vote at the next annual meeting of stockholders. The Rights Plan may also be terminated, or the rights may be redeemed, prior to the scheduled expiration of the Rights Plan under certain other circumstances. Further details of the Rights Plan will be contained in a Form 8-K that the Company will file with the Securities and Exchange Commission.\nForward-Looking Statements\nCertain statements in this press release constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Statements preceded by, followed by or that otherwise include the words “believes,” “expects,” “anticipates,” “intends,” “projects,” “estimates,” “plans,” “may increase,” “may fluctuate,” “will,” “should,” “would,” “may” and “could” or similar words or expressions are generally forward-looking in nature and not historical facts. Any statements that refer to outlook, expectations or other characterizations of future events, circumstances or results, including all statements related to the operation or effects of the rights plan, are also forward-looking statements. Important risks, assumptions and other important factors that could cause future results to differ materially from those expressed", "external_links": ["https://www.globenewswire.com/Tracker?data=pVyjL6e1Tg2u0aObL0Vf9pj1LlJT2qljuha2DJsYGbwljn4kzC-moQx-o509bs3QH4jIkB-LGMYlN8oWpwD7jY7sUYMCu3ciu1hbyacV1m0=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/48a8475d-8a2f-4dae-986e-3bdcaac0479a"], "published": "2018-01-15T16:00:00.000+02:00", "crawled": "2018-01-15T16:26:36.001+02:00", "highlightTitle": ""}