{"organizations": [], "uuid": "e4f7c93093be76d3476774cbcedee4fa02dedae6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 34}, "facebook": {"likes": 40, "shares": 40, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219456163&w=1200&r=LYNXMPEE0400H", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-technology-venture-capital/london-was-top-destination-for-tech-funding-in-2017-pitchbook-idUKKBN1EU019", "country": "US", "domain_rank": 408, "title": "London was top destination for tech funding in 2017 - PitchBook", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T02:18:00.000+02:00", "replies_count": 0, "uuid": "e4f7c93093be76d3476774cbcedee4fa02dedae6"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-technology-venture-capital/london-was-top-destination-for-tech-funding-in-2017-pitchbook-idUKKBN1EU019", "ord_in_thread": 0, "title": "London was top destination for tech funding in 2017 - PitchBook", "locations": [], "entities": {"persons": [{"name": "eileen burbidge", "sentiment": "none"}, {"name": "pitchbook paul sandle", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "tower bridge", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "pitchbook for london & partners", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "melville  tech", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 12:18 AM / Updated 8 hours ago London was top destination for tech funding in 2017 - PitchBook Paul Sandle 3   London was the top city in Europe for technology investment last year, with more funding going into companies in the British capital than into firms based in Paris, Berlin and the next seven cities combined, data showed on Friday. Workers cross the Millennium footbridge at dawn with Tower Bridge seen behind in London, Britain, December 19, 2017. REUTERS/Toby Melville \nTech firms in London attracted 2.45 billion pounds in venture capital funding in 2017, about 80 percent of the 2.99 billion pounds invested in Britain as a whole, according to data compiled by funding database PitchBook for London & Partners. \nEileen Burbidge, partner at Passion Capital, said it was no surprise to see London - and Britain - leading the pack because it has both the talent and investor capital needed. \n“It’s a testament to our exceptional entrepreneurs that the UK tech sector continues to produce companies that are leading in the development of cutting edge technologies such as artificial intelligence and fintech,” she said. \nFintech, or financial technology, was the most popular segment for investors, attracting a record 1.34 billion pounds in venture capital, the data showed, led by major rounds for TransferWise, Funding Circle and Monzo. \nArtificial intelligence (AI) was another growth area, with UK-based AI firms raising 488 million pounds, double the amount a year earlier, the data showed. \nOther big deals last year included a 391 million pound investment into Improbable, whose software creates large-scale simulations in the cloud; 364 million pounds for food delivery company Deliveroo; and 255 million pounds for mobile phone firm Truphone. \nBurbidge said the biggest threat to Britain’s leadership was any restrictions in its ability to attract the best talent after the country leaves the European Union next year. \n“Access to talent is critically important,” she said. \n“Being able to attract EU talent has been a huge advantage for the UK in the last few years. For the UK to look like a welcoming place is really important.” \nIndex Ventures partner Jan Hammer also said any post-Brexit restrictions on EU citizens movement would be detrimental. \n“Protecting the talent inflow is the key source of growth of start ups,” he said. \nAt the moment, however, London was setting the standard both in breadth and quality of start-ups, he said, noting that the city was home to role models such as Just Eat ( JE.L ), King, a gaming company acquired by Activision Blizzard for $5.9 billion in 2015, and TransferWise. \n“In our portfolio roughly 50 companies of the 150 companies we have are headquartered in London, and there are about another 25 foreign companies that have set up in London,” he said. \n($1 = 0.7388 pounds)", "external_links": [], "published": "2018-01-05T02:18:00.000+02:00", "crawled": "2018-01-05T02:35:37.000+02:00", "highlightTitle": ""}