{"organizations": [], "uuid": "4738f328a12d3b26a2d9de90d516b55b7d22277c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-cision-pre-releases-select-preliminary-unaudited-fourth-quarter-and-full-year-2017-results-provides-initial-full-year-2018.html", "country": "US", "domain_rank": 767, "title": "Cision Pre-Releases Select Preliminary Unaudited Fourth Quarter and Full Year 2017 Results; Provides Initial Full Year 2018 Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:00:00.000+02:00", "replies_count": 0, "uuid": "4738f328a12d3b26a2d9de90d516b55b7d22277c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-cision-pre-releases-select-preliminary-unaudited-fourth-quarter-and-full-year-2017-results-provides-initial-full-year-2018.html", "ord_in_thread": 0, "title": "Cision Pre-Releases Select Preliminary Unaudited Fourth Quarter and Full Year 2017 Results; Provides Initial Full Year 2018 Outlook", "locations": [], "entities": {"persons": [{"name": "cision", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "cision ltd.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 29, 2018 /PRNewswire/ -- Cision Ltd. (NYSE: CISN), a leading global provider of software and services to public relations and marketing communications professionals, today reported select preliminary unaudited financial results for the fourth quarter and year ended December 31, 2017. Cision also announced today that it intends to reprice its $1,335 million First Lien Senior Secured Term Loan.\nFourth Quarter 2017 Preliminary Unaudited Financial Results\nRevenue estimated between $168.5 million and $169.0 million, reflecting between 13.5% and 13.8% growth versus prior year fourth quarter revenue of $148.5 million; Revenue, excluding the impact from purchase accounting, estimated between $169.0 million and $169.5 million, reflecting between 13.4% and 13.8% growth versus prior year fourth quarter revenue of $149.0 million; Operating income estimated between $7.0 million and $7.5 million, reflecting between 250% and 275% growth versus prior year fourth quarter operating income of $2.0 million; Net income (loss) estimated between $(23.2) million and $(27.6) million, reflecting between 2.5% and (16.0%) change versus prior year fourth quarter net income (loss) of $(23.8) million; Adjusted EBITDA estimated between $60.6 million and $61.2 million, reflecting between 14.3% and 15.4% growth versus prior year fourth quarter Adjusted EBITDA of $53.0 million; Adjusted net income estimated between $22.7 million and $22.9 million, reflecting between 187% and 190% growth versus prior year fourth quarter Adjusted net income of $7.9 million. Adjusted net income during the fourth quarter was impacted by incremental interest expense associated with our $75.0 million incremental term loan; and Adjusted net income per diluted share estimated between $0.19 and $0.19, reflecting between 86% and 90% growth versus prior year fourth quarter Adjusted net income per diluted share of $0.10.\nFull Year 2017 Preliminary Unaudited Financial Results\nRevenue estimated between $631.0 million and $631.5 million, reflecting between 34.9% and 35.0% growth versus prior year revenue of $467.8 million; Revenue, excluding the impact from purchase accounting, estimated between $632.5 million and $633.0 million, reflecting between 34.9% and 35.0% growth versus prior year revenue of $468.9 million; Operating income estimated between $38.0 million and $38.5 million, reflecting an improvement of between $57.6 million and $58.1 million versus prior year operating loss of $19.6 million; Net income (loss) estimated between $(111.7) million and $(116.1) million, reflecting between (13.5%) and (18.0%) change versus prior year net income (loss) of $(98.4) million; Adjusted EBITDA estimated between $225.0 million and $225.5 million, reflecting between 38.7% and 39.0% growth versus prior year Adjusted EBITDA of $162.2 million; Including the acquisition of Bulletin Intelligence and the divestiture of Vintage, as if they both occurred on January 1, 2017, Adjusted EBITDA estimated between $227.0 million and $229.0 million; Adjusted net income estimated between $58.3 million and $58.5 million, reflecting between 163% and 164% growth versus prior year Adjusted net income of $22.2 million; and Adjusted net income per diluted share estimated between $0.57 and $0.57, reflecting between 111% and 112% growth versus prior fiscal year Adjusted net income per diluted share of $0.27.\nWe expect our net debt as of December 31, 2017 to be approximately $1,183 million. We derive net debt by taking our total debt outstanding and subtracting our cash balance. As of December 31, 2017, our total debt outstanding was approximately $1,331.6 million and our cash balance was approximately $148.7 million. We used approximately $75 million of cash in connection with our closing of the acquisition of PRIME Research on January 23, 2018.\n\"We are pleased to have delivered strong preliminary results for the fourth quarter,\" said Kevin Akeroyd, Cision's Chief Executive Officer. \"We continue to focus our efforts on delivering best-in-class products and services to our customers, executing on our remaining synergies, and driving towards our long-term financial goals and objectives. This focus helped drive our fourth quarter organic growth rate to approximately 2.6%, after adjusting for non-core revenues, approximately $0.4 million of revenue from CEDROM-SNi and the impact of currency.\"\nCision has not yet finalized its financial statement close process for the quarter ended December 31, 2017, nor has it finalized its assessment of the impact of the recent tax legislation. As a result, the information in this statement is preliminary and based upon information available to the Company as of the date of the statement. In connection with the finalization process and the incorporation of the impact of the recent tax legislation, Cision may identify items that would require adjustments to its preliminary financial results announced herein. The Company's financial results could be different, and those differences could be material.\nFull Year 2018 Outlook\nOur initial outlook for the full fiscal year ending December 31, 2018 appears below:\nRevenue of between $716 million and $726 million; Revenue, excluding the impact from purchase accounting of between $720 million and $730 million; Net income of between $2 million and $4 million; Adjusted EBITDA of between $248 million and $254 million; Adjusted net income of between $105 million and $110 million; and Adjusted net income per share per of between $0.86 and $0.88.\nAdditionally, for the full fiscal year ending December 31, 2018, Cision expects:\nDepreciation expense of between $23 million and $26 million; Amortization expense of between $112 million and $115 million, with $22 million to $24 million of this amortization expense included within cost of revenue and the remainder included in general and administrative costs; Net interest expense, exclusive of debt extinguishment costs, of between $71 million and $74 million; Cash interest expense of between $61 million and $64 million; Stock-based compensation expense of between $5 million and $6 million; and Capital expenditures, inclusive of capitalized software development, of between $30 million and $35 million.\nThe above outlook assumes the completion of our First Lien Senior Secured Term Loan repricing, LIBOR of approximately 1.5%, and EURIBOR of approximately 0%, the inclusion of a full year of results from our acquisition of CEDROM-SNi, and the inclusion of 11 months of results from our acquisition of PRIME Research. CEDROM-SNi's revenues for the 12 months ended December 31, 2017 were approximately $15 million, and PRIME Research's revenues for the 12 months ended December 31, 2017 were approximately $45 million. The above outlook also assumes the following exchange rates with respect to the British Pound, the Euro and the Canadian Dollar for fiscal year 2018:\nGBP to USD\n1.35\nEUR to USD\n1.20\nCAD to USD\n0.79\nAdditionally, our outlook for 2018 excludes any additional acquisitions, divestitures, or other unanticipated events. See discussion of non-GAAP financial measures below in this release.\nFourth Quarter 2017 Earnings Release and Conference Call Details\nCision expects to release its full year and fourth quarter 2017 financial and operating results on March 8, 2018. The Company plans to hold a conference call in connection with the above referenced release. The conference call will be simultaneously webcast on the Investor Relations section of the company's website: http://investors.cision.com\nForward-Looking Statements\nThis communication contains \"forward-looking statements\" within the meaning of the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. In this context, forward-looking statements often address expected future business and financial performance and financial condition, and often contain words such as \"anticipate,\" \"intend,\" \"plan,\" \"goal,\" \"seek,\" \"aim,\" \"strive,\" \"believe,\" \"see,\" \"project,\" \"predict,\" \"estimate,\" \"expect,\" \"continue,\" \"strategy,\" \"future,\" \"likely,\" \"may,\" \"might,\" \"should,\" \"will,\" \"would,\" \"target,\" similar expressions, and variations or negatives of these words. Forward-looking statements are neither historical facts nor assurances of future performance. Instead, they are based only on our current beliefs, expectations, and assumptions regarding the future of our business, future plans and strategies, projections, anticipated events and trends, the economy, and other future conditions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks, and changes in circumstances that are difficult to predict and many of which are outside of our control. Accordingly, you should not place undue reliance on these statements, as actual results may vary materially. A detailed discussion of some of the risks and uncertainties that could cause our actual results and financial condition to differ materially from the forward-looking statements is described under the caption \"Risk Factors\" in our most recent quarterly report on Form 10-Q filed on November 9, 2017, along with our other filings with the U.S. Securities and Exchange Commission. Any forward-looking statement made by us in this communication is based only on information currently available to us and speaks only as of the date of this report. We do not assume any obligation to publicly provide revisions or updates to any forward-looking statements, whether as a result of new information, future developments or otherwise, should circumstances change, except as otherwise required by securities and other applicable laws. Please consult our public filings at www.sec.gov or www.Cision.com .\nUse of Non-GAAP Financial Measures\nNon-GAAP results are presented only as a supplement to our financial statements based on US generally accepted accounting principles (GAAP). Non-GAAP financial information is provided to enhance the reader's understanding of our financial performance, but none of these non-GAAP financial measures are recognized terms under GAAP, and non-GAAP measures should not be considered in isolation or as a substitute for financial measures calculated in accordance with GAAP. Reconciliations of the most directly comparable GAAP measures to non-GAAP measures, such as Adjusted EBITDA and Adjusted net income per share, are provided in the schedules below in this release. We use non-GAAP measures in our operational and financial decision-making, believing that it is useful to exclude certain items in order to focus on what we deem to be a more reliable indicator of ongoing operating performance and our ability to generate cash flow from operations. As a result, internal management reports used during monthly operating reviews include Adjusted EBITDA and Adjusted net income per share. Additionally, we believe that the presentation of non-GAAP measures provides information that is useful to investors as it indicates, for example, our ability to meet capital expenditures and working capital requirements and otherwise meet our obligations as they become due. Investors are cautioned that non-GAAP financial measures are not a substitute for GAAP disclosures. This communication also includes certain forward-looking non-GAAP financial measures. We are unable to present without unreasonable efforts a reconciliation of forward-looking non-GAAP financial information to the corresponding GAAP financial information because management cannot reliably predict all of the necessary information. Forward-looking non-GAAP financial information is based on numerous assumptions, including assumptions with respect to general business, economic, market, regulatory and financial conditions and various other factors, all of which are difficult to predict and many of which are beyond our control. Accordingly, investors are cautioned not to place undue reliance on this information.\nNon-GAAP measures are frequently used by securities analysts, investors, and other interested parties in their evaluation of companies comparable to Cision, many of which present non-GAAP measures when reporting their results. These measures can be useful in evaluating our performance against our peer companies because we believe the measures provide users with valuable insight into key components of GAAP financial disclosures. However, non-GAAP measures have limitations as an analytical tool. Non-GAAP measures are not necessarily comparable to similarly titled measures used by other companies. They are not presentations made in accordance with GAAP, are not measures of financial condition or liquidity, and should not be considered as an alternative to profit or loss for the period determined in accordance with GAAP or operating cash flows determined in accordance with GAAP. As a result, you should not consider such performance measures in isolation from, or as a substitute analysis for, results of operations as determined in accordance with GAAP.\nAbout Cision\nCision Ltd. (NYSE: CISN) is a leading global provider of earned media software and services to public relations and marketing communications professionals. Cision's software allows users to identify key influencers, craft and distribute strategic content, and measure meaningful impact. Cision has over 3,000 employees with offices in 15 countries throughout the Americas, EMEA, and APAC. For more information about its award-winning products and services, including the Cision Communications Cloud®, visit www.cision.com and follow Cision on Twitter @Cision.\nCision Ltd. and its Subsidiaries\nSummary Fourth Quarter 2017 Preliminary Unaudited Financial Results and Prior Year\nSummary Fourth Quarter 2016 Financial Results\n(in millions, except for per share and share amounts)\n(Unaudited)\nThree\nMonths\nEnded\nDecember 31, 2016\nThree\nMonths\nEnded\nDecember 31, 2017\nFiscal\nYear\nEnded\nDecember 31, 2016\nFiscal\nYear\nEnded\nDecember 31, 2017\nRevenue\n$148.5\n$168.5 - $169.0\n$467.8\n$631.0 - $631.5\nAdjusted revenue\n$149.0\n$169.0 - $169.5\n$468.9\n$632.5 - $633.0\nOperating income\n$2.0\n$7.0 - $7.5\n($19.6)\n$38.0 - $38.5\nNet income (loss)\n($23.8)\n($23.2) - ($27.6)\n($98.4)\n($111.7) - ($116.1)\nNet income (loss) per share\n($0.29)\n($0.19) - ($0.23)\n($1.20)\n($1.09) - ($1.14)\nAdjusted EBITDA\n$53.0\n$60.6 - $61.2\n$162.2\n$225.0 - $225.5\nAdjusted net income\n$7.9\n$22.7 - $22.9\n$22.2\n$58.3 - $58.5\nAdjusted net income per diluted share (4)(5)\n$0.10\n$0.19 - $0.19\n$0.27\n$0.57 - $0.57\nCision Ltd. and its Subsidiaries\nReconciliation of Net Income (Loss) to EBITDA and Adjusted EBITDA\n(in millions)\n(Unaudited)\nThree\nMonths\nEnded\nDecember 31, 2016\nThree\nMonths\nEnded\nDecember 31, 2017\nFiscal\nYear\nEnded\nDecember 31, 2016\nFiscal\nYear\nEnded\nDecember 31, 2017\nNet income (loss)\n($23.8)\n($23.2) - ($27.6)\n($98.4)\n($111.7) - ($116.1)\nDepreciation and amortization\n$39.4\n$35.9 - $36.2\n$127.0\n$139.3 - $139.6\nInterest expense and loss on extinguishment of debt\n$35.7\n$20.0 - $20.3\n$141.6\n$168.2 - $168.5\nProvision (benefit) from income taxes\n($9.6)\n$6.6 - $10.2\n($55.7)\n($21.3) - ($17.4)\nEBITDA (1)(5)\n$41.8\n$39.1 - $39.3\n$114.5\n$174.5 - $174.6\nAcquisition related costs and expenses\n$9.0\n$16.2 - $16.5\n$45.0\n$41.4 - $41.7\nGain on sale of business\n-\n-\n-\n($1.8) - ($1.8)\nStock-based compensation expense\n$1.3\n$1.1 - $1.2\n$5.3\n$4.1 - $4.2\nDeferred revenue reduction from purchase accounting\n$0.6\n$0.6 - $0.7\n$1.2\n$1.4 - $1.4\nSponsor fees and expenses\n$0.1\n-\n$0.6\n$0.3 - $0.3\nUnrealized translation loss (gain)\n$0.1\n$3.4 - $3.6\n($4.4)\n$5.1 - $5.1\nAdjusted EBITDA (2)(5)\n$53.0\n$60.6 - $61.2\n$162.2\n$225.0 - $225.5\nCision Ltd. and its Subsidiaries\nReconciliation of Net Income (Loss) to Adjusted Net Income and Adjusted Net Income per Diluted Share\n(in millions, except for per share and share amounts)\n(Unaudited)\nThree\nMonths\nEnded\nDecember 31, 2016\nThree\nMonths\nEnded\nDecember 31, 2017\nFiscal\nYear\nEnded\nDecember 31, 2016\nFiscal\nYear\nEnded\nDecember 31, 2017\nNet income (loss)\n($23.8)\n($23.2) - ($27.6)\n($98.4)\n($111.7) - ($116.1)\nProvision (benefit) from income taxes\n($9.6)\n$6.6 - $10.2\n($55.7)\n($21.3) - ($17.4)\nAcquisition related costs and expenses\n$9.0\n$16.2 - $16.5\n$45.0\n$41.4 - $41.7\nGain on sale of business\n-\n-\n-\n($1.8) - ($1.8)\nStock-based compensation expense\n$1.3\n$1.1 - $1.2\n$5.3\n$4.1 - $4.2\nDeferred revenue reduction from purchase accounting\n$0.6\n$0.6 - $0.7\n$1.2\n$1.4 - $1.4\nAmortization related to acquired intangible assets\n$32.9\n$29.2 - $29.2\n$102.0\n$113.8 - $113.8\nDebt refinancing, CPEC interest and debt extinguishment costs\n$1.1\n-\n$37.5\n$55.8 - $55.9\nSponsor fees and expenses\n$0.1\n-\n$0.6\n$0.3 - $0.3\nUnrealized translation loss (gain)\n$0.1\n$3.4 - $3.6\n($4.4)\n$5.1 - $5.1\nAdjusted income (loss) before income taxes\n$11.8\n$33.9 - $34.1\n$33.1\n$87.0 - $87.2\nLess: Income tax at 33% rate\n($3.9)\n($11.2) - ($11.3)\n($10.9)\n($28.7) - ($28.8)\nAdjusted net income (3)(5)\n$7.9\n$22.7 - $22.9\n$22.2\n$58.3 - $58.5\nPro forma fully-diluted weighted average shares outstanding (4)(5)\n82,076\n121,918\n82,076\n102,035\nAdjusted net income per diluted share (4)(5)\n$0.10\n$0.19 - $0.19\n$0.27\n$0.57 - $0.57\n(1) Cision defines EBITDA as net income (loss), plus depreciation and amortization expense, plus interest expense and loss on extinguishment of debt, plus provision for (or minus benefit from) income taxes.\n(2) Cision defines Adjusted EBITDA as net income (loss), plus depreciation and amortization expense, plus interest expense and loss on extinguishment of debt, plus provision for (or minus benefit from) income taxes, further adjusted for the following items: acquisition related costs and expenses, stock-based compensation, deferred revenue reduction from purchase accounting, (gains) losses related to divested businesses or assets, sponsor fees and expenses, and unrealized translation losses (gains). All of the items included in the reconciliation from net income to Adjusted EBITDA are either non-cash items or are items that we consider to be less useful in assessing our operating performance. In the case of the non-cash items, we believe that investors can better assess our operating performance if the measures are presented without such items because, unlike cash expenses, these adjustments do not affect our ability to generate free cash flow or invest in our business. For example, by excluding depreciation and amortization from EBITDA, users can compare operating performance without regard to different accounting determinations such as useful life. In the case of the other items, we believe that investors can better assess operating performance if the measures are presented without these items because their financial impact does not reflect ongoing operating performance.\n(3) Cision defines Adjusted net income as net income (loss) plus provision for (or minus benefit from) income taxes, further adjusted for acquisition related costs and expenses, (gains) losses related to divested businesses or assets, stock-based compensation, deferred revenue reduction from purchase accounting, amortization related to acquired intangibles, debt refinancing, CPEC interest and debt extinguishment costs, sponsor fees and expenses, and unrealized translation losses (gains), which together, sum to Adjusted net income (loss) before income taxes. Adjusted net income (loss) before income taxes is then taxed at an assumed long term corporate tax rate of 33% for 2017 and periods prior, and 26% for 2018 and beyond, pursuant to our preliminary analysis with respect to recent tax law changes, to determine Adjusted net income (loss). All of the items included in the reconciliation from net income to Adjusted net income are either non-cash items or are items that we consider to be less useful in assessing our operating performance. In the case of the non-cash items, we believe that investors can better assess our operating performance if the measures are presented without such items because, unlike cash expenses, these adjustments do not affect our ability to generate free cash flow or invest in our business. For example, by excluding the amortization related to acquired intangibles, users can compare operating performance without regard to highly variable amortization expenses related to our acquisitions. In the case of the other items, we believe that investors can better assess operating performance if the measures are presented without these items because their financial impact does not reflect ongoing operating performance.\n(4) Adjusted net income per diluted share is defined as Adjusted net income (loss), as defined above, divided by the fully-diluted pro forma weighted average shares outstanding for the period. The fully-diluted pro forma weighted average shares outstanding for the respective period assume that the exchange of shares pursuant to our merger with Capitol Acquisition III had taken effect as of the beginning of such period. Additionally, for purposes of calculating the number of fully diluted shares outstanding, we have excluded the potential impact of dilution from outstanding warrants to purchase shares of our common stock.\n(5) Adjusted net income (loss), Adjusted net income (loss) per diluted share, EBITDA, and Adjusted EBITDA are used by many of our investors, research analysts, investment bankers, and lenders to assess our operating performance. For example, a measure similar to Adjusted EBITDA is required by the lenders under our term loan and revolving credit agreements.\nInvestor Contact:\nJack Pearlstein\nChief Financial Officer\nJack.Pearlstein@Cision.com\nMedia Contact:\nNick Bell\nVice President, Marketing Communications and Content\nnick.bell@cision.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/cision-pre-releases-select-preliminary-unaudited-fourth-quarter-and-full-year-2017-results-provides-initial-full-year-2018-outlook-300589289.html\nSOURCE Cision", "external_links": ["https://c212.net/c/link/?t=0&l=en&o=2042743-1&h=3577599772&u=http%3A%2F%2Fwww.cision.com%2F&a=www.Cision.com", "https://c212.net/c/link/?t=0&l=en&o=2042743-1&h=1775534518&u=http%3A%2F%2Fwww.cision.com%2F&a=www.cision.com", "https://c212.net/c/link/?t=0&l=en&o=2042743-1&h=1649528886&u=http%3A%2F%2Finvestors.cision.com%2F&a=http%3A%2F%2Finvestors.cision.com", "https://c212.net/c/link/?t=0&l=en&o=2042743-1&h=3925716238&u=http%3A%2F%2Fwww.sec.gov%2F&a=www.sec.gov", "http://www.prnewswire.com/news-releases/cision-pre-releases-select-preliminary-unaudited-fourth-quarter-and-full-year-2017-results-provides-initial-full-year-2018-outlook-300589289.html"], "published": "2018-01-29T16:00:00.000+02:00", "crawled": "2018-01-29T17:38:11.013+02:00", "highlightTitle": ""}