{"organizations": [], "uuid": "1e43fd8c9fb4e7406d7520e57e1f94547748ba91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-workers-rights/childs-death-highlights-slavery-the-indian-textile-industrys-dirty-secret-idUSKBN1F11MV", "country": "US", "domain_rank": 408, "title": "Child's death highlights slavery, the Indian textile industry's 'dirty secret'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.795, "site_type": "news", "published": "2018-01-12T21:34:00.000+02:00", "replies_count": 0, "uuid": "1e43fd8c9fb4e7406d7520e57e1f94547748ba91"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-workers-rights/childs-death-highlights-slavery-the-indian-textile-industrys-dirty-secret-idUSKBN1F11MV", "ord_in_thread": 0, "title": "Child's death highlights slavery, the Indian textile industry's 'dirty secret'", "locations": [], "entities": {"persons": [{"name": "balasubramani bathran", "sentiment": "none"}, {"name": "karunaiyammal", "sentiment": "none"}, {"name": "nalini", "sentiment": "none"}, {"name": "thangavel maran", "sentiment": "none"}], "locations": [{"name": "chennai", "sentiment": "none"}, {"name": "tamil nadu", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "national human rights commission", "sentiment": "none"}, {"name": "nhrc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHENNAI, India (Thomson Reuters Foundation) - Tamil Nadu state must compensate the parents of a girl who was electrocuted to death in a textile mill where they worked as bonded laborers, India’s human rights panel has ordered.\nThursday’s order highlights the plight of millions of people working as virtual slaves to repay debts throughout India, including Tamil Nadu where the textile industry is concentrated, campaigners said.\n“Many are trapped in bondage in spinning mills in the region,” said Thangavel Maran of the charity Vizhuthugal (Roots), which took the case to the National Human Rights Commission (NHRC).\n“Nobody knows them and it is only when an incident like this happens that the cases come out,” he said. “It is the industry’s dirty secret.”\nEmployers often hold children to ensure that their parents return when they travel home for weddings or funerals.\nKarunaiyammal and Balasubramani Bathran said they were forced to leave their six-year-old daughter, Nalini, at the factory while they went home for a day trip in 2014.\n“We left early in the morning and by the time we came back in the evening, she had died,” said Balasubramani.\n“They said she had accidentally touched a live wire,” he told the Thomson Reuters Foundation by phone. “No other explanation was given and no help was offered.”\nIndia banned bonded labor in 1976 but it remains widespread across brick kilns, rice mills and other industries.\nMany bonded laborers are essentially enslaved, as they work to pay off heavy debts that are compounded by interest and shady accounting practices. Activists say they often end up paying 10 times the amount borrowed.\nEmployers commonly restrict the freedom of movement of bonded laborers, forcing them to live within the premises of their work site.\nAt the time of their child’s death, the Bathrans had been working for nearly two years to pay off a loan of 60,000 Indian rupees ($942).\nThe NHRC has instructed the Tamil Nadu government to recognize that the couple were in bondage and to compensate them according to the law.\nSome 500,000 manual laborers in 11 industries in Tamil Nadu, including the multi billion dollar textile industry, are trapped in debt bondage, according to the International Justice Mission, an anti-slavery organization.\nReporting by Anuradha Nagaraj, Editing by Jared Ferrie; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T21:34:00.000+02:00", "crawled": "2018-01-12T18:21:21.000+02:00", "highlightTitle": ""}