{"organizations": [], "uuid": "508253fae49b113d53a6a04f16fdad5aec775c7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-eva-sage-gavin-tapped-to-lead-accentureas-talent-organization-practice.html", "country": "US", "domain_rank": 767, "title": "Eva Sage-Gavin Tapped to Lead Accenture’s Talent & Organization Practice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:59:00.000+02:00", "replies_count": 0, "uuid": "508253fae49b113d53a6a04f16fdad5aec775c7c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-eva-sage-gavin-tapped-to-lead-accentureas-talent-organization-practice.html", "ord_in_thread": 0, "title": "Eva Sage-Gavin Tapped to Lead Accenture’s Talent & Organization Practice", "locations": [], "entities": {"persons": [{"name": "eva sage-gavin", "sentiment": "negative"}, {"name": "sage-gavin", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "acn", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "lead accenture’s talent & organization practice", "sentiment": "neutral"}, {"name": "pepsico", "sentiment": "none"}, {"name": "talent & organization", "sentiment": "none"}, {"name": "accenture", "sentiment": "none"}, {"name": "xerox", "sentiment": "none"}, {"name": "gap inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Accenture (NYSE: ACN) has hired Eva Sage-Gavin as a senior managing director to lead the company’s Talent & Organization practice, effective immediately.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180109005408/en/\nEva Sage-Gavin (Photo: Business Wire)\nIn this new role, Sage-Gavin will focus on helping Accenture’s clients and their workforces shift their leadership mindsets, talent and cultures — harnessing the power of digital technologies to innovate, unlock new sources of value and transform their businesses. She also will play a pivotal role in shaping the Talent & Organization practice’s market strategy, including offerings and investments.\nSage-Gavin brings with her more than three decades of senior leadership and human resources (HR) experience with Fortune 500 global consumer, technology and retail corporations. Serving in executive HR and C-suite leadership roles at Gap Inc., PepsiCo and Xerox, Sage-Gavin has shaped the business and human capital strategies for top global brands to compete in an increasingly connected world, fueled by rapid advances in technology and massive workforce change.\nIn addition, she has served as a senior advisor to G100 companies, delivering the latest insights and actionable ideas on leadership, talent strategies and innovation. Prior to joining Accenture, Sage-Gavin was a senior advisor at Boston Consulting Group (BCG) and member of the company’s CEO Advisory practice.\n“Eva is a proven business and HR leader, and her arrival comes at a strategically important time for our clients as they wrestle with how to navigate their digital transformations,” said Omar Abbosh, Accenture’s chief strategy officer. “Culture and people change are at the core of these transformations, and I’m delighted that Eva has joined us to lead our Accenture Talent & Organization team as it supports our clients along their journeys.”\nSage-Gavin said, “My passion is helping organizations build their workforces to deliver highly personalized and engaging employee experiences that improve their performance and grow their businesses. I am excited to join Accenture, a global leader in talent and organization, and I look forward to leading a skilled team whose mission is to help clients transform their performance to achieve new growth and success in a digital-first world that disrupts conventional practices.”\nSage-Gavin serves on the board of directors of BroadSoft and previously served as vice chair of the Aspen Institute’s Skills for America’s Future Advisory Board, as well as a member of the board of directors of TalentSky. She holds a bachelor's degree in industrial and labor relations from Cornell University.\nAbout Accenture\nAccenture is a leading global professional services company, providing a broad range of services and solutions in strategy, consulting, digital, technology and operations. Combining unmatched experience and specialized skills across more than 40 industries and all business functions – underpinned by the world’s largest delivery network – Accenture works at the intersection of business and technology to help clients improve their performance and create sustainable value for their stakeholders. With more than 435,000 people serving clients in more than 120 countries, Accenture drives innovation to improve the way the world works and lives. Visit us at www.accenture.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109005408/en/\nAccenture\nStacey Jones, +1-917-452-6561\nstacey.jones@accenture.com\nor\nSam Hyland, +1-917-452-5184\nsamuel.hyland@accenture.com\nSource: Accenture", "external_links": ["http://www.businesswire.com/news/home/20180109005408/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.accenture.com%2Fus-en%2Fnew-applied-now&esheet=51739923&newsitemid=20180109005408&lan=en-US&anchor=Accenture&index=1&md5=c96b5cf417dfdc5d3ee61d6bcaa64be4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.accenture.com%2Fus-en%2Fcompany-eva-sage-gavin&esheet=51739923&newsitemid=20180109005408&lan=en-US&anchor=Sage-Gavin&index=2&md5=17d688d90181fd137bb45941b822fcff", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.accenture.com%2F&esheet=51739923&newsitemid=20180109005408&lan=en-US&anchor=www.accenture.com&index=3&md5=b317f278c74dccdf5d9483e80e9f447c"], "published": "2018-01-09T14:59:00.000+02:00", "crawled": "2018-01-09T15:40:57.000+02:00", "highlightTitle": ""}