{"organizations": [], "uuid": "2682c3125a967434b1ce8b691d82c09f9ff566be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-millennium-blockchain-appoints-michael-terpin-to-board-of-advisors.html", "country": "US", "domain_rank": 767, "title": "Millennium Blockchain Appoints Michael Terpin to Board of Advisors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.03, "site_type": "news", "published": "2018-01-23T15:00:00.000+02:00", "replies_count": 0, "uuid": "2682c3125a967434b1ce8b691d82c09f9ff566be"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-millennium-blockchain-appoints-michael-terpin-to-board-of-advisors.html", "ord_in_thread": 0, "title": "Millennium Blockchain Appoints Michael Terpin to Board of Advisors", "locations": [], "entities": {"persons": [{"name": "michael terpin", "sentiment": "negative"}, {"name": "ja", "sentiment": "negative"}, {"name": "gil penchina", "sentiment": "none"}, {"name": "terpin", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "board of advisors world-renowned", "sentiment": "negative"}, {"name": "ico", "sentiment": "none"}, {"name": "board of advisors", "sentiment": "none"}, {"name": "alphabit fund", "sentiment": "none"}, {"name": "bitcoin syndicate", "sentiment": "none"}, {"name": "bancor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "World-renowned blockchain pioneer and communications executive to chair advisory board\nLAS VEGAS, Jan. 23, 2018 (GLOBE NEWSWIRE) -- Millennium Blockchain, Inc. (“THCT” or the “Company,”) (OTC:THCT) is pleased to announce that Michael Terpin has joined the Company’s newly formed Board of Advisors.\nIn early 2013, Terpin co-founded BitAngels, the world’s first angel network for digital currency startups, which gave birth in 2014 to the successful CoinAgenda series of blockchain investor conferences in North America, Europe/EMEA, Asia and Caribbean/LatAm. He co-founded early blockchain incubator bCommerce Labs; the Bitcoin Syndicate on AngelList (with legendary super-angel Gil Penchina), and the Dapps Fund, which was a lead investor in the initial crowdsale for Ethereum, Factom, MaidSafe and Storj. He currently heads up the ICO investment committee for Alphabit Fund, a $300 million digital currency fund registered in the Caymans, and advises numerous blockchain companies and foundations, including Bancor, ICOBox, Zed Networks, Polymath, and LiveEDU. Terpin has led the PR efforts for more than 150 blockchain companies and foundations, including some of the leading token crowdsales. Client successes include the launches of Aeternity, Augur, Bancor, Ethereum, Factom, Gnosis, Golem Network, Lisk, MaidSafe, Qtum, and Tether, as well as ongoing campaigns for Bittrex, Counterparty, Dash, Eos, Kraken, NEM, Neo, Storj and Shapeshift.\nPrior to his exclusive focus on blockchain, Terpin founded Marketwired, one of the world’s largest and most comprehensive international newswires, for which he was a finalist in the 2000 Ernst & Young Entrepreneur of the Year Award. Originally known as Internet Wire and funded by Sequoia Capital and Hummer Winblad Venture Partners, Marketwired was acquired in April 2006 by Toronto-based media company, CCN Matthews, and is now owned by NASDAQ, which acquired it in February 2016 for $200 million. Terpin holds an MFA in Creative Writing from SUNY at Buffalo and a dual Bachelor Degree in Newspaper Journalism and English Literature from Syracuse University. He serves as an advisor to SU’s Newhouse School of Public Communications, where he was inducted into its prestigious Wall of Fame. He is also an advisor to the Consumer Electronics Show, where he helps programs the blockchain content, including for CES Asia.\n“Blockchain is changing the world, and I’m proud to be a part of an organization that will be partnering with best-of-breed companies in blockchain, providing a channel for investors to easily invest in this area through traditional financial markets,” commented Michael Terpin.\nThe Millennium Blockchain Advisory Board will assist the Company’s management team to source, review, and consider investments and strategic partnerships for the Company. The advisory board will also provide additional ideas and support for new developments and assist to outline the strategic direction of the Company.\n“We are excited that Michael has joined the Advisory Board as chair; he is a pioneer in blockchain, cryptocurrency and communications,” commented Enzo Villani, Chairman of Millennium Blockchain.\nBrandon Romanek, CEO of Millennium Blockchain, said, “I am beyond honored to have Michael be the first person to join our Advisory Board as chairman. His experience in the blockchain market is unparalleled. We consider our Advisory Board key to our strategy and providing important guidance. Additionally, we’re hiring Transform PR ( transformgroup.io ) as our public relations Agency of Record.”\nAbout Millennium Blockchain\nThe Company is an international holding company focused on investing in blockchain technologies and crypto-assets focused on financial markets, healthcare, crypto-mining and high-technology. The Company filed an amendment to change its name from “THC Therapeutics, Inc.” to “Millennium Blockchain, Inc.” on January 17, 2018, and filed a corporate action notification form with FINRA thereafter. mblockchain.io\nThe Company has historically been focused on developing their patent-pending product, the dHydronator®, a sanitizing herb dryer. The main function of the dHydronator is to greatly accelerate the drying time of a herb while sanitizing it. The dHydronator can be used to dry a variety of herbs, and it has been specifically tested for use with cannabis, and it will reduce the drying time for cannabis from 10-14 days to less than 14 hours. For more information, visit THCTherapeutics.com .\nSafe Harbor Statement\nThis press release may contain “forward-looking statements” within the meaning of the federal securities laws. In this context, forward-looking statements may address the Company’s expected future business and financial performance, and often contain words such as “anticipates”, “beliefs”, “estimates”, “expects”, “intends”, “plans”, “seeks”, “will”, and other terms with similar meaning. These forward-looking statements by their nature address matters that are, to different degrees, uncertain. Although the Company believes that the assumptions upon which its forward-looking statements based are reasonable, it can provide no assurances that these assumptions will prove to be correct. All forward-looking statements in this press release are expressly qualified by such cautionary statements, risk, and uncertainties, and by reference to the underlying assumptions.\nMedia/Investors contact:\n(702) 602-8422\ninfo@mblockchain.io\nSource: THC Therapeutics", "external_links": ["https://www.globenewswire.com/Tracker?data=Wn8Gb-KYDrzsB7HDfEZ7hzOmX2OULba3rq0WvIOMXlhN8PB4CfZElAAx8-HDsOVoDEA9eYKScu4iMuV8gm6iUw==", "https://www.globenewswire.com/Tracker?data=l73e-E7d2Evt9-9v869-5kstBpwTNbFp1jjVy0egS7u8P0VYDN06YknT8vwVREwNw128vpu9sUbEOoVPaejEASgGQixVQ-YUb1cBO8JTCF6BoRY0wKj9gxRz2dOtXXUM39AWVK-8BGWsfWSJIkyxesLeTmWZsTQ-s1uVoPdutkVwYYKId6IBd3OQRFOrlCWSRrzhsL4anyCJm62lqW0oCDnqd20OgcaE5xjwVyRJcg3GwjzQt5WVISlPz6VvOZr6tgQV0d7g__8wbj9lBQDehQ==", "https://www.globenewswire.com/Tracker?data=YMKvklA30WqowUkPJ7CQKwR6mPQ1JMd_AHsWq_flHa_1OohTI46g7m5ZHj74j6QeZxuTOgyOvT40TPxL0_552fQVT6L8R3HqZevyR3KW9Ik="], "published": "2018-01-23T15:00:00.000+02:00", "crawled": "2018-01-23T18:42:32.008+02:00", "highlightTitle": ""}