{"organizations": [], "uuid": "838ca248d7c42a569d5cb1727bae27d609f40e15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/07/104267092-GettyImages-633960240.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/30/clouds-hang-over-2018-super-bowl-bonanza.html", "country": "US", "domain_rank": 767, "title": "Clouds hang over 2018 Super Bowl bonanza", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T20:50:00.000+02:00", "replies_count": 0, "uuid": "838ca248d7c42a569d5cb1727bae27d609f40e15"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/clouds-hang-over-2018-super-bowl-bonanza.html", "ord_in_thread": 0, "title": "Clouds hang over 2018 Super Bowl bonanza", "locations": [], "entities": {"persons": [{"name": "fox", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "kantar media", "sentiment": "none"}, {"name": "philadelphia eagles", "sentiment": "none"}, {"name": "new england patriots", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Super Bowl is the biggest day of the year for U.S. football fans, beer and snack foodmakers and advertising agencies. This Sunday, however, the championship game will also be a test for a sport under growing pressure.\nBroadcaster NBC, which is charging more than $5 million for a 30-second ad, estimates it will take in $500 million on February 4, including pre- and postgame coverage and the episode of the drama This is Us that will air after the game. That would be about the same that Fox took in last year, when ads averaged $5.05 million. A decade ago, commercial space cost an average of $2.7 million, according to Kantar Media.\nThe last time NBC aired the Super Bowl, in 2015, it was the most-watched U.S. television program ever with 114 million viewers. Sunday's match between the New England Patriots and Philadelphia Eagles is expected to once again top 110 million.\nBut even as Super Bowl viewership pulls away from the rest of television — audiences have surpassed 100 million every year since 2010, while overall TV ratings are in decline — the bonanza masks an increasingly fraught reality facing media companies, marketers and the National Football League.\nA number of clouds will hang over the field, from political polarisation to declining football viewership to the business woes of big Super Bowl advertisers such as Procter & Gamble , PepsiCo and AB InBev .\n\"Look for all those headwinds to make the Super Bowl an Alka-Seltzer moment for most marketers,\" says Allen Adamson, co-founder of the marketing consultancy Metaforce and a former executive at Unilever , the consumer goods group.\nReceive 4 weeks of unlimited digital access to the Financial Times for just $1 .\nMore from the Financial Times:\nHealth advocates call on Facebook to scrap Messenger Kids app\nState of the Union: what to look for from Donald Trump\nThomson Reuters in talks to sell part of terminals and data business\nThis season, players knelt during the national anthem to protest against police killings of unarmed African-Americans, drawing the ire of President Donald Trump, conservative commentators and some NFL fans.\nThe protests come as the league grapples with concerns over player safety and the impact of brain injuries linked to the game, raising questions about the long-term future of the sport.\nFootball has long been seen as immune to the wider trend of shrinking TV audiences — a third of the 100 most-watched U.S. programmes last year were professional or college games. But the fortress may be crumbling: a ratings drop that began in 2016 accelerated in 2017, with viewing of regular season games down 10 per cent, according to Nielsen.\nMarketers took note: NFL ad revenue dipped in the recently completed regular season for the first time, according to Standard Media Index.\nBrands that have spent millions on producing, airing and promoting Super Bowl ads will be watching to see if the season's turbulence spills into Sunday's game.\n\"Protests can become the centre of discussion. This is a huge problem because you want people talking about the advertising,\" says Tim Calkins, marketing professor at Northwestern University's Kellogg School of Management.\nThere is also the risk that hot-button issues will seep into Super Bowl ads, whether or not brands intend to take sides. Last year, Budweiser wound up mired in the public debate over Mr. Trump's immigration crackdown with an advertisement about Anheuser-Busch co-founder Adolphus Busch, a German migrant whose success was portrayed as the embodiment of the American dream.\n\"The big question is how will advertisers approach the very polarised environment we have in the U.S.,\" says Prof Calkins. \"The safe road is to stay as far away from controversy as you can. I suspect that's what most people will do. But the history of the Super Bowl is filled with examples of companies that get into big trouble by playing with controversial themes.\"\nThis year it is the post-Harvey Weinstein #MeToo moment that may colour reactions.\n\"It'll be highly unlikely that we see any remnants of the exploitation we have seen in years past,\" says Dan Granger, founder of Los Angeles ad agency Oxford Road, referring to ads filled with sexual innuendo from brands such as fast-food chain Carl's Jr and GoDaddy, the website registration company.\nHe says marketers will also be wary of \"pandering\" on social issues following Pepsi's widely mocked advertisement earlier this year that depicted Kendall Jenner, the reality television star and model, joining a protest and offering a can of fizzy drink to a police officer in the middle of a fraught stand-off.\n\"She probably spared us from half a dozen preachy commercials,\" he says. \"It'll be more subtle than it might have been thanks to Pepsi's folly.\"\nTaking on contentious subjects may detract from the fundamental purpose of advertising to TV's biggest audience. At last year's Super Bowl, Airbnb paid for a last-minute spot about diversity and inclusion that appeared to be a direct rebuke to Mr Trump just weeks after his inauguration.\nBut a study by the video ad technology company Unruly found that only 50 percent of people who saw Airbnb's spot remembered which brand it was promoting. That was below the 63 per cent average brand recall achieved by last year's Super Bowl ads and the 73 per cent average for non-Super Bowl ads.\nDespite the high stakes and eye-popping prices of Super Bowl advertising, big brands have little choice but to play along. At a time when audiences are switching off traditional TV in favour of streaming services, many of which are free of advertising, there are very few events that keep viewers tuned in like the NFL championship.\"\nYou would think that there's a lot of risk given the protests and the counter protests and the health issues and the ratings being down, but it does not seem to be having an impact on the price appetite for the game,\" says Mike Kelly, an advertising veteran and former executive at AOL, the Weather Channel and Time Warner . \"It's the last of the great big reach opportunities and, if you get it right, it gets people talking about your brand. It's hard to replicate.\"\nNBC is forecasting a $1.4bn haul in February, thanks to back-to-back coverage of the Super Bowl and the Winter Olympics.\"\nThere just aren't a lot of places you can find big ratings in a live environment and so advertisers clamour to those types of opportunities,\" says Dan Lovinger, head of ad sales at NBC's sports group.\nLive events are particularly compelling for big consumer brands that are under pressure from stagnating growth and activist investors. PepsiCo, AB InBev, P&G and Kraft have all been cutting costs — but all are shelling out for ads on Sunday.\nPepsiCo will air a number of commercials during the game, including one promoting a new variety of Doritos crisps and a novel flavour of its Mountain Dew drink. The company has started releasing trailers in an attempt to generate buzz ahead of the game.\n\"It's the most concentrated audience you can find, especially for a mass appeal product like ours,\" says Jen Saenz, chief marketing officer at the company's Frito-Lay division.\nAs long as the Super Bowl pulls in the biggest audience on TV, brands will keep placing their multimillion-dollar bets. The question is how much longer the big game can rise above the NFL's, and the broader media industry's woes — and whether it might be superseded by a more global sport.\n\"It's certainly painting a good picture for Fifa and Premier League. That is a global sport, that's growing. It's on its way up while the NFL may be on the way down,\" Mr Adamson says.", "external_links": [], "published": "2018-01-30T20:50:00.000+02:00", "crawled": "2018-01-30T21:25:25.018+02:00", "highlightTitle": ""}