{"organizations": [], "uuid": "affdbd53f67de3a216864e4e7383cc20937bb025", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 125}, "facebook": {"likes": 20, "shares": 20, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WX283_35s9p_TOP_20180109042354.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7455.xml", "section_title": "WSJ.com: WSJD", "url": "https://www.wsj.com/articles/techs-enormous-scale-samsung-now-outspends-exxon-and-shell-combined-1515490437", "country": "US", "domain_rank": 387, "title": "Tech’s Enormous Scale: Samsung Now Outspends Exxon and Shell Combined", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T11:33:00.000+02:00", "replies_count": 0, "uuid": "affdbd53f67de3a216864e4e7383cc20937bb025"}, "author": "Timothy W. Martin", "url": "https://www.wsj.com/articles/techs-enormous-scale-samsung-now-outspends-exxon-and-shell-combined-1515490437", "ord_in_thread": 0, "title": "Tech’s Enormous Scale: Samsung Now Outspends Exxon and Shell Combined", "locations": [], "entities": {"persons": [], "locations": [{"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "samsung", "sentiment": "negative"}, {"name": "shell combined", "sentiment": "negative"}, {"name": "samsung electronics co.", "sentiment": "negative"}, {"name": "s&p global market intelligence", "sentiment": "none"}, {"name": "exxon mobil corp.", "sentiment": "none"}, {"name": "royal dutch shell plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS SEOUL— Samsung Electronics Co. spent more money on capital expenditures last year than any other publicly traded company, offering a dramatic example of how technology and telecom firms have driven an uptick in global manufacturing investment.\nThe South Korean tech giant invested $44 billion to build or expand new facilities making semiconductors, displays and other products, according to S&P Global Market Intelligence estimates. That’s more than what Royal Dutch Shell PLC and Exxon Mobil Corp. , traditionally two of the largest investors, spent combined last year—and about 50% more than the next biggest spender, PetroChina Co.’s $29 billion.\nSamsung’s central role to the tech supply chain was put in focus Tuesday, when it estimated fourth-quarter operating profits of 15.1 trillion won ($14.1 billion). It would be the third straight quarter the conglomerate smashed earnings records, even as its de facto leader Lee Jae-yong is in prison after a corruption trial that gripped South Korea . \nSpending Capital Samsung Electronics spent heavily to boost manufacturing capacity for semiconductors, displays and other electronics. Top 10 capital spenders, 2017*\nSamsung Electronics\n$44 billion\nPetroChina\n29\nChina Mobile\n27\nGazprom\n25\nRoyal Dutch Shell\n23\nAT&T\n22\nArris\n22\nVolkswagen\n21\nExxon Mobil\n18\nVerizon Communications\n17\n*Estimate; among publicly traded companies\nSource: S&P Global Market Intelligence\nSamsung’s big bets underscore a bounceback in companies’ willingness to invest in boosting production during the years ahead, as 2017 marked an end to four straight years of declines, according to Goldman Sachs.Technology companies are projected to increase the most.\nDriving this is the proliferation of internet-connected gadgets, which demand the skilled manufacturing of dozens of micro-sized components. The advance toward artificial intelligence requires massive data-server farms that need immense computing power and memory chips.\n“Typically we think bigger is costlier,” said Henrich Greve, an entrepreneurship professor at INSEAD in Singapore. “But with technology, there are so many things that are very, very small but also quite costly.”\nThat’s put Samsung, the world’s largest smartphone maker, in a position to cash in. The company also supplies key parts to the likes of Apple Inc., Dell Technologies Inc., HP Inc. and Sony Corp. —whose smartphones, laptops and televisions rely on Samsung-made parts.\n“Samsung has no choice but to invest like this,” said Avril Wu, research director at DRAMeXchange, which tracks semiconductor sales and prices. “They still have to invest in order to secure more market share.”\nBut capital expenditure investments may not translate into job creation, in part because high-tech factory jobs are largely automated and much of the telecom investments don’t require much labor after network towers are set up, economists said. \nOther U.S. technology and telecom firms rank among the biggest capital-expenditure spenders. U.S. telecom giants AT&T Inc. and Verizon Communications Inc., along with Apple, Google parent Alphabet Inc. and Intel rank among the 25 biggest investors, according to the S&P Global Market Intelligence estimates. The 2017 figures track the calendar year. \nTech’s capital investments are driven by a dramatic rise in the number of internet-connected devices—from smartphones to wearables—which are expected to hit 73 billion by 2025, according to Rajiv Biswas, chief economist in Asia-Pacific for market researcher IHS Markit. \nTraditional industries are also modernizing operations, from the use of unmanned tractors to upgrading to heavily automated “smart” factories.\nAfter four straight years of declines, global capital expenditure grew in 2017, according to an October Goldman report, which expects annual growth of 3.2% over the next three years. Tech is expected to see the largest investment increases of 10.5% yearly from 2017 to 2020, Goldman says.\nCompanies’ optimism is also fueled by economic growth in Europe, U.S. tax and regulation changes that could spur wage and job gains, and a Chinese infrastructure initiative which ensures strong commodity demand, said Sree Ramaswamy, a partner at the McKinsey Global Institute.\nSamsung’s $44 billion in capital expenditure spending will largely go toward boosting production of flexible smartphone displays and memory chips that can store photos on smartphones or give devices their multi-tasking speed. \nA recent shortage of those types of memory chips has caused prices to dramatically spike and handed Samsung enormous clout in the global tech supply chain — a position it must not abuse, experts say.\n“Samsung is behaving like a central bank,” said CW Chung, a Seoul-based analyst at Nomura. “They have to avoid inflation but also deflation. Samsung wants to avoid too much of a shortage or an oversupply.”\nA Samsung spokesman declined to comment beyond what the company has publicly disclosed.\nOver the past two years, the prices of two main types of memory chips—one for content storage, known as NAND, and another giving devices their multitasking speed, known as DRAM—have both more than doubled, according to DRAMeXchange. Samsung controls nearly half of the DRAM market, while more than one-third of NAND.\nBut industry analysts are mixed on how long Samsung’s memory-chip magic will last. Morgan Stanley downgraded Samsung in November, expecting some memory chip prices to slide this year.\nSamsung in October said about two-thirds of its 2017 capital-expenditure investments were earmarked for semiconductors, with roughly a third dedicated for displays.\nIt has remained mum on how specifically the money will be spent--and where. It said it would spend 14.4 trillion won ($13.5 billion) into a new NAND factory in the coastal city of Pyeongtaek by 2021, while investing 6 trillion won in a new semiconductor production line in Hwaseong. But it did not elaborate on timing or product. The South Korean firm is also adding a production line to its NAND plant in Xi‘an, China, though it has yet to provide any specifics.\nWith last year the first time Samsung ranked No. 1 globally in expenditure, it will spend close to another $110 billion over the next three years, according to analysts polled by S&P Global Market Intelligence.\nWrite to Timothy W. Martin at timothy.martin@wsj.com", "external_links": [], "published": "2018-01-09T11:33:00.000+02:00", "crawled": "2018-01-09T13:31:54.009+02:00", "highlightTitle": ""}