{"organizations": [], "uuid": "59fb75f840976d8b7ddc21b24c8a32467306b5b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-beazley-appoints-john-moy-as-us-marine-underwriter-within-its-newly-launched-us-marine-platform.html", "country": "US", "domain_rank": 767, "title": "Beazley appoints John Moy as US marine underwriter within its newly-launched US marine platform", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-04T16:00:00.000+02:00", "replies_count": 0, "uuid": "59fb75f840976d8b7ddc21b24c8a32467306b5b6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-beazley-appoints-john-moy-as-us-marine-underwriter-within-its-newly-launched-us-marine-platform.html", "ord_in_thread": 0, "title": "Beazley appoints John Moy as US marine underwriter within its newly-launched US marine platform", "locations": [], "entities": {"persons": [{"name": "john moy", "sentiment": "negative"}, {"name": "beazley", "sentiment": "negative"}, {"name": "moy", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "steve vivian", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "beazley", "sentiment": "none"}], "organizations": [{"name": "water quality syndicate", "sentiment": "none"}, {"name": "american institute of marine underwriters", "sentiment": "none"}, {"name": "liability and energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New York,January 4th, 2018,Jan. 04, 2018(GLOBE NEWSWIRE) --\nSpecialist insurer Beazley has appointed John Moy as US marine underwriter within its newly- launched US marine platform. Mr Moy will report to Steve Vivian, head of US marine at Beazley, and will be responsible for underwriting and building the company’s US hull, protection & indemnity (P&I) and liability business for the marine and marine construction sectors. Mr Moy joins from Water Quality Syndicate in New York where he was Chief Underwriting Officer.\nMr Moy has a wealth of experience gained from a career that spans the US Merchant Marine, private shipping organizations and insurance sector, including the setting-up and management of marine underwriting operations. He currently serves on the Liability and Energy committees of the American Institute of Marine Underwriters.\nSteve Vivian commented: “John’s depth of experience and expertise makes him uniquely qualified to build out our hull and liability portfolio in the US. He has an extensive network across the marine broking, insurance and client communities in the US and is highly regarded for his knowledge of the market. I am delighted that he is joining us at this important stage of our growth.”\nMr Moy’s appointment follows Beazley’s announcement on November 30 th 2017 that it was establishing a US Marine platform with the strategic aim of capturing opportunities that do not typically get placed outside of the US domestic market.\nBeazley has been a prominent insurer of marine risks in the Lloyd’s market in London since 1999. The products offered in the US are available on both an admitted and non-admitted basis, and are designed to complement the large risk coverages available through Beazley’s London underwriters.\nNote to editors:\nBeazley plc is the parent company of specialist insurance businesses with operations in\nEurope, the US, Canada, Latin America, Asia, the Middle East and Australia. Beazley manages\nsix Lloyd’s syndicates and, in 2016, underwrote gross premiums worldwide of $2,195.6 million.\nAll Lloyd’s syndicates are rated A by A.M. Best.\nBeazley’s underwriters in the United States focus on writing a range of specialist insurance\nproducts. In the admitted market, coverage is provided by Beazley Insurance Company, Inc.,\nan A.M. Best A rated carrier licensed in all 50 states. In the surplus lines market, coverage is provided by the Beazley syndicates at Lloyd’s.\nBeazley is a market leader in many of its chosen lines, which include professional indemnity, property, marine, reinsurance, accident and life, and political risks and contingency business.\nFor more information please go to: www.beazley.com\nEleanor Lewis Beazley Group +44 (0)20 7667 0538 eleanor.lewis@beazley.com\nSource:Beazley Group", "external_links": ["https://www.globenewswire.com/Tracker?data=_Z4j2hsewXFusAyIXXlVAywBEfgoGjtP2eLyAizfcHS150HY2iVEaeg2CPhqGaZbxjDoDznkVje-J8w3VHEw4w==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/fb67ff63-ee69-4251-aa99-d6581f0fce34"], "published": "2018-01-04T16:00:00.000+02:00", "crawled": "2018-01-04T16:36:26.025+02:00", "highlightTitle": ""}