{"organizations": [], "uuid": "2c7ddd56beaa6077b98f376b5021389b7c720b02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226370963&w=1200&r=LYNXMPEE0S1F1", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-gymnastics-usa-nassar/olympic-probe-into-nassar-scandal-to-start-soon-idUSKBN1FI2CS", "country": "US", "domain_rank": 408, "title": "Olympic probe into Nassar scandal to start soon", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T20:14:00.000+02:00", "replies_count": 0, "uuid": "2c7ddd56beaa6077b98f376b5021389b7c720b02"}, "author": "", "url": "https://www.reuters.com/article/us-gymnastics-usa-nassar/olympic-probe-into-nassar-scandal-to-start-soon-idUSKBN1FI2CS", "ord_in_thread": 0, "title": "Olympic probe into Nassar scandal to start soon", "locations": [], "entities": {"persons": [{"name": "nassar", "sentiment": "negative"}, {"name": "aly raisman", "sentiment": "none"}, {"name": "larry nassar", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "usa gymnastics", "sentiment": "none"}, {"name": "u.s. olympic committee", "sentiment": "none"}, {"name": "usoc", "sentiment": "none"}, {"name": "michigan state university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - U.S. Olympic officials said on Monday an independent investigation would soon begin into how USA Gymnastics and the U.S. Olympic Committee failed to stop former doctor Larry Nassar from abusing scores of young female athletes.\nThe scandal surrounding Nassar’s abuse, which began decades ago, has already forced major changes at the institutions where he worked as a team doctor.\nThe entire board of USA Gymnastics (USAG), the national governing body for the sport, resigned last week after the U.S. Olympic Committee (USOC) threatened to decertify it. The president and athletic director at Michigan State University, where Nassar was also employed, stepped down as well.\nUSOC officials have come under fire from a number of Nassar’s victims, such as Olympic gold medalist Aly Raisman, for not adequately investigating repeated complaints about his abuse.\nIn a statement, the USOC said it had started interviewing candidates to lead the probe and expected to make a choice “in the coming days.”\n“The investigation ... will include a complete and unencumbered review of USA Gymnastics, the USOC, and all individuals associated with the organizations,” Susanne Lyons, an independent USOC board member overseeing the selection of the investigator, said in a statement. “The results of the independent investigation will be made public.”\nThe U.S. Congress said it would hold hearings on the case, sending letters of inquiry to USAG, the USOC and Michigan State, as well as USA Swimming and USA Taekwondo, which have been accused of allegedly failing to address accusations of sexual misconduct against coaches and officials.\nNassar, 54, on Wednesday was sentenced to up to 175 years in prison, following a weeklong court hearing that saw more than 150 of his victims, including some of the sport’s biggest names, publicly describe his assaults.\nOn Friday, Michigan Attorney General Bill Schuette, whose office prosecuted Nassar, named a special prosecutor to lead an ongoing investigation into Michigan State’s handling of the scandal.\nThe former doctor faces another sentencing on Wednesday in Michigan for a second set of abuse charges, part of a deal with prosecutors in which he pleaded guilty to crimes in two different counties. He is already serving a 60-year federal prison term for child pornography convictions.\nReporting by Joseph Ax; Editing by Andrew Hay\n ", "external_links": [], "published": "2018-01-29T20:14:00.000+02:00", "crawled": "2018-01-29T20:38:37.015+02:00", "highlightTitle": ""}