{"organizations": [], "uuid": "f349365d06c38a3f339c8027d734dc55c324ddea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-wealth-generators-announces-executive-management-team.html", "country": "US", "domain_rank": 767, "title": "Wealth Generators Announces Executive Management Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.097, "site_type": "news", "published": "2018-01-29T20:48:00.000+02:00", "replies_count": 0, "uuid": "f349365d06c38a3f339c8027d734dc55c324ddea"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-wealth-generators-announces-executive-management-team.html", "ord_in_thread": 0, "title": "Wealth Generators Announces Executive Management Team", "locations": [], "entities": {"persons": [{"name": "ricardo sousa", "sentiment": "none"}, {"name": "lance conrad", "sentiment": "none"}, {"name": "annette raynor", "sentiment": "none"}, {"name": "chad", "sentiment": "none"}, {"name": "chad garner", "sentiment": "none"}], "locations": [{"name": "lake city", "sentiment": "none"}, {"name": "ut", "sentiment": "none"}, {"name": "investview", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "wealth generators announces executive management team", "sentiment": "negative"}, {"name": "investview inc.", "sentiment": "negative"}, {"name": "investview", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SALT LAKE CITY, UT, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Investview Inc.’s (OTCQB: INVU) wholly owned subsidiary Wealth Generators has announced the installment of key executive positions enabling the founding management team to direct their full energy to the growth of Investview.\nChad Garner is the new President of Wealth Generators and takes the lead on the direction, expansion and growth of Wealth Generators’ products and services. As his first official announcement as President, Chad has installed Lance Conrad as the Vice President of Sales and Ricardo Sousa as Vice President of Sales for Latin America.\n“It is with great excitement and pleasure that we announce Chad Garner to lead the way for Wealth Generators! Since Chad joined as VP of Marketing he has embraced our fundamental principles and worldwide vision,” said Annette Raynor, Investview’s Chief Operations Officer.\nChad Garner brings over 15 years of sales, marketing, and operations experience having the rare ability to understand the needs of all aspects of the company. Chad was a founding member of the executive team for Daily Bread, a successful direct sales company. He's built and scaled multiple world-class sales organizations throughout his career.\nChad stated, “I am honored, passionate and committed to the growth and expansion of the company. I feel blessed to work with an incredibly talented team including our founders, corporate staff, and amazing field leaders. I believe our mission will succeed as we provide individuals access to the information they need to improve their financial future.”\nChad Garner has named Lance Conrad as Vice President of Worldwide Sales and Ricardo Sousa as Vice President of Sales, Latin America.\nLance Conrad has trained hundreds of thousands of distributors around the world and has built teams in 40+ countries. He has been featured in Network Marketing Times, recorded broadcasts for MLMnation.com and has been invited as a feature speaker for many companies within the MLM community. Lance was part of the key team that created mynt for Monavie enabling the company to grow for the first time in five years. His network marketing, branding, and training experience will greatly enhance the efforts of Wealth Generators worldwide.\nRicardo Sousa, Vice President of Sales/Latin America brings more than 15 years of Latin American sales and executive management experience, leading early growth in Spanish speaking markets. Ricardo served as Vice President of Latin American Sales for nearly a decade at Zrii, LLC. He has held executive management positions in both financial services firms such as Envision Lending Group as well as various network marketing companies including NuSkin. In each of these positions he established increased sales and successful expansion into the Latin American markets. Ricardo shares our passion in bringing financial education and tools to individuals who have lacked access to this information.\n“We believe our new Executive team for Wealth Generators will forge a strong path to our worldwide vision of knowledge, growth, and empowerment,” said Ryan Smith, Investview CEO.\nAbout Wealth Generators\nWealth Generators provides financial technology, education, and research to individuals to enable them to “Find, Grow, and Keep” their money. We are best described as a financial fitness company providing our customers the tools and information that can improve their financial situation.\nWealth Generators products are distributed through a direct sales model. Our products are offered to individuals on a monthly subscription basis. Wealth Generators is classified as a publisher of financial research and information and exempt from securities registration. This is an exemption provided in the U.S. Securities Investment Advisers Act of 1940.\nWealth Generators is not a brokerage firm or Registered Investment Advisor. We do not execute trades or take possession of clients’ brokerage accounts. Our customers may cancel their subscription at any time and execute trades at their own discretion. www.wealthgenerators.com\nAbout Investview, Inc.\nInvestview, Inc. is a diversified financial technology organization. The Company operates primarily through its wholly- and majority-owned subsidiaries, to provide financial products and services to accredited investors, self-directed investors and select financial institutions. www.investview.com\nForward-Looking Statements\nCertain statements in this press release may constitute “forward-looking statements”. When the words “believes,” “expects,” “plans,” “projects,” “estimates,” and similar expressions are used, they identify forward-looking statements. These forward-looking statements are based on Management’s current beliefs and assumptions and information currently available to Management and involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the company to be materially different from any future results, performance or achievements expressed or implied by these forward-looking statements. Information concerning factors that could cause our actual results to differ materially from these forward-looking statements can be found in our periodic reports filed with the Securities and Exchange Commission. We undertake no obligation to publicly release revisions to these forward-looking statements to reflect future events or circumstances or reflect the occurrence of unanticipated events.\nInvestor Contacts: ir@wealthgenerators.com\nSource:Investview Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=GSPt8PkDfDgs2PRvEVlinz3oKihrHmMNcQUmtJ1RWLu-FY0i5iIaTvdwJRb8ec5028R3lwbJfNa20J88RnbPOlHVOyenlLV0RPOtKjNOLrs=", "https://www.globenewswire.com/Tracker?data=xI7blJhnFO1xCqoyKrItNeTJbgFl7LOCTFaKkq7gCSWy95lsO3t83mBvoKuSQShJjVSl8kWtMZackwwV7uIApw7yG-2bAdi6Q-HRnpxZyv4=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0d9347a9-e86d-4971-9581-645863f3a619"], "published": "2018-01-29T20:48:00.000+02:00", "crawled": "2018-01-29T20:43:43.034+02:00", "highlightTitle": ""}