{"organizations": [], "uuid": "e83a6f62b1291fa1879bbeb1765ca42173ddf17f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-horizon-appoints-james-d-neff-president.html", "country": "US", "domain_rank": 767, "title": "Horizon Appoints James D. Neff President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-03T17:30:00.000+02:00", "replies_count": 0, "uuid": "e83a6f62b1291fa1879bbeb1765ca42173ddf17f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-horizon-appoints-james-d-neff-president.html", "ord_in_thread": 0, "title": "Horizon Appoints James D. Neff President", "locations": [], "entities": {"persons": [{"name": "james d. neff", "sentiment": "negative"}, {"name": "craig m. dwight", "sentiment": "negative"}, {"name": "neff", "sentiment": "none"}, {"name": "dwight", "sentiment": "none"}], "locations": [{"name": "michigan city", "sentiment": "none"}, {"name": "ind.", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "la porte", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "negative"}, {"name": "horizon bank", "sentiment": "none"}, {"name": "horizon bancorp", "sentiment": "none"}, {"name": "horizon", "sentiment": "none"}, {"name": "first of america bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MICHIGAN CITY, Ind., Jan. 03, 2018 (GLOBE NEWSWIRE) -- Craig M. Dwight, Chairman and Chief Executive Officer of Horizon Bancorp (NASDAQ:HBNC) is pleased to announce that on December 19, 2017, the Boards of Directors of Horizon and its wholly owned subsidiary, Horizon Bank (collectively, “Horizon”), named James D. Neff as President of both Horizon and Horizon Bank. In addition, Mr. Neff will serve on Horizon Bank’s board of directors. The promotion was effective January 1, 2018. Mr. Dwight stated that “Mr. Neff has been an integral part of Horizon’s executive management team since 1999 and a major contributor to Horizon’s success. As President, Mr. Neff will oversee retail banking, community reinvestment, retail mortgage, warehouse and consumer lending. His expanded authority and responsibilities will ensure Horizon’s continued commitment to excellence and profitable growth.”\nMr. Neff is a seasoned banker and started his banking career in August of 1978 with First of America Bank, La Porte, Indiana. He joined Horizon in October 1999 as Senior Vice President Mortgage Warehouse lending and was promoted to Executive Vice President in January 2004. In 2016, Mr. Neff assumed additional responsibilities over consumer lending. During his tenure with Horizon, Mr. Neff’s areas of responsibility have continued to grow, while maintaining proper internal controls and efficiency.\nMr. Neff is actively engaged in the community and currently serves on the Purdue University Northwest Advisory Board, the Sinai Forum Board and he is a member of the Michigan City Rotary Club. In addition, he has been the past President and campaign chairman of the Greater La Porte County United Way and served at all levels of the United Way’s annual campaign. Mr. Neff is a graduate of the La Porte County Leadership program and past associate member of La Porte County Board of Realtors, La Porte County Home Builders Association and the Michigan City Community Development Corporation. In addition, Mr. Neff has been a Salvation Army bell ringing volunteer for the past twenty-three years.\nMr. Neff graduated from Purdue University North Central with a degree in liberal arts and business administration. Mr. Neff and his family reside in La Porte County, Indiana.\nAbout Horizon Bancorp\nHorizon Bancorp is an independent, commercial bank holding company serving northern and central Indiana, southern and central Michigan and central Ohio through its commercial banking subsidiary Horizon Bank. Horizon also offers mortgage-banking services throughout the Midwest. Horizon may be reached online at www.horizonbank.com . Its common stock is traded on the NASDAQ Global Select Market under the symbol HBNC.\nForward Looking Statements\nThis press release may contain forward-looking statements regarding the financial performance, business prospects, growth and operating strategies of Horizon. For these statements, Horizon claims the protections of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. Statements in this press release should be considered in conjunction with the other information available about Horizon, including the information in the filings we make with the Securities and Exchange Commission. Forward-looking statements provide current expectations or forecasts of future events and are not guarantees of future performance. The forward-looking statements are based on management’s expectations and are subject to a number of risks and uncertainties. We have tried, wherever possible, to identify such statements by using words such as “anticipate,” “estimate,” “project,” “intend,” “plan,” “believe,” “will” and similar expressions in connection with any discussion of future operating or financial performance. Although management believes that the expectations reflected in such forward-looking statements are reasonable, actual results may differ materially from those expressed or implied in such statements. Risks and uncertainties that could cause actual results to differ materially include risk factors relating to the banking industry and the other factors detailed from time to time in Horizon’s reports filed with the Securities and Exchange Commission, including those described in its Form 10-K. Undue reliance should not be placed on the forward-looking statements, which speak only as of the date hereof. Horizon does not undertake, and specifically disclaims any obligation, to publicly release the result of any revisions that may be made to update any forward-looking statement to reflect the events or circumstances after the date on which the forward-looking statement is made, or reflect the occurrence of unanticipated events, except to the extent required by law.\nContact: Mark E. Secor\nChief Financial Officer\nPhone: (219) 873-2611\nFax: (219) 874-9280\nSource:Horizon Bancorp", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/335dbb54-33b2-4b86-8aa7-2e0a25f8bf63"], "published": "2018-01-03T17:30:00.000+02:00", "crawled": "2018-01-03T21:07:27.024+02:00", "highlightTitle": ""}