{"organizations": [], "uuid": "489e7150881bf408143402702551dba0fc9ac38a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/23/104126144-GettyImages-673125601.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/the-best-time-of-the-year-to-buy-everything.html", "country": "US", "domain_rank": 767, "title": "The best time of the year to buy everything", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.183, "site_type": "news", "published": "2018-01-07T18:01:00.000+02:00", "replies_count": 0, "uuid": "489e7150881bf408143402702551dba0fc9ac38a"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/05/the-best-time-of-the-year-to-buy-everything.html", "ord_in_thread": 0, "title": "The best time of the year to buy everything", "locations": [], "entities": {"persons": [{"name": "david pogue", "sentiment": "none"}, {"name": "pogue", "sentiment": "none"}], "locations": [], "organizations": [{"name": "yahoo", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you want to save money, sometimes, when you shop matters more than where you shop.\n\"In certain industries, the prices for products always drop at certain times of year, like clockwork,\" Yahoo tech columnist David Pogue writes in \" Pogue's Basics: Money .\"\nHis book provides a cheat sheet for the best time to buy just about everything, from luggage to gym memberships. Below, CNBC Make It highlights 17 essentials:\nJanuary Fitness equipment\nAfter the holidays and when New Year's resolutions are still in force, stores will start to lure customers in with sales, Pogue writes. Expect \" huge deals, from 30 to 70 percent off.\"\nCruises\n\"Sales on sailings usually arrive in January and February, when people are booking their spring break and summer cruises,\" says Pogue.\nIf you're planning a holiday cruise, look for another round of sales in October, he notes.\nshow chapters Shopping hacks that will save you thousands of dollars 11:37 AM ET Wed, 30 Nov 2016 | 01:31 February Cameras\nSpecifically, camera shop over President's Day weekend, Pogue says: \"New models usually debut in February, so you can count on big discounts on last year's models on Presidents' Day weekend.\"\nChocolate\nRight after Valentine's Day, you can find even the fancy stuff cheap.\nMarch Luggage\nNew luggage styles arrive in March in anticipation for summer travel, so you can find great deals on last year's suitcases. Plus, with Spring Break coming up, it's the perfect time to snag a new duffel.\n\"In August, another round of price cuts settles in, since people are pretty much finished with their summer travels,\" Pogue writes.\nshow chapters These 13 states have the best savers 9:53 AM ET Thu, 6 Oct 2016 | 02:24 April Cookware\nGraduation and wedding seasons are fast approaching, meaning you'll find good deals on kitchen supplies, particularly over Memorial Day weekend.\nMay Mattresses\nMemorial Day mattress sales are a real thing, Pogue says: \"The entire industry blows out last year's models over Memorial Day, so watch for crazy sales in May.\"\nIf you miss out on this specific weekend, don't stress. More sales will come around over the weekends of July 4 and Labor Day.\nJune Gym memberships\n\"The best deals, logically enough, sprout in June,\" writes Pogue. \"That's when demand is lowest, as people head outdoors for physical activity.\"\nshow chapters How to stay fit without joining a gym 3:09 PM ET Wed, 10 May 2017 | 02:35 July Jewelry\nValentine's Day is long gone, and there are no gift-giving holidays around the corner to boost stores' sales.\nCapitalize on the lull. You could even knock out a few Christmas gifts and have one less thing to worry about when the hectic holiday season rolls around.\nAugust Bathing suits and flip-flops\nSwim season is officially over and stores don't want shelves of swimwear that no one is going to buy, Pogue says.\nSnag them on clearance now … or pay much more right before heading out on a spring trip.\nCamping gear\nTake advantage of giant price cuts on outdoor essentials in August, advises Pogue: \"The summer's over, and so is demand for this stuff. Look for another rash of sales in October, too.\"\nshow chapters How rich people save 12:53 PM ET Tue, 28 March 2017 | 00:50 September Computers\nIf you're in the market for a new computer, wait until the back-to-school rush is over and buy one in September, Pogue advises.\nHe also notes that there will be more discounts in November, on Black Friday and Cyber Monday.\nCars\nIf you need a new ride, you'll get the best deal in September. It's the start of the model year and dealerships will be eager to clear last year's inventory.\nOctober Bicycles\nNew models start coming out in these fall months, meaning it's a great time to snag a sale on last year's bikes.\nshow chapters Stores use these 5 tricks to make you spend more during the holidays 7:59 AM ET Wed, 22 Nov 2017 | 00:58 November Candy\nSpecifically, right after Halloween. \"Every store and its brother slash prices to unload all the unsold candy,\" Pogue writes.\nYour options may be slim, but the prices will be hard to beat.\nElectronics\nThe hype that electronic stores get for Black Friday and Cyber Monday discounts isn't unjustified.\n\"Every category of gadget goes on sale: TVs, laptops, phones, tablets, cameras, and so on,\" Pogue writes. \"Every store and online retailer fights for headlines, and the winner is you.\"\nDecember Wedding dresses\nEven if the big day isn't until the spring or summer, start looking in the winter for a more affordable gown.\n\"Nobody's buying wedding stuff in November and December,\" says Pogue, \"so that's when the bridal shops mark down their wares to make room for the new year's designs.\"\nThis is an updated version of a previously published piece.\nLike this story? Like CNBC Make It on Facebook !\nDon't miss: 18 things worth paying extra for in 2018\nshow chapters Suze Orman says this mental shift is the key to saving money 7:59 AM ET Wed, 1 Nov 2017 | 00:59", "external_links": [], "published": "2018-01-07T18:01:00.000+02:00", "crawled": "2018-01-07T18:01:38.015+02:00", "highlightTitle": ""}