{"organizations": [], "uuid": "21e4901aa5a929a3f3014d817356b94054b8f54a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2017/12/30/the-associated-press-new-california-laws-cover-immigration-marijuana-education.html", "country": "US", "domain_rank": 767, "title": "New California laws cover immigration, marijuana, education", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-30T18:38:00.000+02:00", "replies_count": 0, "uuid": "21e4901aa5a929a3f3014d817356b94054b8f54a"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2017/12/30/the-associated-press-new-california-laws-cover-immigration-marijuana-education.html", "ord_in_thread": 0, "title": "New California laws cover immigration, marijuana, education", "locations": [], "entities": {"persons": [{"name": "jerry", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "new california", "sentiment": "none"}, {"name": "sacramento", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "immigration police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SACRAMENTO, Calif. (AP) — California state lawmakers in 2017 passed nearly 900 bills that Gov. Jerry Brown then signed into law. Most of them take effect Monday. The new laws cover topics ranging from the Trump administration's immigration crackdown, to the state's new recreational cannabis market, to the price of a college education.\nHere are some of the laws taking effect with the new year:\nIMMIGRATION\nPolice will no longer be able to ask people about their immigration status or participate in federal immigration enforcement actions under a law making California a sanctuary state. The law also allows jail officials to transfer inmates to federal immigration authorities only if they have been convicted of certain crimes.\nIt was among numerous bills designed to thwart the policies of President Donald Trump's administration.\nAlso starting Monday, immigration officials will need a warrant to access workplaces or employee records and landlords will be barred from disclosing tenants' citizenship. Another new law will prohibit university officials from cooperating with immigration officers.\nAn additional bill will bar law enforcement officials from detaining a crime victim or witness only because of an actual or suspected immigration violation, or turning them over to immigration authorities without a warrant.\nCANNABIS\nSales of recreational marijuana will be legal under a 2016 voter initiative that created the nation's biggest legal drug market.\nBut it will be illegal to take and drive a under bill taking effect Jan. 1 that outlaws smoking and ingesting marijuana, just as it's already unlawful for drivers or passengers to drink alcohol while driving. A separate law that took effect in June bars the possession of open containers of cannabis while driving.\nON THE JOB\nThe state minimum wage will increase to $10.50 per hour for businesses with 25 or fewer employees and to $11 per hour for those with 26 or more employees.\nSmall businesses with between 20 and 49 people will have to offer 12 weeks of unpaid maternity and paternity leave to employees.\nEmployers can't ask job applicants about their past salaries, a measure designed to narrow the pay gap between men and women.\nCalifornia will become the 10th state to require both public- and private-sector employers of five or more employees to delay background checks and inquiries about job applicants' conviction records until they have made a conditional job offer, a measure known as \"ban the box.\"\nThose arrested but not convicted of a crime may ask a judge to seal their records, a move advocates say will help them get hired.\nHEALTH-RELATED\nPharmaceutical companies must give advance notice before big price increases, although a drugmakers' trade group is suing to block the measure.\nIt will be illegal to deny admission to long-term care facilities based on gender identity or sexual orientation or to repeatedly fail to use a resident's preferred name or pronoun.\nCLIMATE CHANGE\nOld-fashioned incandescent light bulbs will start disappearing from shelves because they can no longer meet energy efficiency standards under a 2007 federal law. That leaves compact fluorescent lights or light-emitting diode bulbs under the regulations, which take effect nationwide in 2020. The federal law let California impose the higher standards two years early. Although the industry is fighting the change in court, a federal judge is letting the restriction take effect while the case continues.\nEDUCATION\nThe first year of community college may be free for full-time, in-state students under a law that waives the $46 per unit fee for one academic year for first-time students. Lawmakers still must provide the money in the next budget. California follows Tennessee in creating the program, though California previously offered free tuition until 1984.\nPublic schools must test yearly for lead in their water supplies under a law passed in response to problems in San Ysidro schools.\nStudents in grades 7-12 must be taught about sexual abuse and human trafficking prevention.\nSchools will be prohibited from \"lunch shaming,\" or publicly denying lunch to students or providing a snack instead because their parents haven't paid meal fees.\nPublic schools serving low-income students in grades 6 to 12 must provide free tampons and menstrual products in half of restrooms.\nFIREARMS\nAmmunition purchased in another state, online or through a catalog can't be brought into California except through a licensed ammunition dealer under Proposition 63, approved by voters in 2016. The initiative also sets a new process and deadlines for gun owners to give up their weapons if they are convicted of a felony or certain violent misdemeanors.\nSuperintendents can no longer allow people with permits to carry concealed guns on school grounds under a separate new law. Only about five school districts previously had such policies.\nCRIMINAL JUSTICE\nRepeat drug offenders will no longer automatically get an additional three years added to their sentences.\nCriminals who videotape or stream their crimes on social media could face longer sentences under a law that allows judges to consider the recordings as aggravating factors in sentences for certain violent crimes.\nOfficials must consider paroling inmates who are age 60 or older and have served at least 25 years under a law that largely mirrors a 2014 federal court order designed to help reduce prison overcrowding.\nIntentionally transmitting the AIDS-causing virus HIV is being reduced from a felony to a misdemeanor, the same punishment as transmitting other communicable diseases.\nJUVENILE OFFENDERS\nCalifornia inmates serving life sentences for crimes they committed as juveniles will get the chance to leave prison after 25 years, making state law conform to recent U.S. Supreme Court decisions.\nAnother bill expands California's youthful parole program to age 25. State law already required that inmates who were under 23 when they committed their crimes be considered for parole after serving at least 15 years.\nFamilies of youths in the juvenile justice system won't be charged fees that advocates say many can't afford to pay under a separate law. Another will require offenders age 15 or younger to consult with attorneys before waiving their rights.\nOne more bill will require that records be sealed for dismissed juvenile court petitions or after a juvenile completes a diversion program, while another will let a judge seal juvenile records even for serious or violent offenses after the offender has completed the sentence.", "external_links": [], "published": "2017-12-30T18:38:00.000+02:00", "crawled": "2018-01-01T08:01:08.023+02:00", "highlightTitle": ""}