{"organizations": [], "uuid": "c015eb26eff3dde858f8fbd795da02bddc9e7bfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/eu-ma/eu-mergers-and-takeovers-idUSL8N1PP6R7", "country": "US", "domain_rank": 408, "title": "EU mergers and takeovers (Jan 30)", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-31T01:05:00.000+02:00", "replies_count": 0, "uuid": "c015eb26eff3dde858f8fbd795da02bddc9e7bfa"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eu-ma/eu-mergers-and-takeovers-idUSL8N1PP6R7", "ord_in_thread": 0, "title": "EU mergers and takeovers (Jan 30)", "locations": [], "entities": {"persons": [{"name": "albea", "sentiment": "none"}, {"name": "edison", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "european commission", "sentiment": "negative"}, {"name": "pai partners", "sentiment": "none"}, {"name": "feb", "sentiment": "none"}, {"name": "scripps networks interactive inc", "sentiment": "none"}, {"name": "owens corning finland", "sentiment": "none"}, {"name": "hochtief", "sentiment": "none"}, {"name": "discovery communications", "sentiment": "none"}, {"name": "edf", "sentiment": "none"}, {"name": "c.e.t. clean energy trading gmbh", "sentiment": "none"}, {"name": "gas natural", "sentiment": "none"}, {"name": "gas natural vendita italia", "sentiment": "none"}, {"name": "parry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS, Jan 30 (Reuters) - The following are mergers under review by the European Commission and a brief guide to the EU merger process:\nAPPROVALS AND WITHDRAWALS -- German renewable energy producer BayWa r.e. to acquire all of the shares in and control over C.E.T. Clean Energy Trading GmbH (approved Jan. 29)\nNEW LISTINGS -- French private equity firm Pai Partners to acquire French packaging group Albea (notified Jan. 29/deadline March 5/simplified)\nEXTENSIONS AND OTHER CHANGES None\nFIRST-STAGE REVIEWS BY DEADLINE JAN 30 -- U.S. insulation and roofing company Owens Corning Finland to acquire financial services provider Parry 1 Holding (notified Dec. 15/deadline Jan. 30)\nFEB 6 -- Italian EDF unit Edison to buy Gas Natural’s unit Gas Natural Vendita Italia (notified Nov. 22/deadline Feb. 6/simplified)\n-- German engineering group Hochtief to take sole control of Spanish peer Abertis (notified Dec 22/deadline Feb 6.)\n-- U.S. television network Discovery Communications to acquire U.S. peer Scripps Networks Interactive Inc (notified Dec. 8/ deadline extended to Feb. 6 after Discovery offered concessions)\nFEB 12 -- Swiss logistics group Kuehne + Nagel to acquire sole control of the drinks distribution joint venture Kuehne + Nagel Drinkflow Logistics Holdings Limited (notified Jan. 8/deadline Feb. 12/simplified)\n-- Ireland’s Toohil Telecom to acquire Eircom Holdco SA from a group of investors. (notified Jan. 8/deadline Feb. 12/simplified)\nFEB 13 -- Private Equity Fund Nordic Capital VIII Limited to buy Alloheim Senioren-Residenzen Holding SE (notified Jan. 9/ deadline Feb. 13/ simplified)\n-- EDF unit EDF ENR PWT and Canadian Solar to set up a joint venture (notified Jan. 9/ deadline Feb. 13/ simplified)\nFEB 14 -- Car rental company Avis Budget Group and Turkey’s Koc Holding to acquire Avis’ Greek franchisee (notified Jan. 10/deadline Feb. 14/simplified)\n-- Units of Ivanhoe Cambridge and QuadReal Property to set up joint venture to invest in Indian real estate projects, particularly logistics parks (notified Jan. 10/ deadline Feb. 14/ simplified)\nFEB 15 -- Private equity firm Waterland to acquire Dutch energy provider De Nederlandse Energie Maatschappij (notified Jan. 11/deadline Feb. 15/simplified)\nFEB 16 -- German industrial gases group Linde to merge with U.S. peer Praxair (notified Jan. 12/ deadline Feb. 16)\n-- Shipping terminal investment holding PSA International to transfer sole control over PSA Panama International Terminal to joint control by PSA International and Terminal Investment Limited (notified Jan. 12/ deadline Feb. 16/ simplified)\nFEB 20 -- Swiss Bell Food, part of Coop-Group, to buy all of Stoffel Holding AG and indirectly obtaint 50.22 pct of the capital and 65.01 pct of the voting right of food producer Huegli Holding (notified Jan. 16/ deadline Feb. 20/ simplified)\n-- Macquarie Super Core Infrastructure Fund and Allianz Infrastructure Luxembourg to jointly acquire Lakeside Network Investments, an investor in Finnish electricity and district heating networks (notified Jan. 16/ deadline Feb. 20/ simplified)\n-- Goldman Sachs and Riverstone Investment Group to jointly acquire Lucid Energy Group II, a provider of natural gas processing and gathering in the United States (notified Jan. 16/ deadline Feb. 20/ simplified)\nFEB 21 -- U.S. car parts supplier Key Safety Systems, which is a unit of China’s Ningbo Joyson Electronic Corp, to acquire Japanese car parts maker Takata Corp (notified Jan. 17/deadline Feb. 21)\nFEB 22 -- Czech energy utility EPH to acquire a stake in power plant Matrai Eromu (notified Jan. 18/deadline Feb. 22/simplified)\n-- Aerospace and defence group Northrop Grumman to buy launch vehicle maker Orbital ATK (notified Jan. 18/ deadline Feb. 22/ simplified)\n-- Spanish insurer Mapfre to promote renewal of guarantee insurance policies in Spain through a joint venture with France’s Euler Hermes (notified Jan. 18/ deadline Feb. 22/ simplified)\nFEB 23 -- Votorantim Geracao de Energia, which is a unit of Votorantimand Canada Pension Plan Investment Board, to acquire several windfarm companies (notified Jan. 19/deadline Feb. 23/simplified)\nFEB 26 -- Baking products maker the Oetker-Gruppe to acquire Belgian bakery goods supplier Diversi Foods (notified Jan. 22/deadline Feb. 26/simplified)\n-- Anglo-Dutch oil group Royal Dutch Shell plc to acquire retail energy supplier Impello Limited (notified Jan. 22/deadline Feb. 26/simplified)\nFEB 27 -- Private equity firm PAI and Canadian institutional investor British Columbia Investment Management Corp to jointly acquire fruit juice maker Refresco (notified Jan. 23/deadline Feb. 27/simplified)\nFEB 28 -- Spanish energy company Repsol and South Korean carmaker KIA Motors to set up a car-sharing joint venture (notified Jan. 24/deadline Feb. 28/simplified)\n-- Chinese car parts maker Hasco and Canadian peer Magna to set up a joint venture (notified Jan. 24/deadline Feb. 28/simplified)\n-- Private equity firm Bain Capital to acquire Italian paper company Fedrigoni (notified Jan. 24/deadline Feb. 28/simplified)\nMARCH 2 -- Private equity firm TA Associates to aquire a minority stake in software company Flexera Holdings (notified Jan. 26/deadline March 2/simplified)\n-- Insurer ReAssure, which is part of Swiss Re, to acquire UK insurer Legal & General Group’s Actaeon insurance business (notified Jan. 26/deadline March 2/simplified)\nMARCH 12 -- German industrial group Bayer to acquire U.S. seeds company Monsanto (notified June 30/deadline extended to March 12 from March 5)\nMARCH 22 -- Italian eyewear maker Luxottica and French lens manufacturer Essilor to merge (notified Aug. 22/deadline extended to March 22 from March 8)\nMARCH 26 -- U.S. specialty material company Celanese and private equity firm Blackstone to combine their cellulose acetate tow units under a new joint venture (notified Sept. 9/deadline extended to March 26 from March 19)\nAPRIL 4 -- Luxembourg-based steelmaker ArcelorMittal to acquire Italian steel plant (notified Sept. 21/deadline extended to April 4 from March 23 after the companies asked for more time)\nMAY 30 -- South African chemicals company Tronox to acquire the titanium dioxide business of Cristal, a subsidiary of Saudi Arabia’s Tasnee (notified Nov. 15/deadline extended to May 30 from mAY 15)\nGUIDE TO EU MERGER PROCESS DEADLINES: The European Commission has 25 working days after a deal is filed for a first-stage review. It may extend that by 10 working days to 35 working days, to consider either a company’s proposed remedies or an EU member state’s request to handle the case.\nMost mergers win approval but occasionally the Commission opens a detailed second-stage investigation for up to 90 additional working days, which it may extend to 105 working days.\nSIMPLIFIED: Under the simplified procedure, the Commission announces the clearance of uncontroversial first-stage mergers without giving any reason for its decision. Cases may be reclassified as non-simplified - that is, ordinary first-stage reviews - until they are approved. (Reporting by Foo Yun Chee)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T01:05:00.000+02:00", "crawled": "2018-01-31T16:51:51.018+02:00", "highlightTitle": ""}