{"organizations": [], "uuid": "718d0e2a65999da7f95202d6080d9ed847b8a4b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225542238&w=1200&r=LYNXMPEE0P12D", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-ecb-banks-ethics/ecbs-draghi-bats-back-call-to-adopt-eu-register-for-lobbyists-idUKKBN1FF2A6", "country": "US", "domain_rank": 408, "title": "ECB's Draghi bats back call to adopt EU register for lobbyists", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T19:07:00.000+02:00", "replies_count": 0, "uuid": "718d0e2a65999da7f95202d6080d9ed847b8a4b7"}, "author": "", "url": "https://uk.reuters.com/article/uk-ecb-banks-ethics/ecbs-draghi-bats-back-call-to-adopt-eu-register-for-lobbyists-idUKKBN1FF2A6", "ord_in_thread": 0, "title": "ECB's Draghi bats back call to adopt EU register for lobbyists", "locations": [], "entities": {"persons": [{"name": "draghi", "sentiment": "negative"}, {"name": "mario draghi", "sentiment": "none"}, {"name": "francesco canepa", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "min read  frankfurt", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 5:08 PM / Updated 2 hours ago ECB's Draghi bats back call to adopt EU register for lobbyists Francesco Canepa 3 Min Read \nFRANKFURT (Reuters) - The European Central Bank’s President Mario Draghi has rejected calls from European lawmakers to have financiers who give advice and feedback to the ECB register as lobbyists, saying they merely provide “information”. \nNearly 30 members of the European Parliament wrote to Draghi after an activist group found that nearly all the participants in the ECB’s advisory groups came from the financial sector, mostly banks supervised by Frankfurt. \nThey asked Draghi if he would have members of these groups join the European Union’s transparency register. This shows what interests are being pursued, by whom and with what budget. Inclusion in the register is compulsory for those meeting high-ranking European Commission officials about policy. \nBut, in a letter published on Friday, Draghi said such groups were merely used by the ECB for “information gathering”. \n“In view of the solely information-gathering nature of the ECB’s contact groups, it would not be appropriate for their members to subscribe to the EU transparency register,” Draghi said in the letter, dated Jan. 23. \nECB officials hold regular meetings with around two dozen groups of experts from the private and public sector to hear their views on topics ranging from economic and market developments to financial infrastructure and payments. \nFor most groups, the ECB publishes a members’ list, agendas and accounts of the meetings and slides from presentations, albeit with a delay of several weeks. NOT LOBBYING \nBut Draghi said the groups’ activity did not touch on the ECB’s work as the euro zone’s top bank supervisor. \n“The ECB’s contact groups are not set up to channel advice or direct input to the ECB for the preparation of legislative proposals, policy initiatives or the implementation of ECB legislation,” Draghi said. \n“Hence the activities of these contact groups can in no way be compared with lobbying.” \nRecords of the October meeting of the ECB’s bond-market contact group showed some bankers voiced their concerns about the possible introduction of a rule forcing lenders to set aside capital against government debt. \nReuters reported in 2015 that three of the traders accused of manipulating euro money market Euribor rates were part of the ECB’s Money Market Contact Group. \nLast week the EU Ombudsman urged Draghi to give up his membership of the Group of 30, where financiers, policymakers and academics meet behind closed doors, because it risked hurting public confidence in the ECB’s independence. \nDraghi has yet to respond to the Ombudsman’s recommendation. \nIn his letter Draghi said any rule concerning ECB interaction with external parties should reflect “the scope and nature of the ECB’s tasks and objectives” and “not compromise (its) independence”. Reporting By Francesco Canepa; Editing by Gareth Jones", "external_links": [], "published": "2018-01-26T19:07:00.000+02:00", "crawled": "2018-01-26T21:13:43.002+02:00", "highlightTitle": ""}