{"organizations": [], "uuid": "b88a41f916f14c8cec71d42f7ca2421f4554640a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-christine-battist-appointed-chief-financial-officer-of-avison-young.html", "country": "US", "domain_rank": 767, "title": "Christine Battist appointed Chief Financial Officer of Avison Young", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.214, "site_type": "news", "published": "2018-01-17T18:00:00.000+02:00", "replies_count": 0, "uuid": "b88a41f916f14c8cec71d42f7ca2421f4554640a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-christine-battist-appointed-chief-financial-officer-of-avison-young.html", "ord_in_thread": 0, "title": "Christine Battist appointed Chief Financial Officer of Avison Young", "locations": [], "entities": {"persons": [{"name": "christine battist", "sentiment": "negative"}, {"name": "ja", "sentiment": "negative"}, {"name": "battist", "sentiment": "none"}, {"name": "mark e. rose", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "avison young corporate-finance", "sentiment": "negative"}, {"name": "two harbors investment corp", "sentiment": "none"}, {"name": "silver bay realty trust", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "pine river capital management", "sentiment": "none"}, {"name": "avison young", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Corporate-finance thought leader will lead\ncompany's finance and accounting organization\nTORONTO, Jan. 17, 2018 /PRNewswire/ - Mark E. Rose , Chair and CEO of Avison Young , the world's fastest-growing commercial real estate services firm, announced today that Christine Battist has joined the firm as a Principal and Chief Financial Officer.\nEffective immediately, Battist will lead the company's finance and accounting organization. Based in the firm's Chicago office, she will also serve on Avison Young's corporate leadership team and participate in the development and execution of the company's long-term growth strategy and profit goals.\nBattist brings more than 25 years of financial management experience to Avison Young, most recently as Chief Financial Officer of Silver Bay Realty Trust (NYSE: SBY) and, previously, Two Harbors Investment Corp (NYSE: TWO) – two public REITs associated with global alternative asset management firm Pine River Capital Management. During her career, she has managed the financial aspects of leading corporations within and outside the real estate sector, co-ordinating such matters as company formation, investor relations, recapitalization, internal financial controls, due diligence, risk management and financial audits.\n\"Our leadership team could not be more thrilled to welcome Christine to the CFO role,\" comments Rose. \"Her appointment reflects Avison Young's continuing effort to build the most talented and diverse management team in the industry. Christine is a finance thought leader with a proven track record and keen understanding of the levers that propel shareholder value. She has confidently navigated companies through exponential growth. Christine will lead the overall management of Avison Young's finance team and, sharing the benefits of her widespread experience, provide strategic and practical input to the management of the business.\"\nRose continues: \"Christine will manage the financing of our company's growth and relationships with investors and financing sources, and be responsible for the financial aspects of corporate-development decisions regarding acquisitions, divestitures and other related transactions, driving the company's continued rapid growth and success.\"\nBattist succeeds Gary Hubbard , who, after facilitating the smooth transition of the Chief Financial Officer duties to Battist and leading the completion of certain ongoing projects, intends to retire later this year after a 37-year career as a financial executive with global corporations.\n\"At this time, we would like to thank Gary Hubbard for his contributions to Avison Young's rapid growth as he concludes his distinguished career in corporate finance. During his nearly five years at Avison Young, Gary played a key role in our company's unprecedented growth and the development of our ongoing aggressive global expansion program. He has played a critical role in ensuring Avison Young's long-term financial success. We greatly appreciate his contributions and wish him the best in retirement.\"\nPrior to joining Two Harbors, Battist was director of investor relations at the Mosaic Company (NYSE: MOS), a Fortune 500 Company. She led investor relations during the company's recapitalization and spinoff of Mosaic's largest shareholder. Before moving into that role, she was Mosaic's director of financial compliance, establishing the newly formed company's inaugural Sarbanes-Oxley 404 program, effectively repositioning the firm's global internal-control environment. Earlier in her career, she was director of internal audit at Tuesday Morning Corporation (NASDAQ: TUES), where she established its inaugural internal audit function; and she has a decade of experience at PricewaterhouseCoopers LLP, overseeing engagements on M&A, due diligence, risk management and financial audits.\n\"I'm excited to be part of Avison Young's collaborative global culture, which prides itself on providing premier client service,\" says Battist. \"I'm looking forward to joining a dynamic, highly strategic leadership team that is committed to growth and commercial real estate industry leadership. I'll strive to transform Avison Young's enterprise capabilities to support the agile and efficient execution of key initiatives for the purpose of sustainable – and profitable – growth. I look forward to collaborating with my new colleagues across the company as we contribute to Avison Young's ongoing global expansion.\"\nBattist holds a bachelor of business administration in accounting from St. Norbert College in De Pere, Wisconsin. Committed to community involvement, she volunteers her service and financial expertise to organizations that promote education and financial independence for women and children, including the United Way and Girl Scouts.\nAvison Young Principal Bob Levine , who is a member of the firm's Board of Directors and chair of the audit committee, adds: \"The audit committee believes that Christine is very well-qualified to meet the needs of our fast growing company and will be a good fit for our collaborative culture, and we look forward to our collective work.\"\nOver the past nine years, Avison Young has grown from 11 to 82 offices and from 300 to more than 2,600 real estate professionals across Canada, the U.S., Mexico and Europe.\nAvison Young is the world's fastest-growing commercial real estate services firm. Headquartered in Toronto, Canada, Avison Young is a collaborative, global firm owned and operated by its principals. Founded in 1978, the company comprises 2,600 real estate professionals in 82 offices, providing value-added, client-centric investment sales, leasing, advisory, management, financing and mortgage placement services to owners and occupiers of office, retail, industrial, multi-family and hospitality properties.\nFor further information/comment/photos:\nSherry Quan , Principal, Global Director of Communications & Media Relations, Avison Young: 604.647.5098; cell: 604.726.0959 Mark Rose , Chair and CEO, Avison Young: 416.673.4028 Christine Battist , Principal and Chief Financial Officer, Avison Young: 312.957.7617\nwww.avisonyoung.com\nAvison Young was a winner of Canada's Best Managed Companies program in 2011 and requalified in 2017 to maintain its status as a Best Managed Gold Standard company\nFollow Avison Young on Twitter:\nFor industry news, press releases and market reports: www.twitter.com/avisonyoung\nFor Avison Young listings and deals: www.twitter.com/AYListingsDeals\nFollow Avison Young Bloggers : http://blog.avisonyoung.com\nFollow Avison Young on LinkedIn : www.linkedin.com/company/avison-young-commercial-real-estate\nFollow Avison Young on YouTube : www.youtube.com/user/AvisonYoungRE\nFollow Avison Young on Instagram: www.instagram.com/avison_young_global\nEditors/Reporters\nPlease click on link to view and download photo of Christine Battist:\nhttp://www.avisonyoung.ca/documents/20342/2631393/Christine_Battist.jpg\nSOURCE Avison Young Commercial Real Estate (BC)", "external_links": ["http://blog.avisonyoung.com/", "http://www.twitter.com/avisonyoung", "http://www.linkedin.com/company/avison-young-commercial-real-estate", "http://www.avisonyoung.com/", "http://www.youtube.com/user/AvisonYoungRE", "http://www.twitter.com/AYListingsDeals", "http://www.instagram.com/avison_young_global"], "published": "2018-01-17T18:00:00.000+02:00", "crawled": "2018-01-17T19:18:06.018+02:00", "highlightTitle": ""}