{"organizations": [], "uuid": "48c4230529d7fe7f069af465f4c47a2253a718b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-new-mountain-finance-corporation-extends-share-repurchase-program.html", "country": "US", "domain_rank": 767, "title": "New Mountain Finance Corporation Extends Share Repurchase Program", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-04T00:00:00.000+02:00", "replies_count": 0, "uuid": "48c4230529d7fe7f069af465f4c47a2253a718b2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-new-mountain-finance-corporation-extends-share-repurchase-program.html", "ord_in_thread": 0, "title": "New Mountain Finance Corporation Extends Share Repurchase Program", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "new mountain finance corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "nmfc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- New Mountain Finance Corporation (NYSE: NMFC) (“NMFC” or “the Company”) today announced that its board of directors has authorized an extension of a program for the purpose of repurchasing up to $50 million worth of its common stock, to be implemented at the discretion of NMFC’s management team. Under the repurchase program, NMFC may, but is not obligated to, repurchase its outstanding common stock in the open market from time to time provided that NMFC complies with the prohibitions under its Code of Ethics and the guidelines specified in Rule 10b-18 of the Securities Exchange Act of 1934, as amended, including certain price, market volume and timing constraints. Unless further extended by NMFC’s board of directors, the Company expects the repurchase program to be in place until the earlier of December 31, 2018 or until $50 million worth of NMFC’s outstanding shares of common stock have been repurchased. To date, approximately $2.9 million worth of repurchases have been made by the Company under the repurchase program.\nThe Company’s board of directors authorized the extension of the repurchase program because it believes that sustained market volatility and uncertainty may cause NMFC’s common stock to be undervalued from time to time. The timing and number of shares to be repurchased will depend on a number of factors, including market conditions and alternative investment opportunities. In addition, any subsequent repurchases will also be conducted in accordance with the Investment Company Act of 1940, as amended. There are no assurances that the Company will engage in additional repurchases, but if market conditions warrant, the Company now has an extended period of time to take advantage of situations where NMFC’s management believes share repurchases would be advantageous to the Company and to its shareholders.\nABOUT NEW MOUNTAIN FINANCE CORPORATION\nNew Mountain Finance Corporation is a closed-end, non-diversified and externally managed investment company that has elected to be regulated as a business development company under the Investment Company Act of 1940, as amended. The Company’s investment objective is to generate current income and capital appreciation through the sourcing and origination of debt securities at all levels of the capital structure, including first and second lien debt, notes, bonds and mezzanine securities. The Company’s first lien debt may include traditional first lien senior secured loans or unitranche loans. Unitranche loans combine characteristics of traditional first lien senior secured loans as well as second lien and subordinated loans. Unitranche loans will expose the Company to the risks associated with second lien and subordinated loans to the extent it invests in the “last out” tranche. In some cases, the investments may also include small equity interests. The Company’s investment activities are managed by its Investment Adviser, New Mountain Finance Advisers BDC, L.L.C., which is an investment adviser registered under the Investment Advisers Act of 1940, as amended. More information about New Mountain Finance Corporation can be found on the Company’s website at http://www.newmountainfinance.com .\nFORWARD-LOOKING STATEMENTS\nStatements included herein may contain “forward-looking statements”, which relate to NMFC’s future operations, future performance or financial condition. Forward-looking statements are not guarantees of future performance, condition or results and involve a number of risks and uncertainties. Actual results and outcomes may differ materially from those anticipated in the forward-looking statements as a result of a variety of factors, including those described from time to time in NMFC’s filings with the Securities and Exchange Commission or factors that are beyond NMFC’s control. NMFC undertakes no obligation to publicly update or revise any forward-looking statements made herein, unless required to do so by law. All forward-looking statements speak only as of the time of this press release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103005810/en/\nNew Mountain Finance Corporation\nInvestor Relations\nShiraz Y. Kajee, Authorized Representative\nNMFCIR@newmountaincapital.com\n(212) 220-3505\nSource: New Mountain Finance Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.newmountainfinance.com&esheet=51734062&newsitemid=20180103005810&lan=en-US&anchor=http%3A%2F%2Fwww.newmountainfinance.com&index=1&md5=fb3cb5607e61c42fa6f7b80c85463ec6", "http://www.businesswire.com/news/home/20180103005810/en/"], "published": "2018-01-04T00:00:00.000+02:00", "crawled": "2018-01-04T00:20:57.009+02:00", "highlightTitle": ""}