{"organizations": [], "uuid": "6703cfcc70fce4bf6bdb716d7725792cf177df8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-wintrust-announces-closing-of-previously-disclosed-veterans-first-mortgage-acquisition.html", "country": "US", "domain_rank": 767, "title": "Wintrust Announces Closing of Previously Disclosed Veterans First Mortgage Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.815, "site_type": "news", "published": "2018-01-05T02:10:00.000+02:00", "replies_count": 0, "uuid": "6703cfcc70fce4bf6bdb716d7725792cf177df8a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-wintrust-announces-closing-of-previously-disclosed-veterans-first-mortgage-acquisition.html", "ord_in_thread": 0, "title": "Wintrust Announces Closing of Previously Disclosed Veterans First Mortgage Acquisition", "locations": [], "entities": {"persons": [], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "rosemont", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}, {"name": "va", "sentiment": "none"}], "organizations": [{"name": "wintrust financial corporation", "sentiment": "negative"}, {"name": "nasda", "sentiment": "negative"}, {"name": "dba veterans first mortgage", "sentiment": "none"}, {"name": "wtfc", "sentiment": "none"}, {"name": "utah corporation", "sentiment": "none"}, {"name": "wintrust mortgage", "sentiment": "none"}, {"name": "veterans first mortgage", "sentiment": "none"}, {"name": "barrington bank & trust company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROSEMONT, Ill., Jan. 04, 2018 (GLOBE NEWSWIRE) -- Wintrust Financial Corporation (“Wintrust”) (Nasdaq:WTFC) announced that its subsidiary, Barrington Bank & Trust Company, N.A., through its division Wintrust Mortgage, closed on its previously disclosed agreement, acquiring certain assets and assuming certain liabilities of iFreedom Direct Corporation DBA Veterans First Mortgage, a Utah Corporation (“Veterans First Mortgage”). Wintrust Mortgage also acquired servicing rights from Veterans First Mortgage on approximately 8,300 loans, totaling an estimated $1.4 billion in principal balance.\nVeterans First Mortgage is a consumer direct lender with three offices, operating two in Salt Lake City and one in San Diego. The company originated in excess of $800 million in loans in 2017 and employs approximately 400 employees. Veterans First Mortgage specializes in VA lending, primarily for new home purchases, which is fairly unique to the consumer direct lending business. The acquisition brings Wintrust Mortgage a robust platform that integrates CRM technology, customized loan origination software and telephony systems to produce an efficient loan experience for its customers.\nTERMS OF THE TRANSACTION\nThe terms of this cash transaction are not being disclosed by the parties; however, a significant portion of the purchase price for Veterans First Mortgage assets is conditioned upon certain future profitability measures. The transaction is expected to be slightly accretive to Wintrust’s 2018 earnings per share.\nABOUT WINTRUST\nWintrust is a financial holding company with assets of approximately $27 billion whose common stock is traded on the NASDAQ Global Select Market. Built on the “HAVE IT ALL” model, Wintrust offers sophisticated technology and resources of a large bank while focusing on providing service-based community banking to each and every customer. Wintrust operates fifteen community bank subsidiaries, now with over 150 banking locations located in the greater Chicago and southern Wisconsin market areas. Additionally, Wintrust operates various non-bank business units including business units which provide commercial and life insurance premium financing in the United States, a premium finance company operating in Canada, a company providing short-term accounts receivable financing and value-added out-sourced administrative services to the temporary staffing services industry, a business unit engaging primarily in the origination and purchase of residential mortgages for sale into the secondary market throughout the United States, and companies providing wealth management services.\nForward-Looking Information\nThis press release contains forward-looking statements within the meaning of the federal securities laws relating to the acquisition of Veterans First Mortgage and its integration with Wintrust, the combination of their businesses and projected revenue, as well as profitability and earnings outlook. Investors are cautioned that such statements are predictions and actual events or results may differ materially. Wintrust's expected financial results or other plans are subject to a number of risks and uncertainties. For a discussion of such risks and uncertainties, which could cause actual results to differ from those contained in the forward-looking statements, see \"Risk Factors\" and the forward-looking statement disclosure contained in Wintrust's Annual Report on Form 10-K for the most recently ended fiscal year and any subsequent Quarterly Report on Form 10-Q. Forward-looking statements speak only as of the date made and Wintrust undertakes no duty to update the information.\nFOR MORE INFORMATION CONTACT: Edward J. Wehmer, President & Chief Executive Officer – Wintrust Financial Corporation David A. Dykstra, Senior Executive Vice President & Chief Operating Officer – Wintrust Financial Corporation (847) 939-9000 Wintrust Website address: www.wintrust.com\nSource:Wintrust Financial Corporation", "external_links": [], "published": "2018-01-05T02:10:00.000+02:00", "crawled": "2018-01-05T03:15:38.006+02:00", "highlightTitle": ""}