{"organizations": [], "uuid": "a4b7ee9fb4cd0f13866169439ab2e0e0835a9b0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/22/reuters-america-graphic-askmario-five-questions-for-the-ecb.html", "country": "US", "domain_rank": 767, "title": "GRAPHIC-#ASKMARIO: Five questions for the ECB", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T14:55:00.000+02:00", "replies_count": 0, "uuid": "a4b7ee9fb4cd0f13866169439ab2e0e0835a9b0a"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/22/reuters-america-graphic-askmario-five-questions-for-the-ecb.html", "ord_in_thread": 0, "title": "GRAPHIC-#ASKMARIO: Five questions for the ECB", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 22 (Reuters) - The European Central Bank meets on Thursday against a backdrop of heightened speculation over when it will end its vast stimulus and signal a rise in interest rates from record lows.\nJust a few weeks ago, the Jan. 25 policy meeting would have promised to be relatively uneventful, coming not long after the ECB unveiled a cut and extension of its asset purchases.\nYet recent commentary from ECB officials, hawkish December minutes, a soaring euro and oil prices suggest this meeting and the press conference that follows is shaping up to be a lively one. Here are the main questions investors would like answered:\n1. When will the ECB change its forward guidance?\nECB chief Mario Draghi is likely to be pressed for clarity on when a shift in the bank's policy stance can be expected given that the ECB has flagged \"early\" 2018 for a revision of its guidance.\nA Reuters source-based story last week dented talk about an imminent change in policy stance. But investors sense the days of extraordinary stimulus are over -- some ECB officials have questioned whether asset purchases need to continue beyond the September end-date.\n\"Markets want to know everything right now, but Draghi will be playing for time,\" said Societe Generale Ciaran O'Hagan.\n2. When will interest rates rise?\nThe press conference could be an opportunity for Draghi to more forcefully push back market rate-hike expectations and prevent unwelcome gains in the euro and in borrowing costs.\nBundesbank President Jens Weidmann said last week that analyst expectations for a rate hike in the middle of next year were roughly in line with the ECB's own guidance.\nInvestors have scaled back rate-hike expectations in the past week. Money markets price roughly a 45 percent chance of a 10 bps hike by year-end versus 70 percent earlier this month.\n3. What about the strength of the euro?\nThe euro is up 16 percent against the dollar since the start of 2017 and recent gains have prompted several ECB policymakers this month to express their unease. A surging euro makes the ECB's job tricky -- the ECB's latest projections assumed the euro would be valued at $1.17 this year. The currency is currently trading at around $1.22.\nOn a trade-weighted basis, the appreciation is less marked, at about seven percent over the past year and there is little evidence so far that a stronger euro is hurting exporters.\nAnalysts say that although the ECB would like a weaker currency to support economic growth, policymakers should be less worried as long as they believe the rise reflects a more solid economic backdrop and growing appetite for European assets.\n4. Has inflation turned a corner?\nEuro zone inflation remains below the ECB's near two percent target but strong economic growth in and outside the bloc, rising U.S. inflation and oil prices near three-year highs have boosted expectations for a pick-up in euro zone price pressures.\nThe five-year, five-year breakeven forward rate , a market gauge of inflation expectations tracked by the ECB, is close to its highest in almost a year.\nPay negotiations in Germany could also boost wage growth in Europe's biggest economy. That's something Draghi may be questioned on, although the German wage talks won't be over for some time. The ECB chief may also be asked whether he thinks higher oil prices are offsetting the impact of a strong euro on inflation.\n5. Who will replace Draghi as next ECB chief?\nUpcoming changes to the central bank's Governing Council mean investors are paying closer attention to who might succeed Draghi as ECB chief.\nEuro zone officials could pick a new vice president soon, previewing a tussle to replace Draghi when his term expires late in 2019.\nFrance and Germany could fight it out for the top ECB post, just as other major central banks undergo key changes. U.S Fed chair Janet Yellen is expected to be replaced by Jerome Powell next month. The Bank of Japan governor's term expires in April, China central bank's chief is expected to retire soon, and Mark Carney's term as Bank of England Governor ends in 2019.\n(Reporting by Dhara Ranasinghe, Fanny Potkin and Tommy Wilkes; Graphics by Ritvik Carvalho; Editing by )", "external_links": [], "published": "2018-01-22T14:55:00.000+02:00", "crawled": "2018-01-23T13:42:17.031+02:00", "highlightTitle": ""}