{"organizations": [], "uuid": "25b3ac973c5add46d5a0e303601aae2797daa743", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220098729&w=1200&r=LYNXMPEE060OX", "site_section": "http://feeds.reuters.com/reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-new-york-airport/flooding-at-jfk-airport-adds-to-misery-after-flight-delays-idUSKBN1EW0UM", "country": "US", "domain_rank": 408, "title": "Flooding at JFK airport adds to misery after flight delays", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T23:29:00.000+02:00", "replies_count": 0, "uuid": "25b3ac973c5add46d5a0e303601aae2797daa743"}, "author": "", "url": "https://www.reuters.com/article/us-new-york-airport/flooding-at-jfk-airport-adds-to-misery-after-flight-delays-idUSKBN1EW0UM", "ord_in_thread": 0, "title": "Flooding at JFK airport adds to misery after flight delays", "locations": [], "entities": {"persons": [{"name": "daniel trotta", "sentiment": "none"}], "locations": [{"name": "jfk airport", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "john f. kennedy international airport", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "cnn", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "port authority", "sentiment": "none"}, {"name": "u.s. northeast", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 9:30 PM / Updated 5 minutes ago Flooding at JFK airport adds to misery after flight delays Daniel Trotta 3 Min Read \nNEW YORK (Reuters) - Flooding due to a water main break forced the suspension of international flight arrivals at New York’s John F. Kennedy International Airport on Sunday, adding to the misery of travelers after a winter storm canceled or delayed hundreds of flights in recent days. \nWater poured from the ceiling onto a check-in counter and covered large areas of the floor of Terminal 4, video on CNN showed. The disruption occurred while the U.S. Northeast continued to endure bone-chilling weather with the New York temperature at 17 degrees Fahrenheit (minus -8 Celsius). [nL1N1P204P] \nInternational flights to Terminal 4 were suspended and passengers who had already arrived there were diverted to other terminals, according to the Port Authority of New York and New Jersey, which operates the airport. \nThe airport on Twitter advised travelers to check with their airlines before arriving. \n“There are about 3 inches (7.5 cm) of water inside the west end of Terminal 4, we have maintenance crews on the scene mopping and cleaning up,” Scott Ladd, a spokesman for the Port Authority, said in an email. \nPort Authority police and the Fire Department of New York were on the scene and assisting Port Authority operations managers and maintenance personnel, and the cause of the rupture was still being investigated, Ladd said. \nThe flooding hit just as the airport was crawling back to normal after a winter storm labeled a “bomb cyclone” forced the airport to close on Thursday. \nWhen operations resumed on Friday, the backlog led to hundreds more delays or cancellations, crowding the terminals with stranded passengers. \nMore than 500 flights into or out of JFK were canceled and nearly 1,400 delayed from Friday morning to Sunday afternoon, according to the flight-tracking website FlightAware. \nThe extreme cold and recovery from Thursday’s snow storm created a “cascading series of issues for the airlines and terminal operators,” the Port Authority said. \nEquipment froze and baggage handling was delayed, which was compounded by staff shortages and heavier than normal passenger loads, the Port Authority said. The backlog left passengers stuck on planes for long stretches while waiting for other aircraft to get in and out of gates. Reporting by Daniel Trotta; Editing by Sandra Maler", "external_links": [], "published": "2018-01-07T23:29:00.000+02:00", "crawled": "2018-01-07T23:38:40.006+02:00", "highlightTitle": ""}