{"organizations": [], "uuid": "25dd294a5e75da6e7527ac97716f27b9abc69660", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-pakistan-religion/pakistan-clerics-issue-fatwa-against-un-islamic-suicide-bombings-idUSKBN1F50L3", "country": "US", "domain_rank": 408, "title": "Pakistan clerics issue fatwa against 'un-Islamic' suicide bombings", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T08:48:00.000+02:00", "replies_count": 0, "uuid": "25dd294a5e75da6e7527ac97716f27b9abc69660"}, "author": "", "url": "https://www.reuters.com/article/us-pakistan-religion/pakistan-clerics-issue-fatwa-against-un-islamic-suicide-bombings-idUSKBN1F50L3", "ord_in_thread": 0, "title": "Pakistan clerics issue fatwa against 'un-Islamic' suicide bombings", "locations": [], "entities": {"persons": [{"name": "mamnoon hussain", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISLAMABAD (Reuters) - More than 1,800 Pakistani Muslim clerics have issued an Islamic directive, or fatwa, forbidding suicide bombings, in a book unveiled by the government on Tuesday.\nFor years, the South Asian nation has been plagued by violence by Islamist militants, who often use suicide bombers and preach that their struggle is a holy war to impose Islamic rule.\nSuicide attacks are frequently condemned as fanatical and immoral, especially when civilians are killed, but insurgents view the tactic as their most effective weapon.\nSeeking to curb “terrorism” that has resulted in tens of thousands of casualties since the early 2000s, the clerics declared suicide bombings to be forbidden, or “haraam”.\n“This fatwa provides a strong base for the stability of a moderate Islamic society,” Pakistan President Mamnoon Hussain wrote in the book, prepared by the state-run International Islamic University and released at an official ceremony.\n“We can seek guidance from this fatwa for building a national narrative in order to curb extremism, in keeping with the golden principles of Islam.”\nForeign and domestic critics of Pakistan’s government and military accuse them of cozying up to radical groups for political and military purposes and say the state has turned a blind eye to hate preachers in mosques for too long.\nThe fatwa was ratified by a number of prominent clerics who are outspoken critics of liberalism and the West, and are seen as controversial for preaching sectarianism or supporting the Afghan Taliban.\nOne of the clerics who signed, Muhammad Ahmed Ludhianvi, is the face of a banned sectarian organization, Ahle Sunnat Wal Jamat (ASWJ), and has been placed on a Pakistani legislative list of individuals with suspected links to “terrorism”.\nThe ASWJ figurehead, Aurangzeb Farooqi, attended the signing ceremony.\nAnother signatory, Hamid-ul-Haq, is the son of a cleric widely regarded as the “Father of the Afghan Taliban” after many prominent militants, including Taliban founder Mullah Mohammed Omar, were found to have graduated from his seminary in the northwestern city of Peshawar.\nPakistani officials deny frequent U.S. allegations about collaborating with militant Islamist proxies in Afghanistan and India, and say vast gains have been made over the past decade against militant outfits such as the Pakistani Taliban.\nBut privately they also warn any moves against some popular hardline groups based in Pakistan would take a long time and need to be undertaken carefully.\nSimilar anti-suicide bombing fatwas appear to have yielded scant results in the Middle East, where the practice is used by Islamic State and other militant groups.\nThe Pakistani scholars, who declared that “no individual or group has the authority to declare and wage jihad (holy war)”, said suicide bombings violate key Islamic teachings and, as such, were forbidden.\nReporting by Drazen Jorgic; Editing by Nick Macfie and Clarence Fernandez\n ", "external_links": [], "published": "2018-01-16T08:48:00.000+02:00", "crawled": "2018-01-16T08:59:40.028+02:00", "highlightTitle": ""}