{"organizations": [], "uuid": "98861c5a6a731949d0bd7583f0ee6788543ec143", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 28, "shares": 28, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-134970961.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/03/luxturna-blindness-cure-price/", "country": "US", "domain_rank": 1196, "title": "This Company Has a Possible Cure for Blindness at $425,000 Per Eye | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.142, "site_type": "news", "published": "2018-01-03T12:57:00.000+02:00", "replies_count": 0, "uuid": "98861c5a6a731949d0bd7583f0ee6788543ec143"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/03/luxturna-blindness-cure-price/", "ord_in_thread": 0, "title": "This Company Has a Possible Cure for Blindness at $425,000 Per Eye | Fortune", "locations": [], "entities": {"persons": [{"name": "luxturna", "sentiment": "none"}, {"name": "jef", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "u.s. food and drug administration", "sentiment": "none"}, {"name": "spark therapeutics inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 10:57 AM EST \nA transformative genetic treatment for a rare, inherited form of blindness will come with a price tag of of $425,000 per eye, or $850,000 for both, said Spark Therapeutics Inc., the tiny biotechnology company that is bringing the therapy to market. \nSince Spark’s Luxturna was approved by the U.S. Food and Drug Administration last month, speculation over the price has grown as it became clear the therapy would be one of the first in a wave of medicines that yield remarkable results after a single treatment — and would carry a commensurate cost. \nIn a novel arrangement, Spark will offer discounts based on whether or not the drug works initially and remains effective for the estimated 1,000 to 2,000 patients in the U.S. with a type of inherited retinal disease caused by a mutant gene. \n“We believe that this price reflects not only the breakthrough, life-altering value of one-time Luxturna, but it will enable us to continue to invest and build on the revolutionary science that supports not only Luxturna but the rest of our pipeline,” Chief Executive Officer Jeff Marrazzo said in a phone interview. \nSpark shares rose 1 percent to $53.85 at 9:33 a.m. Wednesday in New York. New Way to Pay \nThe company’s effectiveness-based discount is sharply different from how most drugs are currently sold. Health insurers are also used to paying for medicine over the course of a disease or over a patient’s life, in the case of some chronic conditions. \nA one-time treatment presented a challenge, since the cost would be paid for by one insurer or government, only to have others reap the benefits when the patient changes coverage. \nTo help mitigate that dynamic, Spark is rolling out several programs to spread out the cost over the years or give rebates to payers if the benefits wane with time. \nFor example, the company said it’s discussing a program with the U.S. Centers for Medicare & Medicaid Services that would spread payments for Luxturna over several years, even though the therapy would be given only once. It didn’t say how many installments would be made, or how long it would take to pay the full cost of the drug. \nIn an agreement with the Boston-area insurer Harvard Pilgrim Health Care, Spark will get the full price of treatment up front. If patients don’t get an immediate benefit — measured at 30 days, or a long term one — measured at 30 months, Spark will have to give some of the money back in a rebate. \nSpark has also proposed selling the gene therapy directly to insurance companies or specialty pharmacies. That would sidestep the current process that requires hospitals or health care providers to buy expensive therapies upfront. Spark is working with Express Scripts Holding Co. on such an arrangement, and said it’s talking with other drug plans. ‘Revolutionary Product’ \nExpress Scripts has been a frequent critic of costly drugs, yet said that the Spark treatment is an exception. \n“Many people were anticipating this would be more than a million dollars” said Steve Miller, the St. Louis-based company’s chief medical officer. “In the end, this is a revolutionary product, and I think in most plans this will be covered.” \nSpark’s biggest challenge may be finding patients to treat. \nOf the few thousand people with the disease, only a few have actually been tested and confirmed to have it, since there was no cure, and thus little use in diagnosis. Many with more advanced forms of the disease won’t qualify for treatment, according to the company. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T12:57:00.000+02:00", "crawled": "2018-01-03T18:35:09.018+02:00", "highlightTitle": ""}