{"organizations": [], "uuid": "cfede54a002570f0651c831900500f8c1c366373", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 59, "shares": 59, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221088113&w=1200&r=LYNXMPEE0A0LD", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea/last-minute-north-korean-visit-sends-olympics-planners-scrambling-idUSKBN1F010Z", "country": "US", "domain_rank": 408, "title": "Last-minute North Korean visit sends Olympics planners scrambling", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T11:49:00.000+02:00", "replies_count": 0, "uuid": "cfede54a002570f0651c831900500f8c1c366373"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea/last-minute-north-korean-visit-sends-olympics-planners-scrambling-idUSKBN1F010Z", "ord_in_thread": 0, "title": "Last-minute North Korean visit sends Olympics planners scrambling", "locations": [], "entities": {"persons": [{"name": "hyunjoo jin", "sentiment": "none"}, {"name": "jane chung", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - North Korea’s late announcement it will send a large delegation to next month’s Winter Olympics in South Korea has eased concerns over any Pyongyang threat during the games, but it does create headaches for planners over accommodations and security.\nThe North announced its participation on Tuesday after the first inter-Korean talks in two years, soothing tensions for the time being that Pyongyang might test-fire another long-range missile. Its escalating series of missile tests over the past year has sparked talk of war on the divided peninsula.\nBehind the scenes, the logistics of bringing hundreds of North Korean officials, athletes, cheerleaders and artistic performers is a challenge for both sides, officials and analysts say.\nBesides the basics of securing transportation and other accommodations, South Korean officials are keen to ensure the Olympics go off without a hitch. That also means preventing any controversy over the North Korean visitors, including protecting them from possible attacks by extremist South Korean groups.\nSouth Korea’s Unification Ministry said on Wednesday it hopes to hold working-level talks soon to sort out details of the visit.\nRyu Se-yeong, head of Allami Korea, one of the private security firms hired for the Games, said he was concerned about the lack of lead time to prepare for additional security for North Koreans, the vehicles and places to house the visitors.\n“Some of the hotels are already fully booked. I am worried where to accommodate such a large number of North Korean people. It is not easy to secure decent accommodations near the stadiums,” Ryu said.\nSouth Korean police have started preparations based on past experiences, which can be updated once North Korea provides its detailed plans, an official from South Korea’s National Policy Agency said.\nAVOIDING EMBARRASSMENT With Pyongyang and Seoul hoping to use the Olympics to signify a thaw in inter-Korean relations, both governments share fears that a member of the delegation could try to defect.\n“The North will choose and send verified people from its core class,” said Kim Kwang-jin, a North Korean defector and researcher at the Institute for National Security Strategy.\n“The North is also expected to divide its delegation into groups and ask them to monitor and control each other so that no one would leave the group,” he said.\nThe Olympics would be a “good opportunity” for the North to sneak spies into the South, and contact other spies already operating in the neighboring country, he added.\nResponding to that, a unification ministry spokesman told Reuters: “We will try our utmost to ensure security and safety so that the Olympics will take place smoothly.”\nPhotographers take photographs of a giant inflatable ball bearing the logo of the 2018 Pyeongchang Winter Olympics in Incheon, South Korea, November 1, 2017. REUTERS/Kim Hong-Ji North Korean athletes have previously participated three times in international multi-sport events hosted by South Korea - in 2002, 2003 and 2014 - but all those visits were scheduled far in advance.\nFor the 2002 Asian Games held in the southeastern port city of Busan, North Korea sent a 606-member delegation, including 184 athletes, 288 cheerleaders and 134 officers, by far the largest delegation. Cheerleaders traveled via a cruise ship, using the vessel as their accommodation.\nWhile there have been no known cases of North Koreans defecting during past games in South Korea, the South is expected to keep a close watch on them, said Hong Hyun-ik, a senior research fellow at Seoul’s Sejong Institute.\n”A defection of a single North Korean could pose a serious problem for inter-Korean relations,” he said.\nTRAVEL AND ACCOMMODATION The exact size of the North’s delegation and its travel route to Pyeongchang, just 80 km (49.71 miles) away from the heavily-fortified border between North and South Korea, have yet to be determined, the South’s unification ministry said.\nBut a source familiar with the matter told Reuters that the ministry expects the North Korean delegation to be comprised of 450 to 500 people, without providing details.\nOnly a figure skating pair from North Korea was qualified for the Games, but they missed the registration deadline in November. Still, the figure skaters and several other North Korean athletes could qualify through special places offered by the Olympic body.\nOfficials have said they are considering a number of travel possibilities, including a cruise ship, a flight or a land route across the heavily militarized border.\n“What we suggested to the North in December was sending a cruise ship because that could solve both accommodation and security,” said Kim Kyung-sung, chairman of a Seoul-based inter-Korean sports association, who met North Korean officials in December.\n“A cruise ship is available for up to 1,500 people, but in case they refuse to take a cruise, Gangwon province has prepared for separate accommodation,” he said.\nA spokesman for SkyBay Gyeongpo Hotel, one of the official accommodations in the city of Gangneung, where some of the Olympic events would be held, said the hotel had reserved some rooms for a possible North Korean delegation at the request of International Olympic Committee (IOC) officials.\nHe declined to give further details on the number of reserved rooms or when the IOC had contacted the hotel, noting that negotiations were continuing.\n“There are numerous available hotels here, but security is a bit of a concern,” said an official at Gangwon Province, which will host the Olympics.\nReporting By Hyunjoo Jin and Jane Chung; Additionaly reporting by Haejin Choi and Hyonhee Shin; Editing by Josh Smith and Bill Tarrant\n ", "external_links": [], "published": "2018-01-11T11:49:00.000+02:00", "crawled": "2018-01-11T12:57:42.010+02:00", "highlightTitle": ""}