{"organizations": [], "uuid": "698793561cb18bc5dfd5dc7d2b1093957e17c02f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224268544&w=1200&r=LYNXMPEE0L21I", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-vermont-marijuana/vermont-becomes-ninth-u-s-state-to-legalize-marijuana-idUKKBN1FB2VU", "country": "US", "domain_rank": 408, "title": "Vermont becomes ninth U.S. state to legalize marijuana", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T23:16:00.000+02:00", "replies_count": 0, "uuid": "698793561cb18bc5dfd5dc7d2b1093957e17c02f"}, "author": "", "url": "https://uk.reuters.com/article/us-vermont-marijuana/vermont-becomes-ninth-u-s-state-to-legalize-marijuana-idUKKBN1FB2VU", "ord_in_thread": 0, "title": "Vermont becomes ninth U.S. state to legalize marijuana", "locations": [], "entities": {"persons": [{"name": "phil scott", "sentiment": "none"}, {"name": "reuters/lucy nicholson", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "vermont", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "west hollywood", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 9:08 PM / Updated 35 minutes ago Vermont becomes ninth U.S. state to legalize marijuana Reuters Staff 2 Min Read \n(Reuters) - Vermont became the ninth U.S. state and third in the Northeast to legalize recreational marijuana use on Monday when Republican Governor Phil Scott signed a bill passed by the legislature earlier this month. \nThe law legalizes possession of up to 1 ounce of the drug, two mature plants and up to four immature plants by people 21 and older beginning on July 1. It does not legalize trade in the drug. \n“Today, with mixed emotions, I have signed H. 511,” Scott said in a statement, referring to the measure by its legislative number. \nHe noted that he had vetoed an earlier version of the bill that would have opened up sales of the drug, saying that a state commission would have time for further study before allowing a retail trade in recreational pot. \nNeighboring Massachusetts, nearby Maine and six other states have legalized marijuana use as a result of voter initiatives. A woman holds marijuana for sale at the MedMen store in West Hollywood. REUTERS/Lucy Nicholson \nNew Hampshire’s House of Representatives on Tuesday passed a similar bill to legalize recreational marijuana use. That state’s governor, Republican Chris Sununu, has said he opposes legalization. \nVermont is the first state to take this step by an act of the legislature, rather than as a ballot initiative. While it is one of the most politically liberal states, it is also one of 23 in the nation that do not allow ballot initiatives. \n“This is a great step forward for the state and the whole region,” Matt Simon, New England political director for the Marijuana Policy Project said in a statement. “Responsible adults will soon have the freedom to enjoy a safer option legally, and law enforcement will be free to concentrate on serious crimes with actual victims.” \nPossession of small amounts of the drug had already been a civil, rather than criminal, violation in Vermont. \n“I personally believe that what adults do behind closed doors and on private property is their choice, so long as it does not negatively impact the health and safety of others, especially children,” Scott said. Reporting by Scott Malone in Boston; Editing by Andrew Hay", "external_links": [], "published": "2018-01-22T23:16:00.000+02:00", "crawled": "2018-01-22T23:35:19.017+02:00", "highlightTitle": ""}