{"organizations": [], "uuid": "9ff6e7c49daff86c982df81dc49370ed97703965", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220485605&w=1200&r=LYNXMPEE080H8", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-germany-economy-output/german-economy-to-end-2017-with-a-bang-as-industrial-output-surges-idUSKBN1EY0SK", "country": "US", "domain_rank": 408, "title": "German industrial output surges, signaling a healthy 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:54:00.000+02:00", "replies_count": 0, "uuid": "9ff6e7c49daff86c982df81dc49370ed97703965"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-economy-output/german-economy-to-end-2017-with-a-bang-as-industrial-output-surges-idUSKBN1EY0SK", "ord_in_thread": 0, "title": "German industrial output surges, signaling a healthy 2018", "locations": [], "entities": {"persons": [{"name": "jennifer mckeown", "sentiment": "none"}, {"name": "matthias mach", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "novembe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "capital economics", "sentiment": "none"}, {"name": "federal statistics office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - Industrial production and exports from Germany rose more than expected in November, prompting the government to raise its estimate of growth for 2017 and signaling that its expansion would carry on this year.\nIndustrial output jumped 3.4 percent for the month, the biggest increase since September 2009, the Federal Statistics Office reported on Tuesday, overshooting a 1.8 percent forecast in a Reuters poll.\nSeasonally adjusted exports for November rose 4.1 percent on the month and domestic demand pushed imports up 2.3 percent. Both figures beat Reuters forecasts, and they widened the trade surplus to 22.3 billion euros ($26.61 billion) from 19.9 billion euros in October.\nThe figures and buoyant business sentiments suggest “that the German economy ended 2017 with a bang after the third quarter’s impressive 0.8 percent expansion,” Jennifer McKeown of Capital Economics wrote in a note.\nSoon after the data, the government raised its 2017 growth forecast to 2.2 percent from a previous estimate of 2.0 percent.\n“The economy is stable,” Deputy Economy Minister Matthias Machnig said. “And we assume that it will continue at about the same level.”\nA BRIGHT 2018 The economy has expanded every year for the past eight years, and it has continued to surge even though Chancellor Angela Merkel has failed to form a new coalition government after September’s national election, creating a political deadlock.\nThe rise in November’s output confirmed economists’ assumption that a 1.2 percent drop in October was caused by limited factors, namely two public holidays.\nA breakdown of the output data showed the main drivers were capital and consumer goods spending as well as construction.\nThe Statistics Office will publish on Thursday full-year gross domestic product figures for 2017, which are forecast to show 2.4 percent growth. Some analysts expect it to do better.\n“German GDP looks set to have risen by slightly more than our above-consensus forecast of 2.5 percent in 2017 and we expect a similarly strong pace of growth this year,” McKeown said.\nAdditional reporting by Rene Wagner and Gernot Heller, writing by Joseph Nasr,; editing by Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T16:54:00.000+02:00", "crawled": "2018-01-09T14:53:59.042+02:00", "highlightTitle": ""}