{"organizations": [], "uuid": "bff39383d43c2fecab9a1e62be9b16656556e078", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-valley-national-bancorp-completes-its-merger-of-usameribancorp-inc.html", "country": "US", "domain_rank": 767, "title": "Valley National Bancorp Completes Its Merger of USAmeriBancorp, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:00:00.000+02:00", "replies_count": 0, "uuid": "bff39383d43c2fecab9a1e62be9b16656556e078"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-valley-national-bancorp-completes-its-merger-of-usameribancorp-inc.html", "ord_in_thread": 0, "title": "Valley National Bancorp Completes Its Merger of USAmeriBancorp, Inc.", "locations": [], "entities": {"persons": [{"name": "montgomery", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "wayne", "sentiment": "none"}, {"name": "tallapoosa", "sentiment": "none"}, {"name": "valley", "sentiment": "none"}, {"name": "tampa bay", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "valley national bancorp", "sentiment": "neutral"}, {"name": "usameribancorp, inc", "sentiment": "neutral"}, {"name": "usameribancorp, inc.", "sentiment": "none"}, {"name": "valley", "sentiment": "none"}, {"name": "usab", "sentiment": "none"}, {"name": "valley national bank", "sentiment": "none"}, {"name": "usameribank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WAYNE, N.J., Jan. 2, 2018 /PRNewswire/ -- Valley National Bancorp (NYSE: VLY) (\"Valley\"), the holding company of Valley National Bank, announced that its merger with USAmeriBancorp, Inc. (\"USAB\") (OTC Pink: USAB) was completed effective January 1, 2018.\nValley will issue approximately 65 million shares of common stock in the transaction. The common shareholders of USAB will receive 6.1 shares of Valley common stock for each USAB share that they own.\nEffective January 1, 2018, USAB's wholly-owned subsidiary, USAmeriBank, was merged into and under the name Valley National Bank. As of September 30, 2017, USAB, largely through USAmeriBank, had approximately $4.5 billion in assets, $3.6 billion in net loans, $3.6 billion in deposits and a branch network of 29 offices. The acquisition represents a significant addition to Valley's Florida franchise, and will meaningfully enhance its presence in the Tampa Bay market, which is Florida's second largest metropolitan area by population. The acquisition will also bring Valley to the Birmingham, Montgomery and Tallapoosa areas in Alabama, where USAmeriBank has maintained 15 offices. Full systems integration is expected to be completed near the end of the first quarter of 2018.\nIra Robbins, CEO of Valley said, \"The completion of this transaction unites two strong institutions, giving us a more significant presence in new and existing markets. Additionally, this combination provides Valley with a substantial base for future organic growth across all aspects of the business. We are very excited to welcome USAmeriBank customers and employees into the Valley family. We look forward to working with Joe Chillura, and his team as we utilize their strong market expertise to expand the Valley brand.\"\n\"We are thrilled to join an institution that shares our commitment to highly personal service,\" said Joseph V. Chillura, CEO of USAB, who has joined Valley as the Regional President of the Florida West Coast and Alabama Division. \"I look forward to leading our organic growth efforts in Florida and Alabama, and as a team, we are excited about continuing the Valley tradition of providing first-rate service to all of our customers, while expanding our product offerings.\"\nIn connection with the merger, USAB Chairman, Jennifer W. Steans, has joined the Board of Directors of Valley.\n\"We welcome Jennifer Steans to Valley and look forward to her insights and contributions as we unite these two great institutions,\" said Gerald H. Lipkin, Chairman of the Board of Valley.\nAbout Valley\nValley National Bancorp is a regional bank holding company headquartered in Wayne, New Jersey with over $28 billion in assets. Its principal subsidiary, Valley National Bank, currently operates over 230 branch locations in northern and central New Jersey, the New York City boroughs of Manhattan, Brooklyn, Queens and Long Island, Florida and Alabama. Valley National Bank is one of the largest commercial banks headquartered in New Jersey and is committed to providing the most convenient service, the latest in product innovations and an experienced and knowledgeable staff with a high priority on friendly customer service. For more information about Valley National Bank and its products and services, please visit www.valleynationalbank.com or call our Customer Service Center at 800-522-4100.\nForward Looking Statements\nThe foregoing contains within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are not historical facts and include expressions about management's confidence and strategies and management's expectations about new and existing programs and products, acquisitions, relationships, opportunities, taxation, technology, market conditions and economic expectations. These statements may be identified by such forward-looking terminology as \"should,\" \"expect,\" \"believe,\" \"view,\" \"opportunity,\" \"allow,\" \"continues,\" \"reflects,\" \"typically,\" \"usually,\" \"anticipate,\" or similar statements or variations of such terms. Such involve certain risks and uncertainties. Actual results may differ materially from such . Factors that may cause actual results to differ materially from those contemplated by such include, but are not limited to:\nthe risk that the businesses of Valley and USAB may not be combined successfully, or such combination may take longer or be more difficult, time-consuming or costly to accomplish than expected; the diversion of management's time on issues relating to the merger with USAB; the inability to realize expected cost savings and synergies from the merger of USAB with Valley in the amounts or in the timeframe anticipated; the inability to retain USAB's customers and employees; weakness or a decline in the economy, mainly in New Jersey, New York and Florida, as well as an unexpected decline in commercial real estate values within our market areas; less than expected cost reductions and revenue enhancement from Valley's cost reduction plans including its earnings enhancement program called \"LIFT\"; damage verdicts or settlements or restrictions related to existing or potential litigations arising from claims of breach of fiduciary responsibility, negligence, fraud, contractual claims, environmental laws, patent or trade mark infringement, employment related claims, and other matters; the loss of or decrease in lower-cost funding sources within our deposit base may adversely impact our net interest income and net income; cyber attacks, computer viruses or other malware that may breach the security of our websites or other systems to obtain unauthorized access to confidential information, destroy data, disable or degrade service, or sabotage our systems; results of examinations by the OCC, the FRB, the CFPB and other regulatory authorities, including the possibility that any such regulatory authority may, among other things, require us to increase our allowance for credit losses, write-down assets, require us to reimburse customers, change the way we do business, or limit or eliminate certain other banking activities; changes in accounting policies or accounting standards, including the new authoritative accounting guidance (known as the current expected credit loss (CECL) model) which may increase the required level of our allowance for credit losses after adoption on January 1, 2020; higher or lower than expected income tax expense or tax rates, including increases or decreases resulting from changes in tax laws, regulations and case law; our inability or determination not to pay dividends at current levels, or at all, because of inadequate future earnings, regulatory restrictions or limitations, changes in our capital requirements or a decision to increase capital by retaining more earnings; higher than expected loan losses within one or more segments of our loan portfolio; unanticipated loan delinquencies, loss of collateral, decreased service revenues, and other potential negative effects on our business caused by severe weather or other external events; unexpected significant declines in the loan portfolio due to the lack of e", "external_links": ["http://www.prnewswire.com/news-releases/valley-national-bancorp-completes-its-merger-of-usameribancorp-inc-300575928.html"], "published": "2018-01-02T16:00:00.000+02:00", "crawled": "2018-01-02T16:20:14.027+02:00", "highlightTitle": ""}