{"organizations": [], "uuid": "646ff2780c0bba21f22993c466afa91473a4325b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-arch-capital-group-ltd-to-report-2017-fourth-quarter-results-on-february-12-2018.html", "country": "US", "domain_rank": 767, "title": "Arch Capital Group Ltd. to Report 2017 Fourth Quarter Results on February 12, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:47:00.000+02:00", "replies_count": 0, "uuid": "646ff2780c0bba21f22993c466afa91473a4325b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-arch-capital-group-ltd-to-report-2017-fourth-quarter-results-on-february-12-2018.html", "ord_in_thread": 0, "title": "Arch Capital Group Ltd. to Report 2017 Fourth Quarter Results on February 12, 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "bermuda", "sentiment": "none"}], "organizations": [{"name": "arch capital group ltd.", "sentiment": "negative"}, {"name": "acgl", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "eastern time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HAMILTON, Bermuda--(BUSINESS WIRE)-- Arch Capital Group Ltd. [NASDAQ: ACGL] announced that it expects to release its 2017 fourth quarter results after the close of regular stock market hours on Monday, February 12, 2018. The Company will hold a conference call for investors and analysts at 11:00 a.m. Eastern Time on Tuesday, February 13, 2018.\nA live webcast of this call will be available via the Investors section of the Company’s website at http://www.archcapgroup.com . A telephone replay of the conference call also will be available beginning on February 13 at 2:00 p.m. Eastern Time until February 20, 2018 at midnight Eastern Time. To access the replay, domestic callers should dial 855-859-2056, and international callers should dial 404-537-3406 (passcode 4685749 for all callers).\nArch Capital Group Ltd., a Bermuda-based company with approximately $11.04 billion in capital at September 30, 2017, provides insurance, reinsurance and mortgage insurance on a worldwide basis through its wholly owned subsidiaries.\nCautionary Note Regarding Forward-Looking Statements\nThe Private Securities Litigation Reform Act of 1995 provides a \"safe harbor\" for forward−looking statements. This release or any other written or oral statements made by or on behalf of Arch Capital Group Ltd. and its subsidiaries may include forward−looking statements, which reflect our current views with respect to future events and financial performance. All statements other than statements of historical fact included in or incorporated by reference in this release are forward−looking statements.\nForward−looking statements can generally be identified by the use of forward−looking terminology such as \"may,\" \"will,\" \"expect,\" \"intend,\" \"estimate,\" \"anticipate,\" \"believe\" or \"continue\" or their negative or variations or similar terminology. Forward−looking statements involve our current assessment of risks and uncertainties. Actual events and results may differ materially from those expressed or implied in these statements. A non-exclusive list of the important factors that could cause actual results to differ materially from those in such forward-looking statements includes the following: adverse general economic and market conditions; increased competition; pricing and policy term trends; fluctuations in the actions of rating agencies and our ability to maintain and improve our ratings; investment performance; the loss of key personnel; the adequacy of our loss reserves, severity and/or frequency of losses, greater than expected loss ratios and adverse development on claim and/or claim expense liabilities; greater frequency or severity of unpredictable natural and man-made catastrophic events; the impact of acts of terrorism and acts of war; changes in regulations and/or tax laws in the United States or elsewhere; our ability to successfully integrate, establish and maintain operating procedures as well as integrate the businesses we have acquired or may acquire into the existing operations; changes in accounting principles or policies; material differences between actual and expected assessments for guaranty funds and mandatory pooling arrangements; availability and cost to us of reinsurance to manage our gross and net exposures; the failure of others to meet their obligations to us; and other factors identified in our filings with the U.S. Securities and Exchange Commission.\nThe foregoing review of important factors should not be construed as exhaustive and should be read in conjunction with other cautionary statements that are included herein or elsewhere. All subsequent written and oral forward−looking statements attributable to us or persons acting on our behalf are expressly qualified in their entirety by these cautionary statements. We undertake no obligation to publicly update or revise any forward−looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109006050/en/\nArch Capital Group Ltd.\nMark D. Lyons, 441-278-9250\nSource: Arch Capital Group Ltd.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.archcapgroup.com&esheet=51739906&newsitemid=20180109006050&lan=en-US&anchor=http%3A%2F%2Fwww.archcapgroup.com&index=1&md5=eb3a4e2cce4a23d2fcfdcc8494ef5e4a", "http://www.businesswire.com/news/home/20180109006050/en/"], "published": "2018-01-09T16:47:00.000+02:00", "crawled": "2018-01-09T18:51:06.004+02:00", "highlightTitle": ""}