{"organizations": [], "uuid": "32417433bb2cc880c89e6c44405b0b8e8cb727ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-affiliate-of-sun-capital-agrees-to-sell-robertshaw-global-manufacturer-of-appliance-components-and-controls.html", "country": "US", "domain_rank": 767, "title": "Affiliate of Sun Capital Agrees to Sell Robertshaw, Global Manufacturer of Appliance Components and Controls", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-05T17:00:00.000+02:00", "replies_count": 0, "uuid": "32417433bb2cc880c89e6c44405b0b8e8cb727ee"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-affiliate-of-sun-capital-agrees-to-sell-robertshaw-global-manufacturer-of-appliance-components-and-controls.html", "ord_in_thread": 0, "title": "Affiliate of Sun Capital Agrees to Sell Robertshaw, Global Manufacturer of Appliance Components and Controls", "locations": [], "entities": {"persons": [{"name": "robertshaw", "sentiment": "negative"}, {"name": "marc leder", "sentiment": "none"}], "locations": [{"name": "boca raton", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "itasca", "sentiment": "none"}], "organizations": [{"name": "global manufacturer of appliance components", "sentiment": "negative"}, {"name": "affiliate of sun capital agrees", "sentiment": "negative"}, {"name": "sun capital partners, inc.", "sentiment": "neutral"}, {"name": "sun capital", "sentiment": "none"}, {"name": "robertshaw controls company", "sentiment": "none"}, {"name": "invensys appliance", "sentiment": "none"}, {"name": "schneider electric", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOCA RATON, Fla.--(BUSINESS WIRE)-- Sun Capital Partners, Inc. (“Sun Capital”), a leading private investment firm specializing in leveraged buyouts and investments in market-leading companies, today announced that its affiliate has entered into an agreement to sell Robertshaw Controls Company (“Robertshaw” or “the Company”), a global leader in thermal, flow, and control management products and solutions. Terms of the private transaction were not disclosed.\nHeadquartered in Itasca, Illinois, Robertshaw offers the industry’s most comprehensive portfolio of products and solutions, which are designed, engineered and manufactured to integrate seamlessly and aesthetically into OEM products to ensure consistent, safe and reliable performance. The Company has more than 6,100 employees in 11 countries.\n“Sun Capital saw the Company’s potential to be a market leader when it was the Invensys Appliance division of Schneider Electric,” said Marc Leder, Co-CEO at Sun Capital. “We are proud to have helped Robertshaw progress from good to great through a series of operational improvements and the strategic acquisition of Burner Systems International. This resulted in a doubling of profitability in less than four years.”\nSun Capital’s professionals worked with the management team on a variety of initiatives including building out a back-office infrastructure for the newly standalone business, streamlining procurement, and improving manufacturing processes.\n“The combination of a great management team under the leadership of Mark Balcunas and the strategic resources and investment provided by Sun Capital, has transformed Robertshaw into a market leader and preferred supplier of components to the residential and commercial appliance, HVAC, water heating and transportation sectors around the world,” said Jordan Wadsworth, Managing Director at Sun Capital. “Today, Robertshaw is well positioned to build on and extend its market leadership.”\nSun Capital has strong experience investing in and building industrial businesses, especially carve-outs from corporate parents. Current and past affiliated portfolio companies include Aclara, a leading global provider of smart infrastructure solutions for utilities, and ThermaSys Corporation, a manufacturer and supplier of engineered copper, brass and aluminum heat exchanger components and assemblies.\nAbout Sun Capital Partners, Inc.\nSun Capital Partners is a global private equity firm focused on identifying companies’ untapped potential and leveraging its deep operational and financial resources to transform results. Sun Capital is a trusted partner that is recognized for its investment and operational experience, including particular expertise in the consumer products and services, food and beverage, industrial, packaging, chemicals, building products, automotive, restaurant and retail sectors. Since 1995, Sun Capital has invested in more than 350 companies worldwide with revenues in excess of $45 billion across a broad range of industries and transaction structures. Sun Capital has offices in Boca Raton, Los Angeles and New York, and affiliates in London and Shenzhen.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005135/en/\nStanton\nDoug Allen, 646-502-3530\nDAllen@StantonPRM.com\nSource: Sun Capital Partners, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180105005135/en/"], "published": "2018-01-05T17:00:00.000+02:00", "crawled": "2018-01-05T17:53:36.011+02:00", "highlightTitle": ""}