{"organizations": [], "uuid": "24bf49d2fa1c32ffb57dcf4c425557a6744e1596", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-meg-whitman-joins-newtv-as-ceo.html", "country": "US", "domain_rank": 767, "title": "Meg Whitman Joins NewTV as CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T21:02:00.000+02:00", "replies_count": 0, "uuid": "24bf49d2fa1c32ffb57dcf4c425557a6744e1596"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-meg-whitman-joins-newtv-as-ceo.html", "ord_in_thread": 0, "title": "Meg Whitman Joins NewTV as CEO", "locations": [], "entities": {"persons": [{"name": "meg whitman joins newtv", "sentiment": "negative"}, {"name": "katzenberg", "sentiment": "none"}, {"name": "jeffrey katzenberg", "sentiment": "none"}, {"name": "meg whitman", "sentiment": "none"}, {"name": "whitman", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "ebay inc.", "sentiment": "none"}, {"name": "hewlett-packard company", "sentiment": "none"}, {"name": "hp inc", "sentiment": "none"}, {"name": "hewlett packard enterprise", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES--(BUSINESS WIRE)-- NewTV (working name), the mobile-first media platform incubated at WndrCo and founded by Jeffrey Katzenberg, today announced that Meg Whitman is joining the company as CEO, effective March 1. Whitman will be headquartered in Los Angeles. Katzenberg will serve as Chairman. NewTV will bring the highest quality Hollywood production values and storytelling to mobile, in bite-sized formats of 10 minutes or less. NewTV will provide a custom-designed, purpose-built technology platform for mobile, on-the-go viewing of the highest caliber curated content.\nWhitman’s more than 30 years of executive leadership experience span the technology and media industries. Most recently, Whitman served as CEO of Hewlett Packard Enterprise (HPE) where she continues to serve on the board. From 2011 through 2015, she served as President and CEO for Hewlett-Packard Company, leading the company’s turnaround and subsequent separation into two Fortune 100 companies: Hewlett Packard Enterprise and HP Inc. From 1998 to 2008, Whitman served as President and CEO of eBay Inc. where she oversaw its growth from 30 employees and $4 million in annual revenue to more than 15,000 employees and $8 billion in annual revenue. She has also held executive-level positions at Procter and Gamble Company, Hasbro Inc., The Walt Disney Company and Bain & Company. She currently serves as a director for Dropbox, The Procter & Gamble Company, Teach For America, and The Nature Conservancy and previously served on the board of DreamWorks Animation SKG.\n“Meg is one of the most accomplished and sought-after executives of our time. She has built and scaled some of the most important global companies today,” said Katzenberg. “To say I am thrilled that Meg will be at the helm would be an understatement. Her leadership, operational expertise, and deep understanding of technology and consumer behavior will be invaluable in creating the future of mobile entertainment.”\n“NewTV is one of the most disruptive and timely ideas I’ve come across during my career,” said Whitman. “I share Jeffrey’s vision that top-quality programming tailored to our mobile lifestyles is the next big touchpoint in entertainment. I’m very excited to bring my experience to a company that I believe will transform an industry and I am thrilled to be employee #1.”\nAbout WndrCo\nWndrCo is a holding company that acquires and develops businesses operating at the intersection of media and technology. Founded by entertainment and technology veterans, Ann Daly, Jeffrey Katzenberg, and Sujay Jaswa, WndrCo leverages its expertise and relationships to help companies recruit talent, expand operations, and grow revenue. WndrCo is co-headquartered in Los Angeles and San Francisco. Please visit www.wndrco.com for more information.\nAbout NewTV\nNewTV is a mobile-first media platform incubated at WndrCo and founded by Jeffrey Katzenberg. NewTV will bring the highest quality Hollywood-style productions to mobile, in bite-sized formats of 10 minutes or less. NewTV is headquartered in Los Angeles.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005836/en/\nMedia:\nDena Cook\nBrew PR\ndena@brewpr.com\nm: 310-600-7160\nSource: WndrCo", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.wndrco.com&esheet=51748285&newsitemid=20180124005836&lan=en-US&anchor=www.wndrco.com&index=2&md5=0d031d2445e5dcdd80fb318eb305fd39", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wndrco.com%2F&esheet=51748285&newsitemid=20180124005836&lan=en-US&anchor=WndrCo&index=1&md5=b88033322e7874f95338c6f091fabaab", "http://www.businesswire.com/news/home/20180124005836/en/"], "published": "2018-01-24T21:02:00.000+02:00", "crawled": "2018-01-24T23:10:32.003+02:00", "highlightTitle": ""}