{"organizations": [], "uuid": "c977714324236213efbb978f6d104f939163f0b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 115}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/12/28/103267938-5084317025_5f4a853968_o.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/09/ruby-tuesday-names-new-ceo-in-bid-to-turnaround-struggling-restaurants.html", "country": "US", "domain_rank": 767, "title": "Ruby Tuesday names new CEO in bid to turnaround struggling restaurants", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:15:00.000+02:00", "replies_count": 0, "uuid": "c977714324236213efbb978f6d104f939163f0b5"}, "author": "Sarah Whitten", "url": "https://www.cnbc.com/2018/01/09/ruby-tuesday-names-new-ceo-in-bid-to-turnaround-struggling-restaurants.html", "ord_in_thread": 0, "title": "Ruby Tuesday names new CEO in bid to turnaround struggling restaurants", "locations": [], "entities": {"persons": [{"name": "ray blanchette", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "blanchette", "sentiment": "none"}, {"name": "jim hyatt", "sentiment": "none"}, {"name": "aziz hashim", "sentiment": "none"}, {"name": "hashim", "sentiment": "none"}, {"name": "hyatt", "sentiment": "none"}], "locations": [{"name": "orlando", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "crab shack", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "nrd capital", "sentiment": "none"}, {"name": "ignite restaurant group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Let friends in your social network know what you are reading about Facebook Ruby Tuesday names new CEO in bid to turn around struggling restaurants Ruby Tuesday names Ray Blanchette as CEO, effective immediately. The restaurant company has struggled with slowing sales and traffic that has led to more than 100 store closures in the last year. Post to Facebook A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Ruby Tuesday names new CEO in bid to turn around struggling restaurants Sarah Whitten, CNBC Published 10:08 a.m. ET Jan. 9, 2018 CLOSE As 2017 comes to an end, so does Guy Fieri’s New York City restaurant. Guy’s American Kitchen and Bar in Times Square is set to close. Buz60's Djenane Beaulieu (@djenanebeaulieu) has the scoop. Buzz60 Ruby Tuesday said it had a total of 724 locations as of May 31. There were four restaurants in central Indiana. (Photo: Knoxville (Tenn.) News Sentinel) CONNECT COMMENT EMAIL MORE If you ask the executive team at Ruby Tuesday, they won't be shy about telling you the company is in trouble. That's why they are bringing in Ray Blanchette. Blanchette will take the mantle of CEO immediately, the company said Tuesday, with the aim of turning around the struggling brand. The restaurant has shuttered more than 100 restaurants since August. As of Dec. 1, it operates just under 600 locations. \"Clearly, it's a turnaround,\" Blanchette told CNBC at the ICR Conference in Orlando, Florida. \"We're not being shy about calling it that.\" Blanchette will replace interim CEO Aziz Hashim, managing partner of NRD Capital. Hashim took the reins from former CEO Jim Hyatt in December after Ruby Tuesday was taken private in a $335 million deal. Hyatt had been at the company since April. In Blanchette's more than 25 years in the industry, this isn't the first time his has been called upon to revive a company. Before becoming CEO of Au Bon Pain, which was recently acquired by JAB Holding's Panera, he revitalized Joe's Crab Shack as CEO of Ignite Restaurant Group. \"I feel like I grew up in bar and grill,\" said Blanchette, who worked with TGI Friday's for 18 years. \"This is kind of a homecoming for me. I'm excited to now lead a brand that I've competed with for decades.\"", "external_links": [], "published": "2018-01-09T16:15:00.000+02:00", "crawled": "2018-01-09T16:30:07.022+02:00", "highlightTitle": ""}