{"organizations": [], "uuid": "d2f854dd86f2d9c9919e8753b314ebe189b3b33a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-sca--year-end-report-2017.html", "country": "US", "domain_rank": 767, "title": "SCA - Year-end Report 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T10:37:00.000+02:00", "replies_count": 0, "uuid": "d2f854dd86f2d9c9919e8753b314ebe189b3b33a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-sca--year-end-report-2017.html", "ord_in_thread": 0, "title": "SCA - Year-end Report 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "sca", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SUNDSVALL, Sweden, Jan. 30, 2018 /PRNewswire/ --\nJANUARY 1 – DECEMBER 31, 2017\n(compared with the year-earlier period, continuing operations)\nNet sales increased 8% to SEK 16,664m (15,373) Adjusted EBITDA improved 15% to SEK 3,761m (3,269) The adjusted EBITDA margin increased to 22.6% (21.3) Adjusted operating profit totaled SEK 2,624m (2,155) Operating profit totaled SEK 2,511m (2,271) Net profit for the period totaled SEK 1,873m (1,770) Earnings per share amounted to SEK 2.67 (2.52) Operating cash flow totaled SEK 2,273m (1,917) The Board of Directors proposes a dividend of SEK 1.50 per share\nCOMMENTS ON THE FINANCIAL STATEMENTS\n2017 was a strong year for SCA, with a generally healthy demand and price trend within all segments and geographies. Sales grew by 8% and adjusted EBITDA increased by 15%. The main contribution to this improvement was from kraftliner and wood products. The improvement in earnings took place despite project costs linked to the major investment in the Östrand pulp mill, more extensive maintenance stops than in 2016 and additional costs for SCA following the split.\nThe market trend in 2017 was positive for all SCA products, apart from publication paper where the market was stable. At the end of the year, the market for publication paper improved slightly. There were price increases for wood products, pulp and kraftliner during the year. These price increases were implemented successively. The price of publication paper decreased during the first six months of the year and was stable during the second half of the year.\nProduction remained stable in 2017. Pulp production was at slightly lower levels than in 2016 due to the ongoing expansion project and longer maintenance stops. Production of wood products and paper was higher in 2017 than in the previous year.\nEarnings for the Forest segment were higher than in 2016, mainly as a result of a higher level of timber deliveries from SCA-owned forest. During the year timber prices and timber supply to SCA's industries remained stable.\nThe Wood segment reported a significant improvement in earnings, due to higher prices, strong production and higher volumes. Demand for wood products developed positively in all of SCA's main markets, driven by a high level of construction activity and an expanding renovation market.\nLower delivery volumes for the Pulp segment resulted in weaker earnings compared with 2016. Longer maintenance stops and costs linked to the major investment in the Östrand pulp mill had a negative impact on earnings. SCA is investing SEK 7.8bn in doubling the production of bleached softwood kraft pulp. The project is in line with both budget and timetable. The expanded plant will begin operating in June 2018 and will thereafter gradually increase to full capacity.\nEarnings for the Paper segment improved significantly. The earnings improvement was primarily due to the positive trend in the kraftliner market, with three price increases during 2017. Stable production in combination with a strong market contributed to the good result. Production in Obbola's kraftliner mill was at record levels in 2017. The structural reduction in demand for publication paper continued. Capacity reductions during the year compensated somewhat for the decline.\nINVITATION TO PRESS CONFERENCE ON YEAR-END REPORT 2017\nMembers of the media and analysts are hereby invited to attend a press conference where this interim report will be presented by the President and CEO, Ulf Larsson, and CFO, Toby Lawton.\nTime: January 30, 2018 at 10:00 a.m.\nVenue: St:a Clara, Lundqvist & Lindqvist Klara Strand, Klarabergsviadukten 90 in Stockholm, Sweden.\nThe press conference will be webcast live at www.sca.com . It is also possible to participate by telephone by calling:\nSweden: +46 (0) 8 5661 9445, UK: +44 (0) 1452 541 003, or the US: +1 646 741 2120\nSpecify \"SCA\" or the conference ID: 3187733\nSVENSKA CELLULOSA AKTIEBOLAGET SCA (publ)\nUlf Larsson\nPresident and CEO\nFor further information, please contact\nUlf Larsson, President and CEO, +46 (0)60 19 46 46\nToby Lawton, CFO, +46 (0)60 19 31 09\nBjörn Lyngfelt, Senior Vice President, Group Communications, +46 (0)60 19 34 98\nAndreas Ewertz, Investor Relations Director, +46 (0)60 19 31 97\nPlease note :\nThis is information that SCA is obliged to make public pursuant to the EU Market Abuse Regulation and the Securities Markets Act. This report has been prepared in both Swedish and English versions. In case of variations in the content between the two versions, the Swedish version shall govern. The information was submitted for publication, through the agency of the contact person set out below, on January 30, 2018 at 08:00 a.m. CET. The report has not been reviewed by the company's auditors.\nThis information was brought to you by Cision http://news.cision.com\nhttp://news.cision.com/sca/r/year-end-report-2017,c2440471\nThe following files are available for download:\nhttp://mb.cision.com/Main/600/2440471/783807.pdf\nThe full report (PDF)\nView original content: http://www.prnewswire.com/news-releases/sca---year-end-report-2017-300590030.html\nSOURCE SCA", "external_links": ["http://news.cision.com/", "http://mb.cision.com/Main/600/2440471/783807.pdf", "http://www.prnewswire.com/news-releases/sca---year-end-report-2017-300590030.html", "http://news.cision.com/sca/r/year-end-report-2017,c2440471", "http://www.sca.com/"], "published": "2018-01-30T10:37:00.000+02:00", "crawled": "2018-01-30T13:10:10.001+02:00", "highlightTitle": ""}