{"organizations": [], "uuid": "62a135e168ab84e91f834c7f16fdc5266ad77162", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221413443&w=1200&r=LYNXMPEE0B0MY", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-women/halep-leads-host-of-contenders-for-serenas-crown-idUSKBN1F114I", "country": "US", "domain_rank": 408, "title": "Halep leads host of contenders for Serena's crown", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T12:54:00.000+02:00", "replies_count": 0, "uuid": "62a135e168ab84e91f834c7f16fdc5266ad77162"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-women/halep-leads-host-of-contenders-for-serenas-crown-idUSKBN1F114I", "ord_in_thread": 0, "title": "Halep leads host of contenders for Serena's crown", "locations": [], "entities": {"persons": [{"name": "halep", "sentiment": "negative"}, {"name": "serena", "sentiment": "negative"}, {"name": "martyn herman", "sentiment": "none"}, {"name": "serena williams", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 10:56 AM / Updated 6 hours ago Halep leads host of contenders for Serena's crown Martyn Herman 4 Min Read \n(Reuters) - Picking a women’s singles champion at the Australian Open could resemble a lucky dip this year with Serena Williams’ continued absence again leaving the door ajar. \nWho will kick it open is a question that a legion of tennis pundits find difficult to answer with any degree of certainty. \nThe American, who won the title last year in Melbourne despite being in the early weeks of pregnancy to take her grand slam tally to 23, decided against trying to defend her title, saying she was not yet fully up to speed. \nWhether or not she could have won a 24th slam, and her first as a mother and wife, is open to question considering her lack of match practice, although if any one could do it the 36-year-old would be the one. \nShe will be back on the trophy hunt later this year but in the meantime the spotlight falls on those hoping to try and establish themselves as long-term successors to the greatest player the women’s game has seen. \nSimona Halep arrives as world number one but is yet to win a grand slam title, having fallen agonisingly short at the French Open last year when she was ambushed by the ferocious hitting of Latvian Jelena Ostapenko. \nSpain’s powerhouse Garbine Muguruza, who triumphed at Wimbledon last year to claim a second grand slam, is tipped as the player most likely to assume the dominant role. \nCaroline Wozniacki, seeded two, will be fancying her chances of a first grand slam title, while who would bet against Venus Williams flying the family flag at 37 years of age, although a first round against Belinda Bencic is a tough opening hurdle. \nRussian Maria Sharapova, back in Melbourne for the first time since she failed a doping test for meldonium in 2016 and completed a ban, is another with the experience and firepower to prevail and along with Angelique Kerber is one of only two former champions in the women’s draw. LONG LIST \nThe list is much longer than that though. FILE PHOTO: Tennis - Australian Open - Melbourne Park, Melbourne, Australia - 28/1/17 Serena Williams of the U.S. hits a shot during her Women's singles final match against Venus Williams of the U.S. .REUTERS/Thomas Peter/File Photo \n“We have nobody who has taken the bull by the horns, since Serena has been out of the game, started her own dominance,” twice Australian Open champion Chris Evert, a commentator for ESPN at the Open, said. \n“On the other side of the coin, it’s probably more intriguing because you have 20 players that can win a grand slam. You couldn’t have said that 10 years ago, even five.” \nHer compatriot Sloane Stephens, seeded 13th in Melbourne, proved that at the U.S. Open as she came out of nowhere to claim a maiden slam against Madison Keys. \nEvert, however, believes it could be Romanian Halep’s turn. \n“I say this without a lot of conviction, but I feel like Halep had such a disappointing 2017 in the majors, and I feel she is determined to turn that around,” Evert said. \n“I just feel like she’s playing the best tennis right now, playing the most solid tennis.” \nHalep could face twice Wimbledon champion Petra Kvitova in the third round and is in the same half as Muguruza who may have to get past Sharapova in round four. \nIn the bottom half, Wozniacki will not be unduly worried by the first week, although Ostapenko could lurk in the quarters. \nWith so many players in contention and so much firepower, handling the stress will be the key, according to Mats Wilander. \n”They are so wild and raw it’s hard to pick a winner,“ the Swede told Reuters. ”The way they serve and the speed they hit the ball you can be out of the tournament in 45 minutes. \n“Mental stress for women in a slam is harder than the men because it’s harder break a game down in the women’s game with defensive skills.” Reporting by Martyn Herman, editing by Ed Osmond", "external_links": [], "published": "2018-01-12T12:54:00.000+02:00", "crawled": "2018-01-12T13:45:29.005+02:00", "highlightTitle": ""}