{"organizations": [], "uuid": "8e9d2a5e5bda9ce26005c0abc4a65d7d15c163ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-fcb-financial-holdings-inc-reports-fourth-quarter-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "FCB Financial Holdings, Inc. Reports Fourth Quarter 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:04:00.000+02:00", "replies_count": 0, "uuid": "8e9d2a5e5bda9ce26005c0abc4a65d7d15c163ad"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-fcb-financial-holdings-inc-reports-fourth-quarter-2017-financial-results.html", "ord_in_thread": 0, "title": "FCB Financial Holdings, Inc. Reports Fourth Quarter 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "weston", "sentiment": "none"}], "organizations": [{"name": "fcb", "sentiment": "neutral"}, {"name": "fcb financial holdings", "sentiment": "neutral"}, {"name": "fcb financial holdings, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WESTON, Fla.--(BUSINESS WIRE)-- FCB Financial Holdings, Inc. (NYSE:FCB) (the \"Company\") today reported fourth quarter 2017 net income of $19.0 million, or $0.41 per share on a fully diluted basis, and adjusted net income of $35.3 million, or $0.76 per share on a fully diluted basis. Net income declined $8.9 million year-over-year primarily due to a $14.3 million one-time revaluation of the Company’s deferred tax position following the prospective federal corporate tax rate reduction as a result of the Tax Cuts and Jobs Act (the “TCJA”). Adjusted net income rose 30% year-over-year and adjusted net income per diluted share rose 22%. This resulted in a ROA of 72 basis points and an adjusted ROA of 135 basis points.\nFully tax equivalent net revenue of $88.0 million; Reported and Adjusted EPS of $0.41 and $0.76 per share, respectively, on a fully diluted basis; New loan portfolio grew sequentially at an annualized rate of 30% when excluding the impact of mortgage sales; Record New loan fundings of $696.7 million during the quarter; Demand deposits grew by $216.1 million, or 35% annualized, during the quarter; Reported and Adjusted Efficiency ratio of 41.8% and 40.5%, respectively; Reported and Adjusted ROA of 72 and 135 basis points, respectively; and Tangible book value per share was $24.66.\nThe Company views certain non-operating items, including, but not limited to, merger related and restructuring charges, gain/(loss) on investment securities and their corresponding tax effect, as adjustments to net income. Non-operating adjustments for the fourth quarter of 2017 include $148 thousand of professional services expense related to the pending acquisition of Floridian Community Bank, $115 thousand of severance expense, $65 thousand of other operating expense related to Hurricane Irma, and $211 thousand gain on sale of investment securities. Additionally, the company recognized a one-time non-cash charge to the income statement of approximately $14.3 million due to revaluation of its deferred tax position pursuant to the TCJA which reduced the federal corporate tax rate from 35% to 21% beginning January 1, 2018.\nThe reconciliation of non-GAAP measures (including adjusted net income, adjusted efficiency ratio, adjusted ROA, tangible book value and tangible book value per share), which the Company believes facilitates the assessment of its banking operations and peer comparability, is included in tabular form at the end of this release.\nKent Ellert, Chief Executive Officer and President of FCB Financial Holdings, Inc., commented, “The fourth quarter was a strong end to a great 2017 for FCB, as we continued to differentiate ourselves as the leading independent bank in Florida with over $565 million of deposit growth and nearly $700 million of organic loan fundings. Additionally, we continue to deepen our footprint with the announcement of our pending acquisition of Floridian Community Bank that will further strengthen our presence in the Palm Beach market. We look to build on this momentum heading into 2018 in order to once again deliver strong results in the new year.”\nLoan Portfolio and Composition\nDuring the quarter, the total loan portfolio, gross of the allowance for loan losses, grew by $479.6 million to $8.0 billion as of December 31, 2017, an increase of 6% from $7.5 billion as of September 30, 2017, and 20% from $6.6 billion as of December 31, 2016.\nThe Bank’s new loan portfolio totaled $7.7 billion as of December 31, 2017, an increase of 7% from $7.2 billion as of September 30, 2017 and 22% from $6.3 billion as of December 31, 2016. Loan growth during the quarter was a result of $696.7 million of organic new loan fundings, consisting of $305.8 million of commercial and industrial, $245.8 million of commercial real estate and $145.1 million of residential and consumer. Additionally, during the quarter, the Company sold $36.7 million of residential loans. As of December 31, 2017, new loans made up 96% of the total loan portfolio as compared to 96% and 94% as of September 30, 2017 and December 31, 2016, respectively.\nThe Bank’s acquired loan portfolio totaled $316.4 million as of December 31, 2017, a decrease of 5% from $333.7 million as of September 30, 2017 and a decrease of 16% from $375.5 million as of December 31, 2016. The decrease in the current quarter was primarily driven by scheduled loan amortization. As of December 31, 2017, acquired loans made up 4% of our total loan portfolio as compared to 4% and 6% as of September 30, 2017 and December 31, 2016, respectively.\nAsset Quality\nThe provision for loan losses of $2.8 million recorded for the fourth quarter of 2017 includes a $3.2 million provision for new loans and net recoupment of valuation allowance of $0.4 million for the acquired loan portfolio. The provision for new loans served to increase the related allowance to $44.1 million, or 0.58% of the $7.7 billion in new loans outstanding. The nonperforming new loan ratio as of December 31, 2017 was 0.04%.\nDeposits and Borrowings\nDeposits totaled $8.7 billion as of December 31, 2017, an increase of 7% from $8.1 billion as of September 30, 2017 and an increase of 19% from $7.3 billion as of December 31, 2016. During the fourth quarter of 2017, demand deposits increased by $216.1 million, or 9%, from September 30, 2017 and increased by $780.4 million, or 41%, from December 31, 2016. Demand deposits represent 31% of total deposits as of December 31, 2017 as compared to 31% and 26% as of September 30, 2017 and December 31, 2016, respectively. The cost of deposits was 95 basis points for the quarter, representing a 7 basis point increase from the third quarter of 2017 and a 23 basis point increase from the fourth quarter of 2016. The primary driver of the increase over the periods is attributable to the Federal Reserve rate hikes in December 2016, March, June and December 2017.\nNet Interest Margin and Net Interest Income\nThe net interest margin for the fourth quarter of 2017 was 3.13%, a decrease of four basis points from the third quarter of 2017 and a decrease of 28 basis points from the fourth quarter of 2016. The decrease from the third quarter of 2017 was due primarily to the 8 basis point increase in cost of interest-bearing liabilities partially offset by the 3 basis point increase in yield on interest-earning assets.\nNet interest income totaled $78.1 million in the fourth quarter of 2017, an increase of 3% from $75.8 million in the third quarter of 2017 and an increase of 10% from $71.1 million in the fourth quarter of 2016. Interest income totaled $101.5 million for the fourth quarter of 2017, an increase of 5% from $96.8 million in the third quarter of 2017 and an increase of 19% from $85.6 million in the fourth quarter of 2016. Interest income from new loans increased by $4.9 million, or 7%, from the third quarter of 2017 due to yield expansion and continued growth in the new loan portfolio. Interest income on acquired loans decreased by $0.5 million, or 7%, from the third quarter due to balance runoff and a reduction in loan resolutions. Interest expense was $23.4 million for the fourth quarter of 2017, an increase of 11% from $21.0 million in the third quarter of 2017 and an increase of 61% from $14.5 million in the fourth quarter of 2016. The increase from the third quarter of 2017 was a result of an 8 basis point increase on cost of interest-bearing liabilities associated with increased time deposit duration as well as the impact of the June 2017 and December 2017 Federal Reserve rate hikes on deposit costs.\nNoninterest Income and Noninterest Expense\nNoninterest income totaled $7.7 million for the fourth quarter of 2017 as compared to $8.4 million for the third quarter of 2017 and $7.9 million for the fourth quarter of 2016. The primary components of noninterest income for the quarter were loan and other fees, bank-owned life insurance income and other noninterest income of $3.0 million, $1.4 million and $1.7 million, respectively.\nNoninterest expense totaled $36.1 million for the fourth quarter of 2017, an increase of 2% from $35.2 million in the third quarter of 2017 and an increase of 7% from $33.6 million in the fourth quarter of 2016. For the quarter, the Company recorded non-operating expenses of $328 thousand consisting of $148 thousand of professional services expense related to the pending acquisition of Floridian Community Bank, $115 thousand of severance expense and $65 thousand of other operating expense related to Hurricane Irma.\nFinancial Position\nCapital ratios continue to be strong and well in excess of regulatory requirements. Our tangible common equity, Tier 1 leverage, and total risk-based capital ratios were 10.3%, 10.5% and 12.4% for the fourth quarter of 2017 respectively, compared to 10.6%, 10.6% and 12.7% for the third quarter of 2017, respectively. Stockholders’ equity totaled $1.18 billion as of December 31, 2017, an increase of 2.0% from $1.16 billion as of September 30, 2017 due to net income of $19.0 million and an increase of $9.5 million of additional paid-in capital partially offset by a decrease in accumulated other comprehensive income of $5.4 million. The Company did not repurchase common stock during the quarter. Tangible book value per common share is $24.66 as of December 31, 2017.\nConference Call\nThe Company will host a conference call today, Tuesday, January 23, 2018 at 5:00 p.m. Eastern Time. Presentation materials related to the conference call are available on the Company's website, www.floridacommunitybank.com , by navigating to Investor Relations.\nThe number to call for this interactive teleconference is (855) 238-8125, and please ask to join the FCB Financial Holdings, Inc. or FCB teleconference. Please dial in 10 minutes prior to the beginning of the call.\nA telephonic replay of the conference call will be available through February 23, 2018, by dialing (877) 344-7529 and entering pass code 10115046.\nThe live broadcast of the conference call will also be available online at the Company's website by following the link to Investor Relations. An on-line replay of the call will be available at the Company’s website for 90 days.\nForward-Looking Statements\nThis release may contain “ ” within the meaning of the U.S. Private 1995. Any statements about our expectations, beliefs, plans, strategies, predictions, forecasts, objectives or assumptions of future events or performance are not historical facts and may be forward-looking. These statements include, but are not limited to, the expected completion date, financial benefits and other effects of the proposed merger of FCB and Floridian Community. These statements are often, but not always, made through the use of words or phrases such as “anticipates,” “believes,” “expects,” “can,” “could,” “may,” “predicts,” “potential,” “opportunity,” “should,” “will,” “estimate,” “plans,” “projects,” “continuing,” “ongoing,” “expects,” “seeks,” “intends” and similar words or phrases. Accordingly, these statements involve estimates, known and unknown risks, assumptions and uncertainties that could cause actual strategies, actions or results to differ materially from those expressed in them, and are not guarantees of timing, future results or other events or performance. Because are necessarily only estimates of future strategies, actions or results, based on management’s current expectations, assumptions and estimates on the date hereof, and there can be no assurance that actual strategies, actions or results will not differ materially from expectations, readers are cautioned not to place undue reliance on such statements. Factors that may cause such a difference include, but are not limited to, the reaction to the transaction of the companies’ customers, employees and counterparties; customer disintermediation; inflation; expected synergies, cost savings and other financial benefits of the proposed transaction might not be realized within the expected timeframes or might be less than projected; the requisite shareholder and regulatory approvals for the proposed transaction might not be obtained; credit and interest rate risks associated with FCB’s and Floridian Community’s respective businesses, customers, borrowings, repayment, investment, and deposit practices; general economic conditions, either nationally or in the market areas in which FCB and Floridian Community operate or anticipate doing business, are less favorable than expected; new regulatory or legal requirements or obligations; and other risks; certain risks and important factors that could affect FCB’s future results are identified in its Annual Report on Form 10-K for the year ended December 31, 2016 and other reports filed with the SEC, including among other things under the heading “Risk Factors” in such Annual Report on Form 10-K. Any forward-looking statement speaks only as of the date on which it is made, and FCB undertakes no any forward-looking statement, whether to reflect events or circumstances after the date on which the statement is made, to reflect new information or the occurrence of unanticipated events, or otherwise.\nUse of Non-GAAP Financial Measures\nAdjusted net income, adjusted efficiency ratio, adjusted return-on-assets (\"adjusted ROA\"), tangible book value and tangible book value per share are each non-GAAP financial measures used in this release. A reconciliation to what we believe to be the most directly comparable GAAP financial measures - net income in the case of adjusted net income and adjusted ROA, total net interest income, total noninterest income and total noninterest expense in the case of adjusted efficiency ratio, and total shareholders' equity in the case of tangible book value and tangible book value per share - appears in tabular form at the end of this release. The Company believes each of adjusted net income, adjusted efficiency ratio, and adjusted ROA is useful for both investors and management to understand the effects of certain noninterest items and provides additional perspective on the Company’s performance over time and in comparison to the Company's competitors. Neither Adjusted net income nor Adjusted ROA should be viewed as a substitute for net income, nor should Adjusted efficiency ratio be viewed as a substitute for total net interest income, total noninterest income and total noninterest expense. The Company believes that tangible book value and tangible book value per share are useful for both investors and management, among other things, as these are measures commonly used by financial institutions, regulators and investors to measure the capital adequacy of financial institutions. The Company believes these measures facilitate comparison of the quality and composition of the Company's capital over time and in comparison to its competitors. These measures should not be viewed as a substitute for total stockholders' equity.\nThese non-GAAP measures have inherent limitations, are not required to be uniformly applied and are not audited. They should not be considered in isolation or as a substitute for financial results and analyses of results reported under GAAP, and should be read in conjunction with the Company’s financial statements prepared in accordance with GAAP. These non-GAAP measures may not be comparable to similarly titled measures reported by other companies.\nAbout FCB Financial Holdings, Inc.\nFCB Financial Holdings, Inc. (NYSE: FCB) is the largest community banking company and the second largest Florida-based independent bank, and among the most highly capitalized banks in the state. Awarded a five-star rating from Bauer Financial™, FCB assets are more than $10 billion, with capital ratios that exceed regulatory standards. Since its founding in 2010, FCB has been steadfast in its commitment to delivering personalized service, innovation, and products and services equal to those offered by the national banks. Similarly, FCB recognizes the importance of community, fostering a corporate culture that promotes employee volunteerism at all levels, while supporting community-based programs and partnerships that help promote greater financial independence and improved quality of life for families. FCB serves individuals, businesses and communities across the state with 46 full-service banking centers from east to west, and from Daytona Beach to Miami-Dade. For more information, visit FloridaCommunityBank.com ., Equal Housing Lender, Member FDIC.\nFCB FINANCIAL HOLDINGS, INC. AND SUBSIDIARIES Consolidated Statements Of Income (Unaudited)\nThree Months Ended December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 (Dollars in thousands, except share and per share data) Interest income: Interest and fees on loans $ 80,830 $ 76,465 $ 71,516 $ 66,589 $ 68,583 Interest and dividends on investment securities 20,479 20,215 18,921 18,561 16,907 Other interest income 181 136 136 72 90 Total interest income 101,490 96,816 90,573 85,222 85,580 Interest expense: Interest on deposits 19,789 17,134 15,625 13,518 12,960 Interest on borrowings 3,587 3,901 3,061 2,034 1,554 Total interest expense 23,376 21,035 18,686 15,552 14,514 Net interest income 78,114 75,781 71,887 69,670 71,066 Provision for loan losses 2,786 2,871 2,115 1,643 2,249 Net interest income after provision for loan losses 75,328 72,910 69,772 68,027 68,817 Noninterest income: Service charges and fees 978 941 902 915 935 Loan and other fees 3,041 2,831 3,048 2,495 2,488 Bank-owned life insurance income 1,397 1,422 1,414 1,414 1,333 Income from resolution of acquired assets 425 466 320 762 1,135 Gain (loss) on sales of other real estate owned (55 ) (143 ) (23 ) 45 209 Gain on investment securities 211 690 255 777 800 Other noninterest income 1,734 2,218 2,957 3,579 1,019 Total noninterest income 7,731 8,425 8,873 9,987 7,919 Noninterest expense: Salaries and employee benefits 21,987 20,860 21,486 20,497 19,261 Occupancy and equipment expenses 3,447 3,283 3,336 3,397 3,505 Loan and other real estate related expenses 371 837 1,188 1,227 1,467 Professional services 1,690 1,390 1,508 1,352 1,585 Data processing and network 3,113 3,397 3,090 2,965 2,920 Regulatory assessments and insurance 2,280 2,330 2,184 2,177 2,055 Amortization of intangibles 255 256 256 256 256 Other operating expenses 2,976 2,886 2,204 3,213 2,597 Total noninterest expense 36,119 35,239 35,252 35,084 33,646 Income before income tax expense 46,940 46,096 43,393 42,930 43,090 Income tax expense 27,976 13,936 8,312 3,941 15,194 Net income $ 18,964 $ 32,160 $ 35,081 $ 38,989 $ 27,896 Earnings per share: Basic $ 0.43 $ 0.74 $ 0.82 $ 0.93 $ 0.68 Diluted $ 0.41 $ 0.70 $ 0.76 $ 0.86 $ 0.64 Weighted average shares outstanding: Basic 43,797,291 43,333,947 42,659,101 41,730,610 40,911,326 Diluted 46,565,439 46,189,468 46,042,552 45,573,213 43,728,282 FCB FINANCIAL HOLDINGS, INC. AND SUBSIDIARIES Consolidated Balance Sheets (Unaudited) December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 (Dollars in thousands) Assets: Cash and due from banks $ 60,787 $ 62,695 $ 62,578 $ 70,908 $ 52,903 Interest-earning deposits in other banks 55,134 49,732 37,424 62,929 30,973 Investment securities: Available for sale securities, at fair value 2,120,803 2,102,711 2,046,488 1,976,252 1,876,434 Federal Home Loan Bank and other bank stock, at cost 56,881 61,838 68,372 55,652 51,656 Total investment securities 2,177,684 2,164,549 2,114,860 2,031,904 1,928,090 Loans held for sale 12,736 13,503 24,145 21,251 20,220 Loans: New loans 7,661,385 7,164,480 6,900,380 6,552,214 6,259,406 Acquired loans 316,399 333,725 351,021 366,156 375,488 Allowance for loan losses (47,145 ) (44,291 ) (41,334 ) (39,431 ) (37,897 ) Loans, net 7,930,639 7,453,914 7,210,067 6,878,939 6,596,997 Premises and equipment, net 36,144 35,741 36,111 36,278 36,652 Other real estate owned 14,906 17,599 18,540 18,761 19,228 Goodwill and other intangible assets 84,872 85,127 85,383 85,639 85,895 Deferred tax assets, net 27,043 51,521 50,612 56,178 61,391 Bank-owned life insurance 201,069 199,672 198,250 198,089 198,438 Other assets 76,065 95,279 63,422 72,346 59,347 Total assets $ 10,677,079 $ 10,229,332 $ 9,901,392 $ 9,533,222 $ 9,090,134 Liabilities and Stockholders' Equity Liabilities: Deposits: Transaction accounts: Noninterest-bearing $ 1,236,685 $ 1,242,562 $ 1,135,922 $ 1,069,745 $ 905,905 Interest-bearing 4,830,525 4,486,085 4,489,554 4,571,833 4,183,972 Total transaction accounts 6,067,210 5,728,647 5,625,476 5,641,578 5,089,877 Time deposits 2,606,717 2,377,446 2,069,714 2,032,793 2,215,794 Total deposits 8,673,927 8,106,093 7,695,190 7,674,371 7,305,671 Borrowings 749,113 874,222 1,019,494 739,519 751,103 Other liabilities 74,867 92,944 69,430 64,085 50,919 Total liabilities 9,497,907 9,073,259 8,784,114 8,477,975 8,107,693 Stockholders' Equity: Class A common stock 47 46 46 45 44 Class B common stock - - - - - Additional paid-in capital 933,960 924,462 916,360 898,394 875,314 Retained earnings 313,645 294,681 262,521 227,440 188,451 Accumulated other comprehensive income (loss) 8,893 14,257 15,724 6,741 (3,995 ) Treasury stock, at cost (77,373 ) (77,373 ) (77,373 ) (77,373 ) (77,373 ) Total stockholders' equity 1,179,172 1,156,073 1,117,278 1,055,247 982,441 Total liabilities and stockholders' equity $ 10,677,079 $ 10,229,332 $ 9,901,392 $ 9,533,222 $ 9,090,134 FCB FINANCIAL HOLDINGS, INC. AND SUBSIDIARIES Key Metrics (Unaudited) Three Months Ended December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 Performance Ratios: Interest rate spread 2.85% 2.90% 2.92% 3.03% 3.22% Net interest margin 3.13% 3.17% 3.16% 3.24% 3.41% Return on average assets 0.72% 1.28% 1.47% 1.72% 1.26% Return on average equity 6.41% 11.21% 12.95% 15.58% 11.36% Efficiency ratio (company level) 41.78% 41.54% 43.33% 43.72% 42.27% Average interest-earning assets to average interest-bearing liabilities 125.00% 124.57% 123.38% 121.19% 120.75% Loans receivable to deposits 91.97% 92.50% 94.23% 90.15% 90.82% Yield on interest-earning assets 4.02% 3.99% 3.93% 3.90% 4.06% Cost of interest-bearing liabilities 1.17% 1.09% 1.01% 0.87% 0.84% Asset and Credit Quality Ratios - Total loans: Nonperforming loans to loans receivable 0.21% 0.28% 0.22% 0.24% 0.39% Nonperforming assets to total assets 0.29% 0.38% 0.35% 0.37% 0.50% ALL to nonperforming assets 150.41% 114.60% 120.11% 111.81% 84.08% ALL to total gross loans 0.59% 0.59% 0.57% 0.57% 0.57% Asset and Credit Quality Ratios - New Loans: Nonperforming new loans to new loans receivable 0.04% 0.05% 0.02% 0.02% 0.04% New loan ALL to total gross new loans 0.58% 0.57% 0.55% 0.54% 0.54% Asset and Credit Quality Ratios - Acquired Loans: Nonperforming acquired loans to acquired loans receivable 4.15% 5.23% 4.05% 4.15% 6.18% Acquired loan ALL to total gross acquired loans 0.95% 1.01% 1.06% 1.11% 1.16% Capital Ratios (Company): Average equity to average total assets 11.3% 11.4% 11.3% 11.0% 11.1% Tangible average equity to tangible average assets (1) 10.6% 10.6% 10.5% 10.2% 10.2% Tangible common equity ratio (1) 10.3% 10.6% 10.5% 10.3% 10.0% Tier 1 leverage ratio 10.5% 10.6% 10.6% 10.5% 10.3% Tier 1 risk-based capital ratio 11.9% 12.2% 12.3% 12.2% 11.9% Total risk-based capital ratio 12.4% 12.7% 12.9% 12.8% 12.5% Capital Ratios (Bank): Average equity to average total assets 10.1% 10.2% 10.1% 10.0% 10.2% Tangible common equity ratio 9.0% 9.3% 9.3% 9.1% 9.0% Tier 1 leverage ratio 9.2% 9.4% 9.3% 9.3% 9.3% Tier 1 risk-based capital ratio 10.4% 10.8% 10.9% 10.9% 10.9% Total risk-based capital ratio 11.0% 11.4% 11.4% 11.5% 11.4% (1) See Reconciliation of Non-GAAP Financial Measures - Tangible Book Value Per Share FCB FINANCIAL HOLDINGS, INC. AND SUBSIDIARIES Loan Composition (Unaudited) As of December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 (Dollars in thousands) New Loans: Commercial real estate $ 2,103,788 $ 1,934,246 $ 1,811,977 $ 1,703,790 $ 1,438,427 Owner-occupied commercial real estate 987,781 933,439 856,050 790,062 769,814 1-4 single family residential 2,185,362 2,126,006 2,133,883 2,084,966 2,012,856 Construction, land and development 684,462 682,354 706,866 627,894 651,253 Home equity loans and lines of credit 59,636 52,945 47,686 50,815 49,819 Total real estate loans $ 6,021,029 $ 5,728,990 $ 5,556,462 $ 5,257,527 $ 4,922,169 Commercial and industrial 1,634,372 1,431,445 1,339,591 1,290,456 1,332,869 Consumer 5,984 4,045 4,327 4,231 4,368 Total new loans $ 7,661,385 $ 7,164,480 $ 6,900,380 $ 6,552,214 $ 6,259,406 Acquired ASC 310-30 Loans: Commercial real estate $ 104,335 $ 111,416 $ 120,781 $ 129,317 $ 130,628 1-4 single family residential 27,513 28,044 28,792 30,115 31,476 Construction, land and development 13,167 13,791 15,060 15,912 17,657 Total real estate loans $ 145,015 $ 153,251 $ 164,633 $ 175,344 $ 179,761 Commercial and industrial 12,631 13,145 13,612 14,234 15,147 Consumer 1,423 1,447 1,478 1,554 1,681 Total Acquired ASC 310-30 Loans $ 159,069 $ 167,843 $ 179,723 $ 191,132 $ 196,589 Acquired Non-ASC 310-30 Loans: Commercial real estate $ 37,736 $ 37,896 $ 38,043 $ 38,352 $ 38,786 Owner-occupied commercial real estate 16,100 18,097 18,266 18,465 18,477 1-4 single family residential 57,695 60,374 62,485 64,669 66,854 Construction, land and development 5,889 5,890 5,890 5,890 6,338 Home equity loans and lines of credit 34,589 38,007 40,809 41,835 42,295 Total real estate loans $ 152,009 $ 160,264 $ 165,493 $ 169,211 $ 172,750 Commercial and industrial 5,062 5,284 5,499 5,487 5,815 Consumer 259 334 306 326 334 Total Acquired Non-ASC 310-30 Loans 157,330 165,882 171,298 175,024 178,899 Total loans $ 7,977,784 $ 7,498,205 $ 7,251,401 $ 6,918,370 $ 6,634,894 FCB FINANCIAL HOLDINGS, INC. AND SUBSIDIARIES Deposit Composition (Unaudited) As of December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 (Dollars in thousands) Noninterest-bearing demand deposits $ 1,236,685 $ 1,242,562 $ 1,135,922 $ 1,069,745 $ 905,905 Interest-bearing demand deposits 1,454,097 1,232,116 1,117,280 1,057,539 1,004,452 Interest-bearing NOW accounts 363,191 368,796 401,845 422,329 398,823 Savings and money market accounts 3,013,237 2,885,173 2,970,429 3,091,965 2,780,697 Time deposits 2,606,717 2,377,446 2,069,714 2,032,793 2,215,794 Total deposits $ 8,673,927 $ 8,106,093 $ 7,695,190 $ 7,674,371 $ 7,305,671 FCB FINANCIAL HOLDINGS, INC. AND SUBSIDIARIES Quarterly Average Balances and Yields (Unaudited) Three Months Ended Three Months Ended December 31, September 30, 2017 2017 Average Interest/ Annualized Average Interest/ Annualized Balance (1) Expense (2) Yield/Rate(3) Balance (1) Expense (2) Yield/Rate(3) (Dollars in thousands) Interest-earning assets: Interest-earning deposits in other banks $ 53,967 $ 181 1.33% $ 39,646 $ 136 1.36% New loans (4) 7,357,646 74,573 3.97% 6,982,158 69,709 3.91% Acquired loans (4)(5) 321,297 6,257 7.79% 341,056 6,756 7.92% Investment securities 2,171,964 20,479 3.69% 2,134,162 20,215 3.71% Total interest-earning assets 9,904,874 101,490 4.02% 9,497,022 96,816 3.99% Non-earning assets: Noninterest-earning assets 477,169 473,981 Total assets $ 10,382,043 $ 9,971,003 Interest-bearing liabilities: Interest-bearing demand deposits $ 1,362,608 $ 3,226 0.94% $ 1,147,669 $ 2,694 0.93% Interest-bearing NOW accounts 342,094 672 0.78% 398,322 763 0.76% Savings and money market accounts 2,847,328 7,361 1.03% 2,885,716 6,901 0.95% Time deposits (6) 2,476,022 8,530 1.37% 2,161,905 6,776 1.24% FHLB advances and other borrowings (6) 895,618 3,587 1.57% 1,030,437 3,901 1.48% Total interest-bearing liabilities $ 7,923,670 $ 23,376 1.17% $ 7,624,049 $ 21,035 1.09% Noninterest-bearing liabilities and shareholders' equity: Noninterest-bearing demand deposits $ 1,225,896 $ 1,149,981 Other liabilities 58,989 59,139 Stockholders' equity 1,173,488 1,137,834 Total liabilities and stockholders' equity $ 10,382,043 $ 9,971,003 Net interest income $ 78,114 $ 75,781 Net interest spread 2.85% 2.90% Net interest margin 3.13% 3.17% (1) Average balances presented are derived from daily average balances. (2) Interest income is presented on an actual basis and does not include taxable equivalent adjustments. (3) Average rates are presented on an annualized basis. (4) Includes loans on nonaccrual status. (5) Net of allowance for loan losses. (6) Interest expense includes the impact from premium amortization. FCB FINANCIAL HOLDINGS, INC. AND SUBSIDIARIES Quarterly Average Balances and Yields (Unaudited) Three Months Ended December 31, 2017 2016 Average Interest/ Annualized Average Interest/ Annualized Balance (1) Expense (2) Yield/Rate(3) Balance (1) Expense (2) Yield/Rate(3) (Dollars in thousands) Interest-earning assets: Interest-earning deposits in other banks $ 53,967 $ 181 1.33% $ 63,533 $ 90 0.56% New loans (4) 7,357,646 74,573 3.97% 5,982,383 54,025 3.53% Acquired loans (4)(5) 321,297 6,257 7.79% 409,681 14,558 14.21% Investment securities 2,171,964 20,479 3.69% 1,815,854 16,907 3.64% Total interest-earning assets 9,904,874 101,490 4.02% 8,271,451 85,580 4.06% Non-earning assets: Noninterest-earning assets 477,169 493,487 Total assets $ 10,382,043 $ 8,764,938 Interest-bearing liabilities: Interest-bearing demand deposits $ 1,362,608 $ 3,226 0.94% $ 999,239 $ 1,531 0.61% Interest-bearing NOW accounts 342,094 672 0.78% 385,979 347 0.36% Savings and money market accounts 2,847,328 7,361 1.03% 2,662,325 4,424 0.66% Time deposits (6) 2,476,022 8,530 1.37% 2,253,993 6,658 1.17% FHLB advances and other borrowings (6) 895,618 3,587 1.57% 548,290 1,554 1.11% Total interest-bearing liabilities $ 7,923,670 $ 23,376 1.17% $ 6,849,826 $ 14,514 0.84% Noninterest-bearing liabilities and shareholders' equity: Noninterest-bearing demand deposits $ 1,225,896 $ 880,828 Other liabilities 58,989 59,740 Stockholders' equity 1,173,488 974,544 Total liabilities and stockholders' equity $ 10,382,043 $ 8,764,938 Net interest income $ 78,114 $ 71,066 Net interest spread 2.85% 3.22% Net interest margin 3.13% 3.41% (1) Average balances presented are derived from daily average balances. (2) Interest income is presented on an actual basis and does not include taxable equivalent adjustments. (3) Average rates are presented on an annualized basis. (4) Includes loans on nonaccrual status. (5) Net of allowance for loan losses. (6) Interest expense includes the impact from premium amortization. FCB FINANCIAL HOLDINGS, INC. AND SUBSIDIARIES Average Balances and Yields (Unaudited) Years ended December 31, 2017 2016 Average Interest/ Average Interest/ Balance (1) Expense (2) Yield/Rate Balance (1) Expense (2) Yield/Rate (Dollars in thousands) Interest-earning assets: Interest-earning deposits in other banks $ 44,711 $ 525 1.17% $ 78,496 $ 349 0.44% New loans (3) 6,847,577 267,548 3.85% 5,421,058 192,642 3.50% Acquired loans (3)(4) 346,451 27,852 8.04% 480,129 65,619 13.67% Investment securities 2,079,977 78,176 3.71% 1,657,610 60,706 3.61% Total interest-earning assets 9,318,716 374,101 3.96% 7,637,293 319,316 4.13% Non-earning assets: Noninterest-earning assets 473,004 482,868 Total assets $ 9,791,720 $ 8,120,161 Interest-bearing liabilities: Interest-bearing demand deposits $ 1,150,274 $ 9,920 0.86% $ 767,788 $ 4,211 0.55% Interest-bearing NOW accounts 391,017 2,546 0.65% 412,745 1,538 0.37% Savings and money market accounts 2,899,330 26,235 0.90% 2,327,175 14,617 0.63% Time deposits (5) 2,199,677 27,365 1.24% 2,075,196 23,963 1.15% FHLB advances and other borrowings (5) 899,287 12,583 1.38% 783,241 7,271 0.92% Total interest-bearing liabilities $ 7,539,585 $ 78,649 1.04% $ 6,366,145 $ 51,600 0.84% Noninterest-bearing liabilities and shareholders' equity: Noninterest-bearing demand deposits $ 1,098,831 $ 764,383 Other liabilities 49,596 64,438 Stockholders' equity 1,103,708 925,195 Total liabilities and stockholders' equity\n$ 9,791,720 $ 8,120,161 Net interest income $ 295,452 $ 267,716 Net interest spread 2.92% 3.29% Net interest margin 3.17% 3.51% (1) Average balances presented are derived from daily average balances. (2) Interest income is presented on an actual basis and does not include taxable equivalent adjustments. (3) Includes loans on nonaccrual status. (4) Net of allowance for loan losses. (5) Interest expense includes the impact from premium amortization. FCB FINANCIAL HOLDINGS, INC. AND SUBSIDIARIES Reconciliation of Non-GAAP Financial Measures - Adjusted Net Income (Unaudited) Three Months Ended December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 (Dollars in thousands) Net Income $ 18,964 $ 32,160 $ 35,081 $ 38,989 $ 27,896 Pre-tax Adjustments: Noninterest income: Less: Gain on investment securities 211 690 255 777 800 Noninterest expense: Salaries and employee benefits 115 51 223 56 132 Occupancy and equipment - - - - 43 Loan and other real estate related expenses - - - - - Professional services 148 - - - - Data processing and network fees - - - - - Regulatory assessments and insurance - - - - - Amortization of intangibles - - - - - Other operating expenses 65 125 21 12 66 Taxes: Tax Effect of adjustments (1) 16,212 2,541 (2,534 ) (9,147 ) (160) Adjusted Net Income $ 35,293 $ 34,187 $ 32,536 $ 29,133 $ 27,177 Average assets $ 10,382,043 $ 9,971,003 $ 9,602,354 $ 9,196,483 $ 8,764,938 ROA (2) 0.72 % 1.28 % 1.47 % 1.72 % 1.26% Adjusted ROA (3) 1.35 % 1.36 % 1.36 % 1.28 % 1.23% (1) Tax effected at marginal income tax rate of 39% except for non tax deductible and discreet items. Adjusted tax rate of 36% in 2016 and 20-25% for full-year 2017. (2) Return on assets: Annualized net income / average assets (3) Adjusted return on assets: Annualized adjusted net income / average assets FCB FINANCIAL HOLDINGS, INC. AND SUBSIDIARIES Reconciliation of Non-GAAP Financial Measures - Adjusted Efficiency Ratio (Unaudited) Three Months Ended December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 (Dollars in thousands) Reported: Net interest income $ 78,114 $ 75,781 $ 71,887 $ 69,670 $ 71,066 FTE adjustment 1,245 1,357 1,348 1,288 1,132 Adjusted net interest income $ 79,359 $ 77,138 $ 73,235 $ 70,958 $ 72,198 Reported: Noninterest income $ 7,731 $ 8,425 $ 8,873 $ 9,987 $ 7,919 FTE adjustment 879 894 904 904 852 Less: Gain on investment securities 211 690 255 777 800 Adjusted noninterest income $ 8,399 $ 8,629 $ 9,522 $ 10,114 $ 7,971 Reported: Noninterest expense $ 36,119 $ 35,239 $ 35,252 $ 35,084 $ 33,646 Less: Salaries and employee benefits 115 51 223 56 132 Occupancy and equipment - - - - 43 Loan and other real estate related expenses - - - - - Professional services 148 - - - - Data processing and network fees - - - - - Regulatory assessments and insurance - - - - - Amortization of intangibles - - - - - Other operating expenses 65 125 21 12 66 Adjusted noninterest expense $ 35,791 $ 35,063 $ 35,008 $ 35,016 $ 33,405 Efficiency ratio (1) 41.78% 41.54% 43.33% 43.72 % 42.27% Adjusted efficiency ratio (2) 40.49% 40.58% 41.99% 42.88 % 41.35% (1) Efficiency ratio: Noninterest expense less amortization of intangibles / (noninterest income + net interest income) (2) Adjusted efficiency ratio: Adjusted noninterest expense less amortization of intangibles / (adjusted noninterest income + adjusted net interest income) FCB FINANCIAL HOLDINGS, INC. AND SUBSIDIARIES Reconciliation of Non-GAAP Measures - Tangible Book Value Per Share (Unaudited) December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 (Dollars in thousands, except share and per share data) Total assets $ 10,677,079 $ 10,229,332 $ 9,901,392 $ 9,533,222 $ 9,090,134 Less: Goodwill and other intangible assets 84,872 85,127 85,383 85,639 85,895 Tangible assets $ 10,592,207 $ 10,144,205 $ 9,816,009 $ 9,447,583 $ 9,004,239 Total stockholders' equity $ 1,179,172 $ 1,156,073 $ 1,117,278 $ 1,055,247 $ 982,441 Less: Goodwill and other intangible assets 84,872 85,127 85,383 85,639 85,895 Tangible stockholders' equity $ 1,094,300 $ 1,070,946 $ 1,031,895 $ 969,608 $ 896,546 Shares outstanding 44,380,580 43,728,302 43,208,418 42,432,062 41,157,571 Tangible book value per share $ 24.66 $ 24.49 $ 23.88 $ 22.85 $ 21.78 Average assets $ 10,382,043 $ 9,971,003 $ 9,602,354 $ 9,196,483 $ 8,764,938 Average equity 1,173,488 1,137,834 1,086,554 1,014,839 974,544 Average goodwill and other intangible assets 84,996 85,257 85,511 85,766 86,029 Tangible average equity to tangible average assets 10.6% 10.6% 10.5% 10.2% 10.2% Tangible common equity ratio 10.3% 10.6% 10.5% 10.3% 10.0%\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006049/en/\nFCB Financial Holdings, Inc.\nMatthew Paluch, 305-668-5420\nIR@fcb1923.com\nSource: FCB Financial Holdings, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.floridacommunitybank.com&esheet=51747478&newsitemid=20180123006049&lan=en-US&anchor=www.floridacommunitybank.com&index=1&md5=553e6dec7762b787e4461c49f988ce48", "http://www.businesswire.com/news/home/20180123006049/en/"], "published": "2018-01-24T00:04:00.000+02:00", "crawled": "2018-01-24T00:56:05.008+02:00", "highlightTitle": ""}