{"organizations": [], "uuid": "c0946f46e798ed4ef7dae4ffa0e06bc0e4df8a8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/06/reuters-america-u-s-agency-starts-review-for-alaska-mine-project-opposed-by-environmentalists.html", "country": "US", "domain_rank": 767, "title": "U.S. agency starts review for Alaska mine project opposed by environmentalists", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T08:16:00.000+02:00", "replies_count": 0, "uuid": "c0946f46e798ed4ef7dae4ffa0e06bc0e4df8a8c"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/06/reuters-america-u-s-agency-starts-review-for-alaska-mine-project-opposed-by-environmentalists.html", "ord_in_thread": 0, "title": "U.S. agency starts review for Alaska mine project opposed by environmentalists", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "anchorage", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "pebble mine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "pebble limited partnership", "sentiment": "none"}, {"name": "u.s. army corps of engineers", "sentiment": "none"}, {"name": "environmental protection agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "environmentalists@\nANCHORAGE, Alaska, Jan 5 (Reuters) - U.S. regulators formally launched a review process on Friday that could produce a permit a Canadian mining group needs to build the Pebble Mine copper and gold project in southwest Alaska, which is opposed by environmentalists. The U.S. Army Corps of Engineers, the federal agency that regulates the development and dredging of wetlands, has published the completed permit application from the Pebble Limited Partnership on its website.\nThe application will trigger a formal environmental review of the plan to build an open-pit mine in a region with the world's biggest sockeye salmon runs.\nThe proposal to build the mine is moving forward under President Donald Trump, a champion of increased domestic mining, after the Environmental Protection Agency under former President Barack Obama attempted to put the region off limits to large-scale metals mining in 2014.\nBackers of the project say it could create 2,000 construction jobs and 850 jobs during operations.\nThe Pebble Limited Partnership, comprising Canadian miners Northern Dynasty Minerals Ltd and First Quantum Minerals Ltd, expects the full review to take three to five years, said spokesman Mike Heatwole.\nThe mine would extract minerals from a huge deposit of copper, gold and molybdenum and operate for 20 years, according to the Pebble Partnership.\nThe Pebble Limited Partnership is planning to mine 1.2 billion tons of material, including 287 million pounds of copper.\nEnvironmentalists, commercial and sport fishermen, many Alaska Native tribal organizations and even some Republican politicians have all criticized the project, which would be built on land near Lake Clark National Park.\nThey argue the mine, which would be located upstream of Bristol Bay and its large salmon runs, would spoil important fish and wildlife habitat. Public opinion polls have consistently found the mine is strongly opposed by Alaska residents.\nIndigenous communities in particular have criticized the project, though some groups have supported it.\n\"The science on such a project is already available, and already clear: this mine will devastate the Bristol Bay fishery,\" Robert Heyano, president of the United Tribes of Bristol Bay, said in a statement.\nPebble Limited Partnership Chief Executive Officer Tom Collier, in a statement Friday, said the company has responded to critics by scaling back the mine scope, eliminating planned use of cyanide and making other changes.\n\"These are very substantial improvements that we have made over the past few years in response to issues and concerns raised by project stakeholders,\" he said. (Editing by Alex Dobuzinskis and Sam Holmes)", "external_links": [], "published": "2018-01-06T08:16:00.000+02:00", "crawled": "2018-01-06T16:23:23.000+02:00", "highlightTitle": ""}