{"organizations": [], "uuid": "146dc0dffce7368ff04003f240d4a0b331c37446", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-ucfc-announces-strong-earnings-and-dividend-increase.html", "country": "US", "domain_rank": 767, "title": "UCFC Announces Strong Earnings and Dividend Increase", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-24T00:10:00.000+02:00", "replies_count": 0, "uuid": "146dc0dffce7368ff04003f240d4a0b331c37446"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-ucfc-announces-strong-earnings-and-dividend-increase.html", "ord_in_thread": 0, "title": "UCFC Announces Strong Earnings and Dividend Increase", "locations": [], "entities": {"persons": [], "locations": [{"name": "ohio", "sentiment": "none"}, {"name": "youngstown", "sentiment": "none"}], "organizations": [{"name": "united community financial corp.", "sentiment": "negative"}, {"name": "appellate court", "sentiment": "none"}, {"name": "home savings bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YOUNGSTOWN, Ohio--(BUSINESS WIRE)--\nUnited Community Financial Corp. (Company) (NASDAQ:UCFC), parent company of Home Savings Bank (Home Savings), today announced net income of $4.5 million, or $0.090 per diluted common share for the three months ended December 31, 2017. For the year ended December 31, 2017, net income was $21.8 million, or $0.437 per diluted common share.\nDuring the year, three non-recurring charges were recognized. In the fourth quarter, a revaluation of net deferred tax assets increased tax expense $1.9 million and an asset write down of $1.5 million, after tax, was prompted by an unfavorable ruling from an Appellate Court. For the year, non-recurring acquisition related expenses totaling $3.3 million, after tax, were also recognized. By adjusting reported earnings adjusted for these non-recurring items, the Company’s normalized quarterly net income (non-GAAP) was $7.9 million for the quarter, or $0.158 per diluted share and normalized full-year net income was $28.5 million, or $0.571 per diluted common share.\nFourth quarter 2017 highlights:\nContinued strong organic loan growth at 10.1% annualized Average deposit growth at 5.8% annualized Net interest margin of 3.43% Return on average assets of 0.68%, or 1.20% normalized Return on average equity of 6.09%, or 10.72% normalized Efficiency ratio was 63.73%, or 53.76% normalized Increased dividend 50% to $0.06 per common share\nFull year 2017 highlights:\nContinued strong organic loan growth, including loans held for sale, at 16.5% Net interest margin of 3.41% Return on average assets of 0.85%, or 1.11% normalized Return on average equity of 7.63%, or 9.97% normalized Efficiency ratio was 64.28%, or 57.01% normalized\nGary M. Small, President and Chief Executive Officer of the Company commented, “I am very pleased with the organization’s fourth quarter core performance. Commercial and consumer growth exceeded expectations, deposit growth initiatives took hold, and our core expenses for the quarter were well contained. These results, combined with the anticipated positive impacts for our customers from the recent tax legislation, certainly provide excellent momentum as we head into 2018.”\nStrong Organic Loan Growth\nTotal loan growth for the fourth quarter was $51.4 million, or 10.1% on an annualized basis. At year-end, total loans aggregated $2.08 billion.\nCommercial loan growth was $31.5 million for the quarter ended December 31, 2017, or 15.9% on an annualized basis. Residential mortgage loans, including loans held for sale, increased $10.3 million, or 4.1% annualized during the quarter. Consumer loans increased $9.8 million, or 14.9%, annualized during the same time period.\nMeaningful Organic Customer Deposit Growth\nAverage customer deposit growth for the fourth quarter of 2017 totaled $25.4 million, or 5.8% annualized. Average annualized consumer and business deposit growth was 11.5% for the period. The Company also saw annualized growth of 21.6% in average noninterest bearing deposits for the quarter. Our success in these areas is a reflection of our focus on treasury management, product enhancement and pricing and promotional changes.\nNet Interest Margin Remains Stable\nNet interest income on a fully-taxable equivalent basis increased to $21.1 million for the quarter ended December 31, 2017, compared to $20.7 million for the quarter ended September 30, 2017, or 1.8%, and increased 27.5% from $16.6 million for the quarter ended December 31, 2016. The increase in net interest income was primarily due to a higher level of earning assets compared to the prior quarter. The increase in net interest income compared to the fourth quarter of 2016 was driven by an increase in earning assets along with an expansion in net interest margin, primarily related to purchase accounting adjustments.\nThe net interest margin was 3.43% for the three months ended December 31, 2017, a two basis point decrease from 3.45% reported in the prior quarter. For the quarter ended December 31, 2016, the net interest margin was 3.26%. The increased margin from the same quarter last year was primarily due to the increased yield on earning assets along with the recognition of purchase accounting adjustments.\nExcluding purchase accounting yield adjustments, the net interest margin would have been 12 basis points lower, or 3.31%, for the three months ended December 31, 2017. The net interest margin would have been 11 basis points lower, or 3.30%, for the year.\nNonperforming Loans to Net Loans Ratio Decreases\nThe ratio of nonperforming loans to net loans continues to improve. The ratio was 0.59% at December 31, 2017, which is down from 0.83% reported at December 31, 2016. During the quarter ended December 31, 2017, the Company recognized total net chargeoffs of $568,000, or 11.5 basis points as a percentage of average loans. Full-year net chargeoffs were $2.1 million, or 11.5 basis points as a percentage of average loans.\nThe Company’s provision for loan losses totaled $1.2 million for the fourth quarter of 2017, which was up in comparison to the prior quarter and down from the fourth quarter of 2016. As of December 31, 2017, the Company’s allowance for loan losses to total loans was 1.05%, versus 1.25% at December 31, 2016.\nLoans acquired through the acquisition during the first quarter of 2017 were recorded at fair value. When combining the remaining fair value adjustment of $3.8 million and the Company’s allowance, the Company’s allowance as a percentage of total loans increases to 1.23%.\nNon-Interest Income\nNon-interest income increased to $6.5 million in the fourth quarter of 2017, compared to $6.3 million in the prior quarter. A one-time gain of $595,000 from the sale of a bank-owned building was partially offset by lower gains on mortgage loan sales due to seasonality and no recognized security gains in the fourth quarter.\nNon-Interest Expense\nNon-interest expense was $17.3 million for the quarter and normalized was $15.0 million, excluding a $2.3 million one-time asset write down, compared to $15.5 million recognized during last quarter.\nIn 2003, Home Savings entered into two development loans on which the borrower subsequently filed bankruptcy, and a Court appointed receiver liquidated the collateral. The proceeds from the sale of the collateral have remained in escrow with the Court since 2007 as a number of competing claims were made against the proceeds. In 2011, a lower court affirmed Home Savings' priority position in the proceeds, and its lien validity was affirmed by the same Court in 2016. However, in December 2017, an Appellate Court ruled that a portion of the proceeds should be awarded to another claimant. The $2.3 million charge reflects the Appellate court ruling. It is the Company’s intent to continue to pursue a full recovery.\nThe Company’s efficiency ratio remained on target at a normalized level of 53.77%, for the quarter ended December 31, 2017.\nTangible Book Value\nTangible book value per common share at December 31, 2017 was $5.41 compared to $5.32 at December 31, 2016. Tangible book value per share was lowered $0.037 per share because of the recent change in tax law.\nIncreased Dividend to be Paid\nOn January 23, 2018, the Board of Directors declared a quarterly cash dividend of $0.06 per common share, a 50% increase from the quarterly dividend paid last quarter. The dividend is payable February 16, 2018 to shareholders of record at the close of business February 2, 2018. This increase reflects both the sentiments of the Company to move to a higher dividend payout ratio and anticipated increased earnings due to recent changes in tax law.\nConference Call\nUnited Community Financial Corp. will host an earnings conference call on Wednesday, January 24, 2018, at 10:00 a.m. ET., to provide an overview of the Company's fourth quarter 2017 results and highlights. The conference call may be accessed by calling 1-877-272-7661 ten minutes prior to the start time. Please ask to be joined into the United Community Financial Corp. (UCFC) call. Additionally, a live webcast may be accessed from the Company’s website ir.ucfconline.com . Click on 4th Quarter 2017 Conference Call on the corporate profile page to join the webcast.\nUnited Community Financial Corp.\nHome Savings is a wholly owned subsidiary of the Company, offering a full line of commercial, wealth management and consumer banking products and services with 35 retail banking offices (34 in Ohio and one in Pennsylvania). Home Savings also has residential mortgage loan centers servicing Ohio, West Virginia, western Pennsylvania, northern Kentucky, and eastern Indiana. Additional information on the Company, Home Savings and James & Sons Insurance is available at ir.ucfconline.com .\nWhen used in this press release, the words or phrases “believes,” “will likely result,” “are expected to,” “will continue,” “is anticipated,” “estimate,” “project”, “will have”, “can expect” or similar expressions are intended to identify “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are subject to certain risks and uncertainties, including changes in economic conditions in the Company’s market area, changes in policies by regulatory agencies, fluctuations in interest rates, demand for loans in the Company’s market area and competition that could cause actual results to differ materially from historical earnings and those presently anticipated or projected. The Company cautions readers not to place undue reliance on any such forward-looking statements, which speak only as of the date made. The Company advises readers that the factors listed above could affect the Company’s financial performance and could cause the Company’s actual results for future periods to differ materially from any opinions or statements expressed with respect to future periods in any current statements.\nThe Company does not undertake, and specifically disclaims any obligation, to release publicly the result of any revisions that may be made to any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events.\nUNITED COMMUNITY FINANCIAL CORP. CONSOLIDATED STATEMENTS OF FINANCIAL CONDITION (Unaudited) December 31, September 30, December 31, 2017 2017 F/(U) 2016 F/(U) (Dollars in thousands) Assets: Cash and deposits with banks $ 34,365 $ 29,600 16.1 % $ 27,690 24.1 % Federal funds sold 12,515 8,410 48.8 % 18,197 -31.2 % Total cash and cash equivalents 46,880 38,010 23.3 % 45,887 2.2 % Securities: Available for sale, at fair value 270,561 274,822 -1.6 % 343,284 -21.2 % Held to maturity (fair value of $82,126, $85,024 and $96,150, respectively) 82,911 85,549 -3.1 % 97,519 -15.0 % Loans held for sale, at lower of cost or market 211 196 7.7 % 165 27.9 % Loans held for sale, at fair value 83,541 84,349 -1.0 % 62,593 33.5 % Loans, net of allowance for loan losses of $21,202, $20,555 and $19,087 1,999,877 1,947,695 2.7 % 1,503,577 33.0 % Federal Home Loan Bank stock, at cost 19,324 19,324 0.0 % 18,068 7.0 % Premises and equipment, net 22,094 22,132 -0.2 % 20,963 5.4 % Accrued interest receivable 8,190 7,253 12.9 % 6,900 18.7 % Real estate owned and other repossessed assets 1,253 1,143 9.6 % 1,777 -29.5 % Goodwill 20,221 19,488 3.8 % 208 9621.6 % Core deposit intangible 1,934 2,017 -4.1 % 5 38580.0 % Customer list intangible 2,060 2,090 -1.4 % 1,356 51.9 % Cash surrender value of life insurance 62,488 62,050 0.7 % 55,861 11.9 % Other assets 27,789 36,247 -23.3 % 33,182 -16.3 % Total assets $ 2,649,334 $ 2,602,365 1.8 % $ 2,191,345 20.9 % Liabilities and Shareholders' Equity Liabilities: Deposits: Non-interest bearing $ 354,970 $ 343,146 3.4 % $ 256,918 38.2 % Interest bearing 1,601,769 1,595,553 0.4 % 1,258,073 27.3 % Total deposits 1,956,739 1,938,699 0.9 % 1,514,991 29.2 % Borrowed funds: Federal Home Loan Bank advances Long-term advances 48,536 48,341 0.4 % 47,756 1.6 % Short-term advances 308,000 280,000 10.0 % 343,000 -10.2 % Total Federal Home Loan Bank advances 356,536 328,341 8.6 % 390,756 -8.8 % Repurchase agreements and other 197 10,191 -98.1 % 512 -61.5 % Total borrowed funds 356,733 338,532 5.4 % 391,268 -8.8 % Advance payments by borrowers for taxes and insurance 25,038 16,048 56.0 % 23,812 5.1 % Accrued interest payable 1,097 722 51.9 % 145 656.6 % Accrued expenses and other liabilities 16,033 16,513 -2.9 % 11,323 41.6 % Total liabilities 2,355,640 2,310,514 2.0 % 1,941,539 21.3 % Shareholders' Equity: Preferred stock-no par value; 1,000,000 shares authorized and no shares outstanding\n— — 0.0 % — 0.0 % Common stock-no par value; 499,000,000 shares authorized; 54,138,910 shares issued and 49,800,126, 49,758,487 and 46,581,370 shares, respectively, outstanding\n177,458 177,460 0.0 % 174,360 1.8 % Retained earnings 167,500 164,988 1.5 % 152,675 9.7 % Accumulated other comprehensive loss (18,904 ) (17,929 ) 5.4 % (21,040 ) -10.2 % Treasury stock, at cost, 4,338,784, 4,380,423 and 7,557,540 shares, respectively (32,360 ) (32,668 ) -0.9 % (56,189 ) -42.4 % Total shareholders’ equity 293,694 291,851 0.6 % 249,806 17.6 % Total liabilities and shareholders’ equity $ 2,649,334 $ 2,602,365 1.8 % $ 2,191,345 20.9 % UNITED COMMUNITY FINANCIAL CORP. CONSOLIDATED STATEMENTS OF OPERATIONS (Unaudited) For the Three Months Ended For the Twelve Months Ended December 31, September 30, December 31, December 31, December 31, 2017 2017 F/(U) 2016 F/(U) 2017 2016 F/(U) (Dollars in thousands, except per share data) Interest income Loans $ 21,529 $ 20,697 4.0 % $ 15,285 40.9 % $ 79,795 $ 57,903 37.8 % Loans held for sale 886 882 0.5 % 578 53.3 % 3,301 1,755 88.1 % Securities: Available for sale, nontaxable 416 416 0.0 % 377 10.3 % 1,668 1,129 47.7 % Available for sale, taxable 1,222 1,276 -4.2 % 1,569 -22.1 % 5,579 6,915 -19.3 % Held to maturity, nontaxable 51 49 4.1 % 65 -21.5 % 214 248 -13.7 % Held to maturity, taxable 421 424 -0.7 % 422 -0.2 % 1,764 1,989 -11.3 % Federal Home Loan Bank stock dividends 267 253 5.5 % 181 47.5 % 961 723 32.9 % Other interest earning assets 57 51 11.8 % 18 216.7 % 228 67 240.3 % Total interest income 24,849 24,048 3.3 % 18,495 34.4 % 93,510 70,729 32.2 % Interest expense Deposits 2,603 2,226 -16.9 % 1,425 -82.7 % 8,437 5,922 -42.5 % Federal Home Loan Bank advances 1,365 1,315 -3.8 % 732 -86.5 % 4,699 2,486 -89.0 % Repurchase agreements and other 1 4 75.0 % 4 75.0 % 21 20 -5.0 % Total interest expense 3,969 3,545 -12.0 % 2,161 -83.7 % 13,157 8,428 -56.1 % Net interest income 20,880 20,503 1.8 % 16,334 27.8 % 80,353 62,301 29.0 % Taxable equivalent adjustment 221 224 -1.3 % 219 0.9 % 911 686 32.8 % Net interest income (FTE) (1) 21,101 20,727 1.8 % 16,553 27.5 % 81,264 62,987 29.0 % Provision for loan losses 1,215 721 -68.5 % 1,493 18.6 % 4,253 5,387 21.1 % Net interest income after provision for loan losses (FTE) 19,886 20,006 -0.6 % 15,060 32.0 % 77,011 57,600 33.7 % Non-interest income Insurance agency income 552 509 8.4 % 417 32.4 % 2,006 1,686 19.0 % Brokerage income 264 271 -2.6 % 248 6.5 % 1,158 1,281 -9.6 % Service fees and other charges: Deposit related fees 1,436 1,499 -4.2 % 1,380 4.1 % 5,636 5,486 2.7 % Mortgage servicing fees 780 760 2.6 % 719 8.5 % 3,005 2,833 6.1 % Mortgage servicing rights valuation 6 (10 ) -160.0 % 741 -99.2 % (9 ) 39 123.1 % Mortgage servicing rights amortization (518 ) (491 ) 5.5 % (534 ) -3.0 % (1,944 ) (2,094 ) 7.2 % Other service fees 42 21 100.0 % 27 55.6 % 125 135 -7.4 % Net gains (losses): Securities available for sale — 236 -100.0 % — 0.0 % 566 604 -6.3 % Mortgage banking income 1,375 1,688 -18.5 % 1,236 11.2 % 6,503 6,444 0.9 % Real estate owned and other repossessed assets charges, net (46 ) (73 ) -37.0 % (17 ) -100.0 % (189 ) (93 ) -103.2 % Debit/credit card fees 995 971 2.5 % 930 7.0 % 4,215 3,846 9.6 % Trust fee income 467 449 4.0 % — 100.0 % 1,618 — 100.0 % Other income 1,107 475 133.1 % 488 126.8 % 2,549 1,909 33.5 % Total non-interest income 6,460 6,305 2.5 % 5,635 14.6 % 25,239 22,076 14.3 % Non-interest expense Salaries and employee benefits 8,347 8,736 4.5 % 7,376 -13.2 % 34,807 28,600 -21.7 % Occupancy 1,023 1,013 -1.0 % 809 -26.5 % 3,943 3,373 -16.9 % Equipment and data processing 2,256 2,303 2.0 % 1,916 -17.7 % 8,944 7,564 -18.2 % Financial institutions tax 300 348 13.8 % 410 26.8 % 1,648 1,694 2.7 % Advertising 317 285 -11.2 % 207 -53.1 % 991 845 -17.3 % Amortization of intangible assets 114 113 -0.9 % (26 ) 538.5 % 422 69 -511.6 % FDIC insurance premiums 249 301 17.3 % 172 -44.8 % 1,078 940 -14.7 % Other insurance premiums 114 115 0.9 % 77 -48.1 % 450 328 -37.2 % Professional fees: Legal fees 155 156 0.6 % 124 -25.0 % 724 583 -24.2 % Other professional fees 545 666 18.2 % 491 -11.0 % 2,151 1,416 -51.9 % Real estate owned and other repossessed asset expenses 17 33 48.5 % 1 -1600.0 % 135 191 29.3 % Acquisition related expenses 39 — 0.0 % 787 0.0 % 5,001 787 -100.0 % Other expenses 3,853 1,395 -176.2 % 1,373 -180.6 % 7,965 5,629 -41.5 % Total non-interest expenses 17,329 15,464 -12.1 % 13,717 -26.3 % 68,259 52,019 -31.2 % Income before income taxes 9,017 10,847 -16.9 % 6,978 29.2 % 33,991 27,657 22.9 % Taxable equivalent adjustment 221 224 1.3 % 219 -0.9 % 911 686 -32.8 % Income tax expense 4,294 3,067 -40.0 % 1,734 -147.6 % 11,295 8,143 -38.7 % Net income $ 4,502 $ 7,556 -40.4 % $ 5,025 -10.4 % $ 21,785 $ 18,828 15.7 % Earnings per common share: Basic $ 0.090 $ 0.152 -40.8 % $ 0.108 -16.7 % $ 0.440 $ 0.401 9.7 % Diluted 0.090 0.151 -40.4 % 0.107 -15.9 % 0.437 0.399 9.5 % (1) Net interest income is also presented on a fully taxable equivalent (FTE) basis, the Company believes this non-GAAP measure is the preferred industry measurement for this item.\nUNITED COMMUNITY FINANCIAL CORP. CONSOLIDATED AVERAGE BALANCES (Unaudited) For the three months ended December 31, 2017 September 30, 2017 December 31, 2016 Average Interest Average Interest Average Interest outstanding earned/ Yield/ outstanding earned/ Yield/ outstanding earned/ Yield/ balance paid rate balance paid rate balance paid rate (Dollars in thousands) Interest earning assets: Net loans (1) $ 1,975,847 $ 21,531 4.36 % $ 1,906,786 $ 20,699 4.34 % $ 1,485,617 $ 15,286 4.12 % Loans held for sale 88,247 886 4.02 % 88,854 882 3.97 % 61,289 578 3.77 % Total loans, net 2,064,094 22,417 4.34 % 1,995,640 21,581 4.33 % 1,546,906 15,864 4.10 % Securities: Available for sale-taxable 214,631 1,222 2.28 % 224,927 1,276 2.27 % 292,115 1,569 2.15 % Available for sale-nontaxable (2) 58,903 609 4.14 % 59,057 611 4.14 % 54,018 561 4.15 % Held to maturity-taxable 75,136 421 2.24 % 77,947 424 2.18 % 87,480 422 1.93 % Held to maturity-nontaxable (2) 9,233 77 3.34 % 9,239 76 3.29 % 13,438 99 2.95 % Total securities 357,903 2,329 2.60 % 371,170 2,387 2.57 % 447,051 2,651 2.37 % Federal Home Loan Bank stock 19,324 267 5.53 % 19,324 253 5.24 % 18,068 181 4.01 % Other interest earning assets 22,656 57 1.01 % 18,881 51 1.08 % 22,071 18 0.33 % Total interest earning assets 2,463,977 25,070 4.07 % 2,405,015 24,272 4.04 % 2,034,096 18,714 3.68 % Non-interest earning assets 179,023 185,773 134,902 Total assets $ 2,643,000 $ 2,590,788 $ 2,168,998 Interest bearing liabilities: Deposits: Checking accounts $ 600,249 589 0.39 % $ 591,982 468 0.32 % $ 481,225 248 0.21 % Savings accounts 304,229 27 0.04 % 308,829 28 0.04 % 291,212 25 0.03 % Certificates of deposit Customer certificates of deposit 530,297 1,458 1.10 % 526,697 1,333 1.01 % 416,299 1,077 1.03 % Brokered certificates of deposit 164,147 529 1.29 % 135,956 397 1.17 % 47,760 75 0.63 % Total certificates of deposit 694,444 1,987 1.14 % 662,653 1,730 1.04 % 464,059 1,152 0.99 % Total interest bearing deposits 1,598,922 2,603 0.65 % 1,563,464 2,226 0.57 % 1,236,496 1,425 0.46 % Federal Home Loan Bank advances Long-term advances 48,409 404 3.34 % 48,212 388 3.22 % 47,628 337 2.83 % Short-term advances 301,424 961 1.28 % 310,152 927 1.20 % 342,174 395 0.46 % Total Federal Home Loan Bank advances 349,833 1,365 1.56 % 358,364 1,315 1.47 % 389,802 732 0.75 % Repurchase agreements and other 2,114 1 0.19 % 6,483 4 0.25 % 514 4 3.11 % Total borrowed funds 351,947 1,366 1.55 % 364,847 1,319 1.45 % 390,316 736 0.75 % Total interest bearing liabilities $ 1,950,869 3,969 0.81 % $ 1,928,311 3,545 0.74 % $ 1,626,812 2,161 0.53 % Non-interest bearing liabilities Total noninterest bearing deposits 355,225 337,067 257,412 Other noninterest bearing liabilities 41,400 35,576 33,544 Total noninterest bearing liabilities 396,625 372,643 290,956 Total liabilities $ 2,347,494 $ 2,300,954 $ 1,917,768 Shareholders’ equity 295,506 289,834 251,230 Total liabilities and equity $ 2,643,000 $ 2,590,788 $ 2,168,998 Net interest income and interest rate spread $ 21,101 3.26 % $ 20,727 3.30 % $ 16,553 3.15 % Net interest margin 3.43 % 3.45 % 3.26 % Average interest earning assets to average interest bearing liabilities 126.30 % 124.72 % 125.04 % Interest bearing deposits Checking accounts $ 600,249 $ 589 0.39 % $ 591,982 $ 468 0.32 % $ 481,225 $ 248 0.21 % Savings accounts 304,229 27 0.04 % 308,829 28 0.04 % 291,212 25 0.03 % Customer certificates of deposit 530,297 1,458 1.10 % 526,697 1,333 1.01 % 416,299 1,077 1.03 % Total customer deposits 1,434,775 2,074 0.58 % 1,427,508 1,829 0.51 % 1,188,736 1,350 0.45 % Brokered certificates of deposit 164,147 529 1.29 % 135,956 397 1.17 % 47,760 75 0.63 % Total interest bearing deposits 1,598,922 2,603 0.65 % 1,563,464 2,226 0.57 % 1,236,496 1,425 0.46 % Noninterest bearing deposits 355,225 — 0.00 % 337,067 — 0.00 % 257,412 — 0.00 % Total average deposits and cost of deposits $ 1,954,147 $ 2,603 0.53 % $ 1,900,531 $ 2,226 0.47 % $ 1,493,908 $ 1,425 0.38 % Other interest bearing liabilities Federal Home Loan Bank advances Long term advances $ 48,409 $ 404 3.34 % $ 48,212 $ 388 3.22 % $ 47,628 $ 337 2.83 % Short term advances 301,424 961 1.28 % 310,152 927 1.20 % 342,174 395 0.46 % Total Federal Home Loan Bank advances 349,833 1,365 1.56 % 358,364 1,315 1.47 % 389,802 732 0.75 % Repurchase agreements and other 2,114 1 0.19 % 6,483 4 0.25 % 514 4 3.11 % Total borrowed funds 351,947 1,366 1.55 % 364,847 1,319 1.45 % 390,316 736 0.75 % Total average deposits and other interest bearing liabilities and total cost of funds $ 2,306,094 $ 3,969 0.69 % $ 2,265,378 $ 3,545 0.63 % $ 1,884,224 $ 2,161 0.46 % Customer deposits interest bearing and noninterest bearing $ 1,790,000 $ 2,074 0.46 % $ 1,764,575 $ 1,829 0.41 % $ 1,446,148 $ 1,350 0.37 % Brokered deposits 164,147 529 1.29 % 135,956 397 1.17 % 47,760 75 0.63 % Total borrowings 351,947 1,366 1.55 % 364,847 1,319 1.45 % 390,316 736 0.75 % Cost of funds 2,306,094 3,969 0.69 % 2,265,378 3,545 0.63 % 1,884,224 2,161 0.46 % (1) Nonaccrual loans are included in the average balance at a yield of 0%. (2) Yields are on a fully taxable equivalent basis. UNITED COMMUNITY FINANCIAL CORP. SELECTED FINANCIAL HIGHLIGHTS (Unaudited) At or for the quarters ended December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 (Dollars in thousands, except per share data) Financial Data Total assets $ 2,649,334 $ 2,602,365 $ 2,553,565 $ 2,557,010 $ 2,191,345 Total loans, net 1,999,877 1,947,695 1,869,095 1,835,000 1,503,577 Total securities 353,472 360,371 375,738 430,357 440,803 Total deposits 1,956,739 1,938,699 1,893,993 1,905,205 1,514,991 Average interest-bearing deposits 1,598,922 1,563,464 1,579,438 1,434,644 1,236,496 Average noninterest-bearing deposits 355,225 337,067 333,784 306,402 257,412 Total shareholders' equity 293,694 291,851 285,480 277,102 249,806 Net interest income 20,880 20,503 20,494 18,476 16,334 Net interest income (FTE) (1) 21,101 20,727 20,723 18,713 16,553 Provision for loan losses 1,215 721 842 1,475 1,493 Noninterest income 6,460 6,305 7,090 5,384 5,635 Noninterest expense 17,329 15,464 15,176 20,290 13,717 Income tax expense 4,294 3,067 3,377 557 1,734 Net income 4,502 7,556 8,189 1,538 5,025 Share Data Basic earnings per common share $ 0.090 $ 0.152 $ 0.165 $ 0.032 $ 0.108 Diluted earnings per common share 0.090 0.151 0.163 0.032 0.107 Book value per common share 5.90 5.87 5.74 5.58 5.36 Tangible book value per common share 5.41 5.38 5.27 5.10 5.32 Market value per common share 9.13 9.60 8.31 8.34 8.94 Common shares outstanding at end of period 49,800 49,758 49,715 49,695 46,581 Weighted average shares outstanding--basic 49,497 49,460 49,392 48,289 46,216 Weighted average shares outstanding--diluted 49,827 49,851 49,795 48,646 46,415 Key Ratios Return on average assets (2) 0.68 % 1.17 % 1.27 % 0.25 % 0.93 % Return on average equity (3) 6.09 % 10.43 % 11.60 % 2.24 % 8.00 % Return on tangible equity (4) 6.62 % 11.35 % 12.66 % 2.39 % 8.05 % Net interest margin 3.43 % 3.45 % 3.46 % 3.28 % 3.26 % Efficiency ratio 63.73 % 57.13 % 54.71 % 83.78 % 61.89 % Nonperforming loans to net loans, end of period 0.59 % 0.62 % 0.58 % 0.58 % 0.83 % Nonperforming assets to total assets, end of period 0.64 % 0.75 % 0.72 % 0.74 % 0.94 % Allowance for loan loss as a percent of loans, end of period 1.05 % 1.04 % 1.04 % 1.02 % 1.25 % Delinquent loans to total net loans, end of period 0.86 % 0.89 % 0.77 % 0.81 % 1.26 %", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.ucfconline.com&esheet=51747701&newsitemid=20180123006421&lan=en-US&anchor=ir.ucfconline.com&index=1&md5=b2def128d72d17ab7572ae9423f376cc"], "published": "2018-01-24T00:10:00.000+02:00", "crawled": "2018-01-24T00:38:21.005+02:00", "highlightTitle": ""}