{"organizations": [], "uuid": "7739de560e58098d95d1708ab743a62b346f2bf5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-sterna-biologicals-appoints-christian-pangratz-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "sterna biologicals Appoints Christian Pangratz as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-08T12:53:00.000+02:00", "replies_count": 0, "uuid": "7739de560e58098d95d1708ab743a62b346f2bf5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-sterna-biologicals-appoints-christian-pangratz-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "sterna biologicals Appoints Christian Pangratz as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "christian pangratz", "sentiment": "negative"}, {"name": "christian m. pangratz", "sentiment": "none"}, {"name": "jonas renz", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MARBURG, Germany--(BUSINESS WIRE)-- sterna biologicals GmbH & Co. KG (sterna), an innovative clinical-stage immunology company developing novel treatments for chronic inflammatory diseases, announced today that the Company has appointed Christian M. Pangratz as Chief Executive Officer. He brings over 25 years of life sciences experience, notably in the areas of strategic planning, corporate and business development, alliance and project management, new product planning, marketing and sales.\n\"Christian is a proven senior executive with extensive leadership experience and an impressive track record. He was instrumental in a number of successful business transformations and high-value transactions across various therapeutic areas that are highly relevant to sterna,\" stated Jonas Renz, Managing Director of sterna biologicals.\nChristian Pangratz said, \"I am delighted to be joining sterna at such an exciting time. Within the past ten years, the Company has grown into an accomplished immunology player with four promising Phase II programs and is now poised for its next strategic move. I look forward to working with the sterna team to advance the Company to the succeeding stage in its development.\"\nBefore joining sterna, Christian Pangratz was Senior Vice President of Business Development at Vectura Group plc. He also served as Non-Executive Director on the Board of Directors of Skyepharma AG and Jagotec AG, both subsidiaries of Vectura in Switzerland, and on the Board of Directors of Tianjin Kinnovata Pharmaceutical Co. Ltd., a China-based joint venture between Vectura and Tianjin KingYork Group Company Ltd. From 2014 to 2016, Mr. Pangratz was Executive Vice President of Business Development, Alliance Management & Project Management at Skyepharma in Basel, Switzerland. Prior to this, he served as Chief Business Officer at Activaero, a German-American respiratory company, where he helped to grow the marketing and business development functions and played an instrumental role in the Company's trade sale to Vectura in 2014. From 2004 to 2011, Mr. Pangratz held a number of senior marketing, new product planning, project management, business development and alliance management positions at Nektar Therapeutics in San Francisco. Before moving to the United States, he gained extensive sales and marketing experience at Bayer and Pfizer across various European markets. Mr. Pangratz also was an Adjunct Professor at Webster University in Vienna, Austria, where he taught a Marketing Strategy & Execution class. He earned both a bachelor's degree in Business Administration and a master's degree in International Business from Webster University.\nABOUT STERNA BIOLOGICALS\nSterna biologicals GmbH & Co. KG is an innovative clinical-stage immunology company developing novel treatments for chronic inflammatory diseases such as asthma, chronic obstructive pulmonary disease (COPD), atopic dermatitis, and ulcerative colitis. By targeting transcription factors that play a pivotal role in regulating underlying inflammatory mechanisms, the Company's DNAzyme-based drug candidates can intervene at a very early stage in the inflammatory cascade. The Company has four programs in Phase II development.\nFor more information, please visit www.sterna-biologicals.com .\n //www.businesswire.com/news/home/20180108005888/en/\nsterna biologicals GmbH & Co. KG\nJonas Renz\nManaging Director\njonas.renz@sterna-biologicals.com\nTel.: +49 (0)6421.98 30 05 0\nor\nFor media enquiries:\nAnne Hennecke\nMC Services AG\nanne.hennecke@mc-services.eu\nTel.: +49 (0)211.52 92 52 22\nSource: sterna biologicals GmbH & Co. KG", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sterna-biologicals.com&esheet=51739355&newsitemid=20180108005888&lan=en-US&anchor=www.sterna-biologicals.com&index=1&md5=cb7170f3bbd5a4a1a8c359e64d9e0b45", "http://www.businesswire.com/news/home/20180108005888/en/"], "published": "2018-01-08T12:53:00.000+02:00", "crawled": "2018-01-08T15:17:06.005+02:00", "highlightTitle": ""}