{"organizations": [], "uuid": "9191e739933cf561e3c89deab00bb40be58de6eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 16, "shares": 16, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mexico-politics/mexico-senator-quits-party-to-join-leftist-presidential-frontrunner-idUSKBN1FA15X", "country": "US", "domain_rank": 408, "title": "Mexico senator quits party to join leftist presidential frontrunner", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T00:00:00.000+02:00", "replies_count": 0, "uuid": "9191e739933cf561e3c89deab00bb40be58de6eb"}, "author": "", "url": "https://www.reuters.com/article/us-mexico-politics/mexico-senator-quits-party-to-join-leftist-presidential-frontrunner-idUSKBN1FA15X", "ord_in_thread": 0, "title": "Mexico senator quits party to join leftist presidential frontrunner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MEXICO CITY (Reuters) - Mexican opposition Senator Gabriela Cuevas on Sunday said she will leave the center-right National Action Party (PAN) to join the campaign of leftist Andres Manuel Lopez Obrador, who leads polls ahead of July’s presidential election.\nThe decision by Cuevas, who is head of the Senate’s foreign relations committee, represents a win for Lopez Obrador as he seeks to oust the ruling Institutional Revolutionary Party (PRI) in his third attempt to clinch the presidency.\n“I’ve decided to join the movement that Andres Manuel Lopez Obrador has created,” Cuevas told reporters as she announced her departure from the party she had been with since she was 15.\nIn a statement, the PAN said Cuevas chose to leave after it was unable to guarantee her a federal representative’s position in the future.\nSenator Gabriela Cuevas announces her resignation to the National Action Party (PAN) during a news conference at the Senate in Mexico City, Mexico January 21, 2018. REUTERS/Daniel Becerril The PAN has entered into an electoral alliance with the center-left Party of the Democratic Revolution (PRD), with former PAN leader Ricardo Anaya at its head.\nThe coalition has put a squeeze on the number of safe seats the PRD and PAN can each distribute among leading politicians.\nLopez Obrador, or AMLO as he is commonly known, has vowed to combat inequality and corruption. But some international investors are concerned by suggestions that he might reverse parts of the government’s 2013-14 energy legislation, which ended a decades-long monopoly by state oil firm Pemex.\nAnaya’s coalition is second in opinion polls.\nPRI contender Jose Antonio Meade is in third place, weighed down by the PRI’s poor record on corruption.\nReporting by Gabriel Stargardter and Dave Graham; Editing by Daniel Wallis\n ", "external_links": [], "published": "2018-01-22T00:00:00.000+02:00", "crawled": "2018-01-22T00:11:41.000+02:00", "highlightTitle": ""}