{"organizations": [], "uuid": "dd8c6b4b63166122bbc629de39b7c7b555509c01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1224984038&w=1200&r=LYNXMPEE0O01B", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-global-markets/asia-shares-near-record-peak-but-trade-protectionist-fears-cast-shadow-idINKBN1FE03P", "country": "US", "domain_rank": 408, "title": "Asia shares near record peak but trade protectionist fears cast shadow", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T03:14:00.000+02:00", "replies_count": 0, "uuid": "dd8c6b4b63166122bbc629de39b7c7b555509c01"}, "author": "", "url": "https://in.reuters.com/article/us-global-markets/asia-shares-near-record-peak-but-trade-protectionist-fears-cast-shadow-idINKBN1FE03P", "ord_in_thread": 0, "title": "Asia shares near record peak but trade protectionist fears cast shadow", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "hideyuki sano", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "wilbur ross", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 1:12 AM / Updated 2 hours ago Euro climbs to highest in three years on ECB signals; bond yields gain Caroline Valetkevitch 4 Min Read \nNEW YORK (Reuters) - The euro rose to its highest in three years and bond yields climbed on Thursday, after the European Central Bank showed little concern about the single currency’s hottest run in nearly four years. \nConcerns about U.S. protectionism kept the U.S. dollar weak after its worst day in six months, but it was the absence of ECB worries over currency volatility after its first meeting of 2018 that sent the euro bulls charging again. \nThe ECB also kept its ultra-easy monetary policy firmly on hold. ECB President Mario Draghi cited the region’s “solid and broad” growth and said inflation was likely to rise in the medium term. \nDraghi limited his comments to the side effects of currency volatility, rather than addressing the lofty level of the euro. Some market participants had expected Draghi to take a firmer stance to address the euro’s potentially damaging surge against the dollar. \n“Overall, the comments regarding the exchange rate were benign,” said Eric Viloria, currency strategist at Wells Fargo Securities in New York. “There was a lack of any forceful comments with respect to the recent euro strength.” \nThe dollar index .DXY, tracking the greenback against a basket of major currencies, fell 0.58 percent, with the euro EUR= up 0.69 percent to $1.2492. The euro earlier jumped about 1 percent to $1.2536, its highest since mid-December 2014. \nU.S. Treasury debt yields for most maturities rose from earlier lows, in line with euro zone bonds following Draghi’s remarks. The yield on 10-year German government bonds, the benchmark for the bloc, hit a six-month high at 0.579 percent DE10YT=TWEB. \nU.S. benchmark 10-year notes US10YT=RR last rose 3/32 in price to yield 2.6448 percent, from 2.654 percent late Wednesday. FILE PHOTO: The London Stock Exchange Group offices are seen in the City of London, Britain, December 29, 2017. REUTERS/Toby Melville \nIn the U.S. equity market, the benchmark S&P 500 index edged up modestly, though it was off early highs spurred by solid earnings reports and a decline in the dollar. \nWeighing on the index was Caterpillar Inc ( CAT.N ), whose shares turned negative as investors booked profit after an earlier jump of as much as 2.8 percent following its results. \nThe Dow Jones Industrial Average .DJI rose 157.42 points, or 0.6 percent, to 26,409.54, the S&P 500 .SPX gained 5.36 points, or 0.19 percent, to 2,842.9 and the Nasdaq Composite .IXIC added 22.12 points, or 0.3 percent, to 7,437.18. \nThe pan-European FTSEurofirst 300 index .FTEU3 lost 0.64 percent and MSCI's gauge of stocks across the globe .MIWD PUS gained 0.16 percent. \nInvestors awaited comments from U.S. President Donald Trump, who is scheduled to speak in Davos later. \n“Our economy is now booming and with all I am doing, will only get better...Our country is finally WINNING again!” Trump tweeted. \nOn Wednesday in Davos, U.S. Treasury Secretary Steven Mnuchin made a major departure from traditional U.S. currency policy, saying “obviously a weaker dollar is good for us as it relates to trade and opportunities.” \nIn the oil market, U.S. crude CLcv1 rose 0.67 percent to $66.05 per barrel and Brent LCOcv1 was last at $70.87, up 0.48 percent on the day. [O/R] \nGold held near its highest since August 2016 as a weak dollar helped it extend gains. Spot gold XAU= was up 0.1 percent at $1,359 an ounce. Additional reporting by Marc Jones in London and Saqib Iqbal Ahmed in New York; Editing by Bernadette Baum", "external_links": [], "published": "2018-01-25T03:14:00.000+02:00", "crawled": "2018-01-25T03:33:09.029+02:00", "highlightTitle": ""}