{"organizations": [], "uuid": "ad21ef5fa55928f3fa399e6eda8c1e8cb93a9fc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-datapath-appoints-new-chief-financial-officer-and-first-chief-operations-officer.html", "country": "US", "domain_rank": 767, "title": "DataPath Appoints New Chief Financial Officer and First Chief Operations Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T15:00:00.000+02:00", "replies_count": 0, "uuid": "ad21ef5fa55928f3fa399e6eda8c1e8cb93a9fc2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-datapath-appoints-new-chief-financial-officer-and-first-chief-operations-officer.html", "ord_in_thread": 0, "title": "DataPath Appoints New Chief Financial Officer and First Chief Operations Officer", "locations": [], "entities": {"persons": [{"name": "brad majeres", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "carter johnson", "sentiment": "none"}, {"name": "johnson suc", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": [{"name": "datapath, inc.", "sentiment": "neutral"}, {"name": "barco/esterline technologies", "sentiment": "none"}, {"name": "u.s. army", "sentiment": "none"}, {"name": "s1 corporation", "sentiment": "none"}, {"name": "meggitt training systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 17, 2018 /PRNewswire/ -- DataPath, Inc., a leading provider of remote communications and information technology solutions to the aerospace, broadcast, government, and critical infrastructure markets, announced today the appointment of two new executives upon the heels of record growth in 2017. The company named Carter Johnson as its Chief Financial Officer and Brad Majeres as its inaugural Chief Operations Officer.\nAs Chief Financial Officer, Johnson's primary responsibilities include leading all financial planning and analysis, accounting, treasury and audit functions, as well as managing investment initiatives for the company. Having served as a U.S. Army Officer, Johnson has extensive experience in a variety of aerospace and defense technology related organizations. He most recently served as the Senior Vice President of Finance and Contract Management at Meggitt Training Systems. Additionally, Johnson previously served in progressive finance leadership roles at businesses including Barco/Esterline Technologies, ChoicePoint/LexisNexis, and S1 Corporation. Johnson succeeds Emmett Moore, who served as CFO for nearly four years and rebuilt the finance, accounting and treasury functions for DataPath after its spin-out as an independent company in July 2014.\nBrad Majeres' position as COO is a newly created role designed to support the company as it expands in scale and continues to focus on quality and efficiency improvements. In response to significant growth including major new international contracts, DataPath is expanding its systems and processes. As COO, Majeres assumes a broad base of responsibilities including engineering and technology, processes and quality, information systems, supply chain, program management, logistics, technical services, and customer care. A satellite-industry veteran, Majeres brings extensive leadership experience to DataPath, having previously served as a business line general manager and head of engineering, program management, and operations at organizations including ViaSat, General Dynamics, and Scientific Atlanta.\n\"Over the past three plus years DataPath has nearly doubled in size, launching four new product lines, and significantly expanding our services internationally,\" said President & CEO David Myers. \"To continue to support such rapid growth, we are positioning the company to move to the next level of performance with a renewed focus on the quality, scalability, and efficiency of our business. The addition of Carter and Brad's expertise, and the new COO role, will help DataPath to improve how it supports the evolving mission needs of our growing and diversifying customer base.\"\nAbout DataPath® Inc.\nIn remote and high-risk operating environments, dependable real-time communications are critical to situational awareness and mission success. DataPath specializes in advanced communications solutions tailored to the unique requirements of aerospace, broadcast, government, and critical infrastructure clients. Our solutions include a range of both custom and commercial off-the-shelf field communications and information technology products, including satellite communication systems, network management software, and cybersecurity services. All of our offerings are backed by 24x7 customer care and global field support. At DataPath we are passionate about helping our clients achieve mission success. For more information, visit www.datapath.com .\nContact:\nDataPath, Inc.\nAnna Fry\nanna.fry@datapath.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/datapath-appoints-new-chief-financial-officer-and-first-chief-operations-officer-300583690.html\nSOURCE DataPath, Inc.", "external_links": ["http://www.datapath.com/", "http://www.prnewswire.com/news-releases/datapath-appoints-new-chief-financial-officer-and-first-chief-operations-officer-300583690.html"], "published": "2018-01-17T15:00:00.000+02:00", "crawled": "2018-01-17T15:47:17.010+02:00", "highlightTitle": ""}