{"organizations": [], "uuid": "d13a3027d7e92776b9e46c8feebf95f688b4c8bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-biolife-solutions-announces-preliminary-2017-revenue-increase-of-34-percent-to-11-million.html", "country": "US", "domain_rank": 767, "title": "BioLife Solutions Announces Preliminary 2017 Revenue Increase of 34% to $11 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.408, "site_type": "news", "published": "2018-01-04T14:30:00.000+02:00", "replies_count": 0, "uuid": "d13a3027d7e92776b9e46c8feebf95f688b4c8bc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-biolife-solutions-announces-preliminary-2017-revenue-increase-of-34-percent-to-11-million.html", "ord_in_thread": 0, "title": "BioLife Solutions Announces Preliminary 2017 Revenue Increase of 34% to $11 Million", "locations": [], "entities": {"persons": [], "locations": [{"name": "wash.", "sentiment": "none"}, {"name": "bothell", "sentiment": "none"}], "organizations": [{"name": "biolife solutions , inc.", "sentiment": "negative"}, {"name": "product adoption management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOTHELL, Wash., Jan. 4, 2018 /PRNewswire/ -- BioLife Solutions , Inc. (NASDAQ: BLFS) (\"BioLife\"), the leading developer, manufacturer and marketer of proprietary clinical-grade cell and tissue hypothermic storage and cryopreservation freeze media, today announced preliminary Q4 and full year 2017 revenue and provided additional operational updates and financial guidance for 2018.\nQ4 and FY2017 Preliminary Revenue\nPreliminary revenue for the fourth quarter of 2017 was $3.1 million, a 39% increase over the prior-year period. For the full year 2017, preliminary revenue was $11 million, a 34% increase from 2016. The growth was driven by increased sales to customers in the regenerative medicine segment and our worldwide distributors.\nProduct Adoption\nManagement estimates that BioLife's proprietary CryoStor 速 and HypoThermosol 速 biopreservation media products have been used in more than 275 customer clinical applications, including 16 phase 3 clinical trials. This is an increase of 45 additional clinical applications since January 1, 2017. Products were shipped to more than 2,000 customers during 2017.\nCash Balance\nThe year-end 2017 cash balance was $6.7 million, compared with $1.4 million at the end of 2016. The increase in cash was primarily the result of positive operating cash flow in the second half of 2017, combined with $3.7 million in cash proceeds from the exercise of 771,434 previously outstanding common stock warrants related to the Company's 2014 registered direct stock offering.\nMike Rice, BioLife President & CEO, commented, \"We successfully executed in key performance areas throughout 2017. We closed the year with record revenue, increased product adoption, positive cash flow from operations for the second half of the year, and a stronger balance sheet. We are very well positioned for continued growth and increased shareholder value in 2018, considering the broad adoption of our products in the high-growth regenerative medicine market.\"\n2018 Guidance\nManagement has issued financial guidance for 2018 as follows:\nBiopreservation media revenue is expected to range between $13.6 million to $14.7 million, representing growth of 25% to 35% over 2017. Gross margin is expected to range between 62% to 64%, compared to 2017 guidance of 60% to 62%. Operating expenses are expected to range from $9 million to $9.5 million, an increase of 13% to 19% compared to 2017 guidance of $8 million. GAAP operating profit is expected on a full year basis.\nRoderick de Greef, Chief Financial Officer, remarked, \"Our financial results in 2017 improved across the board, and we expect these positive trends to continue in 2018. We are particularly pleased to have eliminated $4.2 million in senior debt, and we added $5.3 million in cash to our balance sheet during the year without any increase in our fully diluted share count.\"\nAbout BioLife Solutions\nBioLife Solutions is the leading developer, manufacturer and supplier of proprietary clinical-grade cell and tissue hypothermic storage and cryopreservation freeze media for cells and tissues. Our proprietary HypoThermosol 速 and CryoStor 速 platform of solutions are highly valued in the regenerative medicine, biobanking and drug discovery markets. Our biopreservation media products are serum-free and protein-free, fully defined, and are formulated to reduce preservation-induced cell damage and death; offering commercial companies and clinical researchers significant improvement in shelf life and post-preservation viability and function.\n please visit www.biolifesolutions.com , and follow BioLife on Twitter .\nCautions Regarding Forward Looking Statements\nExcept for historical information contained herein, this press release contains within the meaning of the Private Securities Litigation Reform Act of 1995. These include, but are not limited to, statements concerning the company's anticipated business and operations, guidance for financial results in 2018, the potential utility of and market for its products and services, potential revenue growth and market expansion, regulatory approvals and/or commercial manufacturing of our customers' products, and potential customer revenue. All statements other than statements of historical fact are statements that could be deemed . These statements are based on management's current expectations and beliefs and are subject to a number of risks, uncertainties and assumptions that could cause actual results to differ materially from those described in the , including among other things, uncertainty regarding market adoption of products; uncertainty regarding third-party market projections; market volatility; competition; litigation; and those other factors described in our risk factors set forth in our filings with the Securities and Exchange Commission from time to time, including our Annual Report on Form 10-K and Quarterly Reports on Form 10-Q. We undertake no obligation to update the contained herein or to reflect events or circumstances occurring after the date hereof, other than as may be required by applicable law.\nMedia & Investor Relations\nRoderick de Greef\nChief Financial Officer\n(425) 686-6002\nrdegreef@biolifesolutions.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/biolife-solutions-announces-preliminary-2017-revenue-increase-of-34-to-11-million-300577305.html\nSOURCE BioLife Solutions, Inc.", "external_links": ["http://www.biolifesolutions.com/cryostor/", "http://twitter.com/biolifesol", "http://www.prnewswire.com/news-releases/biolife-solutions-announces-preliminary-2017-revenue-increase-of-34-to-11-million-300577305.html", "http://www.biolifesolutions.com/", "http://www.biolifesolutions.com/hypothermosol/"], "published": "2018-01-04T14:30:00.000+02:00", "crawled": "2018-01-04T13:59:39.000+02:00", "highlightTitle": ""}