{"organizations": [], "uuid": "e305f0d0f95e69166d5e9bb104fc6b73aabf801e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-realtime-electronic-payments-repay-acquires-paymaxx-pro.html", "country": "US", "domain_rank": 767, "title": "Realtime Electronic Payments (REPAY) acquires PayMaxx Pro", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T19:56:00.000+02:00", "replies_count": 0, "uuid": "e305f0d0f95e69166d5e9bb104fc6b73aabf801e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-realtime-electronic-payments-repay-acquires-paymaxx-pro.html", "ord_in_thread": 0, "title": "Realtime Electronic Payments (REPAY) acquires PayMaxx Pro", "locations": [], "entities": {"persons": [{"name": "megan bussie", "sentiment": "none"}, {"name": "john morris", "sentiment": "none"}, {"name": "jon leedom", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": [{"name": "paymaxx", "sentiment": "negative"}, {"name": "paymaxx pro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 10, 2018 /PRNewswire/ -- REPAY – Realtime Electronic Payments, a premier provider of advanced payment technology products and electronic transaction processing services for the consumer finance industry, has acquired PayMaxx Pro, an electronic payments provider to the automotive industry.\n\"This acquisition expands our footprint in the automotive industry and broadens our software integration capabilities, enabling us to better serve our existing and prospective customers,\" said John Morris, Chief Executive Officer of REPAY.\n\"PayMaxx Pro's people will bring a wealth of knowledge and expertise, and we look forward to welcoming Megan Bussie, Jon Leedom and their team to the REPAY family,\" added Morris.\nPayMaxx Pro customers will soon experience the benefits of the acquisition. \"We are excited about the expanded product offerings and technology enhancements this partnership brings to our integrated partners and clients,\" said Megan Bussie, former Director of PayMaxx Pro and now Director of Sales for REPAY. Customers will have access to an enhanced product suite, including a customer-facing mobile app, and they will continue to receive the exceptional PayMaxx Pro customer service.\nBoth companies will benefit from shared resources and cutting-edge technology, and REPAY will continue to invest in the consumer finance and automotive industries. REPAY will expand its relationships with software partners and will remain committed to providing a first-class customer experience where customers can automate and accept payments anywhere, anytime and through any method.\n\"REPAY was the obvious choice when selecting a group that had the resources, knowledge and commitment to continue the growth of PayMaxx Pro. They will build upon the products and services that will enhance our clients' business operations,\" said Chris Leedom, CEO and President of PayMaxx Pro.\nAbout REPAY\nRealtime Electronic Payments (REPAY) is a full-service provider of electronic transaction processing services for a variety of integrated end markets, offering a suite of advanced payment technology products, including credit/debit card processing, ACH processing, consumer-facing payment portals, and electronic bill payment systems. For more information, visit www.repay.com .\nAbout PayMaxx Pro\nPayMaxx Pro was formed as a division of the Leedom Group in response to a need for a payment processing platform specifically structured for the automotive industry. PayMaxx Pro offers ACH and card processing through various payment methods and integrated solutions. PayMaxx Pro processes thousands of transactions and over $1 billion annually. For more information, visit www.paymaxxpro.com .\nView original content: http://www.prnewswire.com/news-releases/realtime-electronic-payments-repay-acquires-paymaxx-pro-300580824.html\nSOURCE REPAY Realtime Electronic Payments", "external_links": ["http://www.paymaxxpro.com/", "http://www.repay.com/", "http://www.prnewswire.com/news-releases/realtime-electronic-payments-repay-acquires-paymaxx-pro-300580824.html"], "published": "2018-01-10T19:56:00.000+02:00", "crawled": "2018-01-10T20:20:48.004+02:00", "highlightTitle": ""}