{"organizations": [], "uuid": "87fc35cdbb3b5028fe2d9ff12ccf711d8c265256", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221237551&w=1200&r=LYNXMPEE0A1R5", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/us-climatechange-draft/warming-set-to-breach-paris-accords-toughest-limit-by-mid-century-draft-idUKKBN1F02RH", "country": "US", "domain_rank": 408, "title": "Warming set to breach Paris accord's toughest limit by mid century-draft", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T22:20:00.000+02:00", "replies_count": 0, "uuid": "87fc35cdbb3b5028fe2d9ff12ccf711d8c265256"}, "author": "", "url": "https://uk.reuters.com/article/us-climatechange-draft/warming-set-to-breach-paris-accords-toughest-limit-by-mid-century-draft-idUKKBN1F02RH", "ord_in_thread": 0, "title": "Warming set to breach Paris accord's toughest limit by mid century-draft", "locations": [], "entities": {"persons": [{"name": "alister doyle", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "shandong province", "sentiment": "none"}, {"name": "jinan", "sentiment": "none"}], "organizations": [{"name": "min read  oslo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 8:19 PM / Updated 38 minutes ago Warming set to breach Paris accord's toughest limit by mid century: draft Environment Correspondent Alister Doyle 4 Min Read \nOSLO (Reuters) - Global warming is on track to breach the toughest limit set in the Paris climate agreement by the middle of this century unless governments make unprecedented economic shifts from fossil fuels, a draft U.N. report said. Buildings are seen in heavy smog during a polluted day in Jinan, Shandong province, China, December 20, 2016. REUTERS/Stringer \nThe draft, of a report due for publication in October, said governments will also have to start sucking carbon dioxide from the air to achieve the ambition of limiting temperatures to 1.5 degrees Celsius (2.7 Fahrenheit) above pre-industrial times. \n“There is very high risk that ... global warming will exceed 1.5 degrees Celsius above pre-industrial levels,” the U.N. panel of experts wrote, based on the current pace of warming and current national plans to limit their greenhouse gas emissions. \nThere were no historic precedents for the scale of changes required in energy use, to shift from fossil fuels to renewable energies, and in reforms ranging from agriculture to industry to stay below the 1.5C limit, it said. \nThe draft, by the U.N.’s Intergovernmental Panel on Climate Change (IPCC) of leading scientists and obtained by Reuters, says average surface temperatures are about 1C above pre-industrial times and that average temperatures are on track to reach 1.5C by the 2040s. \nCurbing warming to 1.5C would help limit heat extremes, droughts and floods, more migration of people and even risks of conflict compared to higher rates of warming, according to the draft summary for policymakers. \nBut a 1.5C rise might not be enough to protect many coral reefs, already suffering from higher ocean temperatures, and ice stored in Greenland and West Antarctica whose melt is raising sea levels. \nAt a 2015 summit in Paris, almost 200 nations set a goal of limiting a rise in the world’s average surface temperatures to “well below” 2C (3.6 F) above pre-industrial times while “pursuing efforts” for the far tougher 1.5 ceiling. \nThey commissioned the IPCC report to map the risks of each goal. The 1.5C limit is favored especially by developing nations most at risk from disruptions to food and water supplies. \nThe current draft was sent out for comments from governments and other experts this week. Jonathan Lynn, spokesman for the IPCC, said the text was a work in progress not intended for publication. “The text can change substantially” he said. \nU.S. President Donald Trump, who doubts climate change is man-made, plans to pull out of the Paris Agreement and instead focus on U.S. fossil fuels. \nBy contrast, the draft said that renewable energies such as solar and wind power would have to become the dominant form of primary energy by 2050 to achieve the 1.5C goal. “Coal would be phased out rapidly in most 1.5C pathways,” it said. \nAnd limiting global warming to 1.5C by 2100 would “involve removal of carbon dioxide from the atmosphere,” it said. \nThat could mean planting vast forests, which soak up carbon dioxide as they grow, or building power plants that burn wood or other plant matter and then capturing and burying the carbon dioxide they release. \nBut that it might not be feasible because forests could divert land from food crops. \nThe draft estimated that humanity could emit just 580 billion tonnes of greenhouse gases to give a better than 50 percent chance of limiting warming to 1.5C - roughly 12-16 years at current rates of emissions. \nThe amounts could be bigger if governments let temperatures exceed 1.5C and found a way of turning down the global thermostat later in the century. Reporting By Alister Doyle; Editing by Toby Chopra", "external_links": [], "published": "2018-01-11T22:20:00.000+02:00", "crawled": "2018-01-11T23:25:26.012+02:00", "highlightTitle": ""}