{"organizations": [], "uuid": "2047dfbe2b23c0049e315b7106e08f3c8e7f268f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-property-bonds/rpt-investors-put-back-chinese-property-bonds-on-refinancing-fears-idUSL4N1PK1J3", "country": "US", "domain_rank": 408, "title": "RPT-Investors put back Chinese property bonds on refinancing fears", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T04:40:00.000+02:00", "replies_count": 0, "uuid": "2047dfbe2b23c0049e315b7106e08f3c8e7f268f"}, "author": "", "url": "https://www.reuters.com/article/china-property-bonds/rpt-investors-put-back-chinese-property-bonds-on-refinancing-fears-idUSL4N1PK1J3", "ord_in_thread": 0, "title": "RPT-Investors put back Chinese property bonds on refinancing fears", "locations": [], "entities": {"persons": [{"name": "clare jim", "sentiment": "none"}, {"name": "andrew galbraith", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats to additional subscribers. No change to text.)\n* 231 bln yuan of put options come due in 2018\n* Refinancing stress may lead to defaults of weaker issuers\n* More than 90 pct of onshore puttable property bonds in-the-money\nBy Clare Jim and Andrew Galbraith\nHONG KONG/SHANGHAI, Jan 25 (Reuters) - Investors have started exercising put options of onshore property bonds due to concerns about tight industry liquidity and rising interest rates, market observers said, fuelling refinancing pressures for small Chinese developers.\nWhile some smaller firms may be forced to default, the surge in put options being exercised could force major players to either increase coupon payments or make early repayments as funding costs rise across the massive Chinese property sector.\nA record volume of put options issued by property firms - one of the most indebted industries in China - will come due in 2018, totalling 231 billion yuan ($36.1 billion), according to ratings agency Fitch.\nThat refinancing demand comes in addition to the 170 billion yuan in bonds with maturity dates this year.\nInvestors expect to see small defaults by weaker issuers, some of which are already squeezed for cash after years of onshore bond market restrictions, tighter rules on bank lending and policies aimed at limiting property sales.\n“Most investors will put back the bonds in a weaker sector when the exercise date matures,” said a fixed income portfolio manager at a large asset management firm in Shanghai, who asked not to be named because he was not authorised to speak to the media.\n“Real estate last year was not very good just because of the regulation and the macro control of housing prices,” he said, adding that investors would “of course” put back these bonds when given the chance.\nAccording to Fitch, more than 90 percent of onshore puttable bonds issued by Chinese property developers are in-the-money, which means the current market price of the bond is below the strike price of the put option.\nPuttable bonds, which typically carry lower yields than comparable option-free bonds, have played an important role for Chinese companies looking for relatively low-cost financing.\nFitch estimates that about 20 percent of outstanding onshore non-financial corporate bonds in China, worth about $420 billion, contain a put option that gives investors the right to demand early repayment of principal, compared with about 4 percent of corporate bonds globally.\nEven before this year’s surge of put options coming due, investors have been exercising their rights to put back bonds of smaller developers. A total of 1.4 billion yuan worth of 4-year bonds issued by Hebei-based Risesun Real Estate were put back in July 2017, two years before the bond’s maturity date.\nAll 500 million yuan worth of 7-year bonds issued by Shenzhen New Nanshan Holding Group were put back in April, also two years before their maturity date.\nRising bond yields have made investors more inclined to exercise put options. The yield on 5-year AAA-rated corporate debt was at 5.4249 percent on Jan. 24, up more than 145 basis points over the past year.\nHIGHER FUNDING COSTS Analysts say they are not worried about larger, rated developers, which have better access to bank lending and stronger cashflow from property sales. But even these stronger players could face higher funding costs after negotiations.\n“There’s usually a 1-2 percent uptick in coupon price after negotiations. This year ... maybe 1-2 percent is not enough and issuers may need to buy back the bonds directly, but it really depends on market factors,” said Christopher Yip, S&P Global Ratings senior director.\nLast year, Fitch estimated that a 100 basis-point increase in market rates by 2019 would raise interest expenses by at least 28 percent for 10 percent of issuers with bonds that have put dates in 2019.\nOf the rated developers, Moody’s said 85 percent of bonds with put options coming due in 2018 were issued by high-yield developers. And among the five largest issuers, namely China Evergrande, Guangzhou R&F, Greenland Holdings, Country Garden and Dalian Wanda Commercial Properties, only R&F would have less than a 1.5x ratio of cash at year-end 2017 to 2018 bond maturities and puts.\nFantasia Holdings and Ronshine China, two smaller developers, have also seen their ratios fall below 1.5x, but Moody’s expects they will have some flexibility to extend puttable onshore bonds by stepping up coupon payments.\nA spokesman for Guangzhou R&F declined to comment, and Fantasia and Ronshine did not respond to emailed requests for comment.\nSenior executives at two top-ten developers said they expected to see some small defaults this year, but that they believed this would be healthy for the sector.\n“The weak ones should be wiped out; it helps market consolidation,” said a Shanghai-based developer. “The defaulted issuer will be forced to sell its assets and then it will be able to repay the bond.” ($1 = 6.4000 Chinese yuan) (Reporting by Clare Jim in HONG KONG and Andrew Galbraith in SHANGHAI; Editing by Stephen Coates)\n ", "external_links": [], "published": "2018-01-25T04:40:00.000+02:00", "crawled": "2018-01-25T05:07:34.027+02:00", "highlightTitle": ""}