{"organizations": [], "uuid": "f52c8f0f250d70c1972ecc974b054ccd1d36dc72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/11/gettyimages-606185414.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/apple-tax-break-donald-trump/", "country": "US", "domain_rank": 1196, "title": "Apple Could Get a $4 Billion Break Because of a Tax-Law Quirk | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.11, "site_type": "news", "published": "2018-01-11T14:59:00.000+02:00", "replies_count": 0, "uuid": "f52c8f0f250d70c1972ecc974b054ccd1d36dc72"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/11/apple-tax-break-donald-trump/", "ord_in_thread": 0, "title": "Apple Could Get a $4 Billion Break Because of a Tax-Law Quirk | Fortune", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "stephen shay", "sentiment": "none"}, {"name": "shay", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "harvard law school", "sentiment": "none"}, {"name": "general electric co.", "sentiment": "none"}, {"name": "alphabet inc.", "sentiment": "none"}, {"name": "microsoft corp.", "sentiment": "none"}, {"name": "cisco systems inc.", "sentiment": "none"}, {"name": "apple inc.", "sentiment": "none"}, {"name": "amgen inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 12:59 PM EST \nCompanies that stockpiled trillions of dollars offshore free of U.S. income tax may get one last break before paying up — provided their fiscal years don’t follow the calendar year. \nA timing quirk in the tax overhaul that President Donald Trump signed last month may be good news for companies such as Apple Inc., Microsoft Corp. and Cisco Systems Inc., all of which began their fiscal years before Jan. 1. Firms including Alphabet Inc., Amgen Inc. and General Electric Co. — with fiscal years that began on Jan. 1 — appear to be shut out of the benefit. \nApple alone, which disclosed an offshore cash hoard of $252 billion as of Sept. 30, may be able to lop more than $4 billion off a future tax bill, according to Stephen Shay, a tax and business law professor at Harvard Law School who wrote about what he called the “potential loophole” last month. He characterized the boon as a side effect of the speed with which congressional Republicans passed their tax bill. \n“This bill was passed on a speed train schedule with no time to think,” said Shay, who was a senior Treasury Department official during the administrations of former presidents Barack Obama and Ronald Reagan. It’s up to Treasury and the Internal Revenue Service to create rules to prevent companies from taking advantage, he said. \nIn passing the most extensive tax-code revisions since 1986, Congress scrapped the previous international tax system for corporations — an unusual arrangement that allowed companies to defer U.S. income taxes on foreign earnings until they returned the income to the U.S. That “deferral” provision led companies to stockpile an estimated $3.1 trillion offshore. \nIn switching to a new system that’s designed to focus on domestic economic activity, congressional tax writers also imposed a two-tiered levy on all that accumulated foreign income: Cash will be taxed at 15.5 percent, less liquid assets at 8 percent. Companies can pay over eight years. Timing Issue \nThe timing issue that Shay surfaced stems from a provision that, in effect, gives a company until the end of its fiscal year to measure what’s cash and what isn’t for tax purposes. Consequently, companies that began new fiscal years before Jan. 1 get an extra chance to reduce foreign cash they’ll accumulate this year — which they can do by distributing cash dividends to their U.S. parents before tallying up what’s left to be taxed, Shay wrote. \nUnder separate changes that took effect Jan. 1, any such dividends would be tax-free in the U.S., he noted. \nThe law actually specifies two dates that companies should use in tallying their offshore cash piles — and they have to pay the 15.5 percent rate on whichever tally is larger. The options: The two-year average of foreign cash as of Nov. 2, the date the House introduced its tax bill; or the end of the firm’s current fiscal year — if it began before Jan. 1. \nHere’s how Shay said it could work for Apple, which began its fiscal year on Oct. 1: Under the Nov. 2 formula, the company’s two-year average offshore cash stash was $234 billion. Shay said Apple’s historical earnings suggest that figure could grow to $289 billion by Sept. 30, when its year ends. 7.5 Percentage Points \nTherefore, Shay said, if Apple’s foreign subsidiaries operate on the same fiscal year, they could distribute as much $55 billion to their parent, taking the overseas cash total down to match the Nov. 2 number. And because there’s a 7.5 percentage-point difference in the two tax rates, the company’s tax savings thanks to the distribution could amount to $4.1 billion, he said. \nA spokesman for Apple didn’t respond to requests for comment; nor did spokesmen for Cisco and Alphabet. Spokesmen for Microsoft, Oracle , Amgen and GE declined to comment. \nThe IRS didn’t respond to a request for comment. One line in the tax bill says that if federal officials determine that a company has shifted cash or cash equivalents into other assets with “a principal purpose” of trying to reduce their tax bills, the transaction will be disregarded. But Shay said that line isn’t enough to prevent abuse, and the IRS should produce detailed, concrete guidance for companies. \nAs it stands now, if companies use the strategy to try to reduce their tax bills, it would be up to the IRS to challenge the move — and then see whether its position holds up in court, said Eric Solomon, a co-director of the national tax practice at Ernst & Young LLP. ‘Going Crazy’ \nOverall, multinational corporations — including those that don’t have the fiscal year advantage — are weighing different ways to mitigate the effects of the repatriation provision, said Solomon, who was a top Treasury tax official in former President George W. Bush’s administration. \nRepublican tax writers — who cut tax rates for businesses and individuals — sought to balance the cuts partly with hundreds of billions of dollars from companies paying levies on their stockpiles of offshore earnings. Setting the rates at 15.5 percent and 8 percent would generate almost $340 billion in revenue over a decade, according to estimates by the Joint Committee on Taxation, Congress’s official scorekeeper. \n“Practitioners have all been going crazy trying to figure out how to determine and potentially minimize the transition tax burden,” said Itai Grinberg, an international tax law professor at Georgetown University Law Center. \nThe IRS issued some guidance on Dec. 29, but companies are still awaiting additional details on many “pressing questions” related to offshore earnings, Solomon said. \nOne major question: How cash and cash-equivalents will be defined. Treasury Secretary Steven Mnuchin has the authority to write new rules specifying which assets he identifies as being economically equivalent to cash. The IRS said in its notice that commercial paper, foreign currency, certificates of deposit and governmental and state securities would all be considered cash and taxed at the 15.5 percent rate. \nThe tax bill’s international provisions “were put out in a rush,” and the IRS notice “is prime evidence of this and probably a bellwether for other problems to come,” said Chris Sanchirico, a tax law professor at the University of Pennsylvania Law School. \n“Are there planning opportunities?” said Sanchirico. “Yes, most likely.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-11T14:59:00.000+02:00", "crawled": "2018-01-11T20:40:19.042+02:00", "highlightTitle": ""}