{"organizations": [], "uuid": "b74ee2952b665477c450d66806cbe2cbc2507f1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WW428_cmocol_SOC_20180105184344.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/espns-new-pitch-to-advertisers-we-reach-women-1515409200", "country": "US", "domain_rank": 387, "title": "ESPN’s New Pitch to Advertisers: ‘We Reach Women’", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T13:00:00.000+02:00", "replies_count": 0, "uuid": "b74ee2952b665477c450d66806cbe2cbc2507f1a"}, "author": "Alexandra Bruell", "url": "https://www.wsj.com/articles/espns-new-pitch-to-advertisers-we-reach-women-1515409200", "ord_in_thread": 0, "title": "ESPN’s New Pitch to Advertisers: ‘We Reach Women’", "locations": [], "entities": {"persons": [{"name": "aditi gokhale", "sentiment": "none"}], "locations": [], "organizations": [{"name": "espn", "sentiment": "negative"}, {"name": "college football playoff", "sentiment": "none"}, {"name": "northwestern mutual", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "39 COMMENTS In the past, advertisers generally turned to sports TV to reach male audiences. But increasingly—with prodding from networks like ESPN—they’re taking a broader view.\nESPN, armed with new data about its viewers, is more aggressively selling its female audience, starting with the College Football Playoff, which culminates in Monday’s championship game. The timing couldn’t be better. Advertisers are looking for new ways to reach women, and more efficiently reach broader audiences, as consumer viewing habits change. \nFinancial services firm Northwestern Mutual is among the advertisers using college football to reach women and families. \nThe company wasn’t new to the playoff, and knew that the sporting event reached a “healthy mix of men and women and families,” but a new pitch and compelling data from ESPN helped the company “come up with different ad spots” targeting women and families, said Aditi Gokhale, Northwestern Mutual’s chief marketing officer. \nThe new campaign, dubbed “Spend Your Life Living,” includes one ad that follows the story of a female architect who decided to leave her current job to start her own business, with support from Northwestern Mutual. It’s the company’s first TV ad with a storyline focused solely on a woman and her career, said Ms. Gokhale. “We’re taking a personalized approach,” she said. \nMovie studio Warner Bros., also a longtime ESPN advertiser, is using the game this season to promote its family-friendly film “Paddington 2” to a broad audience of men and women.\n“The perception was that [college football] was always more male in the past,” said Blair Rich, president of worldwide marketing at Warner Bros. Pictures. “We used it for male-targeted films or broader films.” Now, the “evidence of what ESPN is showing” is compelling, she said.\nESPN’s sales pitch is an extension of its new marketing strategy to broaden its audience, with the aim of giving a boost to ratings and subscribers. The effort comes as ESPN grapples with a shift from traditional TV viewing to online consumption, leading to cord-cutting and subscriber losses. The network also recently announced that John Skipper resigned as its president, citing substance-abuse issues. \nESPN’s audience makeup during the college football playoffs was fairly consistent year-to-year, according to an ESPN spokeswoman. Still, the company has been making its case to advertisers with newly available data, such as Nielsen metrics that now encompass out-of-home viewing and streaming. \nFor example, ESPN found that its out-of-home audience watching the playoffs skewed slightly more female than its in-home audience, according to Nielsen figures from last year’s playoffs, calculated over a three-game average. Women also saw a larger lift in viewing from out-of-home than men, with a 9.4% lift over in-home audience compared to 7.2% for men. \nDuring last season’s College Football Playoff, 41% of the viewers watching at home were female and 59% were male, not including out-of-home viewing or streaming, according to Nielsen data from ESPN. \nRelying on this kind of audience data in a sales pitch is a shift for ESPN, said Ed Erhardt, president of global sales and marketing at ESPN. \nThe story ESPN is communicating to advertisers is more “about audience and less about the sport,” he said. “The sport speaks for itself, and we did a wonderful job for many years of pitching the ascendancy of the College Football Playoff.” \nAdvertisers targeting women aren’t necessary flocking to sports because they think more women are watching sports, explained Jeremy Carey, a managing director at Omnicom’s Optimum Sports. They’re flocking to sports because it’s getting more difficult to reach women through general primetime programming. \nWith general primetime entertainment ratings declining more than sports ratings, advertisers are seeing sports as a more desirable vehicle than it used to be to reach women, he said. And they’re tweaking their creative to be more gender-neutral, accordingly. \n“If we took top programs that delivered females 18-49, historically you would have found a very large percentage of primetime programming,” he said. In 2017, “about 75% of those programs are sports now.” That’s a “drastic shift” in recent years regarding “where females are available at mass scale.” \nThe shift in ESPN’s sales strategy is also evidence in how the network is promoting the playoff. The network teamed up with The Bachelor to create a video in which college football mascots, instead of women, compete for the heart of the bachelor during the show’s Rose Ceremony. \nThe network also changed up its media mix to include ad buys reaching female and casual fans, such as The Skimm, YuMe and Spotify. \nWrite to Alexandra Bruell at alexandra.bruell@wsj.com", "external_links": [], "published": "2018-01-08T13:00:00.000+02:00", "crawled": "2018-01-08T16:08:49.008+02:00", "highlightTitle": ""}