{"organizations": [], "uuid": "91515ed917bd8139413bd16e5d200a72be0c57f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/01/globe-newswire-union-bankshares-corporation-completes-acquisition-of-xenith-bankshares-inc.html", "country": "US", "domain_rank": 767, "title": "Union Bankshares Corporation Completes Acquisition Xenith Bankshares, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T16:00:00.000+02:00", "replies_count": 0, "uuid": "91515ed917bd8139413bd16e5d200a72be0c57f1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/01/globe-newswire-union-bankshares-corporation-completes-acquisition-of-xenith-bankshares-inc.html", "ord_in_thread": 0, "title": "Union Bankshares Corporation Completes Acquisition Xenith Bankshares, Inc.", "locations": [], "entities": {"persons": [{"name": "john c. asbury", "sentiment": "none"}], "locations": [{"name": "richmond", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "union bankshares corporation", "sentiment": "negative"}, {"name": "union bankshares corporation completes acquisition xenith bankshares, inc", "sentiment": "neutral"}, {"name": "xenith", "sentiment": "none"}, {"name": "xenith bankshares, inc.", "sentiment": "none"}, {"name": "commonwealth", "sentiment": "none"}, {"name": "union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RICHMOND, Va., Jan. 01, 2018 (GLOBE NEWSWIRE) -- Union Bankshares Corporation (“Union”) today announced the completion of its acquisition of Xenith Bankshares, Inc. (“Xenith”). The combination creates a Virginia headquartered independent regional bank for the first time in nearly 20 years.\nUnder the terms of the merger agreement, Xenith shareholders received 0.9354 shares of Union common stock in exchange for each share of Xenith common stock they owned, with cash paid in lieu of fractional shares.\n“Today marks the start of something remarkable for businesses and consumers in Virginia, Maryland and North Carolina – an independent regional bank headquartered in the Commonwealth,” said John C. Asbury, president and chief executive officer of Union. “We believe that our two companies are stronger together and the combination gives Union a unique franchise to create long term shareholder value. We expect that our combined statewide footprint will bring additional convenience to our customers and position us as a strong competitor against large regional institutions and smaller community banks alike – making us the preeminent commercial bank headquartered in Virginia.\n“The integration work is going well and everything remains on track for a systems conversion in late May 2018. Our teammates have been working tirelessly to ensure a smooth integration. I want to thank them for their continued customer focus during this transition period.”\nPursuant to the merger agreement, Patrick E. Corbin and Thomas G. Snead have been named to the Board of Directors of Union Bankshares Corporation. Corbin, 63, has been the Managing Shareholder of Corbin & Company, P.C. since 1983 and has been a CPA since 1979. Snead, 64, was the former Chairman and CEO of Trigon Blue Cross/Blue Shield in Richmond and later CEO of Anthem, Inc., Southeast Region, a managed care and health insurance company.\nBased on financial information reported as of September 30, 2017, the combined company would have total assets of approximately $12.3 billion, deposits of approximately $9.5 billion and loans of approximately $9.3 billion. Union will separately operate the former Xenith Bank branches as Xenith Bank, a division of Union Bank & Trust of Richmond, Virginia until systems conversion in late May 2018.\nABOUT UNION BANKSHARES CORPORATION\nHeadquartered in Richmond, Virginia, Union Bankshares Corporation (NASDAQ:UBSH) is the holding company for Union Bank & Trust, which has 151 banking offices, 40 of which are operated as Xenith Bank, a division of Union Bank & Trust of Richmond, Virginia, and approximately 220 ATMs located throughout Virginia, Maryland and North Carolina. Union Bank & Trust also operates Shore Premier Finance, a specialty marine lender. Non-bank affiliates of the holding company include: Union Mortgage Group, Inc., which provides a full line of mortgage products, Old Dominion Capital Management, Inc., which provides investment advisory services, and Union Insurance Group, LLC, which offers various lines of insurance products.\nAdditional information on the Company is available at http://investors.bankatunion.com .\nContact: Bill Cimino (804) 448-0937, VP and Director of Investor Relations\nFORWARD-LOOKING STATEMENTS\nCertain statements in this press release may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are statements that include projections, predictions, expectations, or beliefs about future events or results or otherwise are not statements of historical fact, are based on certain assumptions as of the time they are made, and are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified. Such statements are often characterized by the use of qualified words (and their derivatives) such as “expect,” “believe,” “estimate,” “plan,” “project,” “anticipate,” “intend,” “will,” “may,” “view,” “opportunity,” “potential,” or words of similar meaning or other statements concerning opinions or judgment of Union or its management about future events. Such statements include statements as to the anticipated benefits of the merger as well as other statements regarding the merger. Although Union believes that its expectations with respect to forward-looking statements are based upon reasonable assumptions within the bounds of its existing knowledge of its business and operations, there can be no assurance that actual results, performance, or achievements of Union will not differ materially from any projected future results, performance, or achievements expressed or implied by such forward-looking statements. Actual future results and trends may differ materially from historical results or those anticipated depending on a variety of factors, including but not limited to: (1) the businesses of Union and Xenith may not be integrated successfully or such integration may be more difficult, time-consuming or costly than expected; (2) expected revenue synergies and cost savings from the merger may not be fully realized or realized within the expected time frame; (3) revenues following the transaction may be lower than expected; (4) customer and employee relationships and business operations may be disrupted by the transaction; (5) changes in interest rates, general economic conditions, tax rates, legislative/regulatory changes, monetary and fiscal policies of the U.S. government, including policies of the U.S. Treasury and the Board of Governors of the Federal Reserve System; the quality and composition of the loan and securities portfolios; demand for loan products; deposit flows; competition; demand for financial services in the companies’ respective market areas; their implementation of new technologies; their ability to develop and maintain secure and reliable electronic systems; and accounting principles, policies, and guidelines, and (6) other risk factors detailed from time to time in filings made by Union with the Securities and Exchange Commission. Forward-looking statements speak only as of the date they are made and Union undertakes no obligation to update or clarify these forward-looking statements, whether as a result of new information, future events or otherwise.\nSource:Union Bankshares Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/f4e4a377-7518-492b-b259-993f661f5b36"], "published": "2018-01-01T16:00:00.000+02:00", "crawled": "2018-01-01T16:20:21.006+02:00", "highlightTitle": ""}