{"organizations": [], "uuid": "869d3b538af31980b779f6d4f7320e4207a58c58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/27/104864193-GettyImages-73562040.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/05/warren-buffett-in-time-us-kids-will-live-better-than-their-parents.html", "country": "US", "domain_rank": 767, "title": "Warren Buffett in Time: US kids will live better than their parents", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.757, "site_type": "news", "published": "2018-01-05T20:32:00.000+02:00", "replies_count": 0, "uuid": "869d3b538af31980b779f6d4f7320e4207a58c58"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/warren-buffett-in-time-us-kids-will-live-better-than-their-parents.html", "ord_in_thread": 0, "title": "Warren Buffett in Time: US kids will live better than their parents", "locations": [], "entities": {"persons": [{"name": "warren buffett", "sentiment": "negative"}, {"name": "buffet", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}, {"name": "bill gates", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "time magazine", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It may be freezing outside but a dose of spring-like optimism will emanate from newsstands this week as business magnate Warren Buffett assures readers that American children will have a better standard of living than their parents.\nThe essay for Time magazine's Jan. 15 issue (available Friday, Jan. 5), by Buffett, 87, comes as Millennials are projected to be the first generation in U.S. history to do worse financially than their moms and dads.\n\"I have good news,\" Buffet writes. \"First, most American children are going to live far better than their parents did. Second, large gains in the living standards of Americans will continue for many generations to come.\"\nMore from USA Today: \nBill Gates says people with these 3 skills will be successful in the future job market\nWarren Buffett wins $1M bet against hedge funds and gives it to girls' charity\nWarren Buffett gave away this much of his wealth in the past 10 years \nBut Buffett warns that happy outcome hinges on the nation closing the divide between rich and poor.\nHis essay highlights a special Time issue, titled \"The Optimists,\" guest-edited by philanthropist and Microsoft founder Bill Gates. In an editor's letter, Gates ticks off a litany of global ills, including last year's devastating North American hurricanes, mass shootings, the U.S. nuclear standoff with North Korea and bloody civil wars in Syria and Yemen.\nBut he adds, \"On the whole, the world is getting better.\" He points to heartening successes such as sharp declines in the portion of the global population living in extreme poverty and the number of children dying before their fifth birthday. Featured on the cover is 5-year-old Ethiopian Mohamad Nasir, whom Gates met less than a month after he was born.\nGetty Images Warren Buffett Other contributors include U2 lead singer Bono on why men must fight for women and girls; director Ava DuVernay on what gives her hope; Congressman John Lewis on why getting into trouble is necessary to make change; and Trevor Noah, host of The Daily Show, on Millennials as a hopeful generation.\nBut Buffett touches on perhaps the biggest running angst for Americans — the idea that \"our economic machine is sputtering,\" exemplified by growth in gross domestic product that has been mired at about 2 percent a year since the Great Recession ended in 2009.\nBuffett writes that with U.S. population growth slowing, smaller economic gains are needed. The population, he says, is expected to increase about 0.8 percent a year after factoring in births, deaths and immigration. Under that scenario, 2 percent annual increases in inflation-adjusted GDP would deliver 1.2 percent growth in per capita (or per person) GDP. In 25 years, that growth level would lift current GDP of $59,000 per capita to $79,000.\n\"This $20,000 increase guarantees a far better life for our children,\" Buffett writes.\nBuffett also tries to allay fears that innovation and productivity will mean lost jobs, a seeming nod to advances such as robots and artificial intelligence. In 1776, when the nation was founded, 80 percent of workers had jobs on farms, he says, but that figure has dwindled to just 2 percent today because of tractors, cotton gins and other inventions. If that kind of upheaval were foreseen, Americans would have wondered how all the unemployed farmers could find work, Buffett writes.\nBut he says farming's productivity gains \"freed nearly 80 percent of the nation's workforce to redeploy their efforts into new industries that have changed our way of life.\"\nshow chapters Kids Make Cents: Future Jobs      7:07 PM ET Fri, 16 June 2017 | 01:35 Increases in productivity, or worker output, have vastly raised living standards, Buffett adds, noting that upper-middle-class Americans today enjoy travel, entertainment, medicine and education options unavailable to John D. Rockefeller, the wealthiest American when Buffett was born in 1930.\nAmericans, he says, will similarly \"benefit from far more and better 'stuff' in the future. The challenge will be to have this bounty deliver a better life to the disrupted as well as to the disruptors.\n\"And on this matter, many Americans are justifiably worried.\"\nSince 1982, the wealth of the world's 400 richest people has increased 29 fold — from $93 billion to $2.7 trillion — \"while many millions of hard-working citizens remain stuck on an economic treadmill. During this period, the tsunami of wealth didn't trickle down. It surged upward.\"\nBut this can be fixed he says: \"A rich family takes care of all its children, not just those with talents valued by the marketplace.\"\n\"In the years of growth that certainly lie ahead, I have no doubt that America can both deliver riches to many and a decent life to all,\" he concludes. We must not settle for less.\"\nLike this story? Like CNBC Make It on Facebook! \nDon't miss: Here's why millennials would rather save than invest \nThis article originally appeared on USA Today. \nVideo by Brandon Ancil \nshow chapters This is how millennials can catch up to the boomer generation      3:00 PM ET Mon, 15 May 2017 | 00:56", "external_links": ["https://www.usatoday.com/story/money/careers/employment-trends/2017/12/31/bill-gates-says-people-these-3-skills-successful-future-job-market/989701001/", "http://time.com/5087360/warren-buffett-shares-the-secrets-to-wealth-in-america/", "https://www.usatoday.com/story/money/2018/01/04/buffett-time-u-s-kids-live-better-than-parents-he-writes-gates-edited-issue/1001218001/", "https://www.usatoday.com/story/money/markets/2018/01/02/warren-buffett-bet-against-hedge-funds-girls-charity/996993001/", "https://www.facebook.com/CNBCMakeIt/", "https://www.usatoday.com/story/money/2017/07/11/warren-buffett-charitable-contributions-bill-melinda-gates-foundation/468837001/"], "published": "2018-01-05T20:32:00.000+02:00", "crawled": "2018-01-05T20:03:28.000+02:00", "highlightTitle": ""}