{"organizations": [], "uuid": "982bd857238caa2ffd9447b9b95ef00d9a95a062", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/10", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-burns-mcdonnell-announces-promotions-for-board-of-directors-officer-group.html", "country": "US", "domain_rank": 767, "title": "Burns & McDonnell Announces Promotions for Board of Directors, Officer Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.092, "site_type": "news", "published": "2018-01-25T23:00:00.000+02:00", "replies_count": 0, "uuid": "982bd857238caa2ffd9447b9b95ef00d9a95a062"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-burns-mcdonnell-announces-promotions-for-board-of-directors-officer-group.html", "ord_in_thread": 0, "title": "Burns & McDonnell Announces Promotions for Board of Directors, Officer Group", "locations": [], "entities": {"persons": [{"name": "ray kowalik", "sentiment": "negative"}, {"name": "randy griffin", "sentiment": "none"}, {"name": "david yeamans", "sentiment": "none"}, {"name": "kowalik", "sentiment": "none"}, {"name": "denny scott", "sentiment": "none"}, {"name": "john olander", "sentiment": "none"}, {"name": "paul fischer", "sentiment": "none"}], "locations": [{"name": "kansas city", "sentiment": "none"}, {"name": "mo.", "sentiment": "none"}], "organizations": [{"name": "officer group", "sentiment": "negative"}, {"name": "burns & mcdonnell announces promotions for board of directors", "sentiment": "negative"}, {"name": "burns & mcdonnell", "sentiment": "negative"}, {"name": "construction/design-build group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY, Mo., Jan. 25, 2018 /PRNewswire/ -- Ray Kowalik, chairman and CEO of Burns & McDonnell, announces promotions of two employee-owners onto the board of directors and six into and within the firm's Officer Group.\n\"Advancing in leadership at Burns & McDonnell comes with great responsibility not only to our 120-year-old firm, but our clients and our communities,\" Kowalik says. \"These employee-owners share two important traits — they are incredibly entrepreneurial and are laser focused on being the very best in providing unmatched service to our clients.\"\nJoining Kowalik and the current four others on the board of directors (Paul Fischer, John Olander, Denny Scott and David Yeamans) are leaders of two major business groups:\nRandy Griffin is president and general manager of the Construction/Design-Build Group (CDB), which provides safety, estimating, procurement, planning, cost control, construction management, quality and startup — to deliver Burns & McDonnell projects from concept through commissioning. He joined Burns & McDonnell in 2001 as procurement manager, and became an associate vice president and manager of construction operations in 2004. He has led CDB since 2016. He earned a bachelor's degree in industrial safety from the University of Central Missouri. Bob Reymond is president and general manager of the Oil, Gas & Chemical Group (OGC), which includes projects for the refining, midstream, chemicals, and terminals and pipelines industries. A former officer in the U.S. Navy's nuclear power program, he joined Burns & McDonnell in 2001 as a project engineer before moving into leading some of the largest energy projects in the firm's history and successfully leading engineer-procure-construct (EPC) projects. He became an associate vice president in 2008 and became leader of the firm's Process & Industrial Group, now OGC, in 2015. He earned a bachelor's degree in mechanical engineering from the University of Missouri.\nJoining the Officer Group are three employee-owners promoted to vice president:\nOko Buckle is general manager of the firm's Southeast region, currently leading Burns & McDonnell offices in Atlanta, Georgia, and Orlando, Florida. He joined the firm in 2006 as a senior electrical engineer in Atlanta, where in 2010 he became regional global practice manager for the firm's Transmission & Distribution Group. He opened the Orlando office in 2015. He earned a bachelor's degree in electrical engineering from Kwame Nkrumah' University of Science and Technology, in Ghana, a master's degree in electrical engineering from Texas A&M University, and an executive MBA in global business from the Georgia Institute of Technology. Renee Gartelos leads the Human Resources team, championing efforts in recruitment and talent acquisition, retention, performance management, compensation, benefits and training for a growing firm consistently rated among the country's best companies to work for. She joined Burns & McDonnell in 1998, taking on increasing responsibilities until becoming director of Human Resources. She earned a bachelor's degree in business administration from the University of Iowa. Joe Podrebarac is construction director in the Construction/Design-Build Group for oil, gas and chemical projects. He joined Burns & McDonnell in 2001 and spent a decade working in the field on projects for major oil and gas producers before returning to the world headquarters to broaden his work on EPC projects. He earned a bachelor's degree in construction management from Kansas State University.\nThree Kansas City-based employee-owners are promoted within the Officer Group:\nRick Halil becomes president, continuing as general manager of the Energy Group he has led since 2014 at the firm ranked No. 1 in Power by Engineering News-Record. He joined Burns & McDonnell in 1989 as an assistant mechanical engineer, designing power plant retrofit projects, before moving on to construction, marketing, project development and division management assignments. He earned a bachelor's degree in mechanical engineering from the University of Florida, and an MBA from the University of Missouri at Kansas City. Joel DeBoer becomes senior vice president, continuing as a leader in engineering, project management, staff development and project support in the Aviation & Federal Group. He joined the firm in 1991 as an electrical engineer, and spent much of the next two decades focused on Department of Defense, aviation and fueling projects in 15 countries, including work in China, Egypt, Greece, Morocco, Oman, Poland, Pakistan and Saudi Arabia. He earned a bachelor's degree in electrical engineering from the University of Nebraska. Matt Ralston becomes senior vice president, continuing to serve as manager of construction operations in the Construction/Design-Build Group. He started at Burns & McDonnell in 1997 as an intern, then joined the firm full-time as an assistant project manager and soon led military and refining projects as a project manager. He returned to the world headquarters in 2007 as the group's assistant manager of field operations, became a principal in 2009 and became an officer and director of procurement in 2013. He earned a bachelor's degree in construction engineering from Iowa State University.\nFor photos and support materials, visit our MEDIA KIT .\nAbout Burns & McDonnell\nBurns & McDonnell is a family of companies made up of more than 6,000 engineers, architects, construction professionals, scientists, consultants and entrepreneurs with offices across the country and throughout the world. We strive to create amazing success for our clients and amazing careers for our employee-owners. Burns & McDonnell is 100 percent employee-owned and is proud to be No. 16 on Fortune's 2017 list of 100 Best Companies to Work For. For more information, visit burnsmcd.com .\nContact: Kristi Widmar, Burns & McDonnell\n816-448-7379 (office); 551-208-5922 (mobile)\nklwidmar@burnsmcd.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/burns--mcdonnell-announces-promotions-for-board-of-directors-officer-group-300588492.html\nSOURCE Burns & McDonnell", "external_links": ["https://www.linkedin.com/in/reneegartelos/", "https://hubs.ly/H09Mz8y0", "http://www.prnewswire.com/news-releases/burns--mcdonnell-announces-promotions-for-board-of-directors-officer-group-300588492.html", "https://www.linkedin.com/in/obuckle/", "https://hubs.ly/H09Mygf0", "https://www.linkedin.com/in/robert-reymond-3992a518/", "https://www.linkedin.com/in/joseph-podrebarac-b43568156/", "https://www.linkedin.com/in/matthew-ralston-9223243a/"], "published": "2018-01-25T23:00:00.000+02:00", "crawled": "2018-01-26T02:24:54.000+02:00", "highlightTitle": ""}