{"organizations": [], "uuid": "4f0cb16c70a1428a7bbee4e58e0e3c0dd79f5050", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-deluxe-nebs-to-change-name-to-deluxe-beginning-jan-2-2018.html", "country": "US", "domain_rank": 767, "title": "Deluxe NEBS to Change Name to Deluxe Beginning Jan. 2, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.049, "site_type": "news", "published": "2018-01-04T01:21:00.000+02:00", "replies_count": 0, "uuid": "4f0cb16c70a1428a7bbee4e58e0e3c0dd79f5050"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-deluxe-nebs-to-change-name-to-deluxe-beginning-jan-2-2018.html", "ord_in_thread": 0, "title": "Deluxe NEBS to Change Name to Deluxe Beginning Jan. 2, 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "minn.", "sentiment": "none"}, {"name": "shoreview", "sentiment": "none"}, {"name": "canada shoreview", "sentiment": "none"}], "organizations": [{"name": "nebs", "sentiment": "negative"}, {"name": "new england business solutions", "sentiment": "none"}, {"name": "deluxe corporation", "sentiment": "none"}, {"name": "deluxe nebs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leading provider of printed products and marketing solutions to continue long tradition of exceptional products and services for customers across Canada\nSHOREVIEW, Minn.--(BUSINESS WIRE)-- Today, Deluxe Corporation announces Deluxe NEBS will officially change its name to Deluxe. For the past several years, Deluxe NEBS has continued to operate as the NEBS brand in Canada, providing exceptional printed products and small business services to its clients across the country.\nDeluxe NEBS has been a staple of Canadian small business marketing services for the past 35 years, leading the industry in innovative cheque and business printing solutions. In 2004, Deluxe Corporation of Shoreview, Minnesota, purchased New England Business Solutions (NEBS) and continued its strong performance as a trusted and valued company specializing in the design, manufacturing and distribution of personalized business products.\nIn the last 15 years, Deluxe NEBS has continued to evolve, helping small businesses start, manage and grow their businesses through a wide range of innovative products and services. Known for its ability to guide customers through branding opportunities with innovative solutions that are effective, memorable and meaningful, Deluxe NEBS is an essential business partner to millions of small business owners.\n“Our customers will continue to enjoy the exceptional customer service and superior products they have come to expect,” said Malcolm McRoberts, Senior Vice President of Small Business Services for Deluxe. “The only change is the name. The Deluxe name is synonymous with exceptional small business products across North America. We look forward to further integrating our suite of small business services into the Canadian market.”\nFounded in 1915, Deluxe Corporation has been a partner and growth engine to small businesses and financial institutions for more than 100 years. In the last 15 years, Deluxe has evolved from one of the nation’s largest providers of cheques and business forms to a small business marketing powerhouse, helping small business owners with websites, logos, social media, email marketing and more. The company’s financial services division is a partner to the U.S.’s largest banks, providing everything from cheque programs to treasury management and data analytics.\nCustomers and vendors of Deluxe NEBS have been informed of the change, which will be phased in over the next few weeks. For more information about Deluxe marketing solutions for small businesses, go to www.deluxe.com .\nAbout Deluxe Corporation\nDeluxe is a growth engine for small businesses and financial institutions. Nearly 4.4 million small business customers access Deluxe’s wide range of products and services, including customized checks and forms, as well as website development and hosting, email marketing, social media, search engine optimization and logo design. For our approximately 5,600 financial institution customers, Deluxe offers industry-leading programs in checks, data analytics and customer acquisition and treasury management solutions including fraud prevention and profitability. Deluxe is also a leading provider of checks and accessories sold directly to consumers. For more information, visit us at www.deluxe.com, www.facebook.com/deluxecorp or www.twitter.com/deluxecorp .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103006281/en/\nDeluxe Corporation\nCameron Potts, 651-233-7735\ncameron.potts@deluxe.com\nSource: Deluxe Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.deluxe.com%2F&esheet=51737595&newsitemid=20180103006281&lan=en-US&anchor=www.deluxe.com&index=1&md5=36753ea7203c25b55c59c08a37c1584e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.twitter.com%2Fdeluxecorp&esheet=51737595&newsitemid=20180103006281&lan=en-US&anchor=www.twitter.com%2Fdeluxecorp&index=4&md5=ce7389970b9f2f33bfdb1804f91a2e16", "http://www.businesswire.com/news/home/20180103006281/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.deluxe.com&esheet=51737595&newsitemid=20180103006281&lan=en-US&anchor=www.deluxe.com%2C&index=2&md5=19db78d63ba9bbec6397ad28677e0ab7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.facebook.com%2Fdeluxecorp&esheet=51737595&newsitemid=20180103006281&lan=en-US&anchor=www.facebook.com%2Fdeluxecorp&index=3&md5=e712811ef6ecc6b82fea5e212dd95c3c"], "published": "2018-01-04T01:21:00.000+02:00", "crawled": "2018-01-04T05:38:20.000+02:00", "highlightTitle": ""}