{"organizations": [], "uuid": "c2a3a391f414558c2d8606beaccbb42f071bc0b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-turkey-gentrification-istanbul/in-an-istanbul-district-a-toxic-transformation-divides-neighbors-idUSKBN1F70K6", "country": "US", "domain_rank": 408, "title": "In an Istanbul district, a 'toxic' transformation divides neighbors", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:23:00.000+02:00", "replies_count": 0, "uuid": "c2a3a391f414558c2d8606beaccbb42f071bc0b3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-turkey-gentrification-istanbul/in-an-istanbul-district-a-toxic-transformation-divides-neighbors-idUSKBN1F70K6", "ord_in_thread": 0, "title": "In an Istanbul district, a 'toxic' transformation divides neighbors", "locations": [], "entities": {"persons": [{"name": "fikirtepe", "sentiment": "none"}, {"name": "kadir topbaş", "sentiment": "none"}], "locations": [{"name": "istanbul", "sentiment": "none"}, {"name": "fikirtepe", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "bosphorus", "sentiment": "none"}], "organizations": [{"name": "istanbul", "sentiment": "negative"}, {"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISTANBUL (Thomson Reuters Foundation) - With the clank and clatter of construction vehicles and clouds of concrete dust, a walk through Istanbul’s Fikirtepe district is a shock to the senses.\nA few kilometers from the Bosphorus shore, Fikirtepe is home to one of the most notorious gentrification projects in Turkey’s biggest city.\nFormerly a working class quarter of shabby apartment buildings and unkempt gardens on twisting, hilly streets, over the past few years the neighborhood’s modest housing has been mostly leveled and replaced by luxury residential high-rises.\nIn 2010, the then-mayor of Istanbul, Kadir Topbaş, announced that a citywide urban transformation effort would begin with Fikirtepe.\nDemolitions began in 2012 and are ongoing. Critics of the project say a zoning plan granted contractors free rein to divvy up the neighborhood plot by plot.\nToday, the skyline is dominated by tall, flashy edifices as dozens of construction companies build towering apartment blocks for wealthy buyers.\nSome Fikirtepe residents feel like they’ve struck gold, as they sell their run-down apartments in return for flats in the brand new blocks. But others are frustrated over stalled negotiations between contractors and residents.\nÇetin Er, who runs a second-hand furniture store and has lived in the neighborhood all of his life, is among those happy with the transformation.\n“I‘m very pleased. Why wouldn’t be I be? Our previous homes weren’t in a liveable condition, and if a fire broke out, fire trucks would not be able to enter our streets,” Er said of the old Fikirtepe.\nEr signed off the rights to one his properties in exchange for a brand new flat in one of the shiny apartment towers that he says is on the verge of completion.\n“It’s as if the people of Fikirtepe have won the lottery,” he said.\nOthers don’t feel so lucky.\nFahrettin Canbas, a shopkeeper and 40-year resident of Fikirtepe, is among those nervously waiting for the spoils he was promised.\nFour years ago, Canbas sold the deed to his small shop and his home in the same building to a contractor, and most of his neighbors have followed suit.\nBut since a minority of property owners on the plot have yet to come to an agreement with the contractor, his building stands ominously surrounded by other new construction projects that are continuing full speed ahead.\nNO ACTION “On the other side of the street the basic structures have been completed, but here, there’s no action,” Canbas said. To make matters worse, a makeshift cement factory chugs along directly across the street, spewing choking dust into the air so Canbas can no longer open the windows in his flat.\n“Look at that counter, I just wiped it off this morning,” he said, gesturing toward a dust-covered section of his shop, where he sells cigarettes, beer and snacks.\nHe insists that although the factory’s presence in a residential area is illegal, and has called municipal authorities repeatedly, and nothing has been done.\nThe Thomson Reuters Foundation contacted several departments of the municipal authority seeking comment about the redevelopment, but none responded.\nIt’s not just Canbas’ street that has been choked with dust.\nIn July, Aykurt Nuhoglu, the mayor of Kadikoy - the district in which Fikirtepe lies - announced that municipal testing of the area indicated that particle pollution levels in Fikirtepe had reached hazardous levels as a result of the heavy construction.\nThe polluted air, combined with the unsettling sight of abandoned buildings, makes walking through the neighborhood an eerie experience.\n“There are projects that have been completed, and there are some areas that have been turned into abandoned war zones. The reason for this is because some of the homeowners aren’t finding the contractor’s offer to be sufficient,” said Nazan Gürkan, the muhtar, or head of neighborhood affairs, of Merdivenköy, a next door quarter of which a part falls into the transformation zone.\nANGUISH Some residents within a given parcel of land want to sell their property while others refuse. This has created a number of tracts where occupied homes remain side-by-side those that have been demolished in part or in whole, giving the area a bombed-out appearance.\nSome of these vacant buildings are being squatted in by homeless Syrian refugees, Gürkan said.\nResidents have also complained of impostor contractors purchasing properties only to sell them to actual contractors at a profit.\n“The urban transformation in the area has resulted in serious anguish. From the beginning I have been opposed to this plan,” Gürkan added.\nSome residents who signed away their property in exchange for a luxury flat plan to cash in and move elsewhere. On the other hand, Çetin Er, the furniture store owner, said he’s not going anywhere and plans to live in his new apartment once it is finished.\n“Since we were born and raised here, we’re not thinking about leaving. Our jobs are here and our kids go to school here,” Er said.\nBut the massive redevelopment of Fikirtepe has changed the neighborhood beyond recognition - and fractured its community.\n“Everyone’s gone. Relationships between neighbors and families alike have been destroyed. Is this transformation?” asked Gürkan.\nReporting by Paul Benjamin Osterlund. Editing by Ros Russell.Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org and thisisplace.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T14:23:00.000+02:00", "crawled": "2018-01-18T12:29:02.019+02:00", "highlightTitle": ""}