{"organizations": [], "uuid": "dd1db7ca6b15ac0dc3c93a6a75b98cd334db847c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-gpb-capital-acquires-matrixonesource-marking-entry-into-business-services-sector.html", "country": "US", "domain_rank": 767, "title": "GPB Capital Acquires MatrixOneSource, Marking Entry into Business Services Sector", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.918, "site_type": "news", "published": "2018-01-19T16:08:00.000+02:00", "replies_count": 0, "uuid": "dd1db7ca6b15ac0dc3c93a6a75b98cd334db847c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-gpb-capital-acquires-matrixonesource-marking-entry-into-business-services-sector.html", "ord_in_thread": 0, "title": "GPB Capital Acquires MatrixOneSource, Marking Entry into Business Services Sector", "locations": [], "entities": {"persons": [{"name": "david gentile", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}], "organizations": [{"name": "gpb capital acquires", "sentiment": "negative"}, {"name": "gpb capital holdings", "sentiment": "negative"}, {"name": "gpb capital", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 19, 2018 /PRNewswire/ -- GPB Capital Holdings, LLC (GPB Capital) has completed the acquisition of a majority ownership stake in MatrixOneSource (\"Matrix\"), a provider of professional employer organization (PEO) services to small and medium-sized businesses located primarily in Florida. The acquisition represents GPB Capital's first foray into the business services sector.\n\"We are excited to enter the business services space with a premier partner in the rapidly growing and exciting PEO industry,\" said David Gentile, Founder and CEO of GPB Capital . \"By providing financial and operational assistance that can help PEOs and other business services companies achieve the next level of growth, we help make it possible for them to serve more small and medium-sized companies. We look forward to working with our operating partners in the PEO industry to make a positive economic impact on a variety of local markets.\"\nJacksonville, Florida-based Matrix ( https://matrixonesource.com/ ) provides payroll administration, safety and risk management, benefits administration, tax compliance, unemployment, 401(K) plan, human resource consulting and other PEO services to over 700 companies. Matrix's internal sales team, comprised of 14 business development managers spread across Florida, has driven strong growth.\nGPB Capital will provide capital as well as strategic and operational assistance to help Matrix expand its presence in the Southeast and other areas of the United States. \"The investment in MatrixOneSource, which closed at the beginning of the year, with its strong and tenured management team and proven record of success, creates a PEO platform in the Southeast into which the firm can integrate \"tuck-in\" acquisitions going forward,\" said Abhaya Shrestha, Managing Director at GPB Capital responsible for the firm's Business Services Strategy.\n\"We became a preferred provider of PEO services thanks to our dedication to unparalleled service and focus on our customers each day,\" said Bill Perez, CEO of MatrixOneSource . \"We are thrilled to enter into this relationship with GPB Capital, who share our commitment to first-class client service and collaboration, and we are eager to work with the firm to enhance our operations and deliver PEO services to a greater number of businesses throughout the Southeast and in additional geographies.\"\nGPB Capital's Business Services Strategy Includes PEO Acquisition Opportunities\nAs part of GPB Capital's Business Services investment strategy, the firm will seek to acquire profitable companies that deliver business-to-business services, including human resources outsourcing, facility services and business process outsourcing.\nThe PEO sector is a segment within human resource services that GPB Capital believes offers attractive investment opportunities. PEO companies specialize in providing human resources management and administrative services to small and medium-sized businesses through a co-employment relationship in which PEOs serve as the co-employers of their clients' employees, while enabling clients to spend more time focusing on their day-to-day and core business operations. While the four largest national PEOs account for approximately 60% of the industry's revenue in 2017, the remainder of the market is controlled by hundreds of smaller regional and local companies. With approximately just 3% of U.S. companies with under 100 employees utilizing PEOs, according to the National Association of Professional Employer Organizations, PEOs have plenty of room for growth.\n\"Many small and medium-sized businesses do not have the resources to support a full-time human resources staff. PEOs serve as a vital partner to these organizations, helping them comply with the everchanging myriad of Federal and State regulatory requirements,\" said Abhaya Shrestha . \"The combination of GPB Capital and MatrixOneSource will create a regional PEO platform which can offer a robust suite of human resources and administrative services to small and medium sized, growth-focused companies at a time when employment regulations continue to evolve and increase in complexity.\"\nAbout GPB Capital Holdings, LLC\nGPB Capital is a New York-based alternative asset management firm focusing on acquiring income producing companies. GPB Capital provides their portfolio companies with the strategic planning, managerial insight, and capital needed to enable strong businesses to achieve the next level of growth and profitability. GPB Capital has over $1.5 billion in assets under management i and has acquired or invested in more than 160 portfolio companies. For more information, please visit www.gpb-cap.com .\nMedia Contact:\nDana Taormina\nJConnelly\n973.850.7305\ndtaormina@jconnelly.com\ni Which is different and distinct from GPB Capital's \"Regulatory AUM.\"\nView original content with multimedia: http://www.prnewswire.com/news-releases/gpb-capital-acquires-matrixonesource-marking-entry-into-business-services-sector-300585126.html\nSOURCE GPB Capital", "external_links": ["https://matrixonesource.com/", "http://www.gpb-cap.com/", "http://www.prnewswire.com/news-releases/gpb-capital-acquires-matrixonesource-marking-entry-into-business-services-sector-300585126.html"], "published": "2018-01-19T16:08:00.000+02:00", "crawled": "2018-01-19T18:20:56.009+02:00", "highlightTitle": ""}