{"organizations": [], "uuid": "e05d3aecebd4432e826acd8b06f96bae787612c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226763959&w=1200&r=LYNXMPEE0U01C", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-global-markets/asia-stocks-slip-as-high-bond-yields-weigh-on-equities-idUKKBN1FK03M", "country": "US", "domain_rank": 408, "title": "Asia stocks slip as high bond yields weigh on equities", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T02:34:00.000+02:00", "replies_count": 0, "uuid": "e05d3aecebd4432e826acd8b06f96bae787612c3"}, "author": "", "url": "https://uk.reuters.com/article/us-global-markets/asia-stocks-slip-as-high-bond-yields-weigh-on-equities-idUKKBN1FK03M", "ord_in_thread": 0, "title": "Asia stocks slip as high bond yields weigh on equities", "locations": [], "entities": {"persons": [{"name": "shinichi saoshiro", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 12:35 AM / Updated 3 hours ago Global stocks gain as Boeing boosts earnings hopes; dollar dips Herbert Lash 3 Min Read \nNEW YORK (Reuters) - World stocks gained, pulling out of a two-day dive on Wednesday, as Boeing’s strong results and outlook revived enthusiasm over corporate profits, while the U.S. dollar was pressured ahead of the Federal Reserve’s first policy decision of the year. \nA controversy-free State of the Union address by President Donald Trump helped most Asian stock exchanges gain and kept a key gauge of global equity performance on track for its best January in more than two decades. \nBoeing Co provided the most upside to both the benchmark S&P 500 stock index and MSCI’s all-country index of stock performance in 47 countries, which has risen about 5.9 percent this month. \nBut a slew of declining drugmakers pulled the U.S. healthcare sector lower and left the benchmark S&P 500 trading close to break-even. \nBoeing, the world’s biggest planemaker, forecast core profit would rise to $13.80 to $14.00 a share this year, well ahead of analysts’ average estimate of $11.96, Thomson Reuters data showed. \nInvestors were relieved when Boeing beat expectations for both earnings and revenue, said Michael Arone, chief investment strategist at State Street Global Advisors in Boston. \n“Earnings trump all the concerns and anxiety about rising interest rates, rising inflation and aggressive monetary policy,” Arone said. \nPaying 18 to 19 times forward 12-month earnings that are growing at a double-digit clip isn’t scary, given low interest rates and pace of inflation, he said, referring to companies on the S&P 500 index. The German share price index, DAX board, is seen at the stock exchange in Frankfurt, Germany, January 31, 2018. REUTERS/Staff/Remote \n“Earnings are growing at a very healthy clip, and that’s the primary driver of stock prices, has put many of those other concerns on the backburner,” Arone said. \nOn Wall Street, the Dow Jones Industrial Average rose 146.08 points, or 0.56 percent, to 26,222.97. The S&P 500 gained 5.96 points, or 0.21 percent, to 2,828.39 and the Nasdaq Composite added 22.34 points, or 0.3 percent, to 7,424.82. \nThe pan-European FTSEurofirst 300 index closed down 0.25 percent, pulled lower by a tumbling healthcare sector, while MSCI’s gauge of stocks across the globe gained 0.04 percent. A man walks past an electronic stock quotation board outside a brokerage in Tokyo, Japan, September 22, 2017. REUTERS/Toru Hanai - RC16074E2450 \nThe U.S. dollar fell ahead of a Fed statement that was widely expected to leave interest rates unchanged but indicate a strengthening economy. \nThe euro rose on firm underlying euro zone inflation data. \nThe dollar index, tracking it against a basket of major currencies, fell 0.15 percent, with the euro up 0.28 percent to $1.2435. The Japanese yen weakened 0.45 percent versus the greenback at 109.27 per dollar. \nOil prices fell for a third day after the U.S. Energy Department said oil inventories rose for the first time in nearly three months and by an amount that exceeded expectations. \nU.S. crude fell 12 cents to $64.38 per barrel and Brent was last at $68.90, down 12 cents on the day. \nBenchmark 10-year notes fell 3/32 in price to yield 2.7368 percent. Editing by Bernadette Baum", "external_links": [], "published": "2018-01-31T02:34:00.000+02:00", "crawled": "2018-01-31T02:55:24.026+02:00", "highlightTitle": ""}