{"organizations": [], "uuid": "f7f8a6f8ac8abdac8de8b7a3d6b1b960a63977b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-angela-ridge-named-vice-president-human-resources-for-cfi.html", "country": "US", "domain_rank": 767, "title": "Angela Ridge Named Vice President, Human Resources for CFI", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:00:00.000+02:00", "replies_count": 0, "uuid": "f7f8a6f8ac8abdac8de8b7a3d6b1b960a63977b2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-angela-ridge-named-vice-president-human-resources-for-cfi.html", "ord_in_thread": 0, "title": "Angela Ridge Named Vice President, Human Resources for CFI", "locations": [], "entities": {"persons": [{"name": "tim staroba", "sentiment": "none"}, {"name": "bert johnson", "sentiment": "none"}, {"name": "angela ridge", "sentiment": "none"}, {"name": "ridge", "sentiment": "none"}], "locations": [{"name": "mo.", "sentiment": "none"}], "organizations": [{"name": "cfi joplin", "sentiment": "negative"}, {"name": "cfi", "sentiment": "negative"}, {"name": "tfi international inc.", "sentiment": "none"}, {"name": "oregon state university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOPLIN, Mo., Jan. 9, 2018 /PRNewswire/ -- CFI, a North American full-truckload carrier and division of TFI International Inc., today announced the appointment of Angela Ridge to the position of Vice President, Human Resources, reporting to CFI President Tim Staroba. Ridge's experience and expertise within the transportation and logistics industry will create immediate value and forward momentum, strengthening CFI. At the same time, we warmly wish Bert Johnson, Vice President, Human Resources, a happy retirement as he transfers leadership over the next few months.\nRidge was most recently the Corporate Education Strategist for Oregon State University, where she was responsible for the university's corporate training programs and staff development initiatives, including the implementation of an institutional-wide learning management system. Prior to this, she was the Director of Operations Support for XPO Logistics/Con-way Multimodal. As Director of Operations Support, Ridge was responsible for leading the development and strategic dissemination of global training models via the companies' internal communication platforms, as well as workforce planning and talent acquisition and retention.\nPrevious to her XPO/Con-way Multimodal experience, Ridge held the position of Senior Organizational Development Manager with Con-way, Inc., where she collaborated with executive leadership to design and implement talent management processes and programs. She worked with Menlo Logistics as National HR Project Manager prior to Con-way, Inc., overseeing the company's Built Organizational Development Systems' program content and West Coast Region HR program that encompassed 24 facilities, 550 full time employees and more than 300 individual contractors.\n\"It is with great pleasure that we welcome Angela to CFI as Vice President of Human Resources,\" said Tim Staroba, President, CFI. \"With more than 15 years of experience as a leader in human resources in the logistics industry, Angela understands how to acquire and retain the very best talent available, leveraging her background in organizational design, management and implementation to attract the people who make CFI the successful business that it is today and what it strives to be in the future.\"\nABOUT TFI INTERNATIONAL\nTFI International Inc. is a North American leader in the transportation and logistics industry, operating across the United States, Canada and Mexico through its subsidiaries. TFI International creates value for shareholders by identifying strategic acquisitions and managing a growing network of wholly owned operating subsidiaries. Under the TFI International umbrella, companies benefit from financial and operational resources to build their businesses and increase their efficiency. TFI International companies service the following segments:\npackage and courier less-than-truckload truckload logistics\nTFI International Inc. is publicly traded on the Toronto Stock Exchange (TSX: TFII) and the OTCQX marketplace in the U.S. (OTCQX: TFIFF). For more information, visit http://www.tfiintl.com .\nABOUT CFI\nCFI is a leading provider of time-definite 53-foot dry-van truckload transportation services in North America. Headquartered in Joplin, Missouri, CFI has a fleet of 2,400 company tractors and 8,000 trailers in addition to an independent contractor fleet. CFI provides solo, team and dedicated trucking operations with consistent quality service. Visit CFI on the web at CFIdrive.com or call (417) 623-5229.\nView original content with multimedia: http://www.prnewswire.com/news-releases/angela-ridge-named-vice-president-human-resources-for-cfi-300579809.html\nSOURCE CFI", "external_links": ["http://www.tfiintl.com/", "http://www.cfidrive.com/", "http://www.prnewswire.com/news-releases/angela-ridge-named-vice-president-human-resources-for-cfi-300579809.html"], "published": "2018-01-09T17:00:00.000+02:00", "crawled": "2018-01-09T19:05:21.009+02:00", "highlightTitle": ""}