{"organizations": [], "uuid": "05d0fc20cc58375066875a7a178929c694e69f92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-close/china-blue-chips-end-at-2-1-2-year-high-as-developers-surge-idUSZZN2R7H00", "country": "US", "domain_rank": 408, "title": "China blue-chips end at 2-1/2-year high as developers surge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T09:17:00.000+02:00", "replies_count": 0, "uuid": "05d0fc20cc58375066875a7a178929c694e69f92"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-close/china-blue-chips-end-at-2-1-2-year-high-as-developers-surge-idUSZZN2R7H00", "ord_in_thread": 0, "title": "China blue-chips end at 2-1/2-year high as developers surge", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "shenzhen", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "msci", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI, Jan 16 (Reuters) - China stocks rallied on Tuesday, with the blue-chip index closing at a 30-month high, led by a surge in real estate firms, even as a poll backed expectations that growth in the Asian economic powerhouse will slow in 2018.\n** China’s economy is expected to cool this year as a government-led crackdown on debt risks and factory pollution drag on overall activity, a Reuters poll showed on Tuesday. ** At the close, the Shanghai Composite index was up 27.00 points or 0.79 percent at 3,437.48. ** The blue-chip CSI300 index was up 0.81 percent, with its financial sector sub-index higher by 1.63 percent, the consumer staples sector down 0.12 percent , the real estate index up 7.45 percent and healthcare sub-index up 1.25 percent. ** The smaller Shenzhen index ended up 0.72 percent and the start-up board ChiNext Composite index was weaker by 0.17 percent. ** Around the region, MSCI’s Asia ex-Japan stock index was firmer by 0.48 percent while Japan’s Nikkei index closed up 1.0 percent. ** At 07:02 GMT, the yuan was Quote: d at 6.4331 per U.S. dollar, 0.05 percent firmer than the previous close of 6.4363. ** The largest percentage gainers in the main Shanghai Composite index were Beijing Airport High-Tech Park Co Ltd up 10.02 percent, followed by Fujian Longxi Bearing Group Co Ltd gaining 10.01 percent and Shanghai U9 Game Co Ltd up by 10.01 percent. ** The largest percentage losses in the Shanghai index were Shangying Global Co Ltd down 9.99 percent, then Hang Xiao Steel Structure Co Ltd down 7.26 percent and Wenyi Suntech Co Ltd off by 5.73 percent. ** So far this year, the Shanghai stock index is up 3.12 percent, the CSI300 is up 5.7 percent, while China’s H-share index listed in Hong Kong is up 6.5 percent. ** About 21.15 billion shares were traded on the Shanghai exchange, roughly 130.7 percent of the market’s 30-day moving average of 16.18 billion shares a day. The volume in the previous trading session was 23.20 billion. ** As of 07:03 GMT, China’s A-shares were trading at a premium of 28.68 percent over the Hong Kong-listed H-shares. ** The Shanghai stock index is above its 50-day and 200-day moving averages. ** The price-to-earnings ratio of the Shanghai index was 15.48 as of the last full trading day while the dividend yield was 1.9 percent. ** So far this week, the market capitalisation of the Shanghai stock index has fallen by -0.32 percent to 30.01 trillion yuan. (Reporting by Shanghai Newsroom; Editing by Shri Navaratnam)\n ", "external_links": [], "published": "2018-01-16T09:17:00.000+02:00", "crawled": "2018-01-16T09:51:19.001+02:00", "highlightTitle": ""}