{"organizations": [], "uuid": "5df059a465df6b438b42d69896aa1ecad05f73ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221470664&w=1200&r=LYNXMPEE0B134", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-czech-election-president/eastward-looking-zeman-is-favorite-as-czechs-vote-for-president-idUSKBN1F11T4", "country": "US", "domain_rank": 408, "title": "Eastward-looking Zeman is favorite as Czechs vote for president", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T16:49:00.000+02:00", "replies_count": 0, "uuid": "5df059a465df6b438b42d69896aa1ecad05f73ac"}, "author": "", "url": "https://www.reuters.com/article/us-czech-election-president/eastward-looking-zeman-is-favorite-as-czechs-vote-for-president-idUSKBN1F11T4", "ord_in_thread": 0, "title": "Eastward-looking Zeman is favorite as Czechs vote for president", "locations": [], "entities": {"persons": [{"name": "zeman", "sentiment": "negative"}, {"name": "robert muller", "sentiment": "none"}, {"name": "milos zeman", "sentiment": "none"}, {"name": "jason hovet", "sentiment": "none"}], "locations": [{"name": "hungary", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "min read  prague", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRAGUE (Reuters) - Czechs started voting on Friday in the first round of a presidential election in which eight candidates are seeking to defeat incumbent Milos Zeman, whose brash style and leanings toward eastern powers have sharply divided opinion.\nThe vote, likely to end in a run-off in two weeks, is seen as a referendum on 73-year-old Zeman, in office since 2013, who has harshly criticized migration from Muslim countries and is keen to boost ties with Russia and China.\nCzech presidents have limited executive powers but previous incumbents have had a strong influence on public opinion. They also appoint central bankers and judges and are pivotal in forming governments -- a process the European Union and NATO member country is now going through.\nA loss for Zeman to any of his main challengers could mean Czech public opinion may shift closer to the EU mainstream, in contrast to ex-communist neighbors such as Poland and Hungary whose governments have clashed with Brussels.\nA former center-left prime minister, Zeman has warm relations with Russian President Vladimir Putin and has called for the removal of EU sanctions imposed over Russia’s annexation of Ukraine’s Crimea.\nHe has also sought more trade with China and was the only western leader to attend a military parade in Beijing in 2015. But he has been criticized for ignoring Chinese human rights issues that Czech foreign policy had previously focused on.\nZeman leads polls and should pick up a strong vote outside Prague and other cities on Friday and Saturday, but is expected to fall short of winning over 50 percent of the vote and may face a strong challenger in a run-off set for Jan. 26-27.\nFirst-round voting started at 2:00 p.m. (1300 GMT) on Friday and ends Saturday at the same time.\nZeman is a supporter of U.S. President Donald Trump and similarly boosts his appeal with sniping at the press and what he calls intellectual elites. He regularly holds voter meetings with crowds of people in smaller towns.\nCzech President Milos Zeman arrives to cast a vote during the country's direct presidential election as a Femen activist is escorted by Zeman's bodyguards at a polling station in Prague, the Czech Republic January 12, 2018. REUTERS/David W Cerny “I like that he speaks to voters,” said Irena Matuskova, a Prague nurse who plans to vote for Zeman.\nSECOND ROUND FOE Zeman’s most serious challenger is Jiri Drahos, 68, a chemical engineer and former head of the Czech Academy of Sciences who has campaigned on anchoring the Czech Republic’s place in Europe.\nSongwriter and businessman Michal Horacek, 65, could also vie for a spot in the run-off while support has risen for former center-right Prime Minister Mirek Topolanek and diplomat Pavel Fischer.\nThe outcome may influence Czech Prime Minister Andrej Babis’s chances of finally forming a cabinet as his first attempt to rule in a minority administration is likely to be rejected by parliament next week.\nZeman has backed Babis even as the billionaire businessman has struggled to get support from other political parties while he battles police allegations he illegally obtained EU subsidies a decade ago. Babis denies wrongdoing.\nBabis said on Thursday he would vote for Zeman.\nZeman and Babis are among the most popular politicians in the country of 10.6 million that is largely eurosceptic and rejects accepting migrants from the Middle East and Africa.\nAmong the leading candidates, Zeman has been the most outspoken on migration, linking Muslim immigration to security threats.\n“What I would be afraid of is infiltration by jihadists, and thus a higher number of terrorist attacks in European countries or cities,” he said on Thursday night in his weekly interview show, Week with the President, on TV Barrandov.\nReporting by Jason Hovet and Robert Muller; Additonal reporting by Petra Vodstrcilova and Jan Lopatka; Editing by Catherine Evans\n ", "external_links": [], "published": "2018-01-12T16:49:00.000+02:00", "crawled": "2018-01-12T17:03:07.015+02:00", "highlightTitle": ""}