{"organizations": [], "uuid": "c267721b4737e14831370c01d5906974f9a65c34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224779028&w=1200&r=LYNXMPEE0N0YD", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-britain-pensions-breakingviews/breakingviews-uk-pension-watchdog-needs-new-tools-and-backbone-idUSKBN1FD1DP", "country": "US", "domain_rank": 408, "title": "UK pension watchdog needs new tools, and backbone", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T19:19:00.000+02:00", "replies_count": 0, "uuid": "c267721b4737e14831370c01d5906974f9a65c34"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-pensions-breakingviews/breakingviews-uk-pension-watchdog-needs-new-tools-and-backbone-idUSKBN1FD1DP", "ord_in_thread": 0, "title": "UK pension watchdog needs new tools, and backbone", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "frank field", "sentiment": "none"}, {"name": "philip green", "sentiment": "none"}], "locations": [{"name": "london uk", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON UK Prime Minister Theresa May vowed to punish groups that fail to protect retirement benefits, like collapsed outsourcer Carillion. New tools could include fining companies or curbing payouts. But the regulator can do more with the powers it already has to make companies fill gaps.\nMay promised in a newspaper article published on Sunday to clamp down on bosses who “line their own pockets” while not protecting workers’ retirement schemes. The move comes after Carillion employees were forced to take a cut in pensions after its failure left a 900 million pound deficit, despite uninterrupted dividend payouts and a generous executive bonus policy, and a similar scandal with BHS in 2016.\nSo far, May is light on details. She could be thinking of giving the Pensions Regulator greater power to fine companies with large deficits, or to block takeovers when either party has an unfilled hole, as Frank Field, a member of parliament who chairs its Work and Pensions Select Committee, suggested in 2016. That might have prevented, for example, the sale of BHS by former owner Philip Green.\nThe snag is that new powers could take years. May is still only promising a preliminary discussion paper on possible new remedies. Getting new laws approved in parliament could take until 2020, given the current full slate of business. More Carillion or BHS-style crises could happen in the meantime.\nTo tackle the issue in the near term, the regulator needs to get tough. It already has powers to review company pension schemes every three years and demand companies address shortfalls. Yet companies can have as long as 10 years to fill the gap. Carillion, for example, paid out roughly twice as much in dividends as it did in pension recovery payments over the last two years.\nA tougher line might mean lower payouts for shareholders and bonuses for company executives. But the loss would be offset by falling liabilities, or future surpluses. And the hit may be manageable. Britain’s biggest 350 companies have about 85 billion pounds in unfunded pension commitments, according to consultants Hymans Robertson. That’s more than eclipsed by the record 94 billion pounds in dividends that Capita Asset Services reckons they are expected to pay out in 2017 alone.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-24T19:19:00.000+02:00", "crawled": "2018-01-24T21:26:55.019+02:00", "highlightTitle": ""}