{"organizations": [], "uuid": "aa8ce062f3d18e29bba8660e28f2b64efe237bfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/04/104877564-GettyImages-876788598.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/meet-the-billionaire-businessman-obsessed-with-impeaching-trump.html", "country": "US", "domain_rank": 767, "title": "Meet the billionaire businessman obsessed with impeaching Trump", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-11T21:52:00.000+02:00", "replies_count": 0, "uuid": "aa8ce062f3d18e29bba8660e28f2b64efe237bfb"}, "author": "Catherine Clifford", "url": "https://www.cnbc.com/2018/01/11/meet-the-billionaire-businessman-obsessed-with-impeaching-trump.html", "ord_in_thread": 0, "title": "Meet the billionaire businessman obsessed with impeaching Trump", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "tom steyer", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steyer", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "la", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "times square", "sentiment": "none"}], "organizations": [{"name": "trump white house", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "forbes", "sentiment": "none"}, {"name": "yale", "sentiment": "none"}, {"name": "stanford school of business", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Trump 's approval rating has been hovering around 40 percent for months . There are a whole lot of people who would be very happy to see the controversial leader removed from the White House, but few are making any real progress in unseating Trump.\nTom Steyer is a notable exception.\nThe Californian has recently pledged $30 million to flip the House of Representatives from Republican to Democrat in the 2018 Congressional midterm elections. He's also delivering copies of Michael Wolff's behind-the-scenes look at the Trump White House, \"Fire and Fury,\" to every member of Congress.\nFire and Fury is required reading for every member of Congress to help them understand their duty to the American people. That's why we're delivering a copy to each and every one of them.\n535 hand deliveries takes time! Should we bring you one in DC or LA?\nBut who is Steyer? And how did he make all his money?\nSteyer, 60, is currently worth $1.6 billion , according to Forbes. He graduated from Yale with his a bachelor's degree in 1979 and Stanford School of Business in 1983, according to his LinkedIn page . He launched the asset management firm, Farallon Capital Management, in 1986 and grew the company for the following 26 years.\nFarallon Capital Management manages equities for college endowments, charitable foundations, pension plans and wealthy individuals. According to the global company's website , it currently has 180 employees.\nIn 2010, Steyer signed The Giving Pledge, an initiative co-founded by billionaire buddies Warren Buffett and Bill Gates whereby billionaires publicly pledge to give away more than half of their wealth.\n\"Almost by accident — we've focused on good investing not making money — we currently have more assets than we could reasonably spend in our lifetime. Our original impetus for saving money revolved around wanting our kids to enjoy the same educational opportunities that we had, so that they could succeed on their own terms, assuming that they worked hard,\" Steyer and his wife, Kat Taylor, wrote when they took the pledge .\n\"We want to leave our kids a different kind of inheritance, an example of at least trying to lead a worthy life,\" the couple wrote.\nIn 2012, Steyer left Farallon, and the following year launched NextGen Climate, a non-profit and political action committee focused on environmental issues. In 2017, Steyer expanded his ballot of core issues to include immigrant rights, affordable health care and equality and rebranded the organization as NextGen America.\nSteyer is also co-founder, with Taylor, of the Beneficial State Bank in Oakland . Taylor is the CEO of the community bank, which the duo launched in 2007 and which aims to serve those individuals and small business owners who are otherwise unable to get access to loans. The community bank, however, does not add to Steyer's cash pile — the Beneficial State Bank reinvests all profits back into the community .\nCurrently, the former financier is largely focusing his efforts on impeaching President Trump. So far more than 4 million people have signed a digital record calling for Trump to be impeached through NeedToImpeach.com , which Steyer launched to support his efforts.\nTrump threatens our Constitution, our freedoms, and our lives. It's time to begin impeachment proceedings.\n\"A year ago, people around the country wondered what a Donald Trump presidency would look like. It's now 2018, and we have our answer. Our mission is clear — we have to take back the House,\" says the homepage for Steyer's personal website . \"Our movement is going to take action to stand up to this president in 2018, and demand our representatives stand with us. With the people on our side, we're going to send a progressive wave across the country.\"\nSteyer is aggressive in his attacks on Trump.\nI'm not sure Mr. Trump would recognize the Truth if it came up and bit him in the rear end.\nThis is the nightmare scenario -- a totally unhinged President with his finger on the nuclear button. Trump is mentally and emotionally unfit for office, and it's time for Congress to begin impeachment proceedings. What are we waiting for?\nNextGen America is aiming to bring out half a million young voters in 2018 for the Congressional midterm elections, Governor's races and state legislatures. Steyer is putting $30 million behind the organization's efforts in key states, including New Hampshire, Pennsylvania, Virginia, Florida, Michigan, Wisconsin, Iowa, Arizona, Nevada and California.\nI believe 2018 will be a battle for the soul of America, and our mission is clear: we have to take back the House.\n\"We are really focused on removing this president,\" Steyer told the New York Times . \"I am willing to do whatever it takes to help save our country. I feel the most important task for me is organizing.\"\nSee also:\nWarren Buffett on the US economy: 'The tsunami of wealth didn't trickle down. It surged upward'\nRichard Branson: Trump administration's marijuana move 'a throwback to the worst days of the failed War on Drugs'\nEx-Apple exec: Thanks to Apple, Google, Facebook, Twitter, we're addicted to tech — and 'they are the only ones' who can fix it\nshow chapters Billionaire Warren Buffett says 'the real problem' with the US economy is people like him 1:52 PM ET Tue, 27 June 2017 | 00:45 Like this story? Like CNBC Make It on Facebook .", "external_links": [], "published": "2018-01-11T21:52:00.000+02:00", "crawled": "2018-01-11T22:05:08.012+02:00", "highlightTitle": ""}