{"organizations": [], "uuid": "d47a7d24bda8e57d41865a7a59eaa79fdc6fa759", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-avana-capital-arranges-17-point-2-m-loan-for-skilled-nursing-and-assisted-living-facility-in-wichita-ks.html", "country": "US", "domain_rank": 767, "title": "AVANA Capital Arranges $17.2 M Loan for Skilled Nursing and Assisted Living Facility in Wichita, KS", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.985, "site_type": "news", "published": "2018-01-17T22:00:00.000+02:00", "replies_count": 0, "uuid": "d47a7d24bda8e57d41865a7a59eaa79fdc6fa759"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-avana-capital-arranges-17-point-2-m-loan-for-skilled-nursing-and-assisted-living-facility-in-wichita-ks.html", "ord_in_thread": 0, "title": "AVANA Capital Arranges $17.2 M Loan for Skilled Nursing and Assisted Living Facility in Wichita, KS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GLENDALE, Ariz., Jan. 17, 2018 /PRNewswire/ -- AVANA Capital has provided $17.2 million through a conventional bridge loan to Mainstreet Property Group LLC, a private real estate development company specializing in healthcare. The loan was used to acquire the Healthcare Resort of Wichita, a 94-bed facility located 12 miles from downtown Wichita, Kansas.\nConstruction of the Healthcare Resort of Wichita was completed in 2016; the resort has 70 skilled nursing and 24 assisted living beds. Because the facility did not yet have its operating license, a process that was in progress, and there was a tight closing timeline, Mainstreet needed a lender able to navigate the complexity of the deal and still close quickly.\nIn looking for alternative and responsive financing sources, Mainstreet discovered AVANA Capital and closed on the acquisition within 35 days. Furthermore, AVANA was able to mitigate the lack of an operating license and allow the borrower the additional time (six (6) months) to secure the license.\n\"Financing this property presented certain challenges,\" explained Zeke Turner, founder and CEO of Mainstreet. \"Fortunately, we found AVANA Capital. They overcame every hurdle and moved quickly to do the loan over the Thanksgiving weekend. Every interaction with the AVANA team has been positive, and we look forward to continuing to grow the relationship.\"\nMainstreet has developed more than 50 assisted living and senior care facilities under the guidance of Turner, who won the Ernst & Young Entrepreneur of the Year award in 2015.\n\"We have a goal to transform the way healthcare is delivered nationwide. The Healthcare Resort of Wichita is designed to give aging Americans what they want – more services, more amenities and more attention,\" Turner said.\nThe facility offers private skilled nursing rooms and assisted living units, a large therapy area where extensive rehabilitation services will be offered, and spacious common areas for socializing.\nMatt Hunt, Chief Credit Officer at AVANA Capital said, \"We are delighted that we were able to provide financing for Mainstreet on this facility in such a short amount of time.\"\n\"Mainstreet's extensive experience in developing and operating high-quality, post-acute healthcare properties allowed us to feel confident in backing the Healthcare Resort of Wichita,\" explained Hunt.\nThe Healthcare Resort of Wichita will employ at least 90 people on a permanent basis. \"One of our corporate missions is to create jobs and fulfill entrepreneurial dreams. We found in Mainstreet a partner that shares not only our way of thinking but, more importantly, our values,\" said Sanat Patel, Chief Sales Officer at AVANA Capital.\nAbout AVANA Capital:\nWith roots dating back to 2002, and more than $1 billion in loans nationwide, AVANA Capital is a commercial real estate debt fund that offers private commercial real estate loans nationwide by sourcing funds from an array of accredited global investors. We leverage our expertise by lending in niche industries such as hospitality, solar and assisted living facilities and are committed to protecting our investors' capital by subjecting our investments to a meticulous review process. For our borrowers, once we commit our funds to a project we guarantee certainty of execution in closing and funding. Above all, we believe in strong values imbedded in the way we conduct our business as a team, through our employees and management. For more information visit www.avanacapital.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/avana-capital-arranges-172-m-loan-for-skilled-nursing-and-assisted-living-facility-in-wichita-ks-300583968.html\nSOURCE AVANA Capital", "external_links": ["http://www.avanacapital.com/", "http://www.prnewswire.com/news-releases/avana-capital-arranges-172-m-loan-for-skilled-nursing-and-assisted-living-facility-in-wichita-ks-300583968.html"], "published": "2018-01-17T22:00:00.000+02:00", "crawled": "2018-01-18T00:05:39.000+02:00", "highlightTitle": ""}