{"organizations": [], "uuid": "527904832e3f8021bae99a66afe7e2cefe9ad813", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221513965&w=1200&r=LYNXMPEE0B1D6", "site_section": "http://feeds.reuters.com/reuters/peopleNews\r", "section_title": "Reuters: People News", "url": "https://www.reuters.com/article/us-people-edgarraykillen/mississippi-burning-kkk-leader-edgar-ray-killen-dies-in-prison-idUSKBN1F12A9", "country": "US", "domain_rank": 408, "title": "Edgar Ray Killen, convicted in 'Mississippi Burning' killings, dead at 92", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T20:48:00.000+02:00", "replies_count": 0, "uuid": "527904832e3f8021bae99a66afe7e2cefe9ad813"}, "author": "", "url": "https://www.reuters.com/article/us-people-edgarraykillen/mississippi-burning-kkk-leader-edgar-ray-killen-dies-in-prison-idUSKBN1F12A9", "ord_in_thread": 0, "title": "Edgar Ray Killen, convicted in 'Mississippi Burning' killings, dead at 92", "locations": [], "entities": {"persons": [{"name": "edgar ray killen", "sentiment": "negative"}, {"name": "killen", "sentiment": "none"}, {"name": "bill trott", "sentiment": "none"}, {"name": "ku klux klansman", "sentiment": "none"}, {"name": "james cha", "sentiment": "none"}], "locations": [{"name": "mississippi", "sentiment": "none"}, {"name": "mississippi state penitentiary", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "none"}, {"name": "state department of corrections", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 6:01 PM / Updated 10 minutes ago Edgar Ray Killen, convicted in 'Mississippi Burning' killings, dead at 92 Bill Trott 6 Min Read \n(Reuters) - Edgar Ray Killen, the preacher and Ku Klux Klansman convicted and sent to prison more than 40 years after he plotted the 1964 slayings of three civil rights activists in the “Mississippi Burning” case, died on Thursday night at the age of 92, Mississippi correction officials said. \nKillen, who would have turned 93 on Jan. 17, was pronounced dead at the hospital at Mississippi State Penitentiary, according to a statement on the state Department of Corrections website on Friday. \nThe cause and manner of death were pending an autopsy, the statement said. No foul play was suspected. \nKillen, whose 2005 manslaughter conviction came on the 41st anniversary of the crime, was serving a 60-year prison sentence - the maximum 20 years for each victim. In a 2015 interview with the Associated Press, Killen refused to discuss his case but said he was still a segregationist, although he had no ill will for blacks. \nThe slayings of James Chaney, Andrew Goodman and Michael Schwerner in Philadelphia, Mississippi, on June 21, 1964, at the hands of the Klan, local law enforcement officers and others was one of the most shocking and galvanizing moments of the U.S. civil rights movement. \nHistorians say the outcry over the incident, which was portrayed in the 1988 Oscar-winning film “Mississippi Burning,” helped win support for subsequent civil rights legislation, including the Civil Rights Act of 1964 and the Voting Rights Act of 1965. \nChaney was a 21-year-old black man from Meridian, Mississippi, while Schwerner, 24, and Goodman, 20, were white New Yorkers. They were part of a campaign to register black voters in the South during the “Freedom Summer” and caught the attention of law enforcement authorities and Klansmen when they came to Philadelphia. \nThe three men had been taken into custody on a speeding charge and while they were detained, Killen assembled the mob that later would chase them down and kill them, prosecutors said at his 2005 trial. Killen, who operated a sawmill and was known by the nickname Preacher because he presided part time at a Baptist church, told the mob to buy gloves and how to dispose of the bodies but was not accused of being at the murder scene, the prosecution said. NO STATE CHARGES \nChaney, Schwerner and Goodman were shot on a rural road near Killen’s home and then buried 15 feet deep in an earthen dam. Their disappearance became a national news story and federal agents were sent to search for them. Thanks to an informant, the bodies were discovered 44 days after the killings. \nThe state of Mississippi declined to pursue murder charges in the case but in 1967, 18 men, including Killen, local Klan leader Sam Bowers and the county sheriff, were tried on federal charges of violating the victims’ civil rights. \nAn all-white jury convicted seven of the men, including Bowers and a sheriff’s deputy, and they were given sentences ranging from three to 10 years. The jury was unable to agree on a verdict for Killen with the hold-out juror saying she could never convict a preacher. The others were acquitted. \n“Those boys were Communists who went to a Communist training school,” Killen said of the victims in a 1998 interview with the New York Times. “I‘m sorry they got themselves killed. But I can’t show remorse for something I didn’t do.” \nKillen went quietly about his life after the verdict. But reporter Jerry Mitchell of the Jackson, Mississippi, Clarion-Ledger revived interest in the case in 1998 with stories about taped interviews at the Mississippi Department of Archives and History in which Bowers said he was “quite delighted to be convicted and have the main instigator of the entire affair walk out of the courtroom a free man.” \nMitchell’s reporting also eventually led to the convictions for Bowers in the murder of another 1960’s activist, as well as Byron De La Beckwith in the 1963 assassination of NAACP leader Medgar Evers, and Bobby Cherry, who killed four girls by bombing a Birmingham, Alabama, church in 1963 - all decades after the crimes were committed. \nForty years after the “Mississippi Burning” killings and at age 80, Killen became the first and only person to be tried for murder in the case. His attorneys conceded Killen was a member of the Klan and the trial featured testimony that he had lauded the KKK as a benevolent Christian group that would keep schools segregated. Prosecutors said he encouraged members of his congregation to join the Klan. \nKillen did not testify at the trial, which was attended by Schwerner’s widow and the mothers of Chaney and Goodman, and sat impassively in a wheelchair, breathing from an oxygen tank as the verdict was announced. \nMuch of the testimony had come from transcripts of the 1967 federal trial. With key witnesses dead and memories faded, the jurors, including three black members, said they convicted Killen of the lesser charge of manslaughter because the state’s case was not strong enough to prove murder. \nIn June 2016, the state of Mississippi finally officially closed the case. Writing and reporting by Bill Trott; Additional reporting by Barbara Goldberg in New York; Editing by Paul Simao, Chris Reese and Diane Craft", "external_links": [], "published": "2018-01-12T20:48:00.000+02:00", "crawled": "2018-01-12T21:05:02.001+02:00", "highlightTitle": ""}