{"organizations": [], "uuid": "edd6a4bd2155d4ba6eba1dc8aa44087957a48c40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-progress-towards-settling-corruption-cases-boosts-saudi-idUSL8N1P90B7", "country": "US", "domain_rank": 408, "title": "MIDEAST STOCKS-Progress towards settling corruption cases boosts Saudi", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T16:19:00.000+02:00", "replies_count": 0, "uuid": "edd6a4bd2155d4ba6eba1dc8aa44087957a48c40"}, "author": "", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-progress-towards-settling-corruption-cases-boosts-saudi-idUSL8N1P90B7", "ord_in_thread": 0, "title": "MIDEAST STOCKS-Progress towards settling corruption cases boosts Saudi", "locations": [], "entities": {"persons": [{"name": "andrew torchia", "sentiment": "none"}, {"name": "alwaleed", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "oman", "sentiment": "none"}], "organizations": [{"name": "qatar national bank", "sentiment": "none"}, {"name": "renaissance services", "sentiment": "none"}, {"name": "saudi reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "binladin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 2:20 PM / Updated 28 minutes ago MIDEAST STOCKS-Progress towards settling corruption cases boosts Saudi Reuters Staff \n* Saudi bank investors welcome possible Binladin settlement \n* Kingdom Holding jumps on news Prince Alwaleed negotiating \n* Advanced Petrochemical falls after estimating 2017 profit drop \n* Qatar National Bank climbs before earnings announcement \n* Oman’s Renaissance Services slides on widening loss \nBy Andrew Torchia \nDUBAI, Jan 14 (Reuters) - Signs of progress towards settling cases in Saudi Arabia’s crackdown on corruption boosted its stock market on Sunday, while Qatar’s bourse rose for a seventh straight day as investors bought ahead of annual dividend announcements. \nThe Saudi index far outperformed the rest of the region as it rose 1.4 percent to 7,440 points in active trade, rising above last September’s peak of 7,429 points. \nDozens of Saudi princes, officials and top businessmen - including owners of major stakes in some firms - were detained as part of the crackdown in early November. The market’s initial panic has faded, but investors are still concerned about the fate of some of the companies involved. \nOn Saturday, family-owned construction giant Saudi Binladin Group, which has seen its chairman and several other members of the Bin Laden family detained, said some of its shareholders might transfer part of their holdings to the state in a settlement with authorities. \nThe announcement, which confirmed an earlier Reuters report, boosted banking shares on Sunday with all 12 listed banks rising. Saudi British Bank jumped 4.6 percent. \nA Saudi banker said the Binladin news appeared positive for the sector in the short term because state ownership might help the recovery of financially troubled Binladin, ensuring that payments to its bank creditors continued. \nHowever, the banker added that it remained unclear whether banks would benefit in the long term, as restructuring Binladin could also involve a restructuring of its debt or more pressure on banks to make provisions or write off some debt. \nMeanwhile, shares in Kingdom Holding jumped 7.0 percent in heavy trade to 9.31 riyals, their highest close since Nov. 5, when the detention of its chairman and owner Prince Alwaleed bin Talal was announced. \nA senior Saudi official told Reuters that Prince Alwaleed was negotiating a possible settlement with authorities, although he had so far not agreed on terms; “he offered a certain figure but it doesn’t meet the figure required from him, and until today the attorney-general hasn’t approved it.” \nShares in Advanced Petrochemical, the first Saudi petrochemical producer to estimate whole-year 2017 earnings, dropped 2.4 percent after saying that estimated annual net profit fell to 631.1 million riyals ($168.3 million) from 731.9 million riyals because of higher feedstock prices. \nElsewhere, Qatar’s index added 0.4 percent in heavy trade as a broad-based rally continued, with Qatar National Bank , the top lender, gaining 1.1 percent ahead of its fourth-quarter earnings announcement on Tuesday. \nDubai rose 0.5 percent as real estate blue chip Emaar Properties rose 1.7 percent. But Abu Dhabi edged down 0.1 percent, despite a 2.6 percent gain by Waha Capital in active trade. \nIn Oman, ship repair and offshore services firm Renaissance Services sank 7.1 percent after saying its net losses increased last year as revenues slipped. HIGHLIGHTS \n* The index rose 1.4 percent to 7,440 points. DUBAI \n* The index rose 0.5 percent to 3,513 points. ABU DHABI \n* The index edged down 0.1 percent to 4,585 points. QATAR \n* The index gained 0.4 percent to 9,175 points. EGYPT \n* The index edged up 0.1 percent to 15,255 points. KUWAIT \n* The index rose 0.7 percent to 6,607 points. BAHRAIN \n* The index added 0.2 percent to 1,319 points. OMAN \n* The index edged up 0.04 percent to 5,089 points. (Additional reporting by Tom Arnold, editing by Louise Heavens)", "external_links": [], "published": "2018-01-14T16:19:00.000+02:00", "crawled": "2018-01-14T16:53:02.004+02:00", "highlightTitle": ""}