{"organizations": [], "uuid": "84b295b3ca00627e4beedda021b4371cea74657a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223002389&w=1200&r=LYNXMPEE0H0TD", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-eu-gmo-court/new-crop-breeding-method-is-exempt-from-gmo-rules-eu-court-adviser-idUKKBN1F71C3", "country": "US", "domain_rank": 408, "title": "New crop breeding method is exempt from GMO rules - EU court adviser", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T13:12:00.000+02:00", "replies_count": 0, "uuid": "84b295b3ca00627e4beedda021b4371cea74657a"}, "author": "", "url": "https://uk.reuters.com/article/uk-eu-gmo-court/new-crop-breeding-method-is-exempt-from-gmo-rules-eu-court-adviser-idUKKBN1F71C3", "ord_in_thread": 0, "title": "New crop breeding method is exempt from GMO rules - EU court adviser", "locations": [], "entities": {"persons": [{"name": "michal bobek", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ecj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 14 AM / Updated 8 minutes ago New crop breeding method is exempt from GMO rules - EU court adviser   \nBRUSSELS (Reuters) - Crops obtained by the plant breeding technique of mutagenesis do not fall under laws restricting the use of genetically modified organisms (GMOs) but individual EU states can regulate their use, an adviser to Europe’s top court said on Thursday. \nMutagenesis, which generates a genetic mutation that can occur naturally or be induced, has been around for decades but advances in the technique have ignited a row over whether it should face the same EU rules as GMOs, which are often subject to a long process of scrutiny to win approval. \nCritics say such gene-editing has not been proven safe for public health or the environment. European and other seed makers say the process does not involve the transfer of genes between species as in GMOs and is a valuable tool to boost yields. \nMichal Bobek, whose advice as advocate general is not binding but usually followed by European Court of Justice (ECJ) judges, said European Union rules on GMOs exempted mutagenesis and did not differentiate between old and new techniques. \n“The advocate general does not see any grounds deriving from the general duty to update legislation ... which could affect the validity of the mutagenesis exemption,” Bobek said in a statement, adding EU states, such as France, could draw up their own rules provided they conformed with EU law. \nA group of French agricultural associations had appealed to the ECJ, saying plant varieties obtained via mutagenesis should not be exempt from GMO rules under French law. \nThe ECJ will rule on the issue in coming months. \nGenetically modified (GM) crops are subject to scientific scrutiny and their approval often held up because the European Union’s 28 members fail to agree, even though they can individually opt out of any approval. \nThe EU allows the import of more than 50 GM crops and, while approval covers human consumption, they are exclusively used as animal feed. Only one GM crop, a variety of maize, is grown in Europe. Reporting by Alissa de Carbonnel and Robert-Jan Bartunek; Additional reporting by Gus Trompiz in Paris; Editing by Philip Blenkinsop and Edmund Blair", "external_links": [], "published": "2018-01-18T13:12:00.000+02:00", "crawled": "2018-01-18T13:23:37.005+02:00", "highlightTitle": ""}