{"organizations": [], "uuid": "5b29fdf666dc2e12cdb68bc7271cabd09ff9f027", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-u-s-fda-approves-lynparzaa-olaparib-in-germline-brca-mutated-metastatic-breast-cancer.html", "country": "US", "domain_rank": 767, "title": "U.S. FDA Approves LYNPARZA® (olaparib) in Germline BRCA-Mutated Metastatic Breast Cancer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.98, "site_type": "news", "published": "2018-01-12T20:45:00.000+02:00", "replies_count": 0, "uuid": "5b29fdf666dc2e12cdb68bc7271cabd09ff9f027"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-u-s-fda-approves-lynparzaa-olaparib-in-germline-brca-mutated-metastatic-breast-cancer.html", "ord_in_thread": 0, "title": "U.S. FDA Approves LYNPARZA® (olaparib) in Germline BRCA-Mutated Metastatic Breast Cancer", "locations": [], "entities": {"persons": [{"name": "dave fredrickson", "sentiment": "none"}, {"name": "merck", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "kenilworth", "sentiment": "none"}], "organizations": [{"name": "u.s. fda", "sentiment": "negative"}, {"name": "standard of care chemotherapy", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "lynparza", "sentiment": "none"}, {"name": "u.s. food and drug administration", "sentiment": "none"}, {"name": "astrazeneca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LYNPARZA is the Only PARP Inhibitor Approved for Use Beyond Ovarian Cancer\nLYNPARZA Reduced Risk of Disease Progression or Death by 42 Percent Compared to Standard of Care Chemotherapy\nKENILWORTH, N.J.--(BUSINESS WIRE)-- AstraZeneca and Merck (NYSE:MRK), known as MSD outside the United States and Canada, today announced that the U.S. Food and Drug Administration (FDA) has approved LYNPARZA ® (olaparib) for use in patients with deleterious or suspected deleterious germline BRCA-mutated (gBRCAm), human epidermal growth factor receptor 2 (HER2)-negative metastatic breast cancer who have been previously treated with chemotherapy in the neoadjuvant, adjuvant or metastatic setting. Patients with hormone receptor positive (HR+) breast cancer should have been treated with a prior endocrine therapy or be considered inappropriate for endocrine therapy. Patients are selected for therapy based on an FDA-approved companion diagnostic from Myriad Genetics.\nDave Fredrickson, executive vice president, head of the oncology business unit, AstraZeneca, said, “This new approval for LYNPARZA makes it the first and only PARP inhibitor approved in metastatic breast cancer, and the only PARP inhibitor approved outside of ovarian cancer. This is significant for breast cancer patients, as the identification of BRCA status, in addition to hormone receptor and HER2 status, becomes a potentially critical step in the management of their disease.”\nDr. Roy Baynes, senior vice president and head of global clinical development, chief medical officer, Merck Research Laboratories, said, “This additional approval for LYNPARZA, based on the compelling data from the OlympiAD trial, represents an important advance for women with germline BRCA-mutated HER2-negative metastatic breast cancer, which is a difficult-to-treat cancer. Moreover, this approval adds further impetus to our important collaboration with AstraZeneca in developing cancer therapies.”\nThe approval was based on data from the randomized, open-label, phase 3 OlympiAD trial, which investigated LYNPARZA (olaparib) versus physician’s choice of chemotherapy (capecitabine, eribulin or vinorelbine). In the trial, LYNPARZA significantly prolonged progression-free survival (PFS) compared with chemotherapy, and reduced the risk of disease progression or death by 42 percent (HR 0.58; 95% CI 0.43-0.80; P=0.0009 median 7.0 vs 4.2 months). Patients with measurable disease taking LYNPARZA (n=167) experienced an objective response rate of 52 percent (95% CI 44-60), double the response rate for those in the chemotherapy arm (n=66), which was 23 percent (95% CI 13-35). Additionally, patients experienced a confirmed complete response rate of 7.8 percent for LYNPARZA compared to 1.5 percent for the chemotherapy arm. The data from the OlympiAD trial can be found in the June 2017 issue of the New England Journal of Medicine.\n“Patients diagnosed with BRCA-related metastatic breast cancer are often younger than other breast cancer patients, and their disease is often much more aggressive and difficult to treat,” said Dr. Susan M. Domchek, executive director of the Basser Center for BRCA at the Abramson Cancer Center of the University of Pennsylvania, and national leader on the OlympiAD trials. “While there is currently no cure for metastatic breast cancer, today’s approval offers a new, targeted option that may help to delay disease progression for these patients.”\nSue Friedman, executive director and founder of the nonprofit organization, Facing Our Risk of Cancer Empowered (FORCE), said, “We know there are limited treatment options for patients with metastatic breast cancer. For the portion of the 155,000 women in the U.S. living with metastatic breast cancer who have an inherited BRCA mutation, today’s news is encouraging. By undergoing genetic testing for BRCA mutations, we can gain critical information that will inform personalized treatment options specifically for women with this mutation.”\nThe most common adverse reactions in the OlympiAD trial of patients who received LYNPARZA were nausea (58%), anemia (40%), fatigue (including asthenia) (37%), vomiting (30%), neutropenia (27%), respiratory tract infection (27%), leukopenia (25%), diarrhea (21%), and headache (20%). The percentage of patients who discontinued treatment in the LYNPARZA arm was 5 percent compared to the chemotherapy arm, which was 8 percent. Please see Important Safety Information below.\nThis is the third indication approved for LYNPARZA (olaparib) in the U.S., where it has been used to treat nearly 4,000 advanced ovarian cancer patients. LYNPARZA has a broad clinical development program, and AstraZeneca and Merck are working together to deliver LYNPARZA as quickly as possible to more patients across multiple settings, including breast, ovarian, prostate and pancreatic cancers.\nImportant Safety Information\nContraindications\nThere are no contraindications for LYNPARZA.\nWarnings and Precautions\nMyelodysplastic Syndrome/Acute Myeloid Leukemia (MDS/AML): Occurred in <1.5% of patients exposed to LYNPARZA monotherapy, and the majority of events had a fatal outcome. The duration of therapy in patients who developed secondary MDS/AML varied from <6 months to >2 years. All of these patients had previous chemotherapy with platinum agents and/or other DNA-damaging agents, including radiotherapy, and some also had a history of more than one primary malignancy or of bone marrow dysplasia.\nDo not start LYNPARZA until patients have recovered from hematological toxicity caused by previous chemotherapy (≤Grade 1). Monitor complete blood count for cytopenia at baseline and monthly thereafter for clinically significant changes during treatment. For prolonged hematological toxicities, interrupt LYNPARZA and monitor blood count weekly until recovery.\nIf the levels have not recovered to Grade 1 or less after 4 weeks, refer the patient to a hematologist for further investigations, including bone marrow analysis and blood sample for cytogenetics. Discontinue LYNPARZA if MDS/AML is confirmed.\nPneumonitis: Occurred in <1% of patients exposed to LYNPARZA, and some cases were fatal. If patients present with new or worsening respiratory symptoms such as dyspnea, cough, and fever, or a radiological abnormality occurs, interrupt LYNPARZA treatment and initiate prompt investigation. Discontinue LYNPARZA if pneumonitis is confirmed and treat patient appropriately.\nEmbryo-Fetal Toxicity: Based on its mechanism of action and findings in animals, LYNPARZA can cause fetal harm. A pregnancy test is recommended for females of reproductive potential prior to initiating treatment. Advise females of reproductive potential of the potential risk to a fetus and to use effective contraception during treatment and for 6 months following the last dose. Advise male patients with female partners of reproductive potential or who are pregnant to use effective contraception during treatment and for 3 months following the last dose of LYNPARZA (olaparib) and to not donate sperm during this time.\nAdverse Reactions—Maintenance Setting\nMost common a", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.facebook.com%2Fmerckinvents&esheet=51742524&newsitemid=20180112005486&lan=en-US&anchor=Facebook&index=4&md5=1c8e329477428909718c492a66b93cf6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftwitter.com%2Fmerck&esheet=51742524&newsitemid=20180112005486&lan=en-US&anchor=Twitter&index=3&md5=47db19acaa08fabdb70df6e007ffad00", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.youtube.com%2FMerck&esheet=51742524&newsitemid=20180112005486&lan=en-US&anchor=YouTube&index=6&md5=dcce8f9c99740c9d00d7ebfd28936f37", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.instagram.com%2Fmerck&esheet=51742524&newsitemid=20180112005486&lan=en-US&anchor=Instagram&index=5&md5=ec112c00bf1be88cb57f57e9d0ab321a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fmerck&esheet=51742524&newsitemid=20180112005486&lan=en-US&anchor=LinkedIn&index=7&md5=05738cb2f3fd8b4b65e205915b89dc05", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51742524&newsitemid=20180112005486&lan=en-US&anchor=www.sec.gov&index=8&md5=1eb71b4172590006576b5cb03b153a5b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.merck.com%2Fclinicaltrials&esheet=51742524&newsitemid=20180112005486&lan=en-US&anchor=www.merck.com%2Fclinicaltrials&index=1&md5=7ff5af83bea7772df4ce31f01274577a", "http://www.businesswire.com/news/home/20180112005486/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.azpicentral.com%2Flynparza_tb%2Fpi_lynparza_tb.pdf%23page%3D1&esheet=51742524&newsitemid=20180112005486&lan=en-US&anchor=Prescribing+Information&index=9&md5=541ccf2cdbe9fcf7cfd6c0907b9c053a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.merck.com%2F&esheet=51742524&newsitemid=20180112005486&lan=en-US&anchor=www.merck.com&index=2&md5=fb9a4d45d43b5eaa8f9444e7e3fa4197"], "published": "2018-01-12T20:45:00.000+02:00", "crawled": "2018-01-12T20:41:25.023+02:00", "highlightTitle": ""}