{"organizations": [], "uuid": "7a11c947f473b326561db41eb7be8b5efb7ab2f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104931023-odd_socks.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/wearing-mismatched-socks-helped-this-millennial-land-his-dream-job.html", "country": "US", "domain_rank": 767, "title": "Wearing mismatched socks helped this millennial land his dream job", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.142, "site_type": "news", "published": "2018-01-08T16:41:00.000+02:00", "replies_count": 0, "uuid": "7a11c947f473b326561db41eb7be8b5efb7ab2f6"}, "author": "Abigail Hess", "url": "https://www.cnbc.com/2018/01/08/wearing-mismatched-socks-helped-this-millennial-land-his-dream-job.html", "ord_in_thread": 0, "title": "Wearing mismatched socks helped this millennial land his dream job", "locations": [], "entities": {"persons": [{"name": "santulli", "sentiment": "none"}, {"name": "liz wessel", "sentiment": "none"}, {"name": "liz", "sentiment": "none"}, {"name": "brandon santulli  santulli", "sentiment": "none"}, {"name": "brandon santulli", "sentiment": "none"}, {"name": "wessel", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "To perfect your interviewing skills, you're going to have to do your homework. Brandon Santulli took this to heart, and it helped him ace an interview with the CEO of his dream company, in an industry where he had no experience.\nIn 2015, Santulli graduated with a degree in Politics, Philosophy, and Economics but he quickly realized he wanted an entirely different career. \"A couple years after graduating, I knew I wanted to enter the world of tech — despite my non-tech major,\" he says. \"Once I found out I landed an Executive Assistant interview with WayUp's CEO, I knew I'd have to get creative in order to get my foot in the door.\" \nCourtesy of WayUp Brandon Santulli Santulli was determined to make a great impression on Liz Wessel, the CEO of job search platform WayUp . \"I wasn't about to take 30 minutes with Liz for granted, so to stand out and prove I was serious about this opportunity, I decided to learn as much as possible about her,\" he says.\nIndeed, Santulli scoured the internet and read every interview Wessel had ever conducted. \"During my daily runs the week before the interview, I listened to every podcast Liz was featured on, taking mental notes of peculiar facts,\" he says.\nAfter reading dozens of articles and nine separate podcasts, he walked away with two seemingly innocuous facts that would turn out to be his secret weapons for landing the job: her socks never match, and she studied Japanese.\nshow chapters Suzy Welch: The one interview question I always ask      1:14 PM ET Fri, 24 Feb 2017 | 00:59 On the day of the interview, Santulli was prepared for anything. After answering the typical interview questions he asked Wessel, \"I was just wondering, do you still wear mismatched socks every day?\"\nWessel was taken aback and said, \"I do. Great research.\"\n\"Well, after hearing you talk about it on a podcast, I thought I'd give it a try today,\" said Santulli before showing off his own mismatched pair of socks.\nAfter the interview, Santulli sent a follow-up email and signed off with \"Arigatou Gozaimasu,\" which means \"thank you\" in Japanese. \nNoam Galai | Getty Images Co-Founder and CEO of WayUp Liz Wessel \"I was incredibly surprised, but immensely impressed by the research he must have done,\" says Wessel. \"This 'sock stint' showed me that Brandon did in-depth research before coming in — not just a quick Google search — and that he was so enthusiastic about landing the job that he even showed it with his outfit choice.\"\nNeedless to say, Santulli got the job.\nWhen he found out, Santulli says he couldn't have been happier. \"I was ecstatic, and thrilled to see that my in-depth interview prep had paid off,\" he says. \"To make a lasting impression — especially as a new grad with limited work experience — you need to differentiate yourself outside of work experience, which I was able to do!\"\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: \n8 productivity hacks for working from home How to answer 4 of the most common interview questions Barack Obama and Bill Gates agree: This is one of the most 'unforgettable' books of 2017 show chapters Suzy Welch: Here's the one thing you must say in a job interview      8:57 AM ET Tue, 10 Oct 2017 | 01:44", "external_links": [], "published": "2018-01-08T16:41:00.000+02:00", "crawled": "2018-01-08T16:41:31.010+02:00", "highlightTitle": ""}