{"organizations": [], "uuid": "960e3b9206750e6c48c78f650e5cc63819dc31c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/9", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-wall-street-prep-to-expand-consulting-practice-hires-finance-veteran-marshall-anderson-to-lead-team.html", "country": "US", "domain_rank": 767, "title": "Wall Street Prep to Expand Consulting Practice, Hires Finance Veteran Marshall Anderson to Lead Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.993, "site_type": "news", "published": "2018-01-16T22:15:00.000+02:00", "replies_count": 0, "uuid": "960e3b9206750e6c48c78f650e5cc63819dc31c9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-wall-street-prep-to-expand-consulting-practice-hires-finance-veteran-marshall-anderson-to-lead-team.html", "ord_in_thread": 0, "title": "Wall Street Prep to Expand Consulting Practice, Hires Finance Veteran Marshall Anderson to Lead Team", "locations": [], "entities": {"persons": [{"name": "marshall anderson", "sentiment": "negative"}, {"name": "matan feldman", "sentiment": "none"}, {"name": "marshall", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "wall street prep, inc.", "sentiment": "neutral"}, {"name": "wsp consulting", "sentiment": "none"}, {"name": "wsp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Wall Street Prep, Inc., a leader in finance training and related services, today announced the expansion of its financial consulting practice. The division, WSP Consulting, helps clients achieve growth and drive efficiencies by providing advisory services across the finance, accounting and investment spectrum. An overview of WSP Consulting services can be found at www.wallstreetprep.com/consulting .\n\"Many of our clients rely on us to go beyond training to develop customized models and architect solutions for their specific challenges,\" said Matan Feldman, Wall Street prep CEO. \"Today, I am pleased to announce that we are formalizing these services under the umbrella of WSP Consulting. We have a deep roster of professionals with expertise across a range of functional areas and industry verticals, and we want to extend these services in response to client demand.\"\nTo lead the business unit expansion, WSP Consulting has hired Marshall Anderson, a veteran finance professional with nearly 25 years of consulting and banking experience. Marshall has provided consulting services and capital markets advice to large-cap and mid-market companies and funds. He has led large-scale financial transformations, corporate restructurings, buy-side due diligence, sell-side carve-outs and IPO prep services.\nMarshall will serve as Managing Partner and head of the consulting division. \"We are excited to have Marshall join our team,\" said Arkady Libman, Wall Street Prep Managing Partner. \"His experience as a Big-4 consultant, investment banker and military officer is the perfect fit for WSP's brand and services. Our clients look to us to provide leading-practice financial services in a collaborative and honest relationship. Marshall's experience and reputation fits that bill perfectly.\"\nPrior to joining WSP Consulting, Marshall was Partner at EY and KPMG. He was an investment banker at Citibank before leaving to join the private equity firm BMV Capital. Marshall started his career as an officer in the U.S. Air Force after graduating from the U.S. Air Force Academy with a degree in Engineering Mechanics. He holds an MBA from Loyola Marymount University, is a certified restructuring professional and project manager. Marshall has authored white papers and spoke on topics ranging from Corporate Development best practices, real estate restructurings, bank regulatory response and alternative energy investing.\n\"It's an honor to join Wall Street Prep – a fantastic team with a proven track record and great reputation,\" said Mr. Anderson. \"Having been both strategic investor and CFO, I understand that driving financial success is a continually evolving process that requires analytical rigor, efficient processes and honest perspective. By leveraging WSP's renowned brand of finance, accounting and investment skills, we will continue to deliver back-office efficiency gains and front-office strategic investment advice to our clients.\"\nAbout Wall Street Prep\nWall Street Prep is a global financial training and consulting firm. Established in 2004 by investment bankers to train the financial services industry, Wall Street Prep trains over 10,000 professionals and students annually. In addition to training services, we offer full service financial consulting services through WSP Consulting. Our client list includes top financial institutions, corporations and business schools.\nMedia Contact: Scott Humphries, Phone: 617-314-7685 extension 714, Email: shumphries@wallstreetprep.com\nRelated Links\nLearn more about WSP Consulting\n with multimedia: releases/wall-street-prep-to-expand-consulting-practice-hires-finance-veteran-marshall-anderson-to-lead-team-300583253.html\nSOURCE Wall Street Prep", "external_links": ["https://www.wallstreetprep.com/consulting", "http://www.prnewswire.com/news-releases/wall-street-prep-to-expand-consulting-practice-hires-finance-veteran-marshall-anderson-to-lead-team-300583253.html", "http://www.wallstreetprep.com/consulting"], "published": "2018-01-16T22:15:00.000+02:00", "crawled": "2018-01-17T02:22:34.001+02:00", "highlightTitle": ""}