{"organizations": [], "uuid": "cb88eeb0aafdcf78e4e05390a850487fe4d34194", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC505_3nuzB_TOP_20180122091143.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516793157", "country": "US", "domain_rank": 387, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T14:25:00.000+02:00", "replies_count": 0, "uuid": "cb88eeb0aafdcf78e4e05390a850487fe4d34194"}, "author": "Brian Baskin", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516793157", "ord_in_thread": 0, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "locations": [], "entities": {"persons": [{"name": "erin ailworth", "sentiment": "none"}, {"name": "andrew tangel", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": [{"name": "logistics news from - wsj", "sentiment": "negative"}, {"name": "whirlpool corp", "sentiment": "none"}, {"name": "samsung electronics co.", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sign up: With one click, get this newsletter delivered to your inbox .\nThe first volleys in a trade war may have been fired over washing machines and solar panels. Manufacturers disagree over whether the Trump administration’s decision to impose import duties on the two items will create more jobs domestically , the WSJ’s Erin Ailworth and Andrew Tangel report. Whirlpool Corp. WHR 4.34% , the U.S. washing machine manufacturer that petitioned for a tariff to fend off South Korean competition, says it will add 200 jobs in Ohio. But Samsung Electronics Co. employs hundreds of workers at an assembly plant in South Carolina , some of which could be in jeopardy now that the company will have to pay more to import parts. And while the small U.S. solar panel manufacturing sector will benefit from tariffs on Chinese-made panels, the much larger renewable energy installation market could take a hit as equipment prices rise. Multinationals in other industries also worry the Trump administration’s actions will lead to retaliation from across the Pacific, and open the door to future exchanges of tariffs and trade barriers.\nThe recently passed tax overhaul could accelerate a southern shift in the nation’s manufacturing supply chain. F or years, automakers and other manufacturers have located factories in states like South Carolina and Tennessee , where wages and taxes tend to be lower and barriers to labor organizing are higher. The changes to the tax code exacerbate this shift by reducing deductions for state and local taxes, creating fresh incentives for high-earners and some middle-class workers from high-tax Northern states to move to warmer climes, the WSJ’s Cameron McWhirter and Arian Campo-Flores report. That could help Southern states overcome some of the remaining hurdles to attracting businesses: a high poverty rate and low education levels.\nKimberly-Clark is remodeling its supply chain to reflect a world where more adults and fewer babies will need diapers. The company is cutting at least 5,000 jobs and closing 10 factories as it confronts sluggish sales of products ranging from diapers to toilet paper , the WSJ’s Sharon Terlep reports. Kimberly-Clark ’s problems stem in part from a price war in the household staples sector, where rival consumer-product giants are struggling to hold onto customers, even as costs for key materials rise and the overall market for some items shrinks. The cuts also speak to dispiriting long-term trends, including declining fertility rates in most large economies, reducing demand for baby products. Kimberly-Clark sees opportunities overseas, where fertility rates are falling but haven’t hit developed-world lows. And the rapid aging of the U.S. population will lead to at least one potential growth market: adult incontinence.\nTRADE\nContainers are seen at the Yangshan Deep Water Port, part of the Shanghai Free Trade Zone. Photo: aly song/Reuters\nU.S. companies are discovering that success in China means playing by an ever-changing set of rules. Multinational corporations are finding that they are not exempt from the government’s increasingly heavy hand in setting industrial policy, the WSJ’s Andrew Browne writes. China is becoming more assertive in demanding Western technology firms censor their platforms, and companies that run afoul of state political stances face swift reprisal. The trend is an about-face from 17 years ago, when China’s entrance into the World Trade Organization appeared to represent a key step in opening up the country’s economy. Instead, Mr. Browne notes that China has learned the opposite lesson: it can dictate terms to companies desperate for a piece of the world’s fastest-growing major market for cars, smartphones and other goods. Tensions between the state and foreign businesses appear unlikely to alleviate anytime soon, with the Trump administration looking to put up trade barriers of its own rather than convince China to open up.\nQUOTABLE\n‘ The concern is that now we’re at a tipping point. ’\n—Chad P. Brown, senior fellow at the Peterson Institute for International Economics in Washington, on tariffs.\nNumber of the Day 90% Share of solar panels that are imported.\nIN OTHER NEWS\nNegotiators with 11 Pacific Rim nations agreed on a Trans-Pacific Partnership trade deal . (WSJ)\nLiquefied natural gas prices hit a three-year high as China replaced coal with the cleaner-burning fuel. (WSJ)\nCSX Corp. will require its chief executive to submit results of an annual physical exam to the railroad’s board. (WSJ)\nThe global political and business elite gathered in Davos celebrated a booming global economy, but anxieties surfaced over geopolitical risk. (WSJ)\nManufacturing activity in the central Atlantic region slowed in January . (WSJ)\nJapan's department store sales at existing locations grew for the first time in three years in 2017.\nCanadian grain shippers are seeing only isolated slowdowns in rail transport during this shipping season. (Canadian Cattlemen) https://\nContainer shipping line CMA CGM has expressed interest in a controlling stake in Russian intermodal operator TransContainer . (Railway Pro)\nMaersk Line joined the New York Shipping Exchange , joining five other large container services. (Splash 24/7)\nGreek shipowners are consolidating at their fastest pace in two decades . (Seatrade Maritime News)\nThe Port of Savannah surpassed four million TEUs for the first time in 2017. (Maritime Professional)\nRuan Transportation Management Systems ordered five Tesla Semi electric trucks . (Des Moines Register)\nAustralian wine exports to China have surged after import duties were lowered. (Reuters)\nABOUT US Brian Baskin is editor of WSJ Logistics Report. Follow him at @brianjbaskin , and follow the entire WSJ Logistics Report team: @PaulPage , @jensmithWSJ and @EEPhillips_WSJ . Follow the WSJ Logistics Report on Twitter at @WSJLogistics .\nWrite to Brian Baskin at brian.baskin@wsj.com", "external_links": ["http://www.canadiancattlemen.ca/daily/prairie-grain-movement-not-perfect-but-not-in-crisis", "https://www.reuters.com/article/us-australia-wine-china/australian-wine-exports-to-china-surge-as-fta-cuts-tariffs-idUSKBN1FC028", "https://twitter.com/WSJLogistics?lang=en", "https://www.desmoinesregister.com/story/entertainment/best-lists/2018/01/22/iowa-trucking-company-reserves-five-tesla-electric-semi-trucks/1053645001/", "https://www.maritimeprofessional.com/news/georgia-ports-surpass-teus-313110", "https://asia.nikkei.com/Politics-Economy/Economy/Japan-s-department-store-sales-see-first-rise-in-3-years", "http://www.railwaypro.com/wp/french-company-interested-transcontainer/", "https://twitter.com/EEPhillips_WSJ?lang=en", "http://www.seatrade-maritime.com/news/europe/consolidation-and-larger-fleets-the-name-of-the-game-in-greek-shipowning.html", "http://www.twitter.com/PaulPage", "https://twitter.com/PaulPage", "http://www.twitter.com/brianjbaskin", "http://splash247.com/maersk-signs-new-york-shipping-exchange/", "https://twitter.com/jensmithWSJ"], "published": "2018-01-24T14:25:00.000+02:00", "crawled": "2018-01-24T23:10:04.000+02:00", "highlightTitle": ""}