{"organizations": [], "uuid": "f6db9fa703517a48afa9e0927302ba67907e6d42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-verastem-appoints-joseph-lobacki-as-chief-commercial-officer.html", "country": "US", "domain_rank": 767, "title": "Verastem Appoints Joseph Lobacki as Chief Commercial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.102, "site_type": "news", "published": "2018-01-04T15:01:00.000+02:00", "replies_count": 0, "uuid": "f6db9fa703517a48afa9e0927302ba67907e6d42"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-verastem-appoints-joseph-lobacki-as-chief-commercial-officer.html", "ord_in_thread": 0, "title": "Verastem Appoints Joseph Lobacki as Chief Commercial Officer", "locations": [], "entities": {"persons": [{"name": "joseph lobacki", "sentiment": "negative"}, {"name": "robert forrester", "sentiment": "none"}, {"name": "joseph", "sentiment": "none"}, {"name": "lobacki", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "verastem, inc.", "sentiment": "neutral"}, {"name": "nda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON--(BUSINESS WIRE)-- Verastem, Inc. (Nasdaq:VSTM), focused on discovering and developing drugs to improve the survival and quality of life of cancer patients, today announced the appointment of Joseph Lobacki as Executive Vice President and Chief Commercial Officer. Mr. Lobacki, formerly Chief Commercial Officer of Medivation, will be responsible for overseeing the commercial strategy and execution for Verastem’s lead product candidate, duvelisib.\n“Joseph is a skilled leader in commercializing oncology drugs,” said Robert Forrester, President and Chief Executive Officer of Verastem. “His strong experience in oncology and hematology commercialization and marketing make him an invaluable addition to the Verastem team at this critical moment for duvelisib. We look forward to his insights as we prepare for a potential commercial launch, in parallel with our continued preparations to submit a New Drug Application (NDA) this quarter for the full approval of duvelisib for the treatment of patients with relapsed or refractory chronic lymphocytic leukemia (CLL)/small lymphocytic lymphoma (SLL), as well as accelerated approval for relapsed or refractory follicular lymphoma (FL).”\nMr. Lobacki commented, “I am excited to be joining Verastem’s management team at this pivotal time for the company, particularly based on the positive Phase 3 DUO results presented at ASH. I am motivated to work with the leadership team to execute on the launch strategy as we work toward bringing duvelisib to market as an important new oral monotherapy for patients in need of additional treatment options.”\nMr. Lobacki most recently served as the Chief Operating Officer of Finch Therapeutics Group and previously as the Chief Commercial Officer and Executive Council Member of Medivation, where he was responsible for the strategy and execution of commercial operations including Xtandi, a treatment for advanced prostate cancer. During Mr. Lobacki’s leadership as Chief Commercial Officer, Medivation saw year-over-year revenue growth for Xtandi. Previously, Mr. Lobacki was Senior Vice President and Chief Commercial Officer of Micromet Inc., where he oversaw commercial activities including medical affairs and strategic marketing. Prior to joining Micromet, Mr. Lobacki was Senior Vice President and General Manager at Genzyme Corporation, where he managed the launch of Mozobil and Clolar/Evoltra in the US and EU. Mr. Lobacki holds a Bachelor of Science in Biology from Boston College and a Bachelor of Science in Pharmacy from the Massachusetts College of Pharmacy in Boston.\nEquity Awards\nIn connection with the hiring of Mr. Lobacki, effective January 3, 2018, Verastem granted to Mr. Lobacki stock options to purchase an aggregate of 600,000 shares of Verastem’s common stock pursuant to the Nasdaq inducement grant exception as an inducement material to Mr. Lobacki’s acceptance of employment with Verastem in accordance with Nasdaq Listing Rule 5635(c)(4). A stock option to purchase 400,000 shares of Verastem’s common stock will vest as to 25% of the shares on the first anniversary of the date of hire and as to an additional 6.25% of the shares at the end of each successive three-month period following the first anniversary of the date of hire, provided that Mr. Lobacki continues to serve as an employee of or other service provider to Verastem on each such vesting date. A stock option to purchase 200,000 shares will vest in full upon achievement of certain net sales targets of duvelisib, provided that Mr. Lobacki continues to serve as an employee of or other service provider to Verastem on the vesting date. Both stock options have an exercise price equal to $3.14, the closing price of Verastem's common stock as reported by Nasdaq on January 3, 2018.\nVerastem also granted stock options to five new employees to purchase an aggregate of 93,500 shares of Verastem’s common stock. The options were granted as an inducement material to the employees’ acceptance of employment with Verastem in accordance with Nasdaq Listing Rule 5635(c)(4). The options have an exercise price equal to $3.21, the closing price of Verastem's common stock as reported by Nasdaq on January 2, 2018. The awards will vest as to 25% of the shares subject to the options on the first anniversary of the date of hire and as to an additional 6.25% of the shares subject to the options at the end of each successive three-month period following the first anniversary of the date of hire, provided that the employees continue to serve as an employee of or other service provider to Verastem on each such vesting date.\nAbout Duvelisib\nDuvelisib is an investigational, dual inhibitor of phosphoinositide 3-kinase (PI3K)-delta and PI3K-gamma, two enzymes known to help support the growth and survival of malignant B-cells and T-cells. PI3K signaling may lead to the proliferation of malignant B-cells and is thought to play a role in the formation and maintenance of the supportive tumor microenvironment. 1,2,3 Duvelisib is currently being evaluated in late- and mid-stage clinical trials, including DUO™, a randomized, Phase 3 monotherapy study in patients with relapsed or refractory CLL/SLL, 4 and DYNAMO™, a single-arm, Phase 2 monotherapy study in patients with refractory iNHL that achieved its primary endpoint of ORR. 5 Duvelisib is also being evaluated for the treatment of other hematologic malignancies, including T-cell lymphoma, through investigator-sponsored studies. 6 Information about duvelisib clinical trials can be found on www.clinicaltrials.gov .\nAbout Verastem, Inc.\nVerastem, Inc. (Nasdaq:VSTM) is a biopharmaceutical company focused on discovering and developing drugs to improve outcomes for patients with cancer. Verastem is currently developing duvelisib, a dual inhibitor of PI3K-delta and PI3K-gamma, which has successfully met its primary endpoint in a Phase 2 study in iNHL and a Phase 3 clinical trial in patients with CLL/SLL. In addition, Verastem is developing the FAK inhibitor defactinib, which is currently being evaluated in three separate clinical collaborations in combination with immunotherapeutic agents for the treatment of several different cancer types, including pancreatic cancer, ovarian cancer, non-small cell lung cancer, and mesothelioma. Verastem’s product candidates seek to treat cancer by modulating the local tumor microenvironment, enhancing anti-tumor immunity, and reducing cancer stem cells. For more information, please visit www.verastem.com .\nVerastem, Inc. forward-looking statements notice:\nThis press release includes forward-looking statements about Verastem's strategy, future plans and prospects, including statements regarding the development and activity of Verastem's investigational product candidates, including duvelisib and defactinib, and Verastem's PI3K and FAK programs generally, the structure of our planned and pending clinical trials and the timeline and indications for clinical development and regulatory submissions. The words \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"predict,\" \"project,\" \"target,\" \"pote", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.clinicaltrials.gov%2F&esheet=51737747&newsitemid=20180104005454&lan=en-US&anchor=www.clinicaltrials.gov&index=5&md5=d7cf07481c9ec8c66372a3b0e9d18e5a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.clinicaltrials.gov%2F&esheet=51737747&newsitemid=20180104005454&lan=en-US&anchor=www.clinicaltrials.gov&index=3&md5=18527eb14e3b56d2c4fd30db6a68ae80", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.clinicaltrials.gov%2F&esheet=51737747&newsitemid=20180104005454&lan=en-US&anchor=www.clinicaltrials.gov&index=1&md5=1def03985b4f676ed73bdd48fdda7769", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.clinicaltrials.gov%2F&esheet=51737747&newsitemid=20180104005454&lan=en-US&anchor=www.clinicaltrials.gov&index=4&md5=0c5d499c1393575993edc6f2ca6fedd6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.verastem.com%2F&esheet=51737747&newsitemid=20180104005454&lan=en-US&anchor=www.verastem.com&index=2&md5=03ab5d34080f5303eaac25a3de9ad74a", "http://www.businesswire.com/news/home/20180104005454/en/"], "published": "2018-01-04T15:01:00.000+02:00", "crawled": "2018-01-04T19:35:06.003+02:00", "highlightTitle": ""}