{"organizations": [], "uuid": "fc059e72baff3e6c509f73423ab2979fec605c14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180120.html", "section_title": "Archive News &amp; Video for Saturday, 20 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/pope-latam-abuse/key-cardinal-distances-himself-from-pope-abuse-comment-idUSL8N1PF0FV", "country": "US", "domain_rank": 408, "title": "Key cardinal distances himself from pope abuse comment", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-21T02:23:00.000+02:00", "replies_count": 0, "uuid": "fc059e72baff3e6c509f73423ab2979fec605c14"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/pope-latam-abuse/key-cardinal-distances-himself-from-pope-abuse-comment-idUSL8N1PF0FV", "ord_in_thread": 0, "title": "Key cardinal distances himself from pope abuse comment", "locations": [], "entities": {"persons": [{"name": "trujillo", "sentiment": "negative"}, {"name": "fernando karadima", "sentiment": "none"}, {"name": "pope francis", "sentiment": "none"}, {"name": "juan barros", "sentiment": "none"}, {"name": "sean o‘malley", "sentiment": "none"}, {"name": "bishop barros", "sentiment": "none"}, {"name": "barros", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "vatican", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "catholic church", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TRUJILLO, Peru, Jan 20 (Reuters) - A key U.S. cardinal distanced himself on Saturday from comments on sex abuse by Pope Francis, a remarkable move that appeared to underscore divisions in the Catholic Church over how to treat accusations.\nCardinal Sean O‘Malley of Boston said in a statement “it is understandable” that comments made by the pope in Chile on Thursday were “a source of great pain for survivors of sexual abuse by clergy or any other perpetrator.”\nIn response to a question from a reporter on accusations against Juan Barros, a Chilean bishop appointed by the pope in 2015 who is accused of protecting a pedophile, the pope said:\n“The day I see proof against Bishop Barros, then I will talk. There is not a single piece of evidence against him. It is all slander. Is that clear?”\nThe pope’s comments appearing to dismiss the credibility of accusers was widely criticised by victims, their advocates and editorials in Chile and the pope’s native Argentina.\nBarros has been accused of protecting his former mentor, Father Fernando Karadima, who was found guilty in a Vatican investigation in 2011 of abusing teenage boys over many years. He denies the allegations and Barros said he was unaware of any wrongdoing. The Barros-Karadima case has riveted Chile for years.\nO‘Malley’s statement on the pope’s choice of language said: “Words that convey the message ‘if you cannot prove your claims then you will not be believed’ abandon those who have suffered reprehensible criminal violations of their human dignity and relegate survivors to discredited exile.”\nThe statement was even more remarkable because O‘Malley headed a papal commission advising the pontiff on how to root out sexual abuse in the Church. The commission’s three-year term ended last month and its future is not clear.\nO‘Malley said he could not “address why the Holy Father chose the particular words he used at that time” but said the pope “fully recognizes the egregious failures of the Church and it’s clergy who abused children and the devastating impact those crimes have had on survivors and their loved ones.”\nTo many, the pope’s comment undermined his public admission days earlier of “pain and shame” for the rape and molestation of children by priests and a meeting with victims.\nEven Chile’s famously conservative print media criticized the pope’s comments.\nA column by a papal biographer Sergio Rubin in Clarin, the most circulated newspaper in the pope’s home country of Argentina, proclaimed the Chile trip his worst overseas visit in the five years since his election.\nJuan Carlos Claret, a spokesman for anti-Barros Catholics in Osorno, where Barros remains bishop, said on Saturday he was worried the pope words will discourage more victims from speaking out.\n“What incentive will victims have to come forward when even if the courts and the Vatican have said they are right, in the end the pope says they are pure lies?” he told Reuters.\n“It does not do any good for the pope to come to Chile and speak of poverty and the environment if in the end he does not confront the only thing the Chilean community cares about,” Claret said in a phone interview. (Caroline Stauffer reported from Lima; Additional reporting by Felipe Iturrieta in Santiago; Editing by Bill Trott)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-21T02:23:00.000+02:00", "crawled": "2018-01-21T13:21:32.035+02:00", "highlightTitle": ""}