{"organizations": [], "uuid": "6df118c2960651777681b10509a427bf3f72ac0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225841337&w=1200&r=LYNXMPEE0Q0QC", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-people-stevewynn/wynn-to-resign-from-rnc-finance-chair-post-politico-idUKKBN1FG0VM", "country": "US", "domain_rank": 408, "title": "Wynn resigns as RNC finance chair after sexual misconduct allegations", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T01:38:00.000+02:00", "replies_count": 0, "uuid": "6df118c2960651777681b10509a427bf3f72ac0f"}, "author": "", "url": "https://uk.reuters.com/article/us-people-stevewynn/wynn-to-resign-from-rnc-finance-chair-post-politico-idUKKBN1FG0VM", "ord_in_thread": 0, "title": "Wynn resigns as RNC finance chair after sexual misconduct allegations", "locations": [], "entities": {"persons": [{"name": "wynn", "sentiment": "negative"}, {"name": "steve holland", "sentiment": "none"}, {"name": "steve wynn", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ronna romney mcdaniel", "sentiment": "none"}, {"name": "gibson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "rnc", "sentiment": "negative"}, {"name": "republican national committee", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 7:35 PM / Updated 10 hours ago Wynn resigns as RNC finance chair after sexual misconduct allegations Steve Holland , Ginger Gibson 4 Min Read \nWASHINGTON (Reuters) - Las Vegas casino mogul Steve Wynn resigned as finance chairman of the Republican Party’s fundraising arm on Saturday, a day after a newspaper reported that he routinely subjected women who worked for him to unwanted sexual advances. \n“Today I accepted Steve Wynn’s resignation as Republican National Committee finance chair,” RNC chair Ronna Romney McDaniel said in a statement. \nThe billionaire has denied the accusations published by the Wall Street Journal as “preposterous” and said they were instigated by his ex-wife to seek advantage in their divorce lawsuit. \nBut he said in a statement released on Saturday evening that he was resigning to avoid unnecessary distraction. He also thanked U.S. President Donald Trump for the job. \n“The unbelievable success we have achieved must continue,” the statement said. “The work we are doing to make America a better place is too important to be impaired by this distraction.” \nAs recently as Friday night, Wynn associates were insisting he would fight the charges and remain at the RNC. \nInstead, he becomes the latest powerful man to pay a price for accusations of sexual misconduct in the United States. \nThe 76-year-old founder, chairman and chief executive officer of Wynn Resorts Ltd, has been a prominent figure in the casino resort business and onetime rival of Trump. \nAfter previously seeking to appear nonpartisan, he threw his support behind Trump during the 2016 campaign and donated money to several Republican causes including the RNC. FILE PHOTO - Steve Wynn, Chairman and CEO of Wynn Resorts, speaks during the Milken Institute Global Conference in Beverly Hills, California, U.S., May 3, 2017. REUTERS/Mike Blake/File Picture \nTrump called Wynn a “great friend” after he won the Nevada caucus in February 2016, and Wynn was named finance chairman of the committee after Trump became president. \nU.S. Representative Francis Rooney of Florida is being considered as a replacement, one Republican fundraiser said. \nThe board of directors of Wynn Resorts said on Friday it had met to form a special committee consisting solely of independent directors to investigate the allegations reported by the Journal. \nThe special investigation panel will be chaired by Patricia Mulroy, a member of the board’s corporate governance and compliance committees and a former member of the Nevada Gaming Commission, the board said in a statement. \nThe Wall Street Journal said former and current company staff members it interviewed had accused Wynn of creating a hostile work environment for women and of regularly pressuring employees to perform sex acts. \n“The idea that I ever assaulted any woman is preposterous,” Wynn said in a statement on Friday. “The instigation of these accusations is the continued work of my ex-wife, Elaine Wynn, with whom I am involved in a terrible and nasty lawsuit in which she is seeking a revised divorce settlement.” \nA spokeswoman for Elaine Wynn, 75, declined comment on Friday, but her Washington-based attorney, James Cole, told Reuters the notion that his client fomented the allegations in the Journal article “is just not true.” \nAfter The New York Times revealed in October that Hollywood producer Harvey Weinstein had paid off multiple sexual harassment accusers over decades, it unleashed a wave of accusations against the rich and powerful, leading to the #MeToo and #TimesUp movements demanding an end to impunity. \nWeinstein was long a major donor to Democratic candidates and causes. The scandal prompted McDaniel to urge the Democrats to give back his “dirty money.” \nAfter the Journal published the accusations against Wynn, Democrats in turn called on Republicans to return his donations. Reporting by Steve Holland, Ginger Gibson, Yeganeh Torbati and Dustin Volz; Writing by Daniel Trotta; Editing by Bill Trott and Chris Reese", "external_links": [], "published": "2018-01-28T01:38:00.000+02:00", "crawled": "2018-01-28T16:21:48.062+02:00", "highlightTitle": ""}