{"organizations": [], "uuid": "3ebabd88099824059967fa745f3308fc66e13d8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-nec-and-magna5-continue-relationship-built-upon-netserve365-acquisition.html", "country": "US", "domain_rank": 767, "title": "NEC and Magna5 Continue Relationship Built Upon NetServe365 Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:24:00.000+02:00", "replies_count": 0, "uuid": "3ebabd88099824059967fa745f3308fc66e13d8b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-nec-and-magna5-continue-relationship-built-upon-netserve365-acquisition.html", "ord_in_thread": 0, "title": "NEC and Magna5 Continue Relationship Built Upon NetServe365 Acquisition", "locations": [], "entities": {"persons": [{"name": "tai hashizawa", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "plano", "sentiment": "none"}], "organizations": [{"name": "newspring holdings", "sentiment": "negative"}, {"name": "nec", "sentiment": "negative"}, {"name": "nec corporation of america", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PLANO, Texas, Jan. 09, 2018 (GLOBE NEWSWIRE) -- Magna5, a portfolio company of NewSpring Holdings’ voice and data managed services platform, and NEC Corporation of America, a leading technology integrator and service provider of advanced IT, communications, and networking solutions today announced they have reconfirmed and extended the contractual relationships originally in place with NetServe365.\n“The acquisition of NEC’s longtime solutions integrator, NetServe365, demonstrates Magna5’s mission to deliver best in class technology infrastructure and advanced cloud hosting solutions to their communications clients,” said Tai Hashizawa, Executive Vice President, NEC Corporation of America. “We are excited to see the new solutions made possible through the combination of Magna5’s extensive communications network with NEC’s advanced technology infrastructure and Hosting Partner relationship with Iron Mountain data centers.”\n“Magna5 is excited to expand our technology and service portfolio with the expansion of this exciting relationship with a global technology leader like NEC,” said Greg Forrest, President and CEO, Magna5. “This collaboration allows Magna5 to significantly expand our portfolio to deliver new technology infrastructure solutions while advancing access to leading edge technology through cloud solutions ranging from Commvault Software for backup and recovery to SAP HANA hosting services to our clients.”\nAbout Magna5\nMagna5 delivers network services, unified communications, infrastructure technology and managed services to more than 7,500 mid-market enterprise customers nationwide, including leaders within the education, healthcare, government, financial services and beyond. Magna5 offers voice and data services, as well as a host of “above the net” cloud services and operates a proprietary, secure network designed to leverage diversified carriers and infrastructure in targeted points-of-presence (PoPs) throughout the United States, a key strategy for network reliability. Within the managed services offerings, Magna5 provides security services, data backup, recovery management, hosting services, and IT Consulting from their 24/7/365 fully staffed Operations Center. Headquartered in Dallas, Magna5 operates office and network facilities across the country, including Albany, NY; Los Angeles; New York City; Pittsburgh; Portland, OR; San Antonio; Seattle, and Troy, NY. Magna5 is a portfolio company of NewSpring Holdings’ voice and data managed services platform, part of NewSpring Capital’s dedicated buy and build strategy. For more information, visit www.magna5global.com .\nAbout NEC Corporation of America\nNEC Corporation of America (NEC) is a leading technology integrator providing solutions that improve the way people work and communicate. NEC delivers integrated Solutions for Society that are aligned with our customers' priorities to create new value for people, businesses and society, with a special focus on safety, security and efficiency. We deliver one of the industry's strongest and most innovative portfolios of communications, analytics, security, biometrics and technology solutions that unleash customers' productivity potential. Through these solutions, NEC combines its best-in-class solutions and technology, and leverages a robust partner ecosystem to solve today’s most complex business problems. NEC Corporation of America is a wholly-owned subsidiary of NEC Corporation, a global technology leader with a presence in 140 countries and $29.5 billion in revenues. For more information, please visit http://www.necam.com/ .\nPress Contacts:\nAnne Clarrissimeaux\nMagna5\nMarketing Communications Manager\nOffice: (214) 552-0910\naclarrissimeaux@magna5global.com\nJohn Wise\nNEC Corporation of America\nSr. Manager-Marketing Comm.\nOffice: (214) 262-6385\njohn.wise@necam.com\nSource: Magna5", "external_links": ["http://www.necam.com/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/3f3cf816-42f8-443d-b755-b48ea37860b0", "http://www.magna5global.com/", "http://www.newspringcapital.com/"], "published": "2018-01-09T18:24:00.000+02:00", "crawled": "2018-01-09T21:26:25.047+02:00", "highlightTitle": ""}