{"organizations": [], "uuid": "76615ffeda2573f7692d9ea2419597173f0c4487", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222795946&w=1200&r=LYNXMPEE0G14E", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-britain-nuclear-hinkley/edf-sees-uk-hinkley-c-nuclear-plant-online-by-end-of-2025-idUKKBN1F61PX", "country": "US", "domain_rank": 408, "title": "EDF sees UK Hinkley C nuclear plant online by end of 2025", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T20:17:00.000+02:00", "replies_count": 0, "uuid": "76615ffeda2573f7692d9ea2419597173f0c4487"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-nuclear-hinkley/edf-sees-uk-hinkley-c-nuclear-plant-online-by-end-of-2025-idUKKBN1F61PX", "ord_in_thread": 0, "title": "EDF sees UK Hinkley C nuclear plant online by end of 2025", "locations": [], "entities": {"persons": [{"name": "oleg vukmanovic", "sentiment": "none"}, {"name": "simone rossi", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}], "organizations": [{"name": "edf", "sentiment": "negative"}, {"name": "hinkley point c", "sentiment": "none"}, {"name": "china general nuclear power corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "edf energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 6:18 PM / Updated 31 minutes ago EDF sees UK Hinkley C nuclear plant online by end of 2025 Oleg Vukmanovic 4 Min Read \nHINKLEY POINT, England (Reuters) - EDF Energy said on Wednesday its Hinkley C nuclear power station in Somerset, southwest England, will come online by the end of 2025 and give the developer the experience to lower the costs of subsequent nuclear plants planned in the country. \nHinkley Point C will be the first nuclear plant built in Britain in decades. It is expected to provide 7 percent of Britain’s power needs while helping to replace the country’s ageing nuclear fleet and closing coal plants. \n“We are confident we can deliver this timeline as our project at Hinkley Point C benefits from innovative tools and the lessons from other (nuclear reactor) projects,” EDF Energy Chief Executive Simone Rossi told a briefing at the plant site. \nThe plant, being built by the British arm of France’s EDF with China General Nuclear Power Corp, has been beset by delays and higher cost estimates. It was initially expected to start producing electricity in 2017. \nThe project has also been criticised over its guaranteed price for electricity, which is higher than market rates. \nHinkley Point C was thrown into doubt in 2016 when newly installed British Prime Minister Theresa May delayed a decision on whether to approve it, amid criticism that the guaranteed price was too high. \nThe British government eventually gave approval and there are now 3,000 people working at the site, Rossi said. \nEDF Energy will start building the power plant’s structures above ground by June 2019, after the foundations are in place for the first reactor unit, he added. \nLast year, state-owned utility EDF raised the cost estimate for Hinkley to 19.6 billion pounds after a review. \nEDF also plans to build two more nuclear reactors at Sizewell in eastern England. \nRossi said the construction costs for Sizewell C could be cut after gaining experience in building Hinkley and adapting the EPR reactor design to meet UK regulatory requirements. Hinkley Point C nuclear power station site is seen near Bridgwater in Britain, September 14, 2016. REUTERS/Stefan Wermuth/File Photo \nDesigned by Areva, the third generation EPR reactor, has had heavy delays and cost overruns at units in France and Finland. \nThe capital cost of Sizewell C could be 20 percent less than Hinkley, Rossi said. \nOther reasons Sizewell could be cheaper are that the site already has grid connection and is close to where demand is located. Slideshow (8 Images) \nSizewell will also be less costly as the reactor design would have been proven. \n“Sizewell C will be a proven technology, representing the seventh and eighth EPR units and the first four units will soon be operational in China, France and Finland,” Rossi said. \nRossi said the company is in talks with the government about alternative financing models for Sizewell C, and has been talking to a number of pension funds and financial institutions as potential third-party investors. \n“There is a lot of money out there looking for project investments,” he said. \nDirect government finance for the project might not be needed but a guaranteed price for electricity, as Hinkley receives, should be, Rossi said. \nHe added it was too early to say how much investment would be needed from third party institutions and whether they would enter at the construction stage or not, which is typically higher risk. \nPrevious EDF Energy chief Vincent de Rivaz said last year that Sizewell C could come online by 2031. \nRossi said the project does not currently have a timeline and although construction work could overlap with Hinkley Point C, it would not be at full capacity on both at the same time. Writing by Nina Chestney; Editing by Dale Hudson and David Evans", "external_links": [], "published": "2018-01-17T20:17:00.000+02:00", "crawled": "2018-01-17T21:01:14.010+02:00", "highlightTitle": ""}