{"organizations": [], "uuid": "a252e60ef17dd2b3e725c97ab79a7e305154435c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104974200-mckeon-powerlunch.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/stephen-mckeon-on-asset-based-tokenization.html", "country": "US", "domain_rank": 767, "title": "Stephen McKeon on asset-based tokenization", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-01-29T18:41:00.000+02:00", "replies_count": 0, "uuid": "a252e60ef17dd2b3e725c97ab79a7e305154435c"}, "author": "Eric Jackson", "url": "https://www.cnbc.com/2018/01/29/stephen-mckeon-on-asset-based-tokenization.html", "ord_in_thread": 0, "title": "Stephen McKeon on asset-based tokenization", "locations": [], "entities": {"persons": [{"name": "stephen mckeon", "sentiment": "negative"}, {"name": "eric jackson", "sentiment": "none"}], "locations": [{"name": "portland", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "university of oregon", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stephen McKeon is a professor of finance at the University of Oregon, and I first got to know him through a Medium post he wrote last August on asset-backed tokenization. A couple weeks ago, he was on CNBC's \"Power Lunch .\" I had a lot more questions in my own mind after that segment so I reached out to him and he kindly agreed to chat.\n(A podcast version of this discussion is also available here .)\nEric Jackson: How did you become interested in crypto assets?\nStephen McKeon: I'm a professor at the University of Oregon, and I've been here since 2011, but I've really been interested in tech my whole career. My first job after college was at an internet start-up in Silicon Valley, this was Web 1.0-era, so I've always followed tech to some degree.\nLike most people I didn't fully grasp the potential when I first heard about bitcoin. In 2012, I co-founded a drone software company with some students, and I remember our CEO went to a start-up poker night in Portland, and he came into the office the next day and was telling us about how you could only buy-in in bitcoin, and he had to buy some from one of the other guys there. And I remember thinking that was interesting on a variety of levels, but I was so busy with the drone company, and I was trying to get tenure at the university working on research, that I really didn't have time to dive in. It was about 2015 when I stepped back from the board as we did our second venture round, and that's when I really started to dig in and think more carefully about this space. I sort of fell down the rabbit hole, as they say.\nJackson: What's the right way to think of valuing cryptoassets today?\nMcKeon: I'm not someone who gives price targets, I'm more interested in the frameworks. We have a variety of tools to think about value, how might those apply.\nIn the case of a utility token, where the idea is it can be used for a digital good or service, you might approach it with something akin to a discounted cash flow analysis, where you estimate market size and how much they might capture, and you discount those flows back to today. Now there's a lot of challenges there obviously — how do you estimate the discount rate on these assets? — but that's the basic idea. I think in terms of the idea about price fluctuations and how much volatility we've seen, it has a lot to do with uncertainty. People have to remember that these are very early-stage projects, and we just haven't seen early-stage project valuation play out in public markets previously.\nBut if you talk to VCs, they see early-stage valuations fluctuate wildly as well, but it does it sort of behind closed doors in periodic financing rounds, like Friendster goes to zero and Facebook goes to a half-trillion. When they were early stage they probably weren't valued all that differently at three months old or six months old. The short answer is there's still so much uncertainty on a number of levels: adoption, regulation, scaling, the list goes on. ... I think when you begin to see the certainty subside along some of these dimensions you'll start to see the fluctuations begin to subside as well.\nJackson: Could you summarize the key idea of what is asset-backed tokenization and why you're interested in it and excited by it?\nMcKeon: I think the summary is that you can represent an ownership stake on any asset with a token, and by doing so, you relax certain frictions to trade. What I was detailing in the article is that one of the things we often think about as finance professors is liquidity, how much price impact is there when you try to trade something, what are the bid/ask spreads, and to the extent at which you can develop deeper markets by tokenizing ownership claims, you may be able to create greater liquidity.\nJackson: You made the point that tokens in and of themselves don't create more liquidity, it's just that they have the potential for private assets to be traded through a token mechanism with the promise of promoting greater liquidity.\nMcKeon The example that I used in the article is the b-cap token.\nSo this is Blockchain Capital, it's a VC fund, and VC funds are typically locked up for seven to ten years, relative illiquid assets. There are secondary markets, but they're generally illiquid. What they did is they segmented part of the fund and represented part of the ownership claims as tokens. When the Reg D lockup ends, which will be this April, I actually think they just announced that these are going to trade on a securities exchange. Investors will be free to buy and sell these, so certainly more liquidity than you'd experience in a traditional LP setup.\nJackson: One pushback I often hear from skeptics about the idea is that we have a mechanism today that would have allowed for the trading of private assets, whether it's a REIT in the commercial real estate context, or some secondary exchange program. Why will a blockchain-based approach work over time and be seen as more attractive with those tokens versus solutions that would have existed pre-blockchain?\nMcKeon: I'll start with REITs, that's one method to create fractional liquid ownership of real estate assets. You can almost think of it as a layer between the investor and the underlying asset. And similarly tokens could be thought of as a layer between the owner and the investor. You actually could have a multilayer ownership structure, where a fund uses a REIT as a legal structure and then tokenizes the REIT ownership claims. I think you're going to see some blended versions of old and new layers here in this first phase of development.\nIn the context of the REIT, let me draw an analogy with equities. How would you feel if you couldn't invest in an individual stock through the public markets, you could only invest in equities through a mutual fund, and each stock could only be held by a single fund, or maybe a small handful of funds? In other words if you wanted exposure to Facebook, you also had to buy a fund that also held Cisco, Microsoft, and McDonalds, that's sort of what you've got in a REIT. These are typically baskets of real estate assets, and it works, but we can do more.\nWhat if transaction costs were reduced to the point where it was economically feasible for individual buildings to effectively go public? So I guess the answer to why real estate would move to a blockchain-based system of record is the same answer to why any financial asset would move to blockchain-based ownership claims. And the answer again comes back to this idea of relaxing frictions to trade. Transaction costs are substantially reduced, there's immediate trade settlement, ownership is highly divisible, self-custody of assets is possible, value transfers are programmable, shared ownership models become feasible, markets never close, liquidity may be improved, and there's greater access to international investors. So I think there's a variety of reasons why one might view a token-based back-end as superior to our current clearinghouse systems.\nJackson: Even in the case of individual public stocks, one thing that still happens today is I buy a stock through my prime brokerage account today but it doesn't clear until 1, 2 or 3 days from now.\nMcKeon: That's right. Trade settlement is going to be near immediate. The other thing that a lot of people are talking about are these kind of decentralized exchanges, which are sort of in their infancy. One of the issues with the exchanges is you basically relinquish control, you give your private keys to them in order to trade on the platform. And so these exchanges are potentially going to solve that issue.\nJackson: In this scenario, we keep our own private keys.\nMcKeon: That's right. So you would not be relinquishing control of your private keys. You would retain possession of your assets and then the platform facilitates trading without actually taking custody of the assets.\nJackson: I would imagine that the New York Stock Exchanges of the world, or anyone else that has a vested interest in the status quo, would fight against this type of scenario that you've discussed.\nMcKeon: The NYSE fighting the rise of tokenized securities reminds me of the taxi industry fighting the rise of Uber. I'm not sure it would be any more successful. You have to ask how would they fight it? Maybe you could slow it down a little bit through some regulatory vector; that's a strategy that was employed by the taxi industry. Eventually the new entrants figure out how to comply with the rules, so that's not a permanent barrier. I don't think they're going to fight it. I think they'll eventually adopt it, and I think initially maybe you could have a sort of blended solution where some of these legacy systems remain in place and blockchain is like another layer on top of it. My guess is that they're going to be investing in it. I'd be shocked if they're not already doing so.\nThere are certainly governance risks on the horizon for this vision. What I mentioned in the post is this concept that, if you have one owner of a building, they typically have an economic incentive to maintain the property. Now say you have a million owners, and they each have one dollar of ownership; nobody individually has the incentive to maintain the building because the cost of doing so would exceed the value of their ownership. So you need some sort of system for collective action where the property continues to be maintained. The hard part is what do those look like? Is it a straight vote of token holders?\nThere's this adage \"two wolves and a sheep vote on what's for dinner,\" so you have to have some method to avoid expropriation of non-controlling owners. These are new issues for tokens, but they're not new issues generally. Economists have been thinking about corporate governance for a long time, and maybe it involves some sort of a board, maybe it involves a multiple-branch system. I think the other major governance piece is disclosure. There's no question that one of the things the SEC requires is disclosure, so thinking about how that's going to work... maybe it's going to look like the blockchain loop platform for the Blockchain Capital tokens, there's a lot of activity around those ideas right now.\nJackson: So your idea about buying interests in some big VC fund. Over time, won't a secondary effect be shorter lockups, and more pushback from LPs: \"Why do I have to sign up for seven to 10 years?\"\nMcKeon: That may be true. It will put pressure on the traditional method.\nJackson: Won't the VCs wring their hands and say, \"Oh, gosh, this is not the way I grew up in VC, and we have to make these long-term bets, and now all these LPs are promoting short-termism.\"\nMcKeon: You know what's interesting, though, is that the token model, it doesn't prevent them from making long-term bets. That's kind of the beauty of it, that you can issue the tokens, the VC gets the money, they can invest it in illiquid securities for five, seven, 10 years. Meanwhile the interests in the fund are freely trading in the secondary market, but they're not being redeemed, so it's not like the VC has to pay out before they would under any sort of normal scenario. I think the issue is the one you mentioned, those that want to maintain the traditional model will be put under greater and greater pressure potentially by LPs who want that kind of liquidity.\nJackson: The Carolina Panthers are now on the market in the NFL, and you've had a bunch of athletes come forward and say, \"I want to buy this team.\" I suspect the selling price is going to be somewhere around $2.5 billion. I suspect there are few athletes that are going to be able to write that kind of check. Is it conceivable that we could see 100, 200, 1,000, Green Bay Packers-type of owners of sports teams in the future, or is there going to be some privately transacted deals that remain off-market even in this blockchain world?\nEzra Shaw | Getty Images Cam Newton #1 of the Carolina Panthers points to the crowd in the fourth quarter of their game against the San Francisco 49ers at Levi's Stadium on September 10, 2017 in Santa Clara, California. McKeon: There's a difference between what's theoretically possible, and what's actually feasible. It's theoretically possible to represent any ownership claim with a token, but I'm not sure it's actually feasible in the NFL example you provided because I think the other owners would have to approve it. The team that does come to mind is the Packers. I don't like talking about the Packers because I grew up in Minneapolis, but they do have the shareholder and board structure. And in some ways I think it bears some resemblance to the utility token in the sense that it's an ecosystem where if you have a share of the stock it provides access to exclusive goods and services, like you can attend the owners meeting, but there's no cash flow. And you're sort of part of a network of owners with shared beliefs. Maybe it would be perfect for a token, but my understanding is in the NFL you have to have a single owner with one-third ownership, and maybe a small handful of others. I think the Packers actually have an exemption from this rule, because the structure was grandfathered in.\nJackson: From a regulatory perspective, are you expecting there to be some sort of big action by the SEC?\nMcKeon: So far the SEC has been very targeted in their action, so they have taken action against some projects they view to be some type of fraud, or some sort of clear violation of security laws. They gave guidance.\nI think they would like the industry to start doing more self-regulation. It's hard to say whether there will be some sort of widespread crackdown. You are seeing the statements from them getting increasingly targeted towards making sure that people are following the rules. There was just a statement that was sort of targeted towards securities attorneys and the advice that they're giving these projects. One of their mandates is investor protection... the other mandate is capital formation, so these are a fine line to walk. How do you regulate it in a responsible way that also doesn't kill innovation or make a move overseas? So it's a real challenge.\nJackson: How would you rank order the types of private assets that are going to migrate first to the blockchain?\nMcKeon: I think you're going to see commercial real estate this year. You've already seen VC, so you're probably going to see some more of those. Fine art is coming. Something like residential real estate is going to take longer, because there are a lot of complexities.\nCommentary by Eric Jackson. Sign up for Eric's monthly Tech & Media Email and his Podcast . You can follow Eric on Twitter @ericjackson .\nshow chapters Traditional asset tokens: Crypto's next big thing 3:07 PM ET Mon, 8 Jan 2018 | 03:09", "external_links": [], "published": "2018-01-29T18:41:00.000+02:00", "crawled": "2018-01-29T18:49:26.017+02:00", "highlightTitle": ""}