{"organizations": [], "uuid": "0af266a265869281841cff0dedbe0ca26a8e4fe9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-first-mid-illinois-bancshares-inc-announces-fourth-quarter-2017-results.html", "country": "US", "domain_rank": 767, "title": "First Mid-Illinois Bancshares, Inc. Announces Fourth Quarter 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:30:00.000+02:00", "replies_count": 0, "uuid": "0af266a265869281841cff0dedbe0ca26a8e4fe9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-first-mid-illinois-bancshares-inc-announces-fourth-quarter-2017-results.html", "ord_in_thread": 0, "title": "First Mid-Illinois Bancshares, Inc. Announces Fourth Quarter 2017 Results", "locations": [], "entities": {"persons": [{"name": "joe dively", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "mattoon", "sentiment": "none"}], "organizations": [{"name": "first mid-illinois bancshares, inc.", "sentiment": "neutral"}, {"name": "first mid-illinois bancshares, inc", "sentiment": "neutral"}, {"name": "acquisition of first banctrust corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MATTOON, Ill., First Mid-Illinois Bancshares, Inc. (NASDAQ:FMBH) (the “Company”) today announced its financial results for the quarter and full year period ended December 31, 2017.\nFourth Quarter Highlights\nRecord Fourth Quarter Loan Growth of $71.9 million, or 3.9% Announced the Acquisition of First BancTrust Corporation on December 11, 2017 Net Income of $4.6 million, or $0.37 Diluted Earnings per Share Deferred Tax Asset Impairment of $1.4 million, or $0.11 per Share\n“I am pleased with our strong year of operating and financial results in what was a very successful 2017,” said Joe Dively, Chairman and Chief Executive Officer. “We ended the year with a record quarter of loan growth providing a great start to 2018. Similar to most in the industry, our fourth quarter net income was negatively impacted by a deferred tax asset impairment tied to the new tax law that was signed in December. In addition, the strong loan growth, combined with the impairment of two credits, contributed to an elevated provision expense. Looking ahead to 2018, the outlook for growth is positive for both organic and M&A activity.”\n“The announcement of the acquisition of First BancTrust Corporation (“First Bank”) continues our strategic initiative to deepen and expand our presence in attractive markets and increase shareholder value. First Bank is a highly respected community bank in the Champaign-Urbana and surrounding markets and is a great cultural fit with First Mid. We see significant benefits with the opportunities to introduce new services to First Bank’s customers and a higher combined legal lending limit. I’m excited about what lies ahead for the combined organizations and how we can be better together,” Dively concluded.\nFirst BancTrust Corp. Acquisition Update\nOn December 11, 2017, the Company announced the acquisition of First Bank. First Bank is a $466 million asset financial services holding company headquartered in Champaign, IL. Subject to regulatory approvals, the Company currently expects to close on the acquisition in the second quarter with a merger of the banks in the third quarter. The Company has submitted all of its initial regulatory applications and filed the registration statement related to the acquisition on January 22, 2018.\nNet Interest Income\nNet interest income for the fourth quarter of 2017 increased by $0.6 million, or 2.6% compared to the third quarter of 2017. The increase was primarily driven by $0.8 million in accelerated accretion income recognized in the fourth quarter versus $0.1 million in the third quarter. Regular accretion tied to the First Clover Leaf acquisition was $0.5 million in each quarter. Excluding accretion, increases to the loan income were offset by higher deposit costs and lower investment income tied to a lower balance in the portfolio.\nIn comparison to the fourth quarter of 2016, net interest income increased by $2.0 million, or 9.1%. The increase was primarily attributable to the growth in earning assets and increased interest rates, which were partially offset by higher deposit costs.\nNet Interest Margin\nNet interest margin, on a tax equivalent basis, was 3.72% for the fourth quarter compared to 3.68% in the prior quarter and 3.43% in the fourth quarter last year. The year-over-year increase in the ratio was due to higher yields on loans and investments, which outpaced the increase in cost of funds. In addition, accretion income associated with the First Clover Leaf acquisition helped drive the margin higher. On a full year basis, the net interest margin for 2017 was 3.70% compared to 3.39% for 2016.\nLoan Portfolio\nTotal loans increased by $71.9 million, or 3.9%, in the quarter and ended at $1.94 billion compared to $1.87 billion at the end of the prior quarter. The increase was mostly in the categories of commercial real estate and construction and land development. Loans increased by $113.5 million, or 6.2% for the year.\nThe Company has launched a loan production office in the Indianapolis, Indiana metro market and is off to a strong start. This step continues the strategic focus of the organization on maintaining a diversified geographic footprint and loan portfolio.\nAsset Quality\nAt December 31, 2017, nonperforming loans were 0.90% of total loans compared to 1.06% at September 30, 2017, allowance for loan losses were 1.03% of total loans compared to 1.00%, and the allowance for loan losses to non-performing loans were 114.1% versus 93.9%. Non-performing loans were $17.5 million, which was a decrease of $2.3 million versus the prior quarter.\nNet charge-offs were $1.0 million during the fourth quarter compared to $1.1 million in the third quarter. The fourth quarter number included one credit in the construction industry that was charged off for a total of $0.9 million. In addition, the company recorded an impairment of approximately $0.5 million on a financial services credit. The Company recorded a provision for loan losses of $2.4 million during the fourth quarter compared to $1.5 million during the third quarter of 2017 and $0.9 million in the fourth quarter of last year.\nDeposits\nTotal deposits ended the quarter at $2.27 billion, which represented an increase of $57.2 million from the prior quarter and a decrease of $55.2 million from the same quarter last year. The Company’s average rate on cost of funds was 0.29% for the quarter compared to 0.28% in the third quarter and 0.23% in the fourth quarter of 2016. The Company’s core deposit franchise continues to be a differentiator and strategic advantage for First Mid.\nNoninterest Income\nNoninterest income for the fourth quarter of 2017 was $7.2 million compared to $7.7 million in the third quarter. The previous quarter included a $0.5 million benefit from a BOLI claim. In addition, the fourth quarter securities gains were lower by $0.2 million compared to the prior quarter. Excluding these items, noninterest income increased in the fourth quarter by $0.2 million with increases across multiple categories. In comparison to the fourth quarter of 2016, noninterest income increased $0.3 million. The Company has continued to gain momentum in the former First Clover Leaf markets with its cross selling initiatives in the insurance and wealth management divisions.\nNoninterest Expenses\nNoninterest expense for the fourth quarter totaled $19.2 million, or $1.3 million higher than the previous quarter. During the quarter, the Company recorded a $0.5 million loss on the sale of a former First Clover Leaf credit. The quarter also included approximately $0.4 million of additional stock compensation expense for the acceleration of shares pursuant to the 8-K that was filed on December 19, 2017. In addition, the quarter included $0.1 million in acquisition related costs.\nNoninterest expense increased by $2.3 million when compared to the fourth quarter of 2016 primarily due to a combination of higher legal and professional fees, the loss on the sale of a loan and accelerated stock compensation expense. The Company’s efficiency ratio, on a tax equivalent basis, for the fourth quarter 2017 was 59.1% compared to 55.7% for the same period last year.\nRegulatory Capital Levels\nThe Company’s capital levels remained strong above the “well capitalized” levels and ended the period as follows:\nTotal capital to risk-weighted assets 12.70%\nTier 1 capital to risk-weighted assets 11.83%\nCommon equity tier 1 capital to risk-weighted assets 10.78%\nLeverage ratio 9.91%\nThe capital ratios declined in the fourth quarter due to the recognition of the DTA and the strong loan growth, which drove a higher capital allocation on risk-weighted assets.\nCapital Raise\nUnder the previously announced ‘at-the-market’ equity offering, during the quarter ended December 31, 2017, the Company sold 3,400 common shares at a weighted average price of approximately $36.97, representing gross proceeds of $0.1 million and net proceeds of $0.1 million.\nAbout First Mid-Illinois Bancshares, Inc.: First Mid-Illinois Bancshares, Inc. is the parent company of First Mid-Illinois Bank & Trust, N.A. (“First Mid Bank”), Mid-Illinois Data Services, Inc., and First Mid Insurance Group. Our mission is to fulfill the financial needs of our communities with exceptional personal service, professionalism and integrity, and deliver meaningful value and results for customers and shareholders.\nFirst Mid Bank was first chartered in 1865 and has since grown into a $2.8 billion community-focused organization that provides financial services through a network of 52 banking centers in 37 Illinois and Missouri communities. More information about the Company is available on our website at www.firstmid.com . Our stock is traded in The NASDAQ Stock Market LLC under the ticker symbol “FMBH”.\nNon-GAAP Measures: In addition to reports presented in accordance with generally accepted accounting principles (“GAAP”), this release contains certain non-GAAP financial measures. The Company believes that such non-GAAP financial measures provide investors with information useful in understanding the Company’s financial performance. Readers of this release, however, are urged to review these non-GAAP financial measures in conjunction with the GAAP results as reported. These non-GAAP financial measures are detailed as supplemental tables and include “Net Interest Margin, tax equivalent,” Tangible Book Value per Common Share,” and “Common Equity Tier 1 Capital to Risk Weighted Assets”. While the Company believes these non-GAAP financial measures provide investors with a broader understanding of the capital adequacy, funding profile and financial trends of the Company, this information should be considered as supplemental in nature and not as a substitute to the related financial information prepared in accordance with GAAP. These non-GAAP financial measures may also differ from the similar measures presented by other companies.\nForward Looking Statements: This document may contain certain forward-looking statements about First Mid-Illinois Bancshares, Inc. (“First Mid”) and First BancTrust Corporation (“First Bank”), such as discussions of First Mid’s and First Bank’s pricing and fee trends, credit quality and outlook, liquidity, new business results, expansion plans, anticipated expenses and planned schedules. First Mid and First Bank intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1955. Forward-looking statements, which are based on certain assumptions and describe future plans, strategies and expectations of First Mid and First Bank, are identified by use of the words “believe,” “expect,” “intend,” “anticipate,” “estimate,” “project,” or similar expressions. Actual results could differ materially from the results indicated by these statements because the realization of those results is subject to many risks and uncertainties, including, among other things, the possibility that any of the anticipated benefits of the proposed transactions between First Mid and First Bank will not be realized or will not be realized within the expected time period; the risk that integration of the operations of First Bank with First Mid will be materially delayed or will be more costly or difficult than expected; the inability to complete the proposed transactions due to the failure to obtain the required stockholder approval; the failure to satisfy other conditions to completion of the proposed transactions, including receipt of required regulatory and other approvals; the failure of the proposed transactions to close for any other reason; the effect of the announcement of the transaction on customer relationships and operating results; the possibility that the transaction may be more expensive to complete than anticipated, including as a result of unexpected factors or events; changes in interest rates; general economic conditions and those in the market areas of First Mid and First Bank; legislative/regulatory changes; monetary and fiscal policies of the U.S. Government, including policies of the U.S. Treasury and the Federal Reserve Board; the quality or composition of First Mid’s and First Bank’s loan or investment portfolios and the valuation of those investment portfolios; demand for loan products; deposit flows; competition, demand for financial services in the market areas of First Mid and First Bank; and accounting principles, policies and guidelines. Additional information concerning First Mid, including additional factors and risks that could materially affect First Mid’s financial results, are included in First Mid’s filings with the Securities and Exchange Commission (the “SEC”), including its Annual Reports on Form 10-K. Forward-looking statements speak only as of the date they are made. Except as required under the federal securities laws or the rules and regulations of the SEC, we do not undertake any obligation to update or review any forward-looking information, whether as a result of new information, future events or otherwise.\nImportant Information about the Merger and Additional Information: First Mid filed a registration statement on Form S-4 with the SEC on January 22, 2018, in connection with the proposed transaction. The registration statement includes a proxy statement of First Bank that also constitutes a prospectus of First Mid. Investors in First Bank are urged to read the proxy statement/prospectus, which contains important information, including detailed risk factors, and all amendments thereto when they become available. The proxy statement/prospectus and other documents which will be filed by First Mid with the SEC will be available free of charge at the SEC’s website, www.sec.gov , or by directing a request to First Mid-Illinois Bancshares, P.O. Box 499, Mattoon, IL 61938, Attention: Investor Relations; or to First BancTrust Corporation, 114 West Church Street, Champaign, IL 61824, Attention: Investor Relations. The final proxy statement/prospectus will be mailed to the stockholders of First Bank.\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction.\nParticipants in the Solicitation: First Mid and First Bank, and certain of their respective directors, executive officers and other members of management and employees are participants in the solicitation of proxies in connection with the proposed transactions. Information about the directors and executive officers of First Mid is set forth in the proxy statement for its 2017 annual meeting of stockholders, which was filed with the SEC on March 14, 2017. Information about the directors and executive officers of First Bank is set forth in its proxy statement for its 2017 annual meeting of stockholders, which is available on its website, and in the proxy statement/prospectus that was filed with the SEC on January 22, 2018. These documents can be obtained free of charge from the sources provided above. Investors may obtain additional information regarding the interests of such participants in the proposed transactions by reading the proxy statement/prospectus for such proposed transactions, and all amendments thereto when they become available.\nInvestor Contact: Aaron Holt\nVP, Shareholder Relations\n217-258-0463\naholt@firstmid.com\n– Tables Follow –\nFIRST MID-ILLINOIS BANCSHARES, INC. Condensed Consolidated Balance Sheets (In thousands, unaudited) As of December 31, September 30 December 31, 2017 2017 2016 Assets Cash and cash equivalents $ 88,879 $ 69,643 $ 175,902 Investment securities 649,596 692,195 708,722 Loans (including loans held for sale) 1,939,501 1,867,562 1,825,992 Less allowance for loan losses (19,977 ) (18,589 ) (16,753 ) Net loans 1,919,524 1,848,973 1,809,239 Premises and equipment, net 38,266 38,638 40,292 Goodwill and intangibles, net 70,829 71,331 70,623 Bank owned life insurance 41,883 41,601 41,318 Other assets 32,562 32,075 38,439 Total assets $ 2,841,539 $ 2,794,456 $ 2,884,535 Liabilities and Stockholders' Equity Deposits: Non-interest bearing $ 480,283 $ 430,036 $ 471,206 Interest bearing 1,794,356 1,787,441 1,858,681 Total deposits 2,274,639 2,217,477 2,329,887 Repurchase agreement with customers 155,388 116,360 185,763 Other borrowings 70,351 118,302 58,157 Junior subordinated debentures 24,000 23,980 23,917 Other liabilities 9,197 6,906 6,138 Total liabilities 2,533,575 2,483,025 2,603,862 Total stockholders' equity 307,964 311,431 280,673 Total liabilities and stockholders' equity $ 2,841,539 $ 2,794,456 $ 2,884,535\nFIRST MID-ILLINOIS BANCSHARES, INC. Condensed Consolidated Statements of Income (In thousands, except per share data, unaudited) Three Months Ended Twelve Months Ended December 31 December 31 2017 2016 2017 2016 Interest income: Interest and fees on loans $ 21,333 $ 19,456 $ 82,670 $ 61,952 Interest on investment securities 3,897 3,392 16,482 13,014 Interest on federal funds sold & other deposits 83 163 403 530 Total interest income 25,313 23,011 99,555 75,496 Interest expense: Interest on deposits 1,155 936 3,995 2,713 Interest on securities sold under agreements to repurchase 44 34 181 96 Interest on other borrowings 392 301 1,379 811 Interest on subordinated debt 247 216 927 672 Total interest expense 1,838 1,487 6,482 4,292 Net interest income 23,475 21,524 93,073 71,204 Provision for loan losses 2,411 899 7,462 2,826 Net interest income after provision for loan 21,064 20,625 85,611 68,378 Non-interest income: Trust revenues 1,048 968 3,744 3,517 Brokerage commissions 611 468 2,161 1,908 Insurance commissions 724 646 3,872 3,452 Service charges 1,760 1,814 6,920 6,791 Securities gains, net 27 62 616 1,192 Mortgage banking revenues 309 457 1,184 1,172 ATM/debit card revenue 1,667 1,586 6,495 6,004 Other 1,064 910 5,344 2,876 Total non-interest income 7,210 6,911 30,336 26,912 Non-interest expense: Salaries and employee benefits 10,071 9,061 39,756 32,354 Net occupancy and equipment expense 3,218 3,029 12,596 11,418 Net other real estate owned (income) expense 30 37 560 60 FDIC insurance 226 125 905 966 Amortization of intangible assets 502 597 2,153 1,909 Stationary and supplies 185 203 724 815 Legal and professional expense 1,291 621 3,887 3,035 Marketing and donations 447 359 1,356 1,845 Other 3,182 2,844 12,284 9,108 Total non-interest expense 19,152 16,876 74,221 61,510 Income before income taxes 9,122 10,660 41,726 33,780 Income taxes 4,497 3,863 15,042 11,940 Net income $ 4,625 $ 6,797 $ 26,684 $ 21,840 Per Share Information Basic earnings per common share $ 0.37 $ 0.55 $ 2.13 $ 2.07 Diluted earnings per common share 0.37 0.55 2.13 2.05 Weighted average shares outstanding 12,628,828 12,461,870 12,531,659 10,149,099 Diluted weighted average shares outstanding 12,634,560 12,473,624 12,536,534 10,663,710\nFIRST MID-ILLINOIS BANCSHARES, INC. Consolidated Financial Highlights and Ratios (Dollars in thousands, except per share data) (Unaudited) As of and for the Quarter Ended December 31, September 30, June 30 March 31 December 31, 2017 2017 2017 2017 2016 Loan Portfolio Construction and land development $ 107,594 $ 77,179 $ 68,681 $ 58,304 $ 49,104 Farm loans 127,183 126,096 123,420 123,061 126,108 1-4 Family residential properties 293,667 301,897 310,522 319,713 326,415 Multifamily residential properties 61,798 72,323 72,492 74,714 83,200 Commercial real estate 681,757 647,184 632,492 624,372 630,135 Loans secured by real estate 1,271,999 1,224,679 1,207,607 1,200,164 1,214,962 Agricultural loans 86,631 81,383 79,759 76,757 86,685 Commercial and industrial loans 444,263 443,473 421,280 400,810 409,033 Consumer loans 29,749 30,074 32,814 34,962 38,028 All other loans 106,859 87,953 84,174 82,969 77,284 Total loans 1,939,501 1,867,562 1,825,634 1,795,662 1,825,992 Deposit Portfolio Non-interest bearing demand deposits $ 480,283 $ 430,036 $ 425,344 $ 456,037 $ 471,206 Interest bearing demand deposits 700,376 678,302 714,918 718,699 716,204 Savings deposits 359,065 364,277 368,220 372,815 356,740 Money Market 390,880 423,486 450,685 440,551 432,656 Time deposits 344,035 321,376 330,239 341,427 353,081 Total deposits 2,274,639 2,217,477 2,289,406 2,329,529 2,329,887 Asset Quality Non-performing loans $ 17,513 $ 19,788 $ 17,125 $ 27,652 $ 18,241 Non-performing assets 20,347 22,051 21,559 30,085 20,226 Net charge-offs 1,022 1,109 1,477 629 307 Allowance for loan losses to non-performing loans 114.08 % 93.94 % 106.33 % 64.54 % 91.84 % Allowance for loan losses to total loans outstanding 1.03 % 1.00 % 1.00 % 0.99 % 0.92 % Nonperforming loans to total loans 0.90 % 1.06 % 0.94 % 1.54 % 1.00 % Nonperforming assets to total assets 0.72 % 0.79 % 0.76 % 1.06 % 0.70 % Common Share Data Common shares outstanding 12,660,748 12,618,026 12,505,873 12,483,787 12,470,999 Book value per common share $ 24.32 $ 24.68 $ 24.06 $ 23.29 $ 22.51 Tangible book value per common share $ 18.73 $ 19.03 $ 18.50 $ 17.68 $ 16.84 Market price of stock $ 38.54 $ 38.40 $ 34.10 $ 33.84 $ 34.00 Key Performance Ratios and Metrics End of period earning assets $ 2,602,578 $ 2,566,809 $ 2,604,505 $ 2,624,399 $ 2,652,628 Average earning assets 2,581,277 2,605,652 2,615,792 2,633,227 2,590,488 Average rate on average earning assets (tax equivalent) 4.01 % 3.96 % 4.08 % 3.85 % 3.66 % Average rate on cost of funds 0.29 % 0.28 % 0.24 % 0.22 % 0.23 % Net interest margin (tax equivalent) 3.72 % 3.68 % 3.84 % 3.63 % 3.43 % Return on average assets 0.66 % 1.08 % 1.16 % 0.88 % 0.97 % Return on average common equity 5.95 % 9.95 % 11.11 % 8.77 % 9.22 % Efficiency ratio (tax equivalent) 1 59.08 % 54.54 % 53.17 % 59.90 % 55.67 % Full-time equivalent employees 592 584 590 590 598 1 Represents non-interest expense divided by the sum of fully tax equivalent net interest income and non-interest income. Non-interest expense adjustments exclude foreclosed property expense and amortization of intangibles. Non-interest income includes tax equivalent adjustments and non-interest income excludes gains and losses on the sale of investment securities.\nFIRST MID-ILLINOIS BANCSHARES, INC. Reconciliation of Non-GAAP Financial Measures (In thousands, unaudited) As of and for the Quarter Ended December 31, September 30, June 30 March 31 December 31, 2017 2017 2017 2017 2016 Net interest income as reported $ 23,475 $ 22,873 $ 23,953 $ 22,772 $ 21,524 Net interest income, (tax equivalent) 24,332 23,729 24,844 23,620 22,324 Average earning assets 2,581,277 2,605,652 2,615,792 2,633,227 2,590,488 Net interest margin (tax equivalent) 1 3.72 % 3.68 % 3.84 % 3.63 % 3.43 % Common stockholder's equity $ 307,964 $ 311,431 $ 300,891 $ 290,738 $ 280,673 Goodwill and intangibles, net 70,829 71,331 69,517 70,076 70,623 Common shares outstanding 12,661 12,618 12,506 12,484 12,471 Tangible Book Value per common share $ 18.73 $ 19.03 $ 18.50 $ 17.68 $ 16.84 Common equity tier 1 capital $ 246,798 $ 247,104 $ 237,764 $ 238,102 $ 229,341 Risk weighted assets 2,290,253 2,184,812 2,185,041 2,171,056 2,111,787 Common equity tier 1 capital to risk weighted assets 2 10.78 % 11.31 % 10.88 % 10.97 % 10.86 % 1 Annualized and calculated on a tax equivalent basis where interest earned on tax-exempt securities and loans is adjusted to an amount comparable to interest subject to normal income taxes assuming a federal tax rate of 35% and includes the impact of non-interest bearing funds. 2 Defined as total common equity adjusted for gains/(losses) less goodwill and intangibles divided by risk weighted assets as of period end.\nSource:First Mid-Illinois Bancshares, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=Yf6umPDXyxi3XKATCeuKlgRrOebEwDlkgl-2CBO0xXcQMpH3lOOu7AXs95umLx4sjRzKDxM5CbVUXs8z0VYTzlriH-BDW3MPV1ZyMpJ4lpo=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/1f9d3745-1840-4eef-afd5-8c6d86f3ce27"], "published": "2018-01-25T16:30:00.000+02:00", "crawled": "2018-01-25T18:16:52.012+02:00", "highlightTitle": ""}