{"organizations": [], "uuid": "6de2371d31f7667a6bcea26e5d44b0bc584f27f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-mydx-appoints-dr-jessica-peatross-as-chief-medical-officer.html", "country": "US", "domain_rank": 767, "title": "MyDx Appoints Dr. Jessica Peatross As Chief Medical Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.18, "site_type": "news", "published": "2018-01-11T17:00:00.000+02:00", "replies_count": 0, "uuid": "6de2371d31f7667a6bcea26e5d44b0bc584f27f5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-mydx-appoints-dr-jessica-peatross-as-chief-medical-officer.html", "ord_in_thread": 0, "title": "MyDx Appoints Dr. Jessica Peatross As Chief Medical Officer", "locations": [], "entities": {"persons": [{"name": "jessica peatross", "sentiment": "negative"}, {"name": "gerson", "sentiment": "none"}, {"name": "jess", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "mydx, inc.", "sentiment": "neutral"}, {"name": "mydx", "sentiment": "none"}, {"name": "clinical research initiatives", "sentiment": "none"}, {"name": "ky) internal medicine", "sentiment": "none"}, {"name": "university of louisville", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 11, 2018 /PRNewswire/ -- MyDx, Inc. (OTC: MYDX), a science and technology company and creator of MyDx ® (My Diagnostic), the first multi-use handheld chemical analyzer designed for Cannabis professionals and retail consumers to correlate the chemical profile of cannabis with how it makes them feel and which ailments it alleviates, today announced it has recruited Dr. Jessica Peatross (Dr. Jess) as its Chief Medical Officer. Dr. Jess will lead the Clinical Research Initiatives that MyDx expects to begin soon as well as support formulation services offered to MyDx360 Customers.\nDr. Jessica Peatross is a western trained, board certified medical doctor and Gerson Therapy practitioner who began her journey into healing in 2009 when she graduated from the University of Louisville (KY) Internal Medicine residency program. For 6 years, Dr. Jess worked as a traditional doctor supporting patients in a level 1 trauma center, until she discovered that the mainstream prescription drug based methods of treating people were not working for her patients.\nIn 2014, Dr. Jess shifted her focus to practicing in the functional medicine field to get to the root cause of disease so it can be treated more effectively using natural alternatives. She has continued this work with prestigious medical practices including Optimal Health and Wellness and Whitiker Wellness , and is currently seeing her patients in San Diego's premiere Nourish Medical Center . Dr. Jess is also certified in stem cell therapy and has prescribed cannabis to her patients throughout her practice. Finally, Dr. Jess owns and operates an organically formulated nutraceutical line of products tailored to treating various chronic symptoms and illnesses which can be found on DrJess.com .\n\"In my 3.5 years as a Cannabis doctor, I have seen 8 out of 10 of my patients who are on narcotics, benzodiazepenes, sleep aids, and antidepressants wean off their medication with the proper medicinal ratio of THC to CBD, as well as medical guidance. What I am hopeful for is that the Cannabis industry can enlighten patients about an alternative way to heal, compared to traditional prescription medications. This may include herbs, minerals, vitamins, diet, sleep and lifestyle changes. Lifestyle changes and diet, specifically avoiding pesticides, cannot be understated. Surprisingly, herbs can often heal in the same fashion as pharmaceutical drugs without the side effects. And cannabis is no exception,\" stated Dr. Jessica Peatross, Chief Medical Officer of MyDx.\n\"We are very fortunate to have Dr. Peatross, a reputable and seasoned medical doctor who is passionate about teaching people how to be their own best doctor TM by educating themselves and listening to their body, join the MyDx executive team. I personally look forward to working closely with Dr. Jess to help people find relief by bridging the gap between Western and Eastern medicine,\" continued Daniel Yazbeck, former Scientist at Pfizer Pharmaceuticals and now Chairman & CEO of MyDx. \"We are at the leading edge of new advancements towards greener, healthier medicine to address ailments such as pain, anxiety and insomnia. Dr. Jess is the perfect partner to help us discover new therapies that are derived from natural plants that we can offer to our MyDx360 customers as well as help us execute on clinical trials we expect to carry out to validate our crowdsourced formulations,\" concluded Mr. Yazbeck.\nAs the MyDx team expands its service offering, management anticipates that Dr. Jess will be able to offer doctor consultation for MyDx customers through the MyDx App, including the possibility of writing medical cannabis prescriptions in all legal states.\nTo learn more about the cannabis industry and MyDx, please visit www.meetmydx.com .\nTo learn more about Dr. Jess. please visit www.drjess.com .\nTo learn more about MyDx's BioPharmaceutical Division, please visit www.mydxlife.com/biopharma .\nTo learn more about the MyDx360 services, please visit www.mydxlife.com/mydx360 .\nAbout MyDx, Inc.\nMyDx, Inc. (OTC:MYDX) is a chemical detection and sensor technology company based in San Diego, California whose mission is to help people Trust & Verify ® what they put into their minds and bodies. The Company's first product, MyDx ® , also known as \"My Diagnostic\", is a patented multiuse hand-held chemical analyzer designed to help consumers and professional test for pesticides in food, chemicals in water, toxins in the air, and the safety and potency of cannabis samples, which is the initial focus of through the CannaDx TM application. CannaDx users have submitted over 40,000 crowdsourced datapoints revealing the chemical profile of the cannabis they are consuming and how its making them feel which feeds a data analytics platform, a SaaS business, as well as the biopharmaceutical division of MyDx. The company is committed to addressing areas of critical national need to promote public safety, transparency and regulation in the various markets we serve and hence its more immediate mission is to continue to develop smart devices as part of an ecosystem that crowdsources consumer generated preclinical data to drive innovation in the cannabis industry. please visit www.mydxlife.com .\nForward-Looking Statements\nThis news release contains \"forward-looking statements\" as that term is defined in Section 27(a) of the Securities Act of 1933, as amended, and Section 21(e) of the Securities Exchange Act of 1934, as amended. Statements may contain certain forward-looking statements pertaining to future anticipated or projected plans, performance and developments, as well as other statements relating to future operations and results. Any statements in this press release that are not statements of historical fact may be considered to be forward-looking statements. Words such as \"may,\" \"will,\" \"expect,\" \"believe,\" \"anticipate,\" \"estimate,\" \"intends,\" \"goal,\" \"objective,\" \"seek,\" \"attempt,\" or variations of these or similar words, identify forward-looking statements. These forward-looking statements by their nature are estimates of future results only and involve substantial risks and uncertainties, including but not limited to risks associated with the uncertainty of future financial results, additional financing requirements, development of new products, our ability to complete our product testing and launch our product commercially, the acceptance of our product in the marketplace, the uncertainty of the laws and regulations relating to cannabis, the impact of competitive products or pricing, technological changes, the effect of economic conditions and other uncertainties detailed from time to time in our reports filed with the Securities and Exchange Commission, available at http://ir.mydxlife.com/all-sec-filings or www.sec.gov .\nInvestor Contact:\nMyDx Shareholder Communications\n800.814.4550 ext. 4\ninfo@mydxlife.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/mydx-appoints-dr-jessica-peatross-as-chief-medical-officer-300581260.html\nSOURCE MyDx, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=G88egTFjt_WXAWWPKcr84Z18omETPBuHYz6uDvwaVS6H0UJyYUWqzsBs0Tulg3kf2AM79HfAmwNQ0TAZQX2aVg==", "http://opthealthwellness.com/jessica-peatross/", "http://whitakerwellness.com/about-us/medical-staff/", "http://www.mydxlife.com/", "http://www.mydxlife.com/biopharma", "https://www.nourishmedicalcenter.com/our-team/dr-jessica-peatross/", "http://www.drjess.com/", "http://www.mydxlife.com/mydx360", "https://www.globenewswire.com/Tracker?data=yV5yldby8eq_B2a6snFikL3lyGwBt5dKZrNUyBYJ-53gU5YuUC15ZQWS_DmBgms_wti47mzWpfbNkWjNWoo-Jhf7MdZj6sW1atpKiTTPfA1sEpld1adPRJppbEV0v7-QzHzPtwHm4iY6C27rhojrpxcXpHS4t_wJ65L2PVMB9Z4QwkXw6mM4p3TjZWlj_wqNfBTBtR-Uwx_DZcQgFfwurwD-LKKaQBllRQou6VcOqe2BgPLX5HsFOVjdaJApTun0MFXyK2CC_ZxBswSVZfBlaYWEIlLEUsFJfJR8Tenm4zwLoKaHBrB8QScN4IZsegxgaLIF5EuEOFLClgF0ZKHysA==", "http://ir.mydxlife.com/all-sec-filings", "http://www.meetmydx.com/", "http://www.prnewswire.com/news-releases/mydx-appoints-dr-jessica-peatross-as-chief-medical-officer-300581260.html"], "published": "2018-01-11T17:00:00.000+02:00", "crawled": "2018-01-11T19:01:17.046+02:00", "highlightTitle": ""}