{"organizations": [], "uuid": "b4684527128fe026e53e1541062f1074dd20791d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/ultra-electronic-outlook/update-1-ultra-electronics-sees-significant-exposure-to-u-s-defence-spending-idUSL4N1P62MJ", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Ultra Electronics sees \"significant exposure\" to U.S. defence spending", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T10:10:00.000+02:00", "replies_count": 0, "uuid": "b4684527128fe026e53e1541062f1074dd20791d"}, "author": "", "url": "https://www.reuters.com/article/ultra-electronic-outlook/update-1-ultra-electronics-sees-significant-exposure-to-u-s-defence-spending-idUSL4N1P62MJ", "ord_in_thread": 0, "title": "UPDATE 1-Ultra Electronics sees \"significant exposure\" to U.S. defence spending", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "ultra electronics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "midcap index  ultra electronics", "sentiment": "none"}, {"name": "ultra electronice", "sentiment": "none"}, {"name": "ultra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 8:10 AM / in an hour UPDATE 1-Ultra Electronics sees \"significant exposure\" to U.S. defence spending Reuters Staff 3 Min Read \n(Adds details on results, exec comment, context, background and share price) \nJan 11 (Reuters) - British defence contractor Ultra Electronics, which has warned of lower defence orders in the country, said on Thursday it had significant exposure to a rising U.S. defence budget, and had seen growing demand for advanced technologies. \nThe company, which makes military electronics for land, air and sea operations, also said it expects to have modest progress in 2018 underlying revenue and operating profit on a constant currency basis. \nShares of Ultra Electronice were up 13 percent at 1428 pence in early trading, making it the biggest percentage gainer on the FTSE Midcap Index \nUltra Electronics said it had begun the new year with an order cover on expected revenue of about 62 percent, higher than about 56 percent in 2017. \n“The board is confident that Ultra has sustainable operating trading momentum with a significant number of recent long-term contract wins,” said Douglas Caster, Executive Chairman. \nThe company said order intake for the year ended Dec. 31, 2017 was about 900 million pounds ($1.21 billion), adding it would recommend a final dividend of 35 pence per share. \nThe company said the search for a new chief executive was underway, after its last CEO quit in November as Britain’s government scaled back business with the defence contractor. \nFunding pressure on the Ministry of Defence has forced it to pause, cancel or delay several programmes and “within the last few weeks a number of our UK orders budgeted for 2017 have been affected,” Ultra Electronics said in November. \nUltra Electronics’ new chief will be looking to tap U.S. President Donald Trump’s promised $700 billion in defence spending. The U.S. accounts for 50 percent of the company’s revenue, while UK accounts for 24 percent. \nBritain’s military equipment makers are looking to U.S. defence spending plans to offset defence budget pressure in Britain. \nCompanies like automotive and aircraft parts maker Meggitt have blamed a slower ramp up of new civil programmes and reduced military demand in Britain for subdued trading. \nBut there is hope for improvement in 2018 after Trump pledged an \"historic\" increase in defence spending ( reut.rs/2jdP5py ) . \nUltra Electronics also reiterated its full-year 2017 revenue forecast of over 770 million pounds, below the 785 million pounds it reported in 2016. It sees 2017 underlying operating profit of just over 120 million pounds, compared to 131.1 million pounds in 2016. (Reporting by Noor Zainab Hussain in Bengaluru; Editing by Bernard Orr)", "external_links": [], "published": "2018-01-11T10:10:00.000+02:00", "crawled": "2018-01-11T10:30:35.001+02:00", "highlightTitle": ""}