{"organizations": [], "uuid": "93df6e6395c220034e4dc60eb3dcb3d4a013c786", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-bracco-diagnostics-inc-receives-u-s-food-and-drug-administration-fda-approval-for-use-of-multihancea-gadobenate-dimeglumine.html", "country": "US", "domain_rank": 767, "title": "Bracco Diagnostics Inc. receives U.S. Food and Drug Administration (FDA) approval for use of MultiHance® (gadobenate dimeglumine) injection, 529 mg/mL in magnetic resonance imaging (MRI) of the central nervous system (CNS) in pediatric patients younger th", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.148, "site_type": "news", "published": "2018-01-30T16:00:00.000+02:00", "replies_count": 0, "uuid": "93df6e6395c220034e4dc60eb3dcb3d4a013c786"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-bracco-diagnostics-inc-receives-u-s-food-and-drug-administration-fda-approval-for-use-of-multihancea-gadobenate-dimeglumine.html", "ord_in_thread": 0, "title": "Bracco Diagnostics Inc. receives U.S. Food and Drug Administration (FDA) approval for use of MultiHance® (gadobenate dimeglumine) injection, 529 mg/mL in magnetic resonance imaging (MRI) of the central nervous system (CNS) in pediatric patients younger th", "locations": [], "entities": {"persons": [{"name": "alberto spinazzi", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bracco diagnostics inc.", "sentiment": "neutral"}, {"name": "fda", "sentiment": "neutral"}, {"name": "u.s. food and drug administration", "sentiment": "neutral"}, {"name": "bracco imaging s.p.a.", "sentiment": "none"}, {"name": "cns", "sentiment": "none"}, {"name": "global medical and regulatory affairs", "sentiment": "none"}, {"name": "bracco group", "sentiment": "none"}, {"name": "food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONROE TOWNSHIP, N.J., Jan. 30, 2018 /PRNewswire/ -- Bracco Diagnostics Inc., the U.S. subsidiary of Bracco Imaging S.p.A., one of the world's leading companies in the diagnostic imaging business, announced today that the labeling of its contrast agent MultiHance ® has obtained FDA approval for an extension to include MRI of the CNS in pediatric patients younger than 2 years of age (including term neonates), to visualize lesions with abnormal blood-brain barrier or abnormal vascularity of the brain, spine, and associated tissues.\n\"The approval of use of MultiHance ® in younger pediatric patients, including term neonates, reflects the review made by the Food and Drug Administration (FDA) of the safety and efficacy of MultiHance ® in that special patient population,\" stated Alberto Spinazzi, MD, Senior Vice President, Head of Global Medical and Regulatory Affairs, Bracco Group. \"The FDA approval means that the benefit-risk ratio of MultiHance use in MRI of the CNS is positive also in neonates and infants, as it is in older subjects.\"\nThe approval was based on data specifically obtained in pediatric patients younger than 2 years of age. Similar to older pediatric patients and adults, a dose of 0.1 mmol/kg was shown to significantly improve the visualization and morphologic assessment of CNS lesions. In neonates and infants, however, a dose of 0.05 mmol/kg is effective at improving the visualization of lesions in the brain and the spine. This provides health care professionals with dosing flexibility depending on patient and imaging conditions and needs.\nVittorio Puppo, President and CEO of Bracco Diagnostics Inc. stated, \"This approval is a testament of our commitment to provide new and expanded indications for this class of products, with special efforts aimed to benefit patients with this specialized need.\"\nIndications and Usage for MultiHance ® (gadobenate dimeglumine) injection, 529 mg/mL :\nMultiHance (gadobenate dimeglumine) injection, 529 mg/mL is a gadolinium-based contrast agent indicated for intravenous use in:\nMagnetic resonance imaging (MRI) of the central nervous system (CNS) in adults and pediatric patients (including term neonates), to visualize lesions with abnormal blood-brain barrier or abnormal vascularity of the brain, spine, and associated tissues and Magnetic resonance angiography (MRA) to evaluate adults with known or suspected renal or aorto-ilio-femoral occlusive vascular disease.\nIMPORTANT SAFETY INFORMATION\nfor MultiHance (gadobenate dimeglumine) injection, 529 mg/mL:\nWARNING: NEPHROGENIC SYSTEMIC FIBROSIS\nGadolinium-based contrast agents (GBCAs) increase the risk for NSF among patients with impaired elimination of the drugs. Avoid use of GBCAs in these patients unless the diagnostic information is essential and not available with non-contrasted MRI or other modalities. NSF may result in fatal or debilitating systemic fibrosis affecting the skin, muscle and internal organs.\nThe risk for NSF appears highest among patients with: chronic, severe kidney disease (GFR <30 mL/min/1.73m 2 ), or acute kidney injury. Screen patients for acute kidney injury and other conditions that may reduce renal function. For patients at risk for chronically reduced renal function (e.g. age > 60 years, hypertension or diabetes), estimate the glomerular filtration rate (GFR) through laboratory testing. For patients at highest risk for NSF, do not exceed the recommended MultiHance dose and allow a sufficient period of time for elimination of the drug from the body prior to re-administration. [see Warnings and Precautions (5.1)] MultiHance (gadobenate dimeglumine) injection, 529 mg/mL\nAnaphylactic and anaphylactoid reactions have been reported, involving cardiovascular, respiratory, and/or cutaneous manifestations ranging from mild to severe. The possibility of a reaction should always be considered, especially in those patients with a history of a known clinical hypersensitivity or a history of asthma or other allergic disorders. Trace amounts of gadolinium may remain for months or years in the body organs including bone (highest concentration), brain, liver, spleen, kidneys and skin. Consequences of gadolinium retention in the brain have not been established. Pathologic and clinical consequences of retention in skin and other organs have been established in patients with impaired renal function. Minimize repetitive GBCA imaging studies, particularly close spaced studies when possible.\nPlease see full Prescribing Information and Patient Medication Guide for MultiHance (gadobenate dimeglumine) injection, 529 mg/mL including boxed WARNING at https://www.braccoimaging.com/us-en/products/magnetic-resonance-imaging/multihance\nYou are encouraged to report negative side effects of prescription drugs to the FDA. Visit www.fda.gov/medwatch or call 1-800-FDA-1088 .\nMultiHance is manufactured for Bracco Diagnostics Inc. by BIPSO GmbH – 78224 Singen (Germany) and by Patheon Italia S.p.A, Ferentino, Italy.\nMultiHance is a registered trademark of Bracco International B.V.\nAbout Bracco Imaging\nBracco Imaging S.p.A., part of the Bracco Group, is one of the world's leading companies in the diagnostic imaging business. Headquartered in Milan, Italy, Bracco Imaging develops, manufactures and markets diagnostic imaging agents and solutions that meet medical needs.\nBracco Imaging offers a product and solution portfolio for all key diagnostic imaging modalities: X-ray Imaging (including Computed Tomography-CT, Interventional Radiology, and Cardiac Catheterization), Magnetic Resonance Imaging (MRI), Contrast Enhanced Ultrasound (CEUS), and Nuclear Medicine through radioactive tracers. The diagnostic imaging portfolio is completed by a range of medical devices and advanced administration systems for contrast imaging products.\nThe company operates in over 100 markets worldwide, either directly or indirectly, through subsidiaries, joint ventures, licenses and distribution partnership agreements. With on-going research covering all key modalities, Bracco Imaging has a strong presence in key geographies: North America, Europe and Japan operating through the Joint Venture Bracco-Eisai Co. Ltd. The Company also operates in Brazil, South Korea, and China through the Joint Venture Bracco Sine Pharmaceutical Corp. Ltd.\nOperational investments have been made in order to achieve top quality, compliant and sustainable eco-friendly production. Manufacturing activities are located in Italy, Switzerland, Japan, China, and Germany.\nBracco Imaging is an innovative Research and Development (R&D) structure with an efficient process oriented approach and a track record of innovation in the diagnostic imaging industry. R&D activities are managed in the three Research Centers located in Italy, Switzerland, and the USA.\nTo learn more about Bracco Imaging, visit www.braccoimaging.com .\nPress contact:\nKimberly Gerweck\nBracco Diagnostics Inc.\nMedia Relations\nBDIMediaContact@diag.bracco.com\n609-524-2777\nView original content with multimedia: http://www.prnewswire.com/news-releases/bracco-diagnostics-inc-receives-us-food-and-drug-administration-fda-approval-for-use-of-multihance-gadobenate-dimeglumine-injection-529-mgml-in-magnetic-resonance-imaging-mri-of-the-central-nervous-system-cns-in-pedi-300589794.html\nSOURCE Bracco Diagnostics Inc.", "external_links": ["http://www.prnewswire.com/news-releases/bracco-diagnostics-inc-receives-us-food-and-drug-administration-fda-approval-for-use-of-multihance-gadobenate-dimeglumine-injection-529-mgml-in-magnetic-resonance-imaging-mri-of-the-central-nervous-system-cns-in-pedi-300589794.html", "http://www.fda.gov/medwatch", "https://www.braccoimaging.com/us-en/products/magnetic-resonance-imaging/multihance", "http://www.braccoimaging.com/"], "published": "2018-01-30T16:00:00.000+02:00", "crawled": "2018-01-30T17:51:28.006+02:00", "highlightTitle": ""}