{"organizations": [], "uuid": "c7a8e59c32f960a5d7d3b55704b9a0dd0d6fd007", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218731947&w=1200&r=LYNXMPEE0104S", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/asia-forex-emerging/asian-currencies-off-to-strong-start-for-2018-singapore-dollar-at-1-1-2-year-high-idINKBN1ER08G", "country": "US", "domain_rank": 408, "title": "Asian currencies off to strong start for 2018; Singapore dollar at 1-1/2-year high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T07:13:00.000+02:00", "replies_count": 0, "uuid": "c7a8e59c32f960a5d7d3b55704b9a0dd0d6fd007"}, "author": "", "url": "https://in.reuters.com/article/asia-forex-emerging/asian-currencies-off-to-strong-start-for-2018-singapore-dollar-at-1-1-2-year-high-idINKBN1ER08G", "ord_in_thread": 0, "title": "Asian currencies off to strong start for 2018; Singapore dollar at 1-1/2-year high", "locations": [], "entities": {"persons": [{"name": "vishnu varathan", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "ambar warrick", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mizuho bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Asian currencies firmed on Tuesday, marking a strong start for the new year as sentiment was boosted by gains in the euro, while a weaker U.S. dollar prompted further interest in Asia.\nFILE PHOTO: A Singapore dollar note is seen in this illustration photo May 31, 2017. REUTERS/Thomas White/Illustration/File Photo The greenback saw its biggest annual drop in 2017 in more than a decade on doubts over the durability of a pick-up in U.S. economic growth following a sweeping tax overhaul, while the euro hovered around a three-month peak.\n“I think it’s almost aligning mechanically with the stronger euro and weaker dollar. It looks like there was no risk-off, and the dollar is also on a softer footing, so I think these two reasons are conspiring to allow Asian currencies to remain buoyant today,” said Vishnu Varathan, senior economist at Mizuho Bank.\nHowever, he added that follow-up gains looked a bit doubtful, adding that there was a bit of upside resistance in a few currencies in the region.\nIn Asian currencies, the Taiwan dollar was the biggest percentage gainer, rising 0.8 percent against the dollar to a more than four-year high.\n“ The Taiwan dollar last Friday hit a similar level but pared gains to close flat...what we’re seeing today is just a rebound, which is not a surprise,” said Gao Qi, Asia FX strategist at Scotiabank.\nFILE PHOTO: A Taiwan dollar note is seen in this illustration photo May 31, 2017. REUTERS/Thomas White/Illustration/File Photo The Chinese yuan was also firmer, gaining 0.1 percent to a near four-month high against the greenback. Growth in China’s manufacturing sector unexpectedly picked up to a four-month high in December, a private business survey showed, highlighting unexpected resilience in the world’s second-largest economy.\nThe South Korean won was also stronger against the dollar, edging up after North Korean leader Kim Jong Un offered an olive branch to South Korea, saying he was open to dialogue. Increased tensions in the Korean peninsula had served as a major detriment to the won.\nThe Philippine peso and the Thailand baht did not trade as markets were closed for the New Year celebrations.\nSINGAPORE DOLLAR The Singapore dollar rose against the U.S. dollar on Tuesday, gaining 0.3 percent to its highest since June 2016.\nSingapore’s economic growth slowed in the fourth quarter as factories lost steam, but a services sector recovery bolstered expectations the central bank could tighten monetary policy as early as April, sending the local currency higher.\n“We remain sanguine on 2018 growth outlook for now, but watch for potential policy tightening risks,” OCBC Bank said in a research note.\nReporting by Ambar Warrick in Bengaluru; Editing by Jacqueline Wong\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-02T07:13:00.000+02:00", "crawled": "2018-01-02T07:34:28.003+02:00", "highlightTitle": ""}