{"organizations": [], "uuid": "67e95b0a0c90c0ccb2bfb34b7d22904071bc0d19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221087841&w=1200&r=LYNXMPEE0A0LE", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-europe-stocks/results-drive-sharp-moves-in-european-stocks-idUSKBN1F0118", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Results drive sharp moves in European stocks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T11:38:00.000+02:00", "replies_count": 0, "uuid": "67e95b0a0c90c0ccb2bfb34b7d22904071bc0d19"}, "author": "", "url": "https://www.reuters.com/article/us-europe-stocks/results-drive-sharp-moves-in-european-stocks-idUSKBN1F0118", "ord_in_thread": 0, "title": "UPDATE 1-Results drive sharp moves in European stocks", "locations": [], "entities": {"persons": [{"name": "helen re", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "tesco", "sentiment": "none"}, {"name": "sxrp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 9:52 AM / Updated 24 minutes ago Results drive sharp moves in European stocks as euro weighs Helen Reid , Kit Rees 4 Min Read \nLONDON (Reuters) - European shares dipped on Thursday as a bond market sell-off and a stronger euro took the steam out of the breakneck New Year rally in equities. \nResults drove the bulk of stock moves, with some disappointments weighing heavily. \nThe pan-European STOXX 600 and euro zone equities .STOXXE ended the session 0.3 percent lower, extending sharp losses in the previous session when jitters over a report that China was considering slowing purchases of U.S. Treasury bonds spilled over into stocks. \nA Chinese regulator on Thursday said the report might be “fake”. \nWhile the STOXX was roughly flat for most of the morning session, the index dipped followed the release of minutes from the European Central Bank’s December meeting showing that the ECB should revisit its policy message in early 2018. \n“This is sooner than we had assumed and might mean that (the ECB) it will end its asset purchases in September rather than tapering over the last few months of the year,” economists at Capital Economics said in a note. \nThe euro's rise following the ECB release put pressure on Euro zone indexes with Germany's DAX .GDAXI closing 0.6 percent lower, while bond yields also rose. \nBritain's FTSE 100 .FTSE , meanwhile, touched a fresh record and ended 0.2 percent higher. \nUK retailers Tesco ( TSCO.L ) and Marks & Spencer ( MKS.L ) were among the biggest European fallers, however, after their Christmas trading updates disappointed, with consumers cutting down on non-essential items. \nEurope’s retail sector .SXRP fell 1.3 percent, while bank stocks .SX7P, which had jumped on Wednesday as bond yields surged, extended gains to end 0.4 percent higher. \nDanish jewelery firm Pandora ( PNDORA.CO ) dropped nearly 11 percent after the company said it expected profit margins to fall in the next few years and reported 2017 revenue below expectations. \nHexagon ( HEXAb.ST ) jumped up 5.8 percent after its CEO was cleared of insider trading charges. \nWhile it is too early in the season to fully determine what impact results are having, investors said earnings will be under particular scrutiny this year as the market hopes for another year of earnings growth. \n“You didn’t really have any earnings growth coming through since the euro zone crisis, it was a kind of Groundhog Day every year, but 2017 was a break from that effect,” said Nick Davis, European income fund manager at Polar Capital. \n“The earnings season will be quite important. If Europe can continue demonstrating earnings growth at index level as an asset class it will be very attractive.” \nIn other big moves, the restructuring French telecoms and cable firm Altice ( ATCA.AS ) tumbled 6.7 percent, extending Wednesday’s slide, after its U.S. unit announced a $500 million junk bond sale. Reporting by Helen Reid and Kit Rees; editing by Mark Heinrich", "external_links": [], "published": "2018-01-11T11:38:00.000+02:00", "crawled": "2018-01-11T12:00:29.087+02:00", "highlightTitle": ""}