{"organizations": [], "uuid": "e67e4594a1e8a943b851f79a0ec60010bac19d94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/carillion-restructuring/update-1-carillion-shares-fall-as-market-awaits-news-on-financing-deal-idUSL8N1P63M1", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Carillion shares fall as market awaits news on financing deal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:19:00.000+02:00", "replies_count": 0, "uuid": "e67e4594a1e8a943b851f79a0ec60010bac19d94"}, "author": "", "url": "https://www.reuters.com/article/carillion-restructuring/update-1-carillion-shares-fall-as-market-awaits-news-on-financing-deal-idUSL8N1P63M1", "ord_in_thread": 0, "title": "UPDATE 1-Carillion shares fall as market awaits news on financing deal", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "tpr", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sky news", "sentiment": "none"}, {"name": "carillion plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 2:20 PM / Updated an hour ago UPDATE 2-Carillion asks creditors for more time to tackle debts Reuters Staff \n(Recasts, adds comment from Pension Protection Fund, union) \n* Co asks creditors to consider debt extension or roll-over \n* Creditor talks set to continue into Friday \n* Regulator, govt to discuss pension deficit - Sky News \n* Shares down 15 pct \nBy Emma Rumney and Arathy S Nair \nLONDON, Jan 11 (Reuters) - British building and services company Carillion Plc is asking creditors to consider a debt extension or roll-over in financing talks, which are set to continue into Friday, a source familiar with the situation said. \nCarillion’s shares fell more than 15 percent on Thursday as the market waited for news on efforts to shore up the debt-laden company’s finances. The company, a provider of infrastructure projects in Britain and internationally, has been fighting for survival after costly contract delays and a downturn in new business. \nThe 200-year old group, which employs 43,000 people, said on Saturday that it would meet creditors on Wednesday to discuss a financial rescue plan. \nCarillion’s shares had risen sharply on Monday after a report by Sky News said the rescue plan could include government financial support if the company could not secure private funding. \nSky News said on Thursday that The Pensions Regulator (TPR) and government officials would hold talks on Friday about Carillion’s 580 million pounds ($781.90 million) pension deficit. \nA TPR spokesperson said they “have been and remain closely involved in discussions with Carillion and the trustees of the pension schemes as this situation has unfolded.” \nBritain’s Pension Protection Fund said it was aware of discussions between Carillion, government and banks as well as with the company’s pension fund trustees and The Pensions Regulator, but did not provide more details. \nThe company secretary of the Carillion Pension Plan Trustees Ltd was not immediately available to comment when contacted by Reuters. \nA government spokesperson said: “The company has kept us informed of the steps it is taking to restructure the business. We remain supportive of their ongoing discussions with their stakeholders and await future updates on their progress.” \nCabinet office minister Oliver Dowden said on Wednesday that the government was making “contingency plans for all eventualities” related to Carillion which is working on the HS2 high speed rail link between London and Birmingham and helps to maintain Britain’s roads, schools and hospitals. \nUnite, Britain largest trade union, said the government must consider all possible options, including bringing contracts in-house. \nThe company, which also operates in Canada and the Middle East, made losses of more than 1 billion pounds in the first half of 2016. \nAnalysts estimate Carillion has debt and liabilities including provisions, pensions and accounts payable of as much as 1.5 billion pounds when its market capitalisation has slumped to under 100 million pounds - less than a tenth of what it was this time last year. \nIn December, Carillion said discussions with stakeholders about its options to cut debt and avoid a breach of debt covenants were “progressing well”. \nThe Wolverhampton-based firm has been selling assets to cut debt but its problems have been compounded by pension obligations and delays in collecting cash from clients. \nAfter the financial crisis, British construction companies bid low prices for long-running, fixed-price contracts to keep work coming in. This left them exposed whenever the projects faced delays or bigger than expected costs. \nThe broader industry is also suffering from delays in public spending decisions as Britain negotiates its departure from the European Union. \nThe Financial Conduct Authority (FCA) is investigating whether Carillion appropriately disclosed its financial position in the run up to a series of profit warnings issued in the past six months. \nLast month, Carillion brought forward the start date for new chief executive Andrew Davies to Jan. 22. Davies, head of family-owned builder Wates Group and formerly with defence company BAE Systems, will replace interim CEO Keith Cochrane. \n($1 = 0.7418 pounds) Reporting by Arathy S Nair in Bengaluru and Simon Jessop in London; Editing by Keith Weir and Jane Merriman", "external_links": [], "published": "2018-01-11T16:19:00.000+02:00", "crawled": "2018-01-11T16:44:38.002+02:00", "highlightTitle": ""}