{"organizations": [], "uuid": "24f32a1aafb93f39d157a107683f109723499dff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-safeguard-scientifics-partner-company-spongecell-merges-with-advertising-technology-leader-flashtalking.html", "country": "US", "domain_rank": 767, "title": "Safeguard Scientifics Partner Company Spongecell Merges With Advertising Technology Leader Flashtalking", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-30T00:36:00.000+02:00", "replies_count": 0, "uuid": "24f32a1aafb93f39d157a107683f109723499dff"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-safeguard-scientifics-partner-company-spongecell-merges-with-advertising-technology-leader-flashtalking.html", "ord_in_thread": 0, "title": "Safeguard Scientifics Partner Company Spongecell Merges With Advertising Technology Leader Flashtalking", "locations": [], "entities": {"persons": [{"name": "flashtalking", "sentiment": "negative"}, {"name": "stephen t. zarrilli", "sentiment": "none"}], "locations": [{"name": "pa.", "sentiment": "none"}, {"name": "radnor", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "spongecell", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "safeguard scientifics partner company spongecell merges with advertising technology", "sentiment": "negative"}, {"name": "safeguard scientifics, inc.", "sentiment": "neutral"}, {"name": "needham & company", "sentiment": "none"}, {"name": "spongecell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RADNOR, Pa., Jan. 29, 2018 /PRNewswire/ -- Safeguard Scientifics, Inc. (NYSE: SFE) today announced that its advertising technology partner company Spongecell has merged with New York City-based Flashtalking, a privately held, global platform for online advertising management and data analysis. The combined company will operate under the Flashtalking brand and offer brands and agencies the technology and scale to deliver impactful, data-driven creative advertising. Terms of the all-stock transaction were not disclosed. Investment bank Needham & Company acted as a strategic advisor to Spongecell.\n\"We believe the Flashtalking-Spongecell merger creates a strong platform that can serve a global market with dynamic, data-driven creative content for display, video, social and native advertising,\" said Stephen T. Zarrilli , Safeguard President and CEO. \"We are impressed by Flashtalking's management team, growth prospects, financial capitalization and ultimate monetization potential. We believe that this business combination allows the product attributes of Spongecell to grow within a well-capitalized growth-oriented organization and provide Safeguard shareholders with an opportunity for a meaningful long-term return.\"\nSafeguard deployed a total of $18.0 million in growth capital in Spongecell beginning in January 2012 and held 23% primary ownership position in the New York City-based provider of digital advertising for all devices and formats. Safeguard previously characterized Spongecell as \"expansion stage\" with annual revenues in the range of $5 million to $20 million.\nSafeguard maintains one board seat of the combined company and has an initial ownership interest of 10.3%. Safeguard's interest in Flashtalking will continue to be reflected as a partner company and characterized as a \"high traction stage\" enterprise with annual revenues in excess of $20 million.\nAbout Safeguard Scientifics\nHistorically, Safeguard Scientifics (NYSE: SFE) has provided capital and relevant expertise to fuel the growth of technology-driven businesses. Safeguard has a distinguished track record of fostering innovation and building market leaders that spans more than six decades. For more information, please visit www.safeguard.com or follow us on Twitter @safeguard .\nAbout Spongecell\nSpongecell is a digital advertising-technology company focused on integrating data, machine learning and automation to enhance the creative process, simply, efficiently and at scale. Spongecell enables marketers to deliver beautiful, relevant and engaging brand content to prospects and customers across all devices and formats.\nAbout Flashtalking\nFlashtalking equips advertisers and their agencies to create, activate and measure data-driven advertising across digital channels and formats. Our programmatic creative and analytics platform unifies audience, media and creative to deliver personalized messaging while optimizing performance of media and creative. With cookie-less tracking, connected log-file and algorithmic attribution, we can coordinate, augment and analyze data signals to support our clients where data, relevant creative, and unbiased measurement intersect with expertise, service and a deep partner ecosystem. Founded in the U.K., headquartered in New York, Flashtalking has offices in San Francisco, Los Angeles, Chicago, London, Leeds, Cologne, Hamburg, Amsterdam, and Sydney. For more information visit www.flashtalking.com .\nForward-looking Statements\nExcept for the historical information and discussions contained herein, statements contained in this release may constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Our forward-looking statements are subject to risks and uncertainties. The risks and uncertainties that could cause actual results to differ materially include, among others, our ability to make good decisions about the deployment of capital, the fact that our partner companies may vary from period to period, our substantial capital requirements and absence of liquidity from our partner company holdings, fluctuations in the market prices of our publicly traded partner company holdings, competition, our inability to obtain maximum value for our partner company holdings, our ability to attract and retain qualified employees, market valuations in sectors in which our partner companies operate, our inability to control our partner companies, our need to manage our assets to avoid registration under the Investment Company Act of 1940, and risks associated with our partner companies, including the fact that most of our partner companies have a limited history and a history of operating losses, face intense competition and may never be profitable, the effect of economic conditions in the business sectors in which Safeguard's partner companies operate, and other uncertainties described in our filings with the Securities and Exchange Commission. Many of these factors are beyond the Company's ability to predict or control. As a result of these and other factors, the Company's past financial performance should not be relied on as an indication of future performance. The Company does not assume any obligation to update any forward-looking statements or other information contained in this press release.\nSAFEGUARD CONTACT:\nJohn E. Shave III\nSenior Vice President, Investor Relations and Corporate Communications\n610.975.4952\njshave@safeguard.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/safeguard-scientifics-partner-company-spongecell-merges-with-advertising-technology-leader-flashtalking-300589787.html\nSOURCE Safeguard Scientifics, Inc.", "external_links": ["https://twitter.com/Safeguard", "http://www.flashtalking.com/", "http://www.prnewswire.com/news-releases/safeguard-scientifics-partner-company-spongecell-merges-with-advertising-technology-leader-flashtalking-300589787.html", "https://www.safeguard.com/team/stephen-t-zarrilli/", "http://www.safeguard.com/"], "published": "2018-01-30T00:36:00.000+02:00", "crawled": "2018-01-30T03:54:22.026+02:00", "highlightTitle": ""}