{"organizations": [], "uuid": "405f2ab0b065968df908e08d28749158a881ff64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-lighthouse-ediscovery-and-discovia-rebrand-as-lighthouse.html", "country": "US", "domain_rank": 767, "title": "Lighthouse eDiscovery and Discovia Rebrand as Lighthouse", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.94, "site_type": "news", "published": "2018-01-29T14:00:00.000+02:00", "replies_count": 0, "uuid": "405f2ab0b065968df908e08d28749158a881ff64"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-lighthouse-ediscovery-and-discovia-rebrand-as-lighthouse.html", "ord_in_thread": 0, "title": "Lighthouse eDiscovery and Discovia Rebrand as Lighthouse", "locations": [], "entities": {"persons": [{"name": "discovia rebrand", "sentiment": "negative"}, {"name": "brian mcmanus", "sentiment": "none"}], "locations": [{"name": "legalweek new york", "sentiment": "none"}, {"name": "discovia", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}], "organizations": [{"name": "lighthouse company", "sentiment": "negative"}, {"name": "lighthouse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Company unveils new logo, brand pillars and website to support its evolution in ediscovery and information governance.\nSEATTLE--(BUSINESS WIRE)-- Lighthouse eDiscovery, a leader in technology-enabled ediscovery services and advisory services, and Discovia, a Lighthouse Company, today announced that the combined company will now operate under the name Lighthouse, following the merger of the two companies in May 2017. In addition, Lighthouse revealed a global brand refresh to reflect the company’s expansion into advisory services. The evolved identity includes a new logo, positioning, and website. The company revealed the new identity to attendees at Legalweek New York .\n\"We came together to provide an unparalleled level of quality and service to our combined global client base, with innovative workflows and solutions to manage the risks and cost of ediscovery,” said Brian McManus, chief executive officer at Lighthouse. “In the last eight months, we have unified our processes and technologies across the organization, and we are excited to launch a brand and corporate website that represents our expanding offerings, global scale and momentum.\"\nMcManus continues, “Our updated brand celebrates what Lighthouse stands for – smart innovation and best-in-class expertise devoted to building enduring partnerships with our clients around the globe. These foundational pillars are what has kept our business growing successfully for the past 23 years. We pride ourselves on our long-term partnerships with many of the world’s leading corporations and top law firms who rely on us for insight and efficiency in ediscovery. It’s exciting to be expanding our advisory services practices and being able to help our clients with more of their legal, compliance and risk management endeavors.”\nOn May 17, 2017, Lighthouse eDiscovery and Discovia announced a merger forming the largest organization in the industry focused purely on ensuring optimal use of technology for ediscovery, compliance and risk management. Post-merger, the organizations have been focused on effectively navigating the integration of operations, service offerings, and employee bases while maintaining a client focused approach to service and quality delivery.\nThe merging of the two companies has allowed Lighthouse to establish a unique position in the industry by offering best-in-class technology, service offerings and workflows, in coordination with an elevated level of expertise for their combined client bases. Lighthouse will continue to develop new technologies and service offerings by expanding upon their scope of expertise in information governance in the coming weeks.\nFor more information about this announcement, please contact info@lighthouseglobal.com .\nAbout Lighthouse\nLighthouse simplifies the complexities of ediscovery and information governance by the use of our intuitive technology solutions and comprehensive service offerings. Through our best-in-class expertise, Lighthouse stands apart as a leader in industry best practices and workflows. Our proactive, high-touch approach has enabled us to build enduring partnerships with the most respected corporations and law firms around the globe. For more information, visit www.lighthouseglobal.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005018/en/\nLighthouse\nKate Devaney, 206-535-6578\nkdevaney @lighthouseglobal.com\nSource: Lighthouse", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lighthouseglobal.com%2F&esheet=51749083&newsitemid=20180129005018&lan=en-US&anchor=www.lighthouseglobal.com&index=3&md5=7d7835202a93b066dcce609c69d7dd3e", "http://www.businesswire.com/news/home/20180129005018/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Flhediscovery.com%2Fnews%2Fstronger-as-one&esheet=51749083&newsitemid=20180129005018&lan=en-US&anchor=Lighthouse+eDiscovery+and+Discovia+announced+a+merger&index=2&md5=6211aff00100d8e6b53158f9fd8cf2ae", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.legalweekshow.com%2F%3Fcmp%26Source-google%26Medium-paidsearch%26campaign-legalweekny&esheet=51749083&newsitemid=20180129005018&lan=en-US&anchor=Legalweek+New+York&index=1&md5=d805a42b2309d8065dc7f1764758108b"], "published": "2018-01-29T14:00:00.000+02:00", "crawled": "2018-01-29T16:35:13.067+02:00", "highlightTitle": ""}