{"organizations": [], "uuid": "94cc52a6ec40391060483fa25aad8ee14fab370e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-technical-perspectives-on-medical-supplies-stocks--dentsply-sirona-baxter-haemonetics-and-hill-rom.html", "country": "US", "domain_rank": 767, "title": "Technical Perspectives on Medical Supplies Stocks -- DENTSPLY SIRONA, Baxter, Haemonetics, and Hill-Rom", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.351, "site_type": "news", "published": "2018-01-16T14:10:00.000+02:00", "replies_count": 0, "uuid": "94cc52a6ec40391060483fa25aad8ee14fab370e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-technical-perspectives-on-medical-supplies-stocks--dentsply-sirona-baxter-haemonetics-and-hill-rom.html", "ord_in_thread": 0, "title": "Technical Perspectives on Medical Supplies Stocks -- DENTSPLY SIRONA, Baxter, Haemonetics, and Hill-Rom", "locations": [], "entities": {"persons": [{"name": "baxter", "sentiment": "negative"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "sirona york", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "haemonetics", "sentiment": "negative"}, {"name": "hill-rom holdings inc.", "sentiment": "none"}, {"name": "medical instrument", "sentiment": "none"}, {"name": "hrc", "sentiment": "none"}, {"name": "bax", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "haemonetics corp.", "sentiment": "none"}, {"name": "dentsply sirona inc.", "sentiment": "none"}, {"name": "baxter international inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 16, 2018 /PRNewswire/ --\nWallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on XRAY, BAX, HAE, and HRC which can be accessed for free by signing up to www.wallstequities.com/registration . IBISWorld reported that over the five years to 2022, it expects revenue of the Medical Instrument and Supply Manufacturing industry to return to growth. In particular, as health care reform expands health care coverage, some traditionally underserved demographics will gain access to care. Ahead of today's trading session, WallStEquities.com scans DENTSPLY SIRONA Inc. (NASDAQ: XRAY), Baxter International Inc. (NYSE: BAX), Haemonetics Corp. (NYSE: HAE), and Hill-Rom Holdings Inc. (NYSE: HRC). All you have to do is sign up today for this free limited time offer by clicking the link below.\nwww.wallstequities.com/registration\nDENTSPLY SIRONA\nYork, Pennsylvania headquartered DENTSPLY SIRONA Inc.'s stock finished last Friday's session 2.40% higher at $65.79. A total volume of 1.67 million shares was traded. The Company's shares have advanced 1.23% in the past month, 12.63% over the previous three months, and 15.42% over the past year. The stock is trading above its 200-day moving average by 5.69%. Additionally, shares of DENTSPLY SIRONA, which designs, develops, manufactures, and markets various dental and oral health products, and other consumable healthcare products primarily for the professional dental market worldwide, have a Relative Strength Index (RSI) of 49.46. Get the full research report on XRAY for free by clicking below at: www.wallstequities.com/registration/?symbol=XRAY\nBaxter International\nOn Friday, shares in Deerfield, Illinois headquartered Baxter International Inc. ended the session 0.18% lower at $68.34. The stock recorded a trading volume of 2.34 million shares. The Company's shares have gained 6.27% in the last month, 9.29% in the previous three months, and 46.94% over the past year. The stock is trading 4.73% above its 50-day moving average and 11.85% above its 200-day moving average. Moreover, shares of Baxter, which provides a portfolio of renal and hospital products, have an RSI of 65.10.\nOn January 03 rd , 2018, research firm Raymond James upgraded the Company's stock rating from 'Market Perform' to 'Outperform'.\nOn January 09 th , 2018, Baxter announced that it will host a conference call to discuss its Q4 2017 financial results on February 01 st , 2018, at 7:30 a.m. CST. The call can be accessed on the Company's website. Access the free research report on BAX now by signing up at: www.wallstequities.com/registration/?symbol=BAX\nHaemonetics\nBraintree, Massachusetts headquartered Haemonetics Corp.'s shares declined slightly by 0.99%, closing the session at $64.12. A total volume of 869,054 shares was traded, which was above their three months average volume of 464,700 shares. The stock has surged 12.25% in the last month, 39.24% over the previous three months, and 60.18% over the past year. The Company's shares are trading 12.34% and 40.17% above their 50-day and 200-day moving averages, respectively. Additionally, shares of Haemonetics, which provides hematology products and solutions, has an RSI of 71.50.\nOn December 22 nd , 2017, Haemonetics announced that it intends to publish its Q3 FY18 financial results on February 06 th , 2018, at 6:00 am ET. The Company will hold a webcast conference call at 8:00 a.m. ET that same day to discuss results and answer questions.\nOn January 02 nd , 2018, research firm Morgan Stanley upgraded the Company's stock rating from 'Equal-Weight' to 'Overweight'. Are you already registered with Wall St. Equities? Do so now for free, and get the report on HAE at: www.wallstequities.com/registration/?symbol=HAE\nHill-Rom Holdings\nLast Friday at the close, shares in Chicago, Illinois headquartered Hill-Rom Holdings Inc. recorded a trading volume of 693,352 shares, which was above their three months average volume of 432,950 shares. The stock ended the session 0.20% lower at $86.79. The Company's shares have advanced 5.09% in the past month, 10.76% over the previous three months, and 45.26% over the past year. The stock is trading above its 50-day and 200-day moving averages by 4.70% and 11.16%, respectively. Furthermore, shares of Hill-Rom, which operates as a medical technology company worldwide, have an RSI of 62.97.\nOn January 03 rd , 2018, research firm Raymond James upgraded the Company's stock rating from 'Market Perform' to 'Outperform'.\nOn January 09 th , 2018, Hill-Rom (HRC) announced unaudited preliminary Q1 FY17 revenue for the period ended December 31 st , 2017. HRC expects worldwide revenue of approximately $670 million for Q1 FY18. Core revenue increased approximately 2%, exceeding the previously issued guidance of flat core revenue growth. Additionally, HRC now expects fiscal first quarter adjusted earnings per diluted share, excluding a benefit from the newly signed US tax reform legislation and special items, to exceed its previously issued guidance range of $0.77 to $0.79 per diluted share. Aspiring Member, please take a moment to register below for your free research report on HRC at: www.wallstequities.com/registration/?symbol=HRC\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the", "external_links": ["http://www.wallstequities.com/registration/?symbol=HRC", "http://www.prnewswire.com/news-releases/technical-perspectives-on-medical-supplies-stocks----dentsply-sirona-baxter-haemonetics-and-hill-rom-300582975.html", "https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=BAX", "http://www.wallstequities.com/registration/?symbol=HAE", "http://www.wallstequities.com/registration/?symbol=XRAY", "http://www.wallstequities.com/registration"], "published": "2018-01-16T14:10:00.000+02:00", "crawled": "2018-01-16T17:05:42.006+02:00", "highlightTitle": ""}