{"organizations": [], "uuid": "3b482856c84c6ffa03971233bafe6b2e575d95a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/10/reuters-america-update-4-lennar-sees-strong-demand-in-2018-shares-hit-record-high.html", "country": "US", "domain_rank": 767, "title": "UPDATE 4-Lennar sees strong demand in 2018; shares hit record high", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:49:00.000+02:00", "replies_count": 0, "uuid": "3b482856c84c6ffa03971233bafe6b2e575d95a1"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/10/reuters-america-update-4-lennar-sees-strong-demand-in-2018-shares-hit-record-high.html", "ord_in_thread": 0, "title": "UPDATE 4-Lennar sees strong demand in 2018; shares hit record high", "locations": [], "entities": {"persons": [], "locations": [{"name": "california", "sentiment": "none"}], "organizations": [{"name": "lennar", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "lennar corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Sees FY 2018 home deliveries 32,000-32,500 vs FY 2017's 29,394\n* Q4 orders at 7,357 homes vs est 6,942\n* Q4 profit $1.29/shr vs est $1.48/shr\n* Shares reverse course, hit record high (Adds details on results from conf call, updates share price)\nJan 10 (Reuters) - Lennar Corp on Wednesday reported a surprise drop in quarterly profit but said strong economic growth in 2018 would offset concerns about housing demand being hit by cuts to tax relief on mortgages.\nShares of the Miami-based builder rose to a record of $68.\nInvestors have been concerned that caps on deduction of interest payment on mortgage debt and state and local tax could make housing more expensive and hurt demand in luxury home markets such as California.\nLennar, whose California homes can cost upwards of $1 million, said any impact from the caps was likely to be offset this year by continuing economic and job growth.\n\"We have carefully studied the specific impacts of the tax law on our typical buyer profile in each of our markets, and we found out that the effect is generally positive at their income levels,\" Lennar CEO Stuart Miller said.\nThe new tax law allows interest payment deductions on mortgage debt up to $750,000, down from $1 million. The reform also introduced an annual cap of $10,000 on deduction of state and local tax.\nLennar on Wednesday forecast its fiscal 2018 home deliveries to rise 8.9-10.6 percent and said gross margins for the full year will be in line with last year's levels at 22 percent after having fallen for three years.\nLOWER Q4 PROFIT\nThe company's shares fell in morning trading after reporting a lower-than-expected fourth-quarter profit, citing a transaction that got pushed to the first quarter.\nLennar did not disclose further details on the transaction, but the No. 2 U.S. homebuilder said it would more than make up for the shortfall in the first quarter.\nThe company's orders rose 11.5 percent, with buyers signing up for 7,357 homes in the quarter ended Nov. 30.\nLennar's orders have climbed for seven straight years as the U.S. housing market recovered from the sub-prime crash of 2007-2008.\nThe homebuilder, which agreed to buy smaller rival CalAtlantic Group Inc for $5.7 billion in October, said the deal was expected to close on Feb. 12.\nThe CalAtlantic deal would give it more tools to deal with higher labor and land costs.\nLennar's total revenue rose 12.1 percent to $3.79 billion topping the analysts' estimate of $3.57 billion, according to Thomson Reuters I/B/E/S.\nNet income attributable to Lennar fell 1.2 percent to $309.6 million, or $1.29 per share, missing the average estimate of $1.48 per share. (Reporting by Ankit Ajmera in Bengaluru; Editing by Saumyadeb Chakrabarty and Shounak Dasgupta)", "external_links": [], "published": "2018-01-10T20:49:00.000+02:00", "crawled": "2018-01-11T03:56:57.013+02:00", "highlightTitle": ""}