{"organizations": [], "uuid": "462fe535a1a1d1c2babe453e1e8f7e10d0c902db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-nutrien-announces-agreement-to-purchase-agrichem-a-leading-brazilian-specialty-plant-nutrition-company.html", "country": "US", "domain_rank": 767, "title": "Nutrien Announces Agreement to Purchase Agrichem, a Leading Brazilian Specialty Plant Nutrition Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-29T16:00:00.000+02:00", "replies_count": 0, "uuid": "462fe535a1a1d1c2babe453e1e8f7e10d0c902db"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-nutrien-announces-agreement-to-purchase-agrichem-a-leading-brazilian-specialty-plant-nutrition-company.html", "ord_in_thread": 0, "title": "Nutrien Announces Agreement to Purchase Agrichem, a Leading Brazilian Specialty Plant Nutrition Company", "locations": [], "entities": {"persons": [{"name": "nutrien", "sentiment": "negative"}, {"name": "chuck magro", "sentiment": "none"}, {"name": "magro", "sentiment": "none"}], "locations": [{"name": "saskatoon", "sentiment": "none"}, {"name": "loveland", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "nutrien ltd.", "sentiment": "negative"}, {"name": "tsx", "sentiment": "negative"}, {"name": "specialty plant nutrition company nyse", "sentiment": "negative"}, {"name": "agrichem", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NYSE, TSX: NTR\nSASKATOON, Jan. 29, 2018 /PRNewswire/ - Nutrien Ltd. (Nutrien) is pleased to announce that it has entered into a definitive agreement to acquire Agrichem, a leading specialty plant nutrition and plant health product company in Brazil. Agrichem is one of Brazil's largest liquid NPK fertilizer companies, as well as a producer and marketer of plant health products, including bio-stimulants and health inductors. The company has 195 employees and 35 product registrations actively marketed and a strong platform for future growth. The primary production facility is located close to key agricultural markets in Brazil, with an annual production capacity of almost 12 million litres.\n\"As a leader in Brazilian specialty nutrient markets, the Agrichem team and extensive product profile will be an excellent fit with our Loveland products business,\" commented Chuck Magro, Nutrien's President and CEO. \"Brazil will be a strategic focus for further expansion due to its large and growing agriculture retail and crop input market,\" added Mr. Magro.\nAgrichem is expected to be accretive to earnings in 2018, with total annual historic net sales of over $55 million and historic EBITDA of over $15 million. The acquisition will be made in two tranches, with 80 percent of the business to be acquired in the coming months. The remaining 20 percent of the business will be acquired in 2019, based on 2018 EBITDA levels. Closing of the transaction is subject to regulatory approval and satisfaction of customary conditions precedent.\nAs part of this acquisition, Nutrien expects to capture synergies through the distribution of a variety of Nutrien's existing crop input products and services in Brazil. This includes our Loveland Products proprietary technologies and potential for leveraging our respective digital agriculture technologies.\nAbout Nutrien\nNutrien is the world's largest provider of crop inputs and services, playing a critical role in helping growers increase food production in a sustainable manner. We produce and distribute over 25 million tonnes of potash, nitrogen and phosphate products world-wide. With this capability and our leading agriculture retail network, we are well positioned to supply the needs of our customers. We operate with a long-term view and are committed to working with our stakeholders as we address our economic, environmental and social priorities. The scale and diversity of our integrated portfolio provides a stable earnings base, multiple avenues for growth and the opportunity to return capital to shareholders. For further information visit us at www.nutrien.com .\nForward-Looking Statements\nCertain statements and other information included in this press release constitute \"forward-looking information\" or \"forward-looking statements\" (collectively, \"forward-looking statements\") under applicable securities laws. All statements in this press release, other than those relating to historical information or current conditions, are forward-looking statements, including, but not limited to: the expected closing of the transaction and the anticipated timing thereof, the anticipated effect of the transaction on the Loveland products business, Nutrien's strategic focus in Brazil and estimated accretion, sales, synergy capture and other related metrics.\nSuch forward-looking statements are based on certain key expectations and assumptions made by Nutrien including expectations and assumptions concerning the time necessary to satisfy the conditions to the closing of the transaction, including the regulatory approvals in connection therewith and synergy capture. Although Nutrien believes that the expectations and assumptions on which such forward-looking statements are based are reasonable, undue reliance should not be placed on the forward-looking statements because Nutrien can give no assurance that they will prove to be correct.\nFactors that could cause actual results to differ materially from those in the forward-looking statements include, but are not limited to, estimates, forecasts and statements as to management's expectations with respect to, among other things, business and financial prospects, financial multiples and accretion estimates, future trends, plans, strategies, objectives and expectations, failure to complete the transaction as contemplated and the ability to successfully integrate the new business into our existing business in an effective manner, general economic, market and business conditions, weather conditions, crop prices, the supply and demand and price levels for our major products and products associated with the Agrichem business, governmental and regulatory requirements and actions by governmental authorities, including changes in government policy, changes in environmental, tax and other laws or regulations and the interpretation thereof. The anticipated timeline for completion of the transaction may change for a number of reasons, including the inability to secure necessary regulatory approvals in the time assumed or the need for additional time to satisfy the conditions to the completion of the transaction. As a result of the foregoing, readers should not place undue reliance on the forward‐looking statements contained in this press release concerning the timing of the transaction.\nThe forward-looking information in this press release speaks only as of the date hereof and Nutrien disclaims any intention or obligation to update or revise any forward-looking information as a result of new information or future events, except as may be required under applicable securities laws.\nFOR FURTHER INFORMATION:\nInvestor/Media Relations:\nRichard Downey\nVice President, Investor & Corporate Relations\n(403) 225-7357\nJeff Holzman\n(306) 933-8545\nTodd Coakwell\n(403) 225-7437\ninvestors@nutrien.com\nSOURCE Nutrien Ltd.", "external_links": ["http://www.nutrien.com/"], "published": "2018-01-29T16:00:00.000+02:00", "crawled": "2018-01-29T17:38:51.000+02:00", "highlightTitle": ""}