{"organizations": [], "uuid": "4b1e23a328a20c73e33c8a28f69bdc822b0c4f85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-enel-sells-solar-energy-from-new-27-mw-plant-in-usa-to-wynn-las-vegas-resort.html", "country": "US", "domain_rank": 767, "title": "Enel Sells Solar Energy From New 27 MW Plant in USA to Wynn Las Vegas Resort", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.129, "site_type": "news", "published": "2018-01-25T17:09:00.000+02:00", "replies_count": 0, "uuid": "4b1e23a328a20c73e33c8a28f69bdc822b0c4f85"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-enel-sells-solar-energy-from-new-27-mw-plant-in-usa-to-wynn-las-vegas-resort.html", "ord_in_thread": 0, "title": "Enel Sells Solar Energy From New 27 MW Plant in USA to Wynn Las Vegas Resort", "locations": [], "entities": {"persons": [{"name": "antonio cammisecra", "sentiment": "none"}, {"name": "wynn las vegas", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "new 27 mw plant", "sentiment": "none"}, {"name": "wynn las vegas resort", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "wynn las vegas", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "globa", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "stillwater", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "enel sells solar energy", "sentiment": "negative"}, {"name": "egpna", "sentiment": "negative"}, {"name": "ppa", "sentiment": "none"}, {"name": "enel", "sentiment": "none"}, {"name": "enel green power north america, inc.", "sentiment": "none"}, {"name": "enel green power", "sentiment": "none"}, {"name": "enel group", "sentiment": "none"}, {"name": "wynn solar facility", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EGPNA signed an agreement with the Las Vegas resort whereby the latter will buy the energy produced by the new Wynn Solar Facility at Stillwater, which is due to start production in 1H 2018 The investment in the construction of the new PV facility amounts to approx. 40 million US dollars The power produced by the solar facility will meet up to 75% of the peak power requirements of Wynn Las Vegas, the largest percentage of renewable energy used by any resort in the city\nROME and LAS VEGAS, Enel Green Power North America, Inc. (“EGPNA”), the US renewable energy company of the Enel Group, has signed a Power Purchase Agreement (PPA) with Wynn Las Vegas whereby the resort will buy the energy produced by EGPNA’s new 27 MW 1 Wynn Solar Facility at Stillwater. The new solar project, currently under construction in Nevada, is expected to start production by the first half of 2018.\n“We have clinched a breakthrough partnership that further reinforces Enel Green Power’s expertise to provide attractive solutions tailored to our clients’ energy needs,” said Antonio Cammisecra, Head of Enel’s Global Renewable Energies Division Enel Green Power (EGP). “We are extremely pleased about Wynn’s support of renewable energy and look forward to a long-term partnership that will continue to position Nevada as a hub of clean energy excellence.”\nThe investment in the construction of the new, 160-acre 2 solar PV facility amounts to approximately 40 million US dollars, in line with the investment outlined in Enel’s current strategic plan. The total energy output that will be produced by the PV plant and sold under the PPA with the Las Vegas resort is expected to amount to over 43,900 MWh annually.\nThe energy produced by the new facility will be used to meet up to 75% of Wynn Las Vegas’s current peak-power requirements, which is the largest percentage of renewable energy used by any resort in Las Vegas. Looking ahead, the plant is expected to power Wynn Las Vegas’s planned multi-use development, Paradise Park. The partnership between EGPNA and Wynn is an industry first for a gaming operator in Nevada.\nThe Wynn Solar Facility at Stillwater is a stand-alone solar photovoltaic project located in Churchill County, Nevada. The new solar PV project is adjacent to the existing award-winning Stillwater hybrid facility, the first plant in the world to combine the continuous generating capacity of medium enthalpy, binary cycle geothermal power with solar photovoltaic and solar thermal. The new 27 MW PV facility will share the existing connection infrastructure with the geothermal-solar hybrid plant.\nThis partnership is EGP’s fifth major corporate customer agreement in the US over the last two years. Most recently in 2017, EGPNA announced a deal with Facebook for 200 MW of the 320 MW Rattlesnake Creek wind project in Nebraska, currently under construction. Earlier on in the same year, EGP signed PPAs for two Oklahoman plants, one with T-Mobile US, Inc. for 160 MW of its 300 MW Red Dirt wind farm and another with brewer Anheuser-Busch for 152.5 MW of its 298 MW Thunder Ranch wind farm. In 2016, EGP secured its first corporate PPA with Google for the purchase of energy from 200 MW of its 400 MW Cimarron Bend wind farm in Kansas. Through these agreements, EGP is able to create tailor-made solutions for its corporate customers, with the aim to provide them with long-term access to an affordable, sustainable and reliable source of power.\nIn the State of Nevada, EGPNA already manages the 13.4 MW Salt Wells geothermal plant and the aforementioned Stillwater triple hybrid facility comprised of a 33.1 geothermal plant, a 26.4 MWdc photovoltaic solar plant and a 2 MW solar thermal plant. In the state EGPNA has a workforce of about 75 employees, including those at its renewable energy plants and regional office in Reno, Nevada.\nEGPNA, part of the Renewable Energies Division of the Enel Group, is a leading owner and operator of renewable energy plants in North America with projects operating and under development in 23 US states and two Canadian provinces. EGPNA operates around 100 plants with a managed capacity exceeding 4.2 GW powered by renewable hydropower, wind, geothermal and solar energy.\nEnel Green Power, the Renewable Energies Division of the Enel Group, is dedicated to the development and operation of renewables across the world, with a presence in Europe, the Americas, Asia, Africa and Oceania. Enel Green Power is a global leader in the green energy sector with a managed capacity of around 40 GW across a generation mix that includes wind, solar, geothermal, biomass and hydropower, and is at the forefront of integrating innovative technologies into renewable power plants.\nThrough corporate PPAs, Enel Green Power enables companies to capture business value, while also tackling climate change.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/b938c728-0fde-4437-9dbe-5b735df1e497/en"], "published": "2018-01-25T17:09:00.000+02:00", "crawled": "2018-01-25T18:31:28.012+02:00", "highlightTitle": ""}