{"organizations": [], "uuid": "1b1b217da077cf1e604f675ce731dc6067fefb69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223896986&w=1200&r=LYNXMPEE0K0M9", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-tech-germany-facebook/contrite-facebook-executives-seek-to-ward-off-more-european-rules-idUKKBN1FA0SH", "country": "US", "domain_rank": 408, "title": "Contrite Facebook executives seek to ward off more European rules", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T17:50:00.000+02:00", "replies_count": 0, "uuid": "1b1b217da077cf1e604f675ce731dc6067fefb69"}, "author": "", "url": "https://uk.reuters.com/article/us-tech-germany-facebook/contrite-facebook-executives-seek-to-ward-off-more-european-rules-idUKKBN1FA0SH", "ord_in_thread": 0, "title": "Contrite Facebook executives seek to ward off more European rules", "locations": [], "entities": {"persons": [{"name": "eric auchard", "sentiment": "none"}, {"name": "elliot schrage", "sentiment": "none"}], "locations": [{"name": "munich", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "contrite facebook", "sentiment": "negative"}, {"name": "douglas busvine", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  munich", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dld munich", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 3:45 PM / Updated 16 minutes ago Contrite Facebook executives seek to ward off more European rules Eric Auchard , Douglas Busvine 5 Min Read \nMUNICH (Reuters) - Facebook ( FB.O ) executives are fanning out across Europe this week to address the social media giant’s slow response to abuses on its platform, seeking to avoid further legislation along the lines of a new hate speech law in Germany it says goes too far. \nFacebook’s communications and public policy chief used an annual meeting in Munich of some of Europe and Silicon Valley’s tech elite to apologize for failing to do more, earlier, to fight hate speech and foreign influence campaigns on Facebook. \n“We have to demonstrate we can bring people together and build stronger communities,” the executive, Elliot Schrage, said of the world’s biggest information-sharing platform, which has more than 2 billion monthly users. \n“We have over-invested in building new experiences and under-invested in preventing abuses,” he said in a keynote speech at the DLD Munich conference on Sunday. \nIn the United States, lawmakers have criticized Facebook for failing to stop Russian operatives using its platform to meddle in the 2016 presidential elections, while Britain’s parliament is looking again at the role such manipulation may have played in Britain’s Brexit vote to leave the European Union. \n( reut.rs/2FZJlXB ) (( reut.rs/2y9i98F ) \nA German law that took effect at the start of the year requires social networks such as Facebook, Google and Twitter to remove online hate speech or face heavy fines. ( reut.rs/2rm6AI2 ) \n“It sets forth the right idea for the relation between government and the private sector but it also goes farther than ... we think it should go,” Schrage said of the law. \n”At the same time the law places the responsibility on us to be judge and jury and enforcer determining what is legally compliant and not. I think that is a bad idea. \n“The challenge is how to define where the violation has been or not,” he said. \nBy contrast, Schrage praised the approach of the European Union in demanding that internet companies adhere to a code of conduct and respond quickly to requests to take down illegal content rather than being required to make those decisions themselves. \n“That’s an example of how we can work with governments to be more responsive to their concerns,” Schrage said of the EU. \nThe EU has put internet companies on notice that it will legislate if they don't do a better job self-policing their services for extremist propaganda, hate speech and other abuses. ( reut.rs/2DmXGeU ) NO WILD WEST \nFar from being a “Wild West of content”, Schrage argued, Facebook’s policies on policing content are far more in line with Europe’s strict boundaries governing hate speech than the anything-goes reputation it has coming from Silicon Valley. \n“We are often criticised for being an American company. But our policies with respect to speech and expression are much closer to how the standards have evolved in Europe than they are in the United States,” Schrage said. \n“We do not permit hate speech, we do not permit incitement. There is a tremendous amount of content we remove regularly. When we see content related to terrorism, to hate speech, to incitement, we reach out to law enforcement,” he said. \nBut several tech leaders in the audience said Facebook had long ignored what are effectively editorial responsibilities for policing abusive content on its platform. \nSchrage said Facebook now employed thousands of people to monitor content and to work more closely with law enforcement, while automated algorithms detect and delete 99 percent of Islamic State and al Qaeda content before any Facebook users ever see it. \nPaul-Bernhard Kallen, chief executive of Hubert Burda Media, one of Germany’s largest publishers, said Facebook has avoided responsibility for moderating content on its platform. \n“From my perspective, Facebook is a media company. One way or the other, Facebook should accept it,” Kallen said of taking more control over content or facing regulatory demands to do so. \nFacebook Chief Operating Officer Sheryl Sandberg is meeting policymakers in Paris and Brussels, while Schrage is touring Germany. Later this week they will converge on Davos, the annual policy gathering of world politicians, business chiefs, bankers and celebrities taking place in the Swiss Alps. \nFacebook founder and chief executive Mark Zuckerberg, who has declared earlier this year that his 2018 goal is to \"fix\" Facebook, is staying home ( reut.rs/2F2w8g6 ). Reporting by Eric Auchard and Douglas Busvine in Munich; Editing by Adrian Croft", "external_links": [], "published": "2018-01-21T17:50:00.000+02:00", "crawled": "2018-01-21T18:22:26.009+02:00", "highlightTitle": ""}