{"organizations": [], "uuid": "25086fe35fb6043020e77bff584bc17ef017acf7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2017/12/30/the-associated-press-michigan-scrambles-to-address-chemical-contaminants-in-water.html", "country": "US", "domain_rank": 767, "title": "Michigan scrambles to address chemical contaminants in water", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-30T17:51:00.000+02:00", "replies_count": 0, "uuid": "25086fe35fb6043020e77bff584bc17ef017acf7"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2017/12/30/the-associated-press-michigan-scrambles-to-address-chemical-contaminants-in-water.html", "ord_in_thread": 0, "title": "Michigan scrambles to address chemical contaminants in water", "locations": [], "entities": {"persons": [{"name": "michi", "sentiment": "negative"}, {"name": "rick snyder", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "flint", "sentiment": "none"}, {"name": "lansing", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "environmental protection agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LANSING, Mich. (AP) — While the city of Flint still recovers from a lead-tainted water crisis, Michigan is scrambling to combat potential health risks in other tap water that stem from chemicals long used in firefighting, waterproofing, carpeting and other products.\nPer- and polyfluoroalkyl substances, or PFAS, have been detected at military bases, water treatment plants and, most recently, an old industrial dump site for footwear company Wolverine World Wide. The contaminants, classified by the Environmental Protection Agency as \"emerging\" nationally, have sparked enough concern that Gov. Rick Snyder created a state response team and approved $23 million in emergency spending.\nThe chemicals do not break down easily and can migrate from soil to groundwater. They were used in scores of U.S. industrial applications and have been detected in human and animal blood around the globe. The Agency for Toxic Substances and Disease Registry says scientists are uncertain about how they affect human health at exposure levels typically found in food and water. But some studies suggest the chemicals might affect fetal development, disrupt hormonal functions, damage fertility and immune systems, and boost the risk of cancer.\nAt least 1,000 homes with private wells in the Plainfield Township area north of Grand Rapids — near where Wolverine dumped hazardous waste decades ago — have been tested for PFAS contamination in recent months.\nCody Angell, 28, who lives in the area, said he has had \"sleepless nights,\" even though his home is on the local water system that has been deemed safe. He's concerned because the chemicals have been discovered in the municipal supply, and Plainfield Township for years pulled water from backup wells that have tested positive for the substances. He wonders if PFAS contamination caused his mother's thyroid disease.\nAngell said he lacks confidence in state regulators, pointing to their failures that led to Flint's crisis. Environmental activist and legal consultant Erin Brockovich recently met with area residents, urging them to join a class-action lawsuit that alleges Wolverine illegally disposed of PFAS from Minnesota-based 3M's Scotchgard product in the area. The suit seeks financial damages and steps such as targeted, more frequent medical testing.\nAnother lawsuit alleges that a family of four living near Wolverine's unlined tannery waste dump drank highly contaminated well water for 17 years, causing the father to develop colon cancer, the mother to have a miscarriage and one of their children to develop a rare bone cancer.\nThe chemicals have been identified at 28 sites in 14 Michigan communities. Nearly half are on or near military installations, where the source is believed to be firefighting foam.\nThe $23 million will be used to hire new state employees to sample and analyze well water, buy lab equipment and help public health departments with unexpected response costs. Samples have been sent to California because no Michigan labs can test for the chemicals; state officials want quicker results.\n\"People are starting to get an understanding of a whole class of chemicals that ... are in so many things. How much of that is getting into our systems? I don't think people really know,\" said state Rep. Chris Afendoulis, a Republican whose district includes the Wolverine dump area. He warned it could become \"a nationwide problem.\"\nOf about 1,050 homes tested in neighborhoods north of Grand Rapids, 74 had PFAS levels above 70 parts per trillion — the U.S. government's combined health advisory level for two PFAS in drinking water, set in 2016. Some houses had concentrations measuring hundreds of times higher than the lifetime advisory level. Results are not back yet for every home. Wolverine has provided affected residents with bottled water and whole-house filters and, at the state's request, is investigating 20 reports of discarded barrels or leather scraps at five sites.\nFor now, the Snyder administration and majority Republicans in the Legislature are comfortable with the 70 parts per trillion standard — a non-enforceable and unregulated limit unlike the federal restrictions on other contaminants such as lead, asbestos and mercury.\n\"It is largely used for trying to communicate to the public the point at which if you're below that, we don't have public health concern. When you get above that, then that is when we start to say there are some people who may be at risk of harm from a lifetime of drinking levels above 70,\" said Kory Groetsch, environmental health director at the Michigan Department of Health and Human Services. \"I like to think of it as a speed limit. If you're doing 58 in a 55, your chance of anything bad is very small. If you're doing 95 in a 55, your chance of something going wrong is quite high.\"\nMichigan Democrats are proposing legislation to establish a 5 parts per trillion limit, which would be the country's toughest and follow states such as New Jersey, Minnesota and Vermont that have imposed stricter guidelines. They also are calling for legislative oversight hearings to investigate whether Wolverine and the state moved too slowly to protect people. On its website, Wolverine calls the federal advisory level \"very conservative\" and says there is no human study proving PFAS exposure causes illness.\nStill, the EPA recently announced a \"cross-agency effort\" to address PFAS contamination nationwide, saying it will identify near-term actions to help communities, enhance coordination, boost research and expand communication about health risks. Snyder, a Republican, said the state is building a \"good working relationship\" with the EPA, but — echoing criticism from both sides of the aisle in Congress — said he wants a \"better response\" from the Defense Department.\nThe former Wurtsmith Air Force Base in northern Michigan has been on officials' radar for some time. While PFAS levels in samples from private residential wells nearby were not higher than the federal advisory level, the state urged people to not use their water for drinking or cooking because of uncertainty about the duration or amount of previous exposure and other concerns.\n\"We're at this point in dialogue with different branches of military, and it'd be good if we could get the Department of Defense to figure out the best way to respond and partner with us on helping address this issue,\" Snyder said.\nFollow David Eggert on Twitter at https://twitter.com/DavidEggert00 . His work can be found at https://apnews.com/search/David%20Eggert \nSign up for the AP's weekly newsletter showcasing our best reporting from the Midwest and Texas: http://apne.ws/2u1RMfv", "external_links": [], "published": "2017-12-30T17:51:00.000+02:00", "crawled": "2018-01-01T08:01:07.046+02:00", "highlightTitle": ""}