{"organizations": [], "uuid": "690c0d7ac9bf0e784449c867745d235da4bc313d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/remy-results/update-1-late-timing-of-chinese-new-year-weighs-on-remy-cointreau-q3-idUSL8N1PE0O3", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Remy warns of hit from strong euro, confident on China demand", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-19T15:00:00.000+02:00", "replies_count": 0, "uuid": "690c0d7ac9bf0e784449c867745d235da4bc313d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/remy-results/update-1-late-timing-of-chinese-new-year-weighs-on-remy-cointreau-q3-idUSL8N1PE0O3", "ord_in_thread": 0, "title": "UPDATE 2-Remy warns of hit from strong euro, confident on China demand", "locations": [], "entities": {"persons": [{"name": "dominique vidalon", "sentiment": "none"}, {"name": "remy cointreau", "sentiment": "none"}, {"name": "remy", "sentiment": "none"}, {"name": "luca marotta", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "liberum", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Q3 group sales up 3.2 pct vs forecast for 2.7 pct\n* Q3 cognac sales up 5.5 pct vs forecast for 4.6 pct\n* CFO expects Remy to beat consensus for FY 17/18\n* Shares down after CFO warns on bigger forex impact (Recasts with CFO forecasts, analysts comment, shares)\nBy Dominique Vidalon\nPARIS, Jan 19 (Reuters) - Remy Cointreau on Friday said a strong euro against the U.S. dollar would have a big impact on full-year operating profit after the French spirits group reported stronger than expected third-quarter sales.\nFinance chief Luca Marotta said a strong euro against the dollar would knock 17-18 million euros off full-year operating profit, a bigger hit than the 10-11 million previously forecast.\nThe group’s shares fell 3 percent, reversing earlier gains. By 1012 GMT, Remy shares were off 2.71 percent at 107.60, having gained 4 percent this year and 42 percent last year.\nAnalysts at Liberum, who have a “sell” rating on Remy, said: “The shares are down this morning 2.5 percent perhaps due to the acceptance of a ”very brutal“ FX move.”\n“Despite strong global demand for cognac, we believe Remy is trading well above intrinsic value,” they said.\nRemy Cointreau, known for Remy Cointreau cognac, Mount Gay rum and Cointreau liqueur, also said healthy demand during the Chinese New Year in February would underpin fourth-quarter sales, predicting it could beat market expectations for 11 percent profit growth at constant exchange rates for the year to March 31.\nOPTIMISTIC ON CHINESE DEMAND The Chinese New Year, which boosts demand for premium drinks, starts on Feb. 16 this year, delaying its positive impact on sales to Remy Cointreau’s fourth quarter.\nThe company, said that adjusted for this on-off effect, like-for-like sales growth would have been stronger at around 6 percent in the third quarter ended Dec. 31.\nCognac sales, which account for more than half the company’s revenue, rose 5.5 percent year-on-year in the quarter, also beating 4.6 percent growth expectations.\n“Greater China confirmed its strong momentum both in the third quarter and the nine-month period. The United States, Russia, Africa and travel retail also contributed,” Remy Cointreau said in a statement .\nFinance head Marotta said the group was “very bullish” on its expectations for the Chinese New year and beyond.\n“We are getting new consumers, more women, a younger crowd. We feel our positioning is the right one,” he said\nLike its rivals, Remy Cointreau is sensitive to demand in China where it is pushing premium spirits, including its $3,000 a bottle top-of-the-range Louis XIII cognac.\nThis strategy differs from that of rival Pernod Ricard , which has launched less expensive brands in China. Private consumption of drinks and spirits has been recovering in China, offsetting the impact the country’s anti-corruption crackdown over the past few years which hit premium brand drinks.\nThe company said group sales reached 317.7 million euros ($390 million) in the three months to Dec. 31, showing like-for-like growth of 3.2 percent, beating analysts estimates of 2.7 percent growth.\n$1 = 0.8155 euros Reporting by Dominique Vidalon; Editing by Mathieu Rosemain and Jane Merriman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T15:00:00.000+02:00", "crawled": "2018-01-20T17:44:08.013+02:00", "highlightTitle": ""}