{"organizations": [], "uuid": "de52e6cf582c794eb5910e21ae6522461ff1eec0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 16, "shares": 16, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223034524&w=1200&r=LYNXMPEE0H11T", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-economy-housingstarts/u-s-housing-starts-down-sharply-on-drop-in-single-family-units-idUSKBN1F71SH", "country": "US", "domain_rank": 408, "title": "U.S. housing starts down sharply on drop in single-family units", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:37:00.000+02:00", "replies_count": 0, "uuid": "de52e6cf582c794eb5910e21ae6522461ff1eec0"}, "author": "", "url": "https://www.reuters.com/article/us-usa-economy-housingstarts/u-s-housing-starts-down-sharply-on-drop-in-single-family-units-idUSKBN1F71SH", "ord_in_thread": 0, "title": "U.S. housing starts down sharply on drop in single-family units", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 1:38 PM / Updated an hour ago U.S. housing starts down sharply on drop in single-family units Reuters Staff 2 Min Read \nWASHINGTON, Jan 18 (Reuters) - U.S. homebuilding fell more than expected in December, recording its biggest drop in just over a year, amid a steep decline in the construction of single-family housing units following two months of hefty gains. \nHousing starts decreased 8.2 percent to a seasonally adjusted annual rate of 1.192 million units, the Commerce Department said on Thursday. November’s sales pace was revised up to 1.299 million units from the previously reported 1.297 million units. \nDecember’s percentage drop was the largest since November 2016. Economists polled by Reuters had forecast housing starts decreasing to a pace of 1.275 million units last month. \nHomebuilding increased 2.4 percent to 1.202 million units in 2017, the highest level since 2007. December’s moderation in homebuilding is likely to be temporary amid strong demand for housing that is being driven by a robust labor market. \nBuilders, however, continue to struggle with labor and land shortages as well as more expensive lumber. A survey on Wednesday showed confidence among homebuilders slipping from an 18-year high in January. Builders expected a dip in buyer traffic and sales over the next six months. \nLast month, single-family homebuilding, which accounts for the largest share of the housing market, tumbled 11.8 percent to a rate of 836,000 units. Single-family home construction fell in the South, the Northeast and Midwest. It was unchanged in the West. \nStarts for the volatile multi-family housing segment rose 1.4 percent to a rate of 356,000 units. Building permits edged down 0.1 percent to a rate of 1.302 million units in December. Building permits increased 4.7 percent to 1.263 million units in 2017, also the highest level since 2007. \nSingle-family home permits advanced 1.8 percent in December, while permits for the construction of multi-family homes fell 3.9 percent. Reporting by Lucia Mutikani; Editing by Paul Simao Lucia.Mutikani@thomsonreuters.com; 1 202 898 8315; Reuters Messaging: lucia.mutikani.thomsonreuters.com@reuters.net", "external_links": [], "published": "2018-01-18T15:37:00.000+02:00", "crawled": "2018-01-18T15:45:43.029+02:00", "highlightTitle": ""}