{"organizations": [], "uuid": "f538585dc2185b1e606f92e8c368247e8b9593f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-avera-to-enroll-first-patients-in-landmark-lung-cancer-tri-therapy-clinical-trial.html", "country": "US", "domain_rank": 767, "title": "Avera To Enroll First Patients in Landmark Lung Cancer Tri-Therapy Clinical Trial", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-19T19:00:00.000+02:00", "replies_count": 0, "uuid": "f538585dc2185b1e606f92e8c368247e8b9593f8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-avera-to-enroll-first-patients-in-landmark-lung-cancer-tri-therapy-clinical-trial.html", "ord_in_thread": 0, "title": "Avera To Enroll First Patients in Landmark Lung Cancer Tri-Therapy Clinical Trial", "locations": [], "entities": {"persons": [{"name": "avera", "sentiment": "none"}, {"name": "benjamin solomon", "sentiment": "none"}], "locations": [{"name": "s.d.", "sentiment": "none"}, {"name": "sioux falls", "sentiment": "none"}], "organizations": [{"name": "avera cancer institute", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "worldwide innovative networking", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sioux Falls,Jan. 19, 2018(GLOBE NEWSWIRE) --\nSIOUX FALLS, S.D. — The first patients in the world will be able to enroll in a new cancer study at Avera as part of an international collaboration that looks to transform care for lung cancer patients.\nOncologist Benjamin Solomon, MD, Avera Cancer Institute\nThis clinical trial that received the approval of the FDA is Avera’s latest collaboration as part its membership in the Worldwide Innovative Networking (WIN) Consortium.\n“We’re taking a bold step in a new direction so lung cancer patients have hope for more treatment options after diagnosis. This latest step in our collaboration with WIN represents one clinical trial but is part of our larger goal to revolutionize cancer care through personalized medicine,” said Benjamin Solomon, MD , the lead investigator for the study at Avera and medical oncologist with Avera Cancer Institute. “If successful, this study could lead to a complete paradigm shift in our approach to lung cancer treatment with a goal of realizing big improvements in outcomes for patients.”\nMore than 60 percent of non-small cell lung cancer cases are detected in an advanced stage, and less than 5 percent of these patients are alive five years after diagnosis.\nIn the S urvival P rolongation by R ationale In novative G enomics (SPRING) trial, patients will be given a three-drug protocol that incorporates immunotherapy (avelumab) and two other targeted therapies (palbociclib and axitinib). All patients will be given the same drug combination and their response rates will be tracked to see which patients respond best.\nThrough the WIN Consortium, an Avera research team under Solomon’s leadership has helped design and implement the clinical trial from the ground up.\n“This breakthrough research is happening in Sioux Falls, S.D., because of the high level of expertise and commitment available here,” said Vladimir Lazar, MD, PhD, founder and Chief Scientific and Operating Officer of the WIN Consortium. “With these clinical trials we want to go beyond what is now possible so patients around the world can have more hope when they get a lung cancer diagnosis.”\nBecause cancer evolves as it grows, it can acquire more genomic complexity over time. DNA sequencing and RNA expression levels in tumor and normal tissues will help guide care by analyzing the patient’s cancer genomic abnormalities to determine the specific changes that have occurred. A multi-drug combination has the potential to treat lung cancer by blocking multiple cancer pathways that develop as a result of these genomic changes.\nFor the most effective results, researchers work to pair the drug combinations that may work best to combat each lung cancer genomic abnormality. To accomplish this, WIN developed an algorithm, SIMS (Simplified Interventional Mapping System), which is hypothesized to better predict personalized treatment for cancer patients.\nThe end goal is to pair every lung cancer genomic abnormality with an effective drug combination. This may lead to dozens of clinical trials aimed at accomplishing this goal. In the future, this treatment algorithm could potentially be expanded to other tumor types such as colon or breast cancer.\nThe SPRING trial will be led by Razelle Kurzrock, MD, (University of California San Diego, Moores Cancer Center) and co-led by Enriqueta Felip, MD, (Vall d'Hebron Institute of Oncology). It will be launched in five countries and eight WIN member sites. Avera, one of two sites in the U.S., is the first to begin enrolling patients.\nThe SPRING trial will be conducted in two phases. Phase I will explore the safety of the drug combination and determine the optimal doses for Phase II, which will explore the efficacy of this tri-therapy regimen in first-line treatment of metastatic non-small cell lung cancer. The trial will have strict eligibility criteria and limited enrollment.\nAbout Avera Health\nAvera Health is an integrated health system comprised of more than 330 locations in 100 communities in a five-state region. A full continuum of care is offered through 32 hospitals, 200+ clinics, retirement communities, home care, sports and fitness centers, with award-winning care in 60+ medical specialties. With more than 17,000 employees and physicians, Avera is the largest private employer in South Dakota. Avera is distinguished through technology and innovation. We are home to the world’s most extensive telemedicine network, and a world-class genomics program that translates the latest cancer research directly to patient care. As a health care ministry, we carry on the legacy of the Benedictine and Presentation Sisters, delivering care in an environment guided by our values of compassion, hospitality and stewardship. For more information about Avera, see our website at Avera.org\nAbout the WIN Consortium\nFounded in 2010, WIN is unique structurally in that it brings together organizations from academia, business and not-for-profits to focus on translating the latest advances in personalized cancer medicine into the standard of care. WIN is built on the recognition that all stakeholders in personalized cancer therapy must collaborate and share information, in order to effectively bring the latest innovations in personalized cancer care to the patient. WIN is a non-profit organization formed by 40 renowned members: Academic cancer centers (32 centers in 17 countries), companies (Pfizer, Merck KgaA, Covance, Illumina, HTG Molecular, Blue Cross Blue Shield Association, etc.), non-profit organizations such as Fondation ARC, European Cancer Patient Coalition, SurviveIt. The SPRING trial will be presented during the WIN Symposium “WINning the War against Cancer” in Paris (France) on June 25-26, 2018. For further information, please visit www.winconsortium.org and www.winsymposium.org .\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/ab787512-7eb5-4cd4-a361-529e925f3153\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/b9d3379f-444f-4cf6-8e3f-834a6578abef\nJay Gravholt Avera Health 6056601944 jay.gravholt@avera.org\nSource:Avera Health", "external_links": ["http://www.globenewswire.com/NewsRoom/AttachmentNg/b9d3379f-444f-4cf6-8e3f-834a6578abef", "https://www.globenewswire.com/NewsRoom/AttachmentNg/b9d3379f-444f-4cf6-8e3f-834a6578abef/en", "https://www.globenewswire.com/Tracker?data=TQLfaSUAdIj1ofZ8iBELkj6VtT7PiThQH4GOqC4H8c2BGudeCc8sBihKlvv4zBKZ71rGPUIarM7x_l7-65hnwQ==", "https://www.globenewswire.com/Tracker?data=6I9fR9QcTkt8ZS9ie08YR7Jmpa-CM1JJ5gV5TgQCt7ZQxzE03MTwsEJSOomzg1i-A62AxOM6SCScN6Pf4R-gyME1CP8w_9i78ht3BuTxA1d5fSkXJzNfhubQ63w051pbtQWpeQ-njDoyVLcX1P37avWaW_QhPAA023tg77Lh5DhzCvl-pnqw77kQGhFl4dHyoX4DYpejxVfCmqcYM0me-cNL5yKX003gm_BQ2ioHtchHcyJTQSdSqjp8FEHuqBe6fTDfPLbjLDmX2ObYuD6qhw==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/ab787512-7eb5-4cd4-a361-529e925f3153", "https://www.globenewswire.com/Tracker?data=HU_sPsTlgf022XptMg3sZkk8wC0YB9a1SAPt0DZmHeTDQtv2-kncjMo7S4PhIJ5VoB5d1GfFWxAKqRfcQXZRqywpQFOeQzxWoiCNr7V6ZtA=", "https://www.globenewswire.com/Tracker?data=HU_sPsTlgf022XptMg3sZtD9YFj6wRRB7yL5HVtujdJnYpk6d5ZGf8TRfpQ4nr72QkM0TgKlqv85fK8wLv5MculiY2v5lh5beViUIKrc6Cg=", "https://www.globenewswire.com/Tracker?data=Spwwee1oi4U0CLx4uI-WEIz0zn1Yoto3LAc4CDL2_OIHSGLWRLEPVS2RRnIABA_r2yCUmhVa4R3tsSAJbLwvwCU0SPOM_vSyVbDpZxUYuMN9yFZ36jcPY9LTX9SriQ98", "https://www.globenewswire.com/Tracker?data=6I9fR9QcTkt8ZS9ie08YR7Jmpa-CM1JJ5gV5TgQCt7ZQxzE03MTwsEJSOomzg1i-X_mETp_ZZ9aSy_8jJ8obIpQgwmlYBI-RK_yvlDu6dYYs4kKFqCK6PQ9RHvwlOEgGN4X6awJ9026tcM2ZjmRG-go-8s6pO1y0VXHVAnl12r3Yob3w9Q4LWKG2Pm9uUk1rORHk1A-rQqhWUWqpjKXjIZiAJ4Keg8ZJXCV5jdfrzqcMdGb7Zmk-IRiQjiVcUZBJ5T0TOLnlMNEhTA_ab1axSQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/ab787512-7eb5-4cd4-a361-529e925f3153/en"], "published": "2018-01-19T19:00:00.000+02:00", "crawled": "2018-01-19T20:51:03.005+02:00", "highlightTitle": ""}