{"organizations": [], "uuid": "a5c6d04b7d469fe25122a5073c8e681dc1d6cf3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-founders-of-top-10-ranked-boutique-bank-for-tech-ma-announce-launch-of-nfluence-partners.html", "country": "US", "domain_rank": 767, "title": "Founders of Top 10-Ranked Boutique Bank for Tech M&A Announce Launch of Nfluence Partners", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-31T19:00:00.000+02:00", "replies_count": 0, "uuid": "a5c6d04b7d469fe25122a5073c8e681dc1d6cf3a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-founders-of-top-10-ranked-boutique-bank-for-tech-ma-announce-launch-of-nfluence-partners.html", "ord_in_thread": 0, "title": "Founders of Top 10-Ranked Boutique Bank for Tech M&A Announce Launch of Nfluence Partners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New firm from seasoned team will provide M&A and private capital advisory for technology, media and telecommunications transactions with high-touch approach and mission-driven focus\nSAN FRANCISCO--(BUSINESS WIRE)-- The team responsible for building one of 2017’s top 10-ranked technology-focused boutique M&A practices has launched a new boutique investment bank called Nfluence Partners, with offices in both San Francisco and New York. Nfluence Partners will specialize in M&A and capital advisory for technology, media and telecom (“TMT”) transactions.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180131005501/en/\nGary Moon, Managing Partner of Nfluence Partners (Photo: Business Wire)\nGary Moon, most recently the head of TMT at Headwaters, along with Sun Jen Yung, Head of Digital Media & Internet and John Batdorf, Head of Software, are joined by Brewer Stone, most recently Managing Director at Pacific Crest Securities, and John Sternfield, most recently Managing Director at Petsky Prunier, to form the founding Principals of Nfluence Partners.\n“Our team has built a reputation for successful outcomes on mid-market transactions including representing and selling clients to major name players such as Alibaba, AT&T, Comcast, Cisco, Facebook, Google, IBM and Microsoft,” Gary Moon explained. “Our first objective is continuing to achieve successful outcomes for our core TMT client base. Our senior team offers clients a combined 150+ years of technology banking experience, along with a global network across Europe, Asia and Israel, a focus on high-touch, senior-level service and honest, unbiased advice and guidance.”\nMoon continues, “Our team over the past seven years together has developed a strong culture based on shared values.” Moon, who began his career out of Stanford as founder and CEO of a wireless company and later shifted to investment banking, sees the new venture as an opportunity to reenter the entrepreneur world as well as the ability to focus on mission-aligned, purpose-driven companies.\nNfluence Partners’ Senior Principals\nGary Moon has more than 15 years of experience in investment banking for the tech and telecom sector, having served prior stints as Head of TMT at Headwaters MB, Managing Director of Europe for Ridgecrest Capital Partners and as Senior Director for Viant Capital. Sun Jen Yung brings over 25 years of Digital Media and Internet investment banking expertise, previously serving as Managing Director and Head of Digital Media & Internet at Headwaters MB, Managing Director at Oppenheimer & Co, Director at Deutsche Bank and Senior Vice President at Lehman Brothers. John Batdorf also offers over 25 years of software and Internet investment banking experience, having previously served as Managing Director and Head of Software at Headwaters MB, as Managing Director and Head of Software and Internet at Viant Capital and as Director at SG Cowen Securities. Brewer Stone brings 24 years of expertise in global technology, especially in Asia and other emerging markets. Stone previously served as Managing Director, International Investment Banking at Pacific Crest Securities and Managing Director of FBR. John Sternfield comes with over 30 years of transaction experience across communications, software and technology, most recently as Managing Director at Petsky Prunier.\nAbout Nfluence Partners\nNfluence Partners is a privately-held, boutique investment bank specializing in technology, telecom and media transactions. Founded in 2018 with offices in San Francisco and New York, the firm offers M&A and capital advisory services. Nfluence Partners thoughtfully maximizes value and realizes optimal outcomes for entrepreneurs and investors located around the world. For more information, visit: www.nfluencepartners.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005501/en/\nNfluence Partners\nLindsay Stevens, 213-200-9638\npress@nfluencepartners.com\nSource: Nfluence Partners", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.nfluencepartners.com&esheet=51751408&newsitemid=20180131005501&lan=en-US&anchor=www.nfluencepartners.com&index=1&md5=c4b0f28ca66b999138fc036d7ee6ca78", "http://www.businesswire.com/news/home/20180131005501/en/"], "published": "2018-01-31T19:00:00.000+02:00", "crawled": "2018-01-31T20:33:27.007+02:00", "highlightTitle": ""}