{"organizations": [], "uuid": "c0fa2e4979c2090d1d122f0521bb63fe62224513", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-parke-bancorp-inc-announces-2017-earnings-3-point-2-million-non-recurring-charge-from-new-tax-law.html", "country": "US", "domain_rank": 767, "title": "Parke Bancorp, Inc. 2017 Earnings, $3.2 Million Non-recurring Charge From New Tax Law", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.292, "site_type": "news", "published": "2018-01-25T00:10:00.000+02:00", "replies_count": 0, "uuid": "c0fa2e4979c2090d1d122f0521bb63fe62224513"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-parke-bancorp-inc-announces-2017-earnings-3-point-2-million-non-recurring-charge-from-new-tax-law.html", "ord_in_thread": 0, "title": "Parke Bancorp, Inc. 2017 Earnings, $3.2 Million Non-recurring Charge From New Tax Law", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "parke bancorp", "sentiment": "negative"}, {"name": "nasd", "sentiment": "negative"}, {"name": "parke bancorp, inc.", "sentiment": "neutral"}, {"name": "dta", "sentiment": "none"}, {"name": "parke bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON TOWNSHIP, N.J., Jan. 24, 2018 /PRNewswire/ -- Parke Bancorp, Inc. (\"Parke Bancorp\") (NASDAQ: PKBK), the parent company of Parke Bank, announced its operating results for the quarter and year ended December 31, 2017.\nAs a result of the enactment of the Tax Cuts and Jobs Act on December 22, 2017, Parke Bancorp was required to re-value its net deferred tax asset (\"DTA\"). The DTA was written down by $3.2 million, due to the reduced tax rate, a non-recurring charge to provision for income taxes during the quarter. Parke Bancorp expects to benefit prospectively from the reduced corporate tax rate, and should recover this charge in less than one year.\nParke Bancorp reported net income available to common shareholders of $10.8 million, or $1.40 per common share and $1.24 per diluted common share, for the year ended December 31, 2017. This compares to $17.3 million, or $2.31 per common and $1.92 per diluted share, for the year ended December 31, 2016. The 2016 period included an approximately $9.3 million pre-tax gain from the sale of our SBA related assets in April of 2016, which included a $7.6 million gain on sale and relief of $1.7 million of related allowance for loan losses. Income before income taxes for the year was $24.2 million, compared to $18.3 million for the same period last year, excluding the gain from the sale of SBA related assets in 2016, an increase of $5.9 million or 32.4%.\nFor the quarter ended December 31, 2017, net income available to common shareholders was $325,000, or $0.04 per common share and $0.06 per diluted common share, compared to net income of $3.1 million, or $0.41 per common and $0.35 per diluted common share for the quarter ended December 31, 2016. Income before income taxes for the quarter was $6.3 million, compared to $5.3 million for the same period last year, an increase of $1.0 million or 19.6%.\nThe following is a recap of other significant items that impacted the fourth quarter of 2017 compared to the same quarter last year: an increase of $1.9 million in interest income, primarily attributable to higher loan volumes, partially offset by an increase of $563,000 in interest expense due to higher deposit volumes, a $200,000 decrease in the provision for loan losses primarily due to improving credit quality, a $127,000 increase in noninterest income and a $662,000 increase in noninterest expense partially attributable to higher compensation expense due to normal salary increases and increased benefit expense.\nAt December 31, 2017, Parke Bancorp's total assets increased to $1.14 billion, from $1.02 billion at December 31, 2016, an increase of $121.3 million or 11.9%.\nParke Bancorp's total investment securities portfolio decreased to $40.3 million at December 31, 2017, from $47.1 million at December 31, 2016, a decrease of $6.8 million or 14.5%. During the fourth quarter an impaired collateralized debt obligation security (TRUP) with a carrying value of $705,000 was sold.\nParke Bancorp's net loans increased to $1.01 billion at December 31, 2017, from $852.0 million at December 31, 2016, an increase of $159.8 million or 18.8%.\nAt December 31, 2017, Parke Bancorp had $4.5 million in nonperforming loans representing 0.5% of total loans, a decrease of $6.8 million or 59.9%, from $11.3 million of nonperforming loans at December 31, 2016. Other Real Estate Owned (\"OREO\") at December 31, 2017 was $7.2 million, compared to $10.5 million at December 31, 2016, a decrease of 31.2%. Nonperforming assets (consisting of nonperforming loans and OREO) represented 1.0% of total assets at December 31, 2017, as compared to 2.1% of total assets at December 31, 2016. The Company has been able to continue to reduce nonperforming assets through sales and workouts while mitigating the financial impact. Loans past due 30 to 89 days were $444,000 at December 31, 2017, a decrease of $192,000 from the previous quarter end.\nAt December 31, 2017, Parke Bancorp's allowance for loan losses was $16.5 million, as compared to $15.6 million at December 31, 2016. The ratio of allowance for loan losses to total loans was 1.6% at December 31, 2017, and 1.8% at December 31, 2016. The ratio of allowance for loan losses to non-performing loans improved to 364.7% at December 31, 2017, compared to 137.9%, at December 31, 2016.\nAt December 31, 2017, Parke Bancorp's total deposits were $866.4 million, up from $788.7 million at December 31, 2016, an increase of $77.7 million or 9.9%. The increase was primarily attributable to the successful opening of two new branch locations and a marketing campaign to generate additional deposits.\nParke Bancorp's total borrowings were $128.1 million at December 31, 2017, an increase of $35.0 million from December 31, 2016, or 37.6%, utilized to fund loan growth.\nTotal shareholders' equity increased to $134.8 million at December 31, 2017, from $127.1 million at December 31, 2016, an increase of $7.7 million or 6.0%.\nVito S. Pantilione, President and Chief Executive Officer of Parke Bancorp and Parke Bank, provided the following statement:\n\"Parke Bancorp had another very strong year for growth and earnings. Net Income before income taxes was $24.2 million for the year, an increase of 32.4% from 2016, after deducting the onetime gain on the sale of our SBA company in 2016. Although like most banks in the country, we were required to make the non-recurring charge to our deferred tax asset due to the new tax law, I believe that the new tax law will be very beneficial to the Company and to the nation's economy. It is clear that many major corporations are moving cash and operations back to the United States due to the reduced tax structure. This will help support strong growth in our country's economy, employment and employee salaries. We will recover the onetime deferred tax asset charge of $3.2 million in less than a year and our Company's reduced tax rate will benefit our shareholders for years. Our loan growth was very strong at close to 20% in 2017. This loan growth was supported by our lending team combined with our two new full-service branches in Collingswood and Chinatown. This loan growth was primarily responsible for the substantial increase of interest on loans income in 2017, from $42.2 million in 2016 to $48.7 million, a 15% increase. We anticipate our strong loan growth to continue as we work to expand our lending team and consider potential opportunities of opening additional loan production offices. The continued strong financial performance of our Company supported our Board of Directors' decision to again increase our quarterly cash dividend to 12 cents per share in July of 2017, total dividends paid in 2017 increased by 42% over 2016. We believe that strong growth of the nation's and region's economy will provide opportunities in the market. Our Company's strong earnings and capital puts us in a great position to take advantage of those opportunities, when available.\"\nParke Bancorp, Inc. is the holding company for Parke Bank, which operates from its corporate headquarters in Washington Township, New Jersey and 6 branch offices in Washington Township, New Jersey, Northfield, New Jersey, Galloway Township, New Jersey, Collingswood, New Jersey, Center City Philadelphia, and Chinatown in Philadelphia. Parke Bank is a full service commercial bank, with an emphasis on providing personal and business financial services to businesses and individuals primarily in Philadelphia and surrounding counties and Southern New Jersey. Parke Bank's deposits are insured up to the maximum legal amount by the Federal Deposit Insurance Corporation (FDIC). Parke Bancorp's common stock is traded on the NASDAQ Capital Market under the symbol \"PKBK\".\nThis release may contain forward-looking statements. Such forward-looking statements are subject to risks and uncertainties which may cause actual results to differ materially from those currently anticipated due to a number of factors including but not limited to: the future impact on the economy and the Company of the enactment of the Tax Cuts and Jobs Act; the period of time for recovery of the writedown of our DTA through the reduction in corporate tax rates; our ability to continue to generate strong net earnings; our ability to continue to reduce our nonperforming loans and delinquencies and the expenses associated with them; our ability to realize a high recovery rate on disposition of troubled assets; our ability to take advantage of opportunities in the improving economy and banking environment; our ability to continue to pay a dividend in the future; our ability to enhance shareholder value in the future; our ability to prudently expand our operations in our market and in new markets; and our ability to continue to grow our loan portfolio, therefore, readers should not place undue reliance on any forward-looking statements. Parke Bancorp, Inc. does not undertake, and specifically disclaims, any obligations to publicly release the results of any revisions that may be made to any forward-looking statements to reflect the occurrence of anticipated or unanticipated events or circumstances after the date of such circumstance.\nStatements of Financial Condition Data\nDecember 31,\n2017\nDecember 31,\n2016\n% Change\n(in thousands)\nTotal assets\n$\n1,137,452\n$\n1,016,185\n11.9%\nCash and cash equivalents\n42,113\n70,720\n-40.5%\nInvestment securities\n40,259\n47,078\n-14.5%\nLoans, net of unearned income\n1,011,717\n851,953\n18.8%\nDeposits\n866,386\n788,694\n9.9%\nBorrowings\n128,053\n93,053\n37.6%\nTotal shareholders' equity\n134,780\n127,134\n6.0%\nOperating Ratios\nThree Months Ended\nDecember 31,\nTwelve Months Ended\nDecember 31,\n2017\n2016\n2017\n2016\nReturn on average assets\n0.20%\n1.36%\n1.13%\n1.97%\nReturn on average common equity\n1.08%\n11.41%\n9.40%\n17.04%\nInterest rate spread\n3.72%\n3.74%\n3.83%\n3.82%\nNet interest margin\n3.93%\n3.91%\n4.01%\n3.96%\nEfficiency ratio\n39.31%\n38.57%\n36.39%\n45.64%\nAsset Quality Data\nDecember 31,\n2017\nDecember 31,\n2016\n(in thousands)\nAllowance for loan losses\n$\n16,533\n$\n15,580\nAllowance for loan losses to total\nloans\n1.63%\n1.83%\nAllowance for loan losses to non-\naccrual loans\n364.70%\n137.90%\nNon-accrual loans\n$\n4,534\n$\n11,298\nOREO\n$\n7,248\n$\n10,528\nStatements of Income Data\nThree Months Ended\nDecember 31,\nTwelve Months Ended\nDecember 31,\n2017\n2016\n2017\n2016\n(in thousands)\nInterest and dividend income\n$\n12,953\n$\n11,017\n$\n48,655\n$\n42,202\nInterest expense\n2,325\n1,762\n8,280\n6,764\nNet interest income\n10,628\n9,255\n40,375\n35,438\nProvision for loan losses\n500\n700\n2,500\n1,462\nNet interest income after provision for\nloan losses\n10,128\n8,555\n37,875\n33,976\nNon-interest income\n642\n515\n1,645\n10,290\nNon-interest expense\n4,430\n3,768\n15,293\n16,628\nIncome before income taxes\n6,340\n5,302\n24,227\n27,638\nProvision for income taxes\n5,799\n1,944\n12,389\n8,695\nNet income attributable to Company\nand noncontrolling interests\n541\n3,358\n11,838\n18,943\nNet income attributable to\nnoncontrolling interests\n10\n19\n32\n(433)\nNet income attributable to Company\n551\n3,377\n11,870\n18,510\nPreferred stock dividend and discount\n226\n300\n1,119\n1,200\nNet income available to common\nshareholders\n325\n3,077\n10,751\n17,310\nBasic income per common share\n0.04\n0.41\n1.40\n2.31\nDiluted income per common share\n0.06\n0.35\n1.24\n1.92\nWeighted shares - basic\n7,833,759\n7,542,466\n7,657,756\n7,507,709\nWeighted shares - diluted\n9,739,384\n9,681,258\n9,559,635\n9,622,272\nView original content: http://www.prnewswire.com/news-releases/parke-bancorp-inc-announces-2017-earnings-32-million-non-recurring-charge-from-new-tax-law-300587792.html\nSOURCE Parke Bancorp, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/parke-bancorp-inc-announces-2017-earnings-32-million-non-recurring-charge-from-new-tax-law-300587792.html"], "published": "2018-01-25T00:10:00.000+02:00", "crawled": "2018-01-25T02:37:10.004+02:00", "highlightTitle": ""}