{"organizations": [], "uuid": "2660e1faef408b14a8cdfc3f97a829dc05454342", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224426029&w=1200&r=LYNXMPEE0M0KW", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-carrefour-strategy/retailer-carrefour-steps-up-digital-push-and-inks-deal-in-china-idINKBN1FC0R4", "country": "US", "domain_rank": 408, "title": "Carrefour steps up e-commerce push, chases deal in China", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T12:00:00.000+02:00", "replies_count": 0, "uuid": "2660e1faef408b14a8cdfc3f97a829dc05454342"}, "author": "", "url": "https://in.reuters.com/article/us-carrefour-strategy/retailer-carrefour-steps-up-digital-push-and-inks-deal-in-china-idINKBN1FC0R4", "ord_in_thread": 0, "title": "Carrefour steps up e-commerce push, chases deal in China", "locations": [], "entities": {"persons": [{"name": "dominique vidalon", "sentiment": "none"}, {"name": "alexandre bompard", "sentiment": "none"}, {"name": "bompard", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "carrefour china", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "carrefour", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - Carrefour’s ( CARR.PA ) new chief executive promised to slash costs, step up e-commerce investment in the face of competition from Amazon ( AMZN.O ) and open up Carrefour China to local investors, sending its shares higher on Tuesday.\nAlexandre Bompard, at the helm only since July and tasked with boosting cash flow, promised to invest 2.8 billion euros ($3.4 billion) in digital commerce by 2022, six times its current investment, as Carrefour plays catch-up in online retail.\nUnder pressure to lift profits, Bompard also announced cost savings of 2 billion euros by 2020, including a voluntary redundancy plan for 2,400 employees at its French head office.\n“We must revamp our model by simplifying our organization, opening ourselves up to partnerships, improving our operational efficiency... (and) building an efficient omnichannel model,” Bompard said in a statement.\nCarrefour shares leapt 6.3 percent, the biggest one-day gain since October 2015, as investors cheered the five-year strategic plan’s focus on investing in online and competitiveness.\nCarrefour has spent years trying to reduce its reliance on hypermarkets, particularly in France, a model that once drove its bricks-and-mortar retail business but which has come under crushing pressure from digital commerce and the rise of online giants such as Amazon ( AMZN.O ).\nFormer Fnac executive Bompard unveiled the plan after Carrefour said last week that its 2017 operating profit could fall by 15 percent amid weak sales. This marked its second profit warning in six months.\nThe retailer, the world’s largest after Wal-Mart ( WMT.N ), with more than 380,000 employees, said it was targeting a 20 percent market share in food e-commerce in France by 2022.\nCarrefour’s online sales accounted for just 1.7 percent of its total French food sales in 2016, while more digital-savvy rival Leclerc managed 8 percent, according to Bernstein analysts.\nSlideshow (2 Images) CHINA PARTNERSHIP In China, Carrefour remains loss-making amid fierce competition from local players and a buoyant online market.\nIn response, Bompard announced the possible acquisition of a stake in Carrefour China by Internet giant Tencent ( 0700.HK ) and local retailer Yonghui ( 601933.SS ). Carrefour would remain the largest shareholder of Carrefour China.\n“While some will be disappointed not to see an outright sale of China, these are both strong strategic partners and we would argue give the group the best possible ability to turn the business around,” brokerage Bernstein said in a briefing note.\nAmazon’s acquisition of U.S. food retail chain Whole Foods has fueled speculation that the U.S. online group is looking to crack the European market next. It has held exploratory talks with some of Carrefour’s rivals, the companies have confirmed. Carrefour’s five-year plan was welcomed by investors and analysts who had wanted the retailer to make further moves into e-commerce after it acquired a stake in online fashion retailer Showroomprive.com ( SRPG.PA ) this month.\nIt is the largest private sector employer in France, where its weak performance have weighed on group profitability and performance of its shares. France accounts for 44 percent of the operating profits.\nTargeting 1 million additional fresh food customers by 2022, Carrefour said it would accelerate growth in supermarkets and convenience stores and improving the efficiency of its hypermarkets, including by reducing sales areas.\nNo hypermarket closures were planned, it said.\nBompard’s plan to shed 2,400 jobs out of a total French HQ workforce of 10,500 could set the chief executive on a collision course with France’s muscular trade unions, including Force Ouvriere, which has already called for a walkout on Feb. 8. Britain’s supermarket group Tesco ( TSCO.L ) said on Monday it will cut a net 800 jobs from its UK business to simplify operations and achieve targeted cost savings.\nReporting by Dominique Vidalon; additional reporting by Sudip Kar-Gupta; Writing by Richard Lough; Editing by Keith Weir\n ", "external_links": [], "published": "2018-01-23T12:00:00.000+02:00", "crawled": "2018-01-23T12:22:11.000+02:00", "highlightTitle": ""}