{"organizations": [], "uuid": "465890e9ef1997a4aad3fd177f0a8695d9b2ddc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104974133-RTX472WM.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/apple-and-4-other-tech-giants-could-spark-a-181b-shift-in-market-cap.html", "country": "US", "domain_rank": 767, "title": "Apple and 4 other tech giants could spark a $181B shift in market cap", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.145, "site_type": "news", "published": "2018-01-29T18:15:00.000+02:00", "replies_count": 0, "uuid": "465890e9ef1997a4aad3fd177f0a8695d9b2ddc1"}, "author": "Heidi Chung", "url": "https://www.cnbc.com/2018/01/29/apple-and-4-other-tech-giants-could-spark-a-181b-shift-in-market-cap.html", "ord_in_thread": 0, "title": "Apple and 4 other tech giants could spark a $181B shift in market cap", "locations": [], "entities": {"persons": [{"name": "carter worth", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "microsoft", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "6:01 PM ET Fri, 26 Jan 2018 | 06:37 \nAs the busiest week for earnings begins, five tech giants reporting this week could cause a gain or reduction of $181 billion in value for investors. \nFacebook and Microsoft kick things off after the closing bell on Wednesday, and the options market is implying about a 5.5 percent move in either direction for Facebook and a 5 percent move for Microsoft. \nNext comes Amazon , Alphabet and Apple on Thursday afternoon. The options market is anticipating moves of 6.5 percent, 4.5 percent and 4 percent, respectively, in either direction for those names. If these implied moves come to fruition, that could represent a $181 billion swing in market cap. \nOptions traders calculate the implied move for equities by measuring a particular stock's so-called straddle — or at the money put and call . The amount of the straddle typically captures market markers' expectations for how much a stock is going to move. \nThe group as a whole looks attractive, says Carter Worth, Cornerstone Macro's head of technical analysis. He's looking at one name in particular for a bigger breakout. \nWorth noted that Microsoft, Apple, Amazon, Facebook and Alphabet represent the five largest stocks in the S&P 500 by market cap, and with the addition of Netflix , those six tech heavyweights represent 14 percent of the S&P 500 and $3.7 trillion in combined market cap. \nWhen those six stocks are plotted equal weight on a chart, \"it's a beautiful uptrend. In fact, the [trend line] draws itself and has just bounced off the line like clockwork. I mean it's a testament to the importance of charts. So what I'm thinking is more [gains] to come [for the tech heavyweights],\" Worth said. \nMore importantly, when looking at the relative performance of those tech heavyweights to the broader tech sector, Worth noted that \"they've made no progress [relatively] in two years, …they've not outperformed in the last 24 months, that they're just breaking out to new highs on a relative basis. That's key.\" \nWorth pointed to Alphabet as a top pick going into earnings. \"I'm thinking at the minimum we get to the top of the [ascending] channel — another 10 percent-12 percent [of upside].\" \nHe noted that after the last two years, Alphabet has been underperforming the market; however, \"it is just now starting to outperform and break above trend. That's a key set up. I think you want to play Google long into [earnings],\" Worth said. \nAccording to FactSet, analysts are expecting Alphabet to report $32.29 earnings per share on $88.9 billion in revenue. Options Action Newsletter: \nSign up to receive exclusive Options Action content. Each month you'll receive an exclusive message from host Melissa Lee and insight directly from one of the members of our Options Action panel. Keep your pulse on the market with the Options Action newsletter. Submit Please enter a valid email address To learn more about how we use your information, please read our Privacy Policy .", "external_links": [], "published": "2018-01-29T18:15:00.000+02:00", "crawled": "2018-01-29T18:21:27.003+02:00", "highlightTitle": ""}