{"organizations": [], "uuid": "9ce8171de3e22faaad6fca44f0b15f37ff8c70a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226542428&w=1200&r=LYNXMPEE0T0FY", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/philippines-media/spread-of-fake-news-aims-to-silence-dissent-says-chief-of-embattled-philippine-site-idINKBN1FJ0ZU", "country": "US", "domain_rank": 408, "title": "Spread of fake news aims to silence dissent, says chief of embattled Philippine site", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T10:52:00.000+02:00", "replies_count": 0, "uuid": "9ce8171de3e22faaad6fca44f0b15f37ff8c70a1"}, "author": "", "url": "https://in.reuters.com/article/philippines-media/spread-of-fake-news-aims-to-silence-dissent-says-chief-of-embattled-philippine-site-idINKBN1FJ0ZU", "ord_in_thread": 0, "title": "Spread of fake news aims to silence dissent, says chief of embattled Philippine site", "locations": [], "entities": {"persons": [{"name": "maria ressa", "sentiment": "none"}, {"name": "rappler", "sentiment": "none"}, {"name": "ressa", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}, {"name": "philippine", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "freedom house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 8:55 AM / Updated 18 minutes ago Spread of fake news aims to silence dissent, says chief of embattled Philippine site Reuters Staff 3 Min Read \nMANILA (Reuters) - The head of a Philippine online news site battling revocation of its licence on Tuesday said some governments have sought to “silence dissent” through the proliferation of fake news, flooding social media with hate messages. \nThere is now state-sponsored “patriotic trolling” designed to harass and intimidate, Maria Ressa, the chief executive of the news site, Rappler, told senators holding an inquiry into the spread of fake news in the Philippines. \n“Social media provided cheap armies to potential authoritarian and dictators to control and manipulate public opinion,” Ressa said, citing a study in which Rappler participated that is set to be released in the next few months. \nShe did not provide details of the study, but said it mirrored the findings of a survey of 65 countries released last November by a U.S.-based group, Freedom House, that showed China and Russia were flooding social media with lies and disinformation, rather than seeking to control them. \nRessa also demonstrated for the senators how fake news was manufactured by false accounts and spread in Facebook, the top social media platform in the Philippines, with nearly 70 million users. \nGovernments have “weaponised the internet” to push propaganda, she said, but joined other journalists, bloggers and even the government’s communications office, to resist senators’ plans for measures to rein in social media. \nIn Southeast Asia, the media fear authoritarian leaders will use new laws to target legitimate news outlets critical of them, rather than focus on false stories published on social media, as they tighten clampdowns. \n“There are existing laws,” she said. “I don’t believe that we should have more legislation but I think we should impose existing laws on this and demand accountability.” \nThe courts can deal with false information maligning people, \nsaid Roby Alampay, editor in chief of the BusinessWorld daily, asking lawmakers not to legislate controls on free speech, expression and the press. \n“The important thing is to use our rights, to use your laws and to fight back,” Alampay added. \nNo laws will be passed to suppress freedom of the media and expression, said Grace Poe, head of the senate panel on public information, adding that senators were only interested on how to regulate the spread of false information on social media. \nRappler has invoked freedom of the press in its appeal to the Court of Appeals in the Philippines, challenging a decision of the Securities and Exchange Commission to revoke its license for violations of foreign equity curbs on domestic media. Reporting by Manuel Mogato; Additional reporting by Karen Lema; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-30T10:52:00.000+02:00", "crawled": "2018-01-30T11:22:00.022+02:00", "highlightTitle": ""}