{"organizations": [], "uuid": "6b7d49293a7ae5cd2cf8d1f23775c21defe5b9b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 19}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/04/104877794-RTX3L5V1-facebook.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/facebook-revamps-privacy-settings-ahead-of-strict-new-eu-laws.html", "country": "US", "domain_rank": 767, "title": "Facebook revamps privacy settings ahead of strict new EU laws", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T11:57:00.000+02:00", "replies_count": 0, "uuid": "6b7d49293a7ae5cd2cf8d1f23775c21defe5b9b8"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/29/facebook-revamps-privacy-settings-ahead-of-strict-new-eu-laws.html", "ord_in_thread": 0, "title": "Facebook revamps privacy settings ahead of strict new EU laws", "locations": [], "entities": {"persons": [{"name": "toby melville", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "general data protection regulation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook is overseeing a transparency drive ahead of the introduction of stringent data protection rules in the European Union (EU).\n\nAs global tech behemoths scramble to prepare for the impact of looming EU data privacy regulations, Facebook announced Sunday that it had published its so-called privacy principles for the first time. The privacy controls detail how the company handles users' information.\n\"We recognize that people use Facebook to connect, but not everyone wants to share everything with everyone — including with us,\" Erin Egan, chief privacy officer at Facebook, wrote in a blog post .\nGetting ready for GDPR The announcement from the world's largest social network is widely seen as an attempt to get ready for the introduction of the EU's General Data Protection Regulation (GDPR) on May 25. The pending data protection shake-up marks the biggest overhaul of personal data privacy rules since the birth of the internet.\nAmong other things, GDPR aims to boost a person's right to be forgotten as well as guaranteeing them free and easy access to their own personal data.\n\nFacebook's privacy principles — which are separate from the terms and conditions agreed to when someone opens an account — advise users on a range of issues, including how to manage the data the website uses to show them adverts, how to delete old posts and what happens when they delete their account.\nErik Tham | Corbis Documentary | Getty Images Facebook, which has more than 2 billion users , said it would soon roll out educational videos in order to help users control who is able to access their information. And instead of dispersing privacy information across the social network, it has moved all of its security settings onto one page.\n\"We put products through rigorous data security testing. We also meet with regulators, legislators and privacy experts around the world to get input on our data practices and policies,\" the blog post said.\nTransatlantic consequences The level of fines for companies found to be in breach of data protection laws is set to increase significantly under GDPR. Business could be fined as much as 4 percent of global turnover or 20 million euros, whichever figure is greater.\nSpeaking in Brussels, Belgium, last week, Sheryl Sandberg, chief operating officer at Facebook, said the company's upcoming changes would give it \"a very good foundation to meet all the requirements of GDPR and to spur us on to continue investing in products and in educational tools to protect privacy.\"\nIn recent years, Facebook has faced probes from EU regulators over its use of data and tracking of online activities.\nWhile strict new regulations are poised to come into force in the EU in May, the changes are also rippling out worldwide with Google and Amazon both amending their respective privacy processes in recent weeks.", "external_links": [], "published": "2018-01-29T11:57:00.000+02:00", "crawled": "2018-01-29T11:57:26.022+02:00", "highlightTitle": ""}