{"organizations": [], "uuid": "7f0a9c90bf5d3ed45d11544201ec99e97fb82dfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-immunogen-appoints-stuart-a-arbuckle-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "ImmunoGen Appoints Stuart A. Arbuckle to Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T16:00:00.000+02:00", "replies_count": 0, "uuid": "7f0a9c90bf5d3ed45d11544201ec99e97fb82dfc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-immunogen-appoints-stuart-a-arbuckle-to-board-of-directors.html", "ord_in_thread": 0, "title": "ImmunoGen Appoints Stuart A. Arbuckle to Board of Directors", "locations": [], "entities": {"persons": [{"name": "stuart a. arbuckle", "sentiment": "negative"}, {"name": "howard pien", "sentiment": "none"}, {"name": "howard", "sentiment": "none"}, {"name": "arbuckle", "sentiment": "none"}, {"name": "stephen mccluski", "sentiment": "none"}, {"name": "mccluski", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}], "organizations": [{"name": "immunogen", "sentiment": "negative"}, {"name": "board", "sentiment": "none"}, {"name": "stuart a. arbuckle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass.--(BUSINESS WIRE)-- ImmunoGen, Inc. (Nasdaq: IMGN), a leader in the expanding field of antibody-drug conjugates (ADCs) for the treatment of cancer, today announced the appointment of Stuart A. Arbuckle to its Board of Directors. Mr. Arbuckle is replacing Howard Pien, who is stepping down from ImmunoGen’s Board after eight years of service.\n“We are grateful for Howard’s many contributions to ImmunoGen over the last eight years,” stated Stephen McCluski, ImmunoGen’s Chairman of the Board. “His counsel on a range of strategic issues has been instrumental as we’ve strengthened our leadership in ADCs and progressed our pipeline of novel candidates through clinical development. We value Howard’s collaboration and contributions to the Board and wish him continued success in his endeavors outside of ImmunoGen.”\n“Stuart joins ImmunoGen’s Board at a pivotal moment in the Company’s evolution,” Mr. McCluski continued. “His international commercial expertise will be vital as we continue to advance mirvetuximab soravtansine in the FORWARD I registration trial, accelerate the development of our earlier-stage ADC assets, and evolve into a business with marketed products.”\nMr. Arbuckle has more than 30 years of experience in building biopharmaceutical commercial organizations and has served as Vertex’s Executive Vice President and Chief Commercial Officer since 2012, leading the successful global launches of Kalydeco ® and Orkambi ® . Prior to joining Vertex, Mr. Arbuckle held multiple commercial leadership roles at Amgen, Inc., most recently serving as Vice President and Regional General Manager overseeing the expansion of the company’s presence in Japan, Asia, the Middle East, and Africa. As Vice President and General Manager of Amgen’s Oncology Business Unit, he was responsible for sales and marketing efforts for Aranesp ® , Neulasta ® and NEUPOGEN ® , and led the successful launches of XGEVA ® and Nplate ® . Prior to Amgen, Mr. Arbuckle held commercial roles of increasing responsibility at Celltech Pharmaceuticals and GlaxoSmithKline. He also previously served as a member of Cerulean Pharma’s Board of Directors. He is currently a national board member of the Cancer Support Community, a member of the Executive Committee and Health Section Governing Board for the Biotechnology Innovation Organization (BIO), and is co-chair of the BIO Standing Committee on Access and Value. Mr. Arbuckle has a degree in pharmacology and physiology from the University of Leeds in the United Kingdom.\nMr. Arbuckle stated, “ImmunoGen embarked on a journey last year to focus on its highest value programs and develop into a fully integrated biotech company. I’m delighted to offer my insights and work with this Board as ImmunoGen drives long-term value creation and moves towards commercializing its first product.”\nAbout ImmunoGen, Inc.\nImmunoGen is a clinical-stage biotechnology company that develops targeted cancer therapeutics using its proprietary ADC technology. The Company’s lead product candidate, mirvetuximab soravtansine, is in a Phase 3 trial for FRα-positive platinum-resistant ovarian cancer, and is in a Phase 1b/2 trial in combination regimens for earlier-stage disease. ImmunoGen has three additional clinical-stage product candidates, two of which are being developed in collaboration with Jazz Pharmaceuticals. ImmunoGen's ADC technology is also used in Roche's marketed product, Kadcyla ® , and in programs in development by Amgen, Bayer, Biotest, CytomX, Debiopharm, Lilly, Novartis, Sanofi and Takeda. More information about the Company can be found at www.immunogen.com .\nKalydeco ® , Orkambi ® , Aranesp ® , Neulasta ® , NEUPOGEN ® , XGEVA ® , Nplate ® , and Kadcyla ® are registered trademarks of their respective owners.\nThis press release includes forward-looking statements. For these statements, ImmunoGen claims the protection of the safe harbor for forward-looking statements provided by the Private Securities Litigation Reform Act of 1995. It should be noted that there are risks and uncertainties related to the development of novel anticancer products, including risks related to preclinical and clinical studies, their timings and results. A review of these risks can be found in ImmunoGen's Transition Report on Form 10-KT for the six-month transition period ended December 31, 2016 and other reports filed with the Securities and Exchange Commission.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005182/en/\nFor Investors\nImmunoGen, Inc.\nSarah Kiely, 781-895-0600\nsarah.kiely@immunogen.com\nor\nFor Media\nImmunoGen, Inc.\nCourtney O'Konek, 781-895-0600\ncourtney.okonek@immunogen.com\nor\nFTI Consulting, Inc.\nRobert Stanislaro, 212-850-5657\nrobert.stanislaro@fticonsulting.com\nSource: ImmunoGen, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.immunogen.com%2F&esheet=51747573&newsitemid=20180124005182&lan=en-US&anchor=www.immunogen.com&index=3&md5=af02f55d555bcac37deb2d134a6d906e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.immunogen.com&esheet=51747573&newsitemid=20180124005182&lan=en-US&anchor=ImmunoGen%2C+Inc.&index=1&md5=3373739f1a54864bce4cc0fe43191424", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.vrtx.com%2Fleadership%2Fstuart-arbuckle&esheet=51747573&newsitemid=20180124005182&lan=en-US&anchor=Stuart+A.+Arbuckle&index=2&md5=8ccb2f293469c0e920a402a1294c0df7", "http://www.businesswire.com/news/home/20180124005182/en/"], "published": "2018-01-24T16:00:00.000+02:00", "crawled": "2018-01-24T17:32:08.015+02:00", "highlightTitle": ""}