{"organizations": [], "uuid": "ede46465ed1f121182c2fa0bce171bf91c759935", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-baringtonhilco-acquisition-corp-stockholders-approve-extension-of-date-to-consummate-business-combination.html", "country": "US", "domain_rank": 767, "title": "Barington/Hilco Acquisition Corp. Stockholders Approve Extension Of Date To Consummate Business Combination", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.383, "site_type": "news", "published": "2018-01-04T21:23:00.000+02:00", "replies_count": 0, "uuid": "ede46465ed1f121182c2fa0bce171bf91c759935"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-baringtonhilco-acquisition-corp-stockholders-approve-extension-of-date-to-consummate-business-combination.html", "ord_in_thread": 0, "title": "Barington/Hilco Acquisition Corp. Stockholders Approve Extension Of Date To Consummate Business Combination", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "barington/hilco acquisition corp", "sentiment": "negative"}, {"name": "barington/hilco acquisition corp.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 4, 2018 /PRNewswire/ -- Barington/Hilco Acquisition Corp. (NASDAQ: BHAC), a special purpose acquisition corporation (the \"Company\"), announced today that stockholders have approved an extension of the date by which it must complete a business combination (the \"Extension\"). The Extension allows the Company until June 30, 2018 to complete a business combination.\nFollowing redemptions associated with the Extension, a total of approximately $9.2 million remains in the Company's trust account. In connection with the Extension, the Company agreed to contribute to the trust account $0.04 for each public share that was not converted in connection with the stockholder vote to approve the Extension, for each 30-day period, or portion thereof, that is needed by the Company to complete a business combination until June 30, 2018 (the \"Contribution\"). This will increase the pro rata portion of the funds available in the trust account in the event of the consummation of a business combination or a liquidation from approximately $10.48 per share to approximately $10.71 per share, assuming the Company takes the full time through June 30, 2018 to complete a business combination. The Company has funded the Contribution in the amount of $105,356.28 in the trust account for the three-month period from December 31, 2017 until March 31, 2018.\nAbout Barington/Hilco Acquisition Corp.\nBarington/Hilco Acquisition Corp. is a blank check company formed for the purpose of entering into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization or other similar business combination.\nForward-Looking Statements\nThis press release contains \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as \"anticipate\", \"believe\", \"expect\", \"estimate\", \"plan\", \"outlook\", and \"project\" and other similar expressions that predict or indicate future events or trends or that are not statements of historical matters. Such forward-looking statements include statements concerning the potential business combination. These statements are based on the Company's management's current expectations and beliefs, as well as a number of assumptions concerning future events.\nSuch forward-looking statements are subject to known and unknown risks, uncertainties, assumptions and other important factors, many of which are outside of the Company's control that could cause actual results to differ materially from the results discussed in the forward-looking statements. Additional factors that could cause actual results to differ materially from those expressed or implied in forward-looking statements can be found in the Company's most recent annual report on Form 10-K and subsequently filed quarterly reports on Form 10-Q and current reports on Form 8-K, which are available, free of charge, at the SEC's website at www.sec.gov .\nView original content: http://www.prnewswire.com/news-releases/baringtonhilco-acquisition-corp-stockholders-approve-extension-of-date-to-consummate-business-combination-300577787.html\nSOURCE Barington/Hilco Acquisition Corp.", "external_links": ["http://www.prnewswire.com/news-releases/baringtonhilco-acquisition-corp-stockholders-approve-extension-of-date-to-consummate-business-combination-300577787.html"], "published": "2018-01-04T21:23:00.000+02:00", "crawled": "2018-01-04T22:53:56.000+02:00", "highlightTitle": ""}