{"organizations": [], "uuid": "fd075b2a25df90f28f6b3e3017d8eece8635c335", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-tessco-reports-third-quarter-2018-financial-results.html", "country": "US", "domain_rank": 767, "title": "Tessco Reports Third-Quarter 2018 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:06:00.000+02:00", "replies_count": 0, "uuid": "fd075b2a25df90f28f6b3e3017d8eece8635c335"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-tessco-reports-third-quarter-2018-financial-results.html", "ord_in_thread": 0, "title": "Tessco Reports Third-Quarter 2018 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "md.", "sentiment": "none"}], "organizations": [{"name": "tessco", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Quarterly Revenues of $146 Million\nEarnings Per Share Increase to $0.19\nQuarterly Dividend of $0.20 Per Share Continued\nHUNT VALLEY, Md.--(BUSINESS WIRE)-- TESSCO TECHNOLOGIES INCORPORATED (NASDAQ: TESS) , today reported financial results for its third quarter of fiscal 2018, ended December 24, 2017.\nThird-Quarter Highlights:\nRevenue of $146.3 million Revenue growth in government, value-added reseller and private system operator markets Overall expense management contributed to operating margin of 1.5%, compared with 1.4% in the third quarter of fiscal 2017 Recorded benefit from new federal tax law of approximately $0.3 million $0.19 EPS and $0.38 EBITDA per diluted share* Company expects a profitable fourth quarter for the first time in three years, with year-over-year double-digit fourth-quarter revenue growth Declared quarterly dividend of $0.20 per share\nThird Quarter\nFY 2018\nThird Quarter\nFY 2017\nSecond Quarter\nFY 2018\nRevenue $146.3M $147.2M $145.1M Earnings per diluted share $0.19 $0.15 $0.21 EBITDA per diluted share* $0.38 $0.38 $0.51 Operating margin 1.5% 1.4% 2.2% Cash balance $0.0M $8.4M $0.2M Line of credit balance outstanding\n$5.9M $0.0M $13.3M * EBITDA per diluted share and EBITDA (on which EBITDA per diluted share is based) are Non-GAAP financial measures. Non-GAAP financial measures indicated by an asterisk (*) either in the above chart or in the text of this press release are so indicated as a means to direct the reader to the discussion of Non-GAAP Information below and the reconciliation of Non-GAAP to GAAP results included as an exhibit to this press release.\nThird-Quarter Revenue by Market:\nYear over Year\nQ3 FY 2018 vs.\nQ3 FY 2017\nSequential\nQ3 FY 2018 vs.\nQ2 FY 2018\nPublic Carrier (12)% (17)% Value-Added Resellers 8% (4)% Government 29% (3)% Private System Operators 8% 3% Retail (8)% 15% Total (1)% 1% “We executed well on our strategic initiatives during the third quarter, putting us on pace to finish the year with revenue growth and a significant increase in profitability,” said Murray Wright, President and Chief Executive Officer. “On the top line, sales were slightly down primarily due to the timing of orders in the carrier ecosystem. We expect this decline will be more than offset by increased sales in the fourth quarter, as the pipeline for this market is very strong. Outside of the carrier market, sales were up in the government, value-added reseller and private system operator markets. Our bottom-line growth was a direct result of improved operating leverage due to our successful productivity enhancements, as well as a lower effective tax rate resulting from the new tax law.\n“As we approach the finish of the 2018 fiscal year, we are confident we will continue to execute our strategic plan,” Wright continued. “We are focused on balancing the implementation of our go-to-market strategy with improved operating efficiency. Our emphasis on improving the customer experience is generating increased opportunities. We are leveraging a strong value proposition, and we expect double-digit, year-over-year revenue growth in our fourth quarter. Unlike the previous two fourth quarters, we expect positive bottom-line earnings.”\nThird-Quarter Fiscal 2018 Financial Results\nFor the fiscal 2018 third quarter, revenues totaled $146.3 million, compared with $147.2 million for the third quarter of fiscal 2017. Increases in sales to the Company’s government, value-added reseller and private system operator markets were offset by year-over-year declines in sales to the public carrier and retail markets.\nGross profit was $29.6 million for the third quarter of fiscal 2018, compared with $30.0 million for the same quarter of fiscal 2017. The slight decline in third quarter gross profit year over year was primarily the result of the decline in total sales. Gross margin was 20.2% of revenue for the third quarter of fiscal 2018, compared with 20.4% for last year’s third quarter.\nAs a result of the Company’s ongoing expense control initiatives and productivity enhancements, selling, general and administrative (SG&A) expenses decreased by $0.4 million to $27.4 million for the third quarter of fiscal 2018, from $27.9 million in the same quarter of the prior year.\nPrimarily as a result of the new tax law, the Company’s provision for income taxes declined from $0.8 million in last year’s third quarter to $0.5 million in this year’s third quarter.\nNet income and earnings per share (EPS) were $1.6 million and $0.19, respectively, for the third quarter of fiscal 2018, compared with net income and EPS of $1.2 million and $0.15, respectively, for the prior-year third quarter.\nYear to date, net income and earnings per share were $4.0 million and $0.48, respectively, compared to $2.3 million and $0.28 in the same period of fiscal 2017. Revenue and gross profit increased 5% and 3%, respectively, over the same period.\nBalance Sheet and Cash Flows\nAs of December 24, 2017, the outstanding balance on the Company’s line of credit was $5.9 million. Cash flow used in operations was $7.3 million during the first nine months of the 2018 fiscal year, primarily due to increases in inventory and accounts receivable. Inventory increased by $2.5 million during the first nine months of the fiscal year to $66.5 million as of December 24, 2017. Trade accounts receivable increased $20.3 million in the first nine months of the year to $85.0 million. During the third quarter, inventory and trade accounts receivable both decreased sequentially, resulting in cash provided by operations for the quarter of $9.5 million. The Company expects inventory and the balance on its line of credit to grow during the fourth quarter as it continues to implement new strategic programs with significant carrier customers while also building inventory for the spring building season.\nCash Dividend\nThe Company’s Board of Directors has declared a quarterly cash dividend of $0.20 per common share payable on February 28, 2018 to common stockholders of record on February 14, 2018. Any future declaration of dividends, and the establishment of record and payment dates, is subject to future determinations of the Board of Directors.\nBusiness Outlook\nThe Company currently anticipates double-digit year-over-year revenue growth and to be profitable in its fiscal 2018 fourth quarter.\nForecasting future results or trends is inherently difficult for any business, and actual results or trends may differ materially from those forecasted. The nature of the business is that TESSCO typically ships products within several days after booking orders. The lack of an order backlog makes it even more difficult to forecast future results. The Business Outlook published in this press release reflects only the company’s current best estimate and it assumes no obligation to update the information contained in this press release, including the Business Outlook, at any time.\nThird-Quarter Fiscal 2018 Conference Call\nManagement will host a conference call to discuss third quarter 2018 results tomorrow, Wednesday, January 24, 2018 at 8:30 a.m. ET. To participate in the conference call, please call: 855-319-5921 (domestic call-in) or 503-343-6034 (international call-in) and reference code #6563009.\nA live webcast of the conference call will be available on the Events page of the Company’s website. All participants should call or access the website approximately 10 minutes before the conference begins.\nA telephone replay of the conference call will be available from 11:30 a.m. ET on January 24, 2018 until 11:59 p.m. ET on January 31, 2018 by calling 855-859-2056 (domestic) or 404-537-3406 (international) and entering confirmation #6563009. An archived replay of the conference call will also be available on the Company's website .\nNon-GAAP Information\nEBITDA and EBITDA per diluted share are measures used by management to evaluate the Company’s ongoing operations, and to provide a general indicator of the Company's operating cash flow (in conjunction with a cash flow statement which also includes among other items, changes in working capital and the effect of non-cash charges). EBITDA is defined as income from operations, plus interest expense, net of interest income, provision for income taxes, and depreciation and amortization. EBITDA per diluted share is defined as EBITDA divided by Tessco’s diluted weighted average shares outstanding.\nManagement believes EBITDA and EBITDA per share are useful to investors because they are frequently used by securities analysts, investors and other interested parties in the evaluation of companies. Because not all companies use identical calculations, the Company’s presentation of these Non-GAAP measures may not be comparable to other similarly titled measures of other companies. Neither EBITDA nor EBITDA per diluted share is a recognized term under GAAP, and EBITDA does not purport to be an alternative to net income as a measure of operating performance or to cash flows from operating activities as a measure of liquidity. Additionally, neither EBITDA nor EBITDA per diluted share is intended to be a measure of free cash flow for management's discretionary use, as certain cash requirements, such as interest payments, tax payments and debt service requirements, are not reflected.\nA reconciliation of Non-GAAP to GAAP results is included as an exhibit to this release.\nAbout TESSCO Technologies Incorporated (NASDAQ: TESS)\nTESSCO Technologies Incorporated (NASDAQ: TESS) is a value-added technology distributor, manufacturer and solutions provider. Tessco was founded more than 30 years ago with a commitment to deliver industry-leading products, knowledge, solutions and customer service and supports customers in the public and private sector. Tessco supplies more than 50,000 products from 400 of the industry’s top manufacturers in mobile communications, Wi-Fi, Internet of Things, wireless backhaul and more. Tessco is a single source for outstanding customer experience, expert knowledge and complete end-to-end solutions for the wireless industry. www.tessco.com .\nForward-Looking Statements\nThis press release contains as to anticipated results and future prospects. are based on current expectations and analysis, and actual results may differ materially. may generally be identified by the use of the words \"may,\" \"will,\" \"expects,\" \"anticipates,\" \"believes,\" \"estimates,\" and similar expressions, but the absence of these words or phrases does not necessarily mean that a statement is not forward-looking. involve a number of risks and uncertainties. Our actual results may differ materially from those described in or contemplated by any such forward-looking statement for a variety of reasons, including those risks identified in our most recent other periodic Commission, under the heading \"Risk Factors\" and otherwise. Consequently, the reader is cautioned to consider all in light of the risks to which they are subject.\nWe are not able to identify or control all circumstances that could occur in the future that may adversely affect our business and operating results. Without limiting the risks that we describe in our periodic reports and elsewhere, among the risks that could lead to a materially adverse impact on our business or operating results are the following: termination or non-renewal of limited duration agreements or arrangements with our vendors and affinity partners that are typically terminable by either party upon several months or otherwise relatively short notice; loss of significant customers or relationships, including affinity relationships; loss of customers either directly or indirectly as a result of consolidation among large wireless services carriers and others within the wireless communications industry; the strength of our customers', vendors' and affinity partners' business; negative or adverse economic conditions, including those adversely affecting consumer confidence or consumer or business spending or otherwise adversely impacting our vendors or customers, including their access to capital or liquidity, or our customers' demand for, or ability to fund or pay for, the purchase of our products and services; our dependence on a relatively small number of suppliers and vendors, which could hamper our ability to maintain appropriate inventory levels and meet customer demand; changes in customer and product mix that affect gross margin; effect of “conflict minerals” regulations on the supply and cost of certain of our products; failure of our information technology system or distribution system; system security or data protection breaches; technology changes in the wireless communications industry or technological failures, which could lead to significant inventory obsolescence and/or our inability to offer key products that our customers demand; third-party freight carrier interruption; increased competition from competitors, including manufacturers or national and regional distributors of the products we sell and the absence of significant barriers to entry which could result in pricing and other pressures on profitability and market share; our relative bargaining power and inability to negotiate favorable terms with our vendors and customers; our inability to access capital and obtain financing as and when needed; transitional and other risks associated with acquisitions of companies that we may undertake in an effort to expand our business; claims against us for breach of the intellectual property rights of third parties; product liability claims; our inability to protect certain intellectual property, including systems and technologies on which we rely; our inability to hire or retain for any reason our key professionals, management and staff; and the possibility that, for unforeseen or other reasons, we may be delayed in entering into or performing, or may fail to enter into or perform, anticipated contracts or may otherwise be delayed in realizing or fail to realize anticipated revenues or anticipated savings.\nTESSCO Technologies Incorporated\nConsolidated Statements of Income (Unaudited)\nFiscal Quarters Ended Nine Months Ended December 24,\n2017\nDecember 25,\n2016\nSeptember 24,\n2017\nDecember 24,\n2017\nDecember 25,\n2016\nRevenues $ 146,260,300 $ 147,198,400 $ 145,083,500 $ 431,354,600 $ 410,692,200 Cost of goods sold 116,660,500 117,229,800 115,160,400 342,664,900 324,862,000 Gross profit 29,599,800 29,968,600 29,923,100 88,689,700 85,830,200 Selling, general and administrative expenses 27,413,200 27,860,700 26,674,400 81,969,100 81,525,900 Income from operations 2,186,600 2,107,900 3,248,700 6,720,600 4,304,300 Interest, net 114,500 37,100 156,500 339,600 65,700 Income before provision for income taxes 2,072,100 2,070,800 3,092,200 6,381,000 4,238,600 Provision for income taxes 501,900 843,100 1,318,300 2,354,000 1,936,200 Net income $ 1,570,200\n$ 1,227,700 $ 1,773,900 $ 4,027,000\n$ 2,302,400 Basic earnings per share $ 0.19 $ 0.15 $ 0.21 $ 0.48 $ 0.28 Diluted earnings per share $ 0.19 $ 0.15 $ 0.21 $ 0.48 $ 0.28 TESSCO Technologies Incorporated\nConsolidated Balance Sheets\nDecember 24,\n2017\nMarch 26,\n2017\n(unaudited) (audited) ASSETS Current Assets: Cash and cash equivalents $ 42,400 $ 8,540,100 Trade accounts receivable, net 85,036,300 64,778,900 Product inventory 66,500,600 63,984,300 Prepaid expenses and other current assets 4,544,100 3,864,100 Total current assets 156,123,400 141,167,400 Property and equipment, net 12,976,000 13,830,900 Goodwill, net 11,677,700 11,677,700 Other long-term assets 7,192,000 7,304,500 Total assets $ 187,969,100 $ 173,980,500 LIABILITIES AND SHAREHOLDERS’ EQUITY Current Liabilities: Trade accounts payable $ 62,383,300 $ 53,581,400 Payroll, benefits and taxes 6,141,500 6,772,100 Income and sales tax liabilities 2,389,600 1,364,700 Accrued expenses and other current liabilities 1,074,200 2,228,200 Revolving line of credit 5,937,100 - Current portion of long-term debt 26,900 26,500 Total current liabilities 77,952,600 63,972,900 Deferred tax liabilities 344,500 386,800 Long-term debt, net of current portion 9,400 29,800 Other long-term liabilities 1,541,800 1,574,700 Total liabilities 79,848,300 65,964,200 Shareholders’ Equity: Preferred stock - - Common stock 98,900 98,400 Additional paid-in capital 60,170,800 59,006,000 Treasury stock, at cost (57,503,000) (57,437,600) Retained earnings 105,354,100 106,349,500 Total shareholders’ equity 108,120,800 108,016,300 Total liabilities and shareholders' equity\n$ 187,969,100 $ 173,980,500 TESSCO Technologies Incorporated\nReconciliation of Net Income to Earnings Before Interest, Taxes and Depreciation and Amortization\n(EBITDA) (Unaudited)\nFiscal Quarters Ended\nNine Months Ended December 24,\n2017\nDecember 25,\n2016\nSeptember 24,\n2017\nDecember 24,\n2017\nDecember 25,\n2016\nNet Income as reported $ 1,570,200 $ 1,227,700 $ 1,773,900 $ 4,027,000 $ 2,302,400 Add: Provision for income taxes 501,900 843,100 1,318,300 2,354,000 1,936,200 Interest, net 114,500 37,100 156,500 339,600 65,700 Depreciation and amortization 999,700 1,085,600 1,041,400 3,030,700 3,361,200 EBITDA $ 3,186,300 $ 3,193,500 $ 4,290,100 $ 9,751,300 $ 7,665,500 Add: Stock based compensation 243,500 98,700 254,300 745,400 291,100 EBITDA, adjusted $ 3,429,800 $ 3,292,200 $ 4,544,400 $ 10,496,700 $ 7,956,600 EBITDA per diluted share $ 0.38 $ 0.38 $ 0.51 $ 1.16 $ 0.92 Adjusted EBITDA per diluted share $ 0.41 $ 0.39 $ 0.54 $ 1.25 $ 0.96 TESSCO Technologies Incorporated\nSupplemental Results Summary (in thousands) (Unaudited)\nThree Months Ended\nDecember 24, 2017\nThree Months Ended\nDecember 25, 2016\nGrowth Rates Compared to\nPrior Year Period\nMarket Revenues Commercial Retail Total Commercial Retail Total Commercial Retail Total Public Carrier $ 22,721 $ - $ 22,721 $ 25,851 $ - $ 25,851 (12.1%) - (12.1%) Government 10,680 - 10,680 8,250 - 8,250 29.5% - 29.5% Private System Operators 24,844 - 24,844 22,927 - 22,927 8.4% - 8.4% Value Added Resellers 33,557 - 33,557 31,069 - 31,069 8.0% - 8.0% Retail - 54,458 54,458 - 59,101 59,101 - (7.9%) (7.9%) Total revenues $ 91,802 $ 54,458 $ 146,260 $ 88,097 $ 59,101 $ 147,198 4.2% (7.9%) (0.6%) Market Gross Profit Commercial Retail Total Commercial Retail Total Commercial Retail Total Public Carrier $ 3,178 $ - $ 3,178 $ 4,070 $ - $ 4,070 (21.9%) - (21.9%) Government 2,256 - 2,256 1,843 - 1,843 22.4% - 22.4% Private System Operators 5,305 - 5,305 4,902 - 4,902 8.2% - 8.2% Value Added Resellers 8,512 - 8,512 8,712 - 8,712 (2.3%) - (2.3%) Retail - 10,349 10,349 - 10,442 10,442 - (0.9%) (0.9%) Total gross profit $ 19,251 $ 10,349 $ 29,600 $ 19,527 $ 10,442 $ 29,969 (1.4%) (0.9%) (1.2%) % of revenues 21.0% 19.0% 20.2% 22.2% 17.7% 20.4% TESSCO Technologies Incorporated\nSupplemental Results Summary (in thousands) (Unaudited)\nThree Months\nEnded\nDecember 24,\n2017\nThree Months\nEnded\nDecember 25,\n2016\nGrowth Rates\nCompared to\nPrior Year\nPeriod\nProduct Revenues\nBase Station Infrastructure $ 57,282 $ 52,193 9.8% Network Systems 24,024 25,242 (4.8%) Installation, Test and Maintenance 9,255 9,633 (3.9%) Mobile Device Accessories 55,699 60,130 (7.4%) Total revenues $ 146,260 $ 147,198 (0.6%) Product Gross Profit\nBase Station Infrastructure $ 13,280 $ 13,857 (4.2%) Network Systems 3,420 3,186 7.3% Installation, Test and Maintenance 1,759 1,594 10.4% Mobile Device Accessories 11,141 11,332 (1.7%) Total gross profit $ 29,600 $ 29,969 (1.2%) % of revenues 20.2% 20.4% TESSCO Technologies Incorporated\nSupplemental Results Summary (in thousands) (Unaudited)\nThree Months Ended\nDecember 24, 2017\nThree Months Ended\nSeptember 24, 2017\nGrowth Rates Compared to\nPrior Period\nMarket Revenues Commercial Retail Total Commercial Retail Total Commercial Retail Total Public Carrier $ 22,721 $ - $ 22,721 $ 27,423 $ - $ 27,423 (17.1%) - (17.1%) Government 10,680 - 10,680 11,025 - 11,025 (3.1%) - (3.1%) Private System Operators 24,844 - 24,844 24,207 - 24,207 2.6% - 2.6% Value Added Resellers 33,557 - 33,557 34,951 - 34,951 (4.0%) - (4.0%) Retail - 54,458 54,458 - 47,478 47,478 - 14.7% 14.7% Total revenues $ 91,802 $ 54,458 $ 146,260 $ 97,606 $ 47,478 $ 145,084 (5.9%) 14.7% 0.8% Market Gross Profit Commercial Retail Total Commercial Retail Total Commercial Retail Total Public Carrier $ 3,178 $ - $ 3,178 $ 3,777 $ - $ 3,777 (15.9%) - (15.9%) Government 2,256 - 2,256 2,412 - 2,412 (6.5%) - (6.5%) Private System Operators 5,305 - 5,305 5,054 - 5,054 5.0% - 5.0% Value Added Resellers 8,512 - 8,512 8,942 - 8,942 (4.8%) - (4.8%) Retail - 10,349 10,349 - 9,738 9,738 - 6.3% 6.3% Total gross profit $ 19,251 $ 10,349 $ 29,600 $ 20,185 $ 9,738 $ 29,923 (4.6%) 6.3% (1.1%) % of revenues 21.0% 19.0% 20.2% 20.7% 20.5% 20.6% TESSCO Technologies Incorporated\nSupplemental Results Summary (in thousands) (Unaudited)\nThree Months\nEnded\nDecember 24,\n2017\nThree Months\nEnded\nSeptember 24,\n2017\nGrowth Rates\nCompared to\nPrior Period\nProduct Revenues\nBase Station Infrastructure $ 57,282 $ 59,448 (3.6%) Network Systems 24,024 29,180 (17.7%) Installation, Test and Maintenance 9,255 7,679 20.5% Mobile Device Accessories 55,699 48,777 14.2% Total revenues $ 146,260 $ 145,084 0.8%\nProduct Gross Profit\nBase Station Infrastructure $ 13,280 $ 14,086 (5.7%) Network Systems 3,420 3,921 (12.8%) Installation, Test and Maintenance 1,759 1,433 22.7% Mobile Device Accessories 11,141 10,483 6.3% Total gross profit $ 29,600 $ 29,923 (1.1%) % of revenues 20.2% 20.6% TESSCO Technologies Incorporated\nSupplemental Results Summary (in thousands) (Unaudited)\nNine Months Ended\nDecember 24, 2017\nNine Months Ended\nDecember 25, 2016\nGrowth Rates Compared to\nPrior Year Period\nMarket Revenues Commercial Retail Total Commercial Retail Total Commercial Retail Total Public Carrier $ 76,742 $ - $ 76,742 $ 60,961 $ - $ 60,961 25.9% - 25.9% Government 30,150 - 30,150 27,092 - 27,092 11.3% - 11.3% Private System Operators 70,093 - 70,093 64,222 - 64,222 9.1% - 9.1% Value Added Resellers 103,548 - 103,548 98,769 - 98,769 4.8% - 4.8% Retail - 150,822 150,822 - 159,648 159,648 - (5.5%) (5.5%) Total revenues $ 280,533 $ 150,822 $ 431,355 $ 251,044 $ 159,648 $ 410,692 11.7% (5.5%) 5.0% Market Gross Profit Commercial Retail Total Commercial Retail Total Commercial Retail Total Public Carrier $ 11,083 $ - $ 11,083 $ 10,323 $ - $ 10,323 7.4% - 7.4% Government 6,672 - 6,672 6,075 - 6,075 9.8% - 9.8% Private System Operators 14,966 - 14,966 14,081 - 14,081 6.3% - 6.3% Value Added Resellers 26,415 - 26,415 27,218 - 27,218 (3.0%) - (3.0%) Retail - 29,554 29,554 - 28,134 28,134 - 5.0% 5.0% Total gross profit $ 59,136 $ 29,554 $ 88,690 $ 57,697 $ 28,134 $ 85,831 2.5% 5.0% 3.3% % of revenues 21.1% 19.6% 20.6% 23.0% 17.6% 20.9% TESSCO Technologies Incorporated\nSupplemental Results Summary (in thousands) (Unaudited)\nNine Months\nEnded\nDecember 24,\n2017\nNine Months\nEnded\nDecember 25,\n2016\nGrowth Rates\nCompared to\nPrior Year\nPeriod\nProduct Revenues\nBase Station Infrastructure $ 175,800 $ 157,090 11.9% Network Systems 77,041 65,133 18.3% Installation, Test and Maintenance 23,927 25,269 (5.3%) Mobile Device Accessories 154,587 163,200 (5.3%) Total revenues $ 431,355 $ 410,692 5.0%\nProduct Gross Profit\nBase Station Infrastructure $ 41,423 $ 40,738 1.7% Network Systems 11,170 9,505 17.5% Installation, Test and Maintenance 4,611 4,538 1.6% Mobile Device Accessories 31,486 31,050 1.4% Total gross profit $ 88,690 $ 85,831 3.3% % of revenues 20.6% 20.9%\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006468/en/\nTESSCO Technologies Incorporated\nAric Spitulnik, 410-229-1419\nChief Financial Officer\nspitulnik@tessco.com\nor\nSharon Merrill Associates\nDavid Calusdian, 617-542-5300\nTESS@investorrelations.com\nSource: TESSCO Technologies Incorporated", "external_links": ["http://www.businesswire.com/news/home/20180123006468/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftesscotechnologies.gcs-web.com%2Finvestor-resources%2Fevents&esheet=51747621&newsitemid=20180123006468&lan=en-US&anchor=Events&index=1&md5=eb82dce612e54a3d4072973997faf8b4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tessco.com&esheet=51747621&newsitemid=20180123006468&lan=en-US&anchor=www.tessco.com&index=3&md5=eb0ae8a7671936329f9c00f2a19a0502", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftesscotechnologies.gcs-web.com%2Finvestor-resources%2Fevents&esheet=51747621&newsitemid=20180123006468&lan=en-US&anchor=website&index=2&md5=5510777e56ce9a40db628d946ec7428d"], "published": "2018-01-24T00:06:00.000+02:00", "crawled": "2018-01-24T00:40:27.016+02:00", "highlightTitle": ""}