{"organizations": [], "uuid": "7b0a94430be333a357c1e52b360968f095af1e82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-ellsworth-growth-and-income-fund-ltd-reaffirms-its-5-percent-minimum-distribution-policy-and-declares-distribution-of-0.html", "country": "US", "domain_rank": 767, "title": "Ellsworth Growth and Income Fund Ltd Reaffirms Its 5% Minimum Distribution Policy and Declares Distribution of $0.11 Per Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:05:00.000+02:00", "replies_count": 0, "uuid": "7b0a94430be333a357c1e52b360968f095af1e82"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-ellsworth-growth-and-income-fund-ltd-reaffirms-its-5-percent-minimum-distribution-policy-and-declares-distribution-of-0.html", "ord_in_thread": 0, "title": "Ellsworth Growth and Income Fund Ltd Reaffirms Its 5% Minimum Distribution Policy and Declares Distribution of $0.11 Per Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}], "organizations": [{"name": "the board of trustees of ellsworth growth and income fund ltd.", "sentiment": "negative"}, {"name": "ellsworth growth and income fund ltd", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "board of trustees", "sentiment": "none"}, {"name": "fund", "sentiment": "none"}, {"name": "ecf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RYE, N.Y.--(BUSINESS WIRE)-- The Board of Trustees of Ellsworth Growth and Income Fund Ltd. (NYSE MKT:ECF) (the “Fund”) reaffirmed its 5% distribution policy and declared a $0.11 per share cash distribution payable on February 21, 2018 to common shareholders of record on February 13, 2018.\nThe Fund intends to pay a quarterly distribution of an amount determined each quarter by the Board of Trustees. Under the Fund’s current distribution policy, the Fund intends to pay a minimum annual distribution of 5% of the Fund’s trailing 12-month average month-end market price or an amount sufficient to satisfy the minimum distribution requirements of the Internal Revenue Code for regulated investment companies.\nEach quarter, the Board of Trustees will review the amount of any potential distribution from the income, realized capital gain, or capital available. The Board of Trustees will continue to monitor the Fund’s distribution level, taking into consideration the Fund’s net asset value and the financial market environment. If necessary, the Fund will pay an adjusting distribution in December which includes any additional income and net realized capital gains in excess of the quarterly distributions for that year to satisfy the minimum distribution requirements of the Internal Revenue Code for regulated investment companies. The Fund’s distribution policy is subject to modification by the Board of Trustees at any time, and there can be no guarantee that the policy will continue. The distribution rate should not be considered the dividend yield or total return on an investment in the Fund.\nThe Fund is managed by Gabelli Funds, LLC, and able to make periodic distributions of long term capital gains. All or part of the distribution may be treated as long-term capital gain or qualified dividend income (or a combination of both) for individuals, each subject to the maximum federal income tax rate, which is currently 20% in taxable accounts for individuals (or less depending on an individual’s tax bracket). In addition, certain U.S. shareholders who are individuals, estates or trusts and whose income exceeds certain thresholds will be required to pay a 3.8% Medicare surcharge on their \"net investment income\", which includes dividends received from the Fund and capital gains from the sale or other disposition of shares of the Fund.\nIf the Fund does not generate sufficient earnings (dividends and interest income and realized net capital gain) equal to or in excess of the aggregate distributions paid by the Fund in a given year, then the amount distributed in excess of the Fund’s earnings would be deemed a return of capital. Since this would be considered a return of a portion of a shareholder’s original investment, it is generally not taxable and would be treated as a reduction in the shareholder’s cost basis.\nLong-term capital gains, qualified dividend income, ordinary income, and return of capital, if any, will be allocated on a pro-rata basis to all distributions to common shareholders for the year. Based on the accounting records of the Fund currently available, each of the distributions paid to common shareholders in the Fund’s fiscal year ending September 30, 2018 would include approximately 19% from net investment income and 81% would be deemed a return of capital on a book basis. This does not represent information for tax reporting purposes. The estimated components of each distribution are updated and provided to shareholders of record in a notice accompanying the distribution and are available on our website ( www.gabelli.com ). The final determination of the sources of all distributions in 2018 will be made after year end and can vary from the quarterly estimates. Shareholders should not draw any conclusions about the Fund’s investment performance from the amount of the current distribution. All shareholders with taxable accounts will receive written notification regarding the components and tax treatment for all 2018 distributions in early 2019 via Form 1099-DIV.\nInvestors should carefully consider the investment objectives, risks, charges, and expenses of the Fund before investing. More information regarding the Fund’s distribution policy and other information about the Fund is available by calling 800-GABELLI (800-422-3554) or visiting www.gabelli.com .\nEllsworth Growth and Income Fund Ltd. is a diversified, closed-end management investment company with $167 million in total net assets. ECF invests primarily in convertible securities and common stock, with the objectives of providing income and the potential for capital appreciation; which objectives the Fund considers to be relatively equal, over the long-term, due to the nature of the securities in which it invests. The Fund is managed by Gabelli Funds, LLC, a subsidiary of GAMCO Investors, Inc. (NYSE:GBL).\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005806/en/\nFor Ellsworth Growth and Income Fund Ltd.\nBethany Uhlein, 914-921-5070\nSource: Ellsworth Growth and Income Fund Ltd.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.gabelli.com&esheet=51745332&newsitemid=20180118005806&lan=en-US&anchor=www.gabelli.com&index=2&md5=20d5e63ddfa53bd0f3e5166420db3a1b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.gabelli.com&esheet=51745332&newsitemid=20180118005806&lan=en-US&anchor=www.gabelli.com&index=1&md5=ad5e98451755422e907d5424af91017a", "http://www.businesswire.com/news/home/20180118005806/en/"], "published": "2018-01-19T00:05:00.000+02:00", "crawled": "2018-01-19T01:03:36.013+02:00", "highlightTitle": ""}