{"organizations": [], "uuid": "cc48f59366dff30fb7a6a6ad7dc99ec88289bcb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-ligand-establishes-program-to-develop-captisol-enabled-next-generation-contrast-agents-for-diagnostic-imaging.html", "country": "US", "domain_rank": 767, "title": "Ligand Establishes Program to Develop Captisol-Enabled, Next-Generation Contrast Agents for Diagnostic Imaging", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-19T00:01:00.000+02:00", "replies_count": 0, "uuid": "cc48f59366dff30fb7a6a6ad7dc99ec88289bcb5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-ligand-establishes-program-to-develop-captisol-enabled-next-generation-contrast-agents-for-diagnostic-imaging.html", "ord_in_thread": 0, "title": "Ligand Establishes Program to Develop Captisol-Enabled, Next-Generation Contrast Agents for Diagnostic Imaging", "locations": [], "entities": {"persons": [{"name": "john higgins", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "next-generation contrast agents for diagnostic imaging focus", "sentiment": "negative"}, {"name": "ligand", "sentiment": "negative"}, {"name": "ligand pharmaceuticals incorporated", "sentiment": "none"}, {"name": "verrow pharmaceuticals", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Focus will be on hospital-based products that could benefit from reduced renal toxicity\nLeverages Captisol ® and new intellectual property from Verrow Pharmaceuticals acquisition\nSAN DIEGO--(BUSINESS WIRE)-- Ligand Pharmaceuticals Incorporated (NASDAQ: LGND) announces initiation of a program to develop contrast agents with reduced renal toxicity. Contrast agents are injectable solutions used during diagnostic imaging procedures. Through this new, internally-funded program, Ligand intends to advance products toward proof-of-concept, followed by selling or out-licensing them for further development and commercialization. The program will leverage Ligand’s patented Captisol ® technology, as well as data and intellectual property obtained through its acquisition of Verrow Pharmaceuticals.\n“We view this new initiative as a valuable expansion of Ligand’s pipeline of internally developed programs that utilize our proprietary technologies and IP,” said John Higgins, Chief Executive Officer of Ligand. “Contrast agents are an important component of the diagnostic imaging market; however, they can be toxic and are known to cause kidney damage in some patients. Captisol is a patented, specialized cyclodextrin that plays a role in protecting kidneys from the damaging effects of these agents. This is a potentially highly lucrative product opportunity that Ligand is able to pursue given our ownership of Captisol and our relationships with inventors and scientists in the cyclodextrin field. We are excited to have this program in development and to have secured the associated program rights through our recent acquisition of Verrow Pharmaceuticals.”\nVerrow Pharmaceuticals is a privately-held Lenexa, Kansas-based medical invention company that Ligand acquired in January 2018 for $2 million in cash plus earnouts.\nProgram Highlights:\nContrast agents are used to enhance diagnostic imaging. Despite their benefits and widespread use, contrast agents put an estimated one-fourth of users at risk for renal damage. 1 Captisol-enabled (CE) iohexol has been shown to prevent nephrotoxicity by more than 50% in animal models. 2 Large U.S. market of approximately 20 million imaging procedures per year with iodinated contrast agents, representing an estimated $1.5 billion in annual sales. 3 Initial internal program focused on a CE formulation of iohexol given the large global market, lack of alternatives and focused development path for use in the cardiovascular setting. CE-iohexol program to focus on partnering-enabling studies, with an estimated $6 million of program spend by Ligand over approximately three years. Acquisition of Verrow Pharmaceuticals opens opportunities for broader “nephroprotection use” of Captisol in other hospital-based diagnostics and treatments.\nAbout Captisol-enabled iohexol\nIohexol (marketed as OMNIPAQUE™ by GE Healthcare) is the most widely-used injectable diagnostic contrast agent for imaging procedures with global sales exceeding $500 million and no generic competition in the U.S. Iohexol has a reported incidence of contrast medium-induced nephropathy of 26% 1 , and therefore a significant opportunity exists for a safer alternative formulation. CE-iohexol is expected to potentially establish a new safety standard that enables a future partner to gain meaningful market share. Ligand plans to perform preclinical and clinical partnering-enabling studies for the program.\nAbout Verrow Pharmaceuticals\nVerrow Pharmaceuticals is a medical invention company founded to discover and patent uses of modified cyclodextrins to reduce acute kidney injury during medical interventions including iodine, or gadolinium-based contrast agents, anticancer agents and aminoglycosides. Ligand acquired the assets and related liabilities of Verrow in January of 2018.\nAbout Captisol ®\nCaptisol is a patent-protected, chemically modified cyclodextrin with a structure designed to optimize the solubility and stability of drugs. Captisol was invented and initially developed by scientists in the laboratories of Dr. Valentino Stella, University Distinguished Professor at the University of Kansas’ Higuchi Biosciences Center for specific use in drug development and formulation. This unique technology has enabled several FDA-approved products, including Amgen’s Kyprolis ® , Baxter International’s Nexterone ® , Spectrum’s EVOMELA ® and Melinta Therapeutics’ Baxdela™. There are many Captisol-enabled products currently in various stages of development.\nAbout Ligand Pharmaceuticals\nLigand is a biopharmaceutical company focused on developing or acquiring technologies that help pharmaceutical companies discover and develop medicines. Our business model creates value for stockholders by providing a diversified portfolio of biotech and pharmaceutical product revenue streams that are supported by an efficient and low corporate cost structure. Our goal is to offer investors an opportunity to participate in the promise of the biotech industry in a profitable, diversified and lower-risk business than a typical biotech company. Our business model is based on doing what we do best: drug discovery, early-stage drug development, product reformulation and partnering. We partner with other pharmaceutical companies to leverage what they do best (late-stage development, regulatory management and commercialization) to ultimately generate our revenue. Ligand’s Captisol ® platform technology is a patent-protected, chemically modified cyclodextrin with a structure designed to optimize the solubility and stability of drugs. OmniAb ® is a patent-protected transgenic animal platform used in the discovery of fully human mono-and bispecific therapeutic antibodies. Ligand has established multiple alliances, licenses and other business relationships with the world’s leading pharmaceutical companies including Novartis, Amgen, Merck, Pfizer, Celgene, Gilead, Janssen, Baxter International and Eli Lilly.\nFollow Ligand on Twitter @Ligand_LGND.\nForward-Looking Statements\nThis news release contains forward-looking statements by Ligand that involve risks and uncertainties and reflect Ligand’s judgment as of the date of this release. These include statements regarding: Ligand’s plans to initiate the contrast agent program using CE-iohexol; the market size of contrast agent procedures and the addressable market for Ligand’s new program; the potential to establish a proof-of-concept that CE-iohexol will reduce renal toxicity and establish a new safety standard and for Ligand to partner the program; Ligand’s estimated spend on the new program; and Ligand’s belief that the Verrow acquisition solidified Ligand’s intellectual property position and will open up new market opportunities for Captisol. Actual events or results may differ from our expectations. For example, there can be no assurances that the contrast agent program will be successful in identifying or developing products; Ligand may incur costs associated with the acquisition of Verrow Pharmaceuticals, including unforeseen liabilities, which may exceed the cost of the acquisition; Ligand may", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51745580&newsitemid=20180118006335&lan=en-US&anchor=www.sec.gov&index=2&md5=09a21a892720f2297ce2b831ad4343e4", "http://www.businesswire.com/news/home/20180118006335/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ligand.com&esheet=51745580&newsitemid=20180118006335&lan=en-US&anchor=www.ligand.com&index=1&md5=efefffa69ff3a31cfa8919385f5ad32b"], "published": "2018-01-19T00:01:00.000+02:00", "crawled": "2018-01-19T01:04:26.010+02:00", "highlightTitle": ""}