{"organizations": [], "uuid": "a7755d1be4b8e999e7e97296d775aedbba239a0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-pakistan-climbers/pakistan-rescue-teams-spot-french-woman-climber-no-communication-with-polish-man-idUKKBN1FG0QH", "country": "US", "domain_rank": 408, "title": "Pakistan rescue teams spot French woman climber, no communication with Polish man", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T18:07:00.000+02:00", "replies_count": 0, "uuid": "a7755d1be4b8e999e7e97296d775aedbba239a0b"}, "author": "", "url": "https://uk.reuters.com/article/uk-pakistan-climbers/pakistan-rescue-teams-spot-french-woman-climber-no-communication-with-polish-man-idUKKBN1FG0QH", "ord_in_thread": 0, "title": "Pakistan rescue teams spot French woman climber, no communication with Polish man", "locations": [], "entities": {"persons": [{"name": "revol", "sentiment": "none"}, {"name": "elisabeth revol", "sentiment": "none"}, {"name": "nanga parbat", "sentiment": "none"}, {"name": "shahid sardar", "sentiment": "none"}, {"name": "saad sayeed", "sentiment": "none"}, {"name": "tomasz mackiewicz", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "nanga parbat", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "pakistan army", "sentiment": "none"}, {"name": "min read  islamabad", "sentiment": "none"}, {"name": "askari aviation", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 4:10 PM / Updated 19 minutes ago Polish climbers ascend Pakistan's 'Killer Mountain' to rescue French woman, Pole Saad Sayeed 4 Min Read \nISLAMABAD (Reuters) - Elite Polish climbers were on Saturday ascending Pakistan’s treacherous “Killer Mountain” in the dark to save a French woman mountaineer and a fellow Pole, officials said, hoping the daring effort could see them reach the French climber on Sunday. \nMilitary helicopters buzzing over the 8,126 metre (26,660 feet) Nanga Parbat mountain spotted Elisabeth Revol of France at about 6,700m mark during daylight hours, a Pakistani official said, but were unable to communicate with Tomasz Mackiewicz from Poland, who is believed to be in a crevasse. \nAfter abandoning their ascent at about 7,400m on Pakistan’s second highest mountain, Revol on Friday helped Mackiewicz, who is suffering from frostbite and snow blindness, come down to 7,280 metres and set him up in a tent to spend the night, before descending and calling for help on a satellite phone. \nThe race against time effort will continue into the night after Pakistan’s military picked up several Polish climbers attempting the first winter ascent of nearby K2, the world’s second-highest mountain, and flew them to Nanga Parbat on Saturday to lead the rescue. \nBrig. Shahid Sardar, a representative of military-owned Askari Aviation, told Reuters that Revol was spotted near Nanga Parbat’s Base Camp 2, while the Polish rescue team had been dropped off at Base Camp 1. \n“We are hoping they will reach the French lady by tomorrow, but there is no contact with the Polish climber. It is a very complex rescue operation,” Sardar said. \n“We should know by mid-day tomorrow.” \nMasha Gordon, who is coordinating a crowdfunding campaign to finance the helicopter rescue, said Polish climbers - including elite mountaineers Adam Bielicki and Denis Urubko - were dropped off at Base Camp 1 at 4,800m and had begun their ascent. \n“They have a tracker on them and have last been seen at 5,225m. They will continue climbing up through the night,” Gordon posted on the GoFundMe rescue page, which showed 74,000 euros ($92,000) had been raised by Saturday. \nThe campaign is aiming to raise 100,000 euros, while the Polish government said it would provide financial guarantees and support for the operation. \nRevol knows Mackiewicz’s location high up on Nanga Parbat, where in winter perceived temperatures can reach minus 60 degrees Celsius. \n“Elisabeth took a decision to start a descent down from 6,700m towards them provided she can find fixed ropes,” Gordon added. “She has no battery power left. We believe in the strength of her spirit.” \nPakistan’s military said two Pakistan Army helicopters carrying four rescuers were undertaking the mission. \nPakistan rivals Nepal for the number of peaks over 7,000 meters (23,000 feet) and is considered climbers’ paradise, but fatalities are also common. \nNanga Parbat obtained its “Killer Mountain” moniker due to the high number of lives it has claimed over the years. In June a Spanish man and an Argentinian perished in an avalanche while trying to scale its peak. \nThe first successful winter ascent of the mountain was made as recently as February 2016. Mackiewicz has made six previous attempts to scale Nanga Parbat in winter. Additional reporting by Marcin Goettig; Writing by Drazen Jorgic,; editing by Louise Heavens", "external_links": [], "published": "2018-01-27T18:07:00.000+02:00", "crawled": "2018-01-27T18:35:21.005+02:00", "highlightTitle": ""}