{"organizations": [], "uuid": "cf8968a44a494a607cc07b516963eca72f0fbef3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-merchants-completes-acquisition-of-joy-state-bank.html", "country": "US", "domain_rank": 767, "title": "Merchants Completes Acquisition of Joy State Bank", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:00:00.000+02:00", "replies_count": 0, "uuid": "cf8968a44a494a607cc07b516963eca72f0fbef3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-merchants-completes-acquisition-of-joy-state-bank.html", "ord_in_thread": 0, "title": "Merchants Completes Acquisition of Joy State Bank", "locations": [], "entities": {"persons": [{"name": "michael petrie", "sentiment": "none"}], "locations": [{"name": "ind.", "sentiment": "none"}, {"name": "carmel", "sentiment": "none"}, {"name": "carmel", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}], "organizations": [{"name": "merchants completes acquisition of joy state bank", "sentiment": "negative"}, {"name": "merchants bancorp", "sentiment": "negative"}, {"name": "merchants bank of indiana", "sentiment": "none"}, {"name": "merchants", "sentiment": "none"}, {"name": "about merchants bancorp merchants bancorp", "sentiment": "none"}, {"name": "federal housing administration", "sentiment": "none"}, {"name": "joy state bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CARMEL, Ind., Jan. 2, 2018 /PRNewswire/ -- Merchants Bancorp (\"Merchants\") (Nasdaq: MBIN), parent company of Merchants Bank of Indiana announced today it has received all necessary regulatory approvals and closed on its acquisition of Joy State Bank (\"Joy\"), an Illinois chartered bank located in Joy, Illinois, effective January 2, 2018.\n\"The completion of this acquisition will mean the continuation of our growth strategy into new products and markets in Illinois, and enable us to further strengthen Merchants long-term financial position,\" said Michael Petrie, Chairman and CEO of Merchants. The acquisition of Joy, adds $43 million in assets and $38 million in total deposits to Merchants.\nAbout Merchants Bancorp\nMerchants Bancorp is a diversified bank holding company headquartered in Carmel, Indiana operating multiple lines of business with a focus on Federal Housing Administration (\"FHA\") multi-family housing and healthcare facility financing and servicing, mortgage warehouse financing, retail and correspondent residential mortgage banking, agricultural lending and traditional community banking. Merchants Bancorp, with $3.2 billion in assets and $2.9 billion in deposits as of September 30, 2017, conducts its business through its direct and indirect subsidiaries, Merchants Bank of Indiana, P/R Mortgage and Investment Corp., RICHMAC Funding LLC and Merchants Mortgage, a division of Merchants Bank of Indiana. For more information and financial data, please visit Merchants' Investor Relations page at investors.merchantsbankofindiana.com .\nForward-Looking Statements\nThis press release contains forward-looking statements which reflect our current views with respect to, among other things, future events and our financial performance. These statements are often, but not always, made through the use of words or phrases such as \"may,\" \"might,\" \"should,\" \"could,\" \"predict,\" \"potential,\" \"believe,\" \"expect,\" \"continue,\" \"will,\" \"anticipate,\" \"seek,\" \"estimate,\" \"intend,\" \"plan,\" \"projection,\" \"goal,\" \"target,\" \"outlook,\" \"aim,\" \"would,\" \"annualized\" and \"outlook,\" or the negative version of those words or other comparable words or phrases of a future or forward-looking nature. These forward-looking statements are not historical facts, and are based on current expectations, estimates and projections about our industry, management's beliefs and certain assumptions made by management, many of which, by their nature, are inherently uncertain and beyond our control. Accordingly, we caution you that any such forward-looking statements are not guarantees of future performance and are subject to risks, assumptions, estimates and uncertainties that are difficult to predict. Although we believe that the expectations reflected in these forward-looking statements are reasonable as of the date made, actual results may prove to be materially different from the results expressed or implied by the forward-looking statements. A number of important factors could cause our actual results to differ materially from those indicated in these forward-looking statements, including those factors identified in \"Risk Factors\" or \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our prospectus dated October 26, 2017 that was filed with the Securities and Exchange Commissions (the \"SEC\") on October 30, 2017 in connection with our initial public offering and in our subsequent filings with the SEC. Any forward-looking statements presented herein are made only as of the date of this press release, and we do not undertake any obligation to update or revise any forward-looking statements to reflect changes in assumptions, the occurrence of unanticipated events, or otherwise.\nView original content with multimedia: http://www.prnewswire.com/news-releases/merchants-completes-acquisition-of-joy-state-bank-300576619.html\nSOURCE Merchants Bancorp", "external_links": ["http://www.prnewswire.com/news-releases/merchants-completes-acquisition-of-joy-state-bank-300576619.html"], "published": "2018-01-03T00:00:00.000+02:00", "crawled": "2018-01-03T02:06:08.004+02:00", "highlightTitle": ""}