{"organizations": [], "uuid": "c580f06f476cb9d7dfc115a47204d4eb7538be97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218783328&w=1200&r=LYNXMPEE010CV", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/india-gold-imports/india-gold-imports-surge-67-percent-in-2017-on-restocking-retail-demand-gfms-idINKBN1ER0PJ", "country": "US", "domain_rank": 408, "title": "India gold imports surge 67 percent in 2017 on restocking, retail demand - GFMS", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T12:44:00.000+02:00", "replies_count": 0, "uuid": "c580f06f476cb9d7dfc115a47204d4eb7538be97"}, "author": "", "url": "https://in.reuters.com/article/india-gold-imports/india-gold-imports-surge-67-percent-in-2017-on-restocking-retail-demand-gfms-idINKBN1ER0PJ", "ord_in_thread": 0, "title": "India gold imports surge 67 percent in 2017 on restocking, retail demand - GFMS", "locations": [], "entities": {"persons": [{"name": "sudheesh nambiath", "sentiment": "none"}, {"name": "rajendra jadhav", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "akshaya tritiya", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "agartala", "sentiment": "none"}], "organizations": [{"name": "gfms", "sentiment": "none"}, {"name": "min read  mumbai", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 10:45 AM / Updated 7 hours ago India gold imports surge 67 percent in 2017 on restocking, retail demand - GFMS Rajendra Jadhav 3 Min Read \nMUMBAI (Reuters) - India’s gold imports surged 67 percent in 2017 from the previous year to 855 tonnes as jewellers replenished inventory amid a rebound in retail demand, provisional data from precious metals consultancy GFMS showed. A salesman arranges gold bangles in a display case inside a jewellery showroom on the occasion of Akshaya Tritiya, a major gold buying festival, in Agartala, April 28, 2017. REUTERS/Jayanta Dey \nThe rebound in purchases by India, the world’s second-biggest consumer of gold after China, could support global prices, which are already near their highest levels in three months. Spot gold values gained more than 13 percent last year, their best annual performance since 2010. \n“Jewellers were replenishing inventory in the first half of 2017 after demonetization in the last quarter of 2016,” Sudheesh Nambiath, a senior analyst with GFMS, a division of Thomson Reuters, said on Tuesday. \nIn November 2016, Prime Minister Narendra Modi scrapped 500- and 1,000-rupee banknotes, which accounted for 86 percent of the value of cash in circulation, part of a crackdown on corruption, tax evasion and the financing of militant groups. \nThe move created a cash crunch and dampened gold purchases in the last quarter of 2016. As cash became available over 2017, jewellers and dealers started restocking bullion. \nGood monsoon rains in 2017 also helped to revive farmers income and retail demand in rural areas, said a Mumbai-based dealer with a private bank. \nRural demand takes up two-thirds of India’s total. \nIn mid-December, global gold prices fell to their lowest level in five months in anticipation of a hike in interest rates from the U.S. Federal Reserve. \n“The price correction encouraged trading houses and banks to increase imports last month,” said a Mumbai-based bullion dealer with a private bank. \nThe country’s overseas gold purchases in December stood at 70 tonnes, up 40 percent from a year ago, GFMS data showed. \nIndia’s gold imports this month could be higher than last January’s 50 tonnes, but lower than the December imports as demand has been softening due to the recent price rise, said the dealer in Mumbai. \nSpot gold rose 0.6 percent to $1,310.48 an ounce at 1029 GMT, having hit its highest since Sept. 26 at $1,312.34 earlier in the session. [GOL/] Reporting by Rajendra Jadhav; Editing by Tom Hogue", "external_links": [], "published": "2018-01-02T12:44:00.000+02:00", "crawled": "2018-01-02T12:58:25.004+02:00", "highlightTitle": ""}