{"organizations": [], "uuid": "9d199d320cf6dace209fa474bb1ac5ed7121c163", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219451628&w=1200&r=LYNXMPEE031H3", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-tot-whu-quotes/we-are-still-miles-away-says-west-ham-boss-moyes-idUKKBN1ET2KM", "country": "US", "domain_rank": 408, "title": "We are still miles away, says West Ham boss Moyes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T01:48:00.000+02:00", "replies_count": 0, "uuid": "9d199d320cf6dace209fa474bb1ac5ed7121c163"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-tot-whu-quotes/we-are-still-miles-away-says-west-ham-boss-moyes-idUKKBN1ET2KM", "ord_in_thread": 0, "title": "We are still miles away, says West Ham boss Moyes", "locations": [], "entities": {"persons": [{"name": "moyes", "sentiment": "negative"}, {"name": "moyes martyn herman", "sentiment": "negative"}, {"name": "son heung-min", "sentiment": "none"}, {"name": "slaven bilic", "sentiment": "none"}, {"name": "david moyes", "sentiment": "none"}, {"name": "pedro obiang", "sentiment": "none"}], "locations": [{"name": "west ham", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "west ham united - wembley stadium", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "wembley", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "tottenham hotspur", "sentiment": "none"}, {"name": "reuters/matthew childs  since", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "west ham united", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "tottenham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 11:53 PM / Updated an hour ago We are still miles away, says West Ham boss Moyes Martyn Herman 3 Min Read \nLONDON (Reuters) - West Ham United manager David Moyes said his side were still “miles away” from where he wants them to be despite a gritty 1-1 draw at Tottenham Hotspur that edged them away from the Premier League’s basement on Thursday. Soccer Football - Premier League - Tottenham Hotspur vs West Ham United - Wembley Stadium, London, Britain - January 4, 2018 West Ham United manager David Moyes Action Images via Reuters/Matthew Childs \nSince replacing sacked Slaven Bilic in November with the Hammers in dire relegation trouble, West Ham have improved markedly and have suffered one defeat in their last seven games. \nWhile they are hardly playing the kind of football West Ham fans historically crave, they have beaten champions Chelsea, drawn with Arsenal and held a Tottenham side who had rattled in 12 goals in their last three home games at Wembley. \nHis side rode their luck on Thursday but took a 70th-minute lead through Pedro Obiang’s screamer, only for Son Heung-min to deny them a smash-and-grab victory that would have taken them four points clear of the relegation zone. \n“To come here and get a point after what we did two days ago is a great effort,” Moyes, whose side beat West Bromwich Albion with a stoppage time winner on Tuesday, told reporters. \n”We’re miles away from how I want us to play but we are doing some things right. \n“We are defending well which gives us a chance against the top teams. I want the players to look up the table.” \nWest Ham have managed only three shots on target, scoring two of them, in the four London derbies they have played under Moyes, but have become far tougher defensively. \nThey are now 15th, two points above the relegation zone, and Moyes hopes that he can strengthen his squad in the transfer window. \n“We need a lot in the transfer window but if I can get one or two I’ll be happy,” the former Everton and Manchester United manager said. \nTottenham manager Mauricio Pochettino said it had just been one of those nights and refused to blame a schedule that forced both teams to play their second match in 48 hours. \nHis side had 70 percent of the ball and 31 attempts at goal to West Ham’s three but could easily have suffered their second defeat against West Ham this season having been knocked out of the League Cup at Wembley in October. \n”The team was fresh and focused, it wasn’t because of two games in 48 hours,“ Pochettino said. ”We have different options to score, we tried different ways, we dominated but sometimes you don’t get what you deserve. You need some luck to score. \n“West Ham defended properly.” \nTottenham remained in fifth spot, three points behind Liverpool in the battle for a Champions League spot. Reporting by Martyn Herman, editing by Ed Osmond", "external_links": [], "published": "2018-01-05T01:48:00.000+02:00", "crawled": "2018-01-05T02:09:32.004+02:00", "highlightTitle": ""}