{"organizations": [], "uuid": "ec134064b6fc27e6bfe78e03959985ae3cdf52f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-supermicroa-announces-second-quarter-fiscal-2018-preliminary-financial-information-management-changes.html", "country": "US", "domain_rank": 767, "title": "Supermicro® Announces Second Quarter Fiscal 2018 Preliminary Information; Management Changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-31T00:05:00.000+02:00", "replies_count": 0, "uuid": "ec134064b6fc27e6bfe78e03959985ae3cdf52f1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-supermicroa-announces-second-quarter-fiscal-2018-preliminary-financial-information-management-changes.html", "ord_in_thread": 0, "title": "Supermicro® Announces Second Quarter Fiscal 2018 Preliminary Information; Management Changes", "locations": [], "entities": {"persons": [], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}, {"name": "preliminary fiscal second quarter highlights the company", "sentiment": "none"}, {"name": "non-gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif.--(BUSINESS WIRE)-- Super Micro Computer, Inc. (NASDAQ:SMCI), a global leader in high-performance, high-efficiency server, storage technology and green computing, today announced preliminary financial information for its fiscal second quarter ended December 31, 2017 and certain management changes.\nPreliminary Fiscal Second Quarter Highlights\nThe Company expects to report the following financial results for the quarter ended December 31, 2017:\nNet sales in a range of $840 million to $850 million compared to its previous guidance range of $725 million to $780 million GAAP gross margin in the range of 13.2% to 13.4% Non-GAAP gross margin in the range of 13.2% to 13.4% GAAP fully diluted earnings per share in the range of $0.05 to $0.09 Non-GAAP fully diluted earnings per share in the range of $0.49 to $0.53\nThe GAAP and non-GAAP gross margin that the Company expects to report is in the range of 13.2% to 13.4%. The GAAP gross margin includes stock-based compensation of $0.4 million. The GAAP fully diluted earnings per share range of $0.05 to $0.09 that the Company expects to report includes stock-based compensation expense of $6.3 million, Audit Committee investigation expense of $10.8 million and an estimated $11.8 million increase in tax expense related to the recently enacted Tax Cuts and Jobs Act of 2017. Excluding the stock-based compensation and the Audit Committee investigation expense and the related tax effect of both, as well as the tax expense increase, the non-GAAP fully diluted earnings per share range that the Company expects to report is $0.49 to $0.53.\nAt December 31, 2017, total cash, cash equivalents, short and long term investments was $135.0 million and bank debt was $177.6 million.\nFinancial Information Is Preliminary and May Be Subject To Change\nThe unaudited interim financial information presented in this press release is preliminary. The final financial results reported for this period may also differ from the results reported in this release as a result of the Audit Committee investigation and additional reviews discussed below.\nThird Quarter Fiscal 2018 Guidance\nThe Company expects net sales in a range of $700 million to $780 million for the third quarter of fiscal year 2018 ending March 31, 2018.\nDelayed SEC Filings\nThe Audit Committee has completed the previously disclosed investigation. Additional time is required to analyze the impact, if any, of the results of the investigation on the Company’s historical financial statements, as well as to conduct additional reviews before the Company will be able to finalize its Annual Report on Form 10-K for the fiscal year ended June 30, 2017 (the “Form 10-K”). The Company is unable at this time to provide a date as to when the Form 10-K will be filed or to determine whether the Company’s historical financial statements will be adjusted or, if so, the amount of any such adjustment(s) and what periods any such adjustments may impact. The Company intends to file its Quarterly Reports on Form 10-Q for the quarters ended September 30 and December 31, 2017 promptly after filing the Form 10-K.\nManagement Changes\nThe Company has separately announced the appointment of Kevin Bauer as Senior Vice President and Chief Financial Officer. The Company also announced that Wally Liaw, Sr. Vice President of International Sales, Phidias Chou, Sr. Vice President, Worldwide Sales and Howard Hideshima, Senior Vice President, Chief Financial Officer, have resigned. In addition, Mr. Liaw has resigned from the Company’s Board of Directors. The resignations and appointment are effective immediately. Don Clegg, Vice President of Worldwide Business Development and Marketing will succeed Phidias Chou as our interim worldwide sales leader.\nCautionary Statement Regarding Forward Looking Statements\nStatements contained in this press release that are not historical fact may be within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Such may relate to, among other things, the preliminary financial information for the quarter ended December 31, 2017. Such do not constitute guarantees of future performance and are subject to a variety of risks and uncertainties that could cause our actual results to differ materially from those anticipated, including the impact of any adjustments to the Company’s historical or current financial results as a result of the Audit Committee investigation and additional review being conducted as a result thereof, and the timing and consequences of the delays in the Company’s regaining compliance with its SEC filing obligations. Additional factors that could cause actual results to differ materially from those projected or suggested in any are contained in our filings with the Securities and Exchange Commission, including those factors discussed under the caption \"Risk Factors\" in such filings.\nUse of Non-GAAP Financial Measures\nNon-GAAP net income and net income per share discussed in this press release exclude stock-based compensation expense, costs associated with the Audit Committee investigation described above and the related tax effect of the applicable items as well as the estimated increase in tax expense related the Tax Cuts and Jobs Act of 2017. Management presents non-GAAP financial measures because it considers them to be important supplemental measures of performance. Management uses the non-GAAP financial measures for planning purposes, including analysis of the Company's performance against prior periods, the preparation of operating budgets and to determine appropriate levels of operating and capital investments. Management also believes that the non-GAAP financial measures provide additional insight for analysts and investors in evaluating the Company's financial and operational performance. However, these non-GAAP financial measures have limitations as an analytical tool, and are not intended to be an alternative to financial measures prepared in accordance with GAAP. Pursuant to the requirements of SEC Regulation G, the reconciliation between the Company's GAAP and non-GAAP financial results is associated with stock-based compensation of $6.3 million and Audit Committee investigation expense of $10.8 million, less related tax effect of both as well as the tax expense increase of $11.8 million discussed above.\nAbout Super Micro Computer, Inc.\nSupermicro®, a global leader in high-performance, high-efficiency server technology and innovation is a premier provider of end-to-end green computing solutions for Data Center, Cloud Computing, Enterprise IT, Hadoop/Big Data, HPC and Embedded Systems worldwide. Supermicro's advanced Server Building Block Solutions® offer a vast array of components for building energy-efficient, application-optimized, computing solutions. Architecture innovations include Twin, TwinPro, FatTwin™, Ultra Series, MicroCloud, MicroBlade, SuperBlade®, Double-sided Storage®, Battery Backup Power (BBP®) modules and WIO/UIO.\nProducts include servers, blades, GPU systems, workstations, motherboards, chassis, power supplies, storage, networking, server management software and SuperRack® cabinets/accessories delivering unrivaled performance and value.\nFounded in 1993 and headquartered in San Jose, California, Supermicro is committed to protecting the environment through its \"We Keep IT Green®\" initiative. The Company has global logistics and operations centers in Silicon Valley (USA), the Netherlands (Europe) and its Science & Technology Park in Taiwan (Asia).\nSupermicro, FatTwin, TwinPro, SuperBlade, Double-Sided Storage, BBP, SuperRack, Building Block Solutions and We Keep IT Green are trademarks and/or registered trademarks of Super Micro Computer, Inc.\nAll other brands, names and trademarks are the property of their respective owners.\nSMCI-F\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006349/en/\nInvestor Relations Contact\nSuper Micro Computer, Inc.\nPerry G. Hayes, 408-895-6570\nSVP, Investor Relations\nSource: Super Micro Computer, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180130006349/en/"], "published": "2018-01-31T00:05:00.000+02:00", "crawled": "2018-01-31T03:05:56.005+02:00", "highlightTitle": ""}