{"organizations": [], "uuid": "a067b00139240a6b125cabaa063c5ec018535a05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/media", "section_title": "Media | Reuters.com", "url": "https://www.reuters.com/article/usa-internet/att-urges-congress-to-rewrite-net-neutrality-rules-idUSL2N1PJ0YC", "country": "US", "domain_rank": 408, "title": "AT&T urges Congress to rewrite net neutrality rules", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:28:00.000+02:00", "replies_count": 0, "uuid": "a067b00139240a6b125cabaa063c5ec018535a05"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-internet/att-urges-congress-to-rewrite-net-neutrality-rules-idUSL2N1PJ0YC", "ord_in_thread": 0, "title": "AT&T urges Congress to rewrite net neutrality rules", "locations": [], "entities": {"persons": [{"name": "randall stephenson", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "at&t inc", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "negative"}, {"name": "at&t", "sentiment": "negative"}, {"name": "federal communications commission", "sentiment": "none"}, {"name": "fcc", "sentiment": "none"}, {"name": "verizon communications inc", "sentiment": "none"}, {"name": "comcast corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan 24 (Reuters) - AT&T Inc on Wednesday urged Congress, in full-page newspaper advertisements, to write new laws governing the internet and protect net neutrality after the Trump administration voted to rescind it late last year.\nCongress should “end the debate once and for all, by writing new laws that govern the internet and protect consumers,” AT&T Chief Executive Randall Stephenson said, reiterating a position the company has been promoting since the administration of U.S. President Donald Trump said it planned to overturn the rules.\nWhen the Federal Communications Commission repealed net neutrality last year, it handed AT&T, Comcast Corp and Verizon Communications Inc power over what content consumers can access on the internet.\nThe Republican-majority FCC voted in December along party lines to reverse the landmark 2015 Obama administration net neutrality rules which barred internet service providers from blocking or throttling traffic or offering paid fast lanes, also known as paid prioritization.\nBut a future FCC could reimpose the net neutrality rules.\nAT&T and other broadband companies want Congress to step in and write a permanent solution for a more than decade-long dispute that would likely provide fewer protections for consumers.\nWhile it would limit internet providers freedom, it would also limit a future FCC’s ability to regulate the internet -- something internet service providers fear -- including potentially imposing future rate regulations.\nStephenson said the company plans “to work with Congress, other internet companies and consumer groups in the coming months to push for an ‘Internet Bill of Rights’ that permanently protects the open internet for all users.”\nThe ads appeared in newspapers including the New York Times, the Wall Street Journal, the Washington Post, USA Today and online.\nAT&T wants the rules to apply to all internet companies, which would include companies like Facebook Inc, Alphabet Inc and Amazon.com Inc. Internet companies do not support Congress writing rules governing their conduct.\nThe strong public backlash, especially among younger people, has raised concerns among some politicians about the impact the issue may have on the impending 2018 congressional elections.\nRepublican Senator John Thune, who chairs the Commerce Committee, said in an interview he has offered to codify “some of the consumer protections” that net neutrality advocates want “as long as the regulation is sensible,” but he said it will be hard to get a compromise with Democrats reluctant to come to the table.\nThe planned Senate vote “gets you nowhere,” Thune said, calling it a “shiny object.” Even if it passes the Senate, it will not pass the House “and the president is not going to sign it.” (Editing by Chris Sanders and Bernadette Baum)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T00:28:00.000+02:00", "crawled": "2018-01-25T10:14:17.000+02:00", "highlightTitle": ""}