{"organizations": [], "uuid": "d303f2f774aa9c73b69a21e2c2e414903ade411f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104924133-GettyImages-895412084.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/congress-faces-january-deadlines-on-daca-health-care-and-a-shutdown.html", "country": "US", "domain_rank": 767, "title": "Congress faces January deadlines on DACA, health care and a shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-02T20:29:00.000+02:00", "replies_count": 0, "uuid": "d303f2f774aa9c73b69a21e2c2e414903ade411f"}, "author": "John W. Schoen", "url": "https://www.cnbc.com/2018/01/02/congress-faces-january-deadlines-on-daca-health-care-and-a-shutdown.html", "ord_in_thread": 0, "title": "Congress faces January deadlines on DACA, health care and a shutdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "daca", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Just back from a year-end break, Congress returns to a busy calendar with tight January deadlines on pressing issues ranging from children's health care to avoiding a government shutdown.\nLast month's protracted battle over a $1.5 trillion package of tax cuts kept lawmakers from addressing other hot items on the agenda, including a long-term agreement on how to keep the government funded.\nHere's a list of unfinished business with looming deadlines:\nGOVERNMENT FUNDING \nJust before heading home last month, Congress approved a stop-gap extension of existing spending levels, known as a continuing resolution, which runs out Jan. 19. Unless extended, a series of mandatory furloughs and service cuts would kick in.\nAny shutdown, even for a few days, would be costly. Congressional fiscal gridlock resulted in a 16-day stalemate in October 2013 that cost the economy more than $1 billion a day, according to most estimates.\nIf lawmakers miss the Jan. 19 deadline, some benefits, like unemployment insurance and veterans' benefits, could be delayed or reduced. Among the headaches: national parks, museums and many passport offices would shut down; the Small Business Administration and FHA would stop guaranteeing new loan applications; farm subsidy checks would stop flowing; and IRS tax processing would slow down.\nKeeping the government spending at existing levels, or raising spending, could trigger automatic spending cuts as part of a system, known as the sequester, that was put in place in 2011 to hold the line on spending. To head off automatic cuts across the board, Congress will have to raise those spending caps.\nBut lawmakers have been deadlocked along party lines over how to raise the caps. Republicans want to boost military spending by $650 billion through the end of this fiscal year. Democrats insist that any increase in military spending must be matched dollar-for-dollar with higher domestic spending.\nEven if they can agree on a spending plan, lawmakers face another fiscal deadline of March to increase the debt ceiling. That's when the Treasury Department is expected to run out of cash to pay the government's bills without borrowing more money.\nHEALTH INSURANCE \nSome 9 million children will be left without health insurance unless Congress votes to renew funding for the Children's Health Insurance Program. Last year, Congress blew past a Sept. 30 deadline to reauthorize funding for the federally funded, state-administered program.\nBefore leaving for the holidays, lawmakers added $3 billion in funding to the federal program to keep it from running out of money. Without those funds, about a third of the states would have begun suspending coverage this month, according to the Kaiser Family Foundation.\nWhile the temporary fix buys the program a little more time, some states have already started notifying families that they may soon lose coverage.\nAlso unresolved is an effort to help contain health insurance premium costs under the Affordable Care Act. As part of her approval for the tax reform package, Republican Sen. Susan Collins of Maine won a promise from GOP leadership to support a measure to restore federal payment to insurers. The Trump administration ended those subsidies last year.\nDACA \nIn September, Trump ended the Obama-era Deferred Action for Childhood Arrivals program with a six-month delay to force congressional action. The program, known as DACA, protects from deportation nearly 800,000 young immigrants who were brought to the U.S. illegally as children and permits them to work.\nThe expiration deadline is not until March 5, but the program could become a sticking point in government funding talks this month if Democrats decide to use it as leverage.\nBipartisan congressional leaders plan to meet with White House officials on Wednesday about government funding and DACA.\nTrump has thrown more uncertainty into the delicate talks with tweets in recent days. On Tuesday, he claimed that Democrats \"are doing nothing\" to protect the young immigrants . Last week, he said he would not accept a DACA deal without funding for his proposed border wall .\nDemocrats have repeatedly pushed back against efforts to secure funding for a physical barrier between the U.S. and Mexico.\nDISASTER FUNDING \nCongress has pushed to pass tens of billions of dollars more in disaster aid funding for a series of devastating natural disasters last year. Hurricanes ravaged Puerto Rico, Texas and Florida, while wildfires damaged California.\nIn December, the House passed an $81 billion relief bill. The Senate did not take up the legislation, as some lawmakers said it did not include enough money for a battered Puerto Rico.\nIn November, the White House requested less money — $44 billion — than was included in the House legislation.\nWATCH: Lawmakers are gearing up for a budget fight show chapters US lawmakers are gearing up for a budget fight      5 Hours Ago | 00:49", "external_links": [], "published": "2018-01-02T20:29:00.000+02:00", "crawled": "2018-01-02T20:59:15.004+02:00", "highlightTitle": ""}