{"organizations": [], "uuid": "89a206ecefe8c0706dbc79d2d858c49a620374e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-new-york-islamic-state/new-york-man-pleads-guilty-to-attempting-to-join-islamic-state-idUKKBN1FC35O", "country": "US", "domain_rank": 408, "title": "New York man pleads guilty to attempting to join Islamic State", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:39:00.000+02:00", "replies_count": 0, "uuid": "89a206ecefe8c0706dbc79d2d858c49a620374e6"}, "author": "", "url": "https://uk.reuters.com/article/uk-new-york-islamic-state/new-york-man-pleads-guilty-to-attempting-to-join-islamic-state-idUKKBN1FC35O", "ord_in_thread": 0, "title": "New York man pleads guilty to attempting to join Islamic State", "locations": [], "entities": {"persons": [{"name": "nagi", "sentiment": "none"}, {"name": "arcara", "sentiment": "none"}, {"name": "brendan pierson", "sentiment": "none"}, {"name": "jeremy schwartz", "sentiment": "none"}, {"name": "richard arcara", "sentiment": "none"}, {"name": "arafat nagi", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "lackawanna", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "buffalo", "sentiment": "none"}], "organizations": [{"name": "islamic state", "sentiment": "none"}, {"name": "u.s. department of justice", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 10:39 PM / Updated 13 minutes ago New York man pleads guilty to attempting to join Islamic State Brendan Pierson 3 Min Read \n(Reuters) - A New York man has pleaded guilty to trying to help Islamic State by travelling to Turkey with the goal of entering Syria and fighting for the militant group, federal prosecutors announced on Tuesday. \nArafat Nagi, 47, entered his plea on Monday before U.S. District Judge Richard Arcara in Buffalo, New York, the U.S. Department of Justice said. \n“The plea gives the court wide sentencing latitude and we trust the judge to be fair,” Jeremy Schwartz, Nagi’s lawyer, said in an email. “Mr. Nagi never engaged in violence and he does not wish harm to the United States.” \nNagi, of Lackawanna, New York, is scheduled to be sentenced by Arcara on May 7. He faces a maximum sentence of 15 years in prison, according to prosecutors. \nNagi, who was born in the United States to Yemeni parents, was arrested in July 2015 and charged with attempting to materially aid Islamic State. Prosecutors said he pledging allegiance to the group and travelled to Turkey twice, in October 2012 and July 2014, to meet Islamic State supporters. \nProsecutors said at the time that the arrest followed a Federal Bureau of Investigation probe prompted by a tip from one of Nagi’s neighbours in Lackawanna, which is located in upstate New York near Buffalo. \nThe neighbour told the FBI that Nagi regularly argued with local residents about his beliefs, which included support of Islamic State, and was planning to travel to Turkey again, according to prosecutors. \nUpon searching Nagi’s apartment, law enforcement found military equipment, including body armour, a machete and night vision goggles, prosecutors said. \nLackawanna drew national attention as the home of the so-called “Lackawanna Six,” a group of young American men of Yemeni descent who pleaded guilty to providing material support for terrorism by attending al Qaeda’s al Farouk training camp in Afghanistan in early 2001. \nMultiple people are currently facing charges of aiding Islamic State in New York federal courts, including Sayfullo Saipov, accused of killing eight people by driving a truck into a New York bicycle path, and Akayed Ullah, accused of trying to detonate a homemade bomb in a Manhattan subway station. Reporting By Brendan Pierson in New York; Editing by Tom Brown", "external_links": [], "published": "2018-01-24T00:39:00.000+02:00", "crawled": "2018-01-24T01:02:24.007+02:00", "highlightTitle": ""}