{"organizations": [], "uuid": "ccbfca4bc66dadd5b22d1912b92fa23629e992c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-thailand-politics/thailand-charges-eight-activists-as-public-frustration-at-junta-grows-idUSKBN1FK161", "country": "US", "domain_rank": 408, "title": "Thailand charges eight activists as public frustration at junta grows", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T12:09:00.000+02:00", "replies_count": 0, "uuid": "ccbfca4bc66dadd5b22d1912b92fa23629e992c6"}, "author": "", "url": "https://www.reuters.com/article/us-thailand-politics/thailand-charges-eight-activists-as-public-frustration-at-junta-grows-idUSKBN1FK161", "ord_in_thread": 0, "title": "Thailand charges eight activists as public frustration at junta grows", "locations": [], "entities": {"persons": [{"name": "supaporn malailoy", "sentiment": "none"}, {"name": "winthai suvaree", "sentiment": "none"}], "locations": [{"name": "thailand", "sentiment": "none"}, {"name": "bangkok", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 10:10 AM / in 8 minutes Thailand charges eight activists as public frustration at junta grows Reuters Staff 3 Min Read \nBANGKOK (Reuters) - Thailand on Wednesday charged eight activists of a civil rights group with violating the military government’s ban on public gatherings, after it kicked off a cross-country march on Jan. 20 in a rare display of public discontent. \nSince military rule began in Thailand in 2014, demonstrations have become a rarity, partly because of orders by the junta banning the public assembly of five or more people. \nThe eight charged on Wednesday, who belong to the People Go Network of activists and academics, which organized the anti-junta “We Walk” march lasting until Feb. 17, have denied the charge. \n“We think in the past three years, the junta hasn’t been genuine and hasn’t listened to the people,” said the group’s coordinator, Supaporn Malailoy. \n“So we march with our friends, with the civil liberties we have.” \nResponding to the comment, junta spokesman Winthai Suvaree said, “That is just the personal opinion of some people who are already prejudiced.” \nThe eight are to report to a state prosecutor on Feb. 26, who will decide whether to take the case to court, the Thai Lawyers for Human Rights group said. \nWednesday’s prosecution was an “infringement of fundamental rights and freedoms,” 52 civil rights groups said. \n“The royal police of Thailand and the government have done some wrongs in violation of these fundamental values, principles and human rights,” they said in a joint statement. \n“These actions need to be condemned.” \nThe ban on public gatherings was inconsistent with Thailand’s international human rights obligations, the International Commission of Jurists said. \n“Thailand should immediately end the criminal proceedings,” said Kingsley Abbott, its senior international legal adviser. \nThe 450-km (280-mile) march from Bangkok, the capital, to the northeastern province of Khon Kaen, has drawn participants from civil rights groups concerned about healthcare, alternative farming, natural resources and freedom of expression. \nIt aims to spotlight growing public frustration with the junta, which has delayed a promised return to democracy, reined in free speech, cracked down on dissent, and pursued projects despite opposition from rights groups and local communities. \nDemocracy activists were among more than 100 people who gathered on Saturday to protest against the military government and show support for the People Go Network. \nThe United Nations has also expressed concern over what it calls a deteriorating rights situation in Thailand, including harsh sentences for those convicted of violating the lese-majeste law, as well as other curbs on free expression. Reporting by Patpicha Tanakasempipat; Additional reporting by Panarat Thepgumpanat; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-31T12:09:00.000+02:00", "crawled": "2018-01-31T12:22:52.007+02:00", "highlightTitle": ""}