{"organizations": [], "uuid": "6cbcc3131b864dbc52fd1ad8ae8b457aa5b9c4aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-bo-shen-blockchain-venture-capitalist-joins-verady-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Bo Shen, Blockchain Venture Capitalist, Joins Verady Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T17:00:00.000+02:00", "replies_count": 0, "uuid": "6cbcc3131b864dbc52fd1ad8ae8b457aa5b9c4aa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-bo-shen-blockchain-venture-capitalist-joins-verady-board-of-directors.html", "ord_in_thread": 0, "title": "Bo Shen, Blockchain Venture Capitalist, Joins Verady Board of Directors", "locations": [], "entities": {"persons": [{"name": "verady", "sentiment": "negative"}, {"name": "bo shen", "sentiment": "negative"}, {"name": "nathan eppinger", "sentiment": "none"}, {"name": "kell canty", "sentiment": "none"}, {"name": "shen", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": [{"name": "fenbushi capital", "sentiment": "negative"}, {"name": "georgia tech", "sentiment": "none"}, {"name": "blockasset fund", "sentiment": "none"}, {"name": "atdc", "sentiment": "none"}, {"name": "advanced technology development center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 25, 2018 /PRNewswire/ -- Today, Verady announced Bo Shen, founder of Fenbushi Capital and Blockasset Fund, has joined the Board of Directors along with making a personal investment in the company. Verady combines blockchain technology and industry thought leadership to bring accounting and audit services to the cryptocurrency market.\nFounded in 2016 by Kell Canty and Nathan Eppinger and headquartered at Georgia Tech's Advanced Technology Development Center (ATDC), Verady recently launched VeraNet , a network that makes audit and accounting of cryptocurrencies possible. Shen, an industry pioneer, founded Fenbushi Capital and Blockasset Fund, both focused on the blockchain and cryptocurrency space.\n\"Verady is addressing an area that is a huge issue for the blockchain world,\" said Shen. \"Their team has tremendous capabilities and a strategic vision. I look forward to helping them bring together the blockchain community and the traditional finance world.\"\nPreviously, Shen held prominent roles at several successful businesses, including CEO of DACx, managing partner of Confederated Asset Management and CEO of Shanghai HuaJi Holdings. He graduated with a bachelor's degree from the University of Shanghai for Science and Technology and a master's degree in Systems Engineering from Georgia Tech.\n\"Having Bo Shen join Verady's board brings his incredible experience, talent, and depth of relationships to bear on our future growth and direction,\" said Kell Canty, co-founder and CEO of Verady. \"Also the investment will allow us to expand our team and accelerate the development of VeraNet.\"\nVeraNet is a transaction harvesting network that bridges traditional financial accounting with cryptocurrency. \"Expanding VeraNet is critical to handle the diversity of Blockchains and integrate them into modern financial practices,\" said Nathan Eppinger, co-founder and CTO of Verady. \"The openness of blockchain networks have made what we do possible and we hope to provide as much value as possible back to the amazing community so this space can continue to grow and interface with traditional systems along the way.\"\nABOUT VERADY\nVerady provides cryptocurrency accounting and audit technology services through VeraNet, where financial institutions, corporations, and individuals can audit, account, and report on blockchain assets. Verady believes traditional accounting systems, firms, and standards are currently lacking functionality around cryptocurrencies. VeraNet will be the bridge between cryptocurrencies and traditional financial accounting which is needed to further their acceptance and growth. For more information about Verady please visit verady.com or follow @veradyinfo on Twitter.\nView original content with multimedia: http://www.prnewswire.com/news-releases/bo-shen-blockchain-venture-capitalist-joins-verady-board-of-directors-300588000.html\nSOURCE Verady", "external_links": ["https://twitter.com/veradyinfo", "http://bit.ly/VeraNetLaunch", "http://atdc.org/about/", "https://www.verady.com/", "http://www.prnewswire.com/news-releases/bo-shen-blockchain-venture-capitalist-joins-verady-board-of-directors-300588000.html"], "published": "2018-01-25T17:00:00.000+02:00", "crawled": "2018-01-25T18:28:56.014+02:00", "highlightTitle": ""}