{"organizations": [], "uuid": "d00fd680e9ace1df16cf4667a484553b1b56319d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/21/104121327-GettyImages-136948635.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/trump-must-pressure-drug-makers-to-help-terminally-ill-people-experts.html", "country": "US", "domain_rank": 767, "title": "Trump must pressure drug makers to help terminally ill people: Experts", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.19, "site_type": "news", "published": "2018-01-31T21:04:00.000+02:00", "replies_count": 0, "uuid": "d00fd680e9ace1df16cf4667a484553b1b56319d"}, "author": "Berkeley Lovelace Jr.", "url": "https://www.cnbc.com/2018/01/31/trump-must-pressure-drug-makers-to-help-terminally-ill-people-experts.html", "ord_in_thread": 0, "title": "Trump must pressure drug makers to help terminally ill people: Experts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump 's call on lawmakers during his State of the Union address to support terminally ill patients gaining access to experimental therapies won't help much, health policy experts say.\nInstead, the president needs to pressure drugmakers that make the decision on whether to supply their early stage medicines to dying patients, said Arthur Caplan, medical ethics director at NYU Langone Medical Center.\n\"Pushing it at the federal level won't change anything,\" he told CNBC. \"It won't compel any company to give away their drug.\"\nDrugmakers have legitimate concerns about granting access to these drugs for fear of being sued by patients if something goes poorly, Holly Fernandez Lynch, assistant professor of medical ethics at the University of Pennsylvania, told CNBC.\nGranting early access to experimental drugs can also create ethical issues. Drugmakers have minimal data on side effects during the early stages of the process and the effects could end up harming patients.\nCompanies also sometimes have limited supplies of experimental drugs when working on clinical trials, Lynch said. \"Resources needed include a staff, and you also need the supplies for the drug.\"\nThe federal government could pass legislation that grants drugmakers additional resources, but it's \"unlikely,\" NYU Langone's Caplan said.\nAriana Lindquist | Bloomberg | Getty Images \"The big guys could give things away,\" Caplan said, adding that some drugmakers, including Johnson & Johnson , are reviewing ways to handle such cases. Caplan is on the J&J review panel.\nThirty-eight states currently have so-called right-to-try laws, which allow dying patients access to experimental medicines that have passed an early phase in the FDA approval process.\nIn August, the Senate voted 94-1 to pass a bill that would grant some protections to drugmakers. The House is yet to act on its version or vote on the Senate legislation.\nDuring his State of the Union address Tuesday night, Trump called on Congress to pass a bill to give U.S. patients more access to experimental treatments.\n\"People who are terminally ill should not have to go from country to country to seek a cure,\" Trump said in his speech. \"I want to give them a chance right here at home. It's time for Congress to give these wonderful, incredible Americans the right to try.\"\n\"Pushing it at the federal level won't change anything. ...It won't compel any company to give away their drug.\" -Arthur Caplan, Director of the division of medical ethics at NYU Langone Medical Center Caplan said Trump's comments were \"a feel-good statement,\" but won't change much. CNBC has reached out to the White House for comment about whether it could introduce legislation on experimental treatments.\nMeanwhile, Freedom Partners, a nonpartisan group in support of \"right-to-try\" laws, applauded Trump's push.\n\"The House can and should immediately act to deliver hope to terminally ill Americans who are desperately looking for potentially life-saving treatment that is just out of their reach,\" Freedom Partners Executive Vice President Nathan Nascimento said in a statement to CNBC.", "external_links": [], "published": "2018-01-31T21:04:00.000+02:00", "crawled": "2018-01-31T21:04:11.021+02:00", "highlightTitle": ""}