{"organizations": [], "uuid": "e0da4d0243588bb9885e5eee7f71aeb99ffd83ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222337822&w=1200&r=LYNXMPEE0F0CL", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-philippines-media/philippines-duterte-had-nothing-to-do-with-news-sites-license-spokesman-idUSKBN1F50HL", "country": "US", "domain_rank": 408, "title": "Philippines' Duterte had 'nothing to do' with news site's license: spokesman", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T08:16:00.000+02:00", "replies_count": 0, "uuid": "e0da4d0243588bb9885e5eee7f71aeb99ffd83ca"}, "author": "", "url": "https://www.reuters.com/article/us-philippines-media/philippines-duterte-had-nothing-to-do-with-news-sites-license-spokesman-idUSKBN1F50HL", "ord_in_thread": 0, "title": "Philippines' Duterte had 'nothing to do' with news site's license: spokesman", "locations": [], "entities": {"persons": [{"name": "duterte", "sentiment": "negative"}, {"name": "karen lema", "sentiment": "none"}, {"name": "martin petty", "sentiment": "none"}, {"name": "rappler", "sentiment": "none"}, {"name": "rodrigo duterte", "sentiment": "none"}, {"name": "harry roque", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "philippine", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "none"}, {"name": "securities exchange commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  manila", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANILA (Reuters) - Philippine President Rodrigo Duterte denied on Tuesday influencing a regulator’s decision to revoke the license of a news website known for challenging his government, but lashed out strongly at what he called a “fake news outlet”.\nThe firebrand leader laughed off allegations he was cracking down on media and insisted there was nothing political about the decision of the Securities and Exchange Commission (SEC) to declare the operations of news site Rappler (www.rappler.com) in violation of laws on foreign ownership.\nDuterte, who has previously made no secret of his annoyance at Rappler’s reporting, said the news site had been “throwing trash and shit all along”, adding that its stories were full of innuendo and “pregnant with falsity”.\nThe SEC’s decision is not final and Rappler, which has been allowed to operate as normal, said it would appeal.\nDuterte said he could not care less whether Rappler continued to operate or not, and challenged it to prove that he was behind the SEC’s move against it.\n“Since you are a fake news outlet then I am not surprised that your articles are also fake,” Duterte told reporters, referring to the news site.\n“We can debate now. Tell me where is our lies and I’ll tell you where are yours.”\nDuterte ridiculed Rappler’s argument that the SEC decision was harassment, and suggested it was hypocritical for finding fault with his government while having broken the law itself.\n“Look, why should you complain if I am critical against media? Are you not critical of me?”\nResponding to Duterte’s outburst, Rappler said: ”The president knows who produces fake news in the Philippines, and it certainly is not Rappler.\n“He doesn’t have to look far from where he sits in Malacanang,” it said, referring to the presidential palace.\nRappler is the latest entity to have taken on Duterte and found itself subjected to various forms of scrutiny initiated by his political allies, usually after his public outbursts against those who have dared to challenge him.\nHis government has denied that his supporters are doing his bidding for him, including followers who have launched scathing online attacks on critics and journalists.\nDuterte himself has previously voiced disagreement with some action against his opponents, although he has stopped short of intervening to stop it.\nIllustration of the Rappler website January 16, 2018. REUTERS/Thomas White/Illustration ‘ALARMING ATTEMPT’\nForeign press organizations and human rights groups have rallied behind Rappler, joining a chorus of domestic outrage among the media and political opposition at what they see as moves to muzzle those scrutinizing Duterte.\nAmnesty International called it “an alarming attempt to silence independent journalism”, describing Rappler as “fearless in holding those in power to account”.\nHuman Rights Watch said the foreign ownership allegations “masked a vendetta” against Rappler and the decision “suggests a sinister use of state regulatory processes to stifle critical media voices”.\nDuring last year’s annual address to the nation, Duterte singled out Rappler for being fully owned by Americans, which Rappler refutes.\nThe two U.S.-based organizations that have invested in Rappler are Omidyar Network, created by eBay founder and entrepreneur Pierre Omidyar, and North Base Media, which advocates independent media.\nRappler said its filings to the SEC in 2015 made clear that just like several other media outlets, foreigners had invested in some of its Philippine Depositary Receipts (PDR), but did not own any shares, or have a say in operations.\nPresidential spokesman Harry Roque said earlier on Tuesday that by selling PDR to those entities, Rappler had given foreigners “the power to negatively control the company” without them holding any of its shares.\n“Rappler in effect becomes a dummy of the foreign investor,” he told news channel ANC.\nRoque denied that it was Solicitor General Jose Calida, a close associate of Duterte, who had initiated the case against Rappler and said the regulator was already looking into its ownership before Calida took it up.\nSEC Commission Secretary Armando Pan, however, said the case started with Calida’s complaint.\nRappler’s investigative reporting has included allegations that Duterte’s government has “weaponized” social media, using it to discredit and generate online hate against his most vocal detractors. His office rejects that.\nRappler chief executive Maria Ressa disputed Roque’s remarks and said a “war of attrition” was now underway.\nDuterte also hit out anew at the former owners of the Philippine Daily Inquirer, another media outlet known for scrutinizing his government, accusing them of being oligarchs who evaded tax. Neither the newspaper nor its former owners have responded to Duterte’s allegations.\n“In this country the issue is not press freedom, the issue is abuse of the elite and those in power,” Duterte said.\nAdditional reporting by Neil Jerome Morales and Manuel Mogato; Editing by Raju Gopalakrishnan and Gareth Jones\n ", "external_links": [], "published": "2018-01-16T08:16:00.000+02:00", "crawled": "2018-01-16T08:28:47.000+02:00", "highlightTitle": ""}