{"organizations": [], "uuid": "166be7ff271651225c04fec18a537a0eba52b563", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224658320&w=1200&r=LYNXMPEE0N048", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-boeing-787/boeing-completing-787-10-flight-tests-with-ge-engines-idUSKBN1FD06J", "country": "US", "domain_rank": 408, "title": "Boeing completing 787-10 flight tests with GE engines", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T03:54:00.000+02:00", "replies_count": 0, "uuid": "166be7ff271651225c04fec18a537a0eba52b563"}, "author": "", "url": "https://www.reuters.com/article/us-boeing-787/boeing-completing-787-10-flight-tests-with-ge-engines-idUSKBN1FD06J", "ord_in_thread": 0, "title": "Boeing completing 787-10 flight tests with GE engines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Boeing Co ( BA.N ) has still to complete flight tests on the newly certified 787-10 Dreamliner with General Electric Co ( GE.N ) engines, but has finished tests with Rolls-Royce Holdings PLC ( RR.L ) engines, a Boeing executive said on Tuesday.\nThe U.S. jet manufacturer on Monday said the U.S. Federal Aviation Administration had certified the biggest model of the fuel-efficient Dreamliner for commercial use.\nThe first delivery, to Singapore Airlines Ltd ( SIAL.SI ) with Rolls-Royce engines, is due in the first half of the year and will be used on mid-length routes in the Asia Pacific region. United Airlines ( UAL.N ) is expected to accept the first 787-10 with GE engines in the second half of the year.\n“We are complete with all flight testing required for the first deliveries to Singapore and the Rolls-Royce family,” Boeing 787 programme chief project engineer Bob Whittington told reporters on a conference call, speaking from Seattle.\n“There is a little bit more testing to be done for the GE-powered airplanes a little bit later on.”\nThe 787-10 has 95 percent of its parts in common with the mid-sized Dreamliner, the 787-9. The main differences are in the environmental control system, which is larger due to the longer length of the airplane and higher number of passengers, and in the landing gear, Whittington said.\nThe smaller 787-8 model, the first Dreamliner, has roughly 80 percent commonality with the 787-10 and has been a slower seller as Boeing considers whether to launch a “New Mid-Sized Airplane” with 220-260 seats targeting the market between the 737 MAX 10 and the 787-8.\nThe 787-10 seats around 330 passengers and has a shorter range, at 6,430 nautical miles (11,910 kms), than the other Dreamliners, but Whittington did not rule out extending the range over time.\n“We will continue to look and see if the market needs a couple of thousand more pounds take-off weight and we will continue those studies,” he said.\nThe 787-10 has received 171 firm orders from nine customers, the largest of which is Singapore Airlines. It is similar in size to the rival Airbus SE ( AIR.PA ) A350-900 model, which seats around 325 passengers but has a longer range.\nQatar Airways is expected to accept the first delivery of Airbus’s larger A350-1000 next month.\nReporting by Jamie Freed in Singapore; editing by Richard Pullin\n ", "external_links": [], "published": "2018-01-24T03:54:00.000+02:00", "crawled": "2018-01-24T04:07:32.007+02:00", "highlightTitle": ""}