{"organizations": [], "uuid": "51e75873857340f47d89f94bedf16f0de00fc389", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/17/104591677-GettyImages-460966816.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/13/china-to-step-up-banking-oversight-in-arduous-fight-on-financial-risks.html", "country": "US", "domain_rank": 767, "title": "China to step up banking oversight in 'arduous' fight on financial risks", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T06:05:00.000+02:00", "replies_count": 0, "uuid": "51e75873857340f47d89f94bedf16f0de00fc389"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/13/china-to-step-up-banking-oversight-in-arduous-fight-on-financial-risks.html", "ord_in_thread": 0, "title": "China to step up banking oversight in 'arduous' fight on financial risks", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "china banking regulatory commission", "sentiment": "none"}, {"name": "cbrc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "China to step up banking oversight in 'arduous' fight on financial risks Published 14 Hours Ago Zhang Peng | LightRocket | Getty Images A marble lion in front of the China Banking Regulatory Commission (CBRC). \nChina will step up oversight in the banking sector this year to reduce financial risks, the country's banking regulator said, stressing that long-term efforts would be needed to control banking sector chaos. \nThe China Banking Regulatory Commission (CBRC) said late on Saturday in a statement that its priorities included increasing supervision over shadow banking and interbank activities. \n\"Banking shareholder management, corporate governance and risk control mechanisms are still relatively weak, and root causes creating market chaos have not fundamentally changed,\" the CBRC said. \n\"Bringing the banking sector under control will be long-term, arduous, and complex,\" it said. \nThe regulator said violations in corporate governance, property loans, and disposal of non-performing assets will be punished more strictly, and that it would strengthen risk control in interbank activities, financial products and off-balance sheet business. \nChina has repeatedly vowed to clean up disorder in its banking system. \nIn recent months, regulators have introduced a series of new measures aimed at controlling risk and leverage in the financial system, with everything from lending practices to shadow banking under the microscope. \nAlready in January, the CBRC has published regulations that put limits on the number of commercial banks that single investors can have major holdings in. \nPresident Xi Jinping has declared that financial security is vital to national security. \nThe government is particularly concerned about the massive shadow banking industry, lending conducted outside of the regulated formal banking system. \nIt fears that a big default or series of loan losses could cascade through the world's second-biggest economy, leading to a sudden halt in bank lending. ", "external_links": [], "published": "2018-01-14T06:05:00.000+02:00", "crawled": "2018-01-14T06:14:35.026+02:00", "highlightTitle": ""}