{"organizations": [], "uuid": "b935a60f6c54bce804d47f59cd3f61412d61dcfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-earth-science-tech-inc-appoints-new-board-member-mr-avi-levy-esq-to-develop-canadian-market.html", "country": "US", "domain_rank": 767, "title": "Earth Science Tech, Inc. Appoints New Board Member, Mr. Avi Levy, Esq., to Develop Canadian Market", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.312, "site_type": "news", "published": "2018-01-09T21:00:00.000+02:00", "replies_count": 0, "uuid": "b935a60f6c54bce804d47f59cd3f61412d61dcfa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-earth-science-tech-inc-appoints-new-board-member-mr-avi-levy-esq-to-develop-canadian-market.html", "ord_in_thread": 0, "title": "Earth Science Tech, Inc. Appoints New Board Member, Mr. Avi Levy, Esq., to Develop Canadian Market", "locations": [], "entities": {"persons": [{"name": "avi levy", "sentiment": "negative"}, {"name": "levy", "sentiment": "none"}], "locations": [{"name": "fl", "sentiment": "none"}, {"name": "esq.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "develop canadian market doral", "sentiment": "negative"}, {"name": "earth science tech, inc", "sentiment": "neutral"}, {"name": "earth science tech, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Doral, FL,, Jan. 09, 2018 (GLOBE NEWSWIRE) -- Earth Science Tech, Inc. (OTC PINK: ETST) (\"ETST\" or, the “Company\"), an innovative biotech company that operates in the fields of hemp cannabinoid (CBD), nutraceutical, pharmaceutical and medical device R&D, is pleased to announce the appointment of Mr. Avi Levy, Esq. as the company’s legal consultant for Canadian activities.\nWith Mr. Levy’s expertise as a highly-regarded lawyer, the company plans to expand its business in Canada. Levy has been practicing law for over twenty-two years and has been involved in both criminal and civil law since the beginning of his practice. He started his career at one of the biggest law firms in Canada, where he worked in tax and estate law, dealing mostly with regulatory issues, and as a prosecutor. He went on to advise and act as general counsel to some of the biggest internet companies, in addition to top athletes and celebrities in the United States. Most recently, Mr. Levy established himself as an expert in the medical marijuana industry, representing some of Canada’s largest clinics and counseling them on regulatory and legal issues.\nMr. Levy will help the company apply for licenses to import its CBD-rich hemp oil into Canada, where it will be transformed and exported in bulk as raw hemp oil, or in individual ready-to-consume bottles. CBD-rich hemp oil is growing in popularity around the world, and ETST hopes to soon begin exporting from its Canadian facilities to various different countries. The company will also profit from the new Canadian market that is opening for cannabis edible products.\n“We will be well prepared for that new market. We will manufacture and start to distribute our 3 new CBD-based nutraceutical products in USA in 2018 and in 2019, following our application to get a license to work with schedule II controlled substances,” said Mr. Levy, “We will develop new products with a mix of CBD and THC-rich cannabis oil. In Canada there will be a huge amount of production of dried cannabis herb, and we will profit from purchasing and transforming the excess stock these companies create.”\n“We are very excited to welcome Mr. Avi Levy, Esq. to our board of directors,” said CEO & CSO, Michel Aubé, “He brings with him decades of experience in advising companies and individuals in rapid-growth environments, has personal connections to top brands and celebrities, and has worked directly with the cannabis industry. We can’t wait to explore the synergies we have with him, and watch our Canadian prospects grow.”\nAbout Earth Science Tech, Inc. (ETST): Earth Science Tech has among the highest quality, purity, and full spectrum High Grade Hemp CBD (Cannabidiol) Oil on the market. Made using the superior supercritical CO2 liquid extraction, our CBD Oil is 100% natural and organic. Our research, performed alongside the University of Central Oklahoma and DV Biologics laboratory, demonstrate that we are the top nutritional and dietary supplement brand for High Grade Hemp CBD Oil.\nTo learn more and to buy CBD Hemp Oil please visit: www.earthsciencetech.com\nAbout Earth Science Pharmaceutical: Earth Science Pharmaceutical, Inc. is a wholly owned subsidiary of Earth Science Tech, Inc (ETST). Earth Science Pharmaceutical is focused on becoming a world leader in the development of low cost, non-invasive diagnostic tools, medical devices, testing processes and vaccines for STIs (Sexually Transmitted Infections and/or Diseases). Earth Science Pharmaceutical CEO, Dr. Michel Aubé, a renowned scientist, is committed to help grow ETST in the medical and pharmaceutical industry.\nTo learn more please visit: www.Earthsciencepharmaceutical.com\nAbout Cannabis Therapeutics: Cannabis Therapeutics, Inc. is a wholly owned subsidiary of Earth Science Tech, Inc. (ETST). Cannabis Therapeutics, Inc. was formed as an emerging biotechnology company poised to become a world leader in cannabinoid research and development for a broad line of cannabis cannabinoid-based pharmaceuticals, nutraceuticals as well as other products & solutions. Cannabis Therapeutics mission it to help change the healthcare landscape by introducing their proprietary cannabis-cannabinoid based products made for both the pharmaceutical and retail consumer markets worldwide.\nTo learn more please visit: www.Cannabisthera.com\nAbout KannaBidioiD: KannaBidioid, Inc. is wholly owned subsidiary of Earth Science Tech, Inc. (ETST). KannaBidioid, Inc. is focused in the recreational space to manufacture and distribute vapes/e-liquids and gummy edibles in the recreational space formulated by its unique Kanna and CBD formula. Kanna and CBD synergistically enhance one another, providing optimal relaxation, an uplifting sensation, enhance focus, and help with nicotine addiction based on their properties.\nTo learn more please visit: www.kannabidioidinc.com\nSAFE HARBOR ACT: Forward-Looking Statements are included within the meaning of Section 27A of the Securities Act of 1933, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements regarding our expected future financial position, results of operations, cash flows, financing plans, business strategy, products and services, competitive positions, growth opportunities, plans and objectives of management for future operations, including words such as \"anticipate,\" \"if,\" \"believe,\" \"plan,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"could,\" \"should,\" \"will,\" and other similar expressions are forward-looking statements and involve risks, uncertainties and contingencies, many of which are beyond our control, which may cause actual results, performance, or achievements to differ materially from anticipated results, performance, or achievements. We are under no obligation to (and expressly disclaim any such obligation to) update or alter our forward-looking statements, whether as a result of new information, future events or otherwise.\nInvestor Relations Dave Demarest (305) 546-7640 Earth Science Tech, Inc. Nickolas S. Tabraue, P/D/COO (305) 615-2118\nSource:Earth Science Tech, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=Ru5FGz_ay9s2hwMWfWvzhv_KudV0F9vI1G4deWAKJQR7_gmYPlnMfhtLyegeSTM0F_eM2zqs0Lwq9V1OT41IC56MzAy84g9T7hjb29rbCzvHQOnhLyFvYx7cKX20kmUGqyP9on5LA4V8Ap07XftqkQ==", "https://www.globenewswire.com/Tracker?data=CqbNRAIcJu8ETS_OpG5dBd4wWVhU6BLoYIXObDmNIcN5gfQz9GeJzVa9VYoO8nCforIxVj7EOxoffuO4_F9O2QKu2VEVWV2XTTBtVAsW6j8=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/b89d85a1-6398-4c15-858d-8dd04c4021d0", "https://www.globenewswire.com/Tracker?data=ChikalNvudriEajO-hZOdpqxm7Uy5y20x0o_voT0J9T6ey4eVmEn0GZp3vMK5Reus2xmOxBEfgLjD1M_rhampdBiPMQorLdore0yE-Solz0=", "https://www.globenewswire.com/Tracker?data=uGrKvZH0-qkhRE2GjLBcIF3t_QpYaZ6XMPjHy171aKmHjlH2y_V8umZfTqYmhlnGRDVVzF4fgOqBjssCkUMPyt1OQIpCp0NxFUkLb8GApIo="], "published": "2018-01-09T21:00:00.000+02:00", "crawled": "2018-01-09T23:50:16.013+02:00", "highlightTitle": ""}