{"organizations": [], "uuid": "0030de909fd74e92968800878d85746e4c1b03d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936293-IMMIG_WORKFORCE_1r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/09/employers-brace-for-the-loss-of-an-immigrant-work-force.html", "country": "US", "domain_rank": 767, "title": "Employers brace for the loss of an immigrant work force", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:37:00.000+02:00", "replies_count": 0, "uuid": "0030de909fd74e92968800878d85746e4c1b03d1"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/employers-brace-for-the-loss-of-an-immigrant-work-force.html", "ord_in_thread": 0, "title": "Employers brace for the loss of an immigrant work force", "locations": [], "entities": {"persons": [], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "central america", "sentiment": "none"}, {"name": "disney world", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "peter luger steak house", "sentiment": "none"}, {"name": "atlanta falcons", "sentiment": "none"}, {"name": "fannie mae", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "They clean federal office buildings in Washington and nurse the elderly in Boston. They are rebuilding hurricane-wrecked Houston. The Atlanta Falcons' new stadium, plumbing and heating systems at Fannie Mae's new headquarters, the porterhouse at Peter Luger Steak House and even the Disney World experience have all depended, in small part or large, on their labor.\nThey are the immigrants from Haiti and Central America who have staked their livelihoods on the temporary permission they received years ago from the government to live and work in the United States. Hundreds of thousands now stand to lose that status under the Trump administration, which said on Monday that roughly 200,000 immigrants from El Salvador would have to leave by September 2019 or face deportation.\nEven if they remain here illegally, they, like the young immigrants known as Dreamers whose status is also in jeopardy this winter, will lose their work permits, potentially scratching more than a million people from the legal work force in a matter of months. And the American companies that employ them will be forced to look elsewhere for labor, if they can get it at all.\n\"If you get rid of 26 percent of my employees, I guess I'm going to have to terminate some of the contracts,\" said Victor Moran, 52, the chief executive of Total Quality, a janitorial services company in the Washington area — \"unless I'm willing to break the law,\" which he said he was not. The company employs 228 people with temporary protected status, or T.P.S., all but a handful from El Salvador.\nConcentrated in California, Texas, Florida, New York, Virginia and Maryland, those with protected status work mainly in construction, restaurants and grocery stores, and as landscapers and day care workers, according to data on recipients from El Salvador, Honduras and Haiti assembled by the Center for Migration Studies, a nonprofit that has argued for extending the program.\nRead more from The New York Times:\nTrump administration says that nearly 200,000 Salvadorans must leave \nBrooklyn's Haitians wonder what awaits them when protections end \nMemphis pastor admits 'sexual incident' with high school student 20 years ago \nMore than 45,000 Haitians will have to leave by July 2019; about 57,000 Hondurans are hoping, against all indications to the contrary, that they will be spared the next time the Trump administration must decide whether to extend their protections.\nAnother report, by the Immigrant Legal Resource Center, estimates that stripping the protections from Salvadorans, Hondurans and Haitians would deprive Social Security and Medicare of about $6.9 billion in contributions over a decade, and would shrink the gross domestic product by $45.2 billion.\nOfficials under multiple presidents have renewed the protections year after year, allowing hundreds of thousands of people to enlarge their foothold on American life. But the Trump administration has emphasized that the permissions were originally granted because of wars and natural disasters in the immigrants' home countries and intended to last only until conditions there improved.\nThe administration and its supporters do cite one economic argument for tighter controls on immigration: Those jobs, they say, could be done by Americans.\n\"T.P.S. does not exist for the convenience of industries that rely on low-wage foreign labor,\" said Ira Mehlman, a spokesman for the Federation for American Immigration Reform.\nThe companies create \"self-fulfilling prophecies\" by offering little pay and grueling conditions, he said: \"When Americans reject the wages and working conditions they offer, they then argue that Americans are unwilling to take the jobs.\"\nBusiness leaders often insist they cannot find enough workers at all, let alone Americans. Construction companies already confronting a nationwide labor shortage will have to replace workers from what industry executives said was a minuscule pool, or turn down projects.\n\"There are no Americans out there to take the jobs,\" said Mark Drury, a vice president at Shapiro & Duncan, a Washington-area plumbing, heating and cooling firm. The company and its competitors have resorted to poaching each other's project managers, engineers, welders and plumbers.\nThe company even retrained and hired a former coal miner who decided to switch careers, Mr. Drury said, but had not found other miners willing to move to the area.\nNot only will the company have to lay off its 14 Salvadoran workers, Mr. Drury said, but it was also worrying about the roughly 30 employees who are protected from deportation by virtue of a government program for immigrants who were brought to the country illegally as children. The Trump administration has announced the program, Deferred Action for Childhood Arrivals, will expire in March. Congress is considering creating a new program for those immigrants, perhaps in exchange for new border security spending, but no deal has been reached.\nMr. Drury said he had about 40 openings. The company — which is helping to build a cancer center, the new headquarters of the mortgage giant Fannie Mae and a project at the National Security Agency's headquarters — was already turning away work because it could not hire fast enough, he said.\n\"Losing people just puts us further behind,\" he said.\nFor Stan Marek, the chief executive of Marek, a Houston-based construction company, the decisions to end temporary protections have come at the worst possible time. Houston is waiting to be rebuilt after its run-in with Hurricane Harvey, yet, he said, there will be fewer people than ever to overhaul the city's office buildings, schools, hotels and hospitals.\nAbout 30 employees from Honduras, Haiti and El Salvador with temporary protected status have worked for him for over a decade. Some are skilled craftsmen; some are supervisors.\nMr. Marek has pushed on his workers' behalf, even paying for a public relations campaign to call for immigration reform.\n\"If they lose their status — boom, we'll have to terminate them, and that's not much fun, telling a guy who's got three kids in high school, all American-born, that he's going to be terminated,\" Mr. Marek said. \"They're good people, damn good people.\"\nThough they will be subject to deportation, many immigrants who lose their temporary protections are likely to stay in the United States.\nAsked what he planned to do when his status expired next year, Noe Duarte said he and his wife and two adult children, who are already living here illegally, would simply \"hide.\"\nMr. Duarte came to the United States from El Salvador in 2000, fleeing violence and poverty in his hometown, and was granted temporary status the following year. His family operates two small companies, cleaning and painting houses, in Gaithersburg, Md. When business is slow, Mr. Duarte works as a safety supervisor for a major construction company.\nEven knowing that their finances would crater without his work permit, he felt that the family would be safer here than in El Salvador.\n\"The country is infested with gangs,\" he said. \"The moment we arrived, they would come to our door asking for money. And if we didn't give it to them, we'd be killed.\"\nMr. Moran, the janitorial services executive, had been worried about the impending cancellation of the program. His staff cleans buildings throughout the Washington area, including the headquarters of Immigration and Customs Enfo", "external_links": [], "published": "2018-01-09T18:37:00.000+02:00", "crawled": "2018-01-09T19:16:43.023+02:00", "highlightTitle": ""}