{"organizations": [], "uuid": "972073a61b42b96b6fd579276020c97d09525ea7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-cal-maine-foods-reports-second-quarter-fiscal-2018-results.html", "country": "US", "domain_rank": 767, "title": "Cal-Maine Foods Reports Second Quarter Fiscal 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-05T14:30:00.000+02:00", "replies_count": 0, "uuid": "972073a61b42b96b6fd579276020c97d09525ea7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-cal-maine-foods-reports-second-quarter-fiscal-2018-results.html", "ord_in_thread": 0, "title": "Cal-Maine Foods Reports Second Quarter Fiscal 2018 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "jackson", "sentiment": "none"}, {"name": "miss.", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JACKSON, Miss.--(BUSINESS WIRE)-- Cal-Maine Foods, Inc. (NASDAQ: CALM) today reported results for the second quarter and twenty-six weeks ended December 2, 2017.\nNet sales for the second quarter of fiscal 2018 were $361.2 million, a 42.4 percent increase, compared to $253.5 million for the second quarter of fiscal 2017. The Company reported a net loss of $26.1 million, or $0.54 per basic and diluted share, for the second quarter of fiscal 2018, compared to net loss of $23.0 million, or $0.48 per basic and diluted share, for the second quarter of fiscal 2017. Results for the second quarter of fiscal 2018 include a charge of $52.8 million, or $1.09 per basic and diluted share, after tax, related to the settlement of previously disclosed antitrust claims that several large direct action purchasers had asserted against the Company. Excluding this item, net income for the second quarter of fiscal 2018 was $26.6 million, or $0.55 per basic and diluted share.\nFor the twenty-six weeks ended December 2, 2017, net sales were $624.0 million compared with $493.4 million for the prior-year period. The Company reported a net loss of $42.1 million, or $0.87 per basic and diluted share, for the twenty-six weeks ended December 2, 2017, compared with a net loss of $53.9 million, or $1.12 per basic and diluted share, for the year-earlier period. Excluding the item described above, net income for the twenty-six weeks ended December 2, 2017, was $10.7 million, or $0.22 per basic and diluted share.\nDolph Baker, chairman, president and chief executive officer of Cal-Maine Foods, Inc., stated, “At the end of 2017, we reached an agreement on material terms of the settlement of antitrust lawsuits that several large purchasers had filed nearly a decade ago against the Company and many other egg producers. While we deny any liability in these cases and still believe that our conduct has always been lawful, we decided that it was in the best interests of our shareholders, customers, and employees to settle these long-standing cases at this time. This settlement eliminates the substantial risk, uncertainty, expense, and distraction associated with continuing the litigation against these purchasers. While the charge related to this settlement affected our financial results for the second quarter of fiscal 2018, we had a solid operating performance during the quarter.”\nPursuant to the agreement, which the parties intend to be legally binding, the Company agreed to pay $80.8 million after all parties sign a formal settlement agreement, which the parties agreed to work in good faith to execute no later than January 10, 2018. The settlement does not affect the remaining previously disclosed antitrust claims, which consist of claims of indirect purchasers of shell eggs (who have twice failed in efforts to certify a class) and the dismissed claims of non-class purchasers of egg products (who have appealed this dismissal).\nBaker continued, “Our results for the second quarter of fiscal 2018 reflect a significant improvement in egg market conditions compared with the second quarter last year. Our sales were up 42.4 percent, as we benefitted from higher market prices and solid demand trends. We are pleased with our ability to execute our strategy and capitalize on market opportunities with a profitable performance.\n“Market prices for conventional shell eggs continued to move higher throughout the quarter with our average customer selling prices for all eggs and conventional eggs up 36.0 percent and 77.6 percent, respectively, in the second quarter compared with a year ago. Market prices remained strong through the Thanksgiving holiday. According to Nielsen data, retail demand has been very good and in line with normal seasonal trends, supported by increased egg promotions in grocery stores. After a period of sluggish demand from institutional food customers, this sector has returned to more egg usage. The USDA reports that shell egg exports have continued to expand in calendar 2017 and have recovered from previous low levels following the 2015 avian influenza (AI) outbreak. Export demand has also increased as a result of the reported Fipronil contaminations across Europe and Southeast Asia. Together, these demand trends have resulted in a more favorable market environment compared with a year ago. The laying hen flock size has been consistent with prior-year levels as production has moderated, resulting in an improved balance of supply and demand. Recent USDA reports, however, show an increase in chicks hatched, which could indicate future increases in supply.\n“Specialty eggs, excluding co-pack sales, accounted for 22.6 percent of our total sales volume for the second quarter of fiscal 2018, compared with 22.4 percent for the same period a year ago. Specialty egg revenue was 32.3 percent of total shell egg revenue, compared with 45.8 percent for the second quarter of fiscal 2017. The average selling price for specialty eggs was 5.0 percent lower compared with the second quarter of last year. However, our volumes were higher for the second quarter, with total specialty egg dozens sold up 5.3 percent over the prior-year period.\n“We have continued to position Cal-Maine Foods to take full advantage of the current and expected growth opportunities for specialty eggs. As reported, many food service providers, national restaurant chains and major retailers, including our largest customers, have made public commitments to transition away from conventional eggs and exclusively offer cage-free eggs by future specified dates. We are focused on meeting our customers’ needs through this transition period. Cal-Maine Foods offers a favorable product mix that includes cage-free eggs, as well as other healthy and affordable options for consumers including conventional, nutritionally enhanced and organic eggs.”\nBaker added, “Our operations ran well throughout this fall and our managers worked hard to maintain efficient production, especially in our Florida, Georgia and Texas locations affected by the hurricanes early in the second quarter. Operating loss for the second quarter was $40.5 million, including the impact of the $80.8 million legal settlement expense. Excluding the impact of legal settlement expense, our operating income was $40.3 million. Farm production costs per dozen were consistent with the prior-year period. For the second quarter of fiscal 2018, our feed costs per dozen produced were slightly lower than a year ago. Looking ahead, this year’s USDA harvest estimates indicate we should have an ample supply of our primary feed ingredients for the year.”\nOn December 22, 2017, the President of the United States signed into law the Tax Cuts and Jobs Act tax reform legislation. While the Company continues to assess the impact of the tax reform legislation on its business and consolidated financial statements, the legislation does reduce the U.S. corporate tax rate from the current rate of 35 percent to 21 percent. At December 2, 2017, the Company had a deferred tax liability of approximately $75.3 million based on a U.S. federal tax rate of 35 percent. Since this legislation was enacted after the close of the Company's second quarter of fiscal 2018, this liability will be revalued at a lower rate during the third quarter of fiscal 2018, which ends on March 3, 2018", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.calmainefoods.com&esheet=51738231&newsitemid=20180105005058&lan=en-US&anchor=www.calmainefoods.com&index=1&md5=2259e01f411859623fe734201169ed23", "http://www.businesswire.com/news/home/20180105005058/en/"], "published": "2018-01-05T14:30:00.000+02:00", "crawled": "2018-01-05T14:40:39.000+02:00", "highlightTitle": ""}