{"organizations": [], "uuid": "67882227411daea4d54805616259de4ac4b10b3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226919254&w=1200&r=LYNXMPEE0U0Q4", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/germany-security-children/interview-brainwashed-children-of-islamist-fighters-worry-germany-spy-chief-idINKBN1FK1GB", "country": "US", "domain_rank": 408, "title": "INTERVIEW: \"Brainwashed\" children of Islamist fighters worry Germany: spy chief", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T13:26:00.000+02:00", "replies_count": 0, "uuid": "67882227411daea4d54805616259de4ac4b10b3c"}, "author": "", "url": "https://in.reuters.com/article/germany-security-children/interview-brainwashed-children-of-islamist-fighters-worry-germany-spy-chief-idINKBN1FK1GB", "ord_in_thread": 0, "title": "INTERVIEW: \"Brainwashed\" children of Islamist fighters worry Germany: spy chief", "locations": [], "entities": {"persons": [{"name": "sabine siebold", "sentiment": "none"}, {"name": "andrea shalal", "sentiment": "none"}, {"name": "maassen", "sentiment": "none"}, {"name": "hans-georg maassen", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "min read  berlin", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - Germany’s domestic intelligence chief wants the government to review laws restricting the surveillance of minors to guard against the children of Islamist fighters returning to the country as “sleeper agents” who could carry out attacks.\nHans-Georg Maassen, head of the BfV agency, told Reuters that security officials were preparing for the return of Islamic State fighters to Germany along with potentially “brainwashed” children, although no big wave appeared imminent.\nNearly 1,000 people are believed to have left Germany to join up with the Islamist militants. As the group’s presence in the Middle East crumbles, some are returning with family members.\nOnly a small number of the 290 toddlers and children who left Germany or were born in Syria and Iraq had returned thus far, Maassen said. Many were likely to still be in the region, or perhaps moving to areas such as Afghanistan, where Islamic State remains strong.\nHe said Germany should review laws restricting surveillance of minors under the age of 14 to prepare for the increased risk of attacks by children as young as nine who grew up in Islamic State schools.\n“We see that children who grew up with Islamic State were brainwashed in the schools and the kindergartens of the IS,” he said. “They were confronted early with the IS ideology ... learned to fight, and were in some cases forced to participate in the abuse of prisoners, or even the killing of prisoners.”\nHans-Georg Maassen, head of the German Federal Office for the Protection of the Constitution (Bundesamt fuer Verfassungsschutz) addresses a news conference to introduce the agency's 2016 report on militant threats to the constitution in Berlin, Germany, July 4, 2017. REUTERS/Axel Schmidt/Files He said security officials believed such children could later carry out violent attacks in Germany.\n“We have to consider that these children could be living time bombs,” he said. “There is a danger that these children come back brainwashed with a mission to carry out attacks.”\nMaassen’s comments were the first specific estimate of the number of children affected, following his initial warning in October that such children could pose a threat after being indoctrinated in battlefield areas.\nThe radicalisation of minors has been a big topic in Germany given that three of five Islamist attacks in Germany in 2016 were carried out by minors, and a 12-year-old boy was also detained after trying to bomb a Christmas market in Ludwigshafen.\nThe German government says it has evidence that more than 960 people left Germany for Iraq and Syria through November 2017 to fight for the Islamic State jihadist group, of which about a third are believed to have returned to Germany. Another 150 likely died in combat, according to government data.\nMaassen said Islamic State also continued to target vulnerable youths in Germany through the Internet and social media, often providing slick advertising or age-appropriate propaganda to recruit them to join the jihadist group.\n“Islamic State uses headhunters who scour the Internet for children that can be approached and tries to radicalise these children, or recruit these children for terrorist attacks,” he said.\nReporting by Andrea Shalal; Editing by Angus MacSwan\n ", "external_links": [], "published": "2018-01-31T13:26:00.000+02:00", "crawled": "2018-01-31T14:04:52.017+02:00", "highlightTitle": ""}