{"organizations": [], "uuid": "2bb227f0784beae30a15e36a823f2f8f6e1ad1e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-sandgren/update-1-tennis-sandgren-topples-thiem-to-keep-melbourne-dream-alive-idUKL4N1PH3NL", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Tennis-Sandgren topples Thiem to keep Melbourne dream alive", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T13:03:00.000+02:00", "replies_count": 0, "uuid": "2bb227f0784beae30a15e36a823f2f8f6e1ad1e7"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-sandgren/update-1-tennis-sandgren-topples-thiem-to-keep-melbourne-dream-alive-idUKL4N1PH3NL", "ord_in_thread": 0, "title": "UPDATE 1-Tennis-Sandgren topples Thiem to keep Melbourne dream alive", "locations": [], "entities": {"persons": [{"name": "thiem", "sentiment": "negative"}, {"name": "sandgr", "sentiment": "none"}, {"name": "dominic thiem", "sentiment": "none"}, {"name": "tennys sandgren", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}, {"name": "sandgren", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}], "organizations": [{"name": "hisense arena", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 11:06 AM / Updated 26 minutes ago UPDATE 2-Tennis-Sandgren topples Thiem to keep Melbourne dream alive Reuters Staff \n* American outsider knocks out fifth seed in five-set thriller \n* To meet South Korea’s Chung for place in semi-finals (Adds details, quotes) \nBy Ian Ransom \nMELBOURNE, Jan 22 (Reuters) - American sensation Tennys Sandgren’s dream debut at the Australian Open continued on Monday as the rank outsider upset fifth seed Dominic Thiem in a five-set thriller to reach an improbable quarter-final. \nThe world number 97 had failed to win a match in his two previous main draw appearances at grand slams or even string together more than two wins at Tour-level before arriving at Melbourne Park. \nBut Sandgren’s 6-2 4-6 7-6(4) 6-7(7) 6-3 triumph at a heaving Hisense Arena made the Tennessee native only the second debutant to reach the Australian Open quarter-finals in 20 years. \n“At the end of the match doing the post match interview (I was) thinking this would be one of those moments where you wake up,” the beaming 26-year-old told reporters. \n“I definitely had a real pinch-me moment. Wow, this is hopefully real. If I wake up now, I‘m going to be real upset.” \nIn a riveting contest played out in an atmosphere of a football match, Sandgren played like a man possessed, and came within an inch of victory during the frenetic fourth-set tiebreak. \nThiem saved a match point with a blistering backhand down the line and held on to force a deciding fifth set. \nAs crushing a let-down as it was, Sandgren shrugged off the setback and maintained the fearless tennis that had pushed Thiem to the wall. \nWhen the Austrian missed a string of first serves, he pounced in the sixth game to create a break point and grimly held firm until Thiem fell on his sword with a forehand into the net. \nMonths ago, Sandgren was just another minor tour battler criss-crossing America in his car to play tournaments but on Monday he served like a grand slam titan to march to the brink of victory. \nAfter sealing the match in style with a thumping forehand winner from the baseline, Sandgren threw down his racket and raised his arms aloft in joy. \n“This is definitely surprising for me because normally when I make like a little bit of a jump, I feel like I‘m hitting my head against a wall until I get a breakthrough,” he said. \n“I know that I‘m good enough to do good things in the game. This is confirmation for me.” \nSandgren will next face young gun Chung Hyeon who upset six-times champion Novak Djokovic to become South Korea’s first ever grand slam quarter-finalist. \nSandgren’s run has left a string of higher-ranked victims in his wake, including triple grand slam champion Stan Wawrinka, but it also took a toll on his South Africa-born mother watching the broadcast at home in the United States. \nShe fell against a pool table and broke a rib when jumping up and down celebrating with friends from a neighbourhood group during one of her son’s earlier wins in Melbourne. \n”Woops,“ said Sandgren. ”I was concerned about it. She went to the hospital, thankfully. \n“She’s lying down, resting, watching some tennis and having a good time.” Editing by Ed Osmond", "external_links": [], "published": "2018-01-22T13:03:00.000+02:00", "crawled": "2018-01-22T13:35:37.029+02:00", "highlightTitle": ""}