{"organizations": [], "uuid": "cddac38bb341b4615a8fa0fd570389fec12d2f6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/29/104371696-RTX334EF.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19836768/device/rss/rss.html", "section_title": "Energy", "url": "https://www.cnbc.com/2018/01/05/brookfield-business-partners-to-buy-westinghouse-for-4-point-6-billion.html", "country": "US", "domain_rank": 767, "title": "Brookfield Business Partners to buy Westinghouse for $4.6 billion", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-05T14:05:00.000+02:00", "replies_count": 0, "uuid": "cddac38bb341b4615a8fa0fd570389fec12d2f6f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/brookfield-business-partners-to-buy-westinghouse-for-4-point-6-billion.html", "ord_in_thread": 0, "title": "Brookfield Business Partners to buy Westinghouse for $4.6 billion", "locations": [], "entities": {"persons": [{"name": "westin", "sentiment": "negative"}, {"name": "westingho", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "waynesboro", "sentiment": "none"}], "organizations": [{"name": "brookfield business partners", "sentiment": "negative"}, {"name": "georgia power | reuters", "sentiment": "negative"}, {"name": "westinghouse", "sentiment": "negative"}, {"name": "toshiba", "sentiment": "none"}, {"name": "u.s. bankruptcy court", "sentiment": "none"}, {"name": "brookfield asset management", "sentiment": "none"}, {"name": "westinghouse electric", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Georgia Power | Reuters The Vogtle Unit 3 and 4 site, being constructed by primary contractor Westinghouse, a business unit of Toshiba, near Waynesboro, Georgia, is seen in an aerial photo taken February 2017. A subsidiary of Canada's Brookfield Asset Management plans to acquire Westinghouse Electric, the bankrupt nuclear services company owned by Toshiba , for $4.6 billion.\nBrookfield Business Partners said in a statement on Thursday that it and institutional partners would use $1 billion of equity and $3 billion of long-term debt financing to buy the Pittsburgh-based business, its first investment in nuclear power.\nThe buyers are also assuming Westinghouse's underfunded pension plan.\nNew York-listed shares of Brookfield Business Partners were up 3.4 percent in afternoon trading.\nThe deal is expected to close in the third quarter but will require approval from regulators and the U.S. Bankruptcy Court.\nWestinghouse has said it is aiming to exit bankruptcy as soon as March, which would allow Toshiba to book tax benefits in the current fiscal year.\n\"Brookfields acquisition of Westinghouse reaffirms our position as the leader of the global nuclear industry, said Westinghouse Chief Executive Officer José Emeterio Gutiérrez.\nToshiba did not immediately respond to requests for comment.\nThe Brookfield group of companies is among the world's largest investors in stable, long-lived assets such as utilities, real estate, energy and infrastructure.\n\"Acquiring Westinghouse definitely fits the risk approach they have,\" said Mycle Schneider, an energy and nuclear policy consultant in Paris. \"They buy assets in shaky situations.\"\nLast year, Brookfield Asset Management acquired control of two owners of renewable energy projects, TerraForm Global and TerraForm Power, from SunEdison, which had filed for Chapter 11.\nIn 2016, Brookfield Business Partners converted debt to a large equity stake in a Texas power producer that emerged from Chapter 11 and became Vistra Energy. And in November, Brookfield Property Partners offered to buy the remaining shares in General Growth Properties, adding to a large stake it purchased to bring the mall owner out of bankruptcy.\nSchneider said he was surprised that Brookfield acquired Westinghouse, given that the company has no other nuclear businesses. Westinghouse is one the world's leading suppliers of nuclear fuel, and it provides some form of service to 80 percent of the world's 450 commercial reactors, according to court records.\nThose two business lines generated combined cash flow of $403 million on revenue of about $3.1 billion in Westinghouse's 2015 financial year, according to court records.\nHowever, the company suffered after it agreed to build two plants in the U.S. Southeast on fixed-price contracts. The project went billions of dollars over budget, and Westinghouse filed for bankruptcy in March to escape the contracts.\nConstruction of new nuclear power plants globally has dropped to the lowest level in a decade following renewed safety concerns after the Fukushima disaster in Japan in 2011.\nOne of Westinghouse's unfinished U.S. projects, known as Vogtle in Georgia, will continue with Southern Co. replacing the company as the project manager. A South Carolina project known as V.C. Summer was abandoned in July.\nThe lead utility behind the V.C. Summer project, Scana Corp , agreed on Wednesday to a $7.9 billion takeover bid from Dominion Energy Inc.\nWestinghouse has joined a consortium bidding to provide nuclear power in Saudi Arabia, one of the biggest new markets in the world. Bringing Westinghouse out of bankruptcy could help close a proposed deal for six of the company's new AP1000 reactors in India.", "external_links": [], "published": "2018-01-05T14:05:00.000+02:00", "crawled": "2018-01-05T14:16:36.005+02:00", "highlightTitle": ""}