{"organizations": [], "uuid": "554993e23ab7ed70648392ae4b73c5a96f67a03e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220601647&w=1200&r=LYNXMPEE08190", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-economy-jobs/u-s-job-openings-layoffs-fall-to-six-month-lows-in-november-idUSKBN1EY27K", "country": "US", "domain_rank": 408, "title": "U.S. job openings, layoffs fall to six-month lows in November", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:02:00.000+02:00", "replies_count": 0, "uuid": "554993e23ab7ed70648392ae4b73c5a96f67a03e"}, "author": "", "url": "https://www.reuters.com/article/us-usa-economy-jobs/u-s-job-openings-layoffs-fall-to-six-month-lows-in-november-idUSKBN1EY27K", "ord_in_thread": 0, "title": "U.S. job openings, layoffs fall to six-month lows in November", "locations": [], "entities": {"persons": [{"name": "sarah house", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "wells fargo securities", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "labor department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. job openings fell for a second straight month in November, with declines in the manufacturing and real estate sectors, supporting economist forecasts that job growth will slow in 2018.\nThe monthly Job Openings and Labor Turnover Survey, or JOLTS, released by the Labor Department on Tuesday, also found that layoffs dropped to a six-month low, however, showing continued labor market strength.\nJob openings, a measure of labor demand, fell by 46,000 to a seasonally adjusted 5.88 million, the lowest level since May. The job openings rate was 3.8 percent, a decline from October’s 3.9 percent.\n“The recent declines followed a sharp run up over the first three quarters of 2017,” said Sarah House, an economist at Wells Fargo Securities in Charlotte, North Carolina. “If sustained, this suggests a more moderate pace of hiring ahead.”\nHiring dropped 104,000 to 5.49 million in November, and the hiring rate dipped to 3.7 percent from 3.8 percent. Economists expect job growth this year to slow to well below the 2017 monthly average of 170,000 as the labor market hits full employment.\nThe unemployment rate is at a 17-year low of 4.1 percent and economists expect it to drop to 3.5 percent by the end of 2018. Non-farm payrolls rose 148,000 in December.\n“Like the recent readings on payrolls and initial claims, we see some moderation in the labor market data off of strong levels,” said Daniel Silver, an economist at JP Morgan in New York.\nThere were 378,000 job openings in manufacturing in November, down from 409,000 in October. The transportation, warehousing, and utilities sector saw a 60,000 drop in job openings. There was a 39,000 decline in job openings in the real estate and rental and leasing sector.\nBut job openings in the troubled retail sector increased 88,000 in November. The sector lost 67,000 jobs in 2017 as retailers, reeling from stiff competition from online sellers like Amazon.com Inc ( AMZN.O ), closed stores.\nThe JOLTS report also showed layoffs decreasing 7,000 to 1.67 million in November. That was the lowest level since May and marked five straight months of declines.\nThere was a slight drop in the number of people voluntarily quitting their jobs, leaving the quits rate unchanged at 2.2 percent for a third straight month. The Federal Reserve looks at the quits rate as a measure of job market confidence.\n“The low turnover rates indicate that there is less movement in the labor market than at other times when we’ve had very low unemployment,” said Cathy Barrera, chief economist at ZipRecruiter. “It is great for the labor market to be near full employment, but if workers are staying put, then there is little pressure for employers to raise wages.”\nReporting By Lucia Mutikani, Editing by Rosalba O'Brien\n ", "external_links": [], "published": "2018-01-09T20:02:00.000+02:00", "crawled": "2018-01-09T20:20:26.060+02:00", "highlightTitle": ""}