{"organizations": [], "uuid": "4ec90f860b84de2b50a433294b7176a05f9f75f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/supreme-court-blocks-prato-appeal-in-dex/supreme-court-blocks-prato-appeal-in-dexia-swaps-ruling-idUSL8N1PD4LO", "country": "US", "domain_rank": 408, "title": "Supreme Court blocks Prato appeal in Dexia swaps ruling", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T22:59:00.000+02:00", "replies_count": 0, "uuid": "4ec90f860b84de2b50a433294b7176a05f9f75f0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/supreme-court-blocks-prato-appeal-in-dex/supreme-court-blocks-prato-appeal-in-dexia-swaps-ruling-idUSL8N1PD4LO", "ord_in_thread": 0, "title": "Supreme Court blocks Prato appeal in Dexia swaps ruling", "locations": [], "entities": {"persons": [{"name": "prato", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "prato", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "supreme court", "sentiment": "negative"}, {"name": "ifr", "sentiment": "negative"}, {"name": "english supreme court", "sentiment": "negative"}, {"name": "dexia", "sentiment": "negative"}, {"name": "dexia crediop", "sentiment": "none"}, {"name": "court of appeal", "sentiment": "none"}, {"name": "comune di prato", "sentiment": "none"}, {"name": "bank of italy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 18 (IFR) - The English Supreme Court has delivered a blow to Italian local authorities seeking compensation for soured derivatives trades after refusing to grant Comune di Prato permission to appeal a 2017 decision in favour of its swap counterparty, Dexia Crediop.\nThe ruling, which overrides the use of local laws to invalidate swaps trades, is the latest in a series of legal setbacks for Italy’s municipalities, which are seeking redress for an estimated €2.5bn of losses on derivatives contracts.\nPrato is one of around 600 Italian municipalities that entered into swaps with an aggregate notional value of more than €35bn between 2001 and 2008, according to the Bank of Italy.\nThe case refers to a series of six swaps that Prato entered into with Dexia as part of a debt restructuring. Prato defaulted on the final swap - an interest rate collar - in 2010.\nA 2015 High Court judgment found in favour of Prato, deeming those swaps to be null and void by allowing local Italian laws to override the English law swap agreements. London’s Court of Appeal overturned that ruling last year, paving the way for Dexia to recover €6.5m of missed payments on the interest rate swap up to its 2013 maturity.\nThe Court of Appeal ruled that Article 3(3) of the Rome Convention, which states that the choice of governing law of a contract should not prejudice the application of mandatory local laws, did not apply given the international basis of the ISDA Master Agreement underpinning the trades and the existence of back-to-back hedges that took place outside of Italy.\nPrato took that decision to the Supreme Court, claiming that the Court of Appeal had applied the wrong approach to Article 3(3) by taking into account “elements” that were not relevant to the situation.\nThe Supreme Court sided with the Court of Appeal, however, noting that it had “carefully identified the relevant elements”.\n“The Supreme Court has resisted a restriction of the elements to be considered when deciding if a transaction is in fact connected with one country only,” said James Partridge, a partner at Allen & Overy, which represented Dexia.\n”Instead, the Supreme Court has approved the Court of Appeal’s approach to Article 3(3), which takes into account ISDA form documentation and back-to-back transactions as relevant international elements.”\nThe court also blocked additional routes for compensation after refusing Prato’s application to refer the question to the European Court of Justice.\n“The confirmation of the Court of Appeal’s approach will offer comfort to any party concerned about the potential for mandatory rules of local law to undermine their agreed choice of law,” said Partridge.\nA landmark 2012 ruling by Italy’s highest appeal court delivered the first real blow to municipalities after it found in favour of Dexia and Depfa on swaps entered into with the Province of Pisa. The municipality had challenged the enforceability of those derivatives on the basis of hidden costs, but the court rendered the transactions valid and binding.\nIn 2014, an Italian appeal court acquitted four banks of mis-selling swaps to the city of Milan, overturning an earlier verdict. (Reporting by Helen Bartholomew)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T22:59:00.000+02:00", "crawled": "2018-01-19T12:23:42.000+02:00", "highlightTitle": ""}