{"organizations": [], "uuid": "0207260eee9eb405db2158ea138a94e950a40f93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 27, "shares": 27, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222074914&w=1200&r=LYNXMPEE0E0B8", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-hna-group-debt/hnas-problems-mount-as-airlines-delay-payments-bank-sets-up-team-to-handle-debt-sources-idUSKBN1F40M5", "country": "US", "domain_rank": 408, "title": "HNA's problems mount as airlines delay payments, bank sets up team to handle debt: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T09:08:00.000+02:00", "replies_count": 0, "uuid": "0207260eee9eb405db2158ea138a94e950a40f93"}, "author": "", "url": "https://www.reuters.com/article/us-hna-group-debt/hnas-problems-mount-as-airlines-delay-payments-bank-sets-up-team-to-handle-debt-sources-idUSKBN1F40M5", "ord_in_thread": 0, "title": "HNA's problems mount as airlines delay payments, bank sets up team to handle debt: sources", "locations": [], "entities": {"persons": [{"name": "anshuman daga", "sentiment": "none"}, {"name": "engen tham", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "hna", "sentiment": "negative"}, {"name": "bank of china ltd", "sentiment": "none"}, {"name": "export-import bank of china", "sentiment": "none"}, {"name": "hna group co ltd", "sentiment": "none"}, {"name": "china minsheng banking corp ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bank of communications co ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 7:09 AM / Updated 3 hours ago HNA's problems mount as airlines delay payments, bank sets up team to handle debt: sources Engen Tham , Anshuman Daga 6 Min Read \nSHANGHAI/SINGAPORE (Reuters) - Some airlines affiliated with China’s HNA Group Co Ltd are delaying aircraft lease payments to lessors, and Export-Import Bank of China, which is a long-term financer of the group, has formed a team to handle the conglomerate’s liquidity issues, several banking and leasing sources said. \nExecutives from leasing units of Chinese lenders including Bank of China Ltd ( 601988.SS ), China Minsheng Banking Corp Ltd ( 600016.SS ) and Bank of Communications Co Ltd ( 601328.SS ) have held talks with some HNA-linked airlines to recover payments, the sources said. \n“Some payments have been delayed by over two months,” said one senior Beijing-based executive at a Chinese lessor. He said HNA airlines had informed the lessor that payments would be made soon as they expected banks to support HNA in coming months. \nHNA, an aviation-to-financial services conglomerate, said in a statement to Reuters: “HNA and its subsidiaries are maintaining stable operations, and are in the process of gradually paying each lessor’s fees as planned.” \nHNA’s $50 billion worth of deal-making over the past two years, which included investments in Deutsche Bank DBkGn.DE and the Hilton ( HLT.N ) hotels group, has sparked intense scrutiny of its opaque ownership and use of leverage. \nIn June, the Chinese government told major banks to review their credit exposure to HNA and a handful of other non-state companies, putting pressure on its finances. \nSome of the sources from lessors and banks said HNA’s flagship Hainan Airlines ( 600221.SS ) and smaller ones including Lucky Air and Capital Airlines had missed payments, while Tianjin Airlines was seeking to extend the term for payments due this year. \nThe sources declined to be named because of the sensitivity of the matter. \nLucky Air and Capital Airlines declined to comment. Tianjin Airlines, Bank of Communications Financial Leasing, Minsheng Financial Leasing and EXIM did not respond to requests for comment. \nHainan Airlines suspended trading on Jan. 10 pending an announcement. The reason for the share suspension is unclear. \nTianjin Airlines has asked a Chinese lessor to delay June rental payments for three aircraft, said one source with direct knowledge. \nAnother source said one HNA-affiliated airline has told Bank of Communications Financial Leasing that it will not be paying rental payments due in January. He did not name the airline. \nIn the last few weeks, executives from some international lessors have flown to China to meet executives at HNA-affiliated airlines and thrash out a repayment plan, the sources said. \n“This is a widespread issue among many lessors but they understand that a lot depends on whether banks re-open their funding for HNA and lessors are betting on that,” said one financier at a European bank. \nIn November, Airfinance Journal reported the delays in lease rental payments and the problems have intensified since then, the sources said. \nHowever, Robert Martin, the chief executive of BOC Aviation Ltd ( 2588.HK ), said his company, the leasing unit of Bank of China, did not have problems on lease payments by HNA-linked airlines. \n“BOC Aviation has very strong focus on receivables management and we ended 2017 with a collection rate of 99.9 percent. This included airline subsidiaries of the HNA Group,” Martin said in an e-mail. RECOVERY GROUP \nFaced with a slew of repayment obligations and concerns about rising financing costs, HNA had its creditworthiness downgraded in November by S&P Global Ratings, as a result of its “aggressive financial policy”. \nUnderlining the growing concern by lenders over the group’s repayment obligations, the Beijing-based EXIM set up a team this month to handle HNA’s debt, which the conglomerate is struggling to repay, banking sources said. \nHNA has promised to pay all outstanding delayed payments by the end of January, said a source with direct knowledge. \nEXIM did not respond to request for comments. \nEXIM’s HNA team was set up after meetings at the conglomerate’s headquarters in Hainan, in southern China, late last year, when HNA asked for new loans to cover existing debt, the source said. \nHNA has also been attempting to re-organize its debt commitments from other lenders, the banking sources said. BIG PLAYER \nHNA Group has 223 planes on either financial or operating leases, according to financial reports at the end of June, making up around 62 percent of their fleet. \nMany aircraft leases in China are full-recourse leases, said David Yu, a professor and aircraft leasing specialist at New York University Shanghai. This means lessors are on the hook for the money banks have lent them to acquire the planes, putting them at risk of default, he said. \nDepending on the terms of the loans, lenders would be able to take steps including asking for early repayment of loans to seizing planes for sale. But the lessors for the HNA airlines had not taken any steps to seize any planes as they were confident of receiving the payments, the sources said. Reporting by Engen Tham and Anshuman Daga; Additional reporting by Matthew Miller", "external_links": [], "published": "2018-01-15T09:08:00.000+02:00", "crawled": "2018-01-15T09:13:03.046+02:00", "highlightTitle": ""}