{"organizations": [], "uuid": "14d0a87bb270577320f88bfd7aba6c44720e5faf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-ags-prices-initial-public-offering.html", "country": "US", "domain_rank": 767, "title": "AGS Prices Initial Public Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T02:43:00.000+02:00", "replies_count": 0, "uuid": "14d0a87bb270577320f88bfd7aba6c44720e5faf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-ags-prices-initial-public-offering.html", "ord_in_thread": 0, "title": "AGS Prices Initial Public Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "inc.", "sentiment": "negative"}, {"name": "ags", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 25, 2018 /PRNewswire/ -- PlayAGS, Inc. (\"AGS\" or the \"Company\"), a leading designer and supplier of electronic gaming machines and other products and services for the gaming industry, today announced the pricing of its initial public offering of 10,250,000 shares of its common stock at an initial public offering price of $16.00 per share, before underwriting discounts and commissions. The Company has also granted the underwriters a 30-day option to purchase up to an additional 1,537,500 shares of its common stock at the initial public offering price, less underwriting discounts and commissions. AGS's existing shareholders will not sell any shares in the offering.\nThe shares are expected to begin trading on The New York Stock Exchange (NYSE) under the symbol \"AGS\" on January 26, 2018. The offering is expected to close on January 30, 2018 subject to customary closing conditions.\nAGS expects to receive gross proceeds of approximately $164.0 million from the offering, or approximately $188.6 million if the underwriters exercise their over-allotment option in full. AGS intends to use the gross proceeds from the offering to redeem in full its PIK notes, and pay fees and expenses in connection with the offering.\nCredit Suisse, Deutsche Bank Securities, Jefferies and Macquarie Capital are acting as joint book-running managers and as representatives of the underwriters for the offering. BofA Merrill Lynch, Citigroup, Nomura, Stifel and SunTrust Robinson Humphrey are acting as joint book-running managers for the offering. Roth Capital Partners, Union Gaming, The Williams Capital Group, L.P. and Apollo Global Securities are acting as co-managers for the offering.\nThe offering is being made only by means of a prospectus. A copy of the prospectus relating to this offering, when available, may be obtained from any of the following sources:\nCredit Suisse Securities (USA) LLC, Attention: Prospectus Department, One Madison Avenue, New York, NY 10010, or by telephone at (800) 221-1037 or by email at newyork.prospectus@credit-suisse.com ; Deutsche Bank Securities Inc., Attention: Prospectus Group, 60 Wall Street, New York, NY 10005, or by telephone at (800) 503-4611, or by email at prospectus.CPDG@db.com ; Jefferies LLC, Attention: Prospectus Department, 520 Madison Avenue, 2 nd Floor, New York, NY 10022, or by telephone at (877) 821-7388 or by email at Prospectus_Department@Jefferies.com ; or Macquarie Capital (USA) Inc., Attention: Syndicate Department, 125 West 55 th Street, L-22, New York, NY 10019, or by telephone at (212) 231-0440 or by email at MacquarieEquitySyndicateUSA@macquarie.com\nA registration statement relating to these securities has been filed with the Securities and Exchange Commission and has been declared effective. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout AGS\nAGS is a leading designer and supplier of electronic gaming machines (\"EGMs\") and other products and services for the gaming industry. Historically we have focused on supplying Class II EGMs to the Native American gaming market. We have recently expanded our product line-up to include: (i) Class III EGMs for commercial and Native American casinos, (ii) video bingo machines for select international markets, (iii) table game products, and (iv) interactive social casino products.\nForward-Looking and Cautionary Language\nThis press release contains, and oral statements made from time to time by our representatives may contain, based on management's current expectations and projections, which are intended to qualify for the safe harbor of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements include statements regarding the public offering and other statements identified by words such as \"believe,\" \"will,\" \"may,\" \"might,\" \"likely,\" \"expect,\" \"anticipates,\" \"intends,\" \"plans,\" \"seeks,\" \"estimates,\" \"believes,\" \"continues,\" \"projects\" and similar references to future periods, or by the inclusion of forecasts or projections. All are based on current expectations and projections of future events.\nThese reflect the current views, models, and assumptions of AGS, and are subject to various risks and uncertainties that cannot be predicted or qualified and could cause actual results in AGS's performance to differ materially from those expressed or implied by such forward looking statements. These risks and uncertainties include, but are not limited to, the ability of AGS to maintain strategic alliances, unit placements or installations, grow revenue, garner new market share, secure new licenses in new jurisdictions, successfully develop or place proprietary product, comply with regulations, have its games approved by relevant jurisdictions and other factors set forth under \"Risk Factors\" in the registration statement on Form S-1. All made herein are expressly qualified in their entirety by these cautionary statements and there can be no assurance that the actual results, events or developments referenced herein will occur or be realized. Readers are cautioned that all speak only to the facts and circumstances present as of the date of this press release. AGS expressly disclaims any obligation to update or revise any , whether as a result of new information, future events or otherwise.\nContact\nJulia Boguslawski, Chief Marketing Officer, AGS\no: 702-724-1125\ne: jboguslawski@PlayAGS.com\nAll ® notices signify marks registered in the United States.\nView original content with multimedia: http://www.prnewswire.com/news-releases/ags-prices-initial-public-offering-300588652.html\nSOURCE AGS", "external_links": ["http://www.prnewswire.com/news-releases/ags-prices-initial-public-offering-300588652.html"], "published": "2018-01-26T02:43:00.000+02:00", "crawled": "2018-01-26T03:39:22.000+02:00", "highlightTitle": ""}