{"organizations": [], "uuid": "9bcae70da65b6484b31a1f7bd4431349e8e1f825", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-turkey-play/istanbul-district-bans-play-about-dictator-by-erdogan-critic-idUSKBN1F825D", "country": "US", "domain_rank": 408, "title": "Istanbul district bans play about dictator by Erdogan critic", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T01:13:00.000+02:00", "replies_count": 0, "uuid": "9bcae70da65b6484b31a1f7bd4431349e8e1f825"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-turkey-play/istanbul-district-bans-play-about-dictator-by-erdogan-critic-idUSKBN1F825D", "ord_in_thread": 0, "title": "Istanbul district bans play about dictator by Erdogan critic", "locations": [], "entities": {"persons": [{"name": "erdogan", "sentiment": "negative"}, {"name": "tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "istanbul", "sentiment": "none"}, {"name": "istanbul", "sentiment": "none"}, {"name": "kadikoy", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISTANBUL (Reuters) - Istanbul authorities banned a planned performance on Friday of a play about a dictator, invoking powers granted under Turkey’s state of emergency imposed after a failed coup attempt against President Tayyip Erdogan.\n“Just a Dictator” is an extended monologue delivered by the ruler of an unspecified country about his rise to power. As the dictator speaks, chants of angry protesters can be heard approaching his residence, but do little to intimidate him.\nEarlier this week authorities started investigating theaters around the liberal district of Kadikoy, asking about the play, theater officials said.\nOn Friday morning police notified the theater that staging the play in any open or enclosed space within Kadikoy was banned, citing a law established under the state of emergency declared after the coup attempt in July 2016.\n“It has been evaluated that the play may affect public order and safety negatively, endanger security and well-being of the public and disturb the environment of public peace and trust,” said a copy of the notice posted on Twitter by the theater.\nIt said the play was banned emergency rule that means “any type of stage play (or) movie showing can be inspected and banned or stopped,” to ensure public safety.\nHuman rights groups and Turkey’s Western allies say Erdogan has used the failed 2016 coup as an excuse to quash dissent, and expressed concern about a referendum last year which granted Erdogan sweeping new presidential powers.\nThe government says the crackdown, and the executive presidency approved by referendum last April are needed to confront mounting threats to national security.\nThe play had previously been banned in three other provinces when it went on a tour, theater members said.\nAuthorities were not available to comment on Friday.\nWhile the only character on stage throughout the performance is the dictator, the criticism targets the audience for their inability to stand up to him.\nEven though Friday’s showing was canceled, the theater called on ticketholders and members of other theaters in Kadikoy to join them in solidarity at the scheduled performance time.\nThe only actor, Baris Atay, an outspoken critic of Erdogan’s policies, promised audiences they would eventually see the play.\n“We have no expectations from a justice system that has turned into a toy in their hands, so we’re not going to take this ban to court,” he tweeted. “But we promise you that ‘Just a Dictator’ will reach everyone. Very soon!”\nEditing by Robin Pomeroy\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T01:13:00.000+02:00", "crawled": "2018-01-20T02:59:24.009+02:00", "highlightTitle": ""}