{"organizations": [], "uuid": "f7b402732dc3760680f09dc1e344e8bb4109d443", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/03/03/102473298-463962436.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/big-oil-expected-to-dominate-another-solid-year-for-dealmaking.html", "country": "US", "domain_rank": 767, "title": "Big oil expected to dominate another solid year for dealmaking", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-26T18:19:00.000+02:00", "replies_count": 0, "uuid": "f7b402732dc3760680f09dc1e344e8bb4109d443"}, "author": "Tom Dichristopher", "url": "https://www.cnbc.com/2018/01/26/big-oil-expected-to-dominate-another-solid-year-for-dealmaking.html", "ord_in_thread": 0, "title": "Big oil expected to dominate another solid year for dealmaking", "locations": [], "entities": {"persons": [{"name": "daniel acker", "sentiment": "none"}, {"name": "wood mackenzie", "sentiment": "none"}], "locations": [{"name": "montana", "sentiment": "none"}, {"name": "sidney", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "exxon mobil", "sentiment": "none"}, {"name": "chevron", "sentiment": "none"}, {"name": "bp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Analysts expect big energy companies to play a major role in dealmaking during another solid year for oil and gas mergers and acquisitions.\nOil majors and large independent drillers need to shore up their asset portfolios after several years of underinvestment during a price slump, analysts say. Buying up acreage and acquiring rivals is a quick way to lock up future production as old wells dry up.\nGlobal dealmaking in the oil and gas exploration and production segment reached $143 billion last year, the highest level since 2014, according to energy research firm Wood Mackenzie.\nIn 2017, drillers mostly focused on consolidating their positions in a few core areas and selling off other assets. Many made purchases that allow them to string together strips of land, drill more efficiently and improve their cash flow.\n\"For the supermajors, the U.S. shales may be just the portfolio medicine needed to repair short-, mid- or long-term portfolio damage as a result of the last several years of severe exploration cutbacks.\" -Brian Lidsky, PLS managing director That strategy will help producers pay for the big, transformational deals they made in 2016, aimed at overhauling their business to contend with low prices, said Curt Karges, who leads consulting firm PwC's corporate finance team in Houston, in a year-end report.\nThat year, drillers packed into the Permian basin in western Texas, where the cost of producing oil is low but the price tag on land — and the companies who own it — has skyrocketed.\nAmol Joshi, senior analyst at ratings agency Moody's, expects 2018's deals to be more strategic after a year of mostly tactical acquisitions and sales.\nshow chapters Private equity is moving into areas where oil majors are exiting: EnQuest CEO      4:12 AM ET Thu, 25 Jan 2018 | 02:46 Integrated oil companies like Exxon Mobil and large independent drillers are prime candidates to make these deals, in part because they are typically able to hold assets for long periods and have flexibility when oil prices are relatively low, he says.\n\"Larger companies with strong balance sheets will seek efficiencies of scale in higher-return basins,\" Joshi said in a recent research note. \"Smaller, sometimes over-leveraged companies with decades of drilling inventory at the current pace can create value by combining with larger producers to accelerate development.\"\nWho's most likely to buy? That doesn't mean all the world's massive oil majors will throw their hat in the ring.\nWood Mackenzie thinks British oil giant BP and French peer Total are likely buyers. BP's project pipeline is looking thin, it says, while Total needs to speed up its plans to acquire low-cost, long-life assets and shift towards natural gas production by 2035.\nAnglo-Dutch driller Shell 's guidance on capital spending essentially rules out big deals, according to Wood Mackenzie — though it has been actively investing in alternative energy and retail electricity lately. The finances at Norway's Statoil leave it with less room to maneuver than its peers, and Italy's Eni appears focused on growing without M&A, the firm says.\n5 trends in oil and gas M&A - Wood Mackenzie \nOil majors will focus on deals that bolster their output over the long term. State-run oil companies, including Chinese and Russian firms, may do more deals. A focus on financial discipline over growth among American drillers will determine the pace of U.S. deals. Private equity firms will keep looking for opportunities, especially in the United States and Europe. The value of deals will hold up and they'll become more complex. Exxon Mobil and Chevron are Wood Mackenzie's wild cards.\nExxon has a big war chest of its own stock, allowing it fund a takeover with shares. But takeovers might not be necessary because it has a strong long-term production stream and an established base in the U.S. shale oil patch.\nChevron's cash flow is \"radically improved\" after two big Australian projects recently started up, but it's not yet clear whether new CEO Mike Wirth will give a green light to big deals.\n\"The Majors have restructured portfolios to thrive under a 'lower for longer' outlook,\" Wood Mackenzie said, noting that managing their current portfolios is the primary order of business.\n\"But with strong balance sheets and improved cash generation, larger acquisitions targeting long-term production growth are a distinct possibility.\"\nU.S. shale still in the mix Two big targets for majors are Brazil, which is holding lease auctions for offshore assets with low-cost production, and the U.S. shale fields, where drillers use advanced technology called hydraulic fracturing to break up rock formations and free oil and gas.\nPittsburgh-based gas driller EQT Corporation 's $8.2 billion purchase of fellow fracker Rice Energy was last year's biggest U.S. exploration and production deal. Exxon's $5.6 billion acquisition of Permian basin companies owned by the Bass family ranked second.\nBrian Lidsky, managing director at Houston-based oil and gas advisory firm PLS, says big independents and the oil majors could make substantial purchases in 2018 to consolidate their position in the shale patch or enter hot areas this year.\n\"For the supermajors, the U.S. shales may be just the portfolio medicine needed to repair short-, mid- or long-term portfolio damage as a result of the last several years of severe exploration cutbacks,\" Brian Lidsky, managing director at PLS, said in a briefing on 2017 dealmaking.\nFive wild cards to watch in oil and gas M&A in 2018 - PwC \nU.S. tax reform impacts Repatriation of foreign cash Trump's biggest-ever U.S. offshore oil and gas auction Oil and natural gas prices Rising interest rates and borrowing costs A few factors could create headwinds for dealmaking.\nAnalysts stress that many U.S. drillers have made promises to shareholders to focus on financial discipline rather than production growth, and may only do deals that boost efficiency and cut costs.\nBut Wood Mackenzie speculates that investors might not remain so stubborn with U.S. crude prices at three-year highs above $60 and a corporate tax cut windfall on the horizon.\nHowever, the impact of U.S. corporate tax cuts on energy M&A is uncertain, according to PwC. While the lower tax rate and other provisions could free up cash for some companies, the firm notes that borrowing costs could rise for others due to changes in rules on deductions.", "external_links": [], "published": "2018-01-26T18:19:00.000+02:00", "crawled": "2018-01-26T18:19:49.005+02:00", "highlightTitle": ""}