{"organizations": [], "uuid": "50615e6ad0093132a109bd14c71cdf81018c77a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/26/104428659-GettyImages-673356150.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/17/immigration-deal-distant-as-leaders-try-to-avert-shutdown.html", "country": "US", "domain_rank": 767, "title": "Immigration deal distant as leaders try to avert shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.696, "site_type": "news", "published": "2018-01-17T07:33:00.000+02:00", "replies_count": 0, "uuid": "50615e6ad0093132a109bd14c71cdf81018c77a2"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/17/immigration-deal-distant-as-leaders-try-to-avert-shutdown.html", "ord_in_thread": 0, "title": "Immigration deal distant as leaders try to avert shutdown", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "mark meadows", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "mins ago shares getty images", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "house republican", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "house freedom caucus", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Disgruntled conservatives threatened late Tuesday to scuttle Republican leaders' plans to prevent a weekend government shutdown, saying GOP leaders now lack the votes to push their proposal through the House. The setback came as a deal between President Donald Trump and Congress to protect young immigrants from deportation also remained distant.\nThe intransigence by the House Freedom Caucus came as Republican leaders raced against a Friday deadline for pushing a short-term spending bill through Congress. If they fail, federal agencies would start shutting their doors over the weekend — an election-year debacle that GOP leaders and many Democrats are eager to avoid for fear of alienating voters.\nThe leader of the hard-right Freedom Caucus emerged from a Tuesday night meeting to say its members — and other GOP lawmakers as well — want a short-term bill keeping federal agencies open to contain added money for the military.\n\"There's not enough support to pass it with GOP-only votes in the House,\" the group's leader, Rep. Mark Meadows, R-N.C., told reporters. He said he planned to discuss their concerns with Republican leaders.\nThe GOP focus on keeping government open comes as it's become certain there's no time to cut a deal by Friday on protecting young immigrants.\nThose talks were soured by Trump's incendiary remarks about \"shithole\" countries in Africa last week. Democratic leaders said they would not promise to vote to keep the government open past Friday without a plan to preserve a program that protects the young immigrants known as \"Dreamers.\"\n\"We don't want to shut down the government. ... We want to keep the government open,\" Democratic Whip Steny Hoyer, D-Md., told reporters. \"But we're not going to be held hostage to do things that we think are going to be contrary to the best interests of the American people.\"\nHouse Republican leaders tried to win over wary conservatives with a promise to repeal unpopular taxes as part of the bill preventing a shutdown.\nThey sweetened the plan with a two-year delay on implementation of unpopular taxes on medical devices and generous employer-subsidized health care plans. The taxes, also unpopular with many Democrats, are part of former President Barack Obama's marquee health law.\nThe temporary funding bill would also include a long-delayed, six-year renewal of a popular health insurance program for children of low-income families. It would fund the government through Feb. 16.\nHouse Speaker Paul Ryan, R-Wis., unveiled the plan at a Tuesday evening GOP meeting. Lawmakers and aides initially said it was received well, raising hopes that a potential shutdown would be sidestepped with relative ease. A Ryan spokeswoman declined later to comment on the Freedom Caucus' opposition.\nMany Democrats said they're still unlikely to support the measure without an agreement on immigration. The prospects for such a deal were complicated as Democrats appeared to see scant reason to bargain with a president many in their party view as holding racist views.\n\"There's no trust there,\" said Rep. Raul Grijalva, D-Ariz.\nNegotiations on immigration were to resume Wednesday but Marc Short, a top White House aide, said an agreement was very unlikely to come this week. \"We're optimistic that we'll get a deal,\" Short said. \"I think this week would be fairly Herculean.\"\nEven if they succeed in the House, Republicans would still need at least nine Democratic votes to push a spending package through the Senate, which the GOP controls 51-49. Democrats seeking leverage are forcing that bill to require 60 votes for passage.\nWhen the Senate approved a similar short-term spending bill in December, 17 Democrats plus Maine independent Angus King voted to keep the government open. Seven of those Democrats face re-election in November in Trump-won states — including West Virginia, North Dakota and Montana, which have small numbers of minority voters.\nSen. Joe Manchin, a Democrat from West Virginia, said Tuesday he'll vote for a short-term spending bill without a plan to assist the immigrants facing possible deportation. Other red- and swing-state Democrats did not commit.\n\"I think everyone has the empathy and compassion to want to help these young people who are stranded and we're trying to find that, but shutting down the government isn't going to help them,\" Manchin said.\nDemocrats voting against that December bill included some senators — such as Cory Booker of New Jersey and Kamala Harris of California — who might seek the presidency in 2020 and would love support from their party's liberal voters.\nOn the left, liberal groups are ramping up pressure on Democrats to resist any spending plan. Groups like MoveOn, United We Dream and CREDO shifted their focus from Republicans to Democrats earlier in the month, threatening primary challenges and public ridicule for Democrats unwilling to risk a government shutdown to save the program for young immigrants.\nMeanwhile, the bipartisan group of senators continued work to build support for a plan to protect the \"Dreamers\" and toughen border security, including funds to start building Trump's long-promised border wall.\nTrump ended the Deferred Action for Childhood Arrivals, or DACA, late last year but gave Congress until March 5 to pass legislation extending the initiative created by President Barack Obama. It has protected around 800,000 young immigrants from deportation.\nSenate Majority Leader Mitch McConnell sought to highlight the later deadline, suggesting there was more time to work out a deal. A shutdown now would be \"a manufactured crisis,\" he argued.", "external_links": [], "published": "2018-01-17T07:33:00.000+02:00", "crawled": "2018-01-17T07:38:56.016+02:00", "highlightTitle": ""}