{"organizations": [], "uuid": "109f344cc530f8e678358d505adb70b9abac2a21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224161229&w=1200&r=LYNXMPEE0L19C", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-abercrombie-outlook/abercrombie-fitch-raises-fourth-quarter-outlook-exec-chairman-to-step-down-idUSKBN1FB1RJ", "country": "US", "domain_rank": 408, "title": "Abercrombie & Fitch raises Q4 outlook; exec chairman to step down", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T15:39:00.000+02:00", "replies_count": 0, "uuid": "109f344cc530f8e678358d505adb70b9abac2a21"}, "author": "", "url": "https://www.reuters.com/article/us-abercrombie-outlook/abercrombie-fitch-raises-fourth-quarter-outlook-exec-chairman-to-step-down-idUSKBN1FB1RJ", "ord_in_thread": 0, "title": "Abercrombie & Fitch raises Q4 outlook; exec chairman to step down", "locations": [], "entities": {"persons": [{"name": "arthur martinez", "sentiment": "none"}, {"name": "sangameswaran", "sentiment": "none"}, {"name": "terry burman", "sentiment": "none"}, {"name": "supriya kurane", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "abercrombie & fitch", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Abercrombie & Fitch ( ANF.N ) raised its fourth-quarter sales forecast on Monday following a strong holiday season, driving its shares to a more than one-and-a-half-year high.\nAbercrombie shares rose as much as 8.8 percent to $21.68 in early trading, its highest since August 2016, after the teen apparel retailer raised its comparable-sales growth outlook for the holiday quarter to the high-single digit percentage range, from its prior outlook of low-single digits.\nAbercrombie is the latest in a string of brick-and-mortar retailers to report upbeat holiday sales buoyed by rising consumer confidence amid a tight labor market and strong stock market gains.\nAbercrombie also said Executive Chairman Arthur Martinez would step down on Feb. 3 and would be replaced by lead director Terry Burman, who will then assume the role of non-executive chairman.\nU.S. holiday spending across online and physical stores rose 5.5 percent — the most in 12 years — to $691.9 billion, the National Retail Federation said earlier this month.\n“We are pleased by our performance across all brands and channels during the holiday season, with continued strength at Hollister, and the Abercrombie brand on track to deliver positive comparable sales for the quarter,” Chief Executive Fran Horowitz said in a statement.\nIf Abercrombie meets its forecast, it will be its largest quarterly gain in at least 6-and-a-half years since it posted a 9 percent gain in the second quarter of 2011, Retail Metrics founder Ken Perkins told Reuters.\nHe, however, added that the same-store sales growth may have come at the expense of margins.\nAbercrombie on Monday said that its gross margins for the quarter would be down 100 basis points compared with last year’s fourth-quarter margins of 59.3 percent.\nThe company also said it expects fourth-quarter net sales growth to be in the low-teens percentage range, from its prior outlook of up mid- to high-single digits.\n“Like peer American Eagle Outfitters, we expect some fashion green shoots as well as an improved supply and demand backdrop following peer store closures to have created a better demand setup for the remaining players,” RBC analyst Brian Tunick said.\nAbercrombie also said it expects to take a significant income tax charge in the fourth quarter, mainly related to the one-time deemed repatriation tax on accumulated foreign earnings, following the recent U.S. tax overhaul.\nThe apparel retailer also said it would conduct its investor day later this year, its first in five years.\nReporting by Sangameswaran S and Vibhuti Sharma in Bengaluru; Editing by Supriya Kurane\n ", "external_links": [], "published": "2018-01-22T15:39:00.000+02:00", "crawled": "2018-01-22T16:02:38.014+02:00", "highlightTitle": ""}