{"organizations": [], "uuid": "a6904448396403b3519f8647cb0630fe42e3a4aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223155077&w=1200&r=LYNXMPEE0H22G", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-newzealand-politcs-ardern/new-zealand-prime-minister-jacinda-ardern-announces-she-is-pregnant-with-first-child-idUKKBN1F736J", "country": "US", "domain_rank": 408, "title": "New Zealand Prime Minister Jacinda Ardern pregnant with first child", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T06:19:00.000+02:00", "replies_count": 0, "uuid": "a6904448396403b3519f8647cb0630fe42e3a4aa"}, "author": "", "url": "https://uk.reuters.com/article/uk-newzealand-politcs-ardern/new-zealand-prime-minister-jacinda-ardern-announces-she-is-pregnant-with-first-child-idUKKBN1F736J", "ord_in_thread": 0, "title": "New Zealand Prime Minister Jacinda Ardern pregnant with first child", "locations": [], "entities": {"persons": [{"name": "jacinda ardern pregn", "sentiment": "negative"}, {"name": "jacinda ardern", "sentiment": "negative"}, {"name": "clarke gayford", "sentiment": "none"}, {"name": "winston peters", "sentiment": "none"}, {"name": "ardern", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "wellington", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}], "organizations": [{"name": "charlotte greenfield", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 10:14 PM / Updated 5 minutes ago New Zealand Prime Minister Jacinda Ardern pregnant with first child Charlotte Greenfield 4 Min Read \nWELLINGTON (Reuters) - New Zealand Prime Minister Jacinda Ardern said on Friday she was pregnant with her first child, prompting an outpouring of support from women’s rights groups and labour activists as she declared “I’ll be a prime minister and a mum”. \nArdern said she planned to work until the end of her pregnancy in June and then take six-weeks leave, during which time Deputy Prime Minister Winston Peters would run the country. \nSpeaking to reporters outside her Auckland home, Ardern said her partner Clarke Gayford would care for the “surprise” addition full-time and that the whole family would travel together when necessary. \n“I am not the first woman to work and have a baby. I know these are special circumstances but there are many women who have done it well before I have,” she said. \nThe popular 37-year-old politician’s pregnancy is one of the very few examples of an elected leader holding office while pregnant and the first in New Zealand’s history. Pakistan’s Benazir Bhutto gave birth while she was prime minister in 1990. \nArdern, who came to power through a coalition deal after a closely fought election last year, has experienced a meteoric rise to power as New Zealand’s youngest prime minister in more than a century, and its third female leader. \nArdern’s rise to power has generated intense interest in her personal life and drew comparisons with other youthful leaders such as France’s Emmanuel Macron and Canada’s Justin Trudeau. \nSIGN OF PROGRESS IN WOMEN‘S RIGHTS \nArdern was quick to assure the public that she would only take six weeks off, during which time she would still be contactable, so that the country would run as usual. New Zealand Prime Minister Jacinda Ardern smiles as she answers a question during a media conference in Sydney, Australia, November 5, 2017. REUTERS/David Gray \nThe short period contrasts with her party’s parental leave policies, with the Labour-led coalition expanding paid parental leave from 18 to 22 weeks in one of its first legislative changes. That is set to rise again to 26 weeks in 2020. \nArdern acknowledged that she was “lucky” that her partner, a well-known television fishing show presenter, could take time off to travel with her while he cared for the baby full-time. \nShe had no plans to stop work until June and would fly to London in April to attend a Commonwealth leader’s meeting. \nAdvocacy groups and politicians from across the political spectrum were quick to offer support. \n“It’s really inspiring...having our prime minister lead by example is a great sign of how far we’ve come in women’s industrial rights in New Zealand,” said Council of Trade Unions President Richard Wagstaff in an emailed statement to Reuters. \nNew Zealand has long held a progressive reputation, having been the first country to give women the right to vote in 1893. \n“It’s amazing timing...125 years later we have a prime minister who’s going to give birth in office,” said Minister for Women Julie Anne Genter. \nArdern revealed on Friday that she had unexpectedly found out she was pregnant on Oct. 13, just six days before she was propelled into the country’s top job when New Zealand First Party leader Peters announced he was siding with Labour in post-election negotiations. \nWhen asked by a reporter how she had managed putting together a government while suffering from morning sickness, she replied, “it’s just what ladies do”. Reporting by Charlotte Greenfield in WELLINGTON; Editing by Clive McKeef and Michael Perry", "external_links": [], "published": "2018-01-19T06:19:00.000+02:00", "crawled": "2018-01-19T06:44:56.005+02:00", "highlightTitle": ""}