{"organizations": [], "uuid": "63598da4a866ef9755153c68a4eadb0d09828a3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218966664&w=1200&r=LYNXMPEE0205K", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/global-precious/gold-hits-3-1-2-month-highs-before-dipping-on-dollar-recovery-idINKBN1ES08F", "country": "US", "domain_rank": 408, "title": "Gold hits 3-1/2-month highs before dipping on dollar recovery", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T07:17:00.000+02:00", "replies_count": 0, "uuid": "63598da4a866ef9755153c68a4eadb0d09828a3b"}, "author": "", "url": "https://in.reuters.com/article/global-precious/gold-hits-3-1-2-month-highs-before-dipping-on-dollar-recovery-idINKBN1ES08F", "ord_in_thread": 0, "title": "Gold hits 3-1/2-month highs before dipping on dollar recovery", "locations": [], "entities": {"persons": [{"name": "oegussa", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}], "organizations": [{"name": "sethuraman n r", "sentiment": "none"}, {"name": "rsi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Gold eased from an earlier 3-1/2 month high on Wednesday and was on track for its first day of losses in nearly three weeks as a firmer dollar pressured assets priced in the U.S. currency.\nGold jewellery is pictured at the Austrian Gold and Silver Separating Plant 'Oegussa' in Vienna, Austria, December 15, 2017. REUTERS/Leonhard Foeger/Files The dollar’s late December retreat had driven gold sharply higher, leading to fears that the metal was becoming overbought.\nSpot gold was down 0.1 percent at $1,316.93 an ounce at 1430 GMT on Wednesday, off an earlier peak of $1,321.33.\n“It’s still the dollar that is still very much in the driving seat for gold,” said Julius Baer analyst Carsten Menke. “We’re bearish on the euro versus the U.S. dollar, so if that materialises, and this close relationship holds between gold and the dollar, it should move towards $1,225 or so.”\nThe dollar rose 0.3 percent against the euro in early trade, though it remained near a four-month low after declining nearly 3 percent in the past three weeks.\nInvestors are awaiting manufacturing data and minutes of a December U.S. Federal Reserve meeting due later in the day, which will be closely watched for clues on the outlook for U.S. monetary policy.\nGold, which as a non-yielding asset is highly sensitive to rising interest rates, fell in the run-up to the third U.S. interest rate rise of 2017 in December but quickly recovered, climbing 5 percent from its mid-month low to the year’s close.\nSpot gold’s 14-day relative strength index (RSI) touched 75 on Tuesday, it highest since September 2017. An RSI above 70 indicates a commodity is overbought and could herald a price correction, technical analysts say.\n“Relative strength index shows the metal at overbought levels, which may lead to short-term selling,” ScotiaMocatta analysts said in a research note.\nU.S. gold futures for February delivery were up $2.80 an ounce at $1,318.90.\nAmong other precious metals, palladium was down 0.5 percent at $1,086.80 after hitting a record high on Tuesday of $1,096.50.\nThe metal soared 56 percent in 2017 on fears that strong demand from carmakers for use in catalytic converters, chiefly in gasoline-powered vehicles, would tighten the market further after years of deficit.\n“You have a market that is on the one hand in deficit, and on the other very well managed by some of the bigger producers, who are unwilling to ship additional units into the market,” Bank of America-Merrill Lynch analyst Michael Widmer said.\n“Unless you start to see a meaningful change in dynamics on the supply and demand side, I can see prices either well-supported or even higher from here.”\nSpot silver was down 0.2 percent at $17.15 an ounce after touching a six-week high of $17.21, while platinum was 1.1 percent higher at $953.50.\nAdditional reporting by Nallur Sethuraman in Bengaluru; Editing by David Goodman and Adrian Croft\n ", "external_links": [], "published": "2018-01-03T07:17:00.000+02:00", "crawled": "2018-01-03T07:39:54.036+02:00", "highlightTitle": ""}