{"organizations": [], "uuid": "887ee54bcdca41a93a11d96d2e1a8fb2e2b0b991", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-brooks-tingle-named-president-and-ceo-john-hancock-insurance.html", "country": "US", "domain_rank": 767, "title": "Brooks Tingle named President and CEO John Hancock Insurance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T23:40:00.000+02:00", "replies_count": 0, "uuid": "887ee54bcdca41a93a11d96d2e1a8fb2e2b0b991"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-brooks-tingle-named-president-and-ceo-john-hancock-insurance.html", "ord_in_thread": 0, "title": "Brooks Tingle named President and CEO John Hancock Insurance", "locations": [], "entities": {"persons": [{"name": "john hancock", "sentiment": "negative"}, {"name": "john hancock insurance", "sentiment": "negative"}, {"name": "john hancock vitality", "sentiment": "none"}, {"name": "linda levyne", "sentiment": "none"}, {"name": "marianne harrison", "sentiment": "none"}, {"name": "brooks", "sentiment": "none"}, {"name": "harrison", "sentiment": "none"}, {"name": "levyne", "sentiment": "none"}, {"name": "tingle", "sentiment": "none"}, {"name": "linda", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "brooks tingle", "sentiment": "negative"}, {"name": "john hancock insurance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 29, 2018 /PRNewswire/ -- John Hancock today announced two key leadership appointments, naming Brooks Tingle president and CEO of John Hancock Insurance and Linda Levyne senior vice president, head of Sales and Distribution also for John Hancock Insurance. Mr. Tingle and Ms. Levyne, who have served in these roles on an interim basis since last summer, assume them permanently effective immediately. Mr. Tingle reports to Marianne Harrison, president and CEO, John Hancock; Ms. Levyne reports to Mr. Tingle.\n\"As John Hancock continues on its journey of reinventing the life insurance experience for U.S. consumers, Brooks and Linda bring the vision, depth of experience, and proven execution strength that make them ideally suited to lead our company's transformation of the life insurance industry,\" said Ms. Harrison.\n\"With a sharp focus on customer experience and engagement, Brooks has been integral to the success of John Hancock Vitality, the only life insurance in the U.S. that is integrated with a technology-based wellness program, and ExpressTrack, a new underwriting approach that significantly simplifies the life insurance purchasing process.\n\"Linda's extensive experience, including as head of sales for John Hancock Vitality since the groundbreaking product was first introduced in 2015, provides a unique perspective that will prove valuable in continuing John Hancock's market leadership,\" said Ms. Harrison.\nSince joining John Hancock in 1987, Mr. Tingle has held diverse roles in the company's life, annuity and long-term care insurance businesses.Most recently, as senior vice president, Marketing and Strategy for John Hancock Insurance, he had overall management responsibility for John Hancock's insurance marketing activities as well as the development and implementation of John Hancock's market expansion strategy. Previously, he served as senior vice president and COO for John Hancock Life Insurance Company and was responsible for all operations including new business, underwriting, claims, information technology, policy administration, customer service and reinsurance administration.\nMs. Levyne most recently served as vice president, National Accounts and Vitality Sales and Distribution for John Hancock Insurance. In this role, she led the National Accounts team that supports all of John Hancock's distribution partners nationwide and the John Hancock Vitality sales team across all accounts and relationships. Previously, she served as vice president, Regional Sales Management, responsible for leading John Hancock Insurance's regional directors nationwide. Before joining John Hancock in 2011, Ms. Levyne spent over twenty years in various management and wholesaling positions in the life insurance industry. She holds Chartered Life Underwriter and Chartered Financial Consultant designations from the American College.\nAbout John Hancock Financial and Manulife\nJohn Hancock Financial is a division of Manulife, a leading Canada-based financial services group with principal operations in Asia, Canada, and the United States. Operating as Manulife in Canada and Asia, and primarily as John Hancock in the United States, our group of companies offers clients a diverse range of financial protection products and wealth management services through its extensive network of employees, agents, and distribution partners. Assets under management and administration by Manulife and its subsidiaries were CAD$966 billion (US$862 billion) as of September 30, 2016. Manulife Financial Corporation trades as MFC on the TSX, NYSE, and PSE, and under 945 on the SEHK. Manulife can be found at manulife.com .\nThe John Hancock unit, through its insurance companies, comprises one of the largest life insurers in the United States. John Hancock offers and administers a broad range of financial products, including life insurance , annuities , investments, 401(k) plans , college savings , and other forms of business insurance. Additional information about John Hancock may be found at johnhancock.com .\nInsurance products are issued by: John Hancock Life Insurance Company (U.S.A.), Boston, MA 02210 (not licensed in New York) and John Hancock Life Insurance Company of New York, Valhalla, NY 10595.\nPR-2018-08 MLINY012918156\nView original content: http://www.prnewswire.com/news-releases/brooks-tingle-named-president-and-ceo-john-hancock-insurance-300589739.html\nSOURCE John Hancock Insurance", "external_links": ["http://www.jhinvestments.com/", "http://www.johnhancock.com/", "http://www.johnhancock.com/products/college-savings.html", "https://www.jhannuities.com/Marketing/default.aspx", "http://www.johnhancock.com/products/401k.html", "http://www.prnewswire.com/news-releases/brooks-tingle-named-president-and-ceo-john-hancock-insurance-300589739.html", "http://www.johnhancock.com/products/life-insurance.html", "http://www.manulife.com/"], "published": "2018-01-29T23:40:00.000+02:00", "crawled": "2018-01-30T00:25:21.011+02:00", "highlightTitle": ""}