{"organizations": [], "uuid": "e55e7bb233761644f4d22be3ecd8474b5019d57c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-tunisia-protests/protesters-demanding-jobs-clash-with-police-in-tunisian-town-idUSKBN1FA15D", "country": "US", "domain_rank": 408, "title": "Protesters demanding jobs clash with police in Tunisian town", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T23:40:00.000+02:00", "replies_count": 0, "uuid": "e55e7bb233761644f4d22be3ecd8474b5019d57c"}, "author": "", "url": "https://www.reuters.com/article/us-tunisia-protests/protesters-demanding-jobs-clash-with-police-in-tunisian-town-idUSKBN1FA15D", "ord_in_thread": 0, "title": "Protesters demanding jobs clash with police in Tunisian town", "locations": [], "entities": {"persons": [{"name": "tarek amara", "sentiment": "none"}, {"name": "issam chahbani", "sentiment": "none"}, {"name": "gafsa", "sentiment": "none"}], "locations": [{"name": "tunis", "sentiment": "none"}, {"name": "metlaoui", "sentiment": "none"}, {"name": "mdihla", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "cpg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TUNIS (Reuters) - Tunisia police fired tear gas to disperse demonstrators demanding jobs in the southern town of Metlaoui on Sunday, witnesses said, days after violent protests across the country against price hikes subsided.\nThe protesters closed roads and burned tires to demand jobs after the state-owned phosphate company Gafsa (CPG) released the results of a recruitment campaign.\n“Police are pursuing protesters and firing gas bombs, as youths closed the streets in Metlaoui,” Issam Chahbani, a resident, told Reuters.\n“There is feeling of injustice and marginalization here ... We’re only asking for jobs and development.”\nIn Mdihla town in the same region, protesters clashed with police to press for jobs in CPG, witnesses told Reuters.\nViolent protests erupted this month in several towns and cities across Tunisia following tax and price hikes imposed on Jan. 1 by a government seeking to reduce a budget deficit to meet an agreement with its international donors. One demonstrator was killed during the protests.\nThe unrest subsided last week after the government responded by pledging extra aid for poor families and those in need.\nTunisian unemployment is running at 15.6 percent, rising to about 30 percent among the young.\nOnce one of the world’s largest producers of phosphates, Tunisia saw its market share fall after a 2011 uprising against then president Zine El-Abidine Ben Ali. Since then protests and strikes have steadily cut into production and caused billions of dollars in losses. The CPG is the biggest employer in Gafsa, one of Tunisia’s poorest areas.\nTunisia has been hailed as the only democratic success of the Arab Spring: the one Arab country to topple a long-serving leader in that year’s uprisings without triggering widespread violence or civil war.\nBut Tunisia has had nine governments since Ben Ali’s overthrow, none of which have been able to resolve deep-rooted economic problems. The economy has worsened since the vital tourism sector was nearly wiped out by a wave of deadly militant attacks in 2015, and has yet to recover despite improved security.\nReporting By Tarek Amara, Editing by William Maclean\n ", "external_links": [], "published": "2018-01-21T23:40:00.000+02:00", "crawled": "2018-01-21T23:55:37.001+02:00", "highlightTitle": ""}