{"organizations": [], "uuid": "d0231197fcf26ed0a57cb919d9a04364d644614a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 64, "shares": 64, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226269314&w=1200&r=LYNXMPEE0S0PT", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-northkorea-malaysia-kim-court/kim-jong-nam-met-u-s-national-on-malaysian-island-before-he-was-killed-police-say-idUSKBN1FI16Y", "country": "US", "domain_rank": 408, "title": "Kim Jong Nam met U.S. national on Malaysian island before he was killed, police say", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T13:06:00.000+02:00", "replies_count": 0, "uuid": "d0231197fcf26ed0a57cb919d9a04364d644614a"}, "author": "", "url": "https://www.reuters.com/article/us-northkorea-malaysia-kim-court/kim-jong-nam-met-u-s-national-on-malaysian-island-before-he-was-killed-police-say-idUSKBN1FI16Y", "ord_in_thread": 0, "title": "Kim Jong Nam met U.S. national on Malaysian island before he was killed, police say", "locations": [], "entities": {"persons": [{"name": "kim jong nam", "sentiment": "negative"}, {"name": "azirul nizam", "sentiment": "none"}, {"name": "siti aisyah", "sentiment": "none"}, {"name": "doan thi huong", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "kuala lumpur airport", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "langkawi island", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Reuters) - Kim Jong Nam, the estranged half-brother of North Korean’s leader, met a United States national at a Malaysian island hotel days before his sensational killing last February, a police official told a court hearing on Monday.\nTwo women, Indonesian Siti Aisyah and Doan Thi Huong, a Vietnamese, have been charged with four North Korean fugitives for the murder. Prosecutors say the women smeared his face with VX, a lethal chemical poison at Kuala Lumpur airport on Feb. 13.\nDefence lawyers say the women thought they were playing a prank for a reality show. They face the death penalty, if convicted.\nKim arrived in Malaysia on Feb. 6 before traveling two days later to Langkawi Island, a tourist spot off Malaysia’s west coast, the lead police investigator in the case, Wan Azirul Nizam, told the court.\nBut he was unable to confirm numerous details, saying he could not recall the name of the hotel where Kim stayed and did not know the name of the American man seen meeting with the North Korean on Feb. 9.\n“Until today, the identity of the person being referred to could not be obtained,” he said.\nSiti Aisyah’s lawyer, Gooi Soon Seng, had questioned Wan Azirul on a May 2017 report in the Japanese daily, Asahi Shimbun, that Kim had met a U.S. intelligence agent in Langkawi.\nThe report said Kim was believed to have passed a large amount of data to the agent, citing a Malaysian forensics analysis of a laptop found in Kim’s backpack after his death.\nWan Azirul confirmed the laptop was sent to a forensics laboratory in the Malaysian capital of Kuala Lumpur, which found the computer had last been used on Feb. 9.\nThe forensics report, provided to reporters at the hearing, also showed some data had been accessed from a USB pendrive inserted into the laptop on the same day.\nBut Wan Azirul said he was unsure whether Kim had passed on data in Langkawi or if the meeting was linked to the airport murder.\nGooi accused the police witness of being evasive.\n“Come on, you have a total lapse in memory?” he told Wan Azirul. “You say you investigated but you’ve forgotten everything? Which hotel? What was this investigation for, if it wasn’t related to this case?”\nThe trial resumes on Tuesday.\nReporting by Rozanna Latiff; Editing by Clarence Fernandez\n ", "external_links": [], "published": "2018-01-29T13:06:00.000+02:00", "crawled": "2018-01-29T13:17:02.002+02:00", "highlightTitle": ""}