{"organizations": [], "uuid": "6947cc760a22a332bab7fea3a17576853aae2d1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-riot-blockchains-tesspay-enters-definitive-agreement-for-transaction-with-publicly-traded-cresval-capital-corp.html", "country": "US", "domain_rank": 767, "title": "Riot Blockchain's TessPay Enters Definitive Agreement for Transaction with Publicly Traded Cresval Capital Corp.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.033, "site_type": "news", "published": "2018-01-17T16:00:00.000+02:00", "replies_count": 0, "uuid": "6947cc760a22a332bab7fea3a17576853aae2d1c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-riot-blockchains-tesspay-enters-definitive-agreement-for-transaction-with-publicly-traded-cresval-capital-corp.html", "ord_in_thread": 0, "title": "Riot Blockchain's TessPay Enters Definitive Agreement for Transaction with Publicly Traded Cresval Capital Corp.", "locations": [], "entities": {"persons": [{"name": "tess", "sentiment": "none"}, {"name": "cresval", "sentiment": "none"}], "locations": [{"name": "castle rock", "sentiment": "none"}, {"name": "colo.", "sentiment": "none"}], "organizations": [{"name": "publicly traded cresval capital corp", "sentiment": "negative"}, {"name": "inc.", "sentiment": "negative"}, {"name": "cresval capital corp.", "sentiment": "none"}, {"name": "tesspay inc.", "sentiment": "none"}, {"name": "tess inc.", "sentiment": "none"}, {"name": "tesspay", "sentiment": "none"}, {"name": "tsx venture exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CASTLE ROCK, Colo., Jan 17, 2018 /PRNewswire/ -- Riot Blockchain, Inc. (Nasdaq: RIOT) (the \"Company\") today announced that its majority owned Tess Inc. (\"Tess\") has entered into a definitive agreement (the \"Agreement\") to complete a transaction with Cresval Capital Corp. (\"Cresval\"). TessPay is a blockchain company developing a supply chain payment platform for businesses to attempt to guarantee payment on time and in full. After the closing of the anticipated transaction and subject to the terms and conditions of the Agreement, TessPay expects its shares to be publicly traded on the TSX Venture Exchange (the \"TSXV\") and change its name to \"TessPay Inc.\" (\"TessPay\").\nThe Agreement provides that each share of TessPay will be exchanged for common shares of TessPay on the basis of 15.36 TessPay shares for every one (1) Tess share. Cresval will be issued 8,400,000 TessPay shares, which will be distributed pro rata to shareholders of Cresval as part of the transaction. Riot Blockchain will receive 41,600,000 shares resulting from its 52% ownership of TessPay. One of the conditions of the proposed transaction includes Tess completing a private placement financing of CAD $3,500,000 in the form of an unsecured convertible note at CAD $0.10 per share into TessPay.\nThe parties expect that the proposed transaction can be completed by the 2 nd quarter of 2018. No assurance can be given that the proposed transaction will be consummated, or that the combined company will be able to obtain adequate funds needed to fund its business plan.\nThe merger would be the first of Riot Blockchain's investments to become a stand-alone public company.\nThe blockchain is a decentralized and encrypted ledger that offers a secure, efficient, verifiable and permanent way of storing records and other information without the need for intermediaries. These protocols are the backbone of numerous digital currencies, including Bitcoin, Ethereum and Litecoin. Blockchain protocols have a wide range of use, including processing transactions, accounting, verification and proof of ownership across a far-reaching spectrum of applications.\nAbout Riot Blockchain\nRiot Blockchain, Inc. is leveraging its expertise and a network of professional advisors to build and support blockchain technologies. It is establishing an Advisory Board with technical experience intending to become a leading authority and supporter of blockchain, while providing investment exposure to the rapidly growing Bitcoin and blockchain ecosystems. For more information, visit http://www.RiotBlockchain.com/ .\nAbout TessPay\nTessPay is a blockchain company developing a payments ecosystem for component and sub-component supply chain settlements (payments). TessPay believes a transition will occur from the present state wherein payments down a supply chain are essentially manual (triggered by a manager or trusted party) to a blockchain protocol that mandates simultaneous payment of all component and sub-component suppliers when the primary party makes a payment into the chain.\nTessPay intends to develop and utilize TessPay Smart Contracts, wherein a payment from the primary party in the chain would be automatically apportioned to all other eligible parties in the chain concomitant with payment by the primary party. The creditworthy financial condition of the primary party would facilitate lender involvement in the supply chain under the security afforded by the TessPay Smart Contract. The first TessPay smart contracts payment system will be tailored to the needs of the international telecommunications industry in respect of cross border telephone calls. For more information, visit http://tesspay.io/ .\nSafe Harbor\nThe information provided in this press release may include forward-looking statements relating to future events or the future financial performance of the Company. Because such statements are subject to risks and uncertainties, actual results may differ materially from those expressed or implied by such forward-looking statements. Words such as \"anticipates,\" \"plans,\" \"expects,\" \"intends,\" \"will,\" \"potential,\" \"hope\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements are based upon current expectations of the Company and involve assumptions that may never materialize or may prove to be incorrect. Actual results and the timing of events could differ materially from those anticipated in such forward-looking statements as a result of various risks and uncertainties. Detailed information regarding factors that may cause actual results to differ materially from the results expressed or implied by statements in this press release relating to the Company may be found in the Company's periodic filings with the Securities and Exchange Commission, including the factors described in the sections entitled \"Risk Factors\", copies of which may be obtained from the SEC's website at www.sec.gov . The parties do not undertake any obligation to update forward-looking statements contained in this press release.\nMedia Contacts\nKaren Chase or Travis Kruse\nRusso Partners, LLC\n(646) 942-5627\n(212) 845-4272\nkaren.chase@russopartnersllc.com\ntravis.kruse@russopartnersllc.com\nInvestor Contact\nIR@RiotBlockchain.com\nView original content: http://www.prnewswire.com/news-releases/riot-blockchains-tesspay-enters-definitive-agreement-for-transaction-with-publicly-traded-cresval-capital-corp-300583740.html\nSOURCE Riot Blockchain, Inc.", "external_links": ["http://www.riotblockchain.com/", "http://www.prnewswire.com/news-releases/riot-blockchains-tesspay-enters-definitive-agreement-for-transaction-with-publicly-traded-cresval-capital-corp-300583740.html", "http://tesspay.io/", "http://www.RiotBlockchain.com/"], "published": "2018-01-17T16:00:00.000+02:00", "crawled": "2018-01-17T16:47:09.000+02:00", "highlightTitle": ""}