{"organizations": [], "uuid": "19170a5c69ec3fd83454a7cb36ff8d8f124a3f82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-rise-as-end-to-us-government-shutdown-buoys-wall-st-dollar-steady-idUSL4N1PI01L", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Asia stocks rise as end to US government shutdown buoys Wall St, dollar steady", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T02:43:00.000+02:00", "replies_count": 0, "uuid": "19170a5c69ec3fd83454a7cb36ff8d8f124a3f82"}, "author": "", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-rise-as-end-to-us-government-shutdown-buoys-wall-st-dollar-steady-idUSL4N1PI01L", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asia stocks rise as end to US government shutdown buoys Wall St, dollar steady", "locations": [], "entities": {"persons": [{"name": "kuroda", "sentiment": "none"}, {"name": "shinichi saoshiro", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nikkei", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}, {"name": "kospi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* MSCI Asia-Pacific index up 0.2 pct, Nikkei adds 0.45 pct\n* Wall St rises to new record highs after US govt shutdown ends\n* Dollar wavers, lift from end to US govt shutdown short-lived\n* Some focus on BOJ decision and governor Kuroda’s policy views\nBy Shinichi Saoshiro\nTOKYO, Jan 23 (Reuters) - Asian stocks advanced on Tuesday after U.S. senators struck a deal to end a three-day government shutdown, sending Wall Street’s main indexes to record highs and keeping the dollar well supported.\nU.S. lawmakers passed a short-term measure on Monday to fund the federal government through Feb. 8.\nMSCI’s broadest index of Asia-Pacific shares outside Japan rose 0.2 percent to a fresh record peak.\nAustralian stocks climbed 0.7 percent and South Korea’s KOSPI added 0.5 percent. Japan’s Nikkei was 0.45 percent higher.\nWorld equity markets have been on a tear over the past year, buoyed by a synchronized uptick in global economic growth in a boon to corporate profits and stock valuations.\nThe brief U.S. government shutdown put only a minor dent to equities, with Wall Street rallying to record highs overnight following the deal to end the impasse in Washington.\nInvestors in Asia will turn to the Bank of Japan’s monetary policy decision later in the session for potential clues.\n“The consensus is that the BOJ will stand pat on policy. So focus is on Governor (Haruhiko) Kuroda’s post-meeting press conference and how he responds to questions about the BOJ having opted to trim the amount of long-term JGBs it purchased earlier this month,” said Masahiro Ichikawa, senior strategist at Sumitomo Mitsui Asset Management in Tokyo.\nThe BOJ caused ripples in the markets earlier in January by slightly reducing the amount of longer-dated Japanese government bonds (JGBs) it buys from the market at its regular debt-purchasing operations.\nThe yen appreciated significantly against the dollar as some interpreted the BOJ’s move as a step towards eventual policy normalisation.\nIn contrast to Wall Street, the dollar’s reaction to news of the reopening of the U.S. government was more subdued.\nThe dollar briefly popped up to 111.225 yen but last traded at 110.985.\nThe euro was effectively flat at $1.2256 after gaining 0.3 percent overnight. The common currency was within reach of a three-year peak of $1.2323 set on Wednesday.\nThe euro was supported ahead of the outcome of the European Central Bank’s meeting on Thursday, which could provide clues to future shifts in the bank’s monetary policy.\nThe pound was steady at $1.3984 after touching $1.3992, its highest level since June 2016’s vote for Brexit, on optimism that Britain will reach a favourable divorce deal with the European Union.\nLifted by a wavering dollar, U.S. crude oil futures rose 0.45 percent to $63.85 per barrel.\nSpot gold slipped 0.1 percent to $1,333.36 per ounce after the U.S. government shutdown ended and dulled the precious metal’s safe-haven appeal.\nReporting by Shinichi Saoshiro; Editing by Shri Navaratnam\n ", "external_links": [], "published": "2018-01-23T02:43:00.000+02:00", "crawled": "2018-01-23T03:01:43.003+02:00", "highlightTitle": ""}