{"organizations": [], "uuid": "836d0752f2719806f8448e07fc6cbdf3005680cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104974517-GettyImages-511962520.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/wynn-resorts-board-may-face-liability-over-payouts-for-alleged-misconduct.html", "country": "US", "domain_rank": 767, "title": "Wynn Resorts board may face liability over payouts for alleged misconduct", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.155, "site_type": "news", "published": "2018-01-30T03:38:00.000+02:00", "replies_count": 0, "uuid": "836d0752f2719806f8448e07fc6cbdf3005680cb"}, "author": "Jeff Daniels", "url": "https://www.cnbc.com/2018/01/29/wynn-resorts-board-may-face-liability-over-payouts-for-alleged-misconduct.html", "ord_in_thread": 0, "title": "Wynn Resorts board may face liability over payouts for alleged misconduct", "locations": [], "entities": {"persons": [{"name": "steve wynn", "sentiment": "none"}, {"name": "ethan miller", "sentiment": "none"}], "locations": [], "organizations": [{"name": "wynn resorts", "sentiment": "negative"}, {"name": "getty images wynn resorts", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fallout continued Monday from the sexual misconduct and assault allegations against Wynn Resorts Chairman and CEO Steve Wynn as the casino giant's stock fell further. Now corporate governance experts say the company directors may face the possibility of civil liability.\nThe allegations were first reported Friday by The Wall Street Journal, which said there was a \"pattern of sexual misconduct\" in the workplace by the casino mogul as well as a $7.5 million financial settlement paid to a manicurist who allegedly was pressured into having sex in 2005 with the executive. Wynn has denied the allegations.\nSome experts say the board could \"be shielded under some circumstances\" if it's proven in court that they've acted in good faith. At least two law firms have said they are investigating Wynn Resorts and the board's fiduciary role in light of the alleged misconduct.\nRegardless, the role of the board and the allegations of misconduct by the CEO are likely to keep the stock under pressure until the issue has been resolved, say experts. Indeed, several major brokerages have issued hold investment ratings on the stock because of the uncertainties.\nWynn Resorts said in a statement Friday its board of directors formed a special committee to investigate the allegations.\nA Wynn Resorts corporate spokesman told CNBC on Monday, \"Mr. Wynn continues as the CEO of the company. The work of the Special Committee of the Board will take as long as it takes to do a thorough review.\"\nThe corporate spokesman added, \"The company and its employees remain focused on delivering superior experiences to our guests.\"\n\"Allowing someone, which is the assertion being made, to engage in an ongoing pattern and practice of behavior which subjects the company to liability raises the specter of legal liability for those who have oversight of that CEO,\" said Darren Robbins, who has served as lead counsel for more than 100 securities class actions and is founding partner of Robbins Geller Rudman & Dowd LLP.\nAdded Robbins, \"[Steve Wynn] is both a board member and an executive in the company, and so it's the responsibilities of the directors of the company to oversee it and make sure senior employees and the board itself acts in compliance with applicable law.\"\nRobbins said that given the significant stock price decline of Wynn Resorts the allegations put the company and senior insiders potentially at risk for individual liability for failing to act earlier.\nShares of Wynn Resorts fell 9.3 percent on Monday after declining more than 10 percent on Friday.\nSeveral law firms, including Levi & Korsinsky as well as Bronstein, Gerwitz & Grossman LLC, have disclosed they launched investigations into Wynn for possible breaches of fiduciary duty by certain officers and directors of the Las Vegas-based company.\n\"What the declining stock price indicates is that the information that was unknown to investors is of greater significance, obviously, because as it comes out the price of the stock is declining,\" said Robbins, who said he has been contacted by Wynn Resorts shareholders about the matter.\nAccording to the Journal, the alleged misconduct incident in 2005 was vaguely referenced in a lawsuit later brought by the CEO's ex-wife, Elaine Wynn, who is seeking control of her stock in the company. Wynn's ex-wife was ousted from the board in April 2015 after serving 13 years as a director for the company she co-founded. Elaine Wynn reportedly learned about the sexual misconduct incident in 2009 and is said to have alerted a representative for the board right away, according to reports.\nIt's unclear if the representative for the board informed other board members at the time about the allegations and financial settlement to the manicurist.\nOn Friday, CEO Wynn said in a statement that \"the idea that I ever assaulted any woman is preposterous.\"\nLegal experts say the Wynn Resorts board may end up determining that this isn't a short-term PR problem but that keeping the CEO in the current role could end up doing more harm over the long term to the brand. As a result, they say the board may be persuaded to make the change.\n\"It is likely that the board could come up with the answer this is going to do damage to the firm on a long-term basis because, in many ways, Steve Wynn is the brand,\" said Michael Chasalow, professor of law at the USC Gould School of Law in Los Angeles. \"Because of that, his reputation impacts the brand of the hotel.\"\nChasalow said the board needs to make a business judgment, so if they \"gather information in good faith and in the interests of the firm then they should be shielded.\"\nBut Chasalow said corporate boards generally have a fiduciary duty to act once they know about a situation that could have a material impact on the company.\n\"If you have an officer who is engaging in bad behavior that can result in liability for the company, then you still have an obligation to act,\" said Chasalow. \"Certainly, sexual misconduct could be liability for the [company].\"\nThen again, Chasalow said that corporate liability could hinge on whether the CEO's alleged misconduct was in his capacity as an officer or \"just personal.\" That said, he indicated a case for liability could be created if there's an expectation that personal misbehavior would be likely to take place in the workplace too.\nLegal experts say Elaine Wynn may have less culpability if she alerted authorities internally about the alleged sexual misconduct by her ex-husband. Still, they said she could have resigned voluntarily from the board at the time if she wanted to send a message.\nA spokesperson for Elaine Wynn said she had no comment Monday. An attorney for Elaine Wynn didn't respond to a request for comment for this story.\nJill Fisch, a professor of law at the University of Pennsylvania Law School in Philadelphia, said courts have traditionally not viewed board of directors' core role in oversight or risk management as including tracking the personal conduct of senior executives. However, she said that importance today is growing as general awareness of the issue of workplace harassment and assault increases.\nFisch, an attorney who specializes in securities regulation and corporate governance, said that there's a chance the case could set legal precedent or that the courts might eventually provide guidance for boards going forward as to what the appropriate course of conduct and level of oversight should be in these type of conduct issues.\n\"It's an evolving issue,\" said Fisch. \"This kind of misconduct, for better or worse, has not had a material impact on an executives' ability to be effective. And I think now with the whole '#metoo movement' that's changing.\"", "external_links": [], "published": "2018-01-30T03:38:00.000+02:00", "crawled": "2018-01-30T03:38:30.006+02:00", "highlightTitle": ""}