{"organizations": [], "uuid": "8c9aff048bda9f3be7793d822835405d0aea4ff2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-jvm-closes-two-equity-funds-that-raised-a-combined-109-million.html", "country": "US", "domain_rank": 767, "title": "JVM Closes Two Equity Funds that Raised a Combined $109 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-09T18:07:00.000+02:00", "replies_count": 0, "uuid": "8c9aff048bda9f3be7793d822835405d0aea4ff2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-jvm-closes-two-equity-funds-that-raised-a-combined-109-million.html", "ord_in_thread": 0, "title": "JVM Closes Two Equity Funds that Raised a Combined $109 Million", "locations": [], "entities": {"persons": [{"name": "jay madary", "sentiment": "none"}], "locations": [{"name": "oak brook", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}, {"name": "kansas city", "sentiment": "none"}, {"name": "aurora", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "ill", "sentiment": "none"}, {"name": "midwestern", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}], "organizations": [{"name": "jvm", "sentiment": "negative"}, {"name": "jvm realty corp.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OAK BROOK, Ill., Jan. 9, 2018 /PRNewswire/ -- JVM Realty Corp. (JVM), a leading vertically integrated multifamily real estate investment and property management firm, today announced the closing of its Fund 6 and Premier Fund II equity funds. Combined, the funds raised $109 million.\nThe two funds are currently co-invested in four apartment communities in Indianapolis, Kansas City and suburban Chicago, and are set to co-invest in a fifth community later this month. Premier Fund II has invested in an additional community in Aurora, Ill. In the end, the total acquisition cost of the six communities will be $332.4 million. Investors in the two funds include hundreds of high net worth individuals, trusts and insurance companies.\n\"The closing of Fund 6 and Premier Fund II marks another great milestone in the history of our growing company,\" said Jay Madary, president and CEO of JVM. \"We're honored that these investors have placed their trust in us and in our strategy of acquiring and operating apartment communities in Midwestern markets. We believe these funds will play a significant role in helping us meet our long-term portfolio growth goals and create value for our investors.\"\nJVM closed on three of the communities in which Fund 6 and Premier Fund II are co-invested in the fall of 2017. Those properties include:\nCirca , a 265-unit luxury apartment community in Indianapolis' Mass Avenue Arts District, which is regarded as the city's pre-eminent entertainment corridor with more than 60 restaurants, bars and retailers. Circa residents enjoy an urban, highly walkable neighborhood with a professional atmosphere.\nCommunity amenities include a resort-style saltwater pool and sun deck, outdoor gas grilling stations, a community room with catering kitchen and coffee/tea bar, bike rental services and secure bike storage.\nAvant at the Arboretrum , a 310-unit luxury apartment community in Lisle, Ill. The community is located along the prestigious I-88 Corporate Corridor within one of the most dynamic areas in suburban Chicago. Lisle has been listed on Money Magazine's \"Top 20 Best Places to Live in America\" and included on Niche.com 's list of \"Best Places to Live in Illinois.\"\nThe community's apartment homes include gourmet kitchens, granite countertops, stainless steel appliances and large patios/balconies. Avant also features units wrapped around a courtyard and a structured parking garage that provides residents with parking on the same level as their homes.\nSummit on Quality Hill, a newly constructed 252-unit community in downtown Kansas City, Mo. Located on the west side of downtown, Quality Hill is a historic neighborhood that sits on a 200-foot-high bluff overlooking the West Bottoms area. The community is near the popular Power & Light District, which includes The Sprint Center, the Kansas City Convention Center and a multitude of dining and entertainment establishments.\nSummit also has all of the amenities an urban professional would want, including a resort-style pool, state-of-the-art fitness center, AT&T and Google internet connection, dedicated heated garage parking, electric car charging stations, 24-hour electronic package delivery system, and self-service dry cleaning pick up/drop off.\nThis month, JVM is expected to close on another community in which Fund 6 and Premier Fund II will be co-invested: Apex on Quality Hill , a 138-unit luxury apartment community in downtown Kansas City, Mo., that is the sister property to Summit on Quality Hill, which is located a block away. Apex, which was built last year, features the same amenities as its sister property.\n\"These communities are outstanding additions to our portfolio. They represent a nice mix of in-town and suburban communities, and they also feature the highly amenitized, best-in-class living experiences so in demand by today's apartment renter,\" Madary said. \"We are confident that our management expertise and the overall strength of the apartment market in these areas will deliver optimized property performance and value to our investors.\"\nFund 6 and Premier Fund II also are co-invested in The Residences at New Longview , a 309-unit luxury apartment community in Lee's Summit, Mo. Furthermore, Premier Fund II is invested in Aventine at Oakhurst North , a 464-unit luxury apartment community in Aurora, Ill. JVM acquired the two communities in late 2016.\nAbout JVM\nJVM is a respected name as a leader in multifamily real estate investment and property management. Now in its 43rd year, JVM is committed to excellence and integrity and strives to be the preferred choice for its investors, residents and associates. Based in Oak Brook, Ill., it operates an $850 million multifamily portfolio in the greater Midwestern United States, including Illinois, Indiana, Kansas, Missouri, Ohio and Oklahoma. For more information about JVM, visit our website and read our blog .\nMedia Contact:\nLindsey Bernhardt\nLinnellTaylor Marketing\nlindsey@linnelltaylor.com\n303.682.3941\nView original content with multimedia: http://www.prnewswire.com/news-releases/jvm-closes-two-equity-funds-that-raised-a-combined-109-million-300579889.html\nSOURCE JVM Realty", "external_links": ["http://www.jvmrealty.com/blog", "http://www.prnewswire.com/news-releases/jvm-closes-two-equity-funds-that-raised-a-combined-109-million-300579889.html", "http://www.jvmrealty.com/"], "published": "2018-01-09T18:07:00.000+02:00", "crawled": "2018-01-09T18:52:12.019+02:00", "highlightTitle": ""}