{"organizations": [], "uuid": "ef68df82b99b57d7fc199cef093be376cbe8d673", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-birks-group-reports-a-2-percent-increase-in-holiday-season-comparable-store-sales-when-excluding-flagship-renovations.html", "country": "US", "domain_rank": 767, "title": "Birks Group Reports a 2% Increase in Holiday Season Comparable Store Sales When Excluding Flagship Renovations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-12T16:00:00.000+02:00", "replies_count": 0, "uuid": "ef68df82b99b57d7fc199cef093be376cbe8d673"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-birks-group-reports-a-2-percent-increase-in-holiday-season-comparable-store-sales-when-excluding-flagship-renovations.html", "ord_in_thread": 0, "title": "Birks Group Reports a 2% Increase in Holiday Season Comparable Store Sales When Excluding Flagship Renovations", "locations": [], "entities": {"persons": [{"name": "jean-christophe bédos", "sentiment": "none"}], "locations": [{"name": "montreal", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}], "organizations": [{"name": "bgi", "sentiment": "neutral"}, {"name": "birks group", "sentiment": "neutral"}, {"name": "birks group inc.", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONTREAL--(BUSINESS WIRE)-- Birks Group Inc. (the “Company” or “Birks Group”) (NYSE American:BGI), today announced a 4% decline in holiday season sales (for the period from November 3, 2017 through December 30, 2017), but when the results of two flagship stores currently undergoing major renovations are excluded, comparable store sales increased by 2%. The 2% growth in comparable store sales experienced across the remaining stores was primarily the result of the increased sales of Birks-branded products, successful execution of targeted marketing campaigns and growth in e-commerce sales.\nJean-Christophe Bédos, President and Chief Executive Officer of Birks Group, commented: “While we continued to battle a soft retail environment in Canada, we managed to leverage our marketing campaigns, the performance of Birks-branded products and our ongoing dedication to enhancing customer experience. As we enter the final quarter of our fiscal year, we will maintain our focus on our short-term and long-term growth strategies, namely the renovation of our flagship stores, the global expansion of the Birks product brand and the development of our e-commerce and wholesale businesses; the execution of which will contribute to long-term sales and profitability growth. Furthermore, our financial position supports our investments in these growth strategies. Under all the circumstances, we are pleased with our achievements.”\nComparable Store Sales\nWe use comparable store sales as a key performance measure for our business. Comparable store sales include stores open in the same period in both the current and prior year. We include our e-commerce sales in comparable store calculations. Stores enter the comparable store calculation in their thirteenth full month of operation under our ownership. Stores that have been resized and stores that are relocated are evaluated on a case by case basis to determine if they are functionally the same store or a new store and then are included or excluded from comparable store sales, accordingly. Comparable store sales measures the percentage change in net sales for comparative stores in a period compared to the corresponding period in the previous year. If a comparable store is not open for the entirety of both periods, comparable store sales measures the change in net sales for the portion of time that such store was open in both periods. We believe that this measure provides meaningful information on our performance and operating results. However, readers should know that this financial metric has no standardized meaning and may not be comparable to similar measures presented by other companies.\nAbout Birks Group Inc.\nBirks Group is a leading designer of fine jewelry, timepieces and gifts and operator of luxury jewelry stores in Canada. The Company operates 28 stores under the Birks brand in most major metropolitan markets in Canada and two retail locations in Calgary and Vancouver under the Brinkhaus brand. Birks Collections are available at Mappin & Webb and Goldsmiths in the United Kingdom in addition to several jewelry retailers across North America. Birks was founded in 1879 and has become Canada’s premier retailer and designer of fine jewelry, timepieces and gifts. Additional information can be found on Birks’ web site, www.birksgroup.com .\nForward Looking Statements\nThis press release contains certain “forward-looking” statements concerning the Company’s performance and strategies, including the Company’s expectations that the successful execution of its short-term and long-term growth strategies, namely the finalization of its flagship store renovations, the global expansion of the Birks product brand and the development of its e-commerce and wholesale businesses will lead to long-term sales and profitability growth and that its financial position supports its investments in these growth strategies. Given such statements include various risks and uncertainties, actual results might differ materially from those projected in the forward-looking statements and no assurance can be given that we will meet the results projected in the forward looking statements. These risks and uncertainties include, but are not limited to the following: (i) economic, political and market conditions, including the economies of Canada and the U.S., which could adversely affect the Company’s business, operating results or financial condition, including its revenue and profitability, through the impact of changes in the real estate markets, changes in the equity markets and decreases in consumer confidence and the related changes in consumer spending patterns, the impact on store traffic, tourism and sales; (ii) the impact of fluctuations in foreign exchange rates, increases in commodity prices and borrowing costs and their related impact on the Company’s costs and expenses; (iii) the Company’s ability to maintain and obtain sufficient sources of liquidity to fund its operations, to achieve planned sales, gross margin and net income, to keep costs low, to implement its business strategy, maintain relationships with its primary vendors, to mitigate fluctuations in the availability and prices of the Company’s merchandise, to compete with other jewelers, to succeed in its marketing initiatives, and to have a successful customer service program and (iv) the Company’s ability to execute its strategic vision. Information concerning factors that could cause actual results to differ materially are set forth under the captions “Risk Factors” and “Operating and Financial Review and Prospects” and elsewhere in the Company’s Annual Report on Form 20-F filed with the Securities and Exchange Commission on June 23, 2017 and subsequent filings with the Securities and Exchange Commission. The Company undertakes no obligation to update or release any revisions to these forward-looking statements to reflect events or circumstances after the date of this statement or to reflect the occurrence of unanticipated events, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180112005103/en/\nBirks Group Inc.\nPasquale (Pat) Di Lillo, 514-397-2592\nVice President, Chief Financial and Administrative Officer\nor\nEva Hartling, 514-397-2496\nVice President, Birks Brand & Chief Marketing Officer\nSource: Birks Group Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.birksgroup.com&esheet=51742303&newsitemid=20180112005103&lan=en-US&anchor=www.birksgroup.com&index=1&md5=2f734b856ac75b2793d970c7164972b3", "http://www.businesswire.com/news/home/20180112005103/en/"], "published": "2018-01-12T16:00:00.000+02:00", "crawled": "2018-01-12T17:53:36.020+02:00", "highlightTitle": ""}