{"organizations": [], "uuid": "1fd5c4c34a3b94859d8e5db290d6b60adb706dca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-liberty-announces-quarterly-interest-payment-and-regular-cash-dividend-amount-on-0-point-75-percent-senior-exchangeable.html", "country": "US", "domain_rank": 767, "title": "Liberty Announces Quarterly Interest Payment and Regular Cash Dividend Amount on 0.75% Senior Exchangeable Debentures Due 2043", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:30:00.000+02:00", "replies_count": 0, "uuid": "1fd5c4c34a3b94859d8e5db290d6b60adb706dca"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-liberty-announces-quarterly-interest-payment-and-regular-cash-dividend-amount-on-0-point-75-percent-senior-exchangeable.html", "ord_in_thread": 0, "title": "Liberty Announces Quarterly Interest Payment and Regular Cash Dividend Amount on 0.75% Senior Exchangeable Debentures Due 2043", "locations": [], "entities": {"persons": [], "locations": [{"name": "englewood", "sentiment": "none"}, {"name": "colo.", "sentiment": "none"}, {"name": "lvnta", "sentiment": "none"}], "organizations": [{"name": "eractive corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ENGLEWOOD, Colo.--(BUSINESS WIRE)-- Liberty Interactive LLC (\"Liberty\"), a subsidiary of Liberty Interactive Corporation (Nasdaq: QVCA, QVCB, LVNTA, LVNTB), announced the payment today of a quarterly interest payment to the holders, as of December 15, 2017, of its 0.75% Senior Exchangeable Debentures due 2043 (the \"Debentures\"). The amount of the quarterly interest payment is $1.875 per $1,000 original principal amount of Debentures. As of December 30, 2017, 1,116 Debentures remained outstanding in the aggregate adjusted principal amount of $422,542, after giving effect to today’s quarterly interest payment.\nUnder the Indenture for the Debentures, the original principal amount of the Debentures is reduced in an amount equal to each extraordinary distribution that is made to holders of the Debentures. Thereafter, the adjusted principal amount is further reduced on each successive quarterly interest payment date to the extent necessary to cause the quarterly interest payment to represent the payment of an annualized yield of 0.75% of the adjusted principal amount. This latter adjustment, to the extent it is made by reason of a particular extraordinary distribution that results in a reduction to the principal amount of the Debentures, takes effect on the second succeeding interest payment date after the payment of that extraordinary distribution.\nTo date, Liberty has made one extraordinary distribution to holders of the Debentures. On June 16, 2016, Liberty made an extraordinary distribution of $614.4332 per $1,000 original principal amount of the Debentures attributable to the cash distribution made to former holders of common stock of Time Warner Cable, Inc. (“TWC”) on May 18, 2016, in connection with the mergers involving Charter Communications, Inc. and TWC (the “Charter/TWC Merger”). The extraordinary distribution was based on the “average transaction consideration” paid in the Charter/TWC Merger, as that term is defined in the Indenture for the Debentures.\nReductions to the principal amount of the Debentures do not affect the amount of the quarterly interest payments received by holders of the Debentures, which will continue to be a rate equal to 0.75% per annum of the original principal amount of the Debentures. Below is a detail of the amount of the quarterly interest payment being made on the Debentures, its allocation between payment of interest and repayment of principal and the revised adjusted principal amount of the Debentures resulting from such payment, per $1,000 original principal amount of the Debentures:\nDecember 30, 2017\nBeginning Adjusted\nPrincipal\nPayment Interest Payment of\nPrincipal\nDecember 30, 2017\nEnding Adjusted\nPrincipal\n$379.7849 $1.875 $0.7121 $1.1629 $378.6220 Liberty also announced the payment today, to holders of the Debentures as of December 15, 2017, of an additional distribution of $2.1041 per Debenture, which is attributable to the regular quarterly dividends paid by Time Warner Inc. of $0.4025 on November 1, 2017 and by Time Inc. of $0.0400 on December 15, 2017. Payments of additional distributions attributable to regular cash dividends do not result in a reduction to the principal amount of the Debentures.\nAbout Liberty Interactive LLC\nLiberty Interactive LLC is an intermediate subsidiary of Liberty Interactive Corporation, owning interests in a broad range of electronic retailing, media, communications, and entertainment businesses.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005497/en/\nLiberty Interactive Corporation\nCourtnee Chun, 720-875-5420\nSource: Liberty Interactive Corporation", "external_links": ["http://www.businesswire.com/news/home/20180102005497/en/"], "published": "2018-01-03T00:30:00.000+02:00", "crawled": "2018-01-03T02:22:22.020+02:00", "highlightTitle": ""}