{"organizations": [], "uuid": "858840382b9cd9544e1348d60baa82462a519bb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226087856&w=1200&r=LYNXMPEE0R0SW", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mexico-violence/at-least-25-killed-in-mexico-over-bloody-weekend-idUKKBN1FH0W4", "country": "US", "domain_rank": 408, "title": "At least 25 killed in Mexico over bloody weekend", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T21:21:00.000+02:00", "replies_count": 0, "uuid": "858840382b9cd9544e1348d60baa82462a519bb8"}, "author": "", "url": "https://uk.reuters.com/article/uk-mexico-violence/at-least-25-killed-in-mexico-over-bloody-weekend-idUKKBN1FH0W4", "ord_in_thread": 0, "title": "At least 25 killed in Mexico over bloody weekend", "locations": [], "entities": {"persons": [{"name": "garza", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "san nicolas de los garza", "sentiment": "none"}, {"name": "san nicholas", "sentiment": "none"}, {"name": "monterrey", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 7:22 PM / Updated 38 minutes ago At least 25 killed in Mexico over bloody weekend Reuters Staff 2 Min Read \nMEXICO CITY (Reuters) - At least 25 people were murdered in Mexico this weekend, according to officials and local media, including nine men who were executed at a house party in a suburb of the wealthy northern industrial city of Monterrey. \nMasked gunmen burst into a home in San Nicholas de los Garza as a group watched a local soccer team play on television, according to state prosecutors. Seven were killed at the scene and two more died later at a hospital. \nMexico’s federal government called a news conference for later Sunday to detail security plans after murders climbed to a record high of more than 25,000 last year. \nRival drug gangs have increasingly splintered into smaller, more blood-thirsty groups following more than a decade of a military-led campaign to battle the cartels. A soldier stands guard next to a crime scene, where men were killed inside a home by unknown assailants, in the municipality of San Nicolas de los Garza, Mexico, January 27, 2018. Picture taken January 27, 2018. REUTERS/Jorge Lopez \nViolence is a central issue ahead of the presidential election in July. Mexican President Enrique Pena Nieto’s ruling Institutional Revolutionary Party is trailing in third place in recent polls. \nThere were a wave of attacks in night spots late Saturday and early Sunday. A group of armed men killed three people in a bar in the resort city of Cancun, local media reported. Slideshow (2 Images) \nA Chilean tourist was killed when gunman opened fire at a restaurant in the Pacific beach resort of Acapulco, and two more were killed in a bar in the capital of Veracruz state on the Gulf of Mexico when two men opened fire on employees and a band. \nSix more were killed in the border city of Ciudad Juarez, including a couple whose tortured bodies were found in a park. \nFour more died in the border state of Tamaulipas, where at least 10 were killed during the week at outlaw road blockades and in shootouts, local media reported. Reporting by Michael O'Boyle and Diego Ore", "external_links": [], "published": "2018-01-28T21:21:00.000+02:00", "crawled": "2018-01-28T21:56:02.002+02:00", "highlightTitle": ""}