{"organizations": [], "uuid": "717912f49ea12c2de10f5419646724e29488a35f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-xl-catlins-global-excess-casualty-insurance-business-appoints-john-kopach-as-south-east-region-manager.html", "country": "US", "domain_rank": 767, "title": "XL Catlin's Global Excess Casualty Insurance Business Appoints John Kopach as South East Region Manager", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.37, "site_type": "news", "published": "2018-01-31T21:00:00.000+02:00", "replies_count": 0, "uuid": "717912f49ea12c2de10f5419646724e29488a35f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-xl-catlins-global-excess-casualty-insurance-business-appoints-john-kopach-as-south-east-region-manager.html", "ord_in_thread": 0, "title": "XL Catlin's Global Excess Casualty Insurance Business Appoints John Kopach as South East Region Manager", "locations": [], "entities": {"persons": [{"name": "catlin", "sentiment": "negative"}, {"name": "john kopach", "sentiment": "negative"}, {"name": "barbara luck", "sentiment": "none"}, {"name": "kopach", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "global excess casualty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 31, 2018 /PRNewswire/ -- To meet continued increased demand for tailored excess casualty and umbrella insurance products across the South East region of the US, XL Catlin's Global Excess Casualty insurance business has appointed John Kopach as new Regional Underwriting Manager.\nAccording to Barbara Luck, President of XL Catlin's Global Excess Casualty business, \"Our continued success developing and growing our business and client and broker relationships throughout the US, has prompted the need to be even closer to our clients and brokers, with even more underwriting expertise and authority for local decision making and service support within their specific regions. Brokers and clients value our expertise, service and responsiveness as some of our key market differentiators. This is why we decided to provide clients and brokers in the South East and North East with their specific Underwriting Regional Leader.\"\nIn his new role as Global Excess Casualty South East Region Manager, Mr. Kopach will lead the Atlanta-based team towards a more geographic-focused approach in addressing our broker and client's excess and umbrella liability needs.\n\"The new regions better enable our team to deliver more attentive service and become closer partners to our growing number of clients and brokers who trust us to find innovative and effective ways to manage their excess and umbrella liability coverages. John's in-depth knowledge of the excess casualty market, as well as his experience and relationships in the South East region are a fantastic asset to our team,\" added Ms. Luck.\"\nMr. Kopach joins XL Catlin from Everest National Insurance where he served as Vice President- Excess Casualty, East Region. He brings a combined 16 years of experience in the insurance and reinsurance market having worked at Swiss Re Corporate Solutions and XL Catlin Reinsurance. He is a graduate of Boston University and holds a Master's of Science degree from the Sargent College of Health & Rehabilitation Sciences.\nHelping a wide range of businesses -- from Upper Middle Market (UMM) to Fortune 1000 companies -- XL Catlin's Global Excess Casualty insurance team provides Lead Umbrella, Excess, Occurrence, Claims Made, Occurrence Reported and Primary Rail and Excess insurance coverages from global access points with underwriting centers in Bermuda, Dublin, Ireland, London, UK and 13 cities in North America. Liability limits up to $100 million are available.\nAbout XL Catlin Insurance Operations\nXL Catlin insurance companies offer property, casualty, professional, financial lines and specialty insurance products globally. Businesses that are moving the world forward choose XL Catlin as their partner. To learn more, visit xlcatlin.com .\nAbout XL Catlin\nXL Catlin is the global brand used by XL Group Ltd's (NYSE:XL) insurance and reinsurance companies which provide property, casualty, professional and specialty products to industrial, commercial and professional firms, insurance companies and other enterprises throughout the world. Clients look to XL Catlin for answers to their most complex risks and to help move their world forward. To learn more, visit xlcatlin.com .\nView original content: http://www.prnewswire.com/news-releases/xl-catlins-global-excess-casualty-insurance-business-appoints-john-kopach-as-south-east-region-manager-300591297.html\nSOURCE XL Catlin", "external_links": ["http://xlcatlin.com/", "http://www.xlgroup.com/", "http://xlcatlin.com/insurance/insurance-coverage/casualty-insurance/umbrella-liability", "http://www.prnewswire.com/news-releases/xl-catlins-global-excess-casualty-insurance-business-appoints-john-kopach-as-south-east-region-manager-300591297.html"], "published": "2018-01-31T21:00:00.000+02:00", "crawled": "2018-01-31T22:54:15.001+02:00", "highlightTitle": ""}