{"organizations": [], "uuid": "b92597502fb2dca577f8fe1fe44cbfce1b469c89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221880915&w=1200&r=LYNXMPEE0D06G", "site_section": "http://feeds.feedburner.com/NewsPresidentNews-GoogleNews", "section_title": "news PRESIDENT news - Google News", "url": "https://www.reuters.com/article/us-liberia-politics/liberia-ruling-party-expels-president-johnson-sirleaf-idUSKBN1F30AN", "country": "US", "domain_rank": 408, "title": "Liberia ruling party expels President Johnson Sirleaf - Reuters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T12:06:00.000+02:00", "replies_count": 0, "uuid": "b92597502fb2dca577f8fe1fe44cbfce1b469c89"}, "author": "", "url": "https://www.reuters.com/article/us-liberia-politics/liberia-ruling-party-expels-president-johnson-sirleaf-idUSKBN1F30AN", "ord_in_thread": 0, "title": "Liberia ruling party expels President Johnson Sirleaf - Reuters", "locations": [], "entities": {"persons": [{"name": "johnson sirleaf alpho", "sentiment": "negative"}, {"name": "johnson sirleaf", "sentiment": "negative"}, {"name": "ellen johnson sirleaf", "sentiment": "none"}, {"name": "george weah", "sentiment": "none"}], "locations": [{"name": "liberia", "sentiment": "none"}, {"name": "monrovia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "unity party", "sentiment": "none"}, {"name": "toweh", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONROVIA (Reuters) - Liberia’s ruling Unity Party has expelled the country’s outgoing president, Ellen Johnson Sirleaf, who is accused by party leaders of meddling in last year’s presidential elections in which its candidate suffered a bruising defeat.\nJohnson Sirleaf, a Nobel Peace Prize laureate who has been in power for 12 years, denies the party’s allegations that she held inappropriate private meetings with election magistrates before the Oct. 10 vote.\nFour other party officials were also expelled, the party said in a statement distributed on Sunday.\n“The behaviour of the expelled persons ... constitutes sabotage and undermined the existence of the party,” said the statement announcing the decision, which was taken by the party’s executive committee late on Saturday.\nA senior official in Johnson Sirleaf’s office declined to comment on the decision. The president and other officials were not immediately available on Sunday.\nFormer soccer star George Weah defeated the Unity Party’s Joseph Boakai in a landslide, marking the first democratic transition of power in Liberia - a nation founded by freed American slaves - in over 70 years.\nLiberia's President Ellen Johnson Sirleaf attends a Reuters interview ahead of the World Trade Organization (WTO) Summit in the capital Nairobi December 14, 2015. REUTERS/Noor Khamis Johnson Sirleaf was not allowed to run for re-election due to constitutional term limits. A split between her and Boakai burst into the open during the campaign. [L8N1N562G]\nThe statement said Johnson Sirleaf and the other members had violated rules, including a requirement to support all Unity Party candidates in elections.\nWeah will be sworn in later this month.\nJohnson Sirleaf won the Nobel Peace Prize in 2011 for helping secure peace after civil wars from 1989-2003. But her critics say she has not done enough to ease rampant poverty - a task complicated by a 2014-16 Ebola epidemic that killed thousands of Liberians.\nHer administration has also faced repeated allegations of corruption and nepotism. She denies the accusations, but they resonated with many of the voters who rallied to Weah’s call for change.\nWeah, who in 1995 became the only African to win FIFA World Player of the Year, now faces sky-high expectations from his base of young supporters. Others, who see him as lacking the experience and knowledge for the job, remain skeptical.\nReporting by Alphonso Toweh; Writing by Joe Bavier; Editing by Raissa Kasolowsky and Dale Hudson\n ", "external_links": [], "published": "2018-01-14T12:06:00.000+02:00", "crawled": "2018-01-14T15:54:49.028+02:00", "highlightTitle": ""}