{"organizations": [], "uuid": "354ab359cb2b169124f2573c745e0cc98a593a8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/11/02/103131498-GettyImages-76008514.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/18/fed-up-with-drug-companies-hospitals-decide-to-start-their-own.html", "country": "US", "domain_rank": 767, "title": "Fed up with drug companies, hospitals decide to start their own", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:23:00.000+02:00", "replies_count": 0, "uuid": "354ab359cb2b169124f2573c745e0cc98a593a8e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/fed-up-with-drug-companies-hospitals-decide-to-start-their-own.html", "ord_in_thread": 0, "title": "Fed up with drug companies, hospitals decide to start their own", "locations": [], "entities": {"persons": [{"name": "marc harrison", "sentiment": "none"}], "locations": [{"name": "salt lake city", "sentiment": "none"}], "organizations": [{"name": "intermountain healthcare", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "For years, hospital executives have expressed frustration when essential drugs like heart medicines have become scarce, or when prices have skyrocketed because investors manipulated the market.\nNow, some of the country's largest hospital systems are taking an aggressive step to combat the problem: They plan to go into the drug business themselves, in a move that appears to be the first on this scale.\n\"This is a shot across the bow of the bad guys,\" said Dr. Marc Harrison, the chief executive of Intermountain Healthcare, the nonprofit Salt Lake City hospital group that is spearheading the effort. \"We are not going to lay down. We are going to go ahead and try and fix it.\"\nWhile Intermountain executives would not name the drugs they intend to make, hospitals have long experienced shortages of drugs like morphine or encountered sudden price increases for old, off-patent products like the heart medicine Nitropress. Hospitals have also come under criticism for overcharging for their services, including for some drugs.\nRead more from The New York Times: \nQuestions and answers about this year's flu season \nGiven medicine, the patients got better. They remained in shackles anyway. \nTreatment offers hope for imprisoned California siblings \nSeveral major hospital systems, including Ascension, a Catholic system that is the nation's largest nonprofit hospital group, plan to form a new nonprofit company, that will provide a number of generic drugs to the hospitals. The Department of Veterans Affairs is also expressing interest in participating.\nIn all, about 300 hospitals are now included in the group. Other hospitals are expected to join.\nDr. Harrison said they planned to focus only on certain drugs. \"There are individual places where there are problems,\" he said. \"We are not indicting an entire industry.\"\nDr. Kevin A. Schulman, a professor of medicine at the Duke University School of Medicine who has studied the generic drug market and is advising the effort, said: \"If they all agree to buy enough to sustain this effort, you will have a huge threat to people that are trying to manipulate the generic drug market. They will want to think twice.\"\nThe idea is to directly challenge the host of industry players who have capitalized on certain markets, buying up monopolies of old, off-patent drugs and then sharply raising prices, stoking public outrage and prompting a series of Congressional hearings and federal investigations. The most notorious example is of Martin Shkreli, the former hedge fund manager who raised the price of a decades-old drug , Daraprim, to $750 a tablet in 2015, from $13.50.\nHospitals have also struggled to deal with shortages of hundreds of vital drugs over the past decade, ranging from injectable morphine to sodium bicarbonate (the medical form of baking soda), shortfalls that are exacerbated when only one or two manufacturers make the product.\n\"We're seeing an acceleration of both shortages and escalation of prices,\" said Dr. Richard Gilfillan, the chief executive of Trinity Health, a large Catholic system that operates in nearly two dozen states and is part of the group. \"There's not been any effective push back on either of these.\"\nIntermountain executives would not discuss many details of the project, citing fears that competitors could shut them out of the market by quickly dropping the price of the drugs in question, then raising them again later. They said they would focus on drugs whose prices have risen sharply or that have been in short supply.\n\"We're going to have to hold that very close to our vest,\" Dr. Harrison said. The company will either rely on third-party manufacturers or decide to make the drugs themselves.\nThe new company will initially focus on selling to hospitals, but officials said they may eventually expand to offer the products more broadly.\nDr. Carolyn Clancy, the executive in charge of the Veterans Health Administration, said its pharmacy experts have consulted with the other systems about the project and is now working out the details of its possible involvement. \"Our strong interest here is minimizing the impact of any shortages of generic drugs,\" she said. While she said the agency is able to negotiate good prices for veterans, \"we don't necessarily control supply\" and have experienced many of the same shortages, including the recent lack of saline fluids , as the other health groups.\n\"We are constantly scanning the horizon and constantly attentive to interruptions of supply chains of medicines,\" she said.\nIn addition to Daraprim, several old, off-patent drugs have seen sharp price increases over the past several years. In 2015, Valeant Pharmaceuticals International became a Wall Street darling after it sold investors on its business model of buying up old drugs , then raising the prices precipitously. That year, it sharply raised the prices of two heart drugs, Nitropress and Isuprel, adding millions to hospitals' drug bills almost overnight. Valeant's practices led to a series of investigations and Congressional hearings as well as a shake-up of the company's leadership.\nRepresentatives for the generic drug industry have noted that many of the most high-profile cases have involved old, off-patent drugs for which there has been no generic competition.\nThe trade group for generic manufacturers, the Association for Accessible Medicines, said its members generally welcome competition. \"The whole generic industry is premised on competition, and that competition brings dramatic savings for patients,\" said Allen Goldberg, a spokesman for the group.\nBut generic drug makers have also come under scrutiny.\nThe hike in the price of doxycycline hyclate , an antibiotic, which increased to $3.65 a pill in 2013 from 5.6 cents in 2012, led to a congressional investigation as well as state and federal price-fixing inquiries into some of the industry's biggest players. Last fall, a coalition of state attorneys general broadened a lawsuit over price fixing , accusing 18 companies of engaging in illegal practices involving 15 drugs.\nAnthony R. Tersigni, the chief executive of Ascension, said he and other hospital executives felt they had little choice but to try to solve the problem themselves. \"We took the position collectively rather than waiting and hoping for the generic drug companies to address it,\" he said. \"We have to address it head on.\"\nIntermountain executives said that they would seek approval to manufacture the products from the Food and Drug Administration, which has vowed to give priority to companies that want to make generics in markets for which there is little competition.\nThe project boasts a high-profile list of advisers, ranging from Bob Kerrey, the former Democratic senator of Nebraska, to Dr. Donald Berwick, a former administrator for the Centers of Medicare and Medicaid Services, as well as two former executives with Amgen , the drug manufacturer.\nErin Fox, a drug shortage expert at the University of Utah, said the idea of creating a nonprofit drug company is promising. \"I think anything that increases the number of suppliers will help,\" she said. She added that the trick will be in selecting the right third-party manufacturer to ensure good quality.", "external_links": [], "published": "2018-01-18T17:23:00.000+02:00", "crawled": "2018-01-18T18:47:37.005+02:00", "highlightTitle": ""}