{"organizations": [], "uuid": "0abe7c15c469f1b3690c62aa42dd881421f79140", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/kraken.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/14/kraken-bitcoin-exchange-reopens/", "country": "US", "domain_rank": 1196, "title": "Kraken Bitcoin Exchange Reopens After Lengthy Maintenance | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.566, "site_type": "news", "published": "2018-01-14T15:19:00.000+02:00", "replies_count": 0, "uuid": "0abe7c15c469f1b3690c62aa42dd881421f79140"}, "author": "David Z. Morris", "url": "http://fortune.com/2018/01/14/kraken-bitcoin-exchange-reopens/", "ord_in_thread": 0, "title": "Kraken Bitcoin Exchange Reopens After Lengthy Maintenance | Fortune", "locations": [], "entities": {"persons": [{"name": "david z. morris", "sentiment": "negative"}, {"name": "kraken", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "bitcoin", "sentiment": "none"}, {"name": "mt. gox", "sentiment": "none"}], "organizations": [{"name": "kraken bitcoin exchange", "sentiment": "negative"}, {"name": "est  kraken", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Z. Morris 1:19 PM EST \nKraken, a major North American cryptocurrency exchange and the fifth-largest globally, came back online Saturday after an exceptionally long maintenance outage that fueled anxiety among users. It’s a happy ending to what some feared could become yet another in a line of ignominious cryptocurrency exchange collapses. \nKraken initially shut down last Thursday for what was projected to be two hours of maintenance. But the planned fix, a complete revamp of their trading engine, didn’t go smoothly . The exchange provided regular, contrite updates as staff hunted what was described as “an elusive bug.” All trading and withdrawals were suspended during the process. \nDespite fairly solid communication about the situation, some Bitcoiners began having flashbacks to catastrophic exchange failures of the past, including the 2014 collapse of Japan’s Mt. Gox, then the world’s largest Bitcoin exchange. That shutdown cost traders nearly half a billion dollars worth of Bitcoin — at a price vastly lower than today’s. \nGet Data Sheet , Fortune’s technology newsletter. \nDozens of other exchanges have been closed after hacks or other errors, most recently including South Korea’s Youbit . Such failures expose investors to major losses because exchanges hold both cryptocurrency and conventional funds on traders’ behalf. Most cryptocurrency veterans encourage investors to store cryptocurrency locally to minimize that risk. \nIn Kraken’s case, though, everything turned out fine. The exchange finally came back online Saturday , with all client funds reportedly intact. As a kind of apology to users, Kraken has reduced non-margin trading fees to zero until the end of the month. \nKraken, along with Coinbase, are showing that a bitcoin exchange can be professional, trustworthy, and regulated. There is still, though, a gigantic elephant in the room — Bitfinex, the world’s largest cryptocurrency exchange, is still the target of serious skepticism. Most recently, it was discovered that Bitfinex was closely linked to a cryptocurrency called Tether, a relationship some argued exposes the entire cryptocurrency market to systemic risk. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-14T15:19:00.000+02:00", "crawled": "2018-01-14T20:35:08.006+02:00", "highlightTitle": ""}