{"organizations": [], "uuid": "643d717bd521733740c2ec245e9975b92ceafbcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-dentons-strengthens-atlanta-office-with-the-addition-of-marquee-litigator-mark-trigg.html", "country": "US", "domain_rank": 767, "title": "Dentons Strengthens Atlanta Office with the Addition of Marquee Litigator Mark Trigg", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.926, "site_type": "news", "published": "2018-01-29T18:00:00.000+02:00", "replies_count": 0, "uuid": "643d717bd521733740c2ec245e9975b92ceafbcf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-dentons-strengthens-atlanta-office-with-the-addition-of-marquee-litigator-mark-trigg.html", "ord_in_thread": 0, "title": "Dentons Strengthens Atlanta Office with the Addition of Marquee Litigator Mark Trigg", "locations": [], "entities": {"persons": [{"name": "mark trigg", "sentiment": "negative"}, {"name": "mark g. trigg", "sentiment": "none"}, {"name": "trigg", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": [{"name": "dentons strengthens atlanta office", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA--(BUSINESS WIRE)-- Dentons, the global law firm, today announces that nationally-recognized Atlanta litigator Mark G. Trigg will join the Firm as partner. Experienced in a wide array of complex commercial litigation, and known high-profile engagements in the entertainment and sports industries, he joins the Firm's Litigation and Dispute Resolution practice and will be resident in its Atlanta office.\nTrigg's extensive practice includes commercial litigation; class action defense, including the $1.5 billion defense of the world's largest computer manufacturer; defamation, advertising and media claims; sports and entertainment litigation; real estate disputes; securities litigation, labor and employment litigation, contractual claims, and white collar criminal defense. He advises clients across the country on governmental litigation and administrative proceedings, as well as in civil and criminal disputes.\nWith deep roots in the marketplace, Trigg also boasts an impressive track record of wins in the region including representing the City of Atlanta and its department of aviation in the defense of concession contracts, valued at approximately $3 billion, during construction and the expansion of Hartsfield-Jackson Atlanta International Airport; defending the Metropolitan Atlanta Rapid Transit Authority (MARTA) in a $220 million tunnel ventilation contract dispute; and successfully representing one of the nation's largest waste removal companies in a dispute with one of Georgia's largest counties, among others.\n\"Mark is one of a handful of elite go-to litigators in the Southeast known not only for complex litigation involving corporations, but also for his deft hand with high-profile individuals in government, sports and entertainment,\" said Sharon Gay, managing partner of Dentons' Atlanta office. \"We are delighted he's here.\"\n\"Mark's substantial and versatile practice has made him an invaluable local resource and allowed him to successfully serve a variety of clients throughout the nation,\" said Mike McNamara, US CEO of Dentons. \"With more than 30 years of experience, he will undoubtedly broaden the capabilities of the Firm's highly-regarded and award-winning litigation practice, which is in a period of growth.\"\nTrigg joins on the heels of the recent move of well-known insurance and financial litigators Fred Reinke and Richard Dodge, who recently joined the practice in Washington, DC.\nDentons' Litigation and Dispute Resolution practice consists of more than 200 lawyers in the United States, focusing on complex disputes in federal and state courts across the country, as well as before regulatory agencies, administrative bodies and arbitration tribunals. Dentons' Litigation group has consistently received top rankings in leading trade publications, including The Best Lawyers in America, The Legal 500, Chambers USA, Law360's \"Top 50 Litigation Powerhouse Firms,\" and Daily Report's \"Insurance Litigation Department of the Year.\" The group is recognized in BTI Consulting's 2018 top ranked \"Fearsome Five\" and \"Fearsome Foursome,\" crediting the litigators' intense approach and fierce strategy on behalf of clients in the competitive legal market.\nActive in the local community, Trigg is an appointee of the Fulton County Blue Ribbon Justice Commission and instructs the Trial Techniques Program at Emory Law School. His civic engagement includes serving as Special Counsel to the City of Atlanta Ethics Board, as well as personal counsel to two City of Atlanta Mayors, two City of Atlanta City Council members, a Fulton County Commissioner, a Fulton County Sheriff, a Fulton County Attorney and three Fulton County judges.\nAbout Dentons\nDentons is the world's largest law firm, delivering quality and value to clients around the globe. Dentons is a leader on the Acritas Global Elite Brand Index, a BTI Client Service 30 Award winner and recognized by prominent business and legal publications for its innovations in client service, including founding Nextlaw Labs and the Nextlaw Global Referral Network. Dentons' polycentric approach and world-class talent challenge the status quo to advance client interests in the communities in which we live and work. www.dentons.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005075/en/\nDentons\nLisa Sachdev, 312-876-2476\nSenior Manager, Public Relations, US\nlisa.sachdev@dentons.com\nSource: Dentons", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.dentons.com&esheet=51749679&newsitemid=20180129005075&lan=en-US&anchor=www.dentons.com&index=1&md5=f5978bcf3b7ef7d3ee7a5da31f729988", "http://www.businesswire.com/news/home/20180129005075/en/"], "published": "2018-01-29T18:00:00.000+02:00", "crawled": "2018-01-29T19:28:06.000+02:00", "highlightTitle": ""}