{"organizations": [], "uuid": "3dbdf92bcfedbb86072326411bf90b7e5848e99e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/us-carillion-restructuring/britains-carillion-collapses-as-banks-refuse-to-lend-it-any-more-money-idUSKBN1F40P0", "country": "US", "domain_rank": 408, "title": "Britain's Carillion collapses as banks refuse to lend it any more money", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:28:00.000+02:00", "replies_count": 0, "uuid": "3dbdf92bcfedbb86072326411bf90b7e5848e99e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-carillion-restructuring/britains-carillion-collapses-as-banks-refuse-to-lend-it-any-more-money-idUSKBN1F40P0", "ord_in_thread": 0, "title": "Britain's Carillion collapses as banks refuse to lend it any more money", "locations": [], "entities": {"persons": [{"name": "monda", "sentiment": "negative"}, {"name": "philip green", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "carillion", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Carillion collapsed on Monday when its banks pulled the plug, triggering Britain’s biggest corporate failure in a decade and forcing the government to step in to guarantee public services from school meals to roadworks.\nThe 200-year-old business went into compulsory liquidation at 0600 GMT after costly contract delays and a slump in new business left it swamped by debt and pensions liabilities of at least 2.2 billion pounds ($3 billion).\nIts demise threatens to hurt smaller suppliers, merchants, rivals and Britain’s biggest banks. The British government was left to ensure there was no disruption to public services.\nThe collapse poses a headache for Theresa May’s government, which had employed Carillion to work on 450 projects including the building and maintenance of hospitals, schools, defense sites and a high-speed rail line.\nMay’s government also faced questions from the opposition Labour Party about why it awarded the company 1.3 billion pounds of state contracts after Carillion fell into financial difficulty in July last year.\n“In recent days we have been unable to secure the funding to support our business plan and it is therefore with the deepest regret that we have arrived at this decision,” Chairman Philip Green said.\nThe government’s priority is to ensure that public services are not disrupted, said David Lidington, the minister in charge of the Cabinet Office, which oversees the running of government.\nLidington urged Carillion staff to continue to work and said the government would pay the salaries of the company’s public sector workers. Workers on private sector contracts, however, will be paid by the government for only 48 hours.\nSome contracts handled by Carillion would in time go to alternative providers, he added.\nThe government stopped short, however, of bailing out the company as it did with major banks during the 2007-09 financial crisis.\nFIGHT FOR SURVIVAL Employing 43,000 people around the world, including 20,000 in Britain, Carillion has been fighting for survival since July, when it revealed it was losing cash on projects and had written down the value of its contract book by 845 million pounds.\nWith banks refusing in recent days to accept the latest restructuring plan, May’s senior ministers met around the clock, under pressure from the Labour Party and unions not to use taxpayer money to prop up the failing company.\nMinisters, top bankers and company bosses scrambled to find a way to save the company in last-ditch talks over the weekend.\nCarillion has committed debt facilities of about 1.6 billion pounds to banks including RBS, Santander UK, Lloyds, HSBC and Barclays. It has a pension deficit of 580 million pounds.\nWorkers at Carillion look out of a window after the company went into liquidation, in Wolverhampton, Britain, January 15, 2018. REUTERS/Darren Staples Spun out of Tarmac nearly 20 years ago and including construction names such as Wimpey and Alfred McAlpine, Carillion operates in Britain and Ireland, Canada, the Middle East and North Africa.\nIts projects include London’s Royal Opera House, the Channel Tunnel, the Copenhagen Metro, the Suez Canal road tunnel and Toronto’s Union Station.\nIn July last year, a week after its initial profit warning, it was named as one of the contractors on Britain’s new High Speed 2 rail line, a flagship project that will better connect London with the north of England.\nRichard Howson quit as CEO at the time of the profit warning after five years in the role. Its shares have lost more than 90 percent of their value over the past six months.\nAt its headquarters in Wolverhampton, central England, a handful of workers could be seen holding meetings.\nSlideshow (5 Images) Shares in rivals such as G4S, Interserve, Balfour Beatty and Kier Group advanced on hopes they would pick up some additional work.\nLEGACY CONTRACTS However, Balfour, which worked with Carillion on three British road projects, said the collapse would probably cost it between 35 and 45 million pounds.\nMany of Britain’s service providers have been hit in recent years after they took on work during the financial crisis at low prices for long-running fixed-rate contracts that have also proved problematic for groups that include Capita and Mitie and Interserve.\nBritain began outsourcing public services in the late 1980s under Margaret Thatcher and enjoyed a boom period under Labour’s Tony Blair and Gordon Brown. It is now the world’s second-largest outsourcing market behind the United states.\nBritain’s National Audit Office warned of risks in the sector in 2013, highlighting a government focus on what it called “short-term savings”.\nAndrew Wilkinson, a restructuring specialist at law firm Weil, said there was a serious issue about the pricing and profit recognition on long-term contracts.\n“The government pushes hard for cost savings and all these pressures build up,” he said. “It’s not a new thing, it’s happened before in this sector, but the shame of it here is this company didn’t move fast enough,” he told Reuters.\nRudi Klein, head of Britain’s Specialist Engineering Contractors’ Group, warned that the impact was likely to be felt by small contractors. He estimated Carillion had left a trail of 1.2 billion pounds in unpaid bills to thousands of small subcontractors.\nKlein said the scale of the industry’s exposure was not yet clear but he gave the examples of a small Northern Irish engineering contractor owed 150,000 pounds and a concrete frame manufacturer in northwest England owed 2 million pounds.\n“This can’t be allowed to happen again,” he said.\nAdditional reporting by Georgina Prodhan; Editing by Keith Weir and David Goodman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T15:28:00.000+02:00", "crawled": "2018-01-15T09:34:28.001+02:00", "highlightTitle": ""}