{"organizations": [], "uuid": "524257fd9404d4835ed26ac4031e8607da78bfb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/30/the-associated-press-the-latest-trump-says-us-will-triumph-over-opioid-crisis.html", "country": "US", "domain_rank": 767, "title": "The Latest: Trump says US will triumph over opioid crisis", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:25:00.000+02:00", "replies_count": 0, "uuid": "524257fd9404d4835ed26ac4031e8607da78bfb9"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/the-associated-press-the-latest-trump-says-us-will-triumph-over-opioid-crisis.html", "ord_in_thread": 0, "title": "The Latest: Trump says US will triumph over opioid crisis", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "ryan holets", "sentiment": "none"}, {"name": "holets", "sentiment": "none"}, {"name": "melania trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "albuquerque", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The Latest on President Donald Trump's State of the Union speech (all times local):\n10 p.m.\nPresident Donald Trump says he's committed to the \"long and difficult\" fight against the epidemic of opioid and drug addiction.\nHe is predicting in his State of the Union address that America ultimately will prevail over a crisis that claims 174 lives daily.\nTrump campaigned on the opioid issue and created a presidential advisory commission upon taking office. He recently declared the crisis a public health emergency, but the declaration did not come with additional funding.\nTrump also recognized special guest Ryan Holets, an Albuquerque, New Mexico, police officer who was seated in first lady Melania Trump's guest box.\nHolets and his wife adopted the baby of a pregnant, homeless woman he saw preparing to inject herself with heroin.\n9:45 p.m.\nPresident Donald Trump is calling on Congress to pass legislation to generate at least $1.5 trillion to upgrade the nation's roads, bridges and other infrastructure.\nTrump is using his State of the Union address to appeal to Republicans and Democrats to come together to provide the safe, fast, reliable and modern infrastructure that he says the economy needs to thrive and Americans deserve.\nThe president says every federal dollar should be leveraged by partnering with state and local governments, and tapping private-sector investment where appropriate.\nTrump says an infrastructure bill must also streamline the permitting and approval process, getting it down to no more than two years and perhaps even one.\n9:40 p.m.\nPresident Donald Trump is taking a softer approach to a highly charged issue in his State of the Union speech.\nTrump is using the story of 12-year-old Preston Sharp to drive home his case that Americans should stand for the national anthem.\nSharp organized a campaign to put flags on fallen veterans' graves.\nTrump says, \"Preston's reverence for those who have served our Nation reminds us why we salute our flag, why we put our hands on our hearts for the pledge of allegiance, and why we proudly stand for the national anthem.\"\nTrump has hurled harsh rhetoric against football players who knelt during the national anthem to protest racism and police brutality.\nTrump has said those players should be fired and called on fans to boycott their games.\n9:35 p.m.\nHalf the House chamber is boisterous and bouncing up and down for standing ovations during President Donald Trump's State of the Union address. The other half is somber and still, amid a sea of black clothes.\nIt is as if Republicans and Democrats are attending two separate events.\nRepublicans are applauding and cheering as Trump talks about making America great again, and his late 2017 victory revamping the tax code.\nDemocrats are barely reacting to Trump's remarks, though they did join in applause for emergency responders and veterans.\nAs Trump entered the chamber before his speech, nearly all Democrats were seated and quiet in less than 20 seconds. Democratic Rep. Bill Pascrell of New Jersey waved a pocket copy of the Constitution.\n9:33 p.m.\nPresident Donald Trump is telling the stories of ordinary people to help illustrate themes in his State of the Union address.\nTrump opened by highlighting Ashlee Leppert, a U.S. Coast Guard petty officer who was aboard one of the first helicopters on the scene in Houston during Hurricane Harvey. He mentioned firefighter David Dahlberg, who rescued dozens of children trapped in a California summer camp threatened by wildfires.\nTrump illustrated the tax cuts he signed into law last year by introducing small-business owners from Ohio. Trump said Steve Staub and Sandy Keplinger are giving out raises, hiring workers and expanding their business because of tax code changes.\nAnd then there's Preston Sharp from California. Trump lauded the 12-year-old for starting an effort to place U.S. flags on veterans' graves.\n9:30 p.m.\nPresident Donald Trump is celebrating a booming economy in his State of the Union address.\nTrump says 2.4 million jobs have been created since his election and says wages are going up.\nHe's talking up the unemployment rate and says the stock market \"has smashed one record after another, gaining $8 trillion in value.\"\nTrump is also promising that millions of Americans will be taking home more pay starting next month thanks to the \"massive\" tax cuts he signed into law at the end of 2017.\nRepublicans are looking for Trump to help convince the country that they've made progress while in charge ahead of the upcoming 2018 midterm elections.\n9:20 p.m.\nPresident Donald Trump says the state of the union is strong \"because our people are strong.\"\nAnd he adds that together \"we are building a safe, strong and proud America.\"\nTrump opened his first State of the Union address Tuesday night by recognizing the bravery of Americans who helped each other through a series of devastating hurricanes, wildfires and mass shootings during his first year in office.\nHe also paid tribute to House Majority Whip Steve Scalise. The Louisiana Republican was severely wounded last year when a gunman opened fire on Republican lawmakers as they practiced for an upcoming congressional baseball game.\n9:15 p.m.\nPresident Donald Trump is kicking off his State of the Union speech with recollections of the year past.\nTrump is talking about the hurricanes that devastated states including Florida and Texas, and the wildfires that ripped through Texas.\nHe says, \"We have shared in the heights of victory and the pains of hardship.\"\nHe's telling those affected by the devastation that \"we are with you\" and \"we will pull through together.\"\n9:10 p.m.\nThe parents of Otto Warmbier, the American student who died of injuries suffered in North Korean custody, are in the audience at the State of the Union.\nThat's according to a congressional source who requested anonymity because the invitation hadn't been announced.\nTrump was expected to pay tribute to Warmbier's parents, Fred and Cindy, during Tuesday's speech.\nTrump is trying to prevent North Korea from obtaining a nuclear weapon and the means to deliver one.\nWarmbier was imprisoned in North Korea for 17 months and died shortly after being returned to the U.S. He visited North Korea with a Chinese tourist company.\n9:06 p.m.\nThe White House says President Donald Trump has signed a new executive order to keep the U.S. military prison at Guantanamo Bay open.\nTrump said during his campaign that he wanted to keep Guantanamo open and \"load it up with some bad dudes.\" But the White House announcement just before Tuesday's State of the Union address marks a formal reversal of President Barack Obama's eight-year effort to close the detention center.\nThe order preserves military detention as a counterterrorism tool by keeping the prison open.\nPresident George W. Bush opened Guantanamo after Sept. 11 to hold and interrogate suspected enemy combatants. At its peak in 2003, it held about 680 detainees.\nBush transferred about 500 out before leaving office. Obama transferred 197 detainees out, leaving 41.\n9:05 p.m.\nPresident Donald Trump has arrived in the House chamber to deliver his first State of the Union address.\nCheers and applause rang out as Trump was introduced by the Sergeant at Arms.\nTrump shook hands with lawmakers, waved and pointed at some as he inched his way down the center aisle.\nNearly every Democratic lawmaker stopped clapping seconds after the president entered the chamber. Many remained seated.\nTrump accented his dark suit with a bright blue tie for the occasion.\n9 p.m.\nPresident Donald Trump's motorcade passed a group of protesters near the U.S. Capitol as the president traveled to the annual State of the Union address.\nAbout 100 protesters chanted near a location by the U.S. Botanical Gardens on Independence Avenue, a few blocks from the Capitol. Demonstrators held signs that said \"You're Fired,\" and the word L-I-A-R lit up in yellow lights.\nTrump's short motorcade ride took him around the Washington Monument and near the Tidal Basin with a view of the Jefferson Memorial in the distance.\n9 p.m.\nMelania Trump received a standing ovation as she entered the House chamber to take her seat for the State of the Union address.\nThe first lady — wearing a white Dior pantsuit — arrived at the Capitol before President Donald Trump, a change from last year, when they rode together in the limousine.\nMrs. Trump's spokeswoman, Stephanie Grisham, says the first lady went early to accompany guests whose stories amplify the president's agenda and who will sit in her guest box.\nThe first lady hadn't been seen in public with Trump since The Wall Street Journal reported this month that, in 2016, Trump's lawyer paid porn star Stormy Daniels $130,000 to keep quiet about an affair she had with Trump. Daniels issued a statement Tuesday denying the affair.\n8:55 p.m.\nDemocrats crowding the House chamber are letting buttons — and the color of their clothes — send messages.\nMany are wearing rectangular lapel buttons that say \"TIME'S UP,\" a statement against workplace sexual harassment. Several members of Congress have ended their careers lately over harassment allegations, and the buttons were distributed at a morning meeting of Democratic lawmakers.\nSome are wearing red buttons that say \"RECY.\" That is a tribute to Recy Taylor, a black woman from a rural Alabama sharecropping family who was gang-raped by six white men in 1944. No charges were brought despite confessions, but her case became a galvanizing force for the civil rights movement.\nVirtually all Democratic women are dressed in black, a show of support for the #MeToo movement.\n8:25 p.m.\nFirst lady Melania Trump has traveled to Capitol Hill separately from her husband, President Donald Trump, ahead of his State of the Union speech.\nThat's a change from last year, when the first couple made the trip up Pennsylvania Avenue in the same vehicle.\nMrs. Trump's spokeswoman, Stephanie Grisham, says the first lady went early, accompanying a group of guests for the speech whose stories amplify the president's agenda. Grisham says the first lady and Karen Pence held an \"intimate meet-and-greet\" at the Capitol for the guests. A White House official says Mrs. Trump is expected to ride back to the White House with her husband after the speech.\nMrs. Trump hadn't been seen in public with her husband since The Wall Street Journal reported earlier this month that in 2016, Trump's lawyer paid porn star Stormy Daniels $130,000 to keep quiet about an affair she said she had with the future president. Daniels on Tuesday issued a statement denying the affair happened.\n8:15 p.m.\nAn hour before President Donald Trump's big speech, the House chamber is beginning to fill with lawmakers eying prime seats and making small talk.\nRepublicans seem more intent on arriving early. The GOP side is filling steadily while Democrats are taking a bit more time getting to their posts. Indeed, about a dozen Democratic lawmakers have announced they won't be attending the speech.\nEarly arrivals include Republican Reps. Mark Walker of North Carolina, Gregg Harper of Mississippi and Louie Gohmert of Texas, all intent on securing an aisle seat and a chance to greet the president when he enters the House chamber and makes his way to the podium.\n8 p.m.\nMassachusetts Rep. Joe Kennedy III says it would be easy to dismiss the first year of President Donald Trump's presidency as \"chaos\" marked by partisanship and politics.\nBut Kennedy says Trump has caused serious problems for the American people, including proposals that target Muslims, transgendered people and others.\nKennedy is delivering the Democratic response to Trump's State of the Union address.\nIn excerpts released early, Kennedy says the Trump administration \"isn't just targeting the laws that protect us — they are targeting the very idea that we are all worthy of protection.\"\nIn apparent reference to Trump, Kennedy says \"bullies may land a punch\" and leave a mark but have \"never managed to match the strength and spirit of a people united in defense of their future.\"\n7:45 p.m.\nPresident Donald Trump is declaring a \"new American moment\" in his State of the Union address — but his former campaign foe, Hillary Clinton, declared one first.\n\"This is our New American Moment,\" Trump will say, touting the state of the economy, according to excerpts released by the White House. \"There has never been a better time to start living the American dream.\"\nIn a 2010 speech, then-Secretary of State Clinton told the Council on Foreign Relations that \"a new American moment\" was taking shape on the global stage, \"a moment when our global leadership is essential, even if we must often lead in new ways.\"\nIt's hardly the first time Trump has appropriated a slogan. \"Let's Make America Great Again\" was popularized in 1980 by Ronald Reagan's presidential campaign.\n6:50 p.m.\nAgriculture Secretary Sonny Perdue will skip Tuesday's State of the Union address, serving as the so-called \"designated survivor.\"\nA member of the presidential line of succession traditionally skips the address to the joint session of Congress and is safeguarded at an undisclosed location to ensure continuity of government in the event of a catastrophe. Usually, a lesser-known member of the president's Cabinet is selected — with higher-profile officials retained to applaud the president's speech from the floor of the House.\nThe Cold War-era ritual took on new significance after the attacks of September 11, 2001, as fears of terrorism replaced nuclear war as a top threat facing the nation.\nA designated high-ranking member of Congress also traditionally skips the speech to maintain the legislative branch's continuity plans.\n6:40 p.m.\nPresident Donald Trump will tell the American people that it is \"our new American moment\" and call on Republicans and Democrats to come together in his State of the Union speech.\nThat's according to excerpts released Tuesday evening by the White House.\nTrump will strike an optimistic and bipartisan tone, telling Americans he is \"extending an open hand to work with members of both parties, Democrats and Republicans, to protect our citizens, of every background, color and creed. \"\nHe'll also discuss the impact of the Republican tax overhaul, explain his administration's efforts to combat the Islamic State group and call on Congress to pass a major infrastructure investment plan.\n6:30 p.m.\nA handful of immigrants who have legally lived in the U.S. since disasters struck their countries years ago will attend President Donald Trump's State of the Union address as guests of Democratic lawmakers.\nThe immigrants benefit from temporary protections granted to people from countries ravaged by natural disasters or war.\nThe Trump administration has ended the temporary protection for El Salvador, Haiti and Nicaragua and will make a decision later this year for Honduras.\nDemocratic lawmakers want to put a face on immigration policy.\nNery Martinez, guest of Nevada Rep. Jacky Rosen, fled civil war in El Salvador and now lives in Las Vegas. Martinez says he'll be at the address to remind the president that temporary protection recipients are \"here to make this already great nation even greater.\"\n5:30 p.m.\nWhat has President Donald Trump learned in his first year as president? That you have to lead with \"heart.\"\nThat's what Trump told network news anchors during a pre-State of the Union lunch Tuesday.\nTrump says, \"You govern with all of the instincts of a businessperson, but you have to add much more heart and soul into your decisions than you would ever have even thought of before.\"\nThat's according to excerpts released by the White House.\nTrump also says issues like immigration would be \"so simple\" to solve if they were pure business matters, but he says he realizes that \"millions and millions of people\" are affected by his actions.\nHe adds that \"it's much different, in that way, than I thought it would be.\"\n4:30 p.m.\nFirst lady Melania Trump is promoting the guests she'll be sitting with at her husband's first State of the Union address.\nThe first lady tweeted Tuesday that she'll be joined at the speech \"by an honorable group of Americans,\" including \"heroes who have served our nation in times of need, families who have suffered at the hands of evil, and citizens who have embraced the American dream.\"\nMrs. Trump has been keeping a low profile following a report that adult film star Stormy Daniels had an affair with Donald Trump in 2006, shortly after he and the first lady wed.\nDaniels released a statement Tuesday saying the affair never happened.\n3:55 p.m.\nMany congressional Democrats are giving their guest passes for President Donald Trump's first State of the Union address to young immigrants known as \"Dreamers,\" who were brought to the U.S. illegally as children.\nMore than 20 Dreamers are expected in the House gallery Tuesday night to put a face on the toll of the congressional stalemate on immigration policy.\nThey are the guests of high-profile Democrats including House Minority Leader Nancy Pelosi and potential 2020 presidential candidates including New Jersey Sen. Cory Booker and California Sen. Kamala Harris.\nTrump ended Obama-era protections for such immigrants. He now says he wants to grant them a path to citizenship, but Congress has been unable to come up with a legislative solution for an issue at the center of the recent government shutdown.\n2:50 p.m.\nPresident Donald Trump has told news anchors from all the major TV networks at a White House lunch that he is striving to bring the country together.\nJournalists from outlets including PBS, CNN and Fox News say Trump told the group Tuesday that there is \"tremendous divisiveness\" in the country that has existed for years.\nHe says if he could unite the country, he would consider it a great achievement.\nThe lunch is an annual White House tradition ahead of the president's State of the Union address.\nFox News host Bret Baier said on the \"The Daily Briefing with Dana Perino\" that the lunch menu featured smoked tomato soup, thyme roasted chicken and orange merengue pudding. Baier says the rest of the lunch was off the record.\n12:30 p.m.\nFour of the Supreme Court's nine justices are expected to attend the State of the Union address.\nChief Justice John Roberts and Justices Stephen Breyer, Elena Kagan and Neil Gorsuch are expected at the speech. Roberts, Breyer and Kagan regularly attend, as do justices appointed by the president who is speaking. Trump nominated Gorsuch a year ago.\nAmong the justices who will not be in the audience, Clarence Thomas and Samuel Alito haven't attended a State of the Union speech in years. Alito last went in 2010, when he was captured on camera mouthing the words \"not true\" in response to President Barack Obama's criticism of the court's then new ruling in the Citizens United campaign finance case.\nJustice Anthony Kennedy's long-standing travel plans have him in California. Justice Ruth Bader Ginsburg is in Rhode Island and Justice Sonia Sotomayor is in Panama.\n12:18 p.m.\nPresident Donald Trump's top economic and national security advisers help with his State of the Union address.\nA White House official says national security adviser H.R. McMaster and economic adviser Gary Cohn contributed to the speech Trump plans to deliver Tuesday night at the Capitol. The official says they were assisted by policy adviser Stephen Miller, staff secretary Rob Porter and other speechwriters.\nThe official stressed that the speech is the president's and that Trump has spent months giving his aides \"tidbits\" on lines he wants to use.\nThe White House has said Trump will use the speech to discuss economy and national security, as well as trade, immigration and infrastructure.\nThe official was not authorized to discuss internal White House deliberations by name and spoke on condition of anonymity.\n1:27 a.m.\nPresident Donald Trump will herald a robust economy and push for bipartisan congressional action on immigration in Tuesday's State of the Union address.\nThe speech marks the ceremonial kickoff of Trump's second year in office and is traditionally a president's biggest platform to speak to the nation. However, Trump has redefined presidential communications with his high-octane, filter-free Twitter account and there's no guarantee that the carefully crafted speech will resonate beyond his next tweet.\nStill, White House officials are hopeful the president can use the prime-time address to Congress and millions of Americans watching at home to take credit for a soaring economy. Trump argues that the tax overhaul he signed into law late last year has boosted business confidence and will lead companies to reinvest in the United States.", "external_links": [], "published": "2018-01-30T19:25:00.000+02:00", "crawled": "2018-01-31T05:10:36.088+02:00", "highlightTitle": ""}