{"organizations": [], "uuid": "0bb99be7709118ebfb85fde9639bfaf67a3f6530", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/japan-economy-boj-lending/boj-to-extend-deadline-for-loan-schemes-to-spur-growth-sources-idUSL4N1P72CH", "country": "US", "domain_rank": 408, "title": "BOJ to extend deadline for loan schemes to spur growth - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T09:33:00.000+02:00", "replies_count": 0, "uuid": "0bb99be7709118ebfb85fde9639bfaf67a3f6530"}, "author": "", "url": "https://www.reuters.com/article/japan-economy-boj-lending/boj-to-extend-deadline-for-loan-schemes-to-spur-growth-sources-idUSL4N1P72CH", "ord_in_thread": 0, "title": "BOJ to extend deadline for loan schemes to spur growth - sources", "locations": [], "entities": {"persons": [{"name": "leika kihara", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "boj", "sentiment": "negative"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 7:34 AM / Updated 33 minutes ago BOJ to extend deadline for loan schemes to spur growth - sources Leika Kihara 3 Min Read \nTOKYO, Jan 12 (Reuters) - The Bank of Japan is expected to extend the deadline for loan programmes aimed at boosting lending to industries with growth potential, people familiar with the matter said, underscoring its resolve to keep supporting the economy with massive monetary stimulus. \nThe central bank’s nine-member board will make the decision at its rate review on Jan. 22-23, the sources said. \nThe move may help ease market jitters, triggered by a cut in the BOJ’s bond purchases on Tuesday, that the bank may withdraw its massive monetary support earlier than expected. \n“There’s solid demand for these programmes by banks, so there’s not much reason to discontinue them,” said one of the sources on condition of anonymity, a view echoed by another source. \nThe BOJ has two cheap loan schemes for financial institutions - one aimed at boosting bank lending to industries with growth potential and another programme under which it offers four-year loans at zero interest for banks that increase overall lending. \nThe BOJ will extend the March 2018 deadline for these programmes given solid demand from financial institutions, the sources said. \nThe BOJ has extended the deadlines for these programmes several times, usually by about a year, to prompt risk-shy financial institutions to shift money out of safe-haven government bonds into lending. \nThe schemes are separate from the BOJ’s main asset-buying programme dubbed “quantitative and qualitative easing” (QQE), under which it pumps money into the economy via purchases of government bonds and risky assets. \nTo encourage banks to use the lending programmes, the BOJ exempts funds procured from the schemes from a 0.1 percent negative interest it charges to excess reserves financial institutions park with the central bank. \nLending by Japanese financial institutions rose 2.5 percent in January from a year earlier on robust fund demand for mergers and acquisitions and property investment. \nThat has led more banks to tap the BOJ’s programmes, offering some hope the flood of cash printed by the central bank is finally making its way into the broader economy. \nOne of the key objectives of premier Shinzo Abe’s “Abenomics” stimulus policies is to boost Japan’s growth potential with reforms so that companies increase spending on prospects of a stronger economy. (Editing by Sam Holmes)", "external_links": [], "published": "2018-01-12T09:33:00.000+02:00", "crawled": "2018-01-12T09:56:57.003+02:00", "highlightTitle": ""}