{"organizations": [], "uuid": "bee8b0bd8539febfc5fa82d09d0ba139315ababc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-xerox-reports-strong-fourth-quarter-2017-results-delivers-on-full-year-commitments.html", "country": "US", "domain_rank": 767, "title": "Xerox Reports Strong Fourth-Quarter 2017 Results; Delivers on Full-Year Commitments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T11:00:00.000+02:00", "replies_count": 0, "uuid": "bee8b0bd8539febfc5fa82d09d0ba139315ababc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-xerox-reports-strong-fourth-quarter-2017-results-delivers-on-full-year-commitments.html", "ord_in_thread": 0, "title": "Xerox Reports Strong Fourth-Quarter 2017 Results; Delivers on Full-Year Commitments", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}, {"name": "norwalk", "sentiment": "none"}], "organizations": [{"name": "xerox", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Total revenue of $2.7 billion, up 0.5 percent or down 2.0 percent in constant currency year-over-year Equipment sale revenue up 4.3 percent or 1.5 percent in constant currency year-over-year Adjusted operating margin of 14.4 percent, up 0.2 points year-over-year Operating cash flow, both GAAP and adjusted, at high-end of guidance ranges Second-year savings from Strategic Transformation program above target Estimated non-cash charge of $400 million associated with the enactment of U.S. tax reform resulted in GAAP loss of 78 cents per share Adjusted EPS of $1.04, up 4 cents year-over-year Provides full-year 2018 GAAP EPS guidance of $2.30 to $2.50 and adjusted EPS of $3.50 to $3.70\nNORWALK, Conn.--(BUSINESS WIRE)-- Xerox (NYSE: XRX) today announced its fourth-quarter 2017 financial results that reflect meaningful improvements in revenue, operating margin and earnings.\n“One year ago, I told the market that to position Xerox for long-term success and deliver shareholder value, we would focus on the growth areas in our industry to improve our revenue trajectory while continuing with our Strategic Transformation initiatives to increase our profitability and margins,” said Xerox CEO Jeff Jacobson . “With positive results across all metrics, our fourth-quarter performance clearly demonstrates the progress we have made and enabled us to deliver on our commitments for the full-year.”\nJacobson added, “Building on the positive momentum from 2017, today we announced an agreement to combine with Fuji Xerox to create a world leader in innovative print technologies and intelligent work solutions. The new company expands the long-standing relationship between Xerox and Fujifilm, and will be better positioned to meet customer expectations and deliver incremental value to our shareholders.”\nFourth Quarter 2017 Results\nIn the fourth quarter, Xerox recorded an estimated non-cash charge of $400 million related to the enactment of the U.S. Tax Cuts and Jobs Act (U.S. tax reform). Including this charge, the company had a fourth-quarter 2017 GAAP loss from continuing operations of 78 cents per share. Adjusted earnings per share (EPS) was $1.04, up 4 cents year-over-year and excludes $1.82 per share of after-tax costs related to the amortization of intangibles, restructuring and related costs, certain retirement-related costs, and other discrete adjustments including a $1.55 per share charge associated with the enactment of U.S. tax reform.\nRevenues were $2.7 billion in the quarter, up 0.5 percent or down 2.0 percent in constant currency. The successful launch of new products earlier in the year helped drive equipment sale revenue growth of 4.3 percent or 1.5 percent in constant currency. Post sale revenue was 75 percent of total revenue.\nFourth-quarter adjusted operating margin was 14.4 percent, up 0.2 points year-over-year.\nEPS from\ncontinuing\noperations\nGross\nMargin\nSAG as % of\nRevenue\nEffective\nTax\nRate\nGAAP $(0.78)* 39.6% 24.6% 196.5%* Better/(Worse) Year-over-Year $(1.48)* (0.4) pts (1.2) pts (186.4) pts* Adjusted $1.04 40.4% 23.2% 26.2% Better/(Worse) Year-over-Year $0.04 0.1 pts (0.1) pts (5.1) pts *Includes an estimated charge of $400 million associated with the enactment of U.S. tax reform.\nIncluding the previously announced $350 million impact from the termination of certain accounts receivable sales programs, operating cash flow from continuing operations was a $28 million use of cash. On an adjusted basis, operating cash flow from continuing operations was $322 million. Cash balance at the end of 2017 was $1.3 billion. The company returned $68 million in dividends to shareholders in the quarter.\nFull Year 2017 Results\nTotal revenue of $10.3 billion, down 4.7 percent and in line with the company’s guidance of down mid-single digits Adjusted operating margin of 12.8 percent, up 0.3 points and within the expected range of 12.5 to 13.5 percent Strategic Transformation cost savings of $680 million, above the $600 million target Including the previously announced $500 million in incremental U.S. pension contributions and $350 million impact from the termination of certain accounts receivable sales programs, operating cash flow from continuing operations of $122 million. Adjusted operating cash flow from continuing operations of $972 million. Including estimated non-cash charge of $400 million associated with the enactment of U.S. tax reform, GAAP EPS from continuing operations of $0.70 Adjusted EPS of $3.48 cents, exceeded the company’s guidance range of $3.28 to $3.44\nFull Year 2018 Guidance\nThe company expects continued progress in 2018, as projected in its financial guidance. Xerox expects 2018 GAAP earnings from continuing operations of $2.30 to $2.50 per share and adjusted EPS of $3.50 to $3.70.\nThe company expects its revenue trajectory to improve, declining 2 to 4 percent at constant currency. 2018 adjusted operating margin is expected to expand and be in the range of 13 to 14 percent.\nXerox expects to generate operating cash flow from continuing operations of $900 to $1,100 million and free cash flow from continuing operations of $750 to $950 million.\nConference Call Details\nXerox will be hosting a conference call today at 8:00 a.m. ET. The live event can be accessed online at https://edge.media-server.com/m6/p/7ffthvi5 .\nAn archived audio webcast of this event will be available shortly following the conference call.\nAbout Xerox\nXerox Corporation is a technology leader that innovates the way the world communicates, connects and works. We understand what’s at the heart of sharing information - and all of the forms it can take. We embrace the integration of paper and digital, the increasing requirement for mobility, and the need for seamless integration between work and personal worlds. Every day, our innovative print technologies and intelligent work solutions help people communicate and work better. Discover more at www.xerox.com and follow us on Twitter at @Xerox .\nNon-GAAP Measures:\nThis release refers to the following non-GAAP financial measures for the fourth-quarter 2017, full-year 2017 and full-year 2018 guidance:\nAdjusted EPS, which excludes the amortization of intangibles, restructuring and related costs, certain retirement-related costs and other discrete adjustments including the impacts from the U.S. Tax Cuts and Jobs Act. Adjusted operating margin, which excludes Other expenses, net in addition to the EPS adjustments noted above and includes equity income. Adjusted gross margin and SAG (selling, administrative and general) as a percent of revenue, which excludes certain retirement-related costs. Adjusted effective tax rate, which excludes the EPS adjustments noted above. Constant currency revenue growth, which excludes the effects of currency translation. Adjusted operating cash flow, which exclude the incremental U.S. pension contributions and the impact from eliminating certain accounts receivable sales programs. Free cash flow, which is cash flow from continuing operations less capital expenditures including internal use software.\nRefer to the “Non-GAAP Financial Measures” section of this release for a discussion of these non-GAAP measures and their reconciliation to the reported GAAP measure.\nAdditional Information and Where to Find It\nThis release may be deemed to be solicitation material in respect of the transactions with FUJIFILM Holdings Corporation (“Fujifilm”) described herein (the “Transactions”) and/or the matters to be considered at the Company’s 2018 Annual Meeting of Shareholders. In connection with the Transactions and the 2018 Annual Meeting, Xerox plans to file with the Securities and Exchange Commission (“SEC”) and furnish to Xerox’s shareholders one or more proxy statements and other relevant documents. BEFORE MAKING ANY VOTING DECISION, XEROX’S SHAREHOLDERS ARE URGED TO READ THE PROXY STATEMENT(S) IN THEIR ENTIRETY WHEN THEY BECOME AVAILABLE AND ANY OTHER DOCUMENTS TO BE FILED WITH THE SEC IN CONNECTION WITH THE TRANSACTIONS AND/OR THE COMPANY’S 2018 ANNUAL MEETING OR INCORPORATED BY REFERENCE IN THE PROXY STATEMENTS BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE TRANSACTIONS AND/OR THE COMPANY’S 2018 ANNUAL MEETING AND THE PARTIES RELATED THERETO. Xerox’s shareholders will be able to obtain a free copy of documents filed with the SEC at the SEC’s website at http://www.sec.gov . In addition, Xerox’s shareholders may obtain a free copy of Xerox’s filings with the SEC from Xerox’s website at http://www.xerox.com under the heading “Investor Relations” and then under the heading “SEC Filings.”\nParticipants in the Solicitation\nThe directors, executive officers and certain other members of management and employees of Xerox may be deemed “participants” in the solicitation of proxies from shareholders of Xerox in favor of the Transactions or in connection with the matters to be considered at the Company’s 2018 Annual Meeting. Information regarding the persons who may, under the rules of the SEC, be considered participants in the solicitation of the shareholders of Xerox in connection with the Transactions or the Company’s 2018 Annual Meeting will be set forth in the applicable proxy statement and other relevant documents to be filed with the SEC. You can find information about Xerox’s executive officers and directors in Xerox’s Annual Report on Form 10-K for the fiscal year ended December 31, 2016, Xerox’s and such persons’ other filings with the SEC and in Xerox’s definitive proxy statement filed with the SEC on Schedule 14A.\nCautionary Statement Regarding Forward-Looking Statements\nThis release, and other written or oral statements made from time to time by management contain “forward-looking statements” as defined in the Private Securities Litigation Reform Act of 1995. The words “anticipate”, “believe”, “estimate”, “expect”, “intend”, “will”, “should” and similar expressions, as they relate to us, are intended to identify forward-looking statements. These statements reflect management’s current beliefs, assumptions and expectations and are subject to a number of factors that may cause actual results to differ materially. Such factors include but are not limited to: our ability to address our business challenges in order to reverse revenue declines, reduce costs and increase productivity so that we can invest in and grow our business; changes in economic and political conditions, trade protection measures, licensing requirements and tax laws in the United States and in the foreign countries in which we do business; changes in foreign currency exchange rates; our ability to successfully develop new products, technologies and service offerings and to protect our intellectual property rights; the risk that multi-year contracts with governmental entities could be terminated prior to the end of the contract term and that civil or criminal penalties and administrative sanctions could be imposed on us if we fail to comply with the terms of such contracts and applicable law; the risk that partners, subcontractors and software vendors will not perform in a timely, quality manner; actions of competitors and our ability to promptly and effectively react to changing technologies and customer expectations; our ability to obtain adequate pricing for our products and services and to maintain and improve cost efficiency of operations, including savings from restructuring actions; the risk that individually identifiable information of customers, clients and employees could be inadvertently disclosed or disclosed as a result of a breach of our security systems; reliance on third parties, including subcontractors, for manufacturing of products and provision of services; our ability to manage changes in the printing environment and expand equipment placements; interest rates, cost of borrowing and access to credit markets; funding requirements associated with our employee pension and retiree health benefit plans; the risk that our operations and products may not comply with applicable worldwide regulatory requirements, particularly environmental regulations and directives and anti-corruption laws; the outcome of litigation and regulatory proceedings to which we may be a party; the risk that we do not realize all of the expected strategic and financial benefits from the separation and spin-off of our Business Process Outsourcing business; the effects on our business resulting from actions of activist shareholders; and other factors that are set forth in the “Risk Factors” section, the “Legal Proceedings” section, the “Management’s Discussion and Analysis of Financial Condition and Results of Operations” section and other sections of our Quarterly Reports on Form 10-Q for the quarters ended March 31, 2017, June 30, 2017 and September 30, 2017 and our 2016 Annual Report on Form 10-K, as well as our Current Reports on Form 8-K filed with the SEC. Furthermore, the actual results of the Transactions could vary materially as a result of a number of factors, including, but not limited to: (i) the risk that the transactions may not be completed in a timely manner or at all, which may adversely affect Xerox’s business and the price of Xerox’s common stock, (ii) the failure to satisfy the conditions to the consummation of the transactions, including the receipt of certain approvals from Xerox’s shareholders and certain governmental and regulatory approvals, (iii) the parties may be unable to achieve expected synergies and operating efficiencies in the transactions within the expected time frames or at all, (iv) the transactions may not result in the accretion to Xerox’s earnings or other benefits, (v) the occurrence of any event, change or other circumstance that could give rise to the termination of the transaction agreements, (vi) the effect of the announcement or pendency of the transactions on Xerox’s and/or Fujifilm business relationships, operating results, and business generally, risks related to the proposed transactions disrupting Xerox’s current plans and operations and potential difficulties in Xerox’s employee retention as a result of the transactions, (vii) risks related to diverting management's attention from Xerox’s ongoing business operations, (viii) the outcome of any legal proceedings that may be instituted against Xerox, its officers or directors related to the transaction agreements or the transactions and (ix) the possibility that competing offers or acquisition proposals for Xerox will be made. Xerox assumes no obligation to update any forward-looking statements as a result of new information or future events or developments, except as required by law.\nFuji Xerox Co., Ltd. (“Fuji Xerox”) is a joint venture between Xerox Corporation and Fujifilm in which Xerox holds a noncontrolling 25% equity interest and Fujifilm holds the remaining equity interest. In April 2017, Fujifilm formed an independent investigation committee (“IIC”) to primarily conduct a review of the appropriateness of the accounting practices at Fuji Xerox’s New Zealand subsidiary and at other subsidiaries. The IIC completed its review during the second quarter 2017 and identified aggregate adjustments to Fuji Xerox’s financial statements of approximately JPY 40 billion (approximately $360 million) primarily related to misstatements at Fuji Xerox’s New Zealand and Australian subsidiaries. We determined that our share of the total adjustments identified as part of the investigation was approximately $90 million and impacted our fiscal years 2009 through 2017. We concluded that we should revise our previously issued annual and interim consolidated financial statements for 2014, 2015 and 2016 and the first quarter of 2017 the next time they are filed. Our review of this matter has been completed. However, Fujifilm and Fuji Xerox continue to review Fujifilm’s oversight and governance of Fuji Xerox as well as Fuji Xerox’s oversight and governance over its businesses in light of the findings of the IIC. At this time, we can provide no assurances relative to the outcome of any potential governmental investigations or any consequences thereof that may happen as a result of this matter.\nNote: To receive RSS news feeds, visit https://www.news.xerox.com . For open commentary, industry perspectives and views, visit http://twitter.com/xerox , http://connect.blogs.xerox.com , http://www.facebook.com/XeroxCorp , https://www.instagram.com/xerox/ , http://www.linkedin.com/company/xerox , http://www.youtube.com/XeroxCorp .\nXerox ® and Xerox and Design ® are trademarks of Xerox in the United States and/or other countries.\nXerox Corporation\nCondensed Consolidated Statements of (Loss) Income (Unaudited)\nThree Months Ended\nDecember 31, Year Ended\nDecember 31, (in millions, except per-share data) 2017 2016 2017 2016 Revenues Sales $ 1,146 $ 1,133 $ 4,073 $ 4,319 Services, maintenance and rentals 1,530 1,524 5,898 6,127 Financing 71 77 294 325 Total Revenues 2,747 2,734 10,265 10,771 Costs and Expenses Cost of sales 711 700 2,491 2,657 Cost of services, maintenance and rentals 914 909 3,580 3,725 Cost of financing 34 31 133 128 Research, development and engineering expenses 114 113 446 476 Selling, administrative and general expenses 676 639 2,631 2,695 Restructuring and related costs 24 92 220 264 Amortization of intangible assets 12 14 53 58 Other expenses, net 36 57 141 200 Total Costs and Expenses 2,521 2,555 9,695 10,203 Income before Income Taxes & Equity Income (1) 226 179 570 568 Income tax expense 444 18 481 62 Equity in net income of unconsolidated affiliates 25 27 115 127 (Loss) Income from Continuing Operations (193 ) 188 204 633 Income (loss) from discontinued operations, net of tax 6 (1,028 ) 3 (1,093 ) Net (Loss) Income (187 ) (840 ) 207 (460 ) Less: Net income attributable to noncontrolling interests 3 3 12 11 Net (Loss) Income Attributable to Xerox $ (190 ) $ (843 ) $ 195 $ (471 ) Amounts Attributable to Xerox: Net (loss) income from continuing operations $ (196 ) $ 185 $ 192 $ 622 Income (loss) from discontinued operations, net of tax 6 (1,028 ) 3 (1,093 ) Net (Loss) Income Attributable to Xerox $ (190 ) $ (843 ) $ 195 $ (471 ) Basic (Loss) Earnings per Share (2) : Continuing operations $ (0.78 ) $ 0.71 $ 0.70 $ 2.36 Discontinued operations 0.02 (4.06 ) 0.01 (4.31 ) Total Basic (Loss) Earnings per Share $ (0.76 ) $ (3.35 ) $ 0.71 $ (1.95 ) Diluted (Loss) Earnings per Share (2) : Continuing operations $ (0.78 ) $ 0.70 $ 0.70 $ 2.33 Discontinued operations 0.02 (4.00 ) 0.01 (4.26 ) Total Diluted (Loss) Earnings per Share $ (0.76 ) $ (3.30 ) $ 0.71 $ (1.93 )\n(1) Referred to as “Pre-Tax (Loss) Income” throughout the remainder of this document.\n(2) Reflects our one-for-four reverse stock split that became effective on June 14, 2017. See \"Financial Review\" section.\nXerox Corporation\nCondensed Consolidated Statements of Comprehensive (Loss) Income (Unaudited)\nThree Months Ended\nDecember 31, Year Ended\nDecember 31, (in millions) 2017 2016 2017 2016 Net (loss) income $ (187 ) $ (840 ) $ 207 $ (460 ) Less: Net income attributable to noncontrolling interests 3 3 12 11 Net (Loss) Income Attributable to Xerox (190 ) (843 ) 195 (471 ) Other Comprehensive (Loss) Income, Net: Translation adjustments, net (8 ) (433 ) 483 (347 ) Unrealized gains (losses), net 5 (39 ) 1 (15 ) Changes in defined benefit plans, net 150 233 106 126 Other Comprehensive Income (Loss), Net 147 (239 ) 590 (236 ) Less: Other comprehensive (loss) income, net attributable to noncontrolling interests — (2 ) 1 (3 ) Other Comprehensive Income (Loss), Net Attributable to Xerox 147 (237 ) 589 (233 ) Comprehensive (Loss) Income, Net (40 ) (1,079 ) 797 (696 ) Less: Comprehensive income, net attributable to noncontrolling interests 3 1 13 8 Comprehensive (Loss) Income, Net Attributable to Xerox $ (43 ) $ (1,080 ) $ 784 $ (704 ) Xerox Corporation\nCondensed Consolidated Balance Sheets (Unaudited)\n(in millions, except share data in thousands) December 31, 2017 December 31, 2016 Assets Cash and cash equivalents $ 1,293 $ 2,223 Accounts receivable, net 1,357 961 Billed portion of finance receivables, net 112 90 Finance receivables, net 1,317 1,256 Inventories 915 841 Assets of discontinued operations — 1,002 Other current assets 236 619 Total current assets 5,230 6,992 Finance receivables due after one year, net 2,323 2,398 Equipment on operating leases, net 454 475 Land, buildings and equipment, net 629 660 Investments in affiliates, at equity 1,404 1,294 Intangible assets, net 268 290 Goodwill 3,930 3,787 Deferred tax assets, long-term 1,026 1,472 Other long-term assets 682 683 Total Assets $ 15,946 $ 18,051 Liabilities and Equity Short-term debt and current portion of long-term debt $ 282 $ 1,011 Accounts payable 1,108 1,126 Accrued compensation and benefits costs 444 420 Liabilities of discontinued operations — 1,002 Other current liabilities 907 1,095 Total current liabilities 2,741 4,654 Long-term debt 5,235 5,305 Pension and other benefit liabilities 1,595 2,240 Post-retirement medical benefits 662 698 Other long-term liabilities 206 193 Total Liabilities 10,439 13,090 Convertible Preferred Stock 214 214 Common stock 255 254 Additional paid-in capital 3,893 3,858 Retained earnings 4,856 4,934 Accumulated other comprehensive loss (3,748 ) (4,337 ) Xerox shareholders’ equity 5,256 4,709 Noncontrolling interests 37 38 Total Equity 5,293 4,747 Total Liabilities and Equity $ 15,946 $ 18,051 Shares of common stock issued and outstanding 254,613 253,594 Xerox Corporation\nCondensed Consolidated Statements of Cash Flows (Unaudited )\nThree Months Ended\nDecember 31, Year Ended\nDecember 31, (in millions) 2017 2016 2017 2016 Cash Flows from Operating Activities: Net (loss) income $ (187 ) $ (840 ) $ 207 $ (460 ) (Income) loss from discontinued operations, net of tax (6 ) 1,028 (3 ) 1,093 (Loss) income from continuing operations (193 ) 188 204 633 Adjustments required to reconcile net (loss) income to cash flows from operating activities: Depreciation and amortization 128 137 527 563 Provision for receivables 8 4 46 43 Provision for inventory 6 7 27 28 Net gain on sales of businesses and assets (1 ) (2 ) (15 ) (22 ) Undistributed equity in net income of unconsolidated affiliates 38 (9 ) (18 ) (75 ) Stock-based compensation 13 19 52 50 Restructuring and asset impairment charges 23 76 201 230 Payments for restructurings (55 ) (35 ) (224 ) (118 ) Defined benefit pension cost 61 19 194 127 Contributions to defined benefit pension plans (119 ) (76 ) (836 ) (178 ) (Increase) decrease in accounts receivable and billed portion of finance receivables (355 ) 22 (529 ) (151 ) Collections of deferred proceeds from sales of receivables 56 55 213 246 Decrease (increase) in inventories 118 111 (69 ) 7 Increase in equipment on operating leases (62 ) (64 ) (217 ) (268 ) (Increase) decrease in finance receivables (47 ) (12 ) 162 126 Collections on beneficial interest from sales of finance receivables 8 4 21 24 Decrease (increase) in other current and long-term assets 29 53 (17 ) 82 (Decrease) increase in accounts payable and accrued compensation (38 ) 6 (42 ) (244 ) (Decrease) increase in other current and long-term liabilities (62 ) 31 (15 ) (51 ) Net change in income tax assets and liabilities 446 (18 ) 410 (191 ) Net change in derivative assets and liabilities (15 ) (30 ) 75 (30 ) Other operating, net (15 ) (24 ) (28 ) 187 Net cash (used in) provided by operating activities of continuing operations (28 ) 462 122 1,018 Net cash provided by (used in) operating activities of discontinued operations 9 111 (88 ) 77 Net cash (used in) provided by operating activities (19 ) 573 34 1,095 Cash Flows from Investing Activities: Cost of additions to land, buildings and equipment (24 ) (28 ) (69 ) (93 ) Proceeds from sales of land, buildings and equipment 1 2 3 25 Cost of additions to internal use software (11 ) (11 ) (36 ) (45 ) Proceeds from sale of businesses — — 20 — Acquisitions, net of cash acquired (11 ) (13 ) (87 ) (30 ) Other investing, net 130 (9 ) 138 (3 ) Net cash provided by (used in) investing activities of continuing operations 85 (59 ) (31 ) (146 ) Net cash used in investing activities of discontinued operations — (77 ) — (251 ) Net cash provided by (used in) investing activities 85 (136 ) (31 ) (397 ) Cash Flows from Financing Activities: Net (payments) proceeds on debt (486 ) 884 (822 ) 925 Common stock dividends (64 ) (79 ) (274 ) (307 ) Preferred stock dividends (4 ) (6 ) (17 ) (24 ) Proceeds from issuances of common stock — 3 — 9 Repurchases related to stock-based compensation — (1 ) (15 ) (1 ) Payments to noncontrolling interests (1 ) (4 ) (18 ) (17 ) Other financing, net — — 161 (1 ) Net cash (used in) provided by financing activities (555 ) 797 (985 ) 584 Effect of exchange rate changes on cash and cash equivalents 1 (39 ) 52 (30 ) Increase in cash of discontinued operations — (247 ) — (257 ) (Decrease) increase in cash and cash equivalents (488 ) 948 (930 ) 995 Cash and cash equivalents at beginning of period 1,781 1,275 2,223 1,228 Cash and Cash Equivalents at End of Period $ 1,293 $ 2,223 $ 1,293 $ 2,223 Financial Review\nTransaction to Combine Xerox and Fuji Xerox\nXerox Corporation and Fujifilm Holdings Corporation (“Fujifilm”) today announced that they have entered into a definitive agreement to combine Xerox and their longstanding Fuji Xerox joint venture. The combined company will be a global leader in innovative print technologies and intelligent work solutions. This proposed combination provides Xerox shareholders with significant cash at closing, as well as a substantial interest in the significantly stronger combined company. The transaction has been unanimously approved by the Board of Directors of both Fujifilm and Xerox. Additional information about this transaction can be found in the parties' joint release.\nCorrection of Fuji Xerox Misstatement in Prior Period Financial Statements\nFuji Xerox is a joint venture between Xerox Corporation and Fujifilm Holdings Corporation (“Fujifilm”) in which Xerox holds a noncontrolling 25% equity interest and Fujifilm holds the remaining equity interest. In April 2017, Fujifilm publicly announced it had formed an independent investigation committee (IIC) to conduct a review of the appropriateness of the accounting practices at Fuji Xerox’s New Zealand subsidiary related to the recovery of receivables associated with certain bundled leasing transactions that occurred in, or prior to, Fuji Xerox’s fiscal year ending March 31, 2016. The IIC’s review, completed during the second quarter 2017, identified total aggregate adjustments to Fuji Xerox’s prior period financial statements of approximately JPY 40 billion (approximately $360 million based on the Yen/U.S. Dollar spot exchange rate at March 31, 2017 of 111.89). The adjustments identified by the IIC primarily related to misstatements at Fuji Xerox’s New Zealand subsidiary as well as their Australian subsidiary and certain other adjustments. We determined that our cumulative share of the total adjustments identified as part of the IIC's investigation was approximately $90 million 1 and impacted our fiscal years 2009 through 2017.\nIn the second quarter 2017, we determined that the misstatements to our equity income in prior years and in first quarter 2017 resulting from the IIC’s review were immaterial to our previously issued financial statements. However, we concluded that the cumulative correction of these misstatements would have had a material effect on our current year consolidated financial statements. Accordingly, we will revise our previously issued annual and interim consolidated financial statements for 2014, 2015 and 2016 and the first quarter of 2017 the next time they are filed. Certain of the corrections discussed above affected periods prior to fiscal year 2014, and this effect was reflected as a cumulative, net of tax adjustment to reduce retained earnings as of January 1, 2014 by $69 million. Amounts throughout this release have been adjusted to incorporate the revised amounts, where applicable.\nReverse Stock Split\nAs a result of the spin-off of the company's Business Process Outsourcing (BPO) business, now Conduent Incorporated, Xerox's market capitalization was divided. Consequently, the company proposed a reverse stock split, which was intended to increase the per share trading price of Xerox common stock and to improve its liquidity and facilitate its trading. On May 23, 2017, the Board of Directors authorized the reverse stock split of outstanding Xerox common stock at a ratio of one-for-four shares, together with the proportionate reduction in the authorized shares of its common stock from 1,750,000,000 shares to 437,500,000 shares. Shareholder approval for the reverse stock split was obtained at the company's Annual Shareholders Meeting on May 23, 2017 and the reverse stock split became effective on June 14, 2017. At the effective time, every four shares of the company’s common stock that were issued and outstanding were automatically combined into one issued and outstanding share, without any change in par value of such shares. Accordingly, we reclassified $760 million from Common stock to Additional paid-in capital. The reverse stock split also correspondingly affected all outstanding Xerox equity awards and outstanding convertible securities.\nAll authorized, issued and outstanding stock and per share amounts contained within the accompanying Condensed Consolidated Financial Statements have been adjusted to reflect this reverse stock split for all prior periods presented.\nSeparation Update\nOn December 31, 2016, Xerox Corporation completed the separation of its BPO business from its Document Technology and Document Outsourcing (DT/DO) business (the “Separation”). The Separation was accomplished through the transfer of the BPO business into a new legal entity, Conduent Incorporated (\"Conduent\"), and then distributing one hundred percent (100%) of the outstanding common stock of Conduent to Xerox Corporation stockholders (the “Distribution”). Conduent is now an independent public company trading on the New York Stock Exchange (“NYSE”) under the symbol “CNDT”. As a result of the Separation and Distribution, the BPO business is presented as a discontinued operation and, as such, has been excluded from continuing operations for all periods presented.\nSegment Changes\nFollowing the separation of the BPO business, we realigned our operations to better manage the business and serve our customers and the markets in which we operate. In 2017, we transitioned to a geographic focus and are primarily organized from a sales perspective on the basis of “go-to-market” sales channels. These sales channels are structured to serve a range of customers for our products and services. As a result of this transition and change in structure, we concluded that we have one operating and reportable segment - the design, development and sale of document management systems and solutions. Our chief executive officer was identified as the chief operating decision maker (“CODM”). All of the company’s activities are interrelated, and each activity is dependent upon and supportive of the others, including product development, supply chain and back-office support services. In addition, all significant operating decisions, by management and the Board, are largely based upon an analysis of Xerox on a total Company basis, including assessments related to the company’s incentive compensation plans.\n(1) The difference between the aggregate revision to retained earnings and the $90 million impact at March 31, 2017 is primarily due to currency and the impact of adjustments recorded directly by Xerox in the first quarter 2017.\nRevenues\nThree Months Ended\nDecember 31, % of Total Revenue (in millions) 2017 2016 %\nChange\nCC %\nChange\n2017 2016 Equipment sales $ 682 $ 654 4.3% 1.5% 25% 24% Post sale revenue 2,065 2,080 (0.7)% (3.1)% 75% 76% Total Revenue $ 2,747 $ 2,734 0.5% (2.0)% 100% 100% Reconciliation to Condensed Consolidated Statements of (Loss) Income: Sales $ 1,146 $ 1,133 1.1% (1.1)% Less: Supplies, paper and other sales (464 ) (479 ) (3.1)% (4.8)% Equipment Sales (1) $ 682 $ 654 4.3% 1.5% Services, maintenance and rentals $ 1,530 $ 1,524 0.4% (2.2)% Add: Supplies, paper and other sales 464 479 (3.1)% (4.8)% Add: Financing 71 77 (7.8)% (10.6)% Post Sale Revenue (1) $ 2,065 $ 2,080 (0.7)% (3.1)% North America $ 1,601 $ 1,627 (1.6)% (2.1)% 58% 60% International 1,001 955 4.8% (1.2)% 36% 35% Other 145 152 (4.6)% (4.6)% 6% 5% Total Revenue (2) $ 2,747 $ 2,734 0.5% (2.0)% 100% 100% Memo: Managed Document Services (3) $ 913\n$ 883 3.4% 0.8% 33% 32%\nCC - Constant Currency (see \"Non-GAAP Financial Measures\" section).\n(1) Equipment sales revenue in 2016 has been revised to reclassify certain Global Imaging Systems IT-related equipment sales to other sales, which are included in Post sale revenue.\n(2) Refer to Appendix II for our Geographic Sales Channels and Product/Offering Definitions.\n(3) Excluding equipment revenue, Managed Document Services (MDS) was $768 million in fourth quarter 2017 and $743 million in fourth quarter 2016, representing an increase of 3.4% including a 2.6-percentage point favorable impact from currency.\nFourth quarter 2017 total revenue increased 0.5% as compared to fourth quarter 2016, with a 2.5-percentage point favorable impact from currency. Fourth quarter 2017 total revenue reflected the following:\nPost sale revenue decreased 0.7% as compared to fourth quarter 2016, with a 2.4-percentage point favorable impact from currency. Post sale revenue is comprised of the following: Services, maintenance and rentals revenue includes rental and maintenance revenue (including bundled supplies) as well as the post sale component of the document services revenue from our Managed Document Services (MDS) offerings, and revenues from our Communication and Marketing Solutions (CMS) offerings that transferred to Xerox from the BPO business upon Separation. These revenues increased 0.4%, with a 2.6-percentage point favorable impact from currency. The decline at constant currency 1 reflected lower signings and installs in prior periods and the continuing decline in page volumes. These declines were partially mitigated by $20 million of higher revenues associated with a licensing agreement along with higher revenue from MDS, developing markets and acquisitions within our Global Imaging business. Supplies, paper and other sales includes unbundled supplies and other sales. These revenues declined 3.1%, with a 1.7-percentage point favorable impact from currency. The decline at constant currency 1 was driven by lower network integration solutions sales from our Global Imaging business, while supplies revenues were flat compared to prior year despite continued declines in equipment manufacturer (OEM) supplies. Financing revenue is generated from financed equipment sale transactions. The 7.8% decline in these revenues reflected a declining finance receivables balance due to lower equipment sales in prior periods and included a 2.8-percentage point favorable impact from currency.\nThree Months Ended\nDecember 31,\n% of Equipment Sales (in millions) 2017 2016 %\nChange\nCC %\nChange\n2017 2016 Entry $ 100 $ 95 5.3% 4.1% 15% 15% Mid-range 410 401 2.2% (0.2)% 60% 61% High-end 161 150 7.3% 3.9% 23% 23% Other 11 8 NM NM 2% 1% Equipment Sales (1) $ 682 $ 654 4.3% 1.5% 100% 100%\nCC - Constant Currency (see \"Non-GAAP Financial Measures\" section).\n(1) Equipment sales revenue in 2016 has been revised to reclassify certain Global Imaging Systems IT-related equipment sales to other sales, which are included in Post sale revenue.\nEquipment sales revenue increased 4.3% as compared to fourth quarter 2016, with a 2.8-percentage point favorable impact from currency as well as the net benefits from the planned expansion of our U.S. channels. Revenue increased despite price declines of approximately 5% (which were in-line with our historic declines). The increase at constant currency 1 in entry sales reflected higher install activity associated with the new ConnectKey products partially offset by continued lower OEM activity and a higher mix of lower-end monochrome devices in developing markets. Mid-range declined modestly as a result of ongoing black-and-white revenue declines that reflected overall market trends, nearly offset by increased sales of our new ConnectKey products. The increase in high-end sales primarily reflected higher revenues from our continuous feed inkjet and iGen systems as well as demand for our recently launched Versant entry production color systems, partially offset by lower revenues from our black-and-white systems consistent with market decline trends.\nRevenue Metrics\nTotal Installs\nInstall activity includes Managed Document Services and Xerox-branded products shipped to Global Imaging Systems. Detail by product group (see Appendix II) is shown below:\nEntry 2\n32% increase in color multifunction devices, reflecting demand for recently launched products as well as the migration from printers to multifunction devices, consistent with market trends. 34% increase in black-and-white multifunction devices, driven largely by higher activity for low-end devices in developing markets.\nMid-Range 3\n14% increase in mid-range color installs, reflecting higher demand for recently launched products. 1% increase in mid-range black-and-white, as demand for recently launched products more than offset market trends.\nHigh-End 3\n5% decrease in high-end color systems, as growth from continuous feed inkjet color and the higher-end configurations of the recently launched Versant products was more than offset by lower installs of products at the lower-end of the high-end portfolio. 10% decrease in high-end black-and-white systems reflecting market trends.\nSignings\nSignings are defined as estimated future revenues from contracts signed during the period, including renewals of existing contracts. Our reported signings mostly represent those from our Enterprise deals, as we do not currently include signings from our growing partner print services offerings or those from our Global Imaging Systems channel. Total Contract Value (TCV) is the estimated total contractual revenue related to signed contracts; our signings expressed in TCV were as follows:\nThree Months Ended\nDecember 31,\nYear Ended\nDecember 31,\n(in millions) 2017 2016 %\nChange\nCC %\nChange\n2017 2016 %\nChange\nCC %\nChange\nSignings $ 953 $ 805 18.4% 20.0% $ 2,714 $ 2,734 (0.7)% 1.0%\nCC - Constant Currency (see \"Non-GAAP Financial Measures\" section).\nFourth quarter 2017 signings increased 18.4% from fourth quarter 2016, with a 1.6-percentage point unfavorable impact from currency, reflecting higher contribution from both new business and renewals. On a trailing twelve month (TTM) basis, signings decreased 0.7% from the comparable prior year period, with a 1.7-percentage point unfavorable impact from currency.\nNew business TCV increased 11.0% from fourth quarter 2016, with a 2.5-percentage point unfavorable impact from currency, consistent with the sales cycle progression of deals corresponding with the full roll-out of our new products, and favorably impacted by a depressed level of signings in the prior year period. On a TTM basis, new business TCV decreased 12.6% from the comparable prior year period, with a 2.0-percentage point unfavorable impact from currency. The full year performance reflects ongoing competitive pressure in the market as well as the timing of new products amplified by the longer sales cycles in this area of the business.\nRenewal rate\nRenewal rate is defined as the annual recurring revenue (ARR) on contracts that are renewed during the period as a percentage of ARR on all contracts for which a renewal decision was made during the period. Contract renewal rate for the fourth quarter and full year 2017 was 86% and 84%, respectively, and increased compared to our full year 2016 renewal rate of 82%.\nCosts, Expenses and Other Income\nSummary of Key Financial Ratios\nThe following is a summary of key financial ratios used to assess our performance:\nThree Months Ended December 31, Reported Adjusted (1) (in millions) 2017 2016 B/(W) 2017 2016 B/(W) Gross Profit $ 1,088 $ 1,094 $ (6 ) $ 1,111 $ 1,101 $ 10 RD&E 114 113 (1 ) 106 109 3 SAG 676 639 (37 ) 636 631 (5 ) Equipment Gross Margin 27.4 % 31.4 % (4.0) pts. N/A N/A N/A Post sale Gross Margin 43.6 % 42.7 % 0.9 pts. 44.7 % 43.1 % 1.6 pts. Total Gross Margin 39.6 % 40.0 % (0.4) pts. 40.4 % 40.3 % 0.1 pts. RD&E as a % of Revenue 4.1 % 4.1 % — 3.9 % 4.0 % 0.1 pts. SAG as a % of Revenue 24.6 % 23.4 % (1.2) pts. 23.2 % 23.1 % (0.1) pts. Pre-tax Income $ 226 $ 179 $ 47 N/A N/A N/A Pre-tax Income Margin 8.2 % 6.5 % 1.7 pts. N/A N/A N/A Adjusted Operating Profit N/A N/A N/A 395 388 7 Adjusted Operating Margin N/A N/A N/A 14.4 % 14.2 % 0.2 pts. Memo: Non-service retirement-related costs $ 62 $ 19 $ (43 ) N/A N/A N/A\n(1) See the “Non-GAAP Financial Measures” section for an explanation of the non-GAAP financial measure. In fourth quarter 2016, we began to include Equity in net income of unconsolidated affiliates in the calculation of adjusted operating income and margin. Prior periods have been restated accordingly to conform to current year presentation.\nPre-tax Income Margin\nFourth quarter 2017 pre-tax income margin of 8.2% increased 1.7-percentage points as compared to fourth quarter 2016. The increase was primarily driven by lower restructuring and related costs that reflect the phasing of our strategic transformation initiatives, as well as lower Other expenses, net largely reflecting lower interest expense. Productivity and savings from strategic transformation, along with higher licensing revenue, mitigated the impact of lower post sale revenue, unfavorable transaction currency and non-service retirement-related costs.\nAdjusted 1 Operating Margin\nFourth quarter 2017 adjusted 1 operating margin of 14.4% increased 0.2-percentage points as compared to fourth quarter 2016, reflecting productivity and savings from strategic transformation as well as higher licensing revenue, which more than offset the pace of post sale revenue decline and the impact of revenue generating and SAG investments along with adverse transaction currency of 0.3-percentage points. Adjusted 1 operating margin was also unfavorably impacted by higher compensation and benefit expense which was partially offset by the benefit from a change in estimate related to consumables usage by customers.\nGross Margin\nFourth quarter 2017 gross margin of 39.6% decreased by 0.4-percentage points compared to fourth quarter 2016. On an adjusted 1 basis, gross margin of 40.4% increased by 0.1-percentage points. This performance reflected cost productivity and savings from strategic transformation, along with higher licensing revenue, that were partially offset by adverse transaction currency of 0.3-percentage points and the mix of our revenues.\nFourth quarter 2017 equipment gross margin of 27.4% decreased 4.0-percentage points as compared to fourth quarter 2016, reflecting an unfavorable mix of our revenues as well as the impact of investments to support large account and channel sales and the impact of transaction currency, only partially offset by product cost productivity.\nFourth quarter 2017 post sale gross margin of 43.6% increased 0.9-percentage points as compared to fourth quarter 2016. On an adjusted 1 basis, post sale gross margin of 44.7% improved 1.6-percentage points, including an approximate 0.6-percentage point benefit from a change in estimate related to consumables usage by customers; the improvement also reflected savings from strategic transformation and higher licensing revenue, which more than offset the pace of revenue decline.\nResearch, Development and Engineering Expenses (RD&E)\nFourth quarter 2017 RD&E as a percentage of revenue of 4.1% was flat compared to fourth quarter 2016. On an adjusted 1 basis, RD&E was 3.9% of revenue and decreased 0.1-percentage points compared to fourth quarter 2016.\nRD&E of $114 million increased by $1 million compared to fourth quarter 2016. On an adjusted 1 basis, RD&E of $106 million decreased by $3 million; the reduction reflected savings from strategic transformation including restructuring savings and lower expenses as a result of the transfer of resources to Electronics for Imaging (EFI), a third party high-end print server supplier, and the sale of our Xerox Research Centre Europe in Grenoble, France, which was mainly dedicated to supporting the discontinued BPO business. We strategically coordinate our R&D investments with Fuji Xerox.\nSelling, Administrative and General Expenses (SAG)\nSAG as a percentage of revenue of 24.6% increased by 1.2-percentage points from fourth quarter 2016 primarily as a result of higher non-service retirement-related costs. On an adjusted 1 basis, SAG was 23.2% of revenue and increased 0.1-percentage points, reflecting the impact of lower revenues that were partially mitigated by productivity and cost savings from strategic transformation, including savings from restructuring.\nSAG of $676 million was $37 million higher than fourth quarter 2016. On an adjusted 1 basis, SAG of $636 million increased by $5 million, including an approximate $11 million unfavorable impact from currency. The reduction at constant currency 1 primarily reflected cost savings, including savings from restructuring, and lower incentives and marketing expenses; these savings were partially offset by higher compensation and benefit expenses as well as expenses from Global Imaging acquisitions. Bad debt expense of $3 million was $1 million higher than fourth quarter 2016 and remained at less than one percent of receivables.\nNon-Service Retirement-Related Costs\nNon-service retirement-related costs were $43 million higher than fourth quarter 2016, primarily due to higher losses from pension settlements.\nRestructuring and Related Costs\nRestructuring and related costs of $24 million for the fourth quarter 2017 included net restructuring and asset impairment charges of $23 million and $1 million of additional costs primarily related to professional support services associated with the implementation of the Strategic Transformation program.\nFourth quarter 2017 net restructuring and asset impairment charges of $23 million included $25 million of severance costs related to headcount reductions of approximately 500 employees worldwide, $1 million of lease cancellation charges and $7 million of asset impairment losses related to the closure of a manufacturing site in Latin America. Fourth quarter 2017 actions impacted several functional areas, with approximately 35% focused on gross margin improvements and approximately 60% on SAG reductions, with the remainder focused on RD&E optimization. These costs were partially offset by $10 million of net reversals for changes in estimated reserves from prior period initiatives.\nRestructuring and related costs of $92 million for the fourth quarter 2016 included net restructuring and asset impairment charges of $76 million and $16 million of additional costs primarily related to professional support services associated with the implementation of the Strategic Transformation program.\nFourth quarter 2016 net restructuring and asset impairment charges of $76 million included $57 million of severance costs related to headcount reductions of approximately 800 employees worldwide and $26 million of lease cancellation charges primarily related to early termination of the lease for our corporate airplane as a result of the elimination of our corporate aviation department. Fourth quarter 2016 actions impacted several functional areas, with approximately 36% focused on gross margin improvements and approximately 57% on SAG reductions, with the remainder focused on RD&E optimization. These costs were partially offset by $7 million of net reversals for changes in estimated reserves from prior period initiatives.\nThe restructuring reserve balance as of December 31, 2017 for all programs was $109 million, of which $106 million is expected to be spent over the next twelve months.\nDuring 2018, we expect to incur additional restructuring and related costs of approximately $200 million for actions and initiatives that have not yet been finalized. Approximately $40 million of the full year charge is expected to be recognized in the first quarter of the year.\nAmortization of Intangible Assets\nFourth quarter 2017 amortization of intangible assets of $12 million was $2 million lower than fourth quarter 2016.\nWorldwide Employment\nWorldwide employment was approximately 35,300 as of December 31, 2017 and decreased by approximately 2,300 from December 31, 2016. The reduction is primarily due to the impact of restructuring and productivity-related reductions partially offset by an increase of approximately 370 from acquisitions.\nOther Expenses, Net\nThree Months Ended\nDecember 31, (in millions) 2017 2016 Non-financing interest expense $ 30 $ 43 Interest income (2 ) — Gains on sales of businesses and assets (1 ) (2 ) Currency losses, net — 6 Loss on sales of accounts receivable 1 4 Loss on early extinguishment of debt 7 — All other expenses, net 1 6 Other expenses, net $ 36 $ 57 Non-financing interest expense\nFourth quarter 2017 non-financing interest expense of $30 million was $13 million lower than fourth quarter 2016. When combined with financing interest expense (Cost of financing), total interest expense declined by $10 million from fourth quarter 2016 primarily due to a lower debt balance reflecting debt repayments of approximately $1.3 billion in the first quarter 2017 partially offset by new debt issued in the third quarter 2017 to fund a $500 million voluntary contribution to our U.S. defined benefit pension plans; the decline also reflected lower average interest rates. See \"Debt and Customer Financing Activities\" for further details.\nLoss on early extinguishment of debt\nDuring the fourth quarter of 2017, we recorded a $7 million loss associated with the repayment of $475 million in Senior Notes. See \"Debt and Customer Financing Activities\" for further information.\nIncome Taxes\nFourth quarter 2017 effective tax rate was 196.5%. This rate includes our current estimated impact of the 2017 Tax Cuts and Jobs Act (the \"Tax Act\") which is discussed below. On an adjusted 1 basis, fourth quarter 2017 tax rate was 26.2%. This rate was lower than the U.S. statutory tax rate of 35% primarily due to foreign tax credits. The adjusted 1 effective tax rate excludes the tax impacts associated with the following charges: restructuring and related costs, amortization of intangible assets, non-service retirement-related costs and other discrete items including the impact of the Tax Act.\nFourth quarter 2016 effective tax rate was 10.1%. On an adjusted 1 basis, fourth quarter 2016 tax rate was 21.1%. Both rates were lower than the U.S. statutory tax rate primarily due to foreign tax credits resulting from anticipated dividends from our foreign subsidiaries and the geographic mix of our profits. The adjusted 1 effective tax rate excludes the tax impacts associated with the following charges: restructuring and related costs, amortization of intangible assets and non-service retirement-related costs.\nOur effective tax rate is based on nonrecurring events as well as recurring factors, including the taxation of foreign income. In addition, our effective tax rate will change based on discrete or other nonrecurring events that may not be predictable. Excluding the effects of intangibles amortization, restructuring and related costs, non-service retirement-related costs and other discrete items, we anticipate that our adjusted 1 effective tax rate will be approximately 24% to 27% for full year 2018.\nTax Cuts and Jobs Act (the “Tax Act”)\nOn December 22, 2017, the Tax Cuts and Jobs Act (the “Tax Act”) was enacted. The Tax Act significantly revises the U.S. corporate income tax system by, among other things, lowering the U.S. statutory corporate income tax rate from 35% to 21% and implementing a territorial tax system that includes a one-time transition tax on deemed repatriated earnings of foreign subsidiaries.\nDuring the fourth quarter 2017, we recorded an estimated non-cash charge of $400 million reflecting the impact associated with the provisions of the Tax Act based on currently available information. Approximately $165 million of the charge is related to the deemed repatriation tax, $135 million from the re-measurement of U.S. deferred tax assets and liabilities to the lower enacted statutory tax rate and the remainder associated with other tax liabilities resulting from anticipated distributions of our foreign earnings. As a consequence of the Tax Act, we now anticipate the distribution of our foreign earnings and no longer consider them indefinitely reinvested. Additionally, we expect to utilize our existing foreign tax credit carryforward to settle the estimated deemed repatriation tax.\nOur estimated charge incorporates assumptions made based on our current interpretation of the Tax Act as well as currently available information and may change, possibly materially, as we complete our analysis and receive additional clarification and implementation guidance. Changes in interpretations and assumptions as well as actions we may take as a result of the Tax Act may also impact this estimated charge.\nEquity in Net Income of Unconsolidated Affiliates\nEquity in net income of unconsolidated affiliates primarily reflects our 25% share of Fuji Xerox net income. Fourth quarter 2017 equity income of $25 million decreased by $2 million compared to fourth quarter 2016 including $1 million of higher year-over-year charges related to our share of Fuji Xerox after-tax restructuring and other charges. Other charges included audit and other fees associated with the independent investigation of Fuji Xerox's accounting practices.\nNet Income from Continuing Operations\nFourth quarter 2017 net loss from continuing operations attributable to Xerox was $196 million, or $0.78 per diluted share, which included an estimated non-cash charge of $400 million or $1.55 per diluted share impact for the provisions associated with the Tax Cuts and Jobs Act. See the “Income Taxes” section for further explanation.\nOn an adjusted 1 basis, net income from continuing operations attributable to Xerox was $274 million, or $1.04 per diluted share. Fourth quarter 2017 adjustments to net income included the amortization of intangible assets, restructuring and related costs, non-service retirement-related costs, as well as other discrete, unusual or infrequent items as described in our Non-GAAP Financial Measures sections.\nFourth quarter 2016 net income from continuing operations attributable to Xerox was $185 million, or $0.70 per diluted share. On an adjusted 1 basis, net income from continuing operations attributable to Xerox was $264 million, or $1.00 per diluted share. Fourth quarter 2016 adjustments to net income include the amortization of intangible assets, restructuring and related costs, and non-service retirement-related costs.\nSee the \"Non-GAAP Financial Measures\" section for the fourth quarter adjustments to net income and the calculation of adjusted EPS. The calculations of basic and diluted earnings per share are included as Appendix I.\nDiscontinued Operations\nBusiness Process Outsourcing (BPO):\nAs previously discussed, on December 31, 2016, Xerox completed the Separation of its BPO business through the Distribution of all of the issued and outstanding stock of Conduent to Xerox Corporation stockholders. As a result of the Separation and Distribution, the financial position and results of operations of the BPO Business are presented as discontinued operations and, as such, have been excluded from continuing operations for all periods presented.\nFourth quarter 2017 Income from discontinued operations, reflected a change in the tax estimate.\nSummarized financial information for our Discontinued Operations is as follows:\nThree Months Ended\nDecember 31,\n(in millions) 2017 2016 Revenue $ — $ 1,500 Cost of services — 1,387 Other expenses (1) — 1,345 Total costs and expenses — 2,732 Net loss before income taxes — (1,232 ) Income tax benefit 6 204 Income (loss) from discontinued operations, net of tax $ 6 $ (1,028 )\n(1) 2016 includes $84 of Separation related costs and $5 of interest on the $1.0 billion Senior Unsecured Term Facility, which was required to be repaid upon completion of the Separation and therefore was reported within Income (loss) from discontinued operations, net of tax.\n(1) See the “Non-GAAP Financial Measures” section for an explanation of the non-GAAP financial measure.\n(2) Entry installations exclude OEM sales; including OEM sales, Entry color multifunction devices increased 15%, while Entry black-and-white multifunction devices increased 26%.\n(3) Mid-range and High-end color installations exclude Fuji Xerox digital front-end sales; including Fuji Xerox digital front-end sales, Mid-range color devices increased 14%, and High-end color systems decreased 12%.\nCapital Resources and Liquidity\nThe following summarizes our cash and cash equivalents:\nThree Months Ended\nDecember 31, (in millions) 2017 2016 Change Net cash (used in) provided by operating activities of continuing operations $ (28 ) $ 462 $ (490 ) Net cash provided by operating activities of discontinued operations 9 111 (102 ) Net cash (used in) provided by operating activities (19 ) 573 (592 ) Net cash provided by (used in) investing activities of continuing operations 85 (59 ) 144 Net cash used in investing activities of discontinued operations — (77 ) 77 Net cash provided by (used in) investing activities 85 (136 ) 221 Net cash (used in) provided by financing activities (555 ) 797 (1,352 ) Effect of exchange rate changes on cash and cash equivalents 1 (39 ) 40 Increase in cash of discontinued operations — (247 ) 247 (Decrease) increase in cash and cash equivalents (488 ) 948 (1,436 ) Cash and cash equivalents at beginning of period 1,781 1,275 506 Cash and Cash Equivalents at End of Period $ 1,293 $ 2,223 $ (930 ) Cash Flows from Operating Activities\nNet cash used in operating activities of continuing operations was $28 million in fourth quarter 2017. The $490 million decrease in operating cash from fourth quarter 2016 was primarily due to the following:\n$376 million decrease from accounts receivable primarily as a result of the termination of all accounts receivable sales arrangements in North America and all but one arrangement in Europe during the fourth quarter 2017. $44 million decrease in accounts payable and accrued compensation primarily related to the year-over-year timing of supplier and vendor payments. $43 million decrease from higher pension contributions primarily in the U.K. $31 million decrease from finance receivables primarily related to a higher level of originations from increased equipment sales. $20 million decrease from higher restructuring payments. $43 million increase in dividends received from equity investments other than Fuji Xerox representing the accumulation of earnings over multiple years. $38 million increase due to higher net tax payments in prior year partially attributable to our tax sharing arrangement with Conduent.\nCash Flows from Investing Activities\nNet cash provided by investing activities of continuing operations was $85 million in fourth quarter 2017. The increase in cash was primarily due to the receipt of the final payment of $127 million on the performance-based instrument associated with our 1997 sale of The Resolution Group (TRG), included in Other investing, net.\nCash Flows from Financing Activities\nNet cash used in financing activities was $555 million in fourth quarter 2017. The $1,352 million decrease in cash from fourth quarter 2016 was primarily due from net debt activity. Fourth quarter 2017 reflects payments of $488 million on Senior Notes, which includes a prepayment premium of $13 million, compared to prior year net proceeds of $889 million from debt incurred in connection with the Separation.\nDebt and Customer Financing Activities\nThe following summarizes our debt:\n(in millions) December 31, 2017 December 31, 2016 Principal debt balance (1) $ 5,579 $ 6,349 Net unamortized discount (35 ) (43 ) Debt issuance costs (32 ) (21 ) Fair value adjustments (2) - terminated swaps 4 27 - current swaps 1 4 Total Debt $ 5,517 $ 6,316\n(1) Includes Notes Payable of $6 million and $4 million as of December 31, 2017 and December 31, 2016, respectively.\n(2) Fair value adjustments include the following: (i) fair value adjustments to debt associated with terminated interest rate swaps, which are being amortized to interest expense over the remaining term of the related notes; and (ii) changes in fair value of hedged debt obligations attributable to movements in benchmark interest rates. Hedge accounting requires hedged debt instruments to be reported inclusive of any fair value adjustment.\nSenior Notes\nIn September 2017, we issued $1.0 billion of 3.625% Senior Notes due March 2023 (the \"2023 Senior Notes\") resulting in aggregate net proceeds of approximately $992 million. Interest on these Senior Notes is payable semi-annually. Debt issuance costs of approximately $8 million were paid and deferred in connection with the issuance of these Senior Notes and will be amortized over the term of the Senior Notes. The proceeds were used for general corporate purposes, which included a $500 million voluntary cash contribution to our U.S. defined benefit pension plans as well as the early redemption of $475 million of the remaining $740 million 6.35% Senior Notes due May 2018. The redemption was completed in October 2017, and we recorded a related net loss of $7 million in fourth quarter 2017.\nSeparation Debt Activity\nIn connection with the Separation, Conduent made a cash distribution of approximately $1.8 billion to Xerox in fourth quarter 2016. Xerox used a portion of the cash distribution proceeds to repay its $1.0 billion Senior Unsecured Term Facility in January 2017, which was required to be repaid upon completion of the Separation. This $1.0 billion of cash and debt was excluded from the Cash and cash equivalents and Total Debt at December 31, 2016, respectively, and was reported in Current Assets and Current Liabilities of discontinued operations at December 31, 2016, respectively. Interest expense associated with this borrowing incurred during 2016 was included in Income (loss) from discontinued operations, net of tax. Xerox used the balance of the proceeds received as well as cash on hand to repay its $500 million 6.75% Senior Notes and $500 million 2.95% Senior Notes that came due in first quarter 2017.\nFinance Assets and Related Debt\nThe following represents our total finance assets, net associated with our lease and finance operations:\n(in millions) December 31, 2017 December 31, 2016 Total finance receivables, net (1) $ 3,752 $ 3,744 Equipment on operating leases, net 454 475 Total Finance Assets, net (2) $ 4,206 $ 4,219\n(1) Includes (i) Billed portion of finance receivables, net, (ii) Finance receivables, net and (iii) Finance receivables due after one year, net as included in our Condensed Consolidated Balance Sheets.\n(2) The change from December 31, 2016 includes an increase of $198 million due to currency.\nOur lease contracts permit customers to pay for equipment over time rather than at the date of installation; therefore, we maintain a certain level of debt (that we refer to as financing debt) to support our investment in these lease contracts, which are reflected in total finance assets, net. For this financing aspect of our business, we maintain an assumed 7:1 leverage ratio of debt to equity as compared to our finance assets.\nBased on this leverage, the following represents the breakdown of total debt between financing debt and core debt:\n(in millions) December 31, 2017 December 31, 2016 Finance receivables debt (1) $ 3,283 $ 3,276 Equipment on operating leases debt 397 416 Financing debt 3,680 3,692 Core debt 1,837 2,624 Total Debt $ 5,517 $ 6,316\n(1) Finance receivables debt is the basis for our calculation of \"Cost of financing\" expense in the Condensed Consolidated Statements of Income.\nSales of Accounts Receivable\nAccounts receivable sales arrangements are utilized in the normal course of business as part of our cash and liquidity management. Prior to fourth quarter 2017, we had facilities in the U.S., Canada and several countries in Europe that enabled us to sell certain accounts receivable, without recourse, to third-parties. The accounts receivable sold were generally short-term trade receivables with payment due dates of less than 60 days. In connection with the efforts of our Strategic Transformation program to reduce costs and simplify our business processes, during the fourth quarter 2017 we terminated all accounts receivable sales arrangements in North America and all but one arrangement in Europe, which resulted in a one-time reduction of our operating cash flows. The remaining accounts receivable sales facility in Europe enables us to sell receivables associated with our distributor network on an ongoing basis without recourse. Under this arrangement, we sell our entire interest in the related accounts receivable for cash and no portion of the payment is held back or deferred by the purchaser.\nAccounts receivable sales activities were as follows:\nThree Months Ended\nDecember 31, (in millions) 2017 2016 Accounts receivable sales $ 135 $ 576 Deferred proceeds — 48 Loss on sales of accounts receivable 1 4 Estimated (decrease) increase to operating cash flows (1),(2) (262 ) 74\n(1) Represents the difference between current and prior period accounts receivable sales adjusted for the effects of the deferred proceeds, collections prior to the end of the quarter and currency.\n(2) Reflects an estimated decrease of approximately $350 million associated with the termination of certain accounts receivable sales programs and the lack of new sales of accounts receivable in the fourth quarter of 2017.\nForward-Looking Statements\nAdditional Information and Where to Find It\nThis release may be deemed to be solicitation material in respect of the transactions with FUJIFILM Holdings Corporation (“Fujifilm\") described herein (the “Transactions”) and/or the matters to be considered at the Company’s 2018 Annual Meeting of Shareholders. In connection with the Transactions and the 2018 Annual Meeting, Xerox plans to file with the Securities and Exchange Commission (“SEC”) and furnish to Xerox’s shareholders one or more proxy statements and other relevant documents. BEFORE MAKING ANY VOTING DECISION, XEROX’S SHAREHOLDERS ARE URGED TO READ THE PROXY STATEMENT(S) IN THEIR ENTIRETY WHEN THEY BECOME AVAILABLE AND ANY OTHER DOCUMENTS TO BE FILED WITH THE SEC IN CONNECTION WITH THE TRANSACTIONS AND/OR THE COMPANY’S 2018 ANNUAL MEETING OR INCORPORATED BY REFERENCE IN THE PROXY STATEMENTS BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE TRANSACTIONS AND/OR THE COMPANY’S 2018 ANNUAL MEETING AND THE PARTIES RELATED THERETO. Xerox’s shareholders will be able to obtain a free copy of documents filed with the SEC at the SEC’s website at http://www.sec.gov . In addition, Xerox’s shareholders may obtain a free copy of Xerox’s filings with the SEC from Xerox’s website at http://www.xerox.com under the heading “Investor Relations” and then under the heading “SEC Filings.”\nParticipants in the Solicitation\nThe directors, executive officers and certain other members of management and employees of Xerox may be deemed “participants” in the solicitation of proxies from shareholders of Xerox in favor of the Transactions or in connection with the matters to be considered at the Company’s 2018 Annual Meeting. Information regarding the persons who may, under the rules of the SEC, be considered participants in the solicitation of the shareholders of Xerox in connection with the Transactions or the Company’s 2018 Annual Meeting will be set forth in the applicable proxy statement and other relevant documents to be filed with the SEC. You can find information about Xerox’s executive officers and directors in Xerox’s Annual Report on Form 10-K for the fiscal year ended December 31, 2016, Xerox’s and such persons’ other filings with the SEC and in Xerox’s definitive proxy statement filed with the SEC on Schedule 14A.\nCautionary Statement Regarding Forward-Looking Statements\nThis release, and other written or oral statements made from time to time by management contain “forward-looking statements” as defined in the Private Securities Litigation Reform Act of 1995. The words “anticipate”, “believe”, “estimate”, “expect”, “intend”, “will”, “should” and similar expressions, as they relate to us, are intended to identify forward-looking statements. These statements reflect management’s current beliefs, assumptions and expectations and are subject to a number of factors that may cause actual results to differ materially. Such factors include but are not limited to: our ability to address our business challenges in order to reverse revenue declines, reduce costs and increase productivity so that we can invest in and grow our business; changes in economic and political conditions, trade protection measures, licensing requirements and tax laws in the United States and in the foreign countries in which we do business; changes in foreign currency exchange rates; our ability to successfully develop new products, technologies and service offerings and to protect our intellectual property rights; the risk that multi-year contracts with governmental entities could be terminated prior to the end of the contract term and that civil or criminal penalties and administrative sanctions could be imposed on us if we fail to comply with the terms of such contracts and applicable law; the risk that partners, subcontractors and software vendors will not perform in a timely, quality manner; actions of competitors and our ability to promptly and effectively react to changing technologies and customer expectations; our ability to obtain adequate pricing for our products and services and to maintain and improve cost efficiency of operations, including savings from restructuring actions; the risk that individually identifiable information of customers, clients and employees could be inadvertently disclosed or disclosed as a result of a breach of our security systems; reliance on third parties, including subcontractors, for manufacturing of products and provision of services; our ability to manage changes in the printing environment and expand equipment placements; interest rates, cost of borrowing and access to credit markets; funding requirements associated with our employee pension and retiree health benefit plans; the risk that our operations and products may not comply with applicable worldwide regulatory requirements, particularly environmental regulations and directives and anti-corruption laws; the outcome of litigation and regulatory proceedings to which we may be a party; the risk that we do not realize all of the expected strategic and financial benefits from the separation and spin-off of our Business Process Outsourcing business; the effects on our business resulting from actions of activist shareholders; and other factors that are set forth in the “Risk Factors” section, the “Legal Proceedings” section, the “Management’s Discussion and Analysis of Financial Condition and Results of Operations” section and other sections of our Quarterly Reports on Form 10-Q for the quarters ended March 31, 2017, June 30, 2017 and September 30, 2017 and our 2016 Annual Report on Form 10-K, as well as our Current Reports on Form 8-K filed with the SEC. Furthermore, the actual results of the Transactions could vary materially as a result of a number of factors, including, but not limited to: (i) the risk that the transactions may not be completed in a timely manner or at all, which may adversely affect Xerox’s business and the price of Xerox’s common stock, (ii) the failure to satisfy the conditions to the consummation of the transactions, including the receipt of certain approvals from Xerox’s shareholders and certain governmental and regulatory approvals, (iii) the parties may be unable to achieve expected synergies and operating efficiencies in the transactions within the expected time frames or at all, (iv) the transactions may not result in the accretion to Xerox’s earnings or other benefits, (v) the occurrence of any event, change or other circumstance that could give rise to the termination of the transaction agreements, (vi) the effect of the announcement or pendency of the transactions on Xerox’s and/or Fujifilm business relationships, operating results, and business generally, risks related to the proposed transactions disrupting Xerox’s current plans and operations and potential difficulties in Xerox’s employee retention as a result of the transactions, (vii) risks related to diverting management's attention from Xerox’s ongoing business operations, (viii) the outcome of any legal proceedings that may be instituted against Xerox, its officers or directors related to the transaction agreements or the transactions and (ix) the possibility that competing offers or acquisition proposals for Xerox will be made. Xerox assumes no obligation to update any forward-looking statements as a result of new information or future events or developments, except as required by law.\nFuji Xerox Co., Ltd. (“Fuji Xerox”) is a joint venture between Xerox Corporation and Fujifilm in which Xerox holds a noncontrolling 25% equity interest and Fujifilm holds the remaining equity interest. In April 2017, Fujifilm formed an independent investigation committee (“IIC”) to primarily conduct a review of the appropriateness of the accounting practices at Fuji Xerox’s New Zealand subsidiary and at other subsidiaries. The IIC completed its review during the second quarter 2017 and identified aggregate adjustments to Fuji Xerox’s financial statements of approximately JPY 40 billion (approximately $360 million) primarily related to misstatements at Fuji Xerox’s New Zealand and Australian subsidiaries. We determined that our share of the total adjustments identified as part of the investigation was approximately $90 million and impacted our fiscal years 2009 through 2017. We concluded that we should revise our previously issued annual and interim consolidated financial statements for 2014, 2015 and 2016 and the first quarter of 2017 the next time they are filed. Our review of this matter has been completed. However, Fujifilm and Fuji Xerox continue to review Fujifilm’s oversight and governance of Fuji Xerox as well as Fuji Xerox’s oversight and governance over its businesses in light of the findings of the IIC. At this time, we can provide no assurances relative to the outcome of any potential governmental investigations or any consequences thereof that may happen as a result of this matter.\nNon-GAAP Financial Measures\nWe have reported our financial results in accordance with generally accepted accounting principles (GAAP). In addition, we have discussed our financial results using the non-GAAP measures described below. We believe these non-GAAP measures allow investors to better understand the trends in our business and to better understand and compare our results. Accordingly, we believe it is necessary to adjust several reported amounts, determined in accordance with GAAP, to exclude the effects of certain items as well as their related income tax effects.\nA reconciliation of these non-GAAP financial measures to the most directly comparable financial measures calculated and presented in accordance with GAAP are set forth below as well as in the fourth quarter 2017 presentation slides available at www.xerox.com/investor .\nThese non-GAAP financial measures should be viewed in addition to, and not as a substitute for, the company’s reported results prepared in accordance with GAAP.\nAdjusted Earnings Measures\nNet income and Earnings per share (EPS) Effective tax rate Gross margin, RD&E and SAG (adjusted for non-service retirement-related costs and transaction/proxy related costs)\nThe above measures were adjusted for the following items:\nAmortization of intangible assets: The amortization of intangible assets is driven by our acquisition activity which can vary in size, nature and timing as compared to other companies within our industry and from period to period. The use of intangible assets contributed to our revenues earned during the periods presented and will contribute to our future period revenues as well. Amortization of intangible assets will recur in future periods. Restructuring and related costs: Restructuring and related costs include restructuring and asset impairment charges as well as costs associated with our Strategic Transformation program beyond those normally included in restructuring and asset impairment charges. Restructuring consists of costs primarily related to severance and benefits paid to employees pursuant to formal restructuring and workforce reduction plans. Asset impairment includes costs incurred for those assets sold, abandoned or made obsolete as a result of our restructuring actions, exiting from a business or other strategic business changes. Additional costs for our Strategic Transformation program are primarily related to the implementation of strategic actions and initiatives and include third-party professional service costs as well as one-time incremental costs. All of these costs can vary significantly in terms of amount and frequency based on the nature of the actions as well as the changing needs of the business. Accordingly, due to that significant variability, we will exclude these charges since we do not believe they provide meaningful insight into our current or past operating performance nor do we believe they are reflective of our expected future operating expenses as such charges are expected to yield future benefits and savings with respect to our operational performance. Non-service retirement-related costs: Our defined benefit pension and retiree health costs include several elements impacted by changes in plan assets and obligations that are primarily driven by changes in the debt and equity markets as well as those that are predominantly legacy in nature and related to employees who are no longer providing current service to the company (e.g. retirees and ex-employees). These elements include (i) interest cost, (ii) expected return on plan assets, (iii) amortized actuarial gains/losses and (iv) the impacts of any plan settlements/curtailments. Accordingly, we consider these elements of our periodic retirement plan costs to be outside the operational performance of the business or legacy costs and not necessarily indicative of current or future cash flow requirements. Adjusted earnings will continue to include the elements of our retirement costs related to current employee service (service cost and amortization of prior service cost) as well as the cost of our defined contribution plans. Other discrete, unusual or infrequent items: In addition, we also excluded the following items given their discrete, unusual or infrequent nature and their impact on our results for the period: Losses on early extinguishment of debt in the first and fourth quarter of 2017 A benefit from the remeasurement of a tax matter in the first quarter of 2017 that related to a previously adjusted item Costs incurred in the fourth quarter of 2017 related to the recently announced transaction with Fujifilm as well as to our expected proxy contest. These costs are primarily for third-party investment banking, legal, accounting, consulting and other similar services. An estimated non-cash charge in the fourth quarter 2017 reflecting the impact associated with the enactment of the Tax Cuts and Jobs Act (the \"Tax Act\") in December 2017. See the “Income Taxes” section for further explanation.\nWe believe the exclusion of these items allows investors to better understand and analyze the results for the period as compared to prior periods and expected future trends in our business.\nAdjusted Operating Income/Margin\nWe also calculate and utilize adjusted operating income and margin measures by adjusting our reported pre-tax income and margin amounts. In addition to the costs and expenses noted as adjustments for our Adjusted Earnings measures, adjusted operating income and margin also exclude Other expenses, net. Other expenses, net is primarily comprised of non-financing interest expense and also includes certain other non-operating costs and expenses. We exclude these amounts in order to evaluate our current and past operating performance and to better understand the expected future trends in our business. Adjusted Operating income and margin also include Equity in net income of unconsolidated affiliates. Equity in net income of unconsolidated affiliates primarily reflects our 25% share of Fuji Xerox net income. We include this amount in our measure of operating income and margin as Fuji Xerox is our primary intermediary to the Asia/Pacific market for distribution of Xerox branded products and services.\nConstant Currency\nTo better understand trends in our business, we believe that it is helpful to adjust revenue to exclude the impact of changes in the translation of foreign currencies into U.S. dollars. We refer to this adjusted revenue as “constant currency.” This impact is calculated by translating current period activity in local currency using the comparable prior year period's currency translation rate. This impact is calculated for all countries where the functional currency is the local country currency. The constant currency impact for signings growth is calculated on the basis of plan currency rates. Management believes the constant currency measure provides investors an additional perspective on revenue trends. Currency impact can be determined as the difference between actual growth rates and constant currency growth rates.\nFree Cash Flow\nTo better understand trends in our business, we believe that it is helpful to subtract amounts for capital expenditures (inclusive of internal use software) from cash flows from continuing operations. Management believes this measure gives investors an additional perspective on cash flow from operating activities in excess of amounts required for reinvestment. It provides a measure of our ability to fund acquisitions, dividends and share repurchase.\nSummary:\nManagement believes that all of these non-GAAP financial measures provide an additional means of analyzing the current period’s results against the corresponding prior period’s results. However, these non-GAAP financial measures should be viewed in addition to, and not as a substitute for, the company’s reported results prepared in accordance with GAAP. Our non-GAAP financial measures are not meant to be considered in isolation or as a substitute for comparable GAAP measures and should be read only in conjunction with our consolidated financial statements prepared in accordance with GAAP. Our management regularly uses our supplemental non-GAAP financial measures internally to understand, manage and evaluate our business and make operating decisions. These non-GAAP measures are among the primary factors management uses in planning for and forecasting future periods. Compensation of our executives is based in part on the performance of our business based on these non-GAAP measures.\nA reconciliation of these non-GAAP financial measures and the most directly comparable measures calculated and presented in accordance with GAAP are set forth on the following tables:\nNet Income and EPS reconciliation:\nThree Months Ended December 31, Year Ended December 31, 2017 2016 2017 2016 (in millions, except per share amounts) Net Income EPS Net Income EPS Net Income EPS Net Income EPS Reported (1) $ (196 ) $ (0.78 ) $ 185 $ 0.70 $ 192 $ 0.70 $ 622 $ 2.33 Adjustments: Restructuring and related costs 24 92 220 264 Amortization of intangible assets 12 14 53 58 Non-service retirement-related costs 62 19 198 131 Loss on extinguishment of debt 7 — 20 — Transaction and proxy related costs 9 — 9 — Income tax on adjustments (2) (45 ) (46 ) (171 ) (151 ) US Tax Act 400 — 400 — Remeasurement of unrecognized tax positions — — (16 ) — Restructuring and other charges - Fuji Xerox (3) 1 — 10 3 Adjusted $ 274 $ 1.04 $ 264 $ 1.00 $ 915 $ 3.48 $ 927 $ 3.53 Dividends on preferred stock used in adjusted EPS calculation (4) $ — $ — $ — $ 24 Weighted average shares for adjusted EPS (4) 264 264 263 256 Fully diluted shares at end of period (5) 264\n(1) Net (loss) income and EPS from continuing operations attributable to Xerox.\n(2) Refer to Effective Tax Rate reconciliation.\n(3) Other charges in 2017 represent audit and other fees associated with the independent investigation of Fuji Xerox's accounting practices.\n(4) For those periods that exclude the preferred stock dividend, the average shares for the calculations of diluted EPS include 7 million shares associated with our Series A or Series B convertible preferred stock, as applicable.\n(5) Represents common shares outstanding at December 31, 2017 as well as shares associated with our Series B convertible preferred stock plus potential dilutive common shares as used for the calculation of diluted earnings per share for the fourth quarter 2017.\nEffective Tax Rate reconciliation:\nThree Months Ended\nDecember 31, 2017\nThree Months Ended\nDecember 31, 2016\n(in millions) Pre-Tax\nIncome\nIncome Tax\nExpense\nEffective Tax\nRate\nPre-Tax\nIncome\nIncome Tax\nExpense\nEffective Tax\nRate\nReported (1) $ 226 $ 444 196.5 % $ 179 $ 18 10.1 % Non-GAAP Adjustments (2) 114 45 125 46 US Tax Act — (400 ) — — Adjusted (3) $ 340 $ 89 26.2 % $ 304 $ 64 21.1 % Year Ended\nDecember 31, 2017 Year Ended\nDecember 31, 2016 (in millions) Pre-Tax\nIncome\nIncome Tax\nExpense\nEffective Tax\nRate\nPre-Tax\nIncome\nIncome Tax\nExpense\nEffective Tax\nRate\nReported (1) $ 570 $ 481 84.4 % $ 568 $ 62 10.9 % Non-GAAP Adjustments (2) 500 171 453 151 US Tax Act — $ (400 ) — — Remeasurement of unrecognized tax positions — 16 — — Adjusted (3) $ 1,070 $ 268 25.0 % $ 1,021 $ 213 20.9 %\n(1) Pre-Tax Income and Income Tax Expense from continuing operations.\n(2) Refer to Net Income and EPS reconciliation for details.\n(3) The tax impact on Adjusted Pre-Tax Income from continuing operations is calculated under the same accounting principles applied to the As Reported Pre-Tax Income under ASC 740, which employs an annual effective tax rate method to the results.\nOperating Income / Margin reconciliation:\nThree Months Ended\nDecember 31, 2017 Three Months Ended\nDecember 31, 2016 (in millions) Profit Revenue Margin Profit Revenue Margin Reported (1) $ 226 $ 2,747 8.2 % $ 179 $ 2,734 6.5 % Adjustments: Restructuring and related costs 24 92 Amortization of intangible assets 12 14 Non-service retirement-related costs 62 19 Transaction and proxy related costs 9 — Equity in net income of unconsolidated affiliates 25 27 Restructuring and other charges - Fuji Xerox (2) 1 — Other expenses, net 36 57 Adjusted $ 395 $ 2,747 14.4 % $ 388 $ 2,734 14.2 % Year Ended\nDecember 31, 2017 Year Ended\nDecember 31, 2016 (in millions) Profit Revenue Margin Profit Revenue Margin Reported (1) $ 570 $ 10,265 5.6 % $ 568 $ 10,771 5.3 % Adjustments: Restructuring and related costs 220 264 Amortization of intangible assets 53 58 Non-service retirement-related costs 198 131 Transaction and proxy related costs 9 — Equity in net income of unconsolidated affiliates 115 127 Restructuring and other charges - Fuji Xerox (2) 10 3 Other expenses, net 141 200 Adjusted $ 1,316 $ 10,265 12.8 % $ 1,351 $ 10,771 12.5 %\n(1) Pre-Tax Income and revenue from continuing operations.\n(2) Other charges in fourth quarter 2017 represent audit and other fees associated with the independent investigation of Fuji Xerox's accounting practices.\nKey Financial Ratios reconciliation:\nThree Months Ended\nDecember 31, 2017 Three Months Ended\nDecember 31, 2016 (in millions) As Reported (1) Adjustments (2) Adjusted As Reported (1) Adjustments (2) Adjusted Total Revenue $ 2,747 $ — $ 2,747 $ 2,734 $ — $ 2,734 Total Gross Profit 1,088 23 1,111 1,094 7 1,101 Post sale revenue 2,065 — 2,065 2,080 — 2,080 Post sale gross profit 901 23 924 889 7 896 RD&E 114 (8 ) 106 113 (4 ) 109 SAG 676 (40 ) 636 639 (8 ) 631 Total Gross Margin 39.6 % 40.4 % 40.0 % 40.3 % Post sale Gross Margin 43.6 % 44.7 % 42.7 % 43.1 % RD&E as a % of Revenue 4.1 % 3.9 % 4.1 % 4.0 % SAG as a % of Revenue 24.6 % 23.2 % 23.4 % 23.1 % Year Ended\nDecember 31, 2017 Year Ended\nDecember 31, 2016 (in millions) As Reported (1) Adjustments (2) Adjusted As Reported (1) Adjustments (2) Adjusted Total Revenue $ 10,265 $ — $ 10,265 $ 10,771 $ — $ 10,771 Total Gross Profit 4,061 75 4,136 4,261 49 4,310 Post sale revenue 8,014 — 8,014 8,352 — 8,352 Post sale gross profit 3,414 75 3,489 3,513 49 3,562 RD&E 446 (25 ) 421 476 (25 ) 451 SAG 2,631 (107 ) 2,524 2,695 (57 ) 2,638 Total Gross Margin 39.6 % 40.3 % 39.6 % 40.0 % Post sale Gross Margin 42.6 % 43.5 % 42.1 % 42.6 % RD&E as a % of Revenue 4.3 % 4.1 % 4.4 % 4.2 % SAG as a % of Revenue 25.6 % 24.6 % 25.0 % 24.5 %\n(1) Revenue and costs from continuing operations.\n(2) 2017 includes adjustments for non-service retirement-related costs and transaction/proxy related costs. 2016 includes adjustments for non-service retirement-related costs.\nOperating Cash Flows reconciliation:\n(in millions) Three Months Ended\nDecember 31, 2017 Year Ended\nDecember 31, 2017 Reported (1) $ (28 ) $ 122 Adjustments: Voluntary contribution to U.S. defined benefit pension plans — 500 Elimination of certain accounts receivables sales programs 350 350 Adjusted $ 322 $ 972\n(1) Net cash (used in) provided by operating activities of continuing operations.\nGuidance:\nEarnings per Share FY 2018 GAAP EPS from Continuing Operations $2.30 - $2.50 Non-GAAP Adjustments 1.20 Adjusted EPS from Continuing Operations $3.50 - $3.70\nNote: Adjusted EPS guidance excludes amortization of intangible assets, restructuring and related costs and non-service retirement-related costs, as well as other discretely identified adjustments..\nFree Cash Flow (in millions) FY 2018 Operating Cash Flows from Continuing Operations $900 - $1,100 Less: Capital Expenditures (including Internal Use Software) (150 ) Free Cash Flows from Continuing Operations $750 - $950 APPENDIX I\nXerox Corporation\nEarnings per Common Share\n(in millions except per share data, shares in thousands)\nThree Months Ended\nDecember 31, Year Ended\nDecember 31, 2017 2016 2017 2016 Basic (Loss) Earnings per Share: Net (loss) income from continuing operations attributable to Xerox $ (196 ) $ 185 $ 192 $ 622 Accrued dividends on preferred stock (3 ) (6 ) (14 ) (24 ) Adjusted net (loss) income from continuing operations available to common shareholders $ (199 ) $ 179 $ 178 $ 598 Net income (loss) from discontinued operations attributable to Xerox 6 (1,028 ) 3 (1,093 ) Adjusted net (loss) income available to common shareholders $ (193 ) $ (849 ) $ 181 $ (495 ) Weighted average common shares outstanding 254,616 253,538 254,341 253,391 Basic (Loss) Earnings per Share: Continuing operations $ (0.78 ) $ 0.71 $ 0.70 $ 2.36 Discontinued operations 0.02 (4.06 ) 0.01 (4.31 ) Total $ (0.76 ) $ (3.35 ) $ 0.71 $ (1.95 ) Diluted (Loss) Earnings per Share: Net (loss) income from continuing operations attributable to Xerox $ (196 ) $ 185 $ 192 $ 622 Accrued dividends on preferred stock (3 ) (6 ) (14 ) (24 ) Adjusted net (loss) income from continuing operations available to common shareholders $ (199 ) $ 179 $ 178 $ 598 Net income (loss) from discontinued operations attributable to Xerox 6 (1,028 ) 3 (1,093 ) Adjusted net (loss) income available to common shareholders $ (193 ) $ (849 ) $ 181 $ (495 ) Weighted average common shares outstanding 254,616 253,538 254,341 253,391 Common shares issuable with respect to: Stock options — 126 — 174 Restricted stock and performance shares — 3,338 2,229 2,430 Adjusted weighted average common shares outstanding 254,616 257,002 256,570 255,995 Diluted (Loss) Earnings per Share: Continuing operations $ (0.78 ) $ 0.70 $ 0.70 $ 2.33 Discontinued operations 0.02 (4.00 ) 0.01 (4.26 ) Total $ (0.76 ) $ (3.30 ) $ 0.71 $ (1.93 ) The following securities were not included in the computation of diluted earnings per share as they were either contingently issuable shares or shares that if included would have been anti-dilutive: Stock options — 250 — 202 Restricted stock and performance shares 5,935 4,522 3,706 5,430 Convertible preferred stock 6,742 6,742 6,742 6,742 Total Anti-Dilutive Securities 12,677 11,514 10,448 12,374 Dividends per Common Share $ 0.25 $ 0.31 $ 1.00 $ 1.24 APPENDIX II\nXerox Corporation\nGeographic Sales Channels and Product/Offering Definitions\nOur business is aligned to a geographic focus and is primarily organized on the basis of go-to-market sales channels, which are structured to serve a range of customers for our products and services:\nNorth America, which includes our sales channels in the U.S. and Canada. International, which includes our sales channels in Europe, Eurasia, Latin America, Middle East, Africa and India. Other, primarily includes our OEM business, as well as sales to and royalties from Fuji Xerox, and our licensing revenue.\nOur products and offerings include:\n“Entry”, which includes A4 devices and desktop printers. Prices in this product group can range from approximately $150 to $3,000. “Mid-Range”, which includes A3 Office and Light Production devices that generally serve workgroup environments in mid to large enterprises. Prices in this product group can range from approximately $2,000 to $75,000+. “High-End”, which includes production printing and publishing systems that generally serve the graphic communications marketplace and large enterprises. Prices for these systems can range from approximately $30,000 to $1,000,000+. Managed Document Services (MDS) revenue, which includes solutions and services that span from managing print to automating processes to managing content. Our primary offerings within MDS are Managed Print Services (including from Global Imaging Systems), as well as workflow automation services, and Centralized Print Services and Solutions (CPS). MDS excludes Communication and Marketing Solutions (CMS).\nAPPENDIX III\nXerox Corporation\nCorrection of Fuji Xerox Misstatement in Prior Period Financial Statements\n(As Previously Presented in our Second-Quarter 2017 Earnings Release)\nRevised Consolidated Statements of Income (Loss) and Non-GAAP Financial Measures\nThe following tables reconcile selected lines from the company’s first quarter 2017 and fiscal years 2016, 2015 and 2014 Consolidated Statements of Income (Loss) and applicable non-GAAP Operating Income/Margin reconciliations from the previously reported amounts to the revised amounts. These revisions did not have an impact on the company's operating cash flows.\nThree Months Ended\nMarch 31, 2017\nYear Ended\nDecember 31, 2016\n(in millions) As Reported\nAdjustment (1) As Revised As Reported Adjustment As Revised Equity in net income of unconsolidated affiliates $ 16 $ 24 $ 40 $ 121 $ 6 $ 127 Income from Continuing Operations 24 24 48 627 6 633 Net Income (Loss) 18 24 42 (466 ) 6 (460 ) Net Income (Loss) Attributable to Xerox 16 24 40 (477 ) 6 (471 ) Net income from continuing operations attributable to Xerox $ 22 $ 24 $ 46 $ 616 $ 6 $ 622 Basic Earnings (Loss) per Share: Continuing operations $ 0.07 $ 0.10 $ 0.17 $ 2.33 $ 0.03 $ 2.36 Total $ 0.05 $ 0.09 $ 0.14 $ (1.98 ) $ 0.03 $ (1.95 ) Diluted Earnings (Loss) per Share: Continuing operations $ 0.07 $ 0.09 $ 0.16 $ 2.31 $ 0.02 $ 2.33 Total $ 0.05 $ 0.09 $ 0.14 $ (1.96 ) $ 0.03 $ (1.93 ) Non-GAAP Measures Adjusted Net Income $ 154 $ 24 $ 178 $ 921 $ 6 $ 927 Adjusted EPS $ 0.58 $ 0.09 $ 0.67 $ 3.50 $ 0.03 $ 3.53 Adjusted Operating Profit (2) $ 250 $ 24 $ 274 $ 1,345 $ 6 $ 1,351 Adjusted Operating Margin 10.2 % 11.2 % 12.5 % 12.5 %\n(1) The difference between the $30 million out-of-period adjustment recorded in the first quarter 2017 and the revision adjustment of $24 million, primarily relates to the additional adjustments subsequently identified as part of the IIC review.\n(2) As reported Adjusted Operating Profit excludes Fuji Xerox restructuring charges. As reported Adjusted Operating Profit for the three months ended March 31, 2017 also reflects the reversal of the $30 million out-of-period adjustment recorded in the first quarter 2017.\nYear Ended\nDecember 31, 2015\nYear Ended\nDecember 31, 2014\n(in millions) As Reported Adjustment As Revised As Reported Adjustment As Revised Equity in net income of unconsolidated affiliates $ 135 $ (26 ) $ 109 $ 160 $ (18 ) $ 142 Income from Continuing Operations 866 (26 ) 840 1,052 (18 ) 1,034 Net Income 492 (26 ) 466 1,036 (18 ) 1,018 Net Income Attributable to Xerox 474 (26 ) 448 1,013 (18 ) 995 Net income from continuing operations attributable to Xerox $ 848 $ (26 ) $ 822 $ 1,029 $ (18 ) $ 1,011 Basic Earnings per Share: Continuing operations $ 3.10 $ (0.10 ) $ 3.00 $ 3.48 $ (0.06 ) $ 3.42 Total $ 1.69 $ (0.10 ) $ 1.59 $ 3.43 $ (0.06 ) $ 3.37 Diluted Earnings per Share: Continuing operations $ 3.06 $ (0.09 ) $ 2.97 $ 3.43 $ (0.06 ) $ 3.37 Total $ 1.67 $ (0.09 ) $ 1.58 $ 3.38 $ (0.06 ) $ 3.32 Non-GAAP Measures Adjusted Net Income $ 978 $ (26 ) $ 952 $ 1,148 $ (18 ) $ 1,130 Adjusted EPS $ 3.55 $ (0.10 ) $ 3.45 $ 3.83 $ (0.06 ) $ 3.77 Adjusted Operating Profit (1) $ 1,461 $ (26 ) $ 1,435 $ 1,688 $ (18 ) $ 1,670 Adjusted Operating Margin 12.7 % 12.5 % 13.3 % 13.2 %\n(1) As reported Adjusted Operating Profit excludes Fuji Xerox restructuring charges.\nRevised Quarterly Results of Operations\nThe following tables reconcile selected lines from the company’s 2016 and 2015 quarterly Consolidated Statements of Income (Loss) from the previously reported amounts to the revised amounts:\nThree Months Ended\nMarch 31, 2016\nThree Months Ended\nJune 30, 2016\n(in millions) As Reported Adjustment As Revised As Reported Adjustment As Revised Equity in net income of unconsolidated affiliates $ 37 $ (3 ) $ 34 $ 22 $ 4 $ 26 Income from Continuing Operations 71 (3 ) 68 195 4 199 Net Income 36 (3 ) 33 157 4 161 Net Income Attributable to Xerox 34 (3 ) 31 154 4 158 Basic Earnings per Share: Continuing operations $ 0.25 $ (0.01 ) $ 0.24 $ 0.74 $ 0.01 $ 0.75 Total $ 0.11 $ (0.01 ) $ 0.10 $ 0.59 $ 0.01 $ 0.60 Diluted Earnings per Share: Continuing operations $ 0.24 $ (0.01 ) $ 0.23 $ 0.73 $ 0.02 $ 0.75 Total $ 0.11 $ (0.01 ) $ 0.10 $ 0.58 $ 0.02 $ 0.60 Non-GAAP Measures Adjusted Net Income $ 186 $ (3 ) $ 183 $ 253 $ 4 $ 257 Adjusted EPS $ 0.70 $ (0.01 ) $ 0.69 $ 0.97 $ 0.01 $ 0.98 Adjusted Operating Profit (1) $ 274 $ (3 ) $ 271 $ 357 $ 4 $ 361 Adjusted Operating Margin 10.5 % 10.4 % 12.8 % 12.9 % Three Months Ended\nSeptember 30, 2016\nThree Months Ended\nDecember 31, 2016\n(in millions) As Reported Adjustment As Revised As Reported Adjustment As Revised Equity in net income of unconsolidated affiliates $ 39 $ 1 $ 40 $ 23 $ 4 $ 27 Income from Continuing Operations 177 1 178 184 4 188 Net Income (Loss) 185 1 186 (844 ) 4 (840 ) Net Income (Loss) Attributable to Xerox 182 1 183 (847 ) 4 (843 ) Basic Earnings (Loss) per Share: Continuing operations $ 0.66 $ — $ 0.66 $ 0.69 $ 0.02 $ 0.71 Total $ 0.69 $ — $ 0.69 $ (3.37 ) $ 0.02 $ (3.35 ) Diluted Earnings (Loss) per Share: Continuing operations $ 0.65 $ 0.01 $ 0.66 $ 0.68 $ 0.02 $ 0.70 Total $ 0.68 $ 0.01 $ 0.69 $ (3.32 ) $ 0.02 $ (3.30 ) Non-GAAP Measures Adjusted Net Income $ 222 $ 1 $ 223 $ 260 $ 4 $ 264 Adjusted EPS $ 0.84 $ — $ 0.84 $ 0.99 $ 0.01 $ 1.00 Adjusted Operating Profit (1) $ 330 $ 1 $ 331 $ 384 $ 4 $ 388 Adjusted Operating Margin 12.6 % 12.6 % 14.0 % 14.2 %\n(1) As reported Adjusted Operating Profit excludes Fuji Xerox restructuring charges.\nThree Months Ended\nMarch 31, 2015\nThree Months Ended\nJune 30, 2015\n(in millions) As Reported Adjustment As Revised As Reported Adjustment As Revised Equity in net income of unconsolidated affiliates $ 34 $ (18 ) $ 16 $ 29 $ (4 ) $ 25 Income from Continuing Operations 189 (18 ) 171 210 (4 ) 206 Net Income 230 (18 ) 212 17 (4 ) 13 Net Income Attributable to Xerox 225 (18 ) 207 12 (4 ) 8 Basic Earnings per Share: Continuing operations $ 0.64 $ (0.06 ) $ 0.58 $ 0.73 $ (0.01 ) $ 0.72 Total $ 0.79 $ (0.07 ) $ 0.72 $ 0.02 $ (0.01 ) $ 0.01 Diluted Earnings per Share: Continuing operations $ 0.63 $ (0.06 ) $ 0.57 $ 0.72 $ (0.01 ) $ 0.71 Total $ 0.78 $ (0.07 ) $ 0.71 $ 0.02 $ (0.01 ) $ 0.01 Non-GAAP Measures Adjusted Net Income $ 229 $ (18 ) $ 211 $ 225 $ (4 ) $ 221 Adjusted EPS $ 0.79 $ (0.06 ) $ 0.73 $ 0.80 $ (0.02 ) $ 0.78 Adjusted Operating Profit (1) $ 343 $ (18 ) $ 325 $ 353 $ (4 ) $ 349 Adjusted Operating Margin 12.2 % 11.6 % 12.1 % 11.9 % Three Months Ended\nSeptember 30, 2015\nThree Months Ended\nDecember 31, 2015\n(in millions) As Reported Adjustment As Revised As Reported Adjustment As Revised Equity in net income of unconsolidated affiliates $ 40 $ — $ 40 $ 32 $ (4 ) $ 28 Income from Continuing Operations 206 — 206 261 (4 ) 257 Net (Loss) Income (31 ) — (31 ) 276 (4 ) 272 Net (Loss) Income Attributable to Xerox (34 ) — (34 ) 271 (4 ) 267 Basic (Loss) Earnings per Share: Continuing operations $ 0.75 $ — $ 0.75 $ 0.99 $ (0.02 ) $ 0.97 Total $ (0.16 ) $ — $ (0.16 ) $ 1.05 $ (0.02 ) $ 1.03 Diluted (Loss) Earnings per Share: Continuing operations $ 0.75 $ — $ 0.75 $ 0.98 $ (0.02 ) $ 0.96 Total $ (0.16 ) $ — $ (0.16 ) $ 1.04 $ (0.02 ) $ 1.02 Non-GAAP Measures Adjusted Net Income $ 239 $ — $ 239 $ 285 $ (4 ) $ 281 Adjusted EPS $ 0.88 $ — $ 0.88 $ 1.09 $ (0.01 ) $ 1.08 Adjusted Operating Profit (1) $ 372 $ — $ 372 $ 393 $ (4 ) $ 389 Adjusted Operating Margin 13.4 % 13.4 % 13.3 % 13.2 %", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.instagram.com%2Fxerox%2F&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=https%3A%2F%2Fwww.instagram.com%2Fxerox%2F&index=13&md5=ddf8e2e56edfea3e9f1340e47f6e252f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftwitter.com%2Fxerox&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=http%3A%2F%2Ftwitter.com%2Fxerox&index=10&md5=e0056d0851bbd1c43c2736f56f0ab91b", "http://www.youtube.com/XeroxCorp", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.xerox.com%2Finvestor&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=www.xerox.com%2Finvestor&index=18&md5=6dd1e7284e983e743848c4f0677f055f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.news.xerox.com&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=https%3A%2F%2Fwww.news.xerox.com&index=9&md5=9ca812ea5d8e75ac7afc11e5ce19b3c7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fedge.media-server.com%2Fm6%2Fp%2F7ffthvi5&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=https%3A%2F%2Fedge.media-server.com%2Fm6%2Fp%2F7ffthvi5&index=3&md5=5cfcf57b9f4e5e87d67eb463c4521568", "http://www.facebook.com/XeroxCorp", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fconnect.blogs.xerox.com&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=http%3A%2F%2Fconnect.blogs.xerox.com&index=11&md5=2ba83f36943bfa661b0f1ad302a438ce", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.xerox.com%2Fen-us%2Fabout%2Fexecutive-leadership%2Fcorporate-officers%2Fjeff-jacobson-biography&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=Jeff+Jacobson&index=2&md5=87468e7d2c5734059cce21c6ed94469a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.xerox.com&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=http%3A%2F%2Fwww.xerox.com&index=8&md5=5dfa4f74963237996894368681e58f4b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.youtube.com%2FXeroxCorp&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=http%3A%2F%2Fwww.youtube.com%2FXeroxCorp&index=15&md5=41dcb1f210e5ff687edb81fec5c97997", "http://twitter.com/xerox", "http://www.linkedin.com/company/xerox", "https://www.instagram.com/xerox/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fxerox&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=http%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fxerox&index=14&md5=ffe5459a7f6bf40d62ab37e215acf3aa", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=16&md5=38a1ed97ce693bb1f299e2664e04350a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.xerox.com%2F&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=Xerox&index=1&md5=f6267bd43ab73b143bc0d4d765ed34f6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FXerox&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=%40Xerox&index=6&md5=7da381fdaeea2edfc01066e799e99c9b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.xerox.com%2F&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=www.xerox.com&index=5&md5=b7b556e81ac8867db573389eb54de7bb", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.xerox.com&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=http%3A%2F%2Fwww.xerox.com&index=17&md5=4738ced3ccda942fe0ac960fc71afd89", "https://edge.media-server.com/m6/p/7ffthvi5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.office.xerox.com%2Fdigital-printing-equipment%2Fenus.html&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=technology&index=4&md5=e80ae9c77849be15698e04071ca47a53", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.facebook.com%2FXeroxCorp&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=http%3A%2F%2Fwww.facebook.com%2FXeroxCorp&index=12&md5=7fff411ed7544210857d554572a3c56a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51751419&newsitemid=20180131005518&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=7&md5=a00144bf7b84f84a50a8a959849b9e17"], "published": "2018-01-31T11:00:00.000+02:00", "crawled": "2018-01-31T13:01:48.000+02:00", "highlightTitle": ""}