{"organizations": [], "uuid": "7510bfee89e04e4917e329d25b35d498fd99cc17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/mpw-revised-logo-2-42.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/tammy-duckworth-weinstein-co/", "country": "US", "domain_rank": 1196, "title": "Tammy Duckworth, Weinstein Co., Kevin Spacey: Broadsheet | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.766, "site_type": "news", "published": "2018-01-25T09:21:00.000+02:00", "replies_count": 0, "uuid": "7510bfee89e04e4917e329d25b35d498fd99cc17"}, "author": "Valentina Zarya", "url": "http://fortune.com/2018/01/24/tammy-duckworth-weinstein-co/", "ord_in_thread": 0, "title": "Tammy Duckworth, Weinstein Co., Kevin Spacey: Broadsheet | Fortune", "locations": [], "entities": {"persons": [{"name": "valentina zarya", "sentiment": "negative"}, {"name": "kevin spacey", "sentiment": "negative"}, {"name": "tammy duckworth", "sentiment": "negative"}, {"name": "duckworth", "sentiment": "none"}, {"name": "jacinda ardern", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}], "organizations": [{"name": "broadsheet", "sentiment": "negative"}, {"name": "weinstein co.", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "monster energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Valentina Zarya 7:21 AM EST \nGood morning, Broadsheet readers! Female politicians are making history, the Weinstein Co. is nearing a sale to a woman-led group, and a group of men at Monster Energy is accused of living up to the company name. Have a wonderful Wednesday. EVERYONE'S TALKING \n• Mommy’s a Senator. Last week, we took note of the pregnancy of New Zealand Prime Minister Jacinda Ardern. Yesterday, a similar—though closer to home—news item dominated the headlines: Sen. Tammy Duckworth (D-Ill.) is pregnant and poised become the first Senator to give birth while in office. \nDuckworth is expected to become one of only 10 women in history to give birth while in Congress, and already holds the title of first disabled woman elected to political office; she is a retired lieutenant colonel who lost her legs and shattered her right arm when her Black Hawk helicopter was shot down in Iraq in 2004. \nWhile Duckworth’s decision to grow her family is a personal one, it can also be seen as simply what happens when you have more women in Congress: some of them will get pregnant. As a story in this month’s Fortune magazine story notes, the number of women in the Senate is at an all-time high as of this December, when Tina Smith took the Senate seat vacated by embattled Sen. Al Franken (D-Minn.). \nHowever, the U.S. has a long way to go when it comes to having women in political office: It places 99th globally in terms of percentage of female legislators or parliamentarians —narrowly beating out Kyrgyzstan, and two spots below Saudi Arabia. \nTo tell readers of this newsletter that we need more women in office would be preaching to the choir, but Duckworth is the perfect example of what happens when we have more female legislators—and mothers—on Capitol Hill. The Chicago Sun-Times reports that, since giving birth to her first daughter, Duckworth has authored measures to make sure major airports offer places for mothers to breastfeed, give military personnel time to bond with their newborns, and make sure student parents have on-campus childcare. She is also a sponsor of bills dealing with affordable child care, paid parental leave and other infant and maternal health issues. \nLess easily measurable, but no less important, is the example that Duckworth and other female politicians are setting. Says the senator of her three-year-old daughter: “Every time she sees a picture of the U.S. Capitol, even if it’s on a dollar bill, she says ‘Mommy’s office.’ And I have to say, ‘Well, it’s not quite Mommy’s office, but in a way you’re right.’” ALSO IN THE HEADLINES \n• Her money’s where her mouth is. Yesterday, Kristen excerpted our colleague Michal Lev-Ram’s feature on Aspect Ventures , the female-founded VC firm that recently announced its second fund and has Melinda Gates as a limited partner. Michal caught up with the philanthropist about why she invested in Aspect and what she believes LPs can do to help diversify the industry’s boys’ club. “There are a lot of concrete steps LPs can take here. They can actively look for bad behavior in the funds and general partners they’re investing in, and intervene immediately when they see it,” says Gates. “They can track and measure diversity in their own portfolios. LPs can also increase their investment in emerging, diverse fund managers—not just because it’s the right thing to do, but because it’s a smart strategy.” Fortune \n• Monsters at Monster Energy . Five women are suing Monster Energy, the beverage company partly owned by Coca-Cola, over an abusive and discriminatory culture. The most notable element of the story is the fact that the three men in the center of the suits—Brent Hamilton, John Kenneally, and Phillip Deitrich—are still working at the company. Hamilton is accused of strangling his then-girlfriend, and the other two men are accused of sexual discrimination. HuffPost \n• No lessons learned here . The Financial Times last week sent two people undercover to work as hostesses to the Presidents Club Charity Dinner, London’s annual exclusive all-male black tie event. “Over the course of six hours, many of the hostesses were subjected to groping, lewd comments and repeated requests to join diners in bedrooms elsewhere in the Dorchester.” The auction itself also offered “a hint of the evening’s seedier side. Lots included a night at Soho’s Windmill strip club and a course of plastic surgery with the invitation to: ‘Add spice to your wife.'” Financial Times \n• Weinstein Co. led by women? Weinstein Co.’s owners have entered exclusive negotiations to sell the studio to a group led by Maria Contreras-Sweet for about $500 million. If the deal closes (which is reportedly possible by the end of this week) and all goes according to plan, Contreras-Sweet would be executive chairman of a majority female board. The businesswoman founded the Latino-focused Pro-America Bank—which was bought by Pacific Commerce Bank in 2015—and led the Small Business Administration under President Barack Obama. Wall Street Journal IN CASE YOU MISSED IT \n• RIP, Ursula . Ursula K. Le Guin died Monday afternoon at the age of 88. Le Guin was the author of popular science fiction and fantasy that introduced “a literary sensibility and a feminist bent” to the genres and was reportedly a huge influence on Salman Rushdie and Neil Gaiman. Our sister magazine EW interviewed the writer just last month: Entertainment Weekly \n• Lyfting up new parents. This month, Lyft dramatically expanded its parental leave policy to 18 weeks for both new mothers and fathers. Employees at the company have one mother to thank; here’s how Emily Johal made the case for—and got—expanded leave at the ride-sharing company. Slate \n• The other activists. A new study in HBR confirms what has long been hypothesized : Female CEOs face a greater threat of shareholder activism than male CEOs. The researchers in the Harvard study analyzed data from 3,026 large U.S. firms between 1996 and 2013 and found that firms led by male CEOs were targeted by an activist 6% of the time, versus 9.4% when the CEO was female. Harvard Business Review \n• BofA joins the club . Bank of America recently reviewed pay for U.S. and U.K. staff and found that women are paid on average 99% of what men are paid, according to an internal memo. The lender also said that it plans to further restrict asking job candidates about their pay history (see my story on the trend from last week). ", "external_links": [], "published": "2018-01-25T09:21:00.000+02:00", "crawled": "2018-01-25T00:51:13.024+02:00", "highlightTitle": ""}