{"organizations": [], "uuid": "d29f72e2d55651627a5eb54e493e0f16ed57bda0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221005926&w=1200&r=LYNXMPEE0A05S", "site_section": "http://feeds.reuters.com/news/wealth", "section_title": "Reuters: Money", "url": "https://www.reuters.com/article/us-money-education-gradstudents/grad-school-can-be-worth-it-if-you-pick-wisely-study-idUSKBN1F009O", "country": "US", "domain_rank": 408, "title": "Grad school can be worth it if you pick wisely: study", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T05:03:00.000+02:00", "replies_count": 0, "uuid": "d29f72e2d55651627a5eb54e493e0f16ed57bda0"}, "author": "", "url": "https://www.reuters.com/article/us-money-education-gradstudents/grad-school-can-be-worth-it-if-you-pick-wisely-study-idUSKBN1F009O", "ord_in_thread": 0, "title": "Grad school can be worth it if you pick wisely: study", "locations": [], "entities": {"persons": [{"name": "beth pinsker", "sentiment": "none"}], "locations": [], "organizations": [{"name": "min read  new york", "sentiment": "none"}, {"name": "sallie mae", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "how america pays for graduate school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 3:06 AM / Updated 4 hours ago Grad school can be worth it if you pick wisely: study Reuters Staff 5 Min Read \n(The Jan. 10 story was refiled to clarify description of Sallie Mae as a student loan lender instead of a student loan servicer in paragraph 3.) \nBy Beth Pinsker \nNEW YORK (Reuters) - There is a sharp contrast between how graduate school students and undergraduate students approach paying for their educations. While parents typically pay the bulk of tuition for bachelor’s degrees, those pursuing advanced degrees are largely left to their own devices. \nAs a result, grad students need to make careful decisions about the return on investment for their costly degrees. \nGraduate students are footing more than half of their education bills with loans in their own names, according to the How America Pays for Graduate School report from student loan lender Sallie Mae. \nThe report, released on Wednesday, marks the first time Sallie Mae has polled post-secondary students on how they pay for schooling. \nThe study found that just 15 percent of their educational funding comes from grants and scholarships. A quarter of the average $24,812 per-year tuition bill comes directly from student earnings, and hardly any comes from family contributions, according to the study. \nFor these students, the costs can be enormous, especially for law and medical programs, but the rewards can be just as big. Almost 60 percent expect to make $20,000 more a year than they would have without a degree, according to Sallie Mae. Success depends on whether the students pick a program and pursue a career that will pay off for them in the end. CAREFUL SELECTION \nWhen financial aid expert Jodi Okun, author of “Secrets of a Financial Aid Pro,” has clients ask how to fund grad school, they typically have already done their homework on the net cost of the programs, the prestige of the schools and what they will do with their degrees. \nOne woman wanted to get a physician’s assistant degree and her journey was typical of what the Sallie Mae study outlines. Her family was involved in her undergrad financing, but she was on her own with grad school. When choosing a program, she vacillated between a less expensive school and a more prestigious one, and eventually went for the big name. \n“The most expensive programs with the most debt – like law and medical – have enormous return on investment,” said Andrew Hanson, senior research analyst at the Georgetown University Center on Education and the Workforce. \nAlthough women constitute nearly 60 percent of the U.S. undergrad population, they are almost at parity with men in graduate school admission, according to government statistics. \nProgram selection factors greatly in the gender wage gap. Hanson noted that 34 percent of women pursuing graduate degrees are in an education field, where the median salary is less than $70,000, while that field attracts only 13 percent of men in grad school. By contrast, men are over-represented in fields like internet technology and business, where median earnings are over $100,000. \nResearch also shows that men tend to be over-represented in the highest-prestige programs, where the stipends and grants are most generous, so they end up having to take on less debt. \n“The segregation of men and women into different fields and into higher and lower prestige institutions is going to tend to exacerbate gender inequality in career outcomes among those who receive PhDs,” said Kim Weeden, a professor of sociology at Cornell University. \nAs the Sallie Mae study shows, the typical grad student is not pursuing a doctorate at Harvard, but is instead working on a master‘s. Tuition could be waived, and there is probably a stipend. If the student is too busy with course work and teaching to get another job, she is borrowing to cover living expenses. \n“Compared to going to undergrad, where it’s part of the American dream, far fewer grad students say they are going for a social experience. It’s for investing in the future and earnings. It’s tactical,” said Julia Clark, senior vice president at Ipsos, the polling firm that conducted the study for Sallie Mae. \nIn order for the gender wage gap to be eventually eliminated, a lot of math teachers are going to have to turn into engineers. “A lot of those choices result from interest, values and personality traits, but we want to make fields more open,” said Georgetown’s Hanson. Editing by Lauren Young and Matthew Lewis", "external_links": [], "published": "2018-01-11T05:03:00.000+02:00", "crawled": "2018-01-11T05:24:22.116+02:00", "highlightTitle": ""}