{"organizations": [], "uuid": "faf9cdb47383454f462c5f5369366729d7d5edcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/britain-stocks/update-1-britains-ftse-led-lower-by-ab-foods-and-utilities-idUSL8N1PD5LC", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Britain's FTSE led lower by AB Foods and utilities", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:13:00.000+02:00", "replies_count": 0, "uuid": "faf9cdb47383454f462c5f5369366729d7d5edcf"}, "author": "", "url": "https://www.reuters.com/article/britain-stocks/update-1-britains-ftse-led-lower-by-ab-foods-and-utilities-idUSL8N1PD5LC", "ord_in_thread": 0, "title": "UPDATE 1-Britain's FTSE led lower by AB Foods and utilities", "locations": [], "entities": {"persons": [{"name": "severn trent", "sentiment": "none"}, {"name": "danilo masoni", "sentiment": "none"}], "locations": [{"name": "milan", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "ab foods", "sentiment": "negative"}, {"name": "national grid", "sentiment": "none"}, {"name": "sse", "sentiment": "none"}, {"name": "associated british foods", "sentiment": "none"}, {"name": "whitbread", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 5:14 PM / Updated 11 minutes ago UPDATE 1-Britain's FTSE led lower by AB Foods and utilities Reuters Staff \n* FTSE 100 finishes 0.3 pct down; mid-caps drop 0.5 pct \n* Utilities among biggest fallers \n* AB Foods down on warning over sugar business \n* Break-up talk lifts Whitbread (Updates with closing prices) \nBy Danilo Masoni \nMILAN, Jan 18 (Reuters) - Britain’s blue-chip index fell on Thursday, led lower by utilities and a decline for Associated British Foods after warning that profit at its sugar business would fall more than previously forecast. \nThe FTSE ended 0.3 percent down at 7,700.96 points and the mid-cap index finished with a 0.5 percent fall. \nUtilities were weaker after a junior minister told a parliamentary committee that Britain hoped to pass laws to allow the capping of the most common form of gas and electricity tariffs for millions of households by the summer. \nSSE was among the biggest FTSE fallers, sliding 3.1 percent as the stock traded ex-dividend. Elsewhere in the sector National Grid fell 1.5 percent, Severn Trent retreated 0.1 percent and Centrica 1 percent. \n“The sector is struggling a bit, mainly because there seems to be loads of competition,” said City of London Markets trader Markus Huber, pointing to comparison websites that help consumers to find the best deals. \n“Also, with wholesale energy prices on the way up at the moment, there might be concerns that they won’t be able to pass these on to customers fully, especially with the price cap legislation hanging over them.” \nPrimark owner AB Foods was the biggest FTSE faller, dropping 3.6 percent. \nThe company maintained full-year earnings guidance on Thursday but said that revenue and profit at its sugar business would fall by more than previously expected because of lower European Union sugar prices. \nAmong gainers, Hargreaves rose by 4.3 percent after a price target upgrade from Barclays. \nWhitbread also rose, advancing 3.5 percent as prospects of a break-up of the company more than offset disappointment over a drop in sales for its Costa Coffee business in a tough British retail market. \nReuters reported late on Wednesday that investor Sachem Head was pushing the company to consider splitting the Costa Coffee chain from its hotels and restaurant businesses. \nAmong mid-caps, Balfour Beatty rose 1.6 percent after the infrastructure group released financial details on the positive impact expected from tax cuts in the United States. (Reporting by Danilo Masoni and Kit Rees; Editing by Toby Chopra and David Goodman)", "external_links": [], "published": "2018-01-18T19:13:00.000+02:00", "crawled": "2018-01-18T19:28:36.015+02:00", "highlightTitle": ""}