{"organizations": [], "uuid": "7b53418dff828f22290ee263824f5a9dec17cfcd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-sw-seed-company-expands-focus-in-hybrid-crops-with-appointment-of-david-callachor.html", "country": "US", "domain_rank": 767, "title": "S&W Seed Company Expands Focus in Hybrid Crops with Appointment of David Callachor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:01:00.000+02:00", "replies_count": 0, "uuid": "7b53418dff828f22290ee263824f5a9dec17cfcd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-sw-seed-company-expands-focus-in-hybrid-crops-with-appointment-of-david-callachor.html", "ord_in_thread": 0, "title": "S&W Seed Company Expands Focus in Hybrid Crops with Appointment of David Callachor", "locations": [], "entities": {"persons": [{"name": "david callachor", "sentiment": "negative"}], "locations": [{"name": "sacramento", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "s&w seed company", "sentiment": "negative"}, {"name": "s&w", "sentiment": "negative"}, {"name": "sv genetics", "sentiment": "none"}, {"name": "svg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SACRAMENTO, Calif., Jan. 29, 2018 /PRNewswire/ -- S&W Seed Company (Nasdaq: SANW) is pleased to announce the appointment of David Callachor as Commercial Manager – Hybrid Crops. Callachor will oversee sales and marketing and future development of the S&W hybrid sorghum and sunflower seed business on a global basis.\nS&W acquired its hybrid sorghum and sunflower seed business from SV Genetics (\"SVG\"), a private Australian company specializing in the breeding and licensing of proprietary hybrid sorghum and sunflower seed germplasm, in May 2016. SVG's sunflower breeding program had developed a series of proprietary germplasm that exhibited high yield, high oil, disease resistance, and outstanding standability, on a global basis. Its sorghum program represented a full pipeline of products developed with red and white grain sorghums, high tannin, resistance to the sugar cane aphid, and grain sorghums with high levels of heat and drought tolerance. In addition, SVG's forage sorghum program included a pipeline of sudan and sweet sorghums focused on improving seed production yields to lower costs of production and improve digestibility.\nS&W hybrid seed is currently produced in several countries and is sold in Argentina, Australia, Bolivia, Botswana, Brazil, China, Japan, Libya, Pakistan, South Africa, Ukraine and the United States. Market development is underway in many additional countries.\nMark Wong, CEO of S&W Seed Company, commented, \"We are dedicated to the expansion of our hybrid sorghum and sunflower programs. As we look to the future, we believe these programs will become an increasingly larger component of our business. The addition of a seasoned, commercial-minded executive such as David Callachor is an important step in building upon the strong trait development work completed by our breeding team. We look forward to establishing expanded market share while continuing to develop traits that we anticipate will allow us to become significant players in these crops going forward.\"\nCallachor is a senior agribusiness executive with over 20 years of experience in the agriculture industry, including extensive international experience in hybrid seeds, traits and new technologies. Callachor has worked with several global seed companies including Advanta Seeds and, most recently, Limagrain as Group Sales Manager for South East Asia. He also has worked with Landmark, an Agrium Company, for several years in Australia.\nCallachor will be based in S.E Queensland, Australia and can be contacted at davidcallachor@swseedco.com .\nAbout S&W Seed Company\nFounded in 1980, S&W Seed Company is a global agricultural company headquartered in Sacramento, California. S&W's vision is to be the world's preferred proprietary seed company which supplies a range of forage and specialty crop products that supports the growing global demand for animal proteins and healthier consumer diets. S&W is a global leader in alfalfa seed, with significant research and development, production and distribution capabilities. S&W's capabilities span the world's alfalfa seed production regions, with operations in the Western United States, including the San Joaquin and Imperial Valleys of California, Australia, and Canada, and S&W sells its seed products in more than 30 countries around the globe. S&W also provides hybrid sorghum and sunflower, and is utilizing its research and breeding expertise to develop and produce stevia, the all-natural, zero calorie sweetener for the food and beverage industry. For more information, please visit www.swseedco.com .\nSafe Harbor Statement\nThis release contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended and such forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. \"Forward-looking statements\" describe future expectations, plans, results, or strategies and are generally preceded by words such as \"may,\" \"future,\" \"plan\" or \"planned,\" \"will\" or \"should,\" \"expected,\" \"anticipates,\" \"draft,\" \"eventually\" or \"projected.\" Forward-looking statements in this release include, but are not limited to, statements regarding the advancement of our hybrid sorghum and sunflower programs, significance of these programs in relation to our business as a whole, our efforts to expand market share and the impact of trait development on our competitive position in the market. You are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances, events, or results to differ materially from those projected in the forward-looking statements, including the risk that actual results may differ materially from those projected. These and other risks are identified in our filings with the Securities and Exchange Commission, including without limitation our Annual Report on Form 10-K for the fiscal year ended June 30, 2017, and in our other filings subsequently made with the Securities and Exchange Commission. All forward-looking statements contained in this press release speak only as of the date on which they were made. We do not undertake any obligation to publicly update any forward-looking statements, whether as a result of the receipt of new information, the occurrence of future events or otherwise.\nCompany Contact:\nInvestor Contact:\nMatthew Szot, Chief Financial Officer\nJoe Dorame, Robert Blum, Joe Diaz\nS&W Seed Company\nLytham Partners, LLC\nPhone: (559) 884-2535\nPhone: (602) 889-9700\nwww.swseedco.com\nsanw@lythampartners.com\nwww.lythampartners.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/sw-seed-company-expands-focus-in-hybrid-crops-with-appointment-of-david-callachor-300589315.html\nSOURCE S&W Seed Company", "external_links": ["http://www.swseedco.com/", "http://www.lythampartners.com/", "http://www.prnewswire.com/news-releases/sw-seed-company-expands-focus-in-hybrid-crops-with-appointment-of-david-callachor-300589315.html"], "published": "2018-01-29T17:01:00.000+02:00", "crawled": "2018-01-29T19:38:33.000+02:00", "highlightTitle": ""}