{"organizations": [], "uuid": "fe2bf4207244c9242fbaf8b265bdad37cb86961f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-davos-meeting-oceans-waste/rising-tide-of-innovation-at-davos-to-keep-plastic-out-of-the-sea-idUSKBN1FC2BZ", "country": "US", "domain_rank": 408, "title": "Rising tide of innovation at Davos to keep plastic out of the sea", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:44:00.000+02:00", "replies_count": 0, "uuid": "fe2bf4207244c9242fbaf8b265bdad37cb86961f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-meeting-oceans-waste/rising-tide-of-innovation-at-davos-to-keep-plastic-out-of-the-sea-idUSKBN1FC2BZ", "ord_in_thread": 0, "title": "Rising tide of innovation at Davos to keep plastic out of the sea", "locations": [], "entities": {"persons": [{"name": "ellen macarthur", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "ellen macarthur foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Technology that could avoid the equivalent of 100 garbage bags of plastic waste being created per second received a funding boost at the World Economic Forum in Davos, Switzerland, on Tuesday.\nThe five winners of the “Circular Materials Challenge”, which focuses on the 30 percent of plastic packaging that is too small or complex to be recycled and often ends up in the ocean, will share the $1 million prize to develop their solutions, said the Ellen MacArthur Foundation and innovation network NineSigma.\nThe lightweight packaging used for products such as sauces, fresh coffee and snacks, is made of several layers of different materials, making it expensive and hard to recycle.\n“We urgently need solutions that address the root causes of the problem, not just the symptoms,” world record-breaking sailor Ellen MacArthur said in a statement.\n“In a New Plastics Economy, plastics will never become waste or enter the ocean in the first place.”\nThe winners will join a 12-month program working with experts to make their innovations marketable at scale.\nThey include the University of Pittsburgh which is applying nano-engineering to mimic the way nature uses molecular building blocks, to create a recyclable material that can replace multi-layered packaging.\nThe VTT Technical Research Centre of Finland, another recipient, has created a compostable material from forestry by-products that can be used to make pouches for food, including muesli, nuts and rice.\nFrom fishing lines to flip flops, there are more than 5 trillion pieces of plastic floating in the world’s oceans, according to a 2014 study.\nMore than 8 million tonnes of plastics enter the ocean each year while the three major international ocean clean-ups combined deal with less than 0.5 percent of that volume, said the UK-based foundation set up by MacArthur.\nThe award is also supported by philanthropist Wendy Schmidt, wife of former Google executive Eric Schmidt, who together sponsor a number of global initiatives to advance ocean exploration and clean-ups.\n“The technical innovations developed by our winners are exactly what is needed to begin to address the wasteful material culture of the past century that is creating increasing amounts of microplastics and plastic debris on our shorelines, in our oceans, landfills and even our own bodies,” Schmidt said.\nConsumer brands such as Evian, Mars, PepsiCo, Unilever and Walmart, as well as some governments, are taking steps to tackle the problem of plastic ocean waste.\nPaul Polman, chief executive of personal goods multinational Unilever, called on more companies to commit to 100 percent reusable, recyclable or compostable packaging by 2025.\nHe also backed the introduction of a “Global Plastics Protocol” setting industry standards on what materials are put into the marketplace.\nAn estimated $80 billion to $120 billion of plastic packaging material is lost to the economy each year, which creates a financial incentive for business to reuse plastic, the Ellen MacArthur Foundation has said.\nReporting by Adela Suliman; editing by Megan Rowling. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T00:44:00.000+02:00", "crawled": "2018-01-24T15:19:32.000+02:00", "highlightTitle": ""}