{"organizations": [], "uuid": "5aff25a11cb50592e3534a63fa967b18a616f424", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-ampliphi-biosciences-announces-positive-interim-results-for-single-patient-expanded-access-program-utilizing-ab-sa01-and-ab.html", "country": "US", "domain_rank": 767, "title": "AmpliPhi Biosciences Announces Positive Interim Results for Single-Patient Expanded Access Program Utilizing AB-SA01 and AB-PA01", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-04T00:05:00.000+02:00", "replies_count": 0, "uuid": "5aff25a11cb50592e3534a63fa967b18a616f424"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-ampliphi-biosciences-announces-positive-interim-results-for-single-patient-expanded-access-program-utilizing-ab-sa01-and-ab.html", "ord_in_thread": 0, "title": "AmpliPhi Biosciences Announces Positive Interim Results for Single-Patient Expanded Access Program Utilizing AB-SA01 and AB-PA01", "locations": [], "entities": {"persons": [], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "ampliphi biosciences announces positive interim results", "sentiment": "negative"}, {"name": "fda", "sentiment": "none"}, {"name": "ampliphi", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "ampliphi biosciences corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Seven patients with serious, life-threatening infections, not responding to antibiotics, were treated with AB-SA01 or AB-PA01, with six patients, 86%, achieving treatment success Treatment was well tolerated in all patients, with over 500 doses administered intravenously or by inhalation AmpliPhi expects to continue its expanded access clinical strategy in 2018, review data with the FDA in mid-2018, and initiate a Phase 2 or registrational clinical program potentially as early as the second half of 2018 Management will host webcast/conference call today at 4:30 p.m. EST/1:30 p.m. PST\nSAN DIEGO--(BUSINESS WIRE)-- AmpliPhi Biosciences Corporation (NYSE American: APHB) , a clinical-stage biotechnology company focused on precisely targeted bacteriophage therapeutics for antibiotic-resistant infections, today announced topline results for the first seven patients treated under its ongoing single-patient expanded access program. Six of the seven patients (86%) achieved treatment success (physician’s assessment), defined as complete resolution or significant improvement of baseline signs and symptoms. All patients were severely ill and unresponsive to antibiotic treatment at the time of enrollment.\n“I am very encouraged by these initial results for treatment with AB-SA01 or AB-PA01 in severely ill patients who were not responding to antibiotics,” stated Paul C. Grint, M.D., CEO of AmpliPhi Biosciences. “We look forward to treating up to an additional 20 patients during the first half of 2018 and discussing our findings with the FDA to determine a development path forward to registration. Our ongoing dialogue with infectious disease thought leaders continues to indicate growing support for our program.”\n“Bacteriophage therapeutics have the potential to be a safe and potent modality for treating serious bacterial infections, and also provide an option for those with antibiotic resistant or relapsing infection. Encouraging initial results make it important to proceed to full clinical evaluation and further development of this therapeutic approach,” said Dr. Jonathan Iredell, Director of Infectious Diseases at the Westmead Hospital in Sydney and Professor of Medicine and Microbiology at the University of Sydney and Westmead Institute of Medical Research.\n“The treatment with bacteriophages of severely ill patients with antibiotic-resistant infections warrants further clinical investigation and holds promise as a new approach to this critical unmet medical need,” said Robert T. Schooley, M.D., Professor in the infectious disease division at the University of California, San Diego. “The FDA also recognizes that multi-drug resistant infections are a real problem and I believe they see this approach as one that clearly needs to be evaluated.”\n“Bacteriophage therapies have been around for the past hundred years,” said Igor P. Bilinsky, Ph.D., COO of AmpliPhi. “It is only now, enabled by advances in biologics manufacturing and DNA sequencing, that we are able to produce GMP grade phage products that could be suitable for intravenous administration. This is an important step for developing phages as a novel, precisely targeted therapeutic modality for patients with serious infections who have few or no other treatment options and for helping humanity solve the growing crisis of antibiotic resistance.”\nExpanded Access Program Design and Topline Results\nThe expanded access approach allows critically ill patients to receive experimental, unapproved therapies in an attempt to save lives. Severely ill patients can receive treatment in the U.S. under an emergency IND and in Australia under the Special Access Scheme. AmpliPhi’s lead product candidates, AB-SA01, for Staphylococcus aureus infections, and AB-PA01, for Pseudomonas aeruginosa infections, are being provided through this program. Among the first seven patients treated, four patients received intravenous AB-SA01 and three received AB-PA01 administered intravenously and in some cases as an inhaled therapy. Bacteriophage treatment was administered along with the treating physician’s choice of best available antibiotic therapy. Treated patients suffered from bacteremia, endocarditis and lung infections, and both investigational products were well tolerated in all patients with no treatment-related serious adverse events reported.\nTreatment success, defined as complete resolution or significant improvement of baseline signs and symptoms, was reported in six out of seven patients (86%) by physician’s assessment. One patient was determined to be a treatment failure due to death, which occurred during surgery after three days of bacteriophage treatment. The treating physician determined that the one death was unrelated to treatment with bacteriophage therapy. The 28-day all-cause mortality rate was 14%. No additional deaths occurred up to 90 days following initiation of therapy, and patient follow up is continuing. Based on the APACHE II scores (a validated critical care scoring system predictive of mortality) of the seven patients prior to initiation of bacteriophage therapy, the predicted mortality rate for this patient group was 46%.\nNo bacterial isolates resistant to the bacteriophage therapeutics were detected during the bacteriophage treatment course. Additional analyses of these data are ongoing, and presentations or publications of the detailed results are planned.\nConference Call and Webcast\nAmpliPhi will hold a conference call today beginning at 4:30 p.m. Eastern time (1:30 p.m. Pacific time) to discuss these results. The conference call dial-in number is (866) 652-5200 for domestic callers and (412) 317-6060 for international callers, and the passcode is 10115452. A live webcast of the call will be available on the Investor Relations section of www.ampliphibio.com .\nA recording of the call will be available for 48 hours beginning approximately two hours after the completion of the call by dialing (877) 344-7529 for domestic callers and (412) 317-0088 for international callers. Please use passcode 10115452 to access the recording. A webcast replay will be available on the Investor Relations section of www.ampliphibio.com for 30 days, beginning approximately two hours after the completion of the call.\nAbout AmpliPhi Biosciences\nAmpliPhi Biosciences Corporation is a clinical-stage biotechnology company focused on the development of precisely targeted bacteriophage therapeutics for patients with serious and life-threatening antibiotic-resistant bacterial infections. AmpliPhi’s lead product candidates target multidrug-resistant Staphylococcus aureus and Pseudomonas aeruginosa, which are included on the WHO’s 2017 Priority Pathogens List. Phage therapeutics are uniquely positioned to address the threat of antibiotic-resistance as they can be precisely targeted to kill select bacteria, have a differentiated mechanism of action, can penetrate and disrupt biofilms (a common bacterial defense mechanism against antibiotics), are potentially synergistic with antibiotics and have been shown to restore antibiotic sensitivity to drug-resist", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ampliphibio.com&esheet=51737454&newsitemid=20180103006076&lan=en-US&anchor=www.ampliphibio.com&index=2&md5=2aebbddbc57de173621fae470055a053", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ampliphibio.com%2F&esheet=51737454&newsitemid=20180103006076&lan=en-US&anchor=www.ampliphibio.com&index=3&md5=a1eec253c6b2b9e1abc3edf542180851", "http://www.businesswire.com/news/home/20180103006076/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ampliphibio.com&esheet=51737454&newsitemid=20180103006076&lan=en-US&anchor=www.ampliphibio.com&index=1&md5=5778eaaf81d65640d86e87130052a4e1"], "published": "2018-01-04T00:05:00.000+02:00", "crawled": "2018-01-04T00:37:06.014+02:00", "highlightTitle": ""}