{"organizations": [], "uuid": "4280106dbb4bc360e56f11cf1eb67d6188c82ceb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-livexlive-media-appoints-former-espn-ceo-and-cable-industry-pioneer-roger-werner-as-special-advisor.html", "country": "US", "domain_rank": 767, "title": "LiveXLive Media Appoints Former ESPN CEO And Cable Industry Pioneer Roger Werner As Special Advisor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:30:00.000+02:00", "replies_count": 0, "uuid": "4280106dbb4bc360e56f11cf1eb67d6188c82ceb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-livexlive-media-appoints-former-espn-ceo-and-cable-industry-pioneer-roger-werner-as-special-advisor.html", "ord_in_thread": 0, "title": "LiveXLive Media Appoints Former ESPN CEO And Cable Industry Pioneer Roger Werner As Special Advisor", "locations": [], "entities": {"persons": [{"name": "roger werner", "sentiment": "negative"}, {"name": "roger", "sentiment": "none"}, {"name": "rob ellin", "sentiment": "none"}, {"name": "werner", "sentiment": "none"}], "locations": [{"name": "beverly hills", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "espn", "sentiment": "negative"}, {"name": "cable industry pioneer", "sentiment": "negative"}, {"name": "livexlive media, inc.", "sentiment": "neutral"}, {"name": "fox sports west", "sentiment": "none"}, {"name": "livexlive media", "sentiment": "none"}, {"name": "fox sports americas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEVERLY HILLS, Calif., Jan. 24, 2018 /PRNewswire/ -- LiveXLive Media, Inc. (OTC: LIVX) (\"LiveXLive\"), one of the only premium networks devoted to live music and music-related video content, today announced that cable industry pioneer Roger Werner has been appointed special advisor to the company. Werner has more than 30 years of experience in the television and digital industries - designing, building and managing some of world's most successful networks, including ESPN and what is now Fox Sports West and Fox Sports Americas.\n\"Roger was on the ground floor in the development of the pay TV programming industry, and he continues to build revolutionary programming services in the digital OTT world. He is a true visionary and his insight will be invaluable as we scale LiveXLive,\" commented LiveXLive Media Chairman and CEO Rob Ellin.\nWerner began working with ESPN to create and implement the start-up network's original strategic and operational plans in 1980. He became ESPN's chief operating officer in 1982 and its president and chief executive officer in 1988. During his nine years in senior management roles, ESPN became the world's largest and most profitable cable television network. Between 1982 and 1990, Werner's team pioneered exclusive Sunday night NFL coverage and international events such as the America's Cup and the Formula One World Championship. ESPN also developed sports networks in over twenty international markets during this period.\n\"LiveXLive is defining an untapped, massive market in music that is in many ways analogous to the development of distribution in the sports market,\" said Roger Werner. \"I am excited to join forces with LiveXLive's world-class leadership team to help them build an incredible experience for music fans around the world, in a way that has never been done before.\"\nFollowing his roles at ESPN, Werner went on to help build Prime Ticket, now Fox Sports West, into America's largest and most valuable regional cable network. He simultaneously launched America's first Spanish language sports network, La Cadena Deportiva, which is now Fox Sports Americas. He later developed and served as president and CEO of Speedvision, which is now Fox Sports 1, and OLN, which is now NBC Sports.\nWerner continues to innovate in the sports video market. In 2013, he developed Torque.TV, which is currently marketed as MotorTrend on Demand and has evolved into North America's leading SVOD platform for automotive enthusiasts. And in 2015, he became an investor and a director of the World's leading publisher of digital automotive and action sports content, TEN (The Enthusiast Network).\nAbout LiveXLive Media, Inc.\nLiveXLive Media, Inc. (\"LiveXLive Media\") is a consolidated group of premier media brands and technology assets that create a social media ecosystem for music, including the LiveXLive platform (\"LiveXLive\"). LiveXLive is one of the world's only premium streaming services devoted to live music and music-related video content, delivering live streamed and premium, on demand original content to nearly any internet-connected screen. Since its launch in 2015, LiveXLive has been building an online destination for music fans to enjoy premium live performances from music venues and leading music festivals around the world, such as Rock in Rio, Outside Lands Music and Arts Festival and Hangout Music Festival, as well as premium original content, artist exclusives and industry interviews. The LiveXLive platform has featured performances and content from some of the most popular artists in various music genres, including Rihanna, Katy Perry, Metallica, Duran Duran, Radiohead, Chance The Rapper, Bruce Springsteen, Major Lazer and Maroon 5.\nLiveXLive Media's businesses also include social media influencer venture LiveXLive Influencers. LiveXLive Media is headquartered in Beverly Hills, CA. For more information, visit our website at www.livexlive.com and follow us on Facebook, Instagram and Twitter at @livexlive.\nInvestor Contacts:\nAlex Wellins\nThe Blueshirt Group\nalex@blueshirtgroup.com\n(415) 217-5861\nChris Tyson\nMZ North America\nchris.tyson@mzgroup.us\n949-491-8235\nMedia Contact:\nKristi Mexia\nBeck Media & Marketing\nkristi.mexia@beckmedia.com\n(310) 300-4800\nView original content with multimedia: http://www.prnewswire.com/news-releases/livexlive-media-appoints-former-espn-ceo-and-cable-industry-pioneer-roger-werner-as-special-advisor-300587269.html\nSOURCE LiveXLive Media, Inc.", "external_links": ["http://www.livexlive.com/", "http://www.prnewswire.com/news-releases/livexlive-media-appoints-former-espn-ceo-and-cable-industry-pioneer-roger-werner-as-special-advisor-300587269.html"], "published": "2018-01-24T16:30:00.000+02:00", "crawled": "2018-01-24T19:12:39.006+02:00", "highlightTitle": ""}