{"organizations": [], "uuid": "62eb58bb3bf17fe0bf7896880768bb7e7d4493b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-ramius-to-reject-qualcomms-tender-offer-for-nxp-semiconductors-shares.html", "country": "US", "domain_rank": 767, "title": "Ramius to Reject Qualcomm's Tender Offer for NXP Semiconductors Shares", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:00:00.000+02:00", "replies_count": 0, "uuid": "62eb58bb3bf17fe0bf7896880768bb7e7d4493b0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-ramius-to-reject-qualcomms-tender-offer-for-nxp-semiconductors-shares.html", "ord_in_thread": 0, "title": "Ramius to Reject Qualcomm's Tender Offer for NXP Semiconductors Shares", "locations": [], "entities": {"persons": [{"name": "ramius", "sentiment": "negative"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "nxp semiconductors shares believes current", "sentiment": "negative"}, {"name": "qualcomm", "sentiment": "negative"}, {"name": "ramius advisors llc ramius", "sentiment": "none"}, {"name": "nxp", "sentiment": "none"}, {"name": "board of directors of nxp", "sentiment": "none"}, {"name": "broadcom", "sentiment": "none"}, {"name": "cowen investment management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Believes Current Offer Dramatically Undervalues NXP\nNEW YORK--(BUSINESS WIRE)-- Ramius Advisors LLC (\"Ramius\"), an institutional investment manager and shareholder of both NXP Semiconductors (\"NXP\") (NASDAQ: NXPI) and Qualcomm (NASDAQ: QCOM), announced today its intention to reject Qualcomm's current tender offer for NXP shares. Ramius has communicated to the management and Board of Directors of NXP that it believes Qualcomm's offer dramatically undervalues NXP.\nRamius believes that the successful completion of the NXP acquisition will significantly enhance the value of Qualcomm, with or without the consummation of the conditional takeover bid from Broadcom. Should Qualcomm fail to complete its acquisition of NXP, Ramius believes that Qualcomm shareholders will seriously question the ability of Qualcomm to execute its strategy as an independent entity.\nAbout Ramius Advisors LLC\nRamius is an institutional asset manager, based in New York City. The firm is an affiliate of Cowen Investment Management, which had assets of $10.5 billion as of November 1, 2017. Cowen Investment Management is wholly owned by Cowen Inc.\nCowen Inc. is a diversified financial services firm and, together with its consolidated subsidiaries, provides alternative asset management, investment banking, research, sales and trading, prime brokerage, global clearing and commission management through its two business segments: Cowen Investment Management and its affiliates make up the Company’s alternative investment segment, while Cowen and Company, a member of FINRA and SIPC, and its affiliates make up the Company’s broker-dealer segment. Cowen Investment Management provides alternative asset management solutions to a global client base and manages a significant portion of Cowen’s proprietary capital. Cowen and Company and its affiliates offer industry focused investment banking for growth-oriented companies, domain knowledge-driven research, a sales and trading platform for institutional investors and a comprehensive suite of prime brokerage services. Founded in 1918, the firm is headquartered in New York and has offices worldwide. For additional information, visit www.cowen.com .\nDepending on overall market conditions and other investment opportunities available to Ramius funds, Ramius and its advised funds may endeavor to increase or decrease their respective exposures to various securities on such terms as Ramius deems advisable. Nothing herein should be taken as a representation or warranty regarding the current or future trading or voting intentions of Ramius and its advised funds. Ramius reserves the right to change any of the views expressed herein at any time, and Ramius has no duty to update this release or otherwise provide notice of such changes.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005705/en/\nMedia :\nGagnier Communications\nDan Gagnier, 646-569-5897\ndg@gagnierfc.com\nSource: Ramius Advisors LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cowen.com&esheet=51743431&newsitemid=20180116005705&lan=en-US&anchor=www.cowen.com&index=1&md5=684377202ce6bdfe8af332d3515bc40b", "http://www.businesswire.com/news/home/20180116005705/en/"], "published": "2018-01-16T16:00:00.000+02:00", "crawled": "2018-01-16T16:28:42.022+02:00", "highlightTitle": ""}