{"organizations": [], "uuid": "3267eb61566bc8f57b136dfc7c127ab86d4dfbb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/18/103879714-GettyImages-451882264.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/heres-how-much-ceo-pay-has-increased-compared-to-yours-over-the-years.html", "country": "US", "domain_rank": 767, "title": "Here's how much CEO pay has increased compared to yours over the years", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-22T19:14:00.000+02:00", "replies_count": 0, "uuid": "3267eb61566bc8f57b136dfc7c127ab86d4dfbb4"}, "author": "Ruth Umoh", "url": "https://www.cnbc.com/2018/01/22/heres-how-much-ceo-pay-has-increased-compared-to-yours-over-the-years.html", "ord_in_thread": 0, "title": "Here's how much CEO pay has increased compared to yours over the years", "locations": [], "entities": {"persons": [{"name": "scott eells", "sentiment": "neutral"}, {"name": "philippe dauman", "sentiment": "neutral"}, {"name": "nicholas bloom", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "sun valley lodge", "sentiment": "none"}, {"name": "sun valley", "sentiment": "none"}, {"name": "idaho", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "neutral"}, {"name": "stanford", "sentiment": "none"}, {"name": "viacom inc.", "sentiment": "none"}, {"name": "wnyc", "sentiment": "none"}, {"name": "allen & co", "sentiment": "none"}, {"name": "economic policy institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CEO pay is quickly outpacing yours. In 2016, the CEOs of the top 350 U.S. firms earned on average $15.6 million.\n\"There are CEOs getting paid hundreds of millions,\" Stanford economics professor Nicholas Bloom tells WNYC \"Freakonomics Radio\" podcast . \"So I find it hard to defend those amounts.\"\nAccording to a report from the Economic Policy Institute , the average CEO pay is 271 times the nearly $58,000 annual average pay of the typical American worker.\nAlthough the 271:1 ratio is high, it's still not as high as in previous years. In 2015, CEOs made 286 times the salary of a typical worker and 299 times more in 2014. Compare that to 1978, when CEO earnings were roughly 30 times the typical worker's salary.\nBut what's really attention-grabbing, according to the report, is the rate at which a CEO's pay has increased over the years compared to the average employee.\nAccording to the Economic Policy Institute:\nSince 1978, and adjusted for inflation, American workers have seen an 11.2 percent increase in compensation. During that same period, CEO's have seen a 937 percent increase in earnings. That salary growth is even 70 percent faster than the rise in the stock market, according to the Economic Policy Institute.\n\nCEO pay still remains high compared to that of \"very high wage earners.\" The average CEO in a large firm earns 5.33 times the annual earnings of those in the .1 percent .\nThough some argue that CEO pay is based on experience and what their role entails, the study finds that's actually not the case.\n\"CEOs are getting more because of their power to set pay, not because they are more productive or have special talent or have more education,\" says the report. \"Exorbitant CEO pay means that the fruits of economic growth are not going to ordinary workers, since the higher CEO pay does not reflect correspondingly higher output.\"\nHowever, economists say that it's difficult, if not impossible, to pinpoint the right amount a CEO should be paid.\n\"There is no one that can definitively say that's too much or too little,\" says Bloom. The Stanford professor adds that the job of a CEO is a difficult one that has a heavy impact on the economy and the company's employees. With this in mind, businesses want to lure in the best possible candidate and one way to to do that is through salary.\n\"Being a CEO of a big company is a hundred-hour-a-week job. It consumes your life. It consumes your weekend. It's super-stressful,\" Bloom explains on the podcast. \"You really want to make sure that they're motivated and also rewarded. \"\nYale leadership expert Jeff Sonnenfeld says that the main issue isn't so much the astronomical pay, but rather the disparity between performance and pay.\nThe United Parcel Service is a very strong company, yet ranks low in terms of compensation, he tells the podcast. \"But Philippe Dauman, who ran Viacom until recently, was being paid more than the very high-performing CEOs of Disney and Time Warner combined. And Viacom was a disaster.\"\nThe Economic Policy Institute argues that CEO pay should decrease. Contrary to popular belief, their research shows that if this were to occur, there would be no \"adverse impact on output or employment.\" Here are the four key ways the institute says to address this issue:\nReinstate higher marginal income tax rates at the very top. Remove the tax break for executive performance pay. Set corporate tax rates higher for firms that have higher ratios of CEO-to-worker compensation. Allow greater use of \"say on pay,\" which allows a firm's shareholders to vote on top executives' compensation. Like this story? Like CNBC Make It on Facebook . \nSee also: \nThe 'critically important' trait that makes a CEO successful, according to a Stanford econ professor \nThe 50 most innovative companies to work for in 2018 \nSelf-made billionaire Tilman Fertitta says you should still send handwritten thank you cards \nshow chapters Here is why this billionaire wanted to have a plane by 35      11:19 AM ET Tue, 29 Nov 2016 | 00:46", "external_links": [], "published": "2018-01-22T19:14:00.000+02:00", "crawled": "2018-01-22T19:15:33.017+02:00", "highlightTitle": ""}