{"organizations": [], "uuid": "0b178b0506921f223118baacd4a8062a093454a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-american-assets-trust-inc-announces-fourth-quarter-and-year-end-2017-earnings-release-date-and-conference-call-information.html", "country": "US", "domain_rank": 767, "title": "American Assets Trust, Inc. Announces Fourth Quarter and Year-End 2017 Earnings Release Date and Conference Call Information", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T00:15:00.000+02:00", "replies_count": 0, "uuid": "0b178b0506921f223118baacd4a8062a093454a8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-american-assets-trust-inc-announces-fourth-quarter-and-year-end-2017-earnings-release-date-and-conference-call-information.html", "ord_in_thread": 0, "title": "American Assets Trust, Inc. Announces Fourth Quarter and Year-End 2017 Earnings Release Date and Conference Call Information", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 12, 2018 (GLOBE NEWSWIRE) -- American Assets Trust, Inc. (NYSE:AAT) (the “Company”) will announce its fourth quarter and year-end 2017 earnings in a press release to be issued after the market closes on Tuesday, February 13, 2018.\nSenior management will hold a conference call for its fourth quarter and year-end 2017 earnings on Wednesday, February 14, 2018 at 8:00 a.m. Pacific Time (“PT”). Conference call access information is as follows:\nToll Free Number: 1 (877) 868-5513\nPass Code: 8399474\nA telephonic replay of the conference call will be available beginning at 2:00 p.m. PT on Wednesday, February 14, 2018 through Wednesday, February 21, 2018. Replay access information is as follows:\nToll Free Number: 1 (855) 859-2056\nPass Code: 8399474\nA live on-demand audio webcast of the conference call will be available on the “Investor Relations” section of the Company’s website at www.americanassetstrust.com .\nAbout American Assets Trust, Inc.\nAmerican Assets Trust, Inc. is a full service, vertically integrated and self-administered real estate investment trust, or REIT, headquartered in San Diego, California. The Company has over 50 years of acquiring, improving, developing and managing premier retail, office and residential properties throughout the United States in some of the nation’s most dynamic, high-barrier-to-entry markets primarily in Southern California, Northern California, Oregon, Washington and Hawaii. The Company's retail portfolio comprises approximately 3.2 million rentable square feet, and its office portfolio comprises approximately 2.7 million square feet. In addition, the Company owns one mixed-use property (including approximately 97,000 rentable square feet of retail space and a 369-room all-suite hotel) and over 2,112 multifamily units. In 2011, the Company was formed to succeed to the real estate business of American Assets, Inc., a privately held corporation founded in 1967 and, as such, has significant experience, long-standing relationships and extensive knowledge of its core markets, submarkets and asset classes. For additional information, please visit www.americanassetstrust.com .\nForward Looking Statements\nThis press release may contain within the meaning of the federal securities laws, which are based on current expectations, forecasts and assumptions that involve risks and uncertainties that could cause actual outcomes and results to differ materially. Forward-looking statements relate to expectations, beliefs, projections, future plans and strategies, anticipated events or trends and similar expressions concerning matters that are not historical facts. In some cases, you can identify by the use of forward-looking terminology such as \"may,\" \"will,\" \"should,\" \"expects,\" \"intends,\" \"plans,\" \"anticipates,\" \"believes,\" \"estimates,\" \"predicts,\" or \"potential\" or the negative of these words and phrases or similar words or phrases which are predictions of or indicate future events or trends and which do not relate solely to historical matters. While reflect the Company's good faith beliefs, assumptions and expectations, they are not guarantees of future performance. For a further discussion of these and other factors that could cause the Company's future results to any , see the section entitled \"Risk Factors\" in the Company's annual report on Form 10-K filed on February 17, 2017 and other risks described in documents subsequently filed by the Company from time to time with the Securities and Exchange Commission. The Company disclaims any obligation to publicly update or revise any forward-looking statement to reflect changes in underlying assumptions or factors, of new information, data or methods, future events or other changes.\nSource: American Assets Trust, Inc.\nInvestor and Media Contact:\nAmerican Assets Trust\nRobert F. Barton\nExecutive Vice President and Chief Financial Officer\n858-350-2607\nSource:American Assets Trust, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/039173ef-5994-47b6-8c9e-ef64e7f4df68", "https://www.globenewswire.com/Tracker?data=X9-jJmkCVPQim6xYCuivXjMKMTWnOvWP2D8ulg7qKUrIloG_RcI-wMppygC2a43bNdyqR2uW3X38eAse4ozJCFavmPs_ekIsSoJpz3Z8L6ILRvhlqoWdE5gu1h-V1dHt"], "published": "2018-01-13T00:15:00.000+02:00", "crawled": "2018-01-13T02:07:34.087+02:00", "highlightTitle": ""}