{"organizations": [], "uuid": "65fa758a7ddd785b943c613f4260bc111e44ebe5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-dollar-hurt-by-u-s-shutdown-fears-treasury-yields-at-highest-since-2014-idUSL8N1PE1AJ", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-US shutdown fears hurt dollar, Treasury yields at highest since 2014", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-19T17:15:00.000+02:00", "replies_count": 0, "uuid": "65fa758a7ddd785b943c613f4260bc111e44ebe5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-dollar-hurt-by-u-s-shutdown-fears-treasury-yields-at-highest-since-2014-idUSL8N1PE1AJ", "ord_in_thread": 0, "title": "GLOBAL MARKETS-US shutdown fears hurt dollar, Treasury yields at highest since 2014", "locations": [], "entities": {"persons": [{"name": "dhara ranasinghe", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "ust", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Worries over possible U.S. government shutdown weigh on dollar\n* US lawmakers try to cobble together deal to avert shutdown\n* 10-year UST yields hit highest since Sep 2014\n* But stocks on firm ground, US futures higher\n* Graphic: World FX rates in 2018 tmsnrt.rs/2egbfVh\nBy Dhara Ranasinghe\nLONDON, Jan 19 (Reuters) - The dollar wallowed near three-year lows on Friday as heightened fears of a U.S. government shutdown unnerved investors, while U.S. Treasury yields continued an upward march to hit their highest levels since September 2014.\nLegislation to stave off an imminent federal government shutdown encountered obstacles in the Senate on Thursday night, despite the passage of a month-long funding bill by the House of Representatives hours earlier.\nWithout the injection of new money, no matter how temporary, scores of federal agencies will be forced to shut starting at midnight on Friday, when existing funds expire.\nThe dollar index, which measures the greenback’s value against other major currencies, was down 0.3 percent and close to this week’s three-year lows.\nIt was heading for a fifth week of falls and has lost 2 percent in the early days of 2018.\n“Odds of a U.S. government shutdown have risen sharply in the past 24 hours,” said ING currency strategist Viraj Patel.\n“While we would expect such noise to keep the dollar on the back foot, any fundamental fallout at this stage would seem premature – not least as history tends to show that some sort of conciliatory approach to keep the government functioning in the long-run will ultimately prevail within Congress.”\nMarket players said worries of a shutdown may have also weighed on sentiment in bond markets, which remain under pressure from expectations that strong economic data globally will encourage the U.S. Federal Reserve to press ahead with monetary tightening.\nU.S. 10-year Treasury yields hit their highest level in more than three years at 2.642 percent on Friday.\nMarie Owens Thomsen, chief economist at Indosuez, said the firm attributed a 30 percent probability of a shutdown -- an event that could push yields higher.\nSTOCKS ON SOLID GROUND U.S. stock futures traded broadly higher , pointing to a firm open for Wall Street and suggesting equity investors were shrugging off the wrangling in Washington.\nStock markets in London, Paris and Frankfurt were 0.3 to 1 percent higher, while the pan-regional STOXX 600 hit a new 2-1/2 year peak as confidence over economic and earnings growth helped consolidate a strong start to the year.\nThe MSCI world equity index, which tracks shares in 47 countries, also touched record highs with Asian stock markets continuing to benefit from data on Thursday that showed China’s growth in 2017 accelerated for the first time in seven years.\nChina stocks closed at two-year highs, with the Shanghai index posting its fifth straight week of gains. Japan’s Nikkei ended the day 0.2 percent higher.\nEURO SHINES The euro rose 0.2 percent to $1.2260 after hitting a three-year peak above $1.2300 earlier this week on expectations that the European Central Bank would take steps towards winding back on stimulus measures to normalise monetary policy.\nThe euro’s rally was tempered later as some ECB officials voiced worries about the currency’s strength.\nChina’s yuan meanwhile breached the psychologically important 6.4 dollar level for the first time in more than two years the day after Beijing said annual growth was 6.8 percent in October-December, slightly above forecasts.\nOil prices slid and were on course for the biggest weekly falls since October, as a bounce-back in U.S. production outweighed ongoing declines in crude inventories.\nBrent crude futures were at $68.67 a barrel, down 0.9 percent on the day, while U.S. West Texas Intermediate (WTI) crude futures fell a similar amount to $63.40 a barrel.\nGold prices were up 0.5 percent, supported by a weaker dollar, but the metal was still on track for its first weekly drop in six weeks.\nReporting by Dhara Ranasinghe; additional reporting by Shinichi Saoshiro in TOKYO and Jemima Kelly in LONDON; Editing by Angus MacSwan\n ", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T17:15:00.000+02:00", "crawled": "2018-01-20T17:32:09.036+02:00", "highlightTitle": ""}