{"organizations": [], "uuid": "9979f1a334dcc4a9891bd66ba87206b7ca16a18d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-wallows-near-3-year-trough-fears-of-us-govt-shutdown-add-to-gloom-idUSL3N1PE1DX", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar wallows near 3-year trough, fears of US govt shutdown add to gloom", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.438, "site_type": "news", "published": "2018-01-19T13:51:00.000+02:00", "replies_count": 0, "uuid": "9979f1a334dcc4a9891bd66ba87206b7ca16a18d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-wallows-near-3-year-trough-fears-of-us-govt-shutdown-add-to-gloom-idUSL3N1PE1DX", "ord_in_thread": 0, "title": "FOREX-Dollar wallows near 3-year trough, fears of US govt shutdown add to gloom", "locations": [], "entities": {"persons": [{"name": "shinichiro kadota", "sentiment": "none"}, {"name": "hideyuki sano", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar hampered by U.S. government shutdown risk\n* Euro near 3-year high, yen near 4-month high vs dollar (Updates prices, adds comments)\nBy Hideyuki Sano\nTOKYO, Jan 19 (Reuters) - The dollar was lodged near a three-year low against a basket of currencies on Friday as fears of a possible U.S. government shutdown added to underlying weakness that stems from the growing trend toward monetary policy normalisation around the world.\nThe dollar index stood at 90.378, having fallen to as low as 90.104 this week, a level last seen in December 2014. It has already lost roughly 2 percent so far in 2018.\nThe U.S. House of Representatives passed a bill on Thursday to fund government operations through Feb. 16 and avoid agency shutdowns this weekend when existing allocations expire. The bill still is yet to be approved by the Senate, where it faces an uncertain future.\n“In December, lawmakers had to pass tax cuts so the process seemed smooth. But this time the risk of a government shutdown seems higher, even though it is not our main scenario,” said Shinichiro Kadota, senior FX strategist at Barclays.\nThe prospect of Senate approval has been complicated by President Donald Trump saying an extension of funding for the Children’s Health Insurance Program (CHIP), a Democratic priority, should not be included.\nThe euro edged up 0.2 percent to $1.2261, near the three year high of $1.2323 struck on Wednesday. Having advanced 0.5 percent so far this week, the common currency could post a fifth consecutive week of gains.\nThe dollar eased 0.2 percent to 110.86 yen, with its rebound from Wednesday’s four-month low of 110.19 already fading despite rise in U.S. debt yields.\nThe 10-year U.S. Treasuries yield rose to as high as 2.638 percent on Friday as prices fell, near the December 2016 peak of 2.641 percent on hit on expectations Trump’s economic plans would include deficit-boosting tax cuts and infrastructure spending.\nThe dollar has fallen since 2017, largely on expectations central banks besides the Federal Reserve are seeking to end their policy of ultra-low, even negative, interest rates that they adopted to combat the 2008 global financial crisis and subsequent recession.\n“The U.S. is no longer the only country raising rates. The market’s focus is on how other countries are catching up with normalisation in monetary policy,” said Barclays’ Kadota.\nMany investors believe the European Central Bank will edge towards ending its bond purchase programme later this year.\nA tiny reduction in the Bank of Japan’s bond buying earlier this month was enough to spark speculation about possible modification in its policy, even though many market players think any move will be many months away.\n“Markets are increasingly sensitive to the prospect of a less-dovish BOJ, which is putting pressure on dollar/yen,” analysts at UBS Wealth Management said in a note, adding that they will be looking to the BOJ’s policy meeting next week to gain more clarity on the central bank’ stance.\n“For now, we do not think the BOJ has any urgency to shift its yield curve control regime,” they added.\nAnother underlying factor behind the dollar’s weakness has been global investors, including sovereign wealth funds and central banks, diversifying their holdings by switching more funds into other currencies.\nChina and Japan, the top two foreign U.S. creditors, cut their holdings of Treasuries during November, according to Treasury Department data.\nA report from the International Monetary Fund published in December said central banks had increased the allocation of non-dollar currencies to their foreign exchange reserves in the third quarter.\nThe Bank of France said on Monday it already held some currency reserves in yuan, hours after the German central bank said it was looking to move some of its reserves into the Chinese currency.\n“European central banks are adding the yuan to their reserves. And if Chinese are diversifying, shifting to European bonds from U.S. bonds, that would suggest a shift from a regime where the dollar is overwhelmingly strong,” said Ayako Sera, market economist at Sumitomo Mitsui Trust Bank. (Additional reporting by Masayuki Kitano in Singapore; Editing by Simon Cameron-Moore and Eric Meijer)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T13:51:00.000+02:00", "crawled": "2018-01-19T14:23:56.011+02:00", "highlightTitle": ""}