{"organizations": [], "uuid": "c52045ff369435ab906308121b63c0f9c2a12462", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/s-and-s-fire-pits-roadie.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/15/last-mile-delivery-ups-fedex-roadie/", "country": "US", "domain_rank": 1196, "title": "Roadie, the Uber of Delivery, Challenges FedEx, UPS | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-15T13:51:00.000+02:00", "replies_count": 0, "uuid": "c52045ff369435ab906308121b63c0f9c2a12462"}, "author": "David Z. Morris", "url": "http://fortune.com/2018/01/15/last-mile-delivery-ups-fedex-roadie/", "ord_in_thread": 0, "title": "Roadie, the Uber of Delivery, Challenges FedEx, UPS | Fortune", "locations": [], "entities": {"persons": [{"name": "david z. morris", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "nike", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Z. Morris 11:51 AM EST \nThe world has a package problem. Deliveries of everything from Nike sneakers to Spider-Man figurines are expected to double to 25 billion annually in the U.S. within 10 years. \nBut delivery trucks are already choking city streets and adding strain to overburdened highways. Proposed solutions, like delivery drones and sidewalk-hogging robots , are splashy, but years away from going mainstream or difficult to scale. \nRoadie, Atlanta-based startup, thinks there may be an answer right in front of us (or more precisely, beside and behind us): The empty space in the millions of cars and trucks already on the road. Instead of summoning a driver to ferry your package to its destination, Roadie recruits drivers who are already headed in the right direction to make the delivery. \nUsing Roadie’s mobile app, anyone from commuters to college students can enter their daily routes and road-trip plans. Roadie then matches those trips with waiting shipments, creating deliveries that aren’t “on demand,” but rather “on the way.” Roadie says that because the trips were going to happen anyway, it can deliver packages more cheaply and with less environmental impact than traditional shipping by UPS or FedEx . \nRoadie is working to use predictive analytics to coordinate the everyday habits of drivers with the needs of shippers. As CEO Marc Gorlin puts it, the company’s goal is to learn “the perfect time to delightfully intrude in your day with a simple text that says, ‘Hey, do you want to make 80 bucks when you go to the store?’” \nGet Data Sheet , Fortune’s technology newsletter. \nTo get that “delightful” intrusion just right, Roadie asks drivers about their routines, the size of their cars, and other details. Meanwhile, the company’s computers also keep an eye on drivers’ actual habits—how many gigs they accept, and when and where. “Often times,” Gorlin says, “what people tell you and what they actually do are very different.” \nRoadie, founded three years ago, has sometimes been described as “Uber for delivery,” but that’s not quite accurate. Perhaps the best parallel is the France-based carpooling service BlaBlaCar, which pays drivers pennies on the dollar compared to Uber, but has succeeded wildly by matching riders with seats that would have otherwise been empty. \nSimilarly, while Gorlin says that some drivers do use Roadie full-time to make deliveries, the company is more focused on drivers who just want to get the most out of the unused space in their vehicles when they’re already on the road. Like BlaBlaCar, Roadie pays drivers less than a conventional courier service —a source of some complaints on the app’s Google Play page—but it can also charge customers much less. \nThat’s particularly true for large items. In one comparison provided by the company, a large couch that would cost at least $577 to ship from Dallas to Austin via FedEx could be shipped with Roadie for $102. Roadie drivers take 80% of the fee and the company keeps the rest. So a driver isn’t getting rich off the seven or eight-hour round trip, but it’s more than enough to cover gas. \nRoadie, whose investors include UPS , has found a few situations in which this approach to shipping parcels is in big demand. Take, for instance, lost airline baggage. Thousands of drivers are already coming and going to and from airports in major cities. Roadie says it has partnered with airlines at 35 airports from Philadelphia to San Francisco to recruit passengers to return those lost bags, reducing the time it takes to return them to their inevitably annoyed owners. The declined to disclose the names of any of those airlines. \nRoadie also seems well-suited for shuttling furniture and other big items. S&S Fire Pits, a regular Roadie shipper that sells garden fireplaces, says it saves nearly 30% when using Roadie compared to traditional shipping—partly because it’s actually easier to load a giant steel fire pit into the back of a minivan than onto a pallet and into a tractor-trailer. \nSimilarly, Gorlin says Roadie is a boon to customers who aren’t that picky about when their deliveries arrive at their destinations. “If you’re sending an heirloom baby crib to your sister, she doesn’t need it tomorrow, she probably just needs it in the next eight months,” he says. \nRoadie has truly big ambitions, though, in one of the most challenged sectors of the economy—brick-and-mortar retail. Physical stores are being decimated , in part because of competition from Amazon and its promise of quick, cheap delivery. Amazon heavily subsidizes the cost of that delivery, which most retailers can’t afford to do. \nBut physical stores do have something Amazon doesn’t: customers who are already coming and going. Roadie wants retailers to let those customers drop off packages for other customers on their way home, something it calls collaborative delivery. It’s a win-win-win, with retailers getting a way to entice shoppers to their doorstep, those shoppers-turned-drivers paying off some of their shopping tab, and online customers getting orders delivered inexpensively. \n“It gives brick and mortar retailers a chance to remain relevant and not get Amazon’d,” says Gorlin. \nLike most gig-economy operations, Roadie has a rating system for drivers, who also ensure safe deliveries by sending customers photos of their items in transit. They also provide insurance options, some of them through their backers at UPS. \nStill, letting your neighbor deliver your new laptop seems unlikely to completely replace professional delivery services. But it could become one part of a much more complex delivery landscape. “Delivery is going to expand into more and more actors,” says Allan Rutter of the Texas A&M Transportation Institute. “Different kinds of people, different kinds of transactions, different kinds of vehicles. That’s already happening, but it seems to be spreading.” \n", "external_links": [], "published": "2018-01-15T13:51:00.000+02:00", "crawled": "2018-01-15T23:53:43.011+02:00", "highlightTitle": ""}