{"organizations": [], "uuid": "ea93595d4f71e0dacfcb35e70eb920c1f2bbb3b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-leu-dips-on-fears-that-president-might-reject-pm-candidate-idUSL8N1PC4R2", "country": "US", "domain_rank": 408, "title": "CEE MARKETS-Leu rebounds as Romania averts crisis threat, crown surges", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T23:28:00.000+02:00", "replies_count": 0, "uuid": "ea93595d4f71e0dacfcb35e70eb920c1f2bbb3b4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-leu-dips-on-fears-that-president-might-reject-pm-candidate-idUSL8N1PC4R2", "ord_in_thread": 0, "title": "CEE MARKETS-Leu rebounds as Romania averts crisis threat, crown surges", "locations": [], "entities": {"persons": [{"name": "mihai tudose", "sentiment": "none"}, {"name": "sandor peto", "sentiment": "none"}, {"name": "klaus iohannis", "sentiment": "none"}, {"name": "viorica dancila", "sentiment": "none"}, {"name": "dancila", "sentiment": "none"}, {"name": "liviu dragnea", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}], "organizations": [{"name": "social democrat party", "sentiment": "none"}, {"name": "psd", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Leu rebounds, president accepts choice of PM * Crown hits 5-year high * Czech central banker comments fuel rate hike talk (Adds Romanian president's PM designate choice, crown surge to multi-year high) By Sandor Peto BUDAPEST, Jan 17 (Reuters) - The leu rebounded on Wednesday after Romanian president Klaus Iohannis accepted the government's nominee as prime minister designate, averting the risk of a political crisis. The leu had fallen towards record lows set on Dec. 29 at 4.68 against the euro after Mihai Tudose resigned as prime minister on Monday. After the departure of its second prime minister since an election 13 months ago, the ruling Social Democrat Party (PSD) picked European Parliament lawmaker Viorica Dancila as the new head of government. Iohannis, a critic of the government, accepted the choice on Wednesday, even though there had been concerns that he might reject Dancila, who is close to the party's powerful leader Liviu Dragnea, and cause a crisis. Dragnea is one of a number of ruling coalition members facing trial on corruption charges. He denies wrongdoing. The leu rebounded after the president announced his decision, trading at 4.6521 against the euro at 1602 GMT, up 0.1 percent. On Tuesday, the currency was supported by comments from Romanian central bank Deputy Governor Liviu Voinea who said it was very close to the level suggested by economic fundamentals. The Czech crown firmed more than 0.2 percent against the euro and broke through the 25.4 line, reaching its strongest levels in almost five years. The currency shrugged off the resignation on Wednesday of the minority government of Andrej Babis after losing a confidence vote in parliament on Tuesday. Political developments rarely influence the markets of the fast-growing and stable Czech economy. Czech central banker Vojtech Benda had boosted the currency, saying that inflation trends could point to more rapid rises in interest rates, after two hikes since August. The crown gained momentum \"after yesterday's Benda comments and break of 25.5,\" one dealer said. The crown \"has been extending its gains on rising bets that the Czech National Bank will deliver another rate hike in early February,\" KBC analysts said in a note. Polish central banker Grazyna Ancyparowicz told Radio Wnet that interest rates in Poland would most likely be close to the current record-low level throughout 2018. Another rate-setter, Eugeniusz Gatnar said a slowdown in inflation in December meant he no longer saw a need to raise interest rates in the first quarter. {nL8N1PC4F2] The zloty held steady. A report by the Puls Biznesu daily said Poland was working on launching a cryptocurrency. However, after the report, the digitisation ministry withdrew its support for the start-up company working on the plan, saying that any projects affecting money supply were the domain of the central bank and the financial regulator KNF. CEE SNAPSHOT AT MARKETS 1702 CET CURRENCI ES Latest Previous Daily Change bid close change in 2018 Czech <EURCZK= 25.4000 25.4450 +0.18% +0.56% crown > Hungary <EURHUF= 308.6500 308.7800 +0.04% +0.73% forint > Polish <EURPLN= 4.1696 4.1709 +0.03% +0.16% zloty > Romanian <EURRON= 4.6521 4.6556 +0.08% +0.59% leu > Croatian <EURHRK= 7.4270 7.4225 -0.06% +0.04% kuna > Serbian <EURRSD= 118.3000 118.4000 +0.08% +0.17% dinar > Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2018 Prague 1115.63 1114.920 +0.06% +3.48% 0 Budapest 39387.04 39684.16 -0.75% +0.02% Warsaw 2600.37 2591.10 +0.36% +5.65% Bucharest 8316.59 8233.13 +1.01% +7.26% Ljubljana <.SBITOP 829.48 822.05 +0.90% +2.86% > Zagreb 1876.37 1879.60 -0.17% +1.82% Belgrade <.BELEX1 770.84 774.65 -0.49% +1.45% 5> Sofia 709.86 715.40 -0.77% +4.78% BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT=R 0.6370 0.0040 +122bps +1bps R> 5-year <CZ5YT=R 1.0390 0.0540 +118bps +7bps R> 10-year <CZ10YT= 1.7680 0.0270 +121bps +4bps RR> Poland 2-year <PL2YT=R 1.7230 0.1310 +230bps +14bps R> 5-year <PL5YT=R 2.6200 0.0040 +276bps +2bps R> 10-year <PL10YT= 3.2910 0.0150 +274bps +2bps RR> FORWARD RATE AGREEMEN T 3x6 6x9 9x12 3M interban k Czech Rep 1.03 1.23 1.37 0.77 <PRIBOR= > Hungary 0.10 0.16 0.23 0.02 Poland 1.75 1.79 1.87 1.72 Note: FRA are for ask prices Quote: s", "external_links": [], "published": "2018-01-17T23:28:00.000+02:00", "crawled": "2018-01-18T16:01:58.004+02:00", "highlightTitle": ""}