{"organizations": [], "uuid": "69a1ce3121c42e381214933ed4aa2306edc7f144", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 56, "shares": 56, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222032444&w=1200&r=LYNXMPEE0E02Y", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-asia-ironore/iron-ore-prices-fall-with-steel-in-china-amid-slower-demand-idUSKBN1F407Q", "country": "US", "domain_rank": 408, "title": "Iron ore prices fall with steel in China amid slower demand", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-15T10:48:00.000+02:00", "replies_count": 0, "uuid": "69a1ce3121c42e381214933ed4aa2306edc7f144"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-asia-ironore/iron-ore-prices-fall-with-steel-in-china-amid-slower-demand-idUSKBN1F407Q", "ord_in_thread": 0, "title": "Iron ore prices fall with steel in China amid slower demand", "locations": [], "entities": {"persons": [{"name": "jin wei", "sentiment": "none"}, {"name": "jin", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "shanghai futures exchange", "sentiment": "none"}, {"name": "china iron and steel association", "sentiment": "none"}, {"name": "dalian commodity exchange", "sentiment": "none"}, {"name": "shougang group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANILA (Reuters) - Chinese rebar steel futures dropped nearly 1 percent on Monday on weaker demand over winter in the world’s top consumer, dragging down prices of raw material iron ore.\nSteel producers say supply in China remains excessive despite production curbs imposed by Beijing to battle smog, suggesting prices could remain under pressure.\n“The oversupply condition still exists and there is room for steel production to grow and there won’t be a supply shortage,” Jin Wei, chairman of major Chinese steelmaker Shougang Group, was Quote: d as saying by the website of the China Iron and Steel Association on Saturday.\nThe most-actively traded rebar on the Shanghai Futures Exchange was down 0.8 percent at 3,777 yuan ($587) a tonne by 0222 GMT.\nIron ore on the Dalian Commodity Exchange slid 2.3 percent to 535 yuan per tonne.\nJin also said the recent surge in iron ore prices was not sustainable given the continued increase in stocks of the bulk commodity at China’s ports.\n“Iron ore supplies kept rising and port inventories kept testing records, while scrap supplies are also increasing, so there is no basis for iron ore prices to sustain gains.”\nDalian iron ore futures touched a four-month high of 565 yuan a tonne on Jan. 10, pulled up by firmer steel prices then, and helping lift spot iron ore prices to $79.08 a tonne on Jan. 11, the strongest since Aug. 22.\nIron ore for delivery to China’s Qingdao port slipped 1.3 percent to $78.05 per tonne on Jan. 12, according to Metal Bulletin.\nStockpiles of imported iron ore at China’s ports reached 152.83 million tonnes as of Jan. 12, up 2 million tonnes from the previous week and the most since at least 2004, data compiled by SteelHome consultancy showed.\nChinese data released on Friday showed the country’s iron ore imports fell 11 percent in December from the previous month, but full-year shipments surged to a record 1.075 billion tonnes.\nAs China’s iron ore stockpiles topped 150 million tonnes last week, “we think that weaker iron ore imports should be expected in the first quarter of 2018 as the market moves out of a restocking cycle,” Barclays analysts said in a note.\nCoking coal dropped 2.2 percent to 1,324 yuan a tonne and coke fell 1.9 percent to 1,977 yuan.\n($1 = 6.4331 Chinese yuan)\nReporting by Manolo Serapio Jr.; Additional reporting by Ruby Lian in Shanghai; Editing by Joseph Radford\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T10:48:00.000+02:00", "crawled": "2018-01-15T09:32:04.009+02:00", "highlightTitle": ""}