{"organizations": [], "uuid": "ca4bec992fa0e19750fbcc90937c77bb5ea700a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-chung/tennis-young-gun-chung-fires-a-blank-after-blister-trouble-idUKL4N1PL3Q2", "country": "US", "domain_rank": 408, "title": "Tennis-Young gun Chung fires a blank after blister trouble", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T13:37:00.000+02:00", "replies_count": 0, "uuid": "ca4bec992fa0e19750fbcc90937c77bb5ea700a4"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-chung/tennis-young-gun-chung-fires-a-blank-after-blister-trouble-idUKL4N1PL3Q2", "ord_in_thread": 0, "title": "Tennis-Young gun Chung fires a blank after blister trouble", "locations": [], "entities": {"persons": [{"name": "chung", "sentiment": "negative"}, {"name": "rod", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "chung hyeon", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "tennis-young", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 11:38 AM / Updated 30 minutes ago Tennis-Young gun Chung fires a blank after blister trouble Ian Ransom 3 Min Read \nMELBOURNE, Jan 26 (Reuters) - The fighting spirit that propelled Chung Hyeon to the Australian Open semi-finals went missing on Friday as the South Korean trailblazer cut short his much-anticipated clash with Roger Federer after suffering foot blisters. \nThe bespectacled 21-year-old had won huge acclaim for becoming his home nation’s first ever grand slam semi-finalist, knocking out no less than six-times champion Novak Djokovic during his breathtaking run. \nBut after being steamrolled by the Swiss master through the better part of two sets, Chung abruptly pulled the pin two games after taking a medical time-out to have his foot strapped. \nIt was to the great dismay of a capacity Rod Laver Arena crowd that had hoped for far more than 62 minutes of one-sided tennis between South Korea’s rising star and the reigning champion. \nA poker-faced Chung packed up his rackets quickly as a smattering of spectators jeered but he trudged off into the bowels of Rod Laver Arena to mostly polite applause. \nA nonplussed Federer was left debating with himself as to whether a short game or a long one was better preparation for facing sixth seed Marin Cilic in Sunday’s final. \n“But I must admit, as well, you do take the faster matches whenever you can because there’s enough wear and tear on the body, there’s enough tough matches throughout the season that when they happen, you take them,” Federer told reporters. \nThe last time the Swiss great met Cilic in a grand slam final - Wimbledon last summer - the Croatian was similarly laid low by a bad blister, fighting through the pain and tears but losing in straight sets. \nIt was left to Chung’s agent Stuart Duguid to explain his client’s ailment as “blister under blister under blister.” \nIt was “red raw” he told reporters, and pain killing injections had provided no relief. \nChung made clear he was not interested in grinding through, however, fearing fans would be disaffected by a poor show. \n“Many things come together because I retired in (the) semis,” he said. \n”But I think I did (the) right thing. If I play (a) bad thing on the court, it’s not good for the fans and audience as well. \n“I‘m happy to be able to make the semis in a grand slam. I want to be stronger next year.” \nChung can certainly hope to fulfil those expectations after a giddy fortnight that included demolishing an injury-hampered Djokovic in three sets and a brilliant win over fourth seed Alexander Zverev, who many had regarded as the strongest young contender in the draw. \nChung said he had already attained some of his goals by becoming South Korea’s top ranked player and achieving his best showing in a grand slam. \n“I really didn’t know I‘m going to make it in semis,” Chung added. “Next goal is I want to finish the season without injury.” (Editing by Jon Boyle)", "external_links": [], "published": "2018-01-26T13:37:00.000+02:00", "crawled": "2018-01-26T14:10:25.002+02:00", "highlightTitle": ""}