{"organizations": [], "uuid": "3f07d603426b604dd1d763bcb4893115d1932c05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221647652&w=1200&r=LYNXMPEE0C03L", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-nadal/uncle-toni-still-more-than-anything-for-nadal-idUKKBN1F2061", "country": "US", "domain_rank": 408, "title": "Uncle Toni still 'more than anything' for Nadal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T08:29:00.000+02:00", "replies_count": 0, "uuid": "3f07d603426b604dd1d763bcb4893115d1932c05"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-nadal/uncle-toni-still-more-than-anything-for-nadal-idUKKBN1F2061", "ord_in_thread": 0, "title": "Uncle Toni still 'more than anything' for Nadal", "locations": [], "entities": {"persons": [{"name": "uncle toni", "sentiment": "positive"}, {"name": "nadal", "sentiment": "positive"}, {"name": "carlos moya", "sentiment": "none"}, {"name": "toni", "sentiment": "none"}, {"name": "rafa nadal", "sentiment": "none"}, {"name": "toni nadal", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}, {"name": "moya", "sentiment": "none"}, {"name": "fabio fognini", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 6:31 AM / Updated 8 hours ago Uncle Toni still 'more than anything' for Nadal Ian Ransom 3 Min Read \nMELBOURNE (Reuters) - World number one Rafa Nadal embarks on a new era without his coach and uncle in the players’ box at the Australian Open but the Spaniard said he would always welcome advice from his lifelong mentor with open arms. Rafa Nadal of Spain reacts after wining a point against Fabio Fognini of Italy during their men's singles semifinal match at the China Open tennis tournament in Beijing, China, October 10, 2015. REUTERS/Kim Kyung-Hoon Picture Supplied by Action Images \nNadal returns to Melbourne Park, where he lost a thrilling five-set final to long-time rival Roger Federer last year, hoping to continue his progress under new coach Carlos Moya. \nFormer world number one Moya will lead the Mallorcan’s team, having helped him back to the grand slam winner’s table in 2017 after a barren three years while preparing for Toni Nadal’s retirement. \nToni has departed to focus on his nephew’s tennis academy but Nadal said their relationship remained intimate and “easy”. \n“He participates as much as he wants to participate. He’s my uncle,” Nadal told reporters at Melbourne Park on Saturday. \n”He’s more than anything else. That’s it. Everything that he wants to do with me, I am happy with, no? It’s not about my \ndecision. He has enough confidence with me, or I have enough confidence with him, to talk about anything I have to talk. \n”It’s difficult to explain. But it’s part of my family ... He loves me. I love him. It’s not about, you know, a professional relationship. It’s a familial relationship. \n”In terms of professional things, I spoke to him few days ago, speaking about how the life is going, how the tennis is going. \n“If I have something to ask, I ask him. If he has something to tell me, he calls me and tells me. No, it’s not a difficult situation. It’s a very easy situation.” \nNadal’s preparations have added to a sense of a journey into the unknown at Melbourne Park for the 31-year-old great. \nHe heads into his first round match against Dominican journeyman Victor Estrella Burgos without a competitive match since he pulled out of the ATP Tour Finals with a knee injury in November. \nHe missed warmup events in Abu Dhabi and Brisbane but had an exhibition match at the Kooyong Classic and another practice match with Dominic Thiem at Melbourne Park on Friday, complete with ball boys and a chair umpire. \nThe 16-times grand slam champion showed no sign of discomfort in defeating fifth seed Thiem and said he felt “good” and was “more or less” playing well. \nA 17th grand slam title would bring him within striking distance of the record 19 held by Federer but Nadal said he had no extra need for motivation at Melbourne Park. \n“It’s impossible to be more motivated than last year or any year,” said Nadal, who can only face second seed Federer in another final if they progress that far. \n”For me, the Australian Open ... if you are not enough \nmotivated, 100 percent motivated to play this tournament, probably you don’t love this sport.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-13T08:29:00.000+02:00", "crawled": "2018-01-13T08:54:41.000+02:00", "highlightTitle": ""}