{"organizations": [], "uuid": "2f6f594b0b592fe4c5e04ed5ced86751d1f89033", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-glance-appoints-digital-strategy-and-blockchain-expert-evan-luthra-to-advisory-board.html", "country": "US", "domain_rank": 767, "title": "Glance Appoints Digital Strategy and Blockchain Expert Evan Luthra to Advisory Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-15T15:24:00.000+02:00", "replies_count": 0, "uuid": "2f6f594b0b592fe4c5e04ed5ced86751d1f89033"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-glance-appoints-digital-strategy-and-blockchain-expert-evan-luthra-to-advisory-board.html", "ord_in_thread": 0, "title": "Glance Appoints Digital Strategy and Blockchain Expert Evan Luthra to Advisory Board", "locations": [], "entities": {"persons": [{"name": "evan luthra", "sentiment": "negative"}, {"name": "zuntik", "sentiment": "none"}, {"name": "evan", "sentiment": "none"}, {"name": "nielsen", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}], "organizations": [{"name": "glance technologies inc.", "sentiment": "negative"}, {"name": "advisory board", "sentiment": "negative"}, {"name": "ceo & founder of el group international", "sentiment": "none"}, {"name": "dubai first bank", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "unilever", "sentiment": "none"}, {"name": "board of advisors", "sentiment": "none"}, {"name": "citigroup", "sentiment": "none"}, {"name": "audi", "sentiment": "none"}, {"name": "el group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, British Columbia, Jan. 15, 2018 (GLOBE NEWSWIRE) --\nGlance Technologies Inc. (CSE:GET.CN) (CSE:GET.WT) (OTCQB:GLNNF) (FKT:GJT) announces that it has appointed digital strategist Evan Luthra to its Board of Advisors.\nEvan is the CEO & Founder of EL Group International http://elgroupinternational.com , an award winning creative & strategy firm that has designed and engineered hundreds of IT applications for major Fortune 500 companies. Evan has been delivering compelling solutions for multi-national corporations globally like Unilever, Dubai First Bank, CitiGroup, Godiva, Audi, Nielsen and Google, as well as emerging technology startups such as Floqker, ChillApp, RemedyForGlass, Zuntik, and Mission1364.\nHeavily involved in the crypto industry, working with leading companies such as GazeCoin.io, Hashgraph.com and others, he has been regarded as a Blockchain expert and pioneer by the world’s leading organizations and publications, according to Coin Reviews. Through his company, El Group, Evan is working with governments from countries like UAE and others to put all records on blockchain and Hashgraph and dealing with enterprise companies to deliver private blockchain networks.\n“I always believe the best way to predict the future is to create it,” says Evan. “And I am very excited to be Joining the Glance Technologies Team to help build the payment solutions for tomorrow.”\nEvan Luthra has been a featured speaker at different universities and conferences around the globe speaking about Blockchain, apps, entrepreneurship and trending tech topics and has spoken for TEDx, United Nations, Google, Nielsen and has done guest lectures at Delhi University, Washington State University, San Francisco State University and more.\nAbout Glance Technologies Inc.\nGlance Technologies owns and operates Glance Pay, a streamlined payment system that revolutionizes how smartphone users choose where to shop, order goods and services, make payments, access digital receipts, redeem digital deals, earn great rewards & interact with merchants. Glance offers targeted in-app marketing, geo targeted digital coupons, customer feedback, in-merchant messaging and custom rewards programs. The Glance Pay mobile payment system consists of proprietary technology, which includes user apps available for free downloads in IOS (Apple) and Android formats, merchant manager apps, a large scale technology hosting environment with sophisticated anti-fraud technology and lightning fast payment processing. Glance Pay has entered into significant licensing agreements with Active Pay Distribution Inc., Cannapay Financial Inc. and Euro Asia Pay Holdings Inc. It also owns an end to end blockchain solution for a rewards based cryptocurrency which is currently being integrated into the Glance Pay app.\nFor more information about Glance, please go to www.glance.tech.\nFor more information, contact:\nChristina Rao\nVice President, Investor Relations\n(604) 723-7480\ninvestors@glancepay.com\nNeither the Canadian Securities Exchange nor its Regulation Services Provider (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release.\nForward-Looking Statements\nThis press release contains forward-looking information or forward-looking statements (collectively \"forward- looking information\") within the meaning of applicable securities laws. Forward- looking information is typically identified by words such as: \"believe\", \"expect\", \"anticipate\", \"intend\", \"estimate\", \"potentially\" and similar expressions, or are those, which, by their nature, refer to future events. Glance cautions investors that any forward-looking information provided by Glance is not a guarantee of future results or performance, and that actual results may differ materially from those in forward-looking complete discussion of such risk factors and their potential effects which may be accessed through the Glance's profile on SEDAR at www.sedar.com .\nSource:Glance Technologies Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=xDAcHEkKVjppc9DC0CCPRm2__2nwsCzo34K0Rp8wyuMkjpiYYNJ0JljE201UMPcxUHjsAurh3U21P_rV0XG8ojA65EG9N4zMWcfSf8VJXg617XmgivBE18aTav3SQOfj", "https://www.globenewswire.com/Tracker?data=VP71OPo9toNjXCB6FSu2NtV_Cowc5O2eeQKW1GgJcOoELtKS931AKUIs8UhMj_kzK8swZN2nVVj2Znj0rzPFFEVGkoCLgTFf5Lo3ahScILE=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/ed8b8c08-7b34-422f-a617-91c2c548565f"], "published": "2018-01-15T15:24:00.000+02:00", "crawled": "2018-01-15T16:29:13.003+02:00", "highlightTitle": ""}