{"organizations": [], "uuid": "f6d5f39b83ae9a39ccea96c6e85d083f800f26ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-cvb-financial-corp-reports-earnings-for-the-fourth-quarter-and-record-earnings-for-the-year-ended-2017.html", "country": "US", "domain_rank": 767, "title": "CVB Financial Corp. Reports Earnings for the Fourth Quarter and Record Earnings for the Year Ended 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-25T01:39:00.000+02:00", "replies_count": 0, "uuid": "f6d5f39b83ae9a39ccea96c6e85d083f800f26ee"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-cvb-financial-corp-reports-earnings-for-the-fourth-quarter-and-record-earnings-for-the-year-ended-2017.html", "ord_in_thread": 0, "title": "CVB Financial Corp. Reports Earnings for the Fourth Quarter and Record Earnings for the Year Ended 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "ontario", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "cvb financial corp", "sentiment": "neutral"}, {"name": "citizens business bank", "sentiment": "none"}, {"name": "cvb financial corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Net earnings were $17.9 million for the fourth quarter of 2017, or $0.16 per share. Full year net earnings were $104.4 million, or $0.95 per share, for the year ended 2017. Income tax expense included a one-time charge of $13.2 million due to the Tax Cuts and Jobs Act of 2017. Excluding the tax effect of the $13.2 million, earnings were $31.1 million, for the fourth quarter of 2017, or $0.28 per share, and were $117.6 million, or $1.07 per share, for the year ended 2017.\nONTARIO, Calif.--(BUSINESS WIRE)-- CVB Financial Corp. (NASDAQ:CVBF) and its subsidiary, Citizens Business Bank (“the Company”), announced earnings for the quarter and year ended December 31, 2017.\nCVB Financial Corp. reported net income of $17.9 million for the quarter ended December 31, 2017, compared with $29.7 million for the third quarter of 2017 and $27.1 million for the fourth quarter of 2016. Diluted earnings per share were $0.16 for the fourth quarter, compared to $0.27 for the prior quarter and $0.25 for the same period last year. Income tax expense for the fourth quarter of 2017 included a one-time charge of $13.2 million due to the re-measurement of the Company’s net deferred tax asset (“DTA”) resulting from the Tax Cuts and Jobs Act of 2017 (“Tax Reform Act”). Excluding the impact of the $13.2 million DTA revaluation, net income totaled $31.1 million for the fourth quarter of 2017, or $0.28 per share. Net earnings grew by $1.4 million over the prior quarter and $4.0 million from the fourth quarter of 2016, when the impact of the DTA revaluation is excluded.\nChris Myers, President and CEO of Citizens Business Bank, commented, “Excluding the nonrecurring charge to tax expense, fourth quarter net income was $31.1 million and year-end earnings were $117.6 million, both all-time highs for the Bank. 2017 was truly an outstanding year.”\nNet income of $17.9 million for the fourth quarter of 2017 produced an annualized return on beginning equity of 6.58%, an annualized return on average equity (“ROAE”) of 6.48%, and an annualized return on average assets (“ROAA”) of 0.85%. Excluding the impact of the $13.2 million DTA revaluation resulting from the Tax Reform Act, ROAE and ROAA were 11.28% and 1.48%, respectively. Net income for the fourth quarter of 2016 produced an annualized return on average equity of 10.60% and an annualized return on average assets of 1.33%. The efficiency ratio for the fourth quarter of 2017 was 41.81%, compared to 42.44% for the third quarter of 2017 and 47.30% for the fourth quarter of 2016.\nNet income totaled $104.4 million for the year ended December 31, 2017, our highest in company history. This represented a $3.0 million increase, or 2.94%, from the prior year. When the DTA revaluation is excluded, net income increased by $16.2 million, or 15.96% over 2016. Earnings for 2017 included $8.5 million in loan loss provision recapture, compared to $6.4 million in loan loss recapture in 2016. 2017 also included a $2.9 million net gain from an eminent domain condemnation of one of our business financial center buildings, a $906,000 net gain on the sale of a branch acquired from Valley Business Bank (“VBB”), and a $542,000 net gain on the sale of our operations and technology center. This was offset by $13.2 million in nonrecurring income tax expense resulting from the DTA revaluation in the fourth quarter of 2017. Diluted earnings per share were $0.95 for 2017, compared to $0.94 for 2016. Excluding the impact of the $13.2 million DTA revaluation, net income totaled $117.6 million, or $1.07 per share, for the year ended December 31, 2017. Net income for the year ended December 31, 2017 produced an annualized return on beginning equity of 10.54%, a ROAE of 9.84% and a ROAA of 1.26%. Excluding the impact of the DTA revaluation, ROAE and ROAA were 11.08% and 1.42%, respectively, for the year ended 2017. The efficiency ratio for 2017 was 43.84%, compared to 46.73% for 2016.\nNet interest income before recapture of loan loss provision was $71.3 million for the quarter, which was a $464,000 decrease, or 0.65%, over the third quarter of 2017, and a $5.8 million increase, or 8.91%, over the fourth quarter of 2016. Total interest income and fees on loans for the fourth quarter of 2017 of $55.9 million decreased $125,000, or 0.22%, from the third quarter of 2017 but increased $6.7 million, or 13.54%, from the fourth quarter of 2016. Total investment income of $16.9 million decreased $532,000, or 3.05%, from $17.4 million for the third quarter of 2017 and grew by $83,000, or 0.49%, from the fourth quarter of 2016. Interest expense decreased $87,000, or 4.08%, from the third quarter of 2017 and grew by $121,000 in comparison with the fourth quarter of 2016.\nNet interest income before recapture of loan loss provision was $278.9 million for 2017, a $21.9 million increase, or 8.50%, over 2016. Total interest income and fees on loans grew by $21.1 million, or 10.95%, over 2016 to $214.1 million. Total investment income increased by $2.9 million, or 4.22%, to $70.8 million from 2016. Interest expense increased by $320,000, or 4.01%, in 2017.\nDuring the fourth quarter of 2017, $1.5 million of loan loss provision was recaptured, compared to $1.5 million recaptured for the prior quarter, and $4.4 million recaptured for the same period last year. Recapture of provision for loan losses totaled $8.5 million for 2017, compared to $6.4 million for 2016.\nNoninterest income was $12.6 million for the fourth quarter of 2017, compared with $10.0 million for the third quarter of 2017, and $8.4 million for the fourth quarter of 2016. The $2.6 million increase when compared to the third quarter of 2017 was primarily the result of a $2.9 million net gain due to an eminent domain condemnation and a $906,000 net gain on sale of a branch, as previously described. The third quarter of 2017 included a $542,000 net gain on sale of our operations and technology center which was classified as an asset held-for-sale at December 31, 2016. Excluding these net gains from sales and eminent domain condemnation, noninterest income for the fourth quarter of 2017 decreased by $714,000 quarter-over-quarter and increased by $370,000 compared to the fourth quarter of 2016.\nFor the year ended December 31, 2017, noninterest income was $42.1 million, compared to $35.6 million for 2016. Excluding net gains from sales in both 2017 and 2016, as well as the net gain from the eminent domain condemnation in 2017, noninterest income grew by $3.6 million, or 10.52%.\nNoninterest expense for the fourth quarter of 2017 was $35.1 million, compared to $34.7 million for the third quarter of 2017, and $34.9 million for the fourth quarter of 2016. The $351,000 quarter-over-quarter increase was primarily the result of a $658,000 increase in professional service and legal expense and a $300,000 increase in marketing and promotion expense. This was partially offset by a decrease of $290,000 in occupancy costs and a $175,000 decrease in acquisition expense. The third quarter of 2017 included $405,000 in legal expense recoveries. The $125,000 increase in noninterest expense over the fourth quarter of 2016 was primarily due to a $2.3 million increase in salaries and employee benefits, a $422,000 increase in professional service expense, and a $417,000 increase in occupancy and equipment costs. This was partially offset by $4.1 million in nonrecurring expenses in the fourth quarter of 2016 resulting from a fair value adjustment of $2.6 million for our operations and technology center and a $1.5 million accrual for the settlement of a wage-hour class action lawsuit. As a percentage of average assets, noninterest expense was 1.67%, compared to 1.65% for the third quarter of 2017 and 1.72% for the fourth quarter of 2016.\nNoninterest expense of $140.8 million for the year ended December 31, 2017 was $4.0 million higher than the prior year. The $4.4 million, or 5.37%, increase in compensation and benefit expense includes additional staff from the acquisition of VBB and normal year-over-year escalation in wages. The $1.1 million year-over-year increase in occupancy and equipment expense included both temporary and permanent expenses related to the acquisition of VBB and the build-out and relocation to our new operations and technology building. Acquisition related expenses were $2.3 million, up $354,000 from the prior year. As a percentage of average assets, noninterest expense was 1.70% for both 2017 and 2016.\nNet Interest Income and Net Interest Margin\nNet interest income, before provision for loan losses, was $71.3 million for the fourth quarter of 2017, compared to $71.7 million for the third quarter of 2017 and $65.4 million for the fourth quarter of 2016. Our net interest margin (tax equivalent) was 3.68% for the fourth quarter of 2017, compared to 3.70% for the third quarter of 2017 and 3.47% for the fourth quarter of 2016. Total average earning asset yields (tax equivalent) were 3.79% for the fourth quarter of 2017, compared to 3.81% for the third quarter of 2017 and 3.57% for the fourth quarter of 2016. Total cost of funds was 0.11% for the fourth quarter of 2017, compared to 0.12% for the third quarter of 2017 and 0.11% for the fourth quarter of 2016. The decrease in the net interest margin over the third quarter of 2017 was the result of a decrease in earning asset yield that primarily resulted from a five basis point decrease in loan yields. While overall loan yields were positively impacted in the fourth quarter of 2017 by $762,000 in additional discount accretion as a result of the payoff of a purchase credit impaired loan, third quarter loan yields were impacted more by $1.0 million in interest recovery from a troubled debt restructured (“TDR”) that paid in full. Excluding these two items that impacted both third and fourth quarter net interest income, the adjusted net interest margin would be 3.64% and 3.65% for the fourth and third quarter of 2017, respectively. The tax equivalent yield on investments remained unchanged quarter-over-quarter. The 21 basis point increase in the net interest margin over the fourth quarter of 2016 was due in part to a 13 basis point increase in loan yields. The remaining eight basis point increase can be attributed mostly to a change in the mix of earning assets, as average loans increased by $441.9 million and represented 60.9% of earning assets in the fourth quarter of 2017, compared to 56.4% for the fourth quarter of 2016.\nNet interest income before provision for loan losses, totaled $278.9 million for the year ended December 31, 2017, compared to $257.1 million for 2016. Our net interest margin (tax equivalent) was 3.63% for 2017, compared to 3.46% for 2016. Total average earning asset yields (tax equivalent) was 3.74%, compared to 3.57% for 2016. The increase in the net interest margin over 2016 was the result of an increase in our earning asset yield that resulted from a combination of a three basis point increase in loan yields and the change in mix of earning assets represented by an increase in loans as a percentage of earning assets growing from 55.3% in 2016 to 59.3% in 2017. The non-tax equivalent yield on investments increased seven basis points year-over-year.\nIncome Taxes\nOn December 22, 2017, the Tax Reform Act was enacted into law. Beginning in 2018, the Tax Reform Act reduces the federal tax rate for corporations from 35% to 21% and changes or limits certain tax deductions. During the fourth quarter of 2017, the Company recorded a one-time charge against earnings of $13.2 million as a result of the tax rate reduction and re-measurement of its net deferred tax assets.\nOur effective tax rate for the quarter and year ended December 31, 2017 was 64.51% and 44.70%, respectively, compared with 37.50% for both the quarter and year ended December 31, 2016. Excluding the DTA revaluation adjustment, our effective tax rate was 38.25% and 37.70% for the quarter and year ended December 31, 2017, respectively. The effective tax rate for 2017 was also impacted by the tax effects related to the adoption of Accounting Standards Update (“ASU”) No. 2016-09, Compensation - Stock Compensation (Topic 718): Improvements to Employee Share-Based Payment Accounting, which resulted in the recognition of excess tax benefits of approximately $1.6 million in our provision for income taxes, rather than as an adjustment of paid-in capital. Our estimated annual effective tax rate also varies depending upon the level of tax-advantaged income as well as available tax credits.\nAssets\nThe Company reported total assets of $8.27 billion at December 31, 2017. This represented a decrease of $33.4 million, or 0.40%, from total assets of $8.30 billion at September 30, 2017. Interest-earning assets of $7.80 billion at December 31, 2017 decreased $13.6 million, or 0.17%, when compared with $7.82 billion at September 30, 2017. The decrease in interest-earning assets was primarily due to a $113.2 million decrease in investment securities. This was partially offset by an $84.2 million increase in total loans and a $17.9 million increase in interest-earning balances due from the Federal Reserve.\nTotal assets of $8.27 billion at December 31, 2017 increased $196.9 million, or 2.44%, from total assets of $8.07 billion at December 31, 2016. Interest-earning assets totaled $7.80 billion at December 31, 2017, an increase of $156.8 million, or 2.05%, when compared with earning assets of $7.64 billion at December 31, 2016. The increase in interest-earning assets was primarily due to a $435.6 million increase in total loans, which was partially offset by a $271.3 million decrease in investment securities.\nInvestment Securities\nTotal investment securities were $2.91 billion at December 31, 2017, a decrease of $113.2 million, or 3.74%, from $3.02 billion at September 30, 2017 and a decrease of $271.3 million, or 8.52%, from $3.18 billion at December 31, 2016.\nAt December 31, 2017, investment securities held-to-maturity (“HTM”) totaled $829.9 million, an $18.5 million decrease, or 2.18%, from September 30, 2017 and an $81.8 million decrease, or 8.97%, from December 31, 2016.\nAt December 31, 2017, investment securities available-for-sale (“AFS”) totaled $2.08 billion, inclusive of a pre-tax net unrealized gain of $2.9 million. AFS securities declined by $94.7 million, or 4.35%, from September 30, 2017, and declined by $189.5 million, or 8.35%, from December 31, 2016.\nCombined, the AFS and HTM investments in mortgage backed securities (“MBS”) and collateralized mortgage obligations (“CMOs”) totaled $2.43 billion at December 31, 2017, compared to $2.52 billion at September 30, 2017 and $2.62 billion at December 31, 2016. Virtually all of our MBS and CMOs are issued or guaranteed by government or government sponsored enterprises, which have the implied guarantee of the U.S. Government.\nOur combined AFS and HTM municipal securities totaled $324.2 million as of December 31, 2017. These securities are located in 29 states. Our largest concentrations of holdings are located in Minnesota at 21.84%, Texas at 10.05%, Massachusetts at 9.97%, and Connecticut at 5.47%.\nIn the fourth quarter of 2017, we purchased $43.8 million of MBS/CMO securities with an average yield of approximately 2.41%.\nLoans\nTotal loans and leases, net of deferred fees and discounts, of $4.83 billion at December 31, 2017 increased by $84.2 million, or 1.77%, from September 30, 2017. The increase in total loans was principally due to growth of $77.2 million in dairy & livestock and agribusiness loans and $37.8 million in commercial real estate loans. The overall increase in loans and leases were partially offset by decreases of $15.4 million in commercial and industrial loans, $8.5 million in single-family residential (“SFR”) mortgage loans, and $6.6 million in consumer and other loans. The majority of growth in dairy & livestock and agribusiness loans is seasonal.\nTotal loans and leases, net of deferred fees and discounts, of $4.83 billion at December 31, 2017 increased by $435.6 million, or 9.91%, from December 31, 2016. The increase in total loans included $309.7 million of loans acquired from VBB in the first quarter of 2017. Excluding the acquired VBB loans, the $125.9 million, or 2.86%, increase in total loans was principally due to growth of $182.8 million in commercial real estate loans and $12.8 million in Small Business Administration (“SBA”) loans. This growth was partially offset by decreases of $21.4 million in consumer and other loans, $17.2 million in commercial and industrial loans, $16.3 million in construction loans, and $14.7 million in SFR loans.\nDeposits & Customer Repurchase Agreements\nDeposits of $6.55 billion and customer repurchase agreements of $553.8 million totaled $7.10 billion at December 31, 2017. This represents an increase of $37.5 million, or 0.53%, when compared with total deposits and customer repurchase agreements of $7.06 billion at September 30, 2017. Deposits and customer repurchase agreements increased by $187.9 million, or 2.72%, when compared with total deposits and customer repurchase agreements of $6.91 billion at December 31, 2016.\nNoninterest-bearing deposits were $3.85 billion at December 31, 2017, a decrease of $62.4 million, or 1.60%, when compared to September 30, 2017, and an increase of $172.9 million, or 4.71%, when compared to $3.67 billion at December 31, 2016. At December 31, 2017, noninterest-bearing deposits were 58.75% of total deposits, compared to 59.15% at September 30, 2017 and 58.22% at December 31, 2016.\nThe increase in total deposits from the end of 2016 included $172.5 million of noninterest-bearing deposits and $361.8 million of total deposits acquired from VBB during the first quarter of 2017. In the fourth quarter of 2017, we sold a branch acquired from VBB, which included approximately $27 million in total deposits.\nOur average cost of total deposits was 0.09% for the quarter ended December 31, 2017, unchanged from both the third quarter of 2017 and the fourth quarter of 2016. Our cost of total deposits including customer repurchase agreements was 0.10% for the quarters ended December 31, 2017, September 30, 2017 and December 31, 2016.\nFHLB Advance, Other Borrowings and Debentures\nAt December 31, 2017, we had no short-term borrowings, compared to $63.0 million at September 30, 2017 and $53.0 million at December 31, 2016.\nAt December 31, 2017, we had $25.8 million of junior subordinated debentures, unchanged from September 30, 2017 and December 31, 2016. These debentures bear interest at three-month LIBOR plus 1.38% and mature in 2036.\nAsset Quality\nThe allowance for loan losses totaled $59.6 million at December 31, 2017, compared to $60.6 million at September 30, 2017 and $61.5 million at December 31, 2016. The allowance for loan losses for the fourth quarter of 2017 was increased by net recoveries on loans of $454,000 and was reduced by a $1.5 million loan loss provision recapture. The allowance for loan losses was 1.23%, 1.28%, 1.28%, 1.28%, and 1.40% of total loans and leases outstanding, at December 31, 2017, September 30, 2017, June 30, 2017, March 31, 2017, and December 31, 2016, respectively. The ratio as of the most recent four quarters was reduced by the $309.7 million loans acquired from VBB that are recorded at fair market value, without a corresponding loan loss allowance.\nNonperforming loans, defined as nonaccrual loans plus nonperforming TDR loans, were $10.7 million at December 31, 2017, or 0.22% of total loans, and included $3.7 million of loans acquired from VBB. This compares to nonperforming loans of $11.6 million, or 0.24% of total loans, at September 30, 2017, and $7.2 million, or 0.16% of total loans, at December 31, 2016. The $10.7 million in nonperforming loans at December 31, 2017 are summarized as follows: $6.8 million in commercial real estate loans, $1.3 million in SFR mortgage loans, $906,000 in SBA loans, $829,000 in dairy & livestock and agribusiness loans, $552,000 in consumer and other loans, and $250,000 in commercial and industrial loans. The $857,000 decrease in nonperforming loans quarter-over-quarter was primarily due to a $705,000 decrease in nonperforming SBA loans and a $191,000 decrease in nonperforming consumer and other loans. This was partially offset by a $114,000 increase in nonperforming commercial real estate loans.\nWe had $4.5 million in Other Real Estate Owned (“OREO”) at December 31, 2017, September 30, 2017 and December 31, 2016. As of December 31, 2017, we had one OREO property, unchanged from September 30, 2017 and December 31, 2016. There were no additions or sales of OREO for the twelve months ended December 31, 2017.\nAt December 31, 2017, we had loans delinquent 30 to 89 days of $1.2 million. This compares to $271,000 at September 30, 2017, and $436,000 at December 31, 2016. As a percentage of total loans, delinquencies, excluding nonaccruals, were 0.02% at December 31, 2017, 0.01% at September 30, 2017, and 0.01% at December 31, 2016.\nAt December 31, 2017, we had $4.8 million in performing TDR loans, compared to $5.7 million in performing TDR loans at September 30, 2017, and $19.2 million in performing TDR loans at December 31, 2016. In terms of the number of loans, we had 16 performing TDR loans at December 31, 2017, compared to 21 performing TDR loans at September 30, 2017, and 26 performing TDR loans at December 31, 2016.\nNonperforming assets, defined as nonaccrual loans plus OREO, totaled $15.2 million at December 31, 2017, $16.1 million at September 30, 2017, and $11.7 million at December 31, 2016. As a percentage of total assets, nonperforming assets were 0.18% at December 31, 2017, 0.19% at September 30, 2017, and 0.14% at December 31, 2016.\nClassified loans are loans that are graded “substandard” or worse. At December 31, 2017, classified loans totaled $57.3 million, compared to $75.1 million at September 30, 2017, and $108.3 million at December 31, 2016. Total classified loans at December 31, 2017 included $5.6 million of classified loans acquired from VBB in the first quarter of 2017. The quarter-over-quarter decrease was primarily due to an $11.6 million decrease in classified commercial real estate loans, a $2.8 million decrease in classified commercial and industrial loans, and a $2.3 million decrease in SBA loans.\nCitizensTrust\nAs of December 31, 2017, CitizensTrust had approximately $2.88 billion in assets under management and administration, including $2.15 billion in assets under management. Revenues were $2.4 million for the fourth quarter of 2017 and $9.8 million for 2017, compared to $2.6 million and $9.6 million, respectively, for the same period of 2016. CitizensTrust provides trust, investment and brokerage related services, as well as financial, estate and business succession planning.\nCorporate Overview\nCVB Financial Corp. (\"CVBF\") is the holding company for Citizens Business Bank. CVBF is the ninth largest bank holding company headquartered in California with assets of approximately $8.3 billion. Citizens Business Bank is consistently recognized as one of the top performing banks in the nation and offers a wide array of banking, lending and investing services through 50 banking centers and 3 trust office locations serving the Inland Empire, Los Angeles County, Orange County, San Diego County, Ventura County, Santa Barbara County, and the Central Valley area of California.\nShares of CVB Financial Corp. common stock are listed on the NASDAQ under the ticker symbol “CVBF.” For investor information on CVB Financial Corp., visit our Citizens Business Bank website at www.cbbank.com and click on the “ Investors ” tab.\nConference Call\nManagement will hold a conference call at 7:30 a.m. PST/10:30 a.m. EST on Thursday, January 25, 2018 to discuss the Company’s fourth quarter and year ended 2017 financial results.\nTo listen to the conference call, please dial (877) 506-3368. A taped replay will be made available approximately one hour after the conclusion of the call and will remain available through February 8, 2018 at 6:00 a.m. PST/9:00 a.m. EST. To access the replay, please dial (877) 344-7529, passcode 10115318.\nThe conference call will also be simultaneously webcast over the Internet; please visit our Citizens Business Bank website at www.cbbank.com and click on the “ Investors ” tab to access the call from the site. Please access the website 15 minutes prior to the call to download any necessary audio software. This webcast will be recorded and available for replay on the Company’s website approximately two hours after the conclusion of the conference call, and will be available on the website for approximately 12 months.\nSafe Harbor\nCertain matters set forth herein (including the exhibits hereto) constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including forward-looking statements relating to the Company's current business plans and expectations and our future financial position and operating results. Words such as “will likely result”, “aims”, “anticipates”, “believes”, “could”, “estimates”, “expects”, “hopes”, “intends”, “may”, “plans”, “projects”, “seeks”, “should”, “will,” “strategy”, “possibility”, and variations of these words and similar expressions help to identify these forward-looking statements, which involve risks and uncertainties. These forward-looking statements are subject to risks and uncertainties that could cause actual results, performance and/or achievements to differ materially from those projected. These risks and uncertainties include, but are not limited to, local, regional, national and international economic and market conditions and political events and the impact they may have on us, our customers and our assets and liabilities; our ability to attract deposits and other sources of funding or liquidity; supply and demand for real estate and periodic deterioration in real estate prices and/or values in California or other states where we lend, including both residential and commercial real estate; a sharp or prolonged slowdown or decline in real estate construction, sales or leasing activities; changes in the financial performance and/or condition of our borrowers, depositors, key vendors or counterparties; changes in our levels of delinquent loans, nonperforming assets, allowance for loan losses and charge-offs; the costs or effects of acquisitions or dispositions we may make, whether we are able to obtain any required governmental approvals in connection with any such acquisitions or dispositions, and/or our ability to realize the contemplated financial or business benefits associated with any such acquisitions or dispositions; the effect of changes in laws, regulations and applicable judicial decisions (including laws, regulations and judicial decisions concerning financial reforms, taxes, bank capital levels, allowance for loan losses, consumer, commercial or secured lending, securities and securities trading and hedging, bank operations, compliance, fair lending, employment, executive compensation, insurance, cybersecurity, vendor management and information technology) with which we and our subsidiaries must comply or believe we should comply or which may otherwise impact us; the effects of additional legal and regulatory requirements to which we may become subject in the event our total assets exceed $10 billion; changes in estimates of future reserve requirements and minimum capital requirements based upon the periodic review thereof under relevant regulatory and accounting requirements, including changes in the Basel Committee framework establishing capital standards for credit, operations and market risk; the accuracy of the assumptions and estimates and the absence of technical error in implementation or calibration of models used to estimate the fair value of financial instruments or expected credit losses or delinquencies; inflation, changes in market interest rates, securities market and monetary fluctuations; changes in government-established interest rates or monetary policies; changes in the amount and availability of deposit insurance; disruptions in the infrastructure that supports our business and the communities where we are located, which are concentrated in California, involving or related to physical site access and/or communication facilities; cyber incidents, or theft or loss of Company or customer data or money; political uncertainty or instability; acts of war or terrorism, or natural disasters, such as earthquakes, drought, or the effects of pandemic diseases; our timely development and acceptance of new banking products and services and the perceived overall value of these products and services by our customers and potential customers; the Company’s relationships with and reliance upon vendors with respect to certain of the Company’s key internal and external systems and applications; changes in commercial or consumer spending, borrowing and savings preferences or behaviors; technological changes and the expanding use of technology in banking and financial services (including the adoption of mobile banking, funds transfer applications and electronic marketplaces for loans and other banking products or services); our ability to retain and increase market share, retain and grow customers and control expenses; changes in the competitive environment among financial and bank holding companies, banks and other financial service and technology providers; competition and innovation with respect to financial products and services by banks, financial institutions and non-traditional providers including retail businesses and technology companies; volatility in the credit and equity markets and its effect on the general economy or local or regional business conditions or on the Company’s customers; fluctuations in the price of the Company’s common stock or other securities, and the resulting impact on the Company’s ability to raise capital or make acquisitions; the effect of changes in accounting policies and practices, as may be adopted from time-to-time by our regulatory agencies, as well as by the Public Company Accounting Oversight Board, the Financial Accounting Standards Board and other accounting standard-setters; changes in our organization, management, compensation and benefit plans, and our ability to retain or expand our workforce, management team and/or our board of directors; the costs and effects of legal, compliance and regulatory actions, changes and developments, including the initiation and resolution of legal proceedings (including securities, bank operations, consumer or employee class action litigation), the possibility that any settlement of any putative class action lawsuits may not be approved by the relevant court or that significant numbers of putative class members may opt out of any settlement; regulatory or other governmental inquiries or investigations, and/or the results of regulatory examinations or reviews; our ongoing relations with our various federal and state regulators, including the SEC, Federal Reserve Board, FDIC and California DBO; our success at managing the risks involved in the foregoing items and all other factors set forth in the Company's public reports, including our Annual Report on Form 10-K for the year ended December 31, 2016, and particularly the discussion of risk factors within that document. The Company does not undertake, and specifically disclaims any obligation, to update any forward-looking statements to reflect occurrences or unanticipated events or circumstances after the date of such statements except as required by law. Any statements about future operating results, such as those concerning accretion and dilution to the Company’s earnings or shareholders, are for illustrative purposes only, are not forecasts, and actual results may differ.\nCVB FINANCIAL CORP. AND SUBSIDIARIES CONDENSED CONSOLIDATED BALANCE SHEETS (Unaudited) (Dollars in thousands) December 31, September 30, December 31, 2017 2017 2016 Assets Cash and due from banks $ 119,841 $ 137,196 $ 119,445 Interest-earning balances due from Federal Reserve 24,536 6,594 2,188 Total cash and cash equivalents 144,377 143,790 121,633 Interest-earning balances due from depository institutions 17,952 20,521 47,848 Investment securities available-for-sale 2,080,985 2,175,648 2,270,466 Investment securities held-to-maturity 829,890 848,382 911,676 Total investment securities 2,910,875 3,024,030 3,182,142 Investment in stock of Federal Home Loan Bank (FHLB) 17,688 17,688 17,688 Loans and lease finance receivables 4,830,631 4,746,424 4,395,064 Allowance for loan losses (59,585 ) (60,631 ) (61,540 ) Net loans and lease finance receivables 4,771,046 4,685,793 4,333,524 Premises and equipment, net 46,166 46,654 42,086 Bank owned life insurance 146,486 145,970 134,785 Intangibles 6,838 7,177 5,010 Goodwill 116,564 116,564 89,533 Other assets 92,594 95,825 99,458 Total assets $ 8,270,586 $ 8,304,012 $ 8,073,707 Liabilities and Stockholders' Equity Liabilities: Deposits: Noninterest-bearing $ 3,846,436 $ 3,908,809 $ 3,673,541 Investment checking 433,971 415,503 407,058 Savings and money market 1,881,099 1,886,687 1,846,257 Time deposits 385,347 397,097 382,824 Total deposits 6,546,853 6,608,096 6,309,680 Customer repurchase agreements 553,773 455,069 603,028 Other borrowings - 63,000 53,000 Junior subordinated debentures 25,774 25,774 25,774 Payable for securities purchased - 1,625 23,777 Other liabilities 74,920 73,984 67,586 Total liabilities 7,201,320 7,227,548 7,082,845 Stockholders' equity 1,069,266 1,076,464 990,862 Total liabilities and stockholders' equity $ 8,270,586 $ 8,304,012 $ 8,073,707 CVB FINANCIAL CORP. AND SUBSIDIARIES CONDENSED CONSOLIDATED AVERAGE BALANCE SHEETS (Unaudited) (Dollars in thousands) Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Assets Cash and due from banks $ 132,467 $ 121,351 $ 130,665 $ 120,237 Interest-earning balances due from Federal Reserve and federal funds sold\n56,940 121,396 58,324 246,945 Total cash and cash equivalents 189,407 242,747 188,989 367,182 Interest-earning balances due from depository institutions 18,947 68,154 28,213 73,344 Investment securities available-for-sale 2,126,254 2,238,600 2,205,854 2,250,577 Investment securities held-to-maturity 839,496 893,698 864,782 801,041 Total investment securities 2,965,750 3,132,298 3,070,636 3,051,618 Investment in stock of FHLB\n17,688 17,688 18,046 17,873 Loans and lease finance receivables 4,754,373 4,312,509 4,623,244 4,195,129 Allowance for loan losses (60,805 ) (61,280 ) (60,547 ) (60,390 ) Net loans and lease finance receivables 4,693,568 4,251,229 4,562,697 4,134,739 Premises and equipment, net 46,741 43,301 46,314 39,078 Bank owned life insurance 146,176 134,338 143,652 132,891 Intangibles 7,057 5,163 6,957 4,937 Goodwill 116,564 88,189 112,916 85,894 Other assets 121,140 108,985 123,301 115,438 Total assets $ 8,323,038 $ 8,092,092 $ 8,301,721 $ 8,022,994 Liabilities and Stockholders' Equity Liabilities: Deposits: Noninterest-bearing $ 3,942,305 $ 3,715,328 $ 3,856,987 $ 3,539,707 Interest-bearing 2,706,628 2,651,142 2,738,175 2,769,642 Total deposits 6,648,933 6,366,470 6,595,162 6,309,349 Customer repurchase agreements 461,373 590,183 529,447 608,779 FHLB advances - - - 710 Other borrowings 15,338 1,680 16,770 2,322 Junior subordinated debentures 25,774 25,774 25,774 25,774 Payable for securities purchased 14,428 27,494 10,417 24,124 Other liabilities 64,780 64,566 62,594 63,204 Total liabilities 7,230,626 7,076,167 7,240,164 7,034,262 Stockholders' equity 1,092,412 1,015,925 1,061,557 988,732 Total liabilities and stockholders' equity $ 8,323,038 $ 8,092,092 $ 8,301,721 $ 8,022,994 CVB FINANCIAL CORP. AND SUBSIDIARIES CONDENSED CONSOLIDATED STATEMENTS OF EARNINGS (Unaudited) (Dollars in thousands, except per share amounts) Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Interest income: Loans and leases, including fees $ 55,873 $ 49,211 $ 214,126 $ 192,992 Investment securities: Investment securities available-for-sale 11,891 11,460 49,778 47,702 Investment securities held-to-maturity 5,001 5,349 21,015 20,227 Total investment income 16,892 16,809 70,793 67,929 Dividends from FHLB stock 305 1,014 1,375 2,224 Interest-earning deposits with other institutions and federal funds sold\n249 330 932 1,905 Total interest income 73,319 67,364 287,226 265,050 Interest expense: Deposits 1,497 1,413 6,044 5,957 Borrowings and junior subordinated debentures 547 510 2,252 2,019 Total interest expense 2,044 1,923 8,296 7,976 Net interest income before recapture of provision for loan losses\n71,275 65,441 278,930 257,074 Recapture of provision for loan losses (1,500 ) (4,400 ) (8,500 ) (6,400 ) Net interest income after recapture of provision for loan losses\n72,775 69,841 287,430 263,474 Noninterest income: Service charges on deposit accounts 4,015 3,680 15,809 15,066 Trust and investment services 2,413 2,556 9,845 9,595 Gain on sale of loans - - - 1,101 Other 6,154 2,176 16,464 9,790 Total noninterest income 12,582 8,412 42,118 35,552 Noninterest expense: Salaries and employee benefits 21,949 19,626 87,065 82,630 Occupancy and equipment 4,118 3,701 16,756 15,641 Professional services 1,749 1,327 5,940 5,054 Software licenses and maintenance 1,687 1,388 6,385 5,465 Marketing and promotion 1,355 1,209 4,839 5,027 Acquisition related expenses 75 340 2,251 1,897 Other 4,124 7,341 17,517 21,026 Total noninterest expense 35,057 34,932 140,753 136,740 Earnings before income taxes 50,300 43,321 188,795 162,286 Income taxes 32,449 16,245 84,384 60,857 Net earnings $ 17,851 $ 27,076 $ 104,411 $ 101,429 Basic earnings per common share $ 0.16 $ 0.25 $ 0.95 $ 0.94 Diluted earnings per common share $ 0.16 $ 0.25 $ 0.95 $ 0.94 Cash dividends declared per common share $ 0.14 $ 0.12 $ 0.54 $ 0.48 Tax Reform and Effect of Tax Rate Change Reconciliations (Non-GAAP)\nWe use certain non-GAAP financial measures to provide supplemental information regarding our performance. Income tax expense for the three and twelve months ended December 31, 2017 includes a one-time charge of $13.2 million as a result of the recent enactment of the Tax Cuts and Jobs Act of 2017. We believe that presenting the effective tax rate, earnings, ROAA, ROAE, earnings per common share, and dividend payout ratio, excluding the impact of the re-measurement of our net deferred tax asset, provides additional clarity to the users of financial statements regarding core financial performance.\nThree Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 (Dollars in thousands, except per share amounts) Income tax expense $ 32,449 $ 16,245 $ 84,384 $ 60,857 Less: Effect of income tax rate change-DTA revaluation (13,208 ) - (13,208 ) - Adjusted income tax expense $ 19,241 $ 16,245 $ 71,176 $ 60,857 Effective Tax Rate 64.51 % 37.50 % 44.70 % 37.50 % Adjusted effective tax rate 38.25 % 37.50 % 37.70 % 37.50 % Net earnings $ 17,851 $ 27,076 $ 104,411 $ 101,429 Effect of income tax rate change-DTA revaluation 13,208 - 13,208 - Adjusted net earnings $ 31,059 $ 27,076 $ 117,619 $ 101,429 Average assets $ 8,323,038 $ 8,092,092 $ 8,301,721 $ 8,022,994 Return on average assets [1] 0.85 % 1.33 % 1.26 % 1.26 % Adjusted return on average assets [1] 1.48 % 1.33 % 1.42 % 1.26 % Average equity $ 1,092,412 $ 1,015,925 $ 1,061,557 $ 988,732 Return on average equity [1] 6.48 % 10.60 % 9.84 % 10.26 % Adjusted return on average equity [1] 11.28 % 10.60 % 11.08 % 10.26 % Weighted average shares outstanding Basic 109,793,813 107,693,714 109,409,301 107,282,332 Diluted 110,205,600 108,115,476 109,806,710 107,686,955 Earnings per common share: Basic $ 0.16 $ 0.25 $ 0.95 $ 0.94 Diluted $ 0.16 $ 0.25 $ 0.95 $ 0.94 Adjusted earnings per common share: Basic $ 0.28 $ 0.25 $ 1.07 $ 0.94 Diluted $ 0.28 $ 0.25 $ 1.07 $ 0.94 Dividends declared $ 15,425 $ 12,996 $ 59,483 $ 51,849 Dividend payout ratio [2] 86.41 % 48.00 % 56.97 % 51.12 % Adjusted dividend payout ratio [2] 49.66 % 48.00 % 50.57 % 51.12 % [1] Annualized\n[2] Dividends declared on common stock divided by net earnings.\nCVB FINANCIAL CORP. AND SUBSIDIARIES SELECTED FINANCIAL HIGHLIGHTS (Unaudited) (Dollars in thousands, except per share amounts) Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Interest income - tax-equivalent (TE) $ 74,265 $ 68,509 $ 291,234 $ 270,358 Interest expense 2,044 1,923 8,296 7,976 Net interest income - (TE) $ 72,221 $ 66,586 $ 282,938 $ 262,382 Return on average assets, annualized 0.85 % 1.33 % 1.26 % 1.26 % Return on average equity, annualized 6.48 % 10.60 % 9.84 % 10.26 % Efficiency ratio [1] 41.81 % 47.30 % 43.84 % 46.73 % Noninterest expense to average assets, annualized 1.67 % 1.72 % 1.70 % 1.70 % Yield on average earning assets (TE) 3.79 % 3.57 % 3.74 % 3.57 % Cost of deposits 0.09 % 0.09 % 0.09 % 0.09 % Cost of deposits and customer repurchase agreements 0.10 % 0.10 % 0.10 % 0.11 % Cost of funds 0.11 % 0.11 % 0.12 % 0.11 % Net interest margin (TE) 3.68 % 3.47 % 3.63 % 3.46 % [1] Noninterest expense divided by net interest income before provision for loan losses plus noninterest income. Weighted average shares outstanding Basic 109,793,813 107,693,714 109,409,301 107,282,332 Diluted 110,205,600 108,115,476 109,806,710 107,686,955 Dividends declared $ 15,425 $ 12,996 $ 59,483 $ 51,849 Dividend payout ratio [2] 86.41 % 48.00 % 56.97 % 51.12 % [2] Dividends declared on common stock divided by net earnings. Number of shares outstanding - (end of period) 110,184,922 108,251,981 Book value per share $ 9.70 $ 9.15 Tangible book value per share $ 8.58 $ 8.28 December 31, 2017 2016 Nonperforming assets: Nonaccrual loans $ 6,516 $ 5,526 Loans past due 90 days or more and still accruing interest\n- - Troubled debt restructured loans (nonperforming) 4,200 1,626 Other real estate owned (OREO), net 4,527 4,527 Total nonperforming assets $ 15,243 $ 11,679 Troubled debt restructured performing loans $ 4,809 $ 19,233 Percentage of nonperforming assets to total loans outstanding and OREO\n0.32 % 0.27 % Percentage of nonperforming assets to total assets\n0.18 % 0.14 % Allowance for loan losses to nonperforming assets\n390.90 % 526.93 % Twelve Months Ended December 31, 2017 2016 Allowance for loan losses: Beginning balance $ 61,540 $ 59,156 Total charge-offs (151 ) (238 ) Total recoveries on loans previously charged-off 6,696 9,022 Net recoveries 6,545 8,784 Recapture of provision for loan losses (8,500 ) (6,400 ) Allowance for loan losses at end of period $ 59,585 $ 61,540 Net recoveries to average loans 0.142 % 0.209 % CVB FINANCIAL CORP. AND SUBSIDIARIES SELECTED FINANCIAL HIGHLIGHTS (Unaudited) (Dollars in thousands, except per share amounts) Quarterly Common Stock Price 2017 2016 2015 Quarter End High Low High Low High Low March 31, $ 24.63 $ 20.58 $ 17.70 $ 14.02 $ 16.21 $ 14.53 June 30, $ 22.85 $ 19.90 $ 17.92 $ 15.25 $ 18.11 $ 15.45 September 30, $ 24.29 $ 19.58 $ 17.88 $ 15.39 $ 18.37 $ 15.30 December 31, $ 25.49 $ 22.25 $ 23.23 $ 16.32 $ 18.77 $ 15.82 Quarterly Consolidated Statements of Earnings Q4 Q3 Q2 Q1 Q4 2017 2017 2017 2017 2016 Interest income Loans and leases, including fees $ 55,873 $ 55,998 $ 53,614 $ 48,641 $ 49,211 Investment securities and other 17,446 17,872 18,975 18,807 18,153 Total interest income 73,319 73,870 72,589 67,448 67,364 Interest expense Deposits 1,497 1,555 1,559 1,433 1,413 Other borrowings 547 576 547 582 510 Total interest expense 2,044 2,131 2,106 2,015 1,923 Net interest income before recapture of provision for loan losses\n71,275 71,739 70,483 65,433 65,441 Recapture of provision for loan losses (1,500 ) (1,500 ) (1,000 ) (4,500 ) (4,400 ) Net interest income after recapture of provision for loan losses\n72,775 73,239 71,483 69,933 69,841 Noninterest income 12,582 10,038 10,776 8,722 8,412 Noninterest expense 35,057 34,706 36,873 34,117 34,932 Earnings before income taxes 50,300 48,571 45,386 44,538 43,321 Income taxes 32,449 18,888 17,013 16,034 16,245 Net earnings $ 17,851 $ 29,683 $ 28,373 $ 28,504 $ 27,076 Effective tax rate 64.51 % 38.89 % 37.49 % 36.00 % 37.50 % Basic earnings per common share $ 0.16 $ 0.27 $ 0.26 $ 0.26 $ 0.25 Diluted earnings per common share $ 0.16 $ 0.27 $ 0.26 $ 0.26 $ 0.25 Cash dividends declared per common share $ 0.14 $ 0.14 $ 0.14 $ 0.12 $ 0.12 Cash dividends declared $ 15,425 $ 15,423 $ 15,617 $ 13,018 $ 12,996 CVB FINANCIAL CORP. AND SUBSIDIARIES SELECTED FINANCIAL HIGHLIGHTS (Unaudited) (Dollars in thousands) Loan Portfolio by Type December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 Commercial and industrial $ 514,259 $ 529,661 $ 539,260 $ 530,856 $ 487,387 SBA 123,438 125,501 130,716 114,265 97,511 Real estate: Commercial real estate 3,404,144 3,366,316 3,312,068 3,271,592 2,997,735 Construction 77,982 74,148 77,294 72,782 85,879 SFR mortgage 236,364 244,828 250,104 245,537 250,783 Dairy & livestock and agribusiness 348,059 270,817 245,600 244,724 339,847 Municipal lease finance receivables 70,243 71,352 66,048 62,416 64,639 Consumer and other loans 64,457 71,009 74,714 81,534 79,743 Gross loans 4,838,946 4,753,632 4,695,804 4,623,706 4,403,524 Less: Purchase accounting discount on PCI loans (2,026 ) (758 ) (1,008 ) (1,258 ) (1,508 ) Deferred loan fees, net (6,289 ) (6,450 ) (7,098 ) (6,951 ) (6,952 ) Gross loans, net of deferred loan fees and discounts 4,830,631 4,746,424 4,687,698 4,615,497 4,395,064 Allowance for loan losses (59,585 ) (60,631 ) (60,201 ) (59,212 ) (61,540 ) Net loans $ 4,771,046 $ 4,685,793 $ 4,627,497 $ 4,556,285 $ 4,333,524 Deposit Composition by Type and Customer Repurchase Agreements December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 Noninterest-bearing $ 3,846,436 $ 3,908,809 $ 3,929,394 $ 3,999,107 $ 3,673,541 Investment checking 433,971 415,503 415,768 424,077 407,058 Savings and money market 1,881,099 1,886,687 1,948,634 1,993,196 1,846,257 Time deposits 385,347 397,097 403,385 426,433 382,824 Total deposits 6,546,853 6,608,096 6,697,181 6,842,813 6,309,680 Customer repurchase agreements 553,773 455,069 546,085 564,387 603,028 Total deposits and customer repurchase agreements $ 7,100,626 $ 7,063,165 $ 7,243,266 $ 7,407,200 $ 6,912,708 CVB FINANCIAL CORP. AND SUBSIDIARIES SELECTED FINANCIAL HIGHLIGHTS (Unaudited) (Dollars in thousands) Nonperforming Assets and Delinquency Trends December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 Nonperforming loans:\nCommercial and industrial $ 250 $ 313 $ 1,058 $ 506 $ 156 SBA 906 1,611 1,651 1,089 2,737 Real estate: Commercial real estate 6,842 6,728 6,950 5,623 1,683 Construction - - - 384 - SFR mortgage 1,337 1,349 963 983 2,207 Dairy & livestock and agribusiness 829 829 829 1,324 - Consumer and other loans 552 743 771 438 369 Total $ 10,716 $ 11,573 $ 12,222 $ 10,347 $ 7,152 % of Total gross loans 0.22 % 0.24 % 0.26 % 0.22 % 0.16 % Past due 30-89 days:\nCommercial and industrial $ 768 $ 45 $ - $ 219 $ - SBA 403 - - 329 352 Real estate: Commercial real estate - 220 218 - - Construction - - - - - SFR mortgage - - 400 403 - Dairy & livestock and agribusiness - - - - - Consumer and other loans 1 6 1 429 84 Total $ 1,172 $ 271 $ 619 $ 1,380 $ 436 % of Total gross loans 0.02 % 0.01 % 0.01 % 0.03 % 0.01 % OREO:\nReal estate: Commercial real estate $ - $ - $ - $ - $ - Construction 4,527 4,527 4,527 4,527 4,527 Total $ 4,527 $ 4,527 $ 4,527 $ 4,527 $ 4,527 Total nonperforming, past due, and OREO $ 16,415 $ 16,371 $ 17,368 $ 16,254 $ 12,115 % of Total gross loans 0.34 % 0.34 % 0.37 % 0.35 % 0.28 % Tangible Book Value Reconciliations (Non-GAAP)\nThe tangible book value per share is a Non-GAAP disclosure. The Company uses certain non-GAAP financial measures to provide supplemental information regarding the Company's performance. The following is a reconciliation of tangible book value to the Company stockholders' equity computed in accordance with GAAP, as well as a calculation of tangible book value per share as of December 31, 2017 and 2016.\nDecember 31, 2017 2016 (Dollars in thousands, except per share amounts) Stockholders' equity $ 1,069,266 $ 990,862 Less: Goodwill (116,564 ) (89,533 ) Less: Intangible assets (6,838 ) (5,010 ) Tangible book value $ 945,864 $ 896,319 Common shares issued and outstanding 110,184,922 108,251,981 Tangible book value per share $ 8.58 $ 8.28\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006310/en/\nCVB Financial Corp.\nChristopher D. Myers\nPresident and CEO\n(909) 980-4030\nSource: CVB Financial Corp.", "external_links": ["http://www.businesswire.com/news/home/20180124006310/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cbbank.com&esheet=51747959&newsitemid=20180124006310&lan=en-US&anchor=www.cbbank.com&index=1&md5=7cb2e2cb6d2ae155007fb2ce6379c608", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cbbank.com&esheet=51747959&newsitemid=20180124006310&lan=en-US&anchor=www.cbbank.com&index=3&md5=199c149a5164ef14498b0cbfb2cc0901", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.snl.com%2Firweblinkx%2Fcorporateprofile.aspx%3Fiid%3D100224&esheet=51747959&newsitemid=20180124006310&lan=en-US&anchor=Investors&index=4&md5=86895b8242bf37034a55f3fe126d6ba6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.snl.com%2Firweblinkx%2Fcorporateprofile.aspx%3Fiid%3D100224&esheet=51747959&newsitemid=20180124006310&lan=en-US&anchor=Investors&index=2&md5=b0aaf6387fce3ba02f0d8f01114e0ac1"], "published": "2018-01-25T01:39:00.000+02:00", "crawled": "2018-01-25T01:39:00.000+02:00", "highlightTitle": ""}