{"organizations": [], "uuid": "249aba3b3f74511524d5e70400479d93401230cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 63, "shares": 63, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://asset.wsj.net/images/im-1437/social", "site_section": "https://www.wsj.com/public/page/archive.html", "section_title": "News Article Archive - Wsj.com", "url": "https://www.wsj.com/articles/fcc-cites-multiple-mistakes-in-hawaii-false-missile-alert-1517336473", "country": "US", "domain_rank": 387, "title": "FCC Cites Multiple Mistakes in Hawaii False Missile Alert", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T21:21:00.000+02:00", "replies_count": 0, "uuid": "249aba3b3f74511524d5e70400479d93401230cd"}, "author": "John D. McKinnon", "url": "https://www.wsj.com/articles/fcc-cites-multiple-mistakes-in-hawaii-false-missile-alert-1517336473", "ord_in_thread": 0, "title": "FCC Cites Multiple Mistakes in Hawaii False Missile Alert", "locations": [], "entities": {"persons": [], "locations": [{"name": "hawaii", "sentiment": "none"}, {"name": "hawaii false missile alert washington", "sentiment": "none"}], "organizations": [{"name": "fcc", "sentiment": "negative"}, {"name": "federal communications commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "17 COMMENTS WASHINGTON—Federal regulators found multiple mistakes contributed to Hawaii’s recent false-alarm missile alert , including use of a recording to kick off the planned drill that contained the words “This is not a drill.”\nA state emergency-warning officer who heard the recording “believed the drill was real” and intentionally triggered the alert, according to an update provided on Tuesday to Federal Communications Commission members.\nPrior accounts by state officials have suggested that the officer accidentally clicked on the wrong button to set off the alarm on Jan. 13.\nThe officer initiated an alert that went out through many residents’ mobile phones, as well as television and radio stations. “BALLISTIC MISSILE THREAT INBOUND TO HAWAII,” the alert said, in all-caps. “SEEK IMMEDIATE SHELTER. THIS IS NOT A DRILL.”\nThe event sparked terror across the state . “Panic-stricken citizens called their families to say what they believed were their last words, and some even resorted to jumping into manholes to find shelter,” said FCC Chairman Ajit Pai.\nOther emergency officials on duty at the time were aware that the recording was intended to start a drill. It began and ended with the words, “Exercise! Exercise!”\nThe alert was canceled a few minutes later, but it took 38 minutes for Hawaii officials to send a new message saying that the original alert had been a false alarm.\nFCC officials said they have not been able to interview the officer who initiated the alert, and had to rely on a written statement he has given.\nThe FCC’s preliminary investigation concluded that a combination of human error and numerous procedural shortcomings contributed to the false alarm.\nA highway-median sign Kaneohe, Hawaii, indicating that a threat wasn’t imminent after the accidental alert. Photo: Jhune Liwanag/Associated Press The problems included miscommunication between shift supervisors as the drill was about to be started around 8 a.m. (HST) on a Saturday. That led to a lack of sufficient supervision. The recording used to initiate the drill also deviated from a standard script, by including the words “this is not a drill,” FCC officials said.\nHawaii also lacked procedures to prevent a single person from sending a live alert. Hawaii had been conducting an unusually high number of drills, heightening the risk of a bungle, FCC investigators found.\nThe state also lacked adequate procedures for recalling a false alert.\nMr. Pai underscored the need for the decentralized national alert system to work effectively. He said the agency would continue working with other federal officials as well as state and local officials to develop corrective actions and best practices.\n“We want to minimize both the chances of future false alerts being issued, as well as the impact of any such false alerts,” he said.\nWrite to John D. McKinnon at john.mckinnon@wsj.com", "external_links": [], "published": "2018-01-30T21:21:00.000+02:00", "crawled": "2018-01-31T01:37:14.012+02:00", "highlightTitle": ""}