{"organizations": [], "uuid": "e3094b02f9f29c99fae6cff2cd0870ae5ac8e194", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-allergan-to-report-fourth-quarter-and-full-year-2017-earnings-and-host-conference-call-and-webcast.html", "country": "US", "domain_rank": 767, "title": "Allergan to Report Fourth Quarter and Full Year 2017 Earnings and Host Conference Call and Webcast", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-08T17:00:00.000+02:00", "replies_count": 0, "uuid": "e3094b02f9f29c99fae6cff2cd0870ae5ac8e194"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-allergan-to-report-fourth-quarter-and-full-year-2017-earnings-and-host-conference-call-and-webcast.html", "ord_in_thread": 0, "title": "Allergan to Report Fourth Quarter and Full Year 2017 Earnings and Host Conference Call and Webcast", "locations": [], "entities": {"persons": [], "locations": [{"name": "webcast dublin", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "allergan", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "u.s. financial markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBLIN, Jan. 8, 2018 /PRNewswire/ -- Allergan plc (NYSE: AGN) today announced it intends to release fourth quarter and full year 2017 financial results on Tuesday, February 6, 2018, prior to the open of U.S. Financial Markets.\nAllergan will host a conference call and webcast at 8:30 a.m. Eastern Time on Tuesday, February 6, 2018 to discuss its financial results. The dial-in number to access the call is U.S./Canada (877) 251-7980, International (706) 643-1573, and the conference ID is 67779395 .\nA taped replay of the conference call will also be available beginning approximately two hours after the call's conclusion, and will remain available through 11:30 p.m. Eastern Time on March 6, 2018. The replay may be accessed by dialing (855) 859-2056 and entering the conference ID 67779395. From international locations, the replay may be accessed by dialing (404) 537-3406 and entering the same conference ID.\nTo access the webcast, please visit Allergan's Investor Relations website at https://www.allergan.com/investors . A replay of the webcast will also be available on Allergan's Investor Relations website.\nAbout Allergan plc\nAllergan plc (NYSE: AGN), headquartered in Dublin, Ireland, is a bold, global pharmaceutical company and a leader in a new industry model – Growth Pharma. Allergan is focused on developing, manufacturing and commercializing branded pharmaceutical, device, biologic, surgical and regenerative medicine products for patients around the world.\nAllergan markets a portfolio of leading brands and best-in-class products for the central nervous system, eye care, medical aesthetics and dermatology, gastroenterology, women's health, urology and anti-infective therapeutic categories.\nAllergan is an industry leader in Open Science, a model of research and development, which defines our approach to identifying and developing game-changing ideas and innovation for better patient care. With this approach, Allergan has built one of the broadest development pipelines in the pharmaceutical industry with 55+ mid-to-late stage pipeline programs currently in development.\nAllergan's success is powered by our more than 18,000 global colleagues' commitment to being Bold for Life. Together, we build bridges, power ideas, act fast and drive results for our customers and patients around the world by always doing what is right.\nWith commercial operations in approximately 100 countries, Allergan is committed to working with physicians, healthcare providers and patients to deliver innovative and meaningful treatments that help people around the world live longer, healthier lives every day.\nFor more information, visit Allergan's website at www.Allergan.com .\nForward-Looking Statement\nStatements contained in this press release that refer to future events or other non-historical facts are forward-looking statements that reflect Allergan's current perspective on existing trends and information as of the date of this release. Actual results may differ materially from Allergan's current expectations depending upon a number of factors affecting Allergan's business. These factors include, among others, the difficulty of predicting the timing or outcome of FDA approvals or actions, if any; the impact of competitive products and pricing; market acceptance of and continued demand for Allergan's products; the impact of uncertainty around timing of generic entry related to key products, including RESTASIS ® , on our financial results; uncertainty associated with financial projections, projected cost reductions, projected synergies, restructurings, increased costs, and adverse tax consequences; difficulties or delays in manufacturing; and other risks and uncertainties detailed in Allergan's periodic public filings with the Securities and Exchange Commission, including but not limited to Allergan's Annual Report on Form 10-K for the year ended December 31, 2016 and Allergan's Quarterly Report on Form 10-Q for the period ended September 30, 2017. Except as expressly required by law, Allergan disclaims any intent or obligation to update these\nCONTACTS:\nAllergan:\nInvestors:\nDaphne Karydas\n(862) 261-8006\nKarina Calzadilla\n(862) 261-7328\nMedia:\nMark Marmur\n(862) 261-7558\nView original content with multimedia: http://www.prnewswire.com/news-releases/allergan-to-report-fourth-quarter-and-full-year-2017-earnings-and-host-conference-call-and-webcast-300578521.html\nSOURCE Allergan plc", "external_links": ["http://www.prnewswire.com/news-releases/allergan-to-report-fourth-quarter-and-full-year-2017-earnings-and-host-conference-call-and-webcast-300578521.html", "http://www.allergan.com/", "https://www.allergan.com/investors"], "published": "2018-01-08T17:00:00.000+02:00", "crawled": "2018-01-08T19:04:42.006+02:00", "highlightTitle": ""}