{"organizations": [], "uuid": "cb513a3ed891be7fa0c482d2c24d94d59fde36c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224136466&w=1200&r=LYNXMPEE0L113", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-defence/keeping-up-with-the-russians-head-of-uk-army-wants-more-money-idUKKBN1FB1F3", "country": "US", "domain_rank": 408, "title": "Keeping up with the Russians - head of UK army wants more money", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T14:00:00.000+02:00", "replies_count": 0, "uuid": "cb513a3ed891be7fa0c482d2c24d94d59fde36c2"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-defence/keeping-up-with-the-russians-head-of-uk-army-wants-more-money-idUKKBN1FB1F3", "ord_in_thread": 0, "title": "Keeping up with the Russians - head of UK army wants more money", "locations": [], "entities": {"persons": [{"name": "nick carter", "sentiment": "none"}, {"name": "carter", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "royal united services institute for defence and security studies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 12:00 PM / Updated 31 minutes ago Keeping up with the Russians - head of UK army wants more money Reuters Staff   Britain must ensure its armed forces can keep up with adversaries like Russia, which already has military capabilities the United Kingdom would struggle to match, according to the head of the British army. \nThe comments from Chief of the General Staff Nick Carter, due to be delivered in a speech on Monday, reflect concerns among the top brass and some politicians that defence spending is being too tightly squeezed because of wider fiscal austerity. \n“Our ability to pre-empt or respond to threats will be eroded if we don’t keep up with our adversaries,” General Carter will say, according to excerpts of his speech circulated by the Royal United Services Institute for Defence and Security Studies, where he is due to deliver it. \n“The time to address these threats is now – we cannot afford to sit back.” \nCarter will point to Russia, saying it has demonstrated its long-range strike capability on numerous occasions, for example when it fired 26 cruise missiles with a range of 1,500 km into Syria in October 2015. \nHe will also cite massive war games conducted last year by the Russian military in Kaliningrad, a Russian exclave between Lithuania and Poland, which have rattled some governments that see them as Moscow testing its ability to wage war against the West. \nBritain is among NATO members who have reinforced their presence in the Baltic region in response to Russia’s show of strength. \nCarter will also warn that in addition to traditional threats posed by foreign armies, Britain had to keep up with increasingly creative forms of disruption from adversaries. \n“State-based competition is now being employed in more novel and increasingly integrated ways and we must be ready to deal with them,” he is expected to say. \n“The threats we face are not thousands of miles away but are now on Europe’s doorstep - we have seen how cyber warfare can be both waged on the battlefield and to disrupt normal people’s lives - we in the UK are not immune from that.” \nCarter’s speech, which was approved by Defence Secretary Gavin Williamson, will be widely seen as a pitch for increased defence spending at a time when cabinet ministers are making competing arguments for where limited resources are most needed. \nBritain spends about 2 percent of its Gross Domestic Product on defence, in line with its commitments as a NATO member. \nUnder the government’s last spending plans, issued in late 2015, defence spending was expected to rise slightly above inflation over a five-year period. \nHowever, some politicians have expressed concerns that the spending levels were not sufficient to meet new threats, and that some of the Ministry of Defence’s procurement plans were based on over-optimistic assumptions. \nIn particular, parliament’s defence committee said in a report in December that some plans to acquire military equipment relied on money being freed up by efficiency savings which the lawmakers were concerned may not materialise. Reporting by Estelle Shirbon; editing by Guy Faulconbridge", "external_links": [], "published": "2018-01-22T14:00:00.000+02:00", "crawled": "2018-01-22T14:24:57.000+02:00", "highlightTitle": ""}