{"organizations": [], "uuid": "132926b5f9826d4140352e30c020a5c6bc505313", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224178895&w=1200&r=LYNXMPEE0L1FH", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-security-finsbury/driver-who-targeted-london-mosque-was-angered-by-islamist-attacks-tv-show-prosecutor-idUKKBN1FB1YW", "country": "US", "domain_rank": 408, "title": "Driver who targeted London mosque was angered by Islamist attacks, TV show-prosecutor", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:53:00.000+02:00", "replies_count": 0, "uuid": "132926b5f9826d4140352e30c020a5c6bc505313"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-security-finsbury/driver-who-targeted-london-mosque-was-angered-by-islamist-attacks-tv-show-prosecutor-idUKKBN1FB1YW", "ord_in_thread": 0, "title": "Driver who targeted London mosque was angered by Islamist attacks, TV show-prosecutor", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "michael holden", "sentiment": "none"}, {"name": "darren osborne", "sentiment": "none"}, {"name": "sadiq khan", "sentiment": "none"}, {"name": "rees", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "makram ali", "sentiment": "none"}, {"name": "jonathan rees", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "finsbury park", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "labour party", "sentiment": "none"}, {"name": "woolwich crown court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 2:53 PM / Updated 7 hours ago Driver who targeted London mosque was angered by Islamist attacks, TV show-prosecutor Michael Holden 4 Min Read \nLONDON (Reuters) - A man who drove a van into Muslim worshippers outside a mosque last June was motivated by deadly Islamist attacks in Britain and an obsession with a television account of Muslim men who targeted white girls, a London court heard on Monday. \nDarren Osborne, 48, also lambasted politicians, calling London Mayor Sadiq Khan a disgrace and Labour Party leader Jeremy Corbyn a “terrorist sympathiser”, prosecutor Jonathan Rees said, quoting from a note he said Osborne left in the van. \nThe note described Muslim men as rapists, “feral” and “in-bred” and when he was detained after the attack, Osborne said: “At least I had a go”, Rees told Woolwich Crown Court. \nOsborne is accused of murdering Makram Ali, 51, a father of six who came to Britain from Bangladesh aged 10, and the attempted murder of other worshippers as they left a mosque in Finsbury Park in north London after late-night Ramadan prayers. \nOsborne has denied the accusations. \n“The evidence establishes that the defendant was trying to kill as many of the group as possible,” Rees told jurors. “The prosecution say that the note and the comments he made after his detention establish that this act of extreme violence was, indeed, an act of terrorism, designed to influence government and intimidate the Muslim community.” \nThe incident occurred just weeks after three Islamists drove a van into pedestrians on London Bridge before going on a knife rampage, killing eight. \nThat attack came the month after a suicide bombing at a pop concert in Manchester killed 22 people. In March another Islamic State-inspired attacker killed five people by driving a car into passers-by on London’s Westminster Bridge and then stabbing to death a police officer in the grounds of parliament. \nRees said Osborne hired a van and drove to London from his home in Cardiff. After a plan to attack an anti-Israel march failed, Osborne drove around seeking alternative targets. \nHe is accused of ramming the crowd at Finsbury Park as worshippers helped Ali who he had earlier become unwell. \nThe court was told Osborne, who had never previously openly expressed racist opinions, had become obsessed with Muslims in the weeks before the attack after watching a BBC television drama “Three Girls”, based on true stories of victims of child sex gangs comprised mainly of British Pakistani men. \nRees said Osborne searched online for material related to the show, some of which was connected to far-right groups and Jayda Fransen, deputy leader of Britain First. \nOne of Fransen’s messages was re-tweeted by U.S. President Donald Trump in November. \nTwo days before the attack, Osborne told a serving soldier in a pub in Cardiff: “I‘m going to kill all the Muslims”, the jurors were told. \nRees said Osborne’s former partner Sarah Andrews described the father of four as a loner and a functioning alcoholic with an unpredictable temperament who took medication for depression. \n“With the benefit of hindsight, she describes him as a ticking time-bomb,” the prosecutor said. \nThe trial, which is expected to last two weeks, continues. Reporting by Michael Holden; Editing by William Schomberg", "external_links": [], "published": "2018-01-22T16:53:00.000+02:00", "crawled": "2018-01-22T17:14:29.069+02:00", "highlightTitle": ""}