{"organizations": [], "uuid": "96a6440e7333c06addc1106103d7d0d08f80ae78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-casper-appoints-chief-financial-officer-and-chief-marketing-officer.html", "country": "US", "domain_rank": 767, "title": "Casper Appoints Chief Financial Officer and Chief Marketing Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.209, "site_type": "news", "published": "2018-01-17T21:00:00.000+02:00", "replies_count": 0, "uuid": "96a6440e7333c06addc1106103d7d0d08f80ae78"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-casper-appoints-chief-financial-officer-and-chief-marketing-officer.html", "ord_in_thread": 0, "title": "Casper Appoints Chief Financial Officer and Chief Marketing Officer", "locations": [], "entities": {"persons": [{"name": "macfarlane", "sentiment": "none"}, {"name": "brooks", "sentiment": "none"}, {"name": "greg macfarlane", "sentiment": "none"}, {"name": "jeff brooks", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "ceridian corporation", "sentiment": "none"}, {"name": "operations and strategy for h&r block", "sentiment": "none"}, {"name": "h&r block", "sentiment": "none"}, {"name": "ge", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 17, 2018 /PRNewswire/ -- Casper ( casper.com ), the global sleep company that launched just three and a half years ago with its outrageously comfortable mattress, today announces the hire of Greg Macfarlane as Chief Financial Officer and Jeff Brooks as Chief Marketing Officer.\nMacfarlane joins Casper with more than 20 years of business and financial leadership experience for industry-leading companies. Previously, Macfarlane served as Chief Financial Officer and Head of Operations and Strategy for H&R Block, the largest global consumer tax services provider with 12,000 tax offices worldwide. Prior to H&R Block, Macfarlane was Executive Vice President and CFO for Ceridian Corporation, and spent more than 14 years in senior leadership roles at GE.\nBrooks brings 25 years of experience building world-class brands at global creative and media agencies. He joins Casper from the award-winning digital agency Huge where he served as President and Chief Marketing Officer. During his tenure at Huge, Casper's lead creative agency, Brooks worked closely with the Casper team. Prior to Huge, Brooks held several leadership roles, including Chief Commercial Officer of MDC Media Partners, Chief Executive Officer of both M&C Saatchi and Havas, and President of BBDO's digital agency network.\nBoth hires come on the heels of another impressive growth year for Casper. In only its third full year, the company's total revenue since inception has grown to more than $600M.\n\"Casper's disruption and rapid transformation of a staid, multi-billion-dollar industry is amazing,\" said Macfarlane. \"The opportunities ahead for Casper are tremendous and I'm really excited to be part of the team.\"\n\"I've appreciated the product as a customer, admired the brand as a consumer, and can't wait to take the business to new heights as a marketer,\" said Jeff Brooks. \"I'm also thrilled to be able to collaborate with my former colleagues from Huge, as they will remain an important agency partner for the brand.\"\n\"This expansion of our leadership team is a major building block in our growth story,\" said Philip Krim, CEO and co-founder of Casper. \"Greg and Jeff bring invaluable experience to Casper as we continue to scale and bring better sleep to more people across the globe.\"\nCasper recently established a major retail partnership with Target, putting the company's products in more than 1200 Target locations, and American Airlines, outfitting its entire fleet with first-class Casper sleep systems. The company also opened 15 retail concept shops across the country this year, bringing its unparalleled shopping experience to the offline world. This past June, Casper raised a $170M series C round, bringing its total funding to date to $240M.\nAbout Casper:\nCasper ( casper.com ) was created to re-imagine sleep from the ground up, beginning with its obsessively engineered, outrageously comfortable mattress. All of Casper's sleep products — including its pillow, bedding, and bed frames — are developed in-house by the company's award-winning R&D team in San Francisco. Casper was recently named one of Fast Company's Most Innovative Companies in the World and its eponymous mattress was crowned one of TIME Magazine's Best Inventions.\nContact:\nLindsay Kaplan\nVP, Communications\ncomms@casper.com\nView original content: http://www.prnewswire.com/news-releases/casper-appoints-chief-financial-officer-and-chief-marketing-officer-300584056.html\nSOURCE Casper", "external_links": ["http://www.casper.com/", "http://www.prnewswire.com/news-releases/casper-appoints-chief-financial-officer-and-chief-marketing-officer-300584056.html"], "published": "2018-01-17T21:00:00.000+02:00", "crawled": "2018-01-17T21:11:18.008+02:00", "highlightTitle": ""}