{"organizations": [], "uuid": "3afe152c84e40c1ecbd734c233cc28ab2de656ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-amag-pharmaceuticals-announces-preliminary-2017-financial-results-and-provides-2018-guidance.html", "country": "US", "domain_rank": 767, "title": "AMAG Pharmaceuticals Announces Preliminary 2017 Financial Results and Provides 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "3afe152c84e40c1ecbd734c233cc28ab2de656ae"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-amag-pharmaceuticals-announces-preliminary-2017-financial-results-and-provides-2018-guidance.html", "ord_in_thread": 0, "title": "AMAG Pharmaceuticals Announces Preliminary 2017 Financial Results and Provides 2018 Guidance", "locations": [], "entities": {"persons": [{"name": "william heiden", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "amag pharmaceuticals announces preliminary 2017 financial results", "sentiment": "negative"}, {"name": "amag", "sentiment": "negative"}, {"name": "amag pharmaceuticals, inc.", "sentiment": "neutral"}, {"name": "j.p. morgan healthcare conference", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass., Jan. 08, 2018 (GLOBE NEWSWIRE) -- AMAG Pharmaceuticals, Inc. (NASDAQ:AMAG) today provided a business update, including preliminary unaudited fourth quarter and full year 2017 financial results and 2018 financial guidance. The company will present further details at the 36 th Annual J.P. Morgan Healthcare Conference in San Francisco on Tuesday, January 9, 2018 at 10:00 a.m. PT (1:00 p.m. ET). A live audio webcast of the presentation and following breakout session will be accessible through the Investors section of AMAG’s website at www.amagpharma.com .\nWilliam Heiden, AMAG’s president and chief executive officer, said, “Over the last few years we have transformed AMAG from a one product company into a company with five marketed products and two additional products in development. Today we are reporting double-digit revenue growth in 2017 of more than $600 million, along with strong bottom-line cash generation. Throughout the year, we also achieved many important goals that will be key to our long-term success, including the establishment of our new 200-person women’s health commercial team, the launch of Intrarosa® (prasterone), a novel women’s health product, and the filing of supplemental new drug applications to extend our Makena and Feraheme brands.”\n“Our flexible operating plan supports the 2018 top-line revenue and adjusted EBITDA guidance ranges provided today, which incorporate the opportunities and key risks across our product portfolio. 2018 promises to be an exciting year for AMAG with many key value drivers ahead of us, including potential FDA approvals of the Makena subcutaneous auto-injector and the Feraheme broad label, as well as building on the successful launch of Intrarosa, with approximately 20,000 total prescriptions already written by more than 4,200 healthcare providers since our July 2017 launch,” Mr. Heiden concluded.\nPreliminary Fourth Quarter and Full Year 2017 Financial Results (unaudited)\nFourth Quarter 2017\nAMAG expects total GAAP revenue for the fourth quarter of 2017 to be between $155 million and $162 million, representing approximately 5% growth over the same period in 2016. This includes Makena® (hydroxyprogesterone caproate injection) net product sales of between $97 million and $102 million, Feraheme® (ferumoxytol) injection and MuGard® net product sales of between $26 million and $28 million, Intrarosa (launched in July 2017) net product sales of approximately $2 million, and Cord Blood Registry® (CBR) service revenue of approximately $30 million.\nAMAG expects total fourth quarter 2017 total non-GAAP revenue to be between $156 million and $163 million, which reflects a $1.4 million purchase accounting adjustment related to CBR deferred revenue.\nFor the fourth quarter of 2017, AMAG expects an operating loss of between $6 million and $16 million and adjusted EBITDA of between $58 million and $68 million. 1\nFull Year 2017\nAMAG expects 2017 total GAAP revenue to be between $607 million and $614 million, representing 15% growth over 2016. This includes Makena net product sales of between $385 million and $390 million, Feraheme and MuGard net product sales of between $106 million and $108 million, Intrarosa net product sales of approximately $2 million, and CBR service revenue of approximately $114 million.\nAMAG expects 2017 total non-GAAP revenue to be between $613 million and $620 million, which reflects a $5.5 million purchase accounting adjustment related to CBR deferred revenue.\nFor the full year of 2017, AMAG expects an operating loss of between $292 million and $302 million (due primarily to a third quarter non-cash accounting charge) and adjusted EBITDA of between $220 million and $230 million, 1 the higher end of the guidance range.\nIn 2017, AMAG reduced total debt by approximately 20%, extended average debt maturities, and repurchased and retired approximately 1.4 million shares in the fourth quarter at an average price of $14.27 per share.\nThe company ended 2017 with approximately $329 million in cash and investments and total debt (principal amount outstanding) of approximately $815 million. In late February 2018, the company expects to report final financial results for the fourth quarter and audited results for full year of 2017.\n2018 Financial Guidance 2\nThe company is providing the following financial guidance for 2018. This guidance encompasses management’s current assumptions about the potential impact of multiple opportunities and risks across AMAG’s product portfolio, including various potential outcomes of the pending FDA submissions for the Makena subcutaneous auto-injector and the Feraheme label expansion, as well as the entrance of generics to compete with the Makena intramuscular formulation in 2018.\n$ in millions 2018 GAAP Guidance 2018 Non-GAAP Guidance Total revenue $500 - $560 $500 - $560 Operating loss ($147) – ($117) N/A Adjusted EBITDA N/A $100 - $130 2018 Key Dates and Priorities\nFebruary 2, 2018: PDUFA date for the expansion of the Feraheme label beyond the current chronic kidney disease (CKD) indication to include all eligible adult patients with iron deficiency anemia (IDA); prepare for first quarter 2018 potential approval and subsequent launch; February 3, 2018: loss of Makena orphan drug exclusivity – While the company is currently ready with a partner to launch its own authorized generic to the intramuscular formulation (IM) as early as February, the company believes that a generic competitor may not enter the market until later in 2018; February 14, 2018: PDUFA date for Makena subcutaneous auto-injector; prepare for first quarter 2018 potential approval and subsequent launch; First quarter 2018: submit bremelanotide new drug application to FDA; Continue to broaden awareness and drive prescriptions of Intrarosa\n‒Increase formulary coverage (65% unrestricted commercial lives covered anticipated by month end);\n‒Increase the number of healthcare professional prescribers (from ~4,200 achieved in 2017);\n‒Increase the number of total prescriptions written (from ~20,000 in 2017);\n‒Increase market share (from year-end weekly NRx share of 2.6%);\n‒Launch digital-to-direct consumer campaign in first half of 2018; Expand CBR first time enrollments; and Further diversify product portfolio through disciplined business development.\n“In 2017, we delivered strong top-line and adjusted EBITDA results while investing aggressively in the products that will drive our future growth. We also improved our liability profile so that our balance sheet is better aligned with our evolving business strategy. Finally, we have managed and will continue to manage our expenses carefully to maintain operational flexibility,” said Ted Myles, AMAG’s chief financial officer. “​We are guiding to continued positive adjusted EBITDA generation​ in 2018, and with $329 million of cash on hand as of December 31, 2017, ​we are in a strong position to continue to invest in our current products, while remaining active in the search for additional asset acquisitions or licensing transactions that provide durable, long-term growth.”\nWebcast Information\nA live audio webcast of the company’s presentation and the following breakout session, along with the accompanying slide presentation at the 36 th Annu", "external_links": [], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:10:18.013+02:00", "highlightTitle": ""}