{"organizations": [], "uuid": "ab9edb6ca0570ee4bc6d02e0ce8389ea078b1d09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226506056&w=1200&r=LYNXMPEE0T08X", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-coal-exports/coal-firms-plead-to-courts-trump-for-west-coast-export-terminals-idUSKBN1FJ0KB", "country": "US", "domain_rank": 408, "title": "Coal firms plead to courts, Trump for West Coast export terminals", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T08:03:00.000+02:00", "replies_count": 0, "uuid": "ab9edb6ca0570ee4bc6d02e0ce8389ea078b1d09"}, "author": "", "url": "https://www.reuters.com/article/us-usa-coal-exports/coal-firms-plead-to-courts-trump-for-west-coast-export-terminals-idUSKBN1FJ0KB", "ord_in_thread": 0, "title": "Coal firms plead to courts, Trump for West Coast export terminals", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "hal quinn", "sentiment": "none"}, {"name": "valerie volcovici", "sentiment": "none"}], "locations": [{"name": "west coast", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump for west coast", "sentiment": "negative"}, {"name": "national mining association", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 6:09 AM / in 4 minutes Coal firms plead to courts, Trump for West Coast export terminals Valerie Volcovici 7 Min Read \nWASHINGTON (Reuters) - The ailing U.S. coal industry is ramping up its political and legal offensive to win approval for West Coast export terminals that could provide a lifeline to lucrative Asia markets. \nCoal producers filed two recent lawsuits against governments in Washington state and California challenging local decisions to block port projects on environmental grounds. The industry is also lobbying the Trump administration to override the local bans. \nThe fight reflects the sector’s desperation to boost exports as U.S. utilities continue their shift away from coal-fired power - despite Trump policies aimed at helping miners. \nThe proposed port projects are crucial to industry growth, said Hal Quinn, president of the National Mining Association. \n“It’s worth fighting these battles,” he said. \nThe strategy could be a long-shot. Courts have tended in the past to side with local authorities in similar cases, and the administration’s policy options for forcing coal infrastructure on unwilling local governments remain unclear. \nOfficials at the White House and Department of Energy did not respond to requests for comment. \nThe coal industry has eyed the West Coast as a gateway to the global market for years, with plans for as many as seven terminals on the books a decade ago. But five of those projects were canceled amid volatile Asian demand and bitter opposition in left-leaning California, Washington, and Oregon. 45 NEW COAL PLANTS \nCoal producers are fighting for the remaining two proposed projects – in Oakland, California and Longview, Washington - and have filed two recent lawsuits, including one this month, amid rising coal demand in Japan, China and Korea. \n“There are 45 new coal plants planned or under construction in Japan alone,” said Rick Curtsinger, a spokesman for Gillette, Wyoming-based Cloud Peak, which mines in Montana and Wyoming. \n(For a graphic showing U.S. coal exports to North Asia, see: tmsnrt.rs/2E3LZuJ ) \nEarlier this month, the company announced a deal to export coal from a Montana mine to two new coal gasification power plants in Fukushima, Japan, site of the 2011 nuclear accident. \nBut growth from such deals is constrained because the only West Coast coal export facility in North America - in British Columbia, Canada - is near full capacity. \nCoal buyers in Japan and South Korea confirmed they would welcome more U.S. shipments. Japan’s JERA utility sees the U.S. as a key to diversifying its fuel sources, said spokesman Tsuyoshi Shiraishi. \nAn official with a South Korean power utility, who spoke on condition of anonymity, said: “The popularity of U.S. coal is rising among utilities in South Korea” because of relatively low prices. \nEven with the bottlenecks, coal exports rose more than 60 percent in the first five months of 2017, driven by temporary supply disruptions from Australia and depressed prices for U.S. coal. \nShipments to Europe rose about a third, to 16 million tons, compared to the same period in 2016, according to U.S. Department of Energy data. Exports to Asia doubled, to 12.3 million tons, over the same period. Bulk carriers are filled with coal for export at Roberts Bank Superport in Delta, British Columbia, Canada January 15, 2018. REUTERS/Ben Nelms COURT BATTLE \nThis month in Oakland, attorneys for coal export terminal developer Phil Tagami and leading Utah coal producer Bowie Resources kicked off hearings in federal court over their proposed project. They argued the city council had used flawed scientific data to justify its unanimous 2016 decision to ban coal exports from the city. \nThat study concluded that dust emissions from coal transport would threaten local health. The U.S. Centers for Disease Control says excessive exposure to coal dust can cause black lung and other respiratory problems. \nThe coal industry’s lawyers countered that the study examined the wrong kind of coal and ignored state-of-the-art anti-dust technologies. \nThe city has so far spent more than a million dollars in legal fees to keep Utah coal out of Oakland ports, said Oakland Council Member Dan Kalb. \n“I am saddened they are continuing to fight,” he said. Slideshow (4 Images) \nA decision in the suit could come within weeks. \nMeanwhile, Lighthouse Resources, the developer of the proposed Millennium coal export terminal in Washington state, filed another federal lawsuit earlier this month against the governor and state regulators. \nWashington had denied a permit for the project last year citing worries about rail safety, air pollution and noise pollution. \nThe company argues the state is obstructing the commerce of other states where the coal is mined and that only the federal government can regulate such interstate commerce. \nMichael Greve, a law professor at George Mason University, said the plaintiffs would have to prove that Washington is favoring its own economic interests over those of other states - a tough standard to meet, particularly in a case involving an environmental ban. \nIn 2011, a Colorado court rejected a similar legal argument made by the Energy and Environment Legal Institute, which advocates for fossil fuels. The institute had challenged a state law requiring investor-owned utilities to obtain 30 percent of their generation from renewable sources. \nThe coal industry, meanwhile, is pushing the White House and Congress for policy solutions – potentially through an infrastructure spending package – to make it easier to open export terminals over local objections, said Quinn, of the National Mining Association. \nOthers want the administration to weigh in on the interstate commerce argument. \n“The administration can have some influence if the opposition drifts into an area where it is treading on federal authority,” said Bud Clinch, director of the Montana Coal Council. \nLast fall, Energy Department Deputy Secretary Dan Brouillette floated the idea of using the U.S. Federal Power Act to supersede state efforts to block gas pipelines. \n“We can’t stop a state legislature and a governor from doing what they think is in their self-interest,” he said during an event at the National Petroleum Council. “But these are interstate industries.” \n(This version of the story was corrected to change location of Cloud Peak headquarters in paragraph 10 from Colorado to Gillette, Wyoming) Additional reporting by Henning Gloystein in Singapore, Yuka Obayashi in Tokyo, and Yuna Park in Seoul; Editing by Richard Valdmanis and Brian Thevenot", "external_links": [], "published": "2018-01-30T08:03:00.000+02:00", "crawled": "2018-01-30T08:11:52.010+02:00", "highlightTitle": ""}