{"organizations": [], "uuid": "8af9a3d6f977fa295929e8a051c79b9722b810ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-macquarie-capital-appoints-michael-huerta-as-senior-advisor.html", "country": "US", "domain_rank": 767, "title": "Macquarie Capital Appoints Michael Huerta as Senior Advisor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:30:00.000+02:00", "replies_count": 0, "uuid": "8af9a3d6f977fa295929e8a051c79b9722b810ec"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-macquarie-capital-appoints-michael-huerta-as-senior-advisor.html", "ord_in_thread": 0, "title": "Macquarie Capital Appoints Michael Huerta as Senior Advisor", "locations": [], "entities": {"persons": [{"name": "michael huerta", "sentiment": "negative"}, {"name": "huerta", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "federal aviation administration", "sentiment": "negative"}, {"name": "macquarie capital", "sentiment": "negative"}, {"name": "macquarie", "sentiment": "none"}, {"name": "macquarie group", "sentiment": "none"}, {"name": "faa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former Administrator of the Federal Aviation Administration joins as Senior Advisor High-level appointment brings deep operational experience and relationships across transportation, aviation and airports industries Macquarie Capital is the top-ranked transportation advisor in North America and infrastructure financial advisor globally 1\nNEW YORK--(BUSINESS WIRE)-- Macquarie Group (Macquarie) today announced the appointment of Michael Huerta as a Senior Advisor. In his new role, Mr. Huerta will support Macquarie Capital, the corporate advisory, capital markets and principal investment arm of Macquarie Group, and provide insight to the firm and its client and partners to build on existing initiatives and seek new opportunities in US transportation infrastructure.\nMr. Huerta recently completed a five-year term as Administrator of the Federal Aviation Administration (FAA). As head of the FAA, he was responsible for the safety and efficiency of civil aviation in the US. Before being named as Administrator, he served as FAA Deputy Administrator. Throughout his career, he has held key transportation-industry roles in both the public and private sectors. Before joining the FAA, he was President of the Transportation Solutions Group at Affiliated Computer Services (now Conduent), and prior to that, held senior positions in the US Department of Transportation in Washington, DC. He served as the Executive Director of the Port of San Francisco from 1989 to 1993, and was commissioner of New York City's Department of Ports, International Trade and Commerce from 1986 to 1989.\n\"Michael has an exceptional reputation as a federal administrator in US transportation. His deep industry experience, relationships and insights will greatly benefit our clients and partners as we pursue initiatives in US airport and other transportation infrastructure,” said Nick Butcher, Global Co-Head of the Infrastructure and Energy Group in Macquarie Capital.\nMacquarie’s North American infrastructure group has a history of success advising and investing in infrastructure development, and has advised on more than $21 billion in transactions in the transportation sector over the past seven years. Highlights include Denver Fastracks, Midtown Tunnel, and Goethal’s Bridge Replacement Project – the Port Authority of New York New Jersey’s first new bridge in more than 80 years – as a developer and advisor, and other landmark infrastructure projects in the US.\n1. By deal value and deal count; Source: InfraDeals CY16.\nAbout Macquarie Group\nMacquarie Group (Macquarie) is a global provider of banking, financial, advisory, investment and funds management services. Founded in 1969, Macquarie employs more than 13,900 people in over 27 countries. At 30 September 2017, Macquarie had assets under management of $371.3 billion. For more information, visit www.macquarie.com\nAbout Macquarie Capital\nMacquarie Capital is the advisory, capital markets and principal investment arm of Macquarie Group. Macquarie Capital provides strategic M&A and capital raising advice as well as partnering with clients by investing capital into their projects and companies. Globally Macquarie Capital focuses on six core sectors: infrastructure, utilities and renewables; real estate; telecommunications, media, entertainment and technology; resources; industrials; and financial institutions, with 152 transactions completed, valued at $56 billion in the year to 30 September 2017.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005259/en/\nMacquarie Group Corporate Communications\nStephen Yan, +1 212-231-1277\nstephen.yan@macquarie.com\nSource: Macquarie Group", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.macquarie.com&esheet=51744264&newsitemid=20180117005259&lan=en-US&anchor=www.macquarie.com&index=1&md5=1c5775c621328456a4cf2d94888dfdb8", "http://www.businesswire.com/news/home/20180117005259/en/"], "published": "2018-01-17T16:30:00.000+02:00", "crawled": "2018-01-17T16:36:35.092+02:00", "highlightTitle": ""}