{"organizations": [], "uuid": "dba7cb7d50a0caedf16517b51487f7a9b13015e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223013849&w=1200&r=LYNXMPEE0H0WU", "site_section": "http://feeds.reuters.com/reuters/INentertainmentNews", "section_title": "Reuters: Entertainment News", "url": "https://in.reuters.com/article/tennis-ausopen-china/australia-steps-up-efforts-to-woo-chinese-tennis-tourists-idINKBN1F71HZ", "country": "US", "domain_rank": 408, "title": "Australia steps up efforts to woo Chinese tennis tourists", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:03:00.000+02:00", "replies_count": 0, "uuid": "dba7cb7d50a0caedf16517b51487f7a9b13015e1"}, "author": "", "url": "https://in.reuters.com/article/tennis-ausopen-china/australia-steps-up-efforts-to-woo-chinese-tennis-tourists-idINKBN1F71HZ", "ord_in_thread": 0, "title": "Australia steps up efforts to woo Chinese tennis tourists", "locations": [], "entities": {"persons": [{"name": "weibo", "sentiment": "none"}, {"name": "leo seaton", "sentiment": "none"}, {"name": "ganten", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:06 PM / Updated an hour ago Australia steps up efforts to woo Chinese tennis tourists Reuters Staff 3 Min Read \nMELBOURNE (Reuters) - The Australian Open has stepped up efforts to lure Chinese tennis fans to Melbourne Park by boosting broadcast and sponsorship deals. \nMore than 59 million people in China tuned into watch the Australian Open in 2017, up by more than 84 percent on the year before and organisers are banking on numbers rising again. \nThe Asia-Pacific grand slam has expanded a long term relationship with Chinese digital broadcaster iQIYI to 2021, and launched a five year deal with premium mineral water supplier Ganten from this year. It has four Chinese broadcasters as partners and a year round social media team on Wechat and Weibo. \nAustralia is hoping the country’s premier tennis event will turn viewers into visitors from what is soon to be its biggest tourism market. \n“Events like the Australian Open... play a particularly important role in encouraging repeat visits,” said Leo Seaton, General Manager of media at Tourism Australia. \n“(They) also provide a great platform to showcase Australia internationally through the huge TV audience and the destination content that is woven into these broadcasts,” he told Reuters. \nAs part of its plan to attract more visitors, organisers have tied up with online China travel agent Ctrip. Organisers attribute a similar deal in Japan, which allowed fans to book online in their own language, as helping to double Japanese visitors last year. \nChina has said that its sports industry should contribute 5 percent of gross domestic product by 2025, a fact not lost on organisers who plan to launch the first AO Academy in China this year, as well as a ‘Tennis for Schools’ program in Chengdu. \nIt’s part of a broader move by the sport into the mainland. China’s southern metropolis of Shenzhen was announced as the new venue for the season-ending WTA Finals from 2019 to 2028 on Thursday. \n“Clearly the China Open does very well. The Wuhan event grew this year. Tianjin had some sell-out crowds. There is growth. There is still a lot of work that has to be done. We are very excited about the opportunity that Shenzhen brings,” Steve Simon, WTA chairman and CEO said in Melbourne. \nShenzhen, which already hosts a WTA tournament in early January, will take over from Singapore on the back of a bid which promised to build a new 12,000-seat downtown venue and double the prize money to $14 million. \nOrganisers are hoping to ride the groundswell of competition at a local level to build on the sport’s broader appeal. \nAustralian Open first timers Cherry Leong, 40, and husband Terrence Leong, 54, waving a red Chinese flag courtside, were not too disappointed after China’s top player Zhang Shuai crashed out of the tournament despite travelling from Hong Kong. They were looking forward to watching other matches. \n“It’s a shame that she lost. But we are looking forward to seeing (Australian 17th seed) Nick Kyrgios - he’s always dramatic,” Terrence Leong said. Reporting by Melanie Burton, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-18T14:03:00.000+02:00", "crawled": "2018-01-18T14:25:21.003+02:00", "highlightTitle": ""}