{"organizations": [], "uuid": "8828a11afc58cd3abff269bc4e5760653545ed90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-teresa-m-nilsen-appointed-president-of-hennessy-advisors-inc.html", "country": "US", "domain_rank": 767, "title": "Teresa M. Nilsen Appointed President of Hennessy Advisors, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:00:00.000+02:00", "replies_count": 0, "uuid": "8828a11afc58cd3abff269bc4e5760653545ed90"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-teresa-m-nilsen-appointed-president-of-hennessy-advisors-inc.html", "ord_in_thread": 0, "title": "Teresa M. Nilsen Appointed President of Hennessy Advisors, Inc.", "locations": [], "entities": {"persons": [{"name": "teresa m. nilsen", "sentiment": "negative"}, {"name": "terry", "sentiment": "none"}, {"name": "neil j. hennessy", "sentiment": "none"}, {"name": "hennessy", "sentiment": "none"}, {"name": "nilsen", "sentiment": "none"}, {"name": "terry nilsen", "sentiment": "none"}], "locations": [{"name": "novato", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "hennessy advisors, inc", "sentiment": "neutral"}, {"name": "hennessy advisors, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NOVATO, Calif., Jan. 26, 2018 /PRNewswire/ -- Hennessy Advisors, Inc. (NASDAQ: HNNA) (the \"Company\") is pleased to announce the promotion of Teresa M. Nilsen to President.\nMs. Nilsen has served as an Executive Vice President, Chief Financial Officer, Secretary, and Director of the Company since 1989. Alongside founder Neil J. Hennessy, she has helped to build Hennessy from its inception. In addition to her new role as President, Ms. Nilsen will continue to serve as Hennessy Advisors' Chief Operating Officer and Secretary. Mr. Hennessy will remain the Company's Chairman of the Board and Chief Executive Officer, leading the business strategy, strategic affairs, and corporate policy for the firm.\n\"Terry Nilsen has been instrumental to the Company's success over the past 28 years,\" said Mr. Hennessy. \"While I will continue in an active role in the Company, I am excited to welcome Terry as our new leader. I am confident in her abilities, and I have witnessed firsthand her commitment, focus, and integrity. She is both talented and thoughtful,\" he commented.\n\"I'm excited and humbled to be appointed President of Hennessy Advisors. I plan to follow the solid example set by Neil Hennessy by continuing to have the best team and partners, and by always putting our shareholders first,\" said Ms. Nilsen. \"I am truly honored to work alongside such a talented group of people. It is an exciting time at our firm, with many opportunities ahead, and I look forward to further contributing to the company's progress,\" she added.\nIn connection with Ms. Nilsen's promotion to President, Kathryn R. Fahy has been promoted to serve as the Company's Chief Financial Officer with a Senior Vice President title. Ms. Fahy has been employed by the Company since 2006, most recently serving as its Director of Finance and Controller. Before joining the Company, Ms. Fahy worked as a public accountant for Deloitte & Touche LLP and as a Senior Internal Auditor for Knight Ridder, Inc. She is also a certified public accountant.\n\"I'm thrilled to be given this opportunity, and I'm eager to take on a broader role at Hennessy Advisors, a company backed by an incredible team of professionals,\" said Ms. Fahy.\nThe Company also appointed Brian Carlson as the Company's Chief Compliance Officer with a Senior Vice President title. Mr. Carlson will continue to serve as the Company's Head of Distribution, a position he has held since 2013.\nAbout Hennessy Advisors, Inc.\nHennessy Advisors, Inc. is a publicly traded investment manager offering a broad range of domestic equity, multi-asset, and sector and specialty mutual funds. Hennessy Advisors, Inc. is committed to its consistent and repeatable investment process, combining time-tested stock selection strategies with a highly disciplined, team-managed approach, and to superior service to shareholders.\nAdditional Information\nNothing in this press release shall be considered a solicitation to buy or an offer to sell a security to any person in any jurisdiction where such offer, solicitation, purchase, or sale would be unlawful under the securities laws of such jurisdiction.\nView original content: http://www.prnewswire.com/news-releases/teresa-m-nilsen-appointed-president-of-hennessy-advisors-inc-300588673.html\nSOURCE Hennessy Advisors, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/teresa-m-nilsen-appointed-president-of-hennessy-advisors-inc-300588673.html"], "published": "2018-01-26T17:00:00.000+02:00", "crawled": "2018-01-26T18:15:34.007+02:00", "highlightTitle": ""}