{"organizations": [], "uuid": "04e81ef7f2bf90b76602312b09b636c25930e069", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-pre-market-technical-scan-on-auto-parts-equities--gentex-lkq-corp-westport-fuel-systems-and-allison-transmission.html", "country": "US", "domain_rank": 767, "title": "Pre-Market Technical Scan on Auto Parts Equities -- Gentex, LKQ Corp., Westport Fuel Systems, and Allison Transmission", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.64, "site_type": "news", "published": "2018-01-30T14:50:00.000+02:00", "replies_count": 0, "uuid": "04e81ef7f2bf90b76602312b09b636c25930e069"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-pre-market-technical-scan-on-auto-parts-equities--gentex-lkq-corp-westport-fuel-systems-and-allison-transmission.html", "ord_in_thread": 0, "title": "Pre-Market Technical Scan on Auto Parts Equities -- Gentex, LKQ Corp., Westport Fuel Systems, and Allison Transmission", "locations": [], "entities": {"persons": [{"name": "allison transmission", "sentiment": "neutral"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "zeeland", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "westport fuel systems", "sentiment": "neutral"}, {"name": "gentex", "sentiment": "neutral"}, {"name": "lkq corp.", "sentiment": "neutral"}, {"name": "wallstequities.com", "sentiment": "none"}, {"name": "westport fuel systems inc.", "sentiment": "none"}, {"name": "gentex corp.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "allison transmission holdings inc.", "sentiment": "none"}, {"name": "automobile manufacturing", "sentiment": "none"}, {"name": "equipment manufacturing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 30, 2018 /PRNewswire/ -- WallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on GNTX, LKQ, WPRT, and ALSN which can be accessed for free by signing up to www.wallstequities.com/registration . WallStEquities.com has initiated research coverage on Gentex Corp. (NASDAQ: GNTX), LKQ Corp. (NASDAQ: LKQ), Westport Fuel Systems Inc. (NASDAQ: WPRT), and Allison Transmission Holdings Inc. (NYSE: ALSN). The Auto Parts and Equipment Manufacturing industry has companies that produce vehicle parts and accessories that are used in assembling cars, SUVs, light off-road utility vehicles, and trucks for the Automobile Manufacturing industry. All you have to do is sign up today for this free limited time offer by clicking the link below. www.wallstequities.com/registration\nGentex\nOn Monday, shares in Zeeland, Michigan headquartered Gentex Corp. recorded a trading volume of 3.83 million shares, which was above their three months average volume of 2.01 million shares. The stock ended the session 1.43% lower at $23.45. The Company's shares have gained 11.67% in the last month, 21.88% over the previous three months, and 10.46% over the past year. The stock is trading 11.99% above its 50-day moving average and 20.66% above its 200-day moving average. Moreover, shares of Gentex have a Relative Strength Index (RSI) of 68.23.\nOn January 23 rd , 2018, Gentex was announced as the presenting sponsor of the Michigan International Auto Show, which runs from February 01 st , 2018, to February 04 th , 2018 at DeVos Place in downtown Grand Rapids. The show, annually hosted by the Grand Rapids New Car Dealers Association (GRNCDA) and produced by ShowSpan Inc., is currently celebrating its 20 th anniversary.\nOn January 29 th , 2018, research firm B. Riley FBR, Inc. reiterated its 'Buy' rating on the Company's stock with an increase of the target price from $25 a share to $29 a share. Get the full research report on GNTX for free by clicking below at: www.wallstequities.com/registration/?symbol=GNTX\nLKQ Corp.\nChicago, Illinois headquartered LKQ Corp.'s stock closed the day 0.28% lower at $42.71 with a total trading volume of 1.30 million shares. The Company's shares have advanced 4.50% in the past month, 15.12% in the previous three months, and 35.72% over the past year. The stock is trading 5.31% and 20.76% above its 50-day and 200-day moving averages, respectively. Additionally, shares of LKQ Corp. have an RSI of 59.96.\nOn January 25 th , 2018, LKQ Corp. announced that it will release Q4 and full-year 2017 financial results before the market opens on February 22 nd , 2018. The Company will host a conference call and webcast at 10:00 a.m. ET that same day to discuss these results. The audio webcast of the call and accompanying slide presentation can be accessed under the Investor Relations section of the Company's website. Free research on LKQ can be accessed at: www.wallstequities.com/registration/?symbol=LKQ\nWestport Fuel Systems\nShares in Vancouver, Canada headquartered Westport Fuel Systems Inc. recorded a trading volume of 459,268 shares. The stock ended yesterday's trading session 1.89% lower at $3.12. The Company's shares have surged 136.36% over the past year. The stock is trading above its 200-day moving average by 24.31%. Furthermore, shares of the Company have an RSI of 38.92.\nOn January 02 nd , 2018, Westport Fuel Systems announced that it has entered into a development and supply agreement with Tata Motors Limited for its 4 cylinder and 6 cylinder natural gas spark-ignited commercial vehicle engine family to meet the Indian Government's new Bharat Stage VI emission standards, scheduled to take effect in April of 2020. Visit WallStEquities.com now and sign up for the free research on WPRT at: www.wallstequities.com/registration/?symbol=WPRT\nAllison Transmission Holdings\nIndianapolis, Indiana headquartered Allison Transmission Holdings Inc.'s stock finished Monday's session 0.46% lower at $45.12 with a total trading volume of 854,663 shares. The Company's shares have advanced 3.82% in the last month, 10.13% over the previous three months, and 27.71% over the past year. The stock is trading above its 50-day and 200-day moving averages by 6.06% and 16.19%, respectively. Additionally, shares of the Company have an RSI of 62.02.\nOn January 25 th , 2018, Allison Transmission announced that it will hold its Q4 and full-year 2017 financial results conference call on February 15 th , 2018, at 8:00 a.m. EST. Chairman and CEO Lawrence E. Dewey and President and CFO David S. Graziosi will review the Company's financial performance for the period. The news release announcing the financial results will be issued post market on February 14 th , 2018. The free technical report on ALSN is available at: www.wallstequities.com/registration/?symbol=ALSN\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither WSE nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit https://wallstequities.com/legal-disclaimer/\nCONTACT\nFor any questions, inquiries, or comments reach out to us directly. If you're a company, we are covering and wish to no longer feature on our coverage list contact us via email and/or phone between 09:30 EDT to 16:00 EDT from Monday to Friday at:\nEmail: info@wallstequities.com\nPhone number: +21-32-044-483\nOffice Address: 1 Scotts Road #24-10, Shaw Center Singapore 228\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\nView original content: http://www.prnewswire.com/news-releases/pre-market-technical-scan-on-auto-parts-equities----gentex-lkq-corp-westport-fuel-systems-and-allison-transmission-300590097.html\nSOURCE Wall St. Equities", "external_links": ["http://www.wallstequities.com/registration/?symbol=GNTX", "https://wallstequities.com/legal-disclaimer/", "http://www.prnewswire.com/news-releases/pre-market-technical-scan-on-auto-parts-equities----gentex-lkq-corp-westport-fuel-systems-and-allison-transmission-300590097.html", "http://www.wallstequities.com/registration/?symbol=ALSN", "http://www.wallstequities.com/registration/?symbol=WPRT", "http://www.wallstequities.com/registration", "http://www.wallstequities.com/registration/?symbol=LKQ"], "published": "2018-01-30T14:50:00.000+02:00", "crawled": "2018-01-30T15:37:50.018+02:00", "highlightTitle": ""}