{"organizations": [], "uuid": "279ab6fd3bf54c511cdb4da760b2baf8a0e75437", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-berger-montague-p-c-names-sherrie-r-savett-the-firms-first-chairwoman-promotes-two-attorneys-to-shareholder.html", "country": "US", "domain_rank": 767, "title": "Berger & Montague, P.C. Names Sherrie R. Savett the Firm's First Chairwoman, Promotes Two Attorneys to Shareholder", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.276, "site_type": "news", "published": "2018-01-03T20:54:00.000+02:00", "replies_count": 0, "uuid": "279ab6fd3bf54c511cdb4da760b2baf8a0e75437"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-berger-montague-p-c-names-sherrie-r-savett-the-firms-first-chairwoman-promotes-two-attorneys-to-shareholder.html", "ord_in_thread": 0, "title": "Berger & Montague, P.C. Names Sherrie R. Savett the Firm's First Chairwoman, Promotes Two Attorneys to Shareholder", "locations": [], "entities": {"persons": [{"name": "sherrie r. savett", "sentiment": "negative"}, {"name": "h. laddie montague", "sentiment": "none"}, {"name": "davidoff", "sentiment": "none"}, {"name": "caitlin g. coslett", "sentiment": "none"}, {"name": "jr.", "sentiment": "none"}, {"name": "merrill g. davidoff", "sentiment": "none"}, {"name": "ellen t. noteware", "sentiment": "none"}, {"name": "savett", "sentiment": "none"}, {"name": "sherrie", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}, {"name": "p.c.", "sentiment": "none"}], "organizations": [{"name": "berger & montague", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Jan. 3, 2018 /PRNewswire/ -- Berger & Montague, P.C. has selected Sherrie R. Savett to serve as Chairwoman of the firm in 2018. Ms. Savett is the first woman to hold the chair position in Berger & Montague's 48-year history. The firm also promoted two attorneys, Ellen T. Noteware and Caitlin G. Coslett, to shareholder status.\nMs. Savett assumed responsibility as chair on January 1, 2018, succeeding Merrill G. Davidoff. Mr. Davidoff will continue his work as Chairman Emeritus and as a managing shareholder, in addition to his positions as co-chair of the firm's antitrust, commodities and financial instruments, environment & public health, and securities and investor protection practice areas.\nMr. Davidoff was named firm chair at the end of 2016 and was preceded by H. Laddie Montague, Jr., who served as chairman from 2002 – 2016 and now continues his work as Chairman Emeritus, a managing shareholder, and co-chair of the firm's antitrust practice group. \"Aside from being an outstanding litigator and community leader, Sherrie has been an integral participant in building our firm to where it is today,\" said Mr. Montague. \"We are proud to have her serve as our next chairperson.\"\nIn addition to promoting Ms. Savett, Berger & Montague also named Ellen T. Noteware and Caitlin G. Coslett firm shareholders. Since joining the firm, Ms. Noteware has successfully prosecuted a wide range of complex and class action cases, including serving on the trial team in the landmark Cook v. Rockwell International Corp. environmental class action, which recently settled for $375 million. Ms. Noteware concentrates her practice on prosecuting antitrust class actions on behalf of direct purchasers of brand name drugs who are harmed when brand companies block cheaper generic competitors from entering the market. She is also extensively involved in litigating Employee Retirement Income Securities Act (\"ERISA\") breach of fiduciary duty class action cases on behalf of retirement plan participants who are charged unreasonably high fees for services.\nCaitlin G. Coslett concentrates her practice on complex litigation, including antitrust, environmental, and mass tort litigation. She has worked on a variety of matters, including Cook v. Rockwell International Corp., a landmark environmental class action, and antitrust class actions such as In re CRT Antitrust Litigation, In re Domestic Drywall Antitrust Litigation, Steel Antitrust Litigation, and In re Urethane Antitrust Litigation. Ms. Coslett also represents classes of direct purchasers of pharmaceutical drugs who allege that pharmaceutical manufacturers have violated the federal antitrust laws by wrongfully keeping less expensive generic drugs off the market, including In re Lidoderm Antitrust Litigation, In re Skelaxin (Metaxalone) Antitrust Litigation, and In re Solodyn (Minocycline Hydrochloride) Antitrust Litigation.\nBefore becoming the firm's Chair, Ms. Savett had long held leadership roles at the firm. She has served on Berger & Montague's Executive Committee for decades and has for many years co-chaired the firm's commercial litigation, securities and investor protection, data breach, and False Claims Act practice groups.\nMs. Savett began at the firm in 1975, five years after it was founded. During the first two decades of her practice, she focused almost exclusively on securities litigation. At one time, she led and settled eight of the largest 100 securities class action cases ever settled in the United States. Among her most prominent cases are In re Rite Aid Corp. Securities Litigation ($334 million settlement); In re Waste Management, Inc. Securities Litigation ($220 million settlement); Cigna Securities Litigation ($93 million settlement); In re Fleming Companies Inc. Securities Litigation ($94 million settlement); Alcatel Securities Litigation ($75 million settlement); and Sotheby's Securities Litigation ($70 million).\n\"This work is always fascinating because every case involves learning the industry and the business of the defendants inside and out,\" said Ms. Savett. \"That allows you to be successful in understanding where their practices went awry and how they committed various violations of law.\"\nIt was through her work on a securities fraud case in the 1990's against a company called Cascade Industries that Ms. Savett first became involved in False Claims Act litigation. During this case, Ms. Savett obtained a pre-judgment freeze on the assets of Cascade Industries' CEO before he was able to flee the country. This impressed her local counsel, a former U.S. attorney for the Southern District of Florida, who invited her to join his team on the False Claims Act case entitled United States ex rel. Ven-A-Care of the Florida Keys, Inc. v. Apothecon, Inc. This was part of a series of cases against various large drug manufacturers that involved a pricing scheme that defrauded Medicare and Medicaid. The cases were collectively settled for more than $2 billion. Ms. Savett and her group were a critical part of the litigation team that prosecuted those cases for more than a decade.\n\"I learned so much about the False Claims Act during the years that I worked on the Ven-A-Care case. Now qui tam litigation has become a principal part of my practice,\" said Ms. Savett. \"It's a very productive and burgeoning practice in our firm now. It is exciting to uncover through our brave, highly intelligent, and honest whistleblower clients complex frauds against the United States and various states and to recover funds to the government.\"\nIn addition to her work on securities and False Claims Act litigation, Ms. Savett also served as co-lead counsel in the first major data breach case, TJX Companies Retail Security Breach Litigation. Data was stolen from TJX's computer network, affecting 45 million consumers. The stolen personal information included social security and drivers' license numbers, and credit and debit card numbers.\n\"We settled that case by giving those whose social security numbers were stolen through the data breach two extra years of credit monitoring insurance,\" said Ms. Savett. \"We also created cash funds for people who had actual out-of-pocket damages and established the principle that time expended in trying to mitigate and clean up a potential or actual identity theft or theft of credit card information could be compensated. Those elements became the template for most subsequent data breach settlements.\"\nPrior to joining Berger & Montague, Ms. Savett graduated from the University of Pennsylvania in 1970 - summa cum laude with Distinction in English Literature - and Penn Law School in 1973. Her interest in the law began at a young age and stemmed from her father, who owned a food market in North Philadelphia and attended Temple University's law school at night.\n\"I was 10 years old on the day of my father's first law school exam at Temple University. My sister was born that night,\" said Ms. Savett. \"I had to babysit for my two brothers, and I put my mother in a taxi to go to the hospital. I wanted to be just like my f", "external_links": ["http://www.prnewswire.com/news-releases/berger--montague-pc-names-sherrie-r-savett-the-firms-first-chairwoman-promotes-two-attorneys-to-shareholder-300577117.html"], "published": "2018-01-03T20:54:00.000+02:00", "crawled": "2018-01-03T22:58:55.015+02:00", "highlightTitle": ""}