{"organizations": [], "uuid": "14aadec923c29332c25c34e1b0b791f9a2fe1488", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/ge-flannery.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/ge-shares-billion-charge-capital-insurance-finance-flannery/", "country": "US", "domain_rank": 1196, "title": "GE Shares Dive on $6.2 Billion Charge in Its Finance Unit | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-01-16T10:33:00.000+02:00", "replies_count": 0, "uuid": "14aadec923c29332c25c34e1b0b791f9a2fe1488"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/16/ge-shares-billion-charge-capital-insurance-finance-flannery/", "ord_in_thread": 0, "title": "GE Shares Dive on $6.2 Billion Charge in Its Finance Unit | Fortune", "locations": [], "entities": {"persons": [{"name": "john flannery", "sentiment": "none"}, {"name": "jeffrey immelt", "sentiment": "none"}, {"name": "flannery", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ge", "sentiment": "negative"}, {"name": "bloomberg 8:33 am est  general electric", "sentiment": "neutral"}, {"name": "north american life & health", "sentiment": "none"}, {"name": "ge capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 8:33 AM EST \nGeneral Electric will take a $6.2 billion charge for the fourth quarter as the manufacturing behemoth grapples with lingering problems in a legacy insurance business. \nThe after-tax charge will be $7.5 billion when adjusted to the rate following the recent U.S. tax overhaul, GE (ge) said Tuesday in a statement. The finance unit, GE Capital, will make statutory reserve contributions of about $15 billion over seven years following a lengthy review of the North American Life & Health long-term care portfolio. \n“At a time when we are moving forward as a company, a charge of this magnitude from a legacy insurance portfolio in run-off for more than a decade is deeply disappointing,” Chief Executive Officer John Flannery said in the statement. \nThe move underscores the severity of the challenges facing GE, which was the worst performer by far in the Dow Jones Industrial Average last year. Flannery, who took over for Jeffrey Immelt in August , is cutting costs and selling assets as the beleaguered company tries to overcome weak demand for its power-generation and oilfield equipment. \nGE fell 4.3% to $17.96 ahead of regular trading in New York. The dip threatened to undermine a modest rebound in early 2018 after GE had gained 7.5% this year through Friday. Portfolio Review \nInvestors have been bracing since GE in October said it would halt dividends from GE Capital to the parent company while it assessed the long-term care portfolio. At a shareholder meeting in November, Chief Financial Officer Jamie Miller said the company was likely to take a charge in excess of $3 billion, which is the amount GE Capital would have paid in a second-half dividend. \nLong-term care insurance has become a headache for many of the companies active in that market in recent decades. \nThe policies, which emerged in their modern form in the 1980s, cover health-related costs not paid by Medicare or standard health insurance, such as nursing homes or assisted living facilities. But incorrect assumptions undermined the market, from how long people would live to how much care would cost. Low interest rates also hurt insurers’ ability to offset certain costs. \nGE said Tuesday that the GE Capital dividend would remain suspended for the “foreseeable future.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-16T10:33:00.000+02:00", "crawled": "2018-01-16T16:10:34.023+02:00", "highlightTitle": ""}