{"organizations": [], "uuid": "1058e24b719b4aef0ba49cd28b0a32be2428611c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-american-river-bankshares-announces-a-5-percent-stock-repurchase-program-for-2018.html", "country": "US", "domain_rank": 767, "title": "American River Bankshares Announces a 5% Stock Repurchase Program for 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:30:00.000+02:00", "replies_count": 0, "uuid": "1058e24b719b4aef0ba49cd28b0a32be2428611c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-american-river-bankshares-announces-a-5-percent-stock-repurchase-program-for-2018.html", "ord_in_thread": 0, "title": "American River Bankshares Announces a 5% Stock Repurchase Program for 2018", "locations": [], "entities": {"persons": [{"name": "david e. ritchie", "sentiment": "none"}], "locations": [{"name": "sacramento", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "american river bankshares", "sentiment": "negative"}, {"name": "stock repurchase program", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "american river bankshares board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SACRAMENTO, Calif., Jan. 25, 2018 (GLOBE NEWSWIRE) -- American River Bankshares (NASDAQ-GS:AMRB) today announced that the Board of Directors has approved and authorized a new Stock Repurchase Program for 2018 (the “2018 Program”). The 2018 Program authorizes the repurchase during 2018 of up to 5% of the outstanding shares of the Company’s common stock, or approximately 306,618 shares based on the 6,132,362 shares outstanding as of December 31, 2017.\nThe Company previously authorized two stock repurchase programs in 2017 and repurchased approximately 9% of the outstanding shares of common stock, which followed stock repurchase programs in 2012, 2013, 2014, 2015 and 2016.\n“After a thorough review of our capital position, the American River Bankshares Board of Directors again authorized the Repurchase Program,” said David E. Ritchie, Jr., President and CEO of American River Bankshares. “We believe this is a sound use of our capital on the path of continued growth for the Company.”\nRepurchases under the 2018 Program will commence sometime after the release of the Company’s results of operations for the period ended December 31, 2017. The fourth quarter financial results conference call will be held Thursday, January 25, 2018 at 1:30 p.m. Pacific Time. David E. Ritchie, Jr., President and Chief Executive Officer, and Mitchell A. Derenzo, Executive Vice President and Chief Financial Officer, both of American River Bankshares, will lead a live presentation and answer analysts’ questions. Shareholders, analysts and other interested parties are invited to join the call by dialing (888) 517-2513 and entering the Conference ID 5899 805#.\nThe repurchases will be made from time to time by the Company in the open market as conditions allow. All such transactions will be structured to comply with Securities and Exchange Commission Rule 10b-18 and all shares repurchased under the 2018 Program will be retired. The number, price and timing of the repurchases will be at the Company’s sole discretion and the 2018 Program may be re-evaluated depending on market conditions, capital and liquidity needs or other factors. Based on such re-evaluation, the Board of Directors may suspend, terminate, modify or cancel the 2018 Program at any time and for any reason.\nAbout American River Bankshares\nAmerican River Bankshares (NASDAQ-GS:AMRB) is the parent company of American River Bank, a regional bank serving Northern California since 1983. We give business owners more REACH by offering financial expertise and exceptional service to complement a full suite of banking products and services. Our honest approach, commitment to community and focus on profitability is intended to lead our clients to greater success. For more information, call (800) 544-0545 or visit AmericanRiverBank.com .\nForward-Looking Statements\nCertain statements contained herein are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 and subject to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 that involve risks and uncertainties. Actual results may differ materially from the results in these forward-looking statements. Factors that might cause such a difference include, among other matters, changes in interest rates, economic conditions, governmental regulation and legislation, credit quality, and competition affecting the Company’s businesses generally; the risk of natural disasters and future catastrophic events including terrorist related incidents; and other factors discussed in the Company’s Annual Report on Form 10-K for the year ended December 31, 2016, and in subsequent reports filed on Form 10-Q and Form 8-K. The Company does not undertake any obligation to publicly update or revise any of these forward-looking statements, whether to reflect new information, future events or otherwise, except as required by law.\nInvestor Contact:\nMitchell A. Derenzo\nExecutive Vice President, Chief Financial Officer\nAmerican River Bankshares\n916-231-6723\nMedia Contact:\nErica Thompson Dias\nVice President, Marketing & Community Engagement\nAmerican River Bankshares\n916-231-6717\nSource:American River Bankshares", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/27756c3e-10f7-45ac-b551-5a141b4c44cf"], "published": "2018-01-25T17:30:00.000+02:00", "crawled": "2018-01-25T18:19:01.011+02:00", "highlightTitle": ""}