{"organizations": [], "uuid": "ab30eaef489270f9870e9d9b41f1883bac9daa54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/iran-rallies/update-1-iran-warns-protestors-who-pose-major-challenge-to-countrys-leadership-idUSL8N1OV04I", "country": "US", "domain_rank": 408, "title": "UPDATE 10-Iran protesters rally again despite warning of crackdown", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T03:41:00.000+02:00", "replies_count": 0, "uuid": "ab30eaef489270f9870e9d9b41f1883bac9daa54"}, "author": "", "url": "https://www.reuters.com/article/iran-rallies/update-1-iran-warns-protestors-who-pose-major-challenge-to-countrys-leadership-idUSL8N1OV04I", "ord_in_thread": 0, "title": "UPDATE 10-Iran protesters rally again despite warning of crackdown", "locations": [], "entities": {"persons": [{"name": "bozorgmehr sharafedin", "sentiment": "none"}, {"name": "rouhani", "sentiment": "none"}, {"name": "reza shah", "sentiment": "none"}, {"name": "hassan rouhani", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "December 31, 2017 / 12:16 PM / Updated 20 hours ago UPDATE 10-Iran protesters rally again despite warning of crackdown Reuters Staff \n* Protesters chant: “Reza Shah, bless your soul”, breaking taboo \n* Rouhani says Iranians have right to protest \n* Rouhani also warns against violation of public order \n* White House says that “voices deserve to be heard” (Adds White House statement, paragraphs 15-16) \nBy Bozorgmehr Sharafedin \nLONDON, Dec 31 (Reuters) - Anti-government protesters demonstrated in Iran on Sunday in defiance of a warning by authorities of a crackdown, extending for a fourth day one of the most audacious challenges to the clerical leadership since pro-reform unrest in 2009. \nGiving his first public reaction to the protests, President Hassan Rouhani appealed for calm, saying Iranians had the right to protest and criticise the authorities. \nBut he warned, according to official media: “The government will show no tolerance for those who damage public properties, violate public order and create unrest in the society.” \nTens of thousands of people have protested across the country since Thursday against the Islamic Republic’s government and clerical elite. \nPolice in the centre of Tehran fired water cannons to try to disperse demonstrators, according to pictures on social media. \nDemonstrations turned violent in Shahin Shahr in central Iran. Videos showed protesters attacking the police, turning over a car and setting it on fire. Reuters could not immediately verify the authenticity of the footage. \nThere were also reports of demonstrations in the western cities of Sanandaj and Kermanshah as well as Chabahar in the southeast and Ilam and Izeh in the southwest. \nDemonstrators initially vented their anger over economic hardships and alleged corruption, but the protests took on a rare political dimension, with a growing number of people calling on Supreme Leader Ayatollah Ali Khamenei to step down. \nIranian security forces appear to have shown restraint to avoid an escalation of the crisis. Two people have been killed and hundreds arrested. \nThe protests were the biggest since unrest in 2009 that followed the disputed re-election of then-President Mahmoud Ahmadinejad. \nVideos showed people in central Tehran chanting: “Down with the dictator!” in an apparent reference to Khamenei. \nProtesters in Khorramabad in western Iran shouted: “Khamenei, shame on you, leave the country alone!” \nThe government said it would temporarily restrict access to the Telegram messaging app and Instagram, owned by Facebook Inc , state television said. There were also reports that mobile access to the internet was being blocked in some areas. \n“Iran, the Number One State of Sponsored Terror with numerous violations of Human Rights occurring on an hourly basis, has now closed down the Internet so that peaceful demonstrators cannot communicate. Not good!” U.S. President Donald Trump tweeted on Sunday. \nThe White House said in a statement later on Sunday that the Iranian people’s “voices deserve to be heard.” \n“We encourage all parties to protect this fundamental right to peaceful expression and to avoid any actions that contribute to censorship,” the statement said. BREAKING TABOO \nAn Iranian reached by telephone, who asked not to be named, said there was a heavy presence of police and security forces in the heart of the capital. \n“I saw a few young men being arrested and put into police van. They don’t let anyone assemble,” he said. \nA video showed a protester being arrested by police while a crowd shouted: “Police, go and arrest the thieves!” in the northwestern city of Khoy. \nIn the western town of Takestan, demonstrators set ablaze a Shi‘ite Muslim seminary and the offices of the local Friday prayers leader, state broadcaster IRIB’s website said. Police dispersed protesters, arresting some, ILNA news agency said. \nDemonstrators also shouted: “Reza Shah, bless your soul.” Such calls are evidence of a deep level of anger and break a taboo. The king ruled Iran from 1925 to 1941 and his Pahlavi dynasty was overthrown in a revolution in 1979 by Ayatollah Ruhollah Khomeini, the Islamic Republic’s first leader. \nHigh prices, alleged corruption and mismanagement are fuelling the anger. Youth unemployment reached 28.8 percent this year. \nEconomic indexes have improved under Rouhani’s government and the economy is no longer in dire straits. But growth has been too slow for an overwhelmingly youthful population, far more interested in jobs and change than in the Islamist idealism and anti-Shah republicanism of the 1979 revolution. \nThe demonstrations are particularly troublesome for Rouhani’s government because he was elected on a promise to guarantee rights to freedom of expression and assembly. \nHis main achievement is a deal in 2015 with world powers that curbed Iran’s nuclear program in return for a lifting of most international sanctions. But it has yet to bring the economic benefits the government promised. \nAli Asghar Naserbakht, deputy governor of Tehran province, was quoted as saying by ILNA that 200 protesters had been arrested on Saturday. \n‘CARRIED AWAY BY EMOTIONS’ \nTehran prosecutor Abbas Jafari Dolatabadi said some of those arrested had confessed “they were carried away by emotions and set fire to mosques and public buildings”, adding they would face severe punishment. \n“After giving thousands of martyrs for the Revolution, the nation will not return to dark era of Pahlavi rule,” he said. \nPolice and Revolutionary Guards have in the past crushed unrest violently. The new protests could worry authorities more because they seem spontaneous and lack a clear leader. \nYet analysts say Iran’s leaders believe they can count on support from many of the generation that took part as youths in the 1979 revolution because of their ideological commitment and the economic gains they have made under the government. \nIn apparent response to the protests, the government backed down on plans to raise fuel prices, promised to increase cash handouts to the poor and create more jobs in coming years. \n“We predict that at least 830,000 jobs will be created in the new year,” government spokesman Mohammad Baqer Nobakht said on state television on Saturday night. He gave no details. About 3.2 million Iranians are jobless. \nProtesters also expressed anger over costly interventions in Syria and Iraq, where Iran is engaged in a proxy war for influence against regional rival Saudi Arabia. \n“Big protests in Iran,” Trump said in a tweet earlier on Sunday. “The people are finally getting wise as to how their money and wealth is being stolen and squandered on terrorism.” \nRouhani said the U.S. president had no right to sympathise with Iranians since he “called the Iranian nation terrorists a few months ago”. Writing by Michael Georgy; Editing by Kevin Liffey and Peter Cooney", "external_links": [], "published": "2018-01-01T03:41:00.000+02:00", "crawled": "2018-01-01T11:09:11.005+02:00", "highlightTitle": ""}