{"organizations": [], "uuid": "f4702b57b03f103991dff4d1cd4c4e462f17bb30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/indices", "section_title": "Market Indices | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-treads-lower-as-dollar-gains-on-stronger-u-s-data-idUSL3N1PD1J6", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold treads lower as dollar gains on stronger U.S. data", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-18T12:24:00.000+02:00", "replies_count": 0, "uuid": "f4702b57b03f103991dff4d1cd4c4e462f17bb30"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-treads-lower-as-dollar-gains-on-stronger-u-s-data-idUSL3N1PD1J6", "ord_in_thread": 0, "title": "PRECIOUS-Gold treads lower as dollar gains on stronger U.S. data", "locations": [], "entities": {"persons": [{"name": "tim brown", "sentiment": "none"}, {"name": "nithin thomasprasad", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "technicals", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "mks pamp group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Spot gold could fall to $1,311/oz - Technicals * Falling digital currencies could support gold - analysts (Updates with Quote: , latest prices) By Nithin ThomasPrasad Jan 18 (Reuters) - Gold slipped on Thursday, hitting its lowest in nearly a week, as the dollar edged higher from three-year lows on stronger-than-expected U.S. economic data. Spot gold was down 0.1 percent at $1,326.11 per ounce as of 0726 GMT. Earlier in the session, it touched its lowest since Jan. 12 at $1,323.70. In the previous session, it fell 0.8 percent, posting its worst one-day percentage decline since Dec. 7. U.S. gold futures for February delivery slipped 0.9 percent to $1,326.60 per ounce. \"The metal looks well supported at $1,325 (an ounce) and below that we can expect plenty of buying interest ahead of $1,300,\" said MKS PAMP Group trader Tim Brown in a note. \"On the upside, first resistance should be at the four month high of $1,344 and the $1,350 level after that.\" U.S. industrial production increased more than expected in December as unseasonably cold weather at the end of the month boosted demand for heating, but manufacturing output barely rose, pointing to moderate growth in the industrial sector. \"Technically, $1,326 will act as a support and holding that could push prices to test $1,360-$1,364,\" said Amit Kumar Gupta, portfolio management services head at Adroit Financial Services. Analysts said a correction in digital currencies could support gold. \"Brokers in Europe report investors have increasingly been asking about switching from cryptocurrencies into gold,\" ANZ analysts said in a research note. On Wednesday, bitcoin fell more than 10 percent to below $10,000 for the first time since Dec. 1 on the Luxembourg-based Bitstamp Exchange. The biggest digital currency has lost half its value since it peaked near $20,000 about a month ago. Meanwhile, the dollar index, against a basket of six major currencies , was up 0.33 percent at 90.844 after hitting 90.113 on Wednesday, its lowest since Dec. 31, 2014. Spot gold is expected to fall to $1,311 per ounce, as it has broken a support at $1,329, according to Reuters technical analyst Wang Tao. In other precious metals, silver edged 0.1 percent lower to $16.99 per ounce and palladium slipped 0.4 percent to $1,110.99 per ounce. Platinum crept 0.1 percent lower to $996.20 per ounce, after touching its highest since Sept. 8 at $1,006.60 in the previous session. (Reporting by Nallur Sethuraman and Nithin Prasad in Bengaluru, Editing by Sherry Jacob-Phillips and Amrutha Gayathri)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T12:24:00.000+02:00", "crawled": "2018-01-18T12:33:26.015+02:00", "highlightTitle": ""}