{"organizations": [], "uuid": "c3d4642cb5f6d400d379dbb8b9500a2ba55672b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-eri-names-anna-marie-francello-senior-director-of-strategy-business-development.html", "country": "US", "domain_rank": 767, "title": "ERI Names Anna Marie Francello Senior Director of Strategy & Business Development", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T22:57:00.000+02:00", "replies_count": 0, "uuid": "c3d4642cb5f6d400d379dbb8b9500a2ba55672b3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-eri-names-anna-marie-francello-senior-director-of-strategy-business-development.html", "ord_in_thread": 0, "title": "ERI Names Anna Marie Francello Senior Director of Strategy & Business Development", "locations": [], "entities": {"persons": [{"name": "anna marie francello", "sentiment": "negative"}, {"name": "anna marie", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "eri", "sentiment": "negative"}, {"name": "cablevision", "sentiment": "none"}, {"name": "corporate real estate & administrative services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- ERI , the nation’s leading recycler of electronic waste and the world's largest cybersecurity-focused hardware destruction company, has named Anna Marie Francello as its Senior Director of Strategy & Business Development.\nFrancello brings to ERI over 24 years of experience in real estate, corporate services, sustainability initiatives and environmental management with prominent organizations from financial institutions to a cable and media company. She was most recently a Senior Vice President at Cablevision, reporting directly to the Chief Executive Officer and overseeing the company’s Corporate Real Estate & Administrative Services across 200+ properties and supporting 15,000 employees, achieving service level enhancements and savings through automation and standardization.\n“Anna Marie is a seasoned business development, corporate real estate and sustainability-focused executive recognized for her ability to successfully lead a diverse workforce across large portfolios and high-touch service areas, achieving significant operational efficiencies and service level enhancements, while executing cost containment strategies,” said John Shegerian, Co-Founder and Executive Chairman of ERI. “Her client-centric focus coupled with her more than two decades of experience in business process improvements, sustainability and environmental management and risk mitigation allow for her to drive innovative solutions that remain practical and aligned with ERI’s mission. Anna Marie’s success in building teams and instilling dedication and accountability to team success comes from her keen focus on developing and retaining key talent. We are tremendously honored to have her join us and we’re confident that her input and contributions will be significant.”\nFrancello is a CPA and licensed New York Real Estate Salesperson who started her professional career in public accounting with Price Waterhouse and Ernst & Young, providing tax structuring strategies and due diligence in real estate. She expanded her Corporate Real Estate experience by joining Newmark & Company as the Operations & Reporting Manager for the Global Accounts Group.\nIn 2000, she joined UBS as the Americas' Controller for Corporate Real Estate, managing all corporate real estate financials. Over her 15 years at UBS, she was promoted multiple times and held various executive positions in key logistic areas of the Bank. She became UBS’ Regional Head of Environmental Management, while also assuming responsibility for the Corporate Real Estate Project Financial Control Group. As the Head of Environmental Management, she developed a regional Environmental Management System (ISO 14001) and was a critical subject matter expert and participant in the creation of UBS’ Global Climate Change Strategy. She then joined UBS’ Office of the COO and spent three years leading cross-regional programs for the PMO. Anna Marie’s responsibilities at UBS continued to expand and she was promoted in 2014 to the Americas Head of Corporate Services, overseeing all services within North and South America.\nFrancello was also a key member of the United Nations Environmental Programme Finance Initiative Task Force and New York’s Metropolitan Transportation Authority’s Blue Ribbon Sustainability Commission during the 18-month MTA sustainability strategy development and public release.\nERI, the nation’s leading recycler of electronic waste and the world's largest ITAD and cybersecurity-focused hardware destruction company, is certified to de-manufacture and recycle every type of electronic waste in an environmentally responsible manner. ERI processes more than 275 million pounds of electronic waste annually at eight locations, serving every zip code in the United States. For more information about e-waste recycling and ERI, call 1-800-ERI-DIRECT or visit https://eridirect.com .\nMedia: Photo of Anna Marie Francello is available upon request.\n //www.businesswire.com/news/home/20180130006275/en/\nERI\nPaul Williams, 310-569-0023\npaul.williams@eridirect.com\nSource: ERI", "external_links": ["http://www.businesswire.com/news/home/20180130006275/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ERIdirect.com&esheet=51751107&newsitemid=20180130006275&lan=en-US&anchor=ERI&index=1&md5=9cbe766e61f92a8c73e5d1b075f179fc", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Feridirect.com%2F&esheet=51751107&newsitemid=20180130006275&lan=en-US&anchor=https%3A%2F%2Feridirect.com&index=3&md5=1dd5b2f23b87bdd49b2871a6c993cbce", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Feridirect.com%2Fsustainability%2Fcertifications%2F&esheet=51751107&newsitemid=20180130006275&lan=en-US&anchor=certified&index=2&md5=a368080a82d48bccd6d6205224a02088"], "published": "2018-01-30T22:57:00.000+02:00", "crawled": "2018-01-31T00:37:14.004+02:00", "highlightTitle": ""}