{"organizations": [], "uuid": "0827c524fa3d639e8f5a5b700f3d892584d706fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224504603&w=1200&r=LYNXMPEE0M193", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-walmart-brazil-m-a/wal-mart-may-have-to-unload-stake-in-brazilian-unit-at-discount-idUSKBN1FC222", "country": "US", "domain_rank": 408, "title": "Wal-Mart may have to unload stake in Brazilian unit at discount", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:15:00.000+02:00", "replies_count": 0, "uuid": "0827c524fa3d639e8f5a5b700f3d892584d706fa"}, "author": "", "url": "https://www.reuters.com/article/us-walmart-brazil-m-a/wal-mart-may-have-to-unload-stake-in-brazilian-unit-at-discount-idUSKBN1FC222", "ord_in_thread": 0, "title": "Wal-Mart may have to unload stake in Brazilian unit at discount", "locations": [], "entities": {"persons": [{"name": "nandita bose", "sentiment": "none"}, {"name": "tatiana bautzer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "wal-mart", "sentiment": "negative"}, {"name": "wal-mart stores inc", "sentiment": "none"}, {"name": "walmart brasil ltda", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAO PAULO/NEW YORK (Reuters) - Wal-Mart Stores Inc ( WMT.N ) is looking to sell part of its operations in Brazil, where it has struggled for a decade, yet missteps by the U.S. retail giant have narrowed the field of potential buyers and could lower the value of any deal.\nThe world’s largest retailer is shopping a major stake in its Walmart Brasil Ltda unit to buyout firms with Latin American experience, two people with direct knowledge of the matter told Reuters on Sunday.\nWal-Mart’s operating losses in Brazil, which began in 2009, will likely attract investors with turnaround plans and modest valuations in mind, according to one of the sources, who spoke anonymously due to the sensitivity of the talks.\nThe company reported almost 30 billion reais ($9.4 billion) of Brazilian revenue from about 500 stores in 2016, but poorly integrated acquisitions, labor disputes and headwinds from Brazil's economic downturn have hurt its bottom line. ( reut.rs/2DWNOtp )\nMaking matters worse, some stores Wal-Mart opened during Brazil’s economic boom a decade ago are poorly located and have little appeal to rivals. Several retailers passed up the chance last year to make an offer on them, the same source said.\nTo lure buyers with the prospect of robust online growth, Wal-Mart combined its local e-commerce unit with its Brazilian brick-and-mortar operations in December, according to two people with knowledge of the Bentonville, Arkansas-based retailer’s plans.\nThe company declined to comment on the talks with buyout firms or its problems in the Brazilian market.\nInvestors were largely unsurprised by reports of Wal-Mart shopping a stake in the Brazilian unit. Wal-Mart Chief Executive Officer Doug McMillon announced in 2016 that he was planning to review global operations.\n“If they have decided to pull out of Brazil after being there for as long as they have, they have realized their model is not working,” said Charles Sizemore, founder of Sizemore Capital Management LLC, which owns shares of Wal-Mart.\n“I can definitely see Wal-Mart making similar decisions about other international businesses going forward,” he added.\nWal-Mart shares closed higher on Monday but gave back some of those gains on Tuesday.\nFOCUSING ELSEWHERE Wal-Mart’s struggles in Brazil are a far cry from its performance in Mexico, the company’s largest market outside the United States. Wal-Mart de Mexico SA de CV ( WALMEX.MX ) is Mexico’s No. 1 retailer.\nThat success is due to Wal-Mart’s decision to partner with Mexican retailer Cifra to launch the operation in the 1990s as well as help from local executives who have kept it attuned to the market, according to Carlos Bernal, an analyst with brokerage Actinver in Mexico.\nIn contrast, Wal-Mart struggled to gain traction from the $1 billion it spent in 2004-2005 on a patchwork of acquisitions in northeast and southern Brazil, two regions with stark economic, geographic and cultural differences.\nPoor real estate investment decisions, incompatible computer systems and unforeseen tax and labor costs added to the difficulties integrating the disparate network of stores, dragging on the Brazilian unit’s earnings for years.\nAnalysts and former executives in Brazil said one of Wal-Mart’s biggest setbacks in Brazil was losing a bidding match for cash-and-carry wholesaler Atacadão to rival Carrefour SA ( CARR.PA ), which paid $1.1 billion for it in 2007.\nAtacadão and rival Assaí, which was acquired in the same year by French retailer Casino’s ( CASP.PA ) subsidiary GPA ( PCAR4.SA ), went on to dominate the booming cash-and-carry segment, delivering profits even during the country’s recent recession. Wal-Mart’s entry into the segment was largely a flop.\nWal-Mart now looks ready to focus elsewhere while retaining what may be a more passive interest in Brazil, said one of the sources familiar with the conversations between the company and private equity firms.\nThe source added that the details of a partnership have not been clearly established.\n“They still want to retain a stake there so they can be around and not take attention away from what they must focus on,” said Jack Ablin, chief investment officer at BMO Private Bank in Chicago. “This does fit into the strategy that Doug McMillon laid out a couple of years ago. Wal-Mart is focusing more domestically where they have a dominant share.”\nOne of the funds that Wal-Mart has spoken to, according to one source, is Acon Investments LLC, which bought regional Brazilian retailer GBarbosa in 2005 and resold it two years later to Chile’s Cencosud SA CEN.SN.\nAnother is Advent International Corp, which invested in Brazilian apparel retailer Restoque Comercio e Confeccoes de Roupas SA ( LLIS3.SA ) and home improvement chain Quero Quero. A third, GP Investments Ltd GPIV11.LU, has a stake in sporting goods retailer Lojas Centauro, which recently filed for a Brazilian initial public offering.\nReporting by Tatiana Bautzer and Nandita Bose; Additional reporting by Daina Beth Solomon in Mexico City; Writing and additional reporting by Brad Haynes; Editing by Daniel Flynn and Paul Simao\n ", "external_links": [], "published": "2018-01-23T17:15:00.000+02:00", "crawled": "2018-01-23T17:37:03.007+02:00", "highlightTitle": ""}