{"organizations": [], "uuid": "5d2ac7167e51ff3666b71506a964cc5ddfbcd563", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/21/reuters-america-wall-st-week-ahead-where-netflix-goes-big-tech-may-follow-despite-u-s-government-shutdown.html", "country": "US", "domain_rank": 767, "title": "Wall St Week Ahead-Where Netflix goes, Big Tech may follow, despite U.S. government shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T22:57:00.000+02:00", "replies_count": 0, "uuid": "5d2ac7167e51ff3666b71506a964cc5ddfbcd563"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/21/reuters-america-wall-st-week-ahead-where-netflix-goes-big-tech-may-follow-despite-u-s-government-shutdown.html", "ord_in_thread": 0, "title": "Wall St Week Ahead-Where Netflix goes, Big Tech may follow, despite U.S. government shutdown", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "san francisc", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "wall st week ahead-where netflix", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "facebook inc", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "netflix inc", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "microsoft corp", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "government shutdown@ (Updates to include U.S. federal government shutdown Friday night)\nSAN FRANCISCO, Jan 21 (Reuters) - Netflix Inc's quarterly results on Monday may offer a preview of whether Facebook Inc, Amazon.com Inc and other heavyweights behind much of the U.S. stock market's record-breaking rally can keep delivering.\nWall Street on Friday shrugged off the then looming U.S. government shutdown and propelled the benchmark S&P 500 stock index to a record high as investors focused on upcoming quarterly reports.\nBut the U.S. Congress was not able to pass stop-gap spending legislation by the midnight Friday deadline leading to the start of a federal government shutdown of many agencies.\nU.S. Senate leaders had still not resolved the issue Sunday afternoon. Democrats demanded that President Donald Trump negotiate on immigration issues as part of any agreement to resume government funding and accused him of reneging on an earlier accord to protect Dreamers, illegal immigrants brought to the United States as children.\nMany of the largest companies, including Microsoft Corp , Apple Inc, Alphabet Inc and Amazon.com , have outperformed the broader market in the first 13 trading days of 2018, with investors betting strong earnings growth will justify technology stock valuations at their highest levels in a decade.\nNetflix, which is due to report its quarterly results on Monday after the stock market closes, has jumped nearly 15 percent this year, outpacing the 5.0 percent increase in the S&P500 index.\nThe 53 percent surge in Netflix's stock price in 2017, along with rallies by Amazon.com and Silicon Valley's largest technology companies, helped propel the stock market to new highs.\n\"Netflix is going to be a great early indicator of risk appetite for these high-volatility growth names,\" said Wedbush trader Joel Kulina. \"Netflix's drivers are very company-specific, but if this stock can deliver, there's no reason this whole market can't keep going higher.\"\nThe Los Gatos, California-based company faces increasing competition from internet streaming services including Amazon.com 's Prime Video and moves by traditional media companies, but investors remain optimistic about its ability to beat earnings expectations.\nIts stock recently traded at 95 times expected earnings for the next 12 months, versus AMC Entertainment at 44 times earnings and Time Warner Inc at 14 times earnings, according to Thomson Reuters data.\nUnderscoring investors' willingness to pay premium prices for fast-growing stocks, Phil Blancato, head of Ladenburg Thalmann Asset Management in New York, recently helped a client buy $1.5 million worth of shares in Facebook, Amazon.com , Apple, Netflix and Google parent company Alphabet as investments for his grandchildren.\n\"I said, 'You're crazy,' but he was very direct, he wanted the FAANG stocks,\" Blancato said, using a widely used Wall Street acronym for those companies.\nAnalysts on average expect S&P 500 index technology companies to deliver a 15.9 percent increase in earnings for the December quarter, according to Thomson Reuters I/B/E/S. Earnings for the entire S&P 500 are seen rising 12.2 percent, bolstered by lower unemployment and fatter wages.\nTechnology investors during the reporting season just under way are also eager to hear company executives explain how their bottom lines will be affected by corporate tax cuts passed by the U.S. Congress in December, and whether they plan to repatriate overseas profits.\nApple said on Wednesday it would make about $38 billion in one-time tax payments on its overseas cash, and investors want to know how much of the $252 billion held abroad Apple will bring home and potentially spend on dividends, share buybacks or acquisitions.\nIn its third-quarter earnings released on Oct. 16, Netflix reported it had added more global subscribers than analysts expected. In response, its stock hit a record high in after-hours trade before dipping the following day.\nIn October, Netflix hiked U.S. prices for the first time since 2015, potentially providing more cash to produce original content but also increasing the risk of losing customers.\nNetflix has forecast adding 6.3 million subscribers worldwide in the December quarter, which would bring its global customer base to nearly 115.6 million.\nAnalysts on average expect a 32.5 percent jump in revenue to $3.28 billion, and net income of $186.3 million, up 179 percent. Analysts expect earnings per share of 41 cents.\nUp 42 percent in the past 12 months, the S&P 500 information technology index is trading more than 19 times expected earnings, its highest since 2008, according to Thomson Reuters data.\nFacebook will post quarterly results on Jan. 31, followed by Amazon.com , Apple and Alphabet on Feb 1. Nvidia, which surged 81 percent in 2017 and replaced Qualcomm as the most valuable U.S. chipmaker after Intel Corp, reports on Feb 7. (Reporting by Noel Randewich; Editing by Richard Chang and Leslie Adler)", "external_links": [], "published": "2018-01-21T22:57:00.000+02:00", "crawled": "2018-01-22T01:08:39.020+02:00", "highlightTitle": ""}