{"organizations": [], "uuid": "188771c2597885255342a3b1687dfd08dd7e6d3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-headspin-hires-sriram-krishnan-as-senior-vice-president-of-product-growth-and-marketing.html", "country": "US", "domain_rank": 767, "title": "HeadSpin Hires Sriram Krishnan as Senior Vice President of Product, Growth and Marketing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-10T20:00:00.000+02:00", "replies_count": 0, "uuid": "188771c2597885255342a3b1687dfd08dd7e6d3d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-headspin-hires-sriram-krishnan-as-senior-vice-president-of-product-growth-and-marketing.html", "ord_in_thread": 0, "title": "HeadSpin Hires Sriram Krishnan as Senior Vice President of Product, Growth and Marketing", "locations": [], "entities": {"persons": [{"name": "sriram krishnan", "sentiment": "negative"}, {"name": "krishnan", "sentiment": "none"}, {"name": "akama", "sentiment": "none"}], "locations": [{"name": "marketing mountain view", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MOUNTAIN VIEW, Calif., Jan. 10, 2018 (GLOBE NEWSWIRE) -- HeadSpin, the leader in mobile application performance management and testing, today announced that Sriram Krishnan has joined the company as senior vice president of product, growth and marketing. He will be responsible for all facets of product and marketing including branding, growth, demand generation, product marketing, competitive intelligence, marketing communications and public relations.\nSriram Krishnan, Senior Vice President of Product, Growth and Marketing\n\"HeadSpin is reimagining the continuous monitoring, performance testing and user experience management landscape,\" said Krishnan. \"The solutions available are no longer applicable to today's world of rapid mobile adoption, and engineers and QA professionals need a solution pre and post-release that is easy by design. HeadSpin will support and maintain their applications’ performance and health.\"\nHeadSpin helps mobile application developers, that serve more than a billion monthly active users globally, build high quality mobile experiences. With customers like Akamai, Telstra, Dell and Tinder, HeadSpin has helped mobile application developers identify 1% of their performance issues that cause 80% of the user complaints and 60% of their user experience issues pre-release, resulting in a 40% improvement in customer experience and 25% improvement in application reliability.\n\"Sriram comes to HeadSpin with a proven track record of scaling well known technology companies like Spotify and Tinder,\" said Manish Lachwani, co-founder and CEO of HeadSpin. \"HeadSpin is already used by some of the largest enterprises in the world. My goal is to continue building the team so that we continue to cater to the demand from application developers that are enthusiastic about our simple yet powerful mobile experience solution.\"\nKrishnan brings a decade of experience in high-tech companies to the new role. Prior to joining HeadSpin, he was the Head of International Growth at Tinder -- the number one grossing mobile application in the world -- which is owned by Match Group, a publicly traded company. His marketing strategies enabled Tinder to become the largest and most recognized market leader and secure a dominant market share position in key markets. He previously was the co-founder and COO of Cosmify, a knowledge discovery startup that was acquired by Meltwater, a leading media intelligence and social monitoring company, in early 2017. Before Cosmify, he was Head of New Markets at Spotify, the world’s largest music streaming company. At Spotify, he helped the company scale internationally from six to 65 markets.\nAbout HeadSpin\nHeadSpin helps companies build mobile apps that delight the world. The HeadSpin platform lets companies experience their applications the way their users do and take action with AI-driven performance insights through a single platform that is easy by design. Companies can gain visibility into mobile experience everywhere with access to 22,000 real devices on real networks in 150 locations globally. HeadSpin is loved by the largest mobile application developers like Akamai, Telstra, Dell, Tinder and more. HeadSpin has been named one of the 20 Rising Stars as part of Forbes's Cloud 100 list. Find out more at www.HeadSpin.io or on Twitter @HeadSpinIO.\nMedia and Analyst Contact:\nAmber Rowland\namber@therowlandagency.com\n+1-650-814-4560\nSource: HeadSpin", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8e0a3334-58ed-4e69-93bc-513378bdf7f5/en", "https://www.globenewswire.com/NewsRoom/AttachmentNg/1e3f26a5-720b-4b44-ba69-9f35c6adc32b", "https://www.globenewswire.com/Tracker?data=4kjt9aAPUo2WamRG90LN8-QZzfl7g_vACUuwd_nL3nYyOcqYl0pylrOKWtz8fD6tXDjHFxcE_HCJkhjnSxdhBODElaqSi3DL1BipGPL2wv6UxR9thH1Sg2mpuiOSZYHu", "https://www.globenewswire.com/Tracker?data=riIkiA_8dGnpHJjIs0C12KW8wGpgAke1p_lQsWa6xZbUbdO1YPTvkKjqGiixfzfUQQBZCSgMsurQIeixmrYu2g=="], "published": "2018-01-10T20:00:00.000+02:00", "crawled": "2018-01-10T20:21:57.002+02:00", "highlightTitle": ""}