{"organizations": [], "uuid": "43be47eeb848a211492fe7860ea2b16c95e55cae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-smartbug-media-adds-inbound-agency-veteran-sandra-gallucci-moore-to-results-driven-team.html", "country": "US", "domain_rank": 767, "title": "SmartBug Media Adds Inbound Agency Veteran Sandra Gallucci Moore to Results-Driven Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.026, "site_type": "news", "published": "2018-01-23T15:00:00.000+02:00", "replies_count": 0, "uuid": "43be47eeb848a211492fe7860ea2b16c95e55cae"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-smartbug-media-adds-inbound-agency-veteran-sandra-gallucci-moore-to-results-driven-team.html", "ord_in_thread": 0, "title": "SmartBug Media Adds Inbound Agency Veteran Sandra Gallucci Moore to Results-Driven Team", "locations": [], "entities": {"persons": [{"name": "sandra gallucci moore", "sentiment": "negative"}, {"name": "moore", "sentiment": "none"}, {"name": "sandra", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "kuno creative", "sentiment": "none"}], "organizations": [{"name": "smartbug media adds inbound agency", "sentiment": "negative"}, {"name": "smartbug media", "sentiment": "negative"}, {"name": "omni media", "sentiment": "none"}, {"name": "publicis groupe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif., Jan. 23, 2018 /PRNewswire/ -- Today, SmartBug Media —a leading intelligent inbound marketing agency that assists businesses in generating leads, increasing awareness, and building brand loyalty through inbound marketing, digital strategy, design, marketing automation, and PR—announced its hire of Sandra Gallucci Moore as Marketing Strategist for SmartBug Media. Moore will work as a primary client liaison, creating marketing strategies and empowering clients with results, knowledge, content, and tools for successful client campaigns.\nPreviously, Sandra worked for one of the largest marketing and communication companies worldwide as the Sales Manager and Head of Business Development for Publicis Groupe's Omni Media in Cleveland, Ohio. For the last three years, she was the Lead Strategic Accounts Manager for Kuno Creative, where she handled clients in the healthcare, technology, manufacturing, and professional services industries; provided marketing services through content marketing, demand generation, lead nurturing, and marketing automation; and worked to deliver leads, improve ROI, and increase customer lifetime value through inbound and outbound marketing activities.\n\"I am happy to be part of a team that truly knows how to service clients' marketing needs,\" said Gallucci More. \"It is exciting to be part of an agency that can get the job done and share in the client's success—all while being part of an award-winning team that values work-life balance.\"\nGallucci Moore has a BBA in Marketing and E-commerce from the University of Toledo and has 10 HubSpot certifications.\n\"As I look to the future of SmartBug Media, Sandra's vast amount of experience in both traditional media and digital marketing will be an invaluable asset to the growth of the company and the revenue growth of the clients she serves,\" said Amber Kemmis, Vice President of Client Services for SmartBug Media. \"We are beyond excited to have her as a part of the team and extremely anxious to see her skills and experience in action.\"\nAbout SmartBug Media\nFor 10 years, SmartBug Media has been helping businesses increase sales leads, close more customers, and enhance the reach of their brands. SmartBug Media is one of a handful of HubSpot Diamond partners in the world and is the highest-rated agency in the history of the HubSpot ecosystem. SmartBug Media also boasts the highest ROI documented from any HubSpot partner: 3,558 percent and 14,500 percent on a six-month and three-year campaign, respectively. SmartBug Media is also a certified Great Place to Work, Inc. 5000 company, and the winner of 36 MarCom Awards in 2017.\nView original content with multimedia: http://www.prnewswire.com/news-releases/smartbug-media-adds-inbound-agency-veteran-sandra-gallucci-moore-to-results-driven-team-300585368.html\nSOURCE SmartBug Media", "external_links": ["https://www.smartbugmedia.com/", "http://www.prnewswire.com/news-releases/smartbug-media-adds-inbound-agency-veteran-sandra-gallucci-moore-to-results-driven-team-300585368.html"], "published": "2018-01-23T15:00:00.000+02:00", "crawled": "2018-01-23T18:04:09.018+02:00", "highlightTitle": ""}