{"organizations": [], "uuid": "81540895718f2760a834c9d85188d314411ec439", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/14/104651358-RTS1BOBO.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/davos-2018-edelman-barometer-reveals-record-drop-in-trust-from-us-public.html", "country": "US", "domain_rank": 767, "title": "Davos 2018: Edelman barometer reveals record drop in trust from US public", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.131, "site_type": "news", "published": "2018-01-22T14:04:00.000+02:00", "replies_count": 0, "uuid": "81540895718f2760a834c9d85188d314411ec439"}, "author": "David Reid", "url": "https://www.cnbc.com/2018/01/22/davos-2018-edelman-barometer-reveals-record-drop-in-trust-from-us-public.html", "ord_in_thread": 0, "title": "Davos 2018: Edelman barometer reveals record drop in trust from US public", "locations": [], "entities": {"persons": [{"name": "edelman", "sentiment": "negative"}, {"name": "jonathan ernst", "sentiment": "negative"}, {"name": "richard edelman", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "charlottesville", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "edelman trust", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The United States has witnessed a massive collapse in public faith in its institutions, according to a survey released Monday.\nThe last year has seen an aggregate 37 percent slump in trust across government, media, businesses and non-government organizations (NGOs) in the U.S., the 2018 Edelman Trust Barometer report said. Of all 28 countries measured, the U.S. saw the biggest fall by some margin.\nThe Edelman survey offers an annual snapshot of a country's trust in its four main institutions.\nIts authors said the trust decline in the U.S. is the steepest ever measured among the \"general population,\" and that among the \"informed public\" trust had also imploded.\n\"The United States is enduring an unprecedented crisis of trust,\" said Richard Edelman, president and CEO of the Edelman Trust, in the report.\nThis collapse of trust was driven mainly by an increased lack of faith in government, which fell 14 points to 33 percent among the general population, and slumped 30 points to 33 percent among the informed public. The remaining institutions of business, media and NGOs also experienced declines between 10 and 20 points.\nIn the report's executive summary, Edelman called it an \"ultimate irony\" that the U.S. public's lack of faith is happening at a time when both the stock market and employment rates in the U.S. are at record highs.\nAt the other end of the scale, China posted the biggest rise in the trust index among all countries measured with increases among both the general population and the informed public.\nThe report concluded that China's growing middle-class was helping promote high confidence in government and state-run media. Increased trust in business was also reported as internet companies like Alibaba and Tencent expanded beyond the country's borders.\nAccording to the barometer, media has become the least-trusted global institution for the first time, with trust scores of over 50 percent in only six nations, five of which are in the developing world.\n\"Leaders are going directly to the people, bashing the media as inaccurate and biased. These forces are taking a toll,\" said Edelman.\nOne paradox contained within the data was that although faith in media platforms was seen to be falling, one sub-measure suggested that the credibility of individual journalists had risen substantially.", "external_links": [], "published": "2018-01-22T14:04:00.000+02:00", "crawled": "2018-01-22T14:09:55.001+02:00", "highlightTitle": ""}