{"organizations": [], "uuid": "f871a98f3dfb7a45d6a80878bbf555eb98e15569", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/oil-prices-kemp/column-hedge-fund-bulls-have-left-oil-market-looking-very-stretched-kemp-idUSL8N1PB3WC", "country": "US", "domain_rank": 408, "title": "COLUMN-Hedge fund bulls have left oil market looking very stretched: Kemp", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:57:00.000+02:00", "replies_count": 0, "uuid": "f871a98f3dfb7a45d6a80878bbf555eb98e15569"}, "author": "", "url": "https://www.reuters.com/article/oil-prices-kemp/column-hedge-fund-bulls-have-left-oil-market-looking-very-stretched-kemp-idUSL8N1PB3WC", "ord_in_thread": 0, "title": "COLUMN-Hedge fund bulls have left oil market looking very stretched: Kemp", "locations": [], "entities": {"persons": [{"name": "john kemp", "sentiment": "negative"}, {"name": "kemp", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Chartbook: tmsnrt.rs/2D8l6V7 \nBy John Kemp \nLONDON, Jan 16 (Reuters) - Hedge funds and other money managers have boosted their bullish position in oil to a new record, but with crude taking over from fuels as the main target of fresh buying. \nHedge funds boosted their net long position in the six most important futures and options contracts linked to crude and fuels by 67 million barrels to a record 1,399 million barrels in the week to Jan. 9. \nPortfolio managers have increased their net long position in Brent, NYMEX and ICE WTI, U.S. gasoline, U.S. heating oil and European gasoil by a total of 1,089 million barrels since the end of June. \nThe accumulation of bullish positions is easily the largest on record and far outstrips anything seen even during the spike in oil prices during late 2007 and the first half of 2008 ( tmsnrt.rs/2D8l6V7 ). \nIn the last six months, funds have added 374 million barrels of net long positions in Brent, 344 million in WTI, 112 million in gasoline, 128 million in heating oil and 131 million barrels in gasoil. \nThe scale of the buying has left positions looking very stretched on many measures and prices vulnerable to a correction if fund managers try to realise some of their paper profits. \nHedge funds now hold more than 10 long positions in crude and fuels for every short position, up from a ratio of less than 1.60:1 at the end of June. \nIf fund managers try to sell some of those positions, they may have difficulty finding buyers, which could cause a sharp downward move in prices (“Why stock markets crash”, Sornette, 2003). \nIn the past, large concentrations of hedge fund positions, either long or short, have normally preceded a reversal in the price trend (“Predatory trading and crowded exits”, Clunie, 2010). \nIn the current case, however, portfolio managers seem to be gambling oil prices will break up into a new, higher trading range before eventually correcting. \nThe global economy is growing strongly and world trade volumes are increasing at the fastest rate since the start of the decade. \nOil consumption is increasing strongly while OPEC and its allies continue to restrict production to draw down inventories. \nU.S. shale production is set to increase strongly in 2018 as a result of the increase in prices, but the impact will most likely be felt later in the year, and that has not daunted most of the oil bulls. \nFew fund managers are willing to bet against the rising trend in prices - yet. \nHedge fund short positions in NYMEX WTI have fallen to 35 million barrels, the lowest level since July 2014, when oil prices started slumping. \nAcross the petroleum complex as a whole, fund managers hold just 154 million barrels of short positions, close to multi-year lows, compared with a record 1,552 million barrels of long positions. \nBut the lack of any bearish short-sellers for either crude or fuels suggests a one-way market has developed - which is normally a harbinger of an upsurge in volatility and a correction ahead. \nRelated columns: \n“OPEC’s focus on stocks risks prices overshooting”, Reuters, Jan. 3 \n“Hedge funds gamble OPEC will tighten oil market too much”, Reuters, Jan. 2 Editing by David Evans", "external_links": [], "published": "2018-01-16T14:57:00.000+02:00", "crawled": "2018-01-16T15:34:38.033+02:00", "highlightTitle": ""}