{"organizations": [], "uuid": "55ec6a6411a543bcce01a66965c6e2416b195861", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-ian-v-muress-joins-sedgwick-as-ceo-of-international-operations.html", "country": "US", "domain_rank": 767, "title": "Ian V. Muress joins Sedgwick as CEO of international operations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:00:00.000+02:00", "replies_count": 0, "uuid": "55ec6a6411a543bcce01a66965c6e2416b195861"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-ian-v-muress-joins-sedgwick-as-ceo-of-international-operations.html", "ord_in_thread": 0, "title": "Ian V. Muress joins Sedgwick as CEO of international operations", "locations": [], "entities": {"persons": [{"name": "ian v. muress", "sentiment": "negative"}, {"name": "sedgwick", "sentiment": "negative"}, {"name": "muress", "sentiment": "none"}, {"name": "mike arbour", "sentiment": "none"}, {"name": "ian muress", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "sedgwick group", "sentiment": "none"}, {"name": "vericlaim", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan. 11, 2018 /PRNewswire/ -- Sedgwick, a leading global provider of technology-enabled risk and benefits solutions, announced that Ian V. Muress has joined the company as chief executive officer of its growing international division.\nMuress is a well-known industry veteran who, over the course of his career, ascended the ranks from claims adjusting trainee to executive leader. He most recently served as CEO of international operations for a large global adjusting firm, where he had responsibility for all business outside the U.S. He also was a member of the firm's global executive management team.\nIn his new role, Muress will leverage his deep understanding of global claims management and quality standards to oversee and support Sedgwick and subsidiary Vericlaim's expanding international operations.\n\"Ian Muress is the ideal person to lead our rapidly growing multi-national business,\" said Sedgwick Group President Mike Arbour. \"His reputation for customer service is unparalleled, and his expertise will be instrumental as we work to bring our services to additional global markets.\"\n\"Each of Sedgwick and Vericlaim's highly respected executives around the world enjoys an enviable market reputation; together, we represent a formidable team focused on the unique opportunities presented to us as an unrivalled, worldwide claims organisation capable of servicing global clients across all sectors,\" Muress said. \"I look forward to working with the many outstanding businesses in the UK and around the world in my new role as Sedgwick's CEO of international operations.\"\n\"At Sedgwick, taking care of people is at the heart of everything we do,\" said Dave North, Sedgwick president and CEO. \"Having a leader of Ian's caliber at the helm of our international operations will enable us to be there for more people in more places when unexpected losses occur.\"\nAbout Sedgwick\nSedgwick Claims Management Services, Inc., is a leading global provider of technology-enabled risk and benefits solutions. At Sedgwick, caring counts SM ; the company takes care of people and organisations by delivering cost-effective claims, productivity, managed care, risk consulting and other services through the dedication and expertise of nearly 15,000 colleagues in some 275 offices located in the U.S., Canada, U.K. and Ireland. Sedgwick facilitates financial and personal health and helps customers and consumers navigate complexity by designing and implementing customized programs based on proven practices and advanced technology that exceed expectations. Sedgwick's majority shareholder is KKR; Stone Point Capital LLC, La Caisse de dépôt et placement du Québec (CDPQ) and other management investors are minority shareholders. For more, see www.sedgwick.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/ian-v-muress-joins-sedgwick-as-ceo-of-international-operations-300580973.html\nSOURCE Sedgwick", "external_links": ["http://www.prnewswire.com/news-releases/ian-v-muress-joins-sedgwick-as-ceo-of-international-operations-300580973.html", "http://www.sedgwick.com/"], "published": "2018-01-11T16:00:00.000+02:00", "crawled": "2018-01-11T19:53:46.000+02:00", "highlightTitle": ""}