{"organizations": [], "uuid": "702fbeefc7b7f7985f415c1b06de765ee2726381", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/20/104909663-RTX3VZD5.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/trump-accuses-doj-of-being-part-of-deep-state.html", "country": "US", "domain_rank": 767, "title": "Trump accuses DoJ of being part of ‘deep state’", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.335, "site_type": "news", "published": "2018-01-02T17:17:00.000+02:00", "replies_count": 0, "uuid": "702fbeefc7b7f7985f415c1b06de765ee2726381"}, "author": "Jonathan Ernst", "url": "https://www.cnbc.com/2018/01/02/trump-accuses-doj-of-being-part-of-deep-state.html", "ord_in_thread": 0, "title": "Trump accuses DoJ of being part of ‘deep state’", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "jonathan ernst", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "justice departmen", "sentiment": "negative"}, {"name": "justice department", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump accused the Justice Department Tuesday of being part of the \"deep state\" and urged prosecution against a top aide to former Secretary of State Hillary Clinton and former FBI Director James Comey .\nHe also claimed that U.S. sanctions on North Korea were having a \"big impact\" and that he was responsible for preventing commercial aviation deaths in 2017.\nTrump's latest tweets pressed familiar arguments for the president, who is set to begin his first full year in office with the victory of tax legislation but the Russia investigation still hanging over his administration.\n\"Crooked Hillary Clinton's top aid, Huma Abedin, has been accused of disregarding basic security protocols. She put Classified Passwords into the hands of foreign agents,\" Trump tweeted in an apparent reference to a report by the conservative Daily Caller.\n\"Remember sailors pictures on submarine? Jail! Deep State Justice Dept must finally act? Also on Comey & others,\" he added.\nAs he remains shadowed by the special counsel's Russia investigation, Trump has seized on recent revelations of anti-Trump behavior by some FBI officials, including some who once worked on special counsel Robert Mueller's probe of Russian meddling in the 2016 presidential election, to claim bias against him.\nThe president's reference Tuesday to \"Deep State Justice Dept\" suggests that federal law enforcement is part of an entrenched bureaucracy that Trump and his supporters say didn't want him to be elected and is actively working to undermine his presidency.\nTrump's reference to sailors likely referred to a Navy sailor convicted of taking photos of classified areas inside a submarine.\nTrump's blast at the Justice Department came after he returned to the White House from a holiday getaway to face legislative challenges, midterm elections and global threats. He issued confrontational tweets targeting Iran, which in recent days has been rocked by anti-government protests, and Pakistan.\n\"The people of Iran are finally acting against the brutal and corrupt Iranian regime. All of the money that President Obama so foolishly gave them went into terrorism and into their 'pockets.' The people have little food, big inflation and no human rights. The U.S. is watching!\"\nOn Monday, Trump slammed Pakistan for \"lies & deceit,\" saying it had played U.S. leaders for \"fools\" by not doing enough to control militants.\n\"The United States has foolishly given Pakistan more than 33 billion dollars in aid over the last 15 years, and they have given us nothing but lies & deceit, thinking of our leaders as fools. They give safe haven to the terrorists we hunt in Afghanistan, with little help. No more!\" Trump said.\nPakistani officials, including Foreign Minister Khawaja Asif, said the country would make clear \"the difference between facts and fiction.\"\nIt was not immediately clear what prompted Trump to comment on Pakistan. The U.S. has long accused Pakistan of allowing militants to operate relatively freely in its border regions to carry out operations in neighboring Afghanistan. The U.S. said in August that it would hold up $255 million in military assistance for Pakistan until it cracks down on extremists threatening Afghanistan.\nMeanwhile, North Korean leader Kim Jong Un said Monday the United States should be aware that his country's nuclear forces are now a reality, not a future threat. To that, Trump said only: \"We'll see.\"\nAt home, Trump is hoping for more legislative achievements after his success on cutting taxes. He plans to host Senate Majority Leader Mitch McConnell of Kentucky and House Speaker Paul Ryan of Wisconsin at Camp David next weekend to map out the 2018 legislative agenda.\nRepublicans are eager to make progress before attention shifts to the November midterm elections. The GOP wants to hold the House and Senate, but must contend with Trump's historic unpopularity and some recent Democratic wins, including the pickup of a Senate seat in deeply Republican Alabama.\nThe White House has said Trump will come forward with his long-awaited infrastructure plan in January. Trump has also said he wants to overhaul welfare and recently predicted Democrats and Republicans will \"eventually come together\" to develop a new health care plan.\nRyan has talked about overhauling Medicaid and Medicare and other safety-net programs, but McConnell has signaled an unwillingness to go that route unless there's Democratic support for any changes. Republicans will have just a 51-49 Senate majority — well shy of the 60 votes needed to pass most bills — giving leverage to Democrats.\nCongress also has to deal with a backlog from 2017, including agreeing on a spending bill by Jan. 19 to avert a partial government shutdown. There's also providing additional aid to hurricane victims, lifting the debt ceiling, extending a children's health insurance program and extending protections for immigrants brought to the U.S. illegally as children. Trump has said he wants money for a border wall in exchange for protecting those immigrants.", "external_links": [], "published": "2018-01-02T17:17:00.000+02:00", "crawled": "2018-01-02T17:18:33.002+02:00", "highlightTitle": ""}