{"organizations": [], "uuid": "b797f447939d35e7307cd4c1fb5f5e162e66fc8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-alkahest-inc-announces-key-appointments.html", "country": "US", "domain_rank": 767, "title": "Alkahest, Inc. Announces Key Appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.04, "site_type": "news", "published": "2018-01-23T15:00:00.000+02:00", "replies_count": 0, "uuid": "b797f447939d35e7307cd4c1fb5f5e162e66fc8c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-alkahest-inc-announces-key-appointments.html", "ord_in_thread": 0, "title": "Alkahest, Inc. Announces Key Appointments", "locations": [], "entities": {"persons": [{"name": "karl", "sentiment": "none"}, {"name": "alkahest", "sentiment": "none"}, {"name": "helen jenkins", "sentiment": "none"}, {"name": "jonas hannestad", "sentiment": "none"}, {"name": "karl g. trass", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "san carlos", "sentiment": "none"}, {"name": "alkahest", "sentiment": "none"}], "organizations": [{"name": "alkahest, inc.", "sentiment": "neutral"}, {"name": "alkahest, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN CARLOS, Calif., Jan. 23, 2018 /PRNewswire/ -- Alkahest, Inc. (\"Alkahest\"), a clinical-stage biotechnology company focused on developing new treatments for neurodegenerative diseases and other age-related conditions, announced today the appointments of Karl G. Trass as Vice President, Regulatory Affairs and Jonas Hannestad, M.D., Ph.D. as Senior Medical Director.\n\"We are delighted to further expand our development team as we work to bring innovative medicines to patients with Alzheimer's Disease, Parkinson's Disease and other serious diseases of aging,\" said Helen Jenkins, Alkahest's Chief Operating Officer.\nKarl brings to Alkahest more than 20 years of experience providing global regulatory strategic leadership in both pharmaceutical and biotechnology companies. His experience encompasses building and leading organizational units including regulatory, quality assurance, safety, and manufacturing; managing development and commercial partnerships, contract manufacturing organizations and contract research organizations. Karl joins Alkahest from Tobira Therapeutics where he was Vice President, Regulatory Affairs prior to Tobira's acquisition by Allergan, and he held previous positions of increasing responsibility with Versartis, AbbVie, Neurobiological Technologies, Tularik, and Genentech. Karl received his B.A. in Chemistry from Indiana University.\nJonas has more than 20 years of experience in the field of neuroscience at both academic and biopharmaceutical organizations and is a noted authority in PET imaging in neuroinflammatory and other neurological disorders including the effect of systemic factors on the brain. Dr. Hannestad will maintain his appointment as Adjunct Assistant Professor of Psychiatry at the Yale University School of Medicine, and will be responsible for Alkahest's clinical programs in Alzheimer's and Parkinson's Disease. Jonas joins Alkahest from Denali Therapeutics and held previous positions at UCB Pharma and Yale University. He received his M.D. from Universidad de Oviedo and a Ph.D. from the University of Messina, and then completed a fellowship at UCLA and residency training in internal medicine and psychiatry at Duke University and Yale University.\nAbout Alkahest\nAlkahest is a privately-held clinical-stage company based in San Carlos, California developing treatments for age-related diseases, with an emphasis on cognitive dysfunction and neurodegeneration — key medical challenges of our generation. The company's breakthrough research has demonstrated that factors in blood plasma are able to reverse the detrimental effects on cognitive functions during in both normal aging and disease models in animals. Alkahest is developing novel plasma-based products in collaboration with Barcelona, Spain-based Grifols, a global healthcare company and leading producer of plasma therapies. Alkahest has a pipeline of first-in-class plasma derived, small molecule and recombinant protein products for the treatment of age-related diseases. For further information, see www.alkahest.com .\nContact Information:\nJoe McCracken\nVice President Business Development\nAlkahest, Inc.\njmccracken@alkahest.com\nView original content: http://www.prnewswire.com/news-releases/alkahest-inc-announces-key-appointments-300586304.html\nSOURCE Alkahest, Inc.", "external_links": ["http://www.alkahest.com/", "http://www.prnewswire.com/news-releases/alkahest-inc-announces-key-appointments-300586304.html"], "published": "2018-01-23T15:00:00.000+02:00", "crawled": "2018-01-23T18:04:53.001+02:00", "highlightTitle": ""}