{"organizations": [], "uuid": "4df4019649cad509dad063db77aae10e821a8337", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-public-storage-announces-tax-treatment-of-2017-dividends.html", "country": "US", "domain_rank": 767, "title": "Public Storage Announces Tax Treatment of 2017 Dividends", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-17T03:06:00.000+02:00", "replies_count": 0, "uuid": "4df4019649cad509dad063db77aae10e821a8337"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-public-storage-announces-tax-treatment-of-2017-dividends.html", "ord_in_thread": 0, "title": "Public Storage Announces Tax Treatment of 2017 Dividends", "locations": [], "entities": {"persons": [], "locations": [{"name": "glendale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "public storage announces tax treatment", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "psa", "sentiment": "negative"}, {"name": "irc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GLENDALE, Calif.--(BUSINESS WIRE)-- Public Storage (NYSE:PSA) announced today the tax treatment of the Company’s 2017 dividends. For the tax year ended December 31, 2017, distributions for the PSA common stock and all the various series of preferred stock were classified as follows:\n2017 1 st Quarter 2 nd Quarter 3 rd Quarter 4 th Quarter Ordinary Income 99.9257 % 99.9195\n%\n100.0000\n%\n99.4648\n%\nLong-Term Capital Gain 0.0743 % 0.0805\n%\n0.0000\n%\n0.5352\n%\nTotal 100.0000 % 100.0000\n%\n100.0000 % 100.0000\n%\nThe ordinary income dividends do not constitute “qualified dividend income.”\nFor the first and second quarters of 2017, the percentages of the long-term capital gain that constitute unrecaptured section 1250 gain are 0.2623% and 91.4554% respectively. Corporate shareholders subject to IRC §291 should treat 20% of the unrecaptured section 1250 gain as ordinary income.\nThis release is based on the preliminary results of work on the Company’s tax filings and is subject to correction or adjustment when the filings are completed. The Company is releasing information at this time to aid those required to distribute Forms 1099 on the Company’s distributions. No material change in the classification is expected.\nAlternative Minimum Tax\nAlternative minimum tax adjustments are to be apportioned between a real estate investment trust (“REIT”) and its shareholders under Internal Revenue Code Section 59(d). Although regulations have not yet been issued under that provision, based on regulations issued pursuant to a similar provision of prior law and the legislative history of the current provision, it appears that such alternative minimum tax adjustments are to be apportioned to a REIT’s shareholders to the extent that the REIT distributes its regular taxable income. It is the Company’s policy to distribute all of its regular taxable income and accordingly, all of the Company’s alternative minimum tax adjustments are being apportioned to the Company’s shareholders.\nThe Company has determined that -0.2273% of each distribution to its shareholders for the tax year ended December 31, 2017 consists of an alternative minimum tax adjustment (i.e., for each $1 of dividend reportable by a shareholder, $0.002273 represents a negative alternative minimum tax adjustment). To determine your share of the Company’s negative alternative minimum tax adjustment, multiply the aggregate dollar amount of your reportable 2017 dividend from the Company (the sum of the amounts shown in Boxes 1a and 2a of the Company’s 2017 Form 1099-DIV) by -0.002273.\nIf you are an individual, please refer to Internal Revenue Service Form 6251, Alternative Minimum Tax–Individuals. Your share of the alternative minimum tax adjustment should be input as a negative amount in Part I, Line 18 (depreciation on assets placed in service after 1986). If you are a corporation, please refer to Internal Revenue Service Form 4626, Alternative Minimum Tax–Corporations. Your share of alternative minimum tax adjustments should be input as a negative amount on line 2a (depreciation of post-1986 property).\nIf you have questions, please consult your tax advisor for further guidance.\nCompany Information\nPublic Storage, a member of the S&P 500 and FT Global 500, is a fully integrated, self-administered and self-managed real estate investment trust that primarily acquires, develops, owns and operates self-storage facilities. The Company’s headquarters are located in Glendale, California. At September 30, 2017, the Company had interests in 2,374 self-storage facilities located in 38 states with approximately 157 million net rentable square feet in the United States and 220 storage facilities located in seven Western European nations with approximately 12 million net rentable square feet operated under the “Shurgard” brand. The Company also owns a 42% common equity interest in PS Business Parks, Inc. (NYSE:PSB) which wholly owned and operated approximately 28 million rentable square feet of commercial space and had an interest in 395 apartments at September 30, 2017.\nAdditional information about Public Storage is available on the Internet. The Company’s web site is PublicStorage.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006910/en/\nPublic Storage\nClemente Teng\n(818) 244-8080, Ext. 1141\nSource: Public Storage", "external_links": ["http://www.businesswire.com/news/home/20180116006910/en/"], "published": "2018-01-17T03:06:00.000+02:00", "crawled": "2018-01-17T02:59:13.028+02:00", "highlightTitle": ""}