{"organizations": [], "uuid": "f7b3e28acfec9205bad17c515ee08a0d060e5d10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104926457-GettyImages-488906561-hotel-maid.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/california-hotel-panic-button-bill-seeks-to-protect-workers-from-assaults.html", "country": "US", "domain_rank": 767, "title": "California hotel 'panic button' bill seeks to protect workers from assaults", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.199, "site_type": "news", "published": "2018-01-03T22:49:00.000+02:00", "replies_count": 0, "uuid": "f7b3e28acfec9205bad17c515ee08a0d060e5d10"}, "author": "Jeff Daniels", "url": "https://www.cnbc.com/2018/01/03/california-hotel-panic-button-bill-seeks-to-protect-workers-from-assaults.html", "ord_in_thread": 0, "title": "California hotel 'panic button' bill seeks to protect workers from assaults", "locations": [], "entities": {"persons": [{"name": "simon dawson", "sentiment": "negative"}, {"name": "al muratsuchi", "sentiment": "none"}, {"name": "assemblyman bill quirk", "sentiment": "none"}], "locations": [{"name": "getty images  two california", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "seatt", "sentiment": "none"}, {"name": "d-torrance", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "assemblymember muratsuchi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Simon Dawson | Bloomberg | Getty Images \nTwo California state lawmakers Wednesday introduced a bill that would require hotels to provide housekeepers with a \"panic button\" to prevent violent assaults and sexual harassment. \nAssemblyman Al Muratsuchi, D-Torrance, jointly introduced the so-called hotel maid \"panic button\" bill with Assemblyman Bill Quirk, D-Hayward. If it gets passed, it would make California the first in the nation to have a statewide law requiring hotels to provide employees working alone in guest rooms with a panic button. \nAlso, the California bill would impose a three-year ban for any guest accused of violence or sexual harassment against an employee and keep a list of those accusations for five years. \n\"Hotel workers often work alone, cleaning room after room — thus making them vulnerable to unwanted sexual advances and worse, victims of assault,\" said Quirk. \"I am proud to be working on this bill with Assemblymember Muratsuchi to not only raise awareness on the issue, but do more to create a safer working environment for hotel workers.\" \nThe city of Seattle previously passed a ballot measure that requires employers to provide hotel housekeepers with panic buttons, and Chicago passed a similar measure last year. The city of Long Beach, California, considered a panic button ordinance too but rejected it late last year. \nThe proposed California legislation follows high-profile sexual assault and harassment charges lodged against high-profile people, including Oscar-winning film producer Harvey Weinstein. On Tuesday, the Los Angeles County District Attorney's Office said it is considering possible criminal charges against Weinstein, who has been accused of sexually harassing or assaulting several women over the years. Weinstein, who has denied all allegations of nonconsensual sex, also is under investigation by authorities in New York. \n\"As we've yet to see the bill in print, we wouldn't have a position yet,\" said Lynn Mohrfeld, a spokesperson for the California Hotel and Lodging Association, the industry's state lobbying organization. \"That said, the safety of guests and hotel employees is a top priority. While no industry is immune to dealing with sexual harassment as the headlines over recent weeks have shown, our industry has in place procedures and protocols for employees around reporting and prevention and these are continuously reviewed and updated.\" \nAdded Mohrfeld, \"As an industry, we will always continue to focus on ensuring hotels are secure places for all those who work and visit them.\" \n\"Hotel employees deserve to feel safe when they are doing their job,\" Muratsuchi said in a statement. \"We have heard much about the danger for hotel maids, who often work in situations that put them at risk of sexual assault or harassment. This would be an important step in keeping those employees safe from harm.\" \nUnite Here Local 1, a union representing hotel workers in the Chicago area, last year released a report in Illinois that found 58 percent of hotel workers surveyed said they had been sexually harassed by a guest . Also, nearly half of all hotel housekeepers surveyed said guests had at one time exposed themselves or answered their door naked. Nearly 500 women working in hotels and casinos were surveyed.", "external_links": [], "published": "2018-01-03T22:49:00.000+02:00", "crawled": "2018-01-03T23:12:13.002+02:00", "highlightTitle": ""}