{"organizations": [], "uuid": "7d2db159897647c4e0a4e2ab9e3ea24a53b23bb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-paccar-achieves-record-annual-revenues-and-strong-profits.html", "country": "US", "domain_rank": 767, "title": "PACCAR Achieves Record Annual Revenues and Strong Profits", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:00:00.000+02:00", "replies_count": 0, "uuid": "7d2db159897647c4e0a4e2ab9e3ea24a53b23bb3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-paccar-achieves-record-annual-revenues-and-strong-profits.html", "ord_in_thread": 0, "title": "PACCAR Achieves Record Annual Revenues and Strong Profits", "locations": [], "entities": {"persons": [{"name": "ron armstrong", "sentiment": "none"}], "locations": [{"name": "wash.", "sentiment": "none"}, {"name": "bellevue", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "paccar", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Increased Truck Market Share and Aftermarket Parts Drive Results\nBELLEVUE, Wash.--(BUSINESS WIRE)-- “PACCAR (Nasdaq: PCAR) reported excellent annual revenues and profitability in 2017. PACCAR achieved its 79 th consecutive year of net income,” said Ron Armstrong, chief executive officer. “PACCAR’s financial results reflect the company’s premium-quality products and services, record heavy-duty truck market share in the U.S. and Canada, record aftermarket parts results and a strong European truck market. I am very proud of our 25,000 employees who have delivered outstanding products and services to our customers.”\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180130005375/en/\nDAF XF and CF - International Truck of the Year 2018 (Photo: Business Wire)\nPACCAR’s profitability and strong cash flow have enabled the company to invest in its core markets and expand its presence in emerging markets. “PACCAR is well-positioned for long-term growth with ongoing investments in new truck models, integrated PACCAR powertrains, enhanced aerodynamic truck designs, advanced driver assistance and truck connectivity technologies, and expanded manufacturing and parts distribution facilities,” added Armstrong.\nExcellent Revenue and Net Income\nPACCAR achieved record quarterly net sales and financial service revenues of $5.45 billion in the fourth quarter 2017 compared to $4.07 billion for the same period in 2016. PACCAR earned $589.2 million ($1.67 per diluted share) for the fourth quarter of 2017, including $173.4 million of net tax benefits resulting from recent changes to U.S. tax law. The one-time net tax benefits include a reduction of net deferred tax liabilities of $304.0 million, partially offset by a tax on accumulated foreign earnings of $130.6 million. Excluding the one-time tax benefits, PACCAR reported adjusted net income (non-GAAP) 1 of $415.8 million ($1.18 per diluted share). The company earned $288.8 million ($.82 per diluted share) in the fourth quarter of 2016.\nPACCAR achieved record revenues of $19.46 billion in 2017, a 14 percent increase compared to revenues of $17.03 billion in 2016. PACCAR earned $1.68 billion ($4.75 per diluted share) in 2017, including the $173.4 million one-time tax benefit. Excluding the one-time tax benefit, PACCAR earned adjusted net income (non-GAAP) 1 of $1.50 billion ($4.26 per diluted share). The company reported annual net income of $521.7 million ($1.48 per diluted share) in 2016, including an $833.0 million non-recurring charge for a European Commission (EC) settlement. Excluding the charge, PACCAR reported adjusted net income (non-GAAP) 1 of $1.35 billion ($3.85 per diluted share) in 2016.\nUnited States Tax Reform Benefit\n“The enacted tax legislation will generate positive cash flow for PACCAR as well as benefit the transportation industry in the United States,” said Harrie Schippers, president and chief financial officer. “The revised corporate tax rate, comparable to other leading OECD countries’ tax rates, and accelerated machinery and equipment depreciation, will likely stimulate increased capital investment in the United States.” PACCAR estimates that its 2018 effective global tax rate will be 23 to 25 percent, compared to approximately 31 percent prior to the new tax law.\nIncreased Dividends\nPACCAR declared cash dividends of $2.19 per share during 2017, including a special dividend of $1.20 per share paid in January 2018. This compares to cash dividends of $1.56 per share declared in 2016. PACCAR’s dividend yield was an excellent 3.1 percent as of December 31, 2017. The company has paid a dividend every year since 1941.\nBusiness Highlights – 2017\nPACCAR delivered 158,900 vehicles worldwide, including a record 29,700 medium-duty trucks. PACCAR invested $697.8 million in capital projects and research and development. DAF CF and XF trucks earned the prestigious “International Truck of the Year 2018” award. Kenworth and Peterbilt achieved record Class 8 retail market share of 30.7 percent in the U.S. and Canada (28.5 percent in 2016). Kenworth and Peterbilt launched the PACCAR front and rear axles and the PACCAR automated transmission in North America. DAF Brasil earned the “Truck Brand of the Year” for the second consecutive year by the Brasilian national dealer association, Fenabrave. The PACCAR Engine Factory in Columbus, Mississippi earned the “2017 Quality Plant of the Year” award from Quality Magazine. PACCAR Parts opened new Parts Distribution Centers in Brisbane, Australia and Panama City, Panama. The PACCAR Innovation Center opened in Silicon Valley, California. PACCAR was honored by InformationWeek magazine for excellence in data analytics.\nFinancial Highlights – Fourth Quarter 2017\nHighlights of PACCAR’s financial results during the fourth quarter of 2017 include:\nRecord quarterly consolidated net sales and revenues of $5.45 billion. Record quarterly worldwide deliveries of 44,300 trucks. Net income of $589.2 million, including $173.4 million of one-time tax benefits. Cash provided by operations of $893.3 million. Record PACCAR Parts revenue of $877.2 million. Record PACCAR Parts pretax income of $157.2 million. Research and development expenses of $70.6 million. Capital investments of $158.0 million.\nFinancial Highlights – Full Year 2017\nHighlights of PACCAR’s financial results during 2017 include:\nRecord consolidated net sales and revenues of $19.46 billion. Net income of $1.68 billion, including $173.4 million of one-time tax benefits. Record PACCAR Parts revenue of $3.33 billion. Record PACCAR Parts pretax income of $614.2 million. Financial Services pretax income of $264.0 million on assets of $13.20 billion. Cash provided by operations of $2.72 billion. Dividends declared of $771.1 million. Medium-term note (MTN) issuances of $1.63 billion. Record stockholders’ equity of $8.05 billion.\nGlobal Truck Markets\nClass 8 truck industry retail sales in the U.S. and Canada were 218,000 units in 2017, compared to 216,000 vehicles sold in 2016. “Truck demand is increasing due to good economic growth, increased consumer spending, and strong commercial and residential construction, which has resulted in record freight tonnage and high fleet capacity utilization. U.S. and Canada Class 8 truck industry retail sales are expected to increase to a range of 235,000-265,000 trucks in 2018,” said Gary Moore, PACCAR executive vice president. “Kenworth and Peterbilt achieved record Class 8 retail market share of 30.7 percent in the U.S. and Canada in 2017, compared to 28.5 percent in 2016. Customers benefited from Kenworth and Peterbilt vehicles’ outstanding fuel efficiency and reliability.”\n“The European economies have grown steadily for four consecutive years, leading to strong transport activity and truck demand,” said Preston Feight, DAF president. “DAF trucks deliver premium quality, low operating costs and superior driver comfort for our customers.” European truck industry sales above 16-tonnes were a robust 306,000 trucks in 2017. It is estimated that European truck industry sales in the above 16-tonne market in 2018 will be another excellent year in the range of 290,000-320,000 trucks.\nPACCAR achieved excellent 2017 truck production and market share in Australia, Mexico, Taiwan and Brasil, delivering 17,600 trucks in these markets and surrounding regions. “DAF Brasil was honored in 2017 by Fenabrave, Brasil’s industry dealer association, as the most desired truck brand in Brasil for the second consecutive year,” said Marco Davila, PACCAR vice president.\nDAF XF and CF Trucks Earn “International Truck of the Year 2018” Award\nThe new DAF XF and CF trucks earned the “International Truck of the Year 2018” award, as judged by an independent jury of leading transportation journalists from 23 European countries. The award is presented to a new truck or model range that has made the largest contribution to road transportation efficiency based on several criteria, including technological innovation, driver comfort, safety, fuel efficiency, environmental leadership and low total cost of ownership. The new DAF XF and CF trucks deliver seven percent greater fuel efficiency and feature enhanced PACCAR MX-13 and MX-11 engines. Customers’ vehicles can carry up to 220 lbs. of additional payload due to lighter-weight powertrain components and exhaust systems.\n“Earning the Truck of the Year award reflects DAF’s industry-leading quality and transportation solutions that enhance customers’ operational efficiency,” commented Ron Borsboom, DAF chief engineer. “It is a wonderful recognition for DAF’s employees, dealers and suppliers.”\nPeterbilt Celebrates 1,000,000 th Truck Delivery\nPeterbilt produced its 1,000,000 th truck in January. The truck was a Peterbilt Model 567 Heritage, customized to celebrate this milestone. “Peterbilt is the industry leader in product quality and customer value,” said Kyle Quinn, PACCAR senior vice president and Peterbilt general manager. “Peterbilt’s 78-year quality legacy bridges customers from owner-operators to large fleets – each of them benefits from Peterbilt’s premium quality, advanced technology, high residual value and low total cost of ownership.”\nPACCAR Parts Achieves Record Results\nPACCAR’s aftermarket parts business achieved record fourth quarter pre-tax income of $157.2 million, 14 percent higher than the $137.5 million earned in the fourth quarter of 2016. Fourth quarter 2017 revenues were a record $877.2 million, compared to $765.0 million reported in the fourth quarter of 2016. Annual revenues were $3.33 billion, 11 percent higher than the $3.01 billion in revenues in 2016. David Danforth, PACCAR vice president and PACCAR Parts general manager, noted, “PACCAR Parts’ business growth has been driven by investments in distribution and technology, initiatives such as the TRP all-makes parts stores and a growing population of Kenworth, Peterbilt and DAF trucks, powered by PACCAR engines.”\nPACCAR Parts’ 18 Distribution Centers (PDCs) support over 2,100 DAF, Kenworth and Peterbilt dealer locations to deliver industry-leading customer service. PACCAR opened new distribution centers in Brisbane, Australia and Panama City, Panama in 2017, to enhance parts availability for customers in those markets. PACCAR will open a new 160,000 square-foot distribution center in Toronto, Canada in 2018.\nIncreased Investments in Products, Technologies and Aftermarket Support\nPACCAR’s consistent long-term profits, strong balance sheet, and intense focus on quality, technology and productivity have enabled the company to invest $6.1 billion in new and expanded facilities, innovative products and new technologies during the past decade. Capital of $433.1 million and research and development expenses of $264.7 million in 2017 were invested in new vehicles and technologies, enhanced manufacturing and parts distribution facilities and innovative aftermarket support programs. George West, PACCAR vice president, said, “We are increasing our capital and research and development investments in 2018. Capital expenditures are projected to be $425-$475 million and research and development expenses are estimated to be $280-$310 million. PACCAR is investing for long-term growth in new truck models, integrated powertrains including zero emission electrification and hydrogen fuel cell technologies, enhanced aerodynamic truck designs, advanced driver assistance systems and truck connectivity, and expanded manufacturing and parts distribution facilities.”\nPACCAR participated in the CES 2018 show in Las Vegas, Nevada this month, exhibiting an autonomous Peterbilt Model 579, a zero emission, hydrogen fuel cell Kenworth T680, and a PACCAR Parts delivery drone.\nFinancial Services Companies Achieve Good Annual Results\nPACCAR Financial Services (PFS) has a portfolio of 188,000 trucks and trailers, with total assets of $13.20 billion. PacLease, a major full-service truck leasing company in North America and Europe with a fleet of over 38,000 vehicles, is included in this segment. PFS achieved fourth quarter 2017 pretax income of $72.5 million compared to $77.9 million earned in the fourth quarter of 2016. Fourth quarter 2017 revenues were $332.2 million compared to $303.7 million in the same quarter of 2016. PFS earned $264.0 million of pretax profit in 2017 compared to $306.5 million in 2016, and revenues were $1.27 billion in 2017 compared to $1.19 billion in 2016.\n“PFS’ excellent portfolio performance contributed to good results in 2017,” said Bob Bengston, PACCAR senior vice president. “Industry demand for used trucks in the U.S. is strong. Kenworth and Peterbilt truck resale values continue to command a 10-20 percent premium over competitors’ trucks.”\n“PACCAR’s strong balance sheet, complemented by its A+/A1 credit ratings, enables PFS to offer competitive retail financing to Kenworth, Peterbilt and DAF dealers and customers in 24 countries on four continents,” said Todd Hubbard, PACCAR Financial Corp. president. PACCAR Financial Services has excellent access to the debt markets, issuing $1.63 billion in three-, four- and five-year term notes during 2017.\nPACCAR is a global technology leader in the design, manufacture and customer support of high-quality light-, medium- and heavy-duty trucks under the Kenworth, Peterbilt and DAF nameplates. PACCAR also designs and manufactures advanced diesel engines, provides financial services and information technology, and distributes truck parts related to its principal business.\nPACCAR will hold a conference call with securities analysts to discuss fourth quarter earnings on January 30, 2018, at 9:00 a.m. Pacific time. Interested parties may listen to the call by selecting “Q4 Earnings Webcast” at PACCAR’s homepage. The webcast will be available on a recorded basis through February 6, 2018. PACCAR shares are traded on the Nasdaq Global Select Market, symbol PCAR. Its homepage is www.paccar.com .\nThis release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act. These statements are based on management’s current expectations and are subject to uncertainty and changes in circumstances. Actual results may differ materially from those included in these statements due to a variety of factors. More information about these factors is contained in PACCAR’s filings with the Securities and Exchange Commission.\n1 See attached supplementary information for non-GAAP financial measures.\nPACCAR Inc SUMMARY STATEMENTS OF OPERATIONS (in millions except per share amounts) Three Months Ended Year Ended December 31 December 31 2017 2016 2017 2016 Truck, Parts and Other: Net sales and revenues $ 5,122.4 $ 3,767.0 $ 18,187.5 $ 15,846.6 Cost of sales and revenues 4,409.5 3,243.2 15,593.7 13,517.7 Research and development 70.6 67.6 264.7 247.2 Selling, general and administrative 117.5 114.8 449.5 440.8 European Commission charge 833.0 Interest and other expense, net 2.5 7.4 5.6 11.6 Truck, Parts and Other Income Before Income Taxes\n522.3 334.0 1,874.0 796.3 Financial Services: Revenues 332.2 303.7 1,268.9 1,186.7 Interest and other 228.6 197.4 877.1 762.4 Selling, general and administrative 26.2 24.5 105.5 99.4 Provision for losses on receivables 4.9 3.9 22.3 18.4 Financial Services Income Before Income Taxes 72.5 77.9 264.0 306.5 Investment income 9.5 7.0 35.3 27.6 Total Income Before Income Taxes 604.3 418.9 2,173.3 1,130.4 Income taxes (a) 15.1 130.1 498.1 608.7 Net Income $ 589.2 $ 288.8 $ 1,675.2 $ 521.7 Net Income Per Share: Basic $ 1.67 $ .82 $ 4.76 $ 1.49 Diluted $ 1.67 $ .82 $ 4.75 $ 1.48 Weighted Average Shares Outstanding: Basic 352.2 351.1 351.9 351.1 Diluted 353.2 351.9 352.9 351.8 Dividends declared per share $ 1.45 $ .84 $ 2.19 $ 1.56 (a) Includes a one-time net tax benefit of $173.4 million in the three months ended December 31, 2017 from the new U.S. tax law.\nPACCAR Inc CONDENSED BALANCE SHEETS (in millions)\nDecember 31\nDecember 31 2017 2016 ASSETS Truck, Parts and Other: Cash and marketable debt securities $ 3,621.9 $ 2,922.6 Trade and other receivables, net 1,127.9 862.2 Inventories, net 928.4 727.8 Property, plant and equipment, net 2,464.4 2,260.0 Equipment on operating leases and other, net 2,095.3 1,671.5 Financial Services Assets 13,202.3 12,194.8 $ 23,440.2 $ 20,638.9 LIABILITIES AND STOCKHOLDERS' EQUITY Truck, Parts and Other: Accounts payable, deferred revenues and other $ 5,270.4 $ 4,056.2 Financial Services Liabilities 10,119.3 9,805.1 STOCKHOLDERS' EQUITY 8,050.5 6,777.6 $ 23,440.2 $ 20,638.9 Common Shares Outstanding 351.8 350.7 PACCAR Inc CONDENSED CASH FLOW STATEMENTS (in millions) Year Ended December 31 2017 2016 OPERATING ACTIVITIES: Net income $ 1,675.2 $ 521.7 Depreciation and amortization: Property, plant and equipment 321.4 302.4 Equipment on operating leases and other 786.1 690.7 Net change in trade receivables, inventory and payables (23.5 ) (6.3 ) Net (increase) decrease in wholesale receivables on new trucks (272.0 ) 401.6 All other operating activities, net 228.6 390.7 Net Cash Provided by Operating Activities 2,715.8 2,300.8 INVESTING ACTIVITIES: Payments for property, plant and equipment (423.4 ) (375.2 ) Acquisitions of equipment for operating leases (1,423.2 ) (1,589.7 ) Net increase in financial services receivables (397.9 ) (306.6 ) Net (increase) decrease in marketable debt securities (190.8 ) 272.9 Proceeds from asset disposals 470.7 434.3 Net Cash Used in Investing Activities (1,964.6 ) (1,564.3 ) FINANCING ACTIVITIES: Payments of cash dividends (558.3 ) (829.3 ) Purchases of treasury stock (70.5 ) Proceeds from stock compensation transactions 39.3 29.4 Net increase in debt 125.2 46.9 Net Cash Used in Financing Activities (393.8 ) (823.5 ) Effect of exchange rate changes on cash 91.6 (13.7 ) Net Increase (Decrease) in Cash and Cash Equivalents 449.0 (100.7 ) Cash and cash equivalents at beginning of period 1,915.7 2,016.4 Cash and cash equivalents at end of period $ 2,364.7 $ 1,915.7 PACCAR Inc SEGMENT AND OTHER INFORMATION (in millions) Three Months Ended Year Ended December 31 December 31 2017 2016 2017 2016 Sales and Revenues: Truck $ 4,223.7 $ 2,984.9 $ 14,774.8 $ 12,767.3 Parts 877.2 765.0 3,327.0 3,005.7 Financial Services 332.2 303.7 1,268.9 1,186.7 Other 21.5 17.1 85.7 73.6 $ 5,454.6 $ 4,070.7 $ 19,456.4 $ 17,033.3 Pretax Profit: Truck $ 374.1 $ 207.4 $ 1,296.9 $ 1,125.8 Parts 157.2 137.5 614.2 543.8 Financial Services 72.5 77.9 264.0 306.5 European Commission Charge (833.0 ) Investment Income and Other .5 (3.9 ) (1.8 ) (12.7 ) $ 604.3 $ 418.9 $ 2,173.3 $ 1,130.4 GEOGRAPHIC REVENUE (in millions) Three Months Ended Year Ended December 31 December 31 2017 2016 2017 2016 United States and Canada $ 3,119.4 $ 2,197.6 $ 11,772.2 $ 10,065.9 Europe 1,661.0 1,302.0 5,354.6 4,903.3 Other 674.2 571.1 2,329.6 2,064.1 $ 5,454.6 $ 4,070.7 $ 19,456.4 $ 17,033.3 NEW TRUCK DELIVERIES Three Months Ended Year Ended December 31 December 31 2017 2016 2017 2016 United States and Canada 22,700 14,400 84,200 71,500 Europe 16,600 14,800 57,100 53,000 Other 5,000 4,700 17,600 16,400 44,300 33,900 158,900 140,900 PACCAR Inc SUPPLEMENTARY INFORMATION RECONCILIATION OF GAAP TO NON-GAAP FINANCIAL MEASURES This earnings release includes “adjusted net income (non-GAAP)” and “adjusted net income per diluted share (non-GAAP)”, which are financial measures that are not in accordance with U.S. generally accepted accounting principles (“GAAP”), since they exclude the one-time tax benefit from the Tax Cuts and Jobs Act (\"new U.S. tax law\") in 2017 and the non-recurring European Commission charge in 2016. These measures differ from the most directly comparable measures calculated in accordance with GAAP and may not be comparable to similarly titled non-GAAP financial measures used by other companies. Management utilizes these non-GAAP measures to evaluate the Company’s performance and believes these measures allow investors and management to evaluate operating trends by excluding significant non-recurring items that are not representative of underlying operating trends. Reconciliations from the most directly comparable GAAP measures of: adjusted net income (non-GAAP) and adjusted net income per diluted share (non-GAAP) are as follows: (in millions) Year Ended December 31, 2017 2016 Net Income $ 1,675.2 $ 521.7 One-time tax benefit from the new U.S. tax law (173.4) Non-recurring European Commission Charge 833.0 Adjusted Net Income (Non-GAAP) $ 1,501.8 $ 1,354.7 Year Ended December 31 2017 2016 Per Diluted Share: Net Income $ 4.75 $ 1.48 One-time tax benefit from the new U.S. tax law (.49) Non-recurring European Commission Charge 2.37 Adjusted Net Income (Non-GAAP) $ 4.26 $ 3.85 (in millions) Three Months Ended December 31, 2017 Net Income $ 589.2 One-time tax benefit from the new U.S. tax law (173.4) Adjusted Net Income (Non-GAAP) $ 415.8 Three Months Ended December 31, 2017 Per Diluted Share: Net Income $ 1.67 One-time tax benefit from the new U.S. tax law (.49) Adjusted Net Income (Non-GAAP) $ 1.18\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005375/en/\nPACCAR Inc\nKen Hastings, 425-468-7530\nSource: PACCAR Inc", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.paccar.com&esheet=51750613&newsitemid=20180130005375&lan=en-US&anchor=www.paccar.com&index=1&md5=c02053171bd70e59cfcda67f22bcbde1", "http://www.businesswire.com/news/home/20180130005375/en/"], "published": "2018-01-30T16:00:00.000+02:00", "crawled": "2018-01-30T17:50:51.014+02:00", "highlightTitle": ""}