{"organizations": [], "uuid": "272bfc8646c98fe784bf7578c421a288517dada0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939344-GettyImages-859515602.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/shark-tanks-daymond-john-heres-how-to-look-good-and-succeed-at-work.html", "country": "US", "domain_rank": 767, "title": "'Shark Tank's' Daymond John: Here's how to look good (and succeed) at work", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-11T18:24:00.000+02:00", "replies_count": 0, "uuid": "272bfc8646c98fe784bf7578c421a288517dada0"}, "author": "Ali Montag", "url": "https://www.cnbc.com/2018/01/11/shark-tanks-daymond-john-heres-how-to-look-good-and-succeed-at-work.html", "ord_in_thread": 0, "title": "'Shark Tank's' Daymond John: Here's how to look good (and succeed) at work", "locations": [], "entities": {"persons": [{"name": "daymond john", "sentiment": "negative"}, {"name": "john", "sentiment": "none"}, {"name": "eric mccandless", "sentiment": "none"}], "locations": [], "organizations": [{"name": "abc", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Everyone wants to look their best at work , but we can all admit to missing the mark some days.\nDaymond John, \"Shark Tank\" investor and the author of upcoming book, \" Rise and Grind: Outperform, Outwork, and Outhustle Your Way to a More Successful and Rewarding Life ,\" is an expert at how to look good. He turned $40 into his successful apparel brand, Fubu.\nPresenting yourself well is about more than just impressing your co-workers, he explains. It's something that can impact your career.\nEric McCandless | ABC | Getty Images \"Remember, people employ you because they want to be around people like them,\" John tells CNBC Make It.\nThat means dressing to match the standard of the office, and carrying yourself with pride.\n\"If you're somebody that is a team player, and you're dressed appropriately, and you're always welcoming to people, and they want to be around you ... then you'll hopefully be able to grow in the company,\" he explains.\nTo get started, here are a few of his top tips to appear polished.\nFirst up, your hands. \"Manicure your nails, and or take care of your nails,\" he says. Next, people will notice what is on your feet. \"If you don't have the money to have really great shoes, shine them.\"\nThen, of course, there is smell.\n\"Trust me, body odor is a part of it too,\" John adds. Cleanliness, in general, is crucial.\n\"Keep your clothes really, really clean if you can,\" he continues. To get your wardrobe started, invest in basic items you can use to create several outfits. \"If you have a limited budget, try to get a bunch of ties, your standard black, standard navy, blazers, and then a bunch of pants and you can mix and match.\"\nIf blazers and ties are too formal for your office, you can steer clear. But, even in an office with a casual culture, you can put in the effort to be professional.\n\"Dress appropriately,\" John says. Although you may work at \"a software company where people are coding and they're in hoodies and sweats,\" that doesn't mean you \"always have to look like the sloppiest person in the world.\"\nAppearance counts, but your overall demeanor in the office and the way you treat other people will carry more weight, John says.\n\"More importantly than dress, it's always going to be your attitude about how you present yourself,\" John explains. \"People will notice your dress here and there, but they're going to remember how you stand up, how you speak.\n\"Don't be the person with their headphones on all the time.\"\nTo put it simply: \"If you have the greatest resume in the world, and you are wearing a three-piece suit but you're an a---hole, you're going to get fired,\" John says. \"No matter what.\"\nDon't miss: Why 'Shark Tank's' Daymond John refuses to watch football or binge on 'Game of Thrones'\nLike this story? Like CNBC Make It on Facebook !\nVideo by Beatriz Bajuelos Castillo\nshow chapters This is the reason Daymond John doesn’t binge-watch TV 11:00 AM ET Mon, 1 Jan 2018 | 01:06 Disclosure: CNBC owns the exclusive off-network cable rights to \"Shark Tank.\"", "external_links": [], "published": "2018-01-11T18:24:00.000+02:00", "crawled": "2018-01-11T18:34:52.002+02:00", "highlightTitle": ""}