{"organizations": [], "uuid": "c288cdb5a25057f1de90eb33eb43720c956850bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220721322&w=1200&r=LYNXMPEE09064", "site_section": "http://feeds.reuters.com/reuters/environment/", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-china-pollution/china-says-28-northern-cities-met-late-2017-anti-smog-targets-idUSKBN1EZ0BD", "country": "US", "domain_rank": 408, "title": "China says 28 northern cities met late 2017 anti-smog targets", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T06:20:00.000+02:00", "replies_count": 0, "uuid": "c288cdb5a25057f1de90eb33eb43720c956850bb"}, "author": "", "url": "https://www.reuters.com/article/us-china-pollution/china-says-28-northern-cities-met-late-2017-anti-smog-targets-idUSKBN1EZ0BD", "ord_in_thread": 0, "title": "China says 28 northern cities met late 2017 anti-smog targets", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "min read  shanghai", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "ministry of environmental protection", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 4:18 AM / Updated 13 hours ago China says 28 northern cities met late 2017 anti-smog targets Reuters Staff 3 Min Read \nSHANGHAI (Reuters) - All 28 Chinese cities in a demanding winter anti-smog campaign met their air quality targets from October to December, but weather conditions could pose challenges in early 2018, the environment ministry said on Wednesday. \nThe 28 northern cities were ordered to cut concentrations of small, breathable particles known as PM2.5 by 10-25 percent during October 2017-March 2018. They have been curbing industrial output, thinning traffic and cracking down on coal use in a bid to limit smog build-ups. \nThe Ministry of Environmental Protection (MEP) said that all the cities exceeded their targets in the final three months of 2017, with average concentrations across the region hitting 71 micrograms per cubic meter, down 34.3 percent from a year earlier. \nBut the ministry, citing meteorologists, said unfavorable weather, including relatively warm temperatures, is expected to make smog dispersal more difficult in January and February. \nIt said Shijiazhuang, one of China’s most polluted cities and the capital of heavily industrial Hebei province, saw the biggest improvement in late 2017, with PM2.5 falling 54.8 percent on an annual basis for October-December, more than double its 25 percent target. \nAverage PM2.5 concentrations in Shijiazhuang remained at 85 micrograms, higher than China’s 35 microgram standard as well as the 10 micrograms recommended by the World Health Organization. \nThe capital, Beijing, saw PM2.5 drop 53.8 percent during the three months. City environmental officials said last week that drier and windier weather conditions were a contributing factor. \nThe six-month campaign to curb winter air pollution in northern China had appeared to start slowly, with only four of the 28 cities meeting their October targets. \nBut an inspection and enforcement campaign - widely seen as China’s toughest to date - began to have a significant impact in November, even after the predominantly coal-fired winter heating system was activated. \nWhile China met its 2017 air quality targets, the winter campaign has not been without controversy, with businesses complaining about overzealous “one size fits all” crackdowns as well as gas supply disruptions. \nResidents have also complained about surging gas prices and supply shortages. Reporting by David Stanway; Editing by Richard Borsuk", "external_links": [], "published": "2018-01-10T06:20:00.000+02:00", "crawled": "2018-01-10T06:42:41.050+02:00", "highlightTitle": ""}