{"organizations": [], "uuid": "1d96e5d2f01be9220cb57c2a2f0d6386e05a21d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-nephros-announces-preliminary-financial-results-for-fourth-quarter-2017.html", "country": "US", "domain_rank": 767, "title": "Nephros Announces Preliminary Financial Results for Fourth Quarter 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T15:30:00.000+02:00", "replies_count": 0, "uuid": "1d96e5d2f01be9220cb57c2a2f0d6386e05a21d3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-nephros-announces-preliminary-financial-results-for-fourth-quarter-2017.html", "ord_in_thread": 0, "title": "Nephros Announces Preliminary Financial Results for Fourth Quarter 2017", "locations": [], "entities": {"persons": [{"name": "nephros", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nephros announces preliminary financial results", "sentiment": "negative"}, {"name": "nephros, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Anticipates Over 80% Year-over-Year Product Revenue Growth for the Quarter\nSOUTH ORANGE, NJ, Jan. 04, 2018 (GLOBE NEWSWIRE) -- Nephros, Inc. (OTCQB:NEPH), a commercial stage medical device company that develops and sells high performance liquid purification ultrafilters and an on-line mid-dilution hemodiafiltration (HDF) system for use with a hemodialysis (HD) machine for the treatment of patients with End Stage Renal Disease (ESRD), today announced preliminary financial results for the fourth quarter of 2017.\nNephros expects product revenue for the fourth quarter ended December 31, 2017, to be approximately $1,258,000, an increase of approximately 83% over the same period in 2016. Total revenue for the quarter ended December 31, 2017 is projected to exceed $1,300,000, an increase of more than 75% over the same period in 2016.\nNet cash used in operating activities for the fourth quarter 2017 is expected to be approximately $38,000 including approximately $65,000 of cash paid for interest on outstanding notes. Nephros ended the quarter with approximately $2.2 million in cash.\n“While we have a long way to go to reach our full potential, we continue to gain traction in the market with our product offerings and to successfully compete for large, multi-year filtration contracts,” said Daron Evans, CEO of Nephros. “In addition to solid quarterly revenue growth and a strong year-end cash balance, we were essentially cash flow neutral from an operational basis this quarter. For 2018, we foresee a continuation of our growth in medical filter sales, an expansion of our commercial and industrial filter sales, and the ability to invest proceeds into our second generation HDF system.”\nAbout Nephros, Inc.\nNephros is a commercial stage medical device company that develops and sells high performance liquid purification filters, as well as a hemodiafiltration system for the treatment of patients with End Stage Renal Disease. Nephros filters or ultrafilters are used primarily in medical applications in various settings. These ultrafilters are used by dialysis centers for assisting in the added removal of biological contaminants from the water and bicarbonate concentrate supplied to hemodialysis machines and the patients. Additionally, Nephros ultrafilters are used in hospitals and medical clinics for added protection in retaining bacteria (i.e. Legionella, Pseudomonas), virus and endotoxin from water. These ultrafilters provide barriers that assist in improving infection control with showers, sinks, and ice machines.\nFor more information about Nephros, please visit the company’s website at www.nephros.com .\nForward-Looking Statements\nThis release contains forward-looking statements that are subject to various risks and uncertainties. Such statements include statements regarding the Company’s expected financial results for the quarter ended December 31, 2017, its expected growth in medical, commercial and industrial filter sales, anticipated investment in the development of a second generation HDF system and other statements that are not historical facts, including statements which may be accompanied by the words “intends,” “may,” “will,” “plans,” “expects,” “anticipates,” “projects,” “predicts,” “estimates,” “aims,” “believes,” “hopes,” “potential” or similar words. Actual results could differ materially from those described in these forward-looking statements due to certain factors, including uncertainty in clinical outcomes, potential delays in the regulatory approval process, changes in business, economic and competitive conditions, the availability of capital when needed, our dependence on third party manufacturers and researchers, regulatory reforms, uncertainties in litigation or investigative proceedings, and the availability of financing. These and other risks and uncertainties are detailed in Nephros Inc.’s reports filed with the U.S. Securities and Exchange Commission, including with respect to Nephros, its Annual Report on Form 10-K for the year ended December 31, 2016. Nephros, Inc. does not undertake any responsibility to update the forward-looking statements in this release.\nContact: Investor Relations Contact: Andy Astor CFO, Nephros info@nephros.com +1 201 343 5202\nSource:Nephros, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/6c75ab1a-7b85-4eb2-a084-418e048b27fd"], "published": "2018-01-04T15:30:00.000+02:00", "crawled": "2018-01-04T20:05:50.009+02:00", "highlightTitle": ""}