{"organizations": [], "uuid": "c21325ead0721e4a0b2e4f86f6f191a541c03c7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221246839&w=1200&r=LYNXMPEE0A1U5", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-texas-education/texas-failed-to-educate-monitor-disabled-students-federal-report-idUSKBN1F02WP", "country": "US", "domain_rank": 408, "title": "Texas failed to educate, monitor disabled students: federal report", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T23:24:00.000+02:00", "replies_count": 0, "uuid": "c21325ead0721e4a0b2e4f86f6f191a541c03c7b"}, "author": "", "url": "https://www.reuters.com/article/us-texas-education/texas-failed-to-educate-monitor-disabled-students-federal-report-idUSKBN1F02WP", "ord_in_thread": 0, "title": "Texas failed to educate, monitor disabled students: federal report", "locations": [], "entities": {"persons": [{"name": "betsy devos", "sentiment": "none"}, {"name": "jon herskovitz", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}], "organizations": [{"name": "texas education agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. department of education", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 23 PM / in 11 minutes Texas failed to educate, monitor disabled students: federal report Jon Herskovitz 3 Min Read \nAUSTIN, Texas (Reuters) - Texas violated federal law by failing to identify and educate students with disabilities and deliberately working to decrease the number of students enrolled in special education programs, the U.S. Department of Education said in a report on Thursday. \nThe report concluded that Texas ran afoul of federal law by failing to locate students in need of special education, failing to ensure free public education was made available to children with disabilities and failing to adequately supervise and monitor the state’s special education program. \nTexas has the second-largest U.S. public school system, with about 5 million students. \n“Far too many students in Texas had been precluded from receiving supports and services under the Individuals with Disabilities Education Act,” U.S. Education Secretary Betsy DeVos said in a statement. \nThe policies of the Texas Education Agency (TEA) drew federal scrutiny after a 2016 investigation by the Houston Chronicle newspaper. The Chronicle revealed that many school districts delayed or denied services to special education students to meet an agency benchmark of capping their enrollment in the systems at 8.5 percent of the student population. \nProviding an education for students with disabilities is costlier than for other students. The policy saved the state agency billions of dollars but denied education services to children with autism, dyslexia, attention deficit hyperactivity disorder, epilepsy, mental illnesses, speech impediments, traumatic brain injuries, blindness and deafness, the newspaper said. \nThe stinging assessment from Republican President Donald Trump’s administration prompted Republican Texas Governor Greg Abbott on Thursday to order the state’s education agency to take immediate steps to fix the problem. \n“The past dereliction of duty on the part of many school districts to serve our students, and the failure of TEA to hold districts accountable, are worthy of criticism,” Abbott said in a statement. \nThe Texas Education Agency said it will work with the governor to “take swift and immediate action to address findings in the report.” \nThe Chronicle reported that the practice of denying and delaying special education lasted for more than a decade, starting in 2004. After the policy was implemented, the rate of Texas children receiving special education plummeted from near the national average of 13 percent to the lowest in the country, the newspaper reported. Reporting by Jon Herskovitz; Editing by Colleen Jenkins and Will Dunham", "external_links": [], "published": "2018-01-11T23:24:00.000+02:00", "crawled": "2018-01-11T23:36:48.008+02:00", "highlightTitle": ""}