{"organizations": [], "uuid": "e7fce2d5280599585e29d44405e7990ba2032430", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-midocean-partners-adds-david-kieselstein-to-executive-board.html", "country": "US", "domain_rank": 767, "title": "MidOcean Partners Adds David Kieselstein to Executive Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:00:00.000+02:00", "replies_count": 0, "uuid": "e7fce2d5280599585e29d44405e7990ba2032430"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-midocean-partners-adds-david-kieselstein-to-executive-board.html", "ord_in_thread": 0, "title": "MidOcean Partners Adds David Kieselstein to Executive Board", "locations": [], "entities": {"persons": [{"name": "david kieselstein", "sentiment": "negative"}, {"name": "kieselstein", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "executive board", "sentiment": "negative"}, {"name": "midocean partners", "sentiment": "negative"}, {"name": "business services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- MidOcean Partners (“MidOcean”), a premier middle market private equity firm focused on consumer and business services, today announced that David Kieselstein has joined MidOcean’s Executive Board, effective January 1, 2018. Mr. Kieselstein is serving as Vice Chairman, Business Services, and will work with the firm's Executive Board to provide strategic guidance to MidOcean’s portfolio companies. As Vice Chairman, Business Services, Mr. Kieselstein will also work closely with the MidOcean investment team in the sourcing, evaluation and execution of new business services investments.\nMidOcean has developed a strong and active Executive Board, which is comprised of influential senior executives who have experience running large companies within MidOcean’s target sectors. These leading industry executives, who previously served as Chairpersons, CEOs and in other senior management positions with leading companies and government entities, provide operational expertise and unique insights, including in-depth knowledge of industry dynamics, competitive landscapes and trends, that guide MidOcean’s investment themes and value creation strategies.\nMr. Kieselstein, who is recognized for his innovation and operational expertise in information services, most recently served as CEO of former MidOcean portfolio company Penton prior to its acquisition by Informa PLC in November 2016 for $1.6 billion. “David Kieselstein served as an outstanding leader of Penton over the past several years, helping us transform the business from a traditional print-based publisher into a leading professional information services business,” said Barrett Gilmer, Managing Director of MidOcean. “Not only has David successfully built and transformed some of the best-known B2B and consumer media brands and companies in the world, he has demonstrated an ability to turn around a company’s performance and build value for shareholders. We are very fortunate to add David’s tremendous strategic vision to our Executive Board.”\nMr. Kieselstein added, “I am honored to join the MidOcean Executive Board and look forward to collaborating with Ted Virtue, Barrett Gilmer and the rest of the MidOcean team to drive further transformative growth within the MidOcean portfolio and develop differentiated investment themes.”\nPrior to taking the helm at Penton, Mr. Kieselstein served as Chief Executive Officer, North America of TNS, a division of WPP which provides high-quality market research insights to Fortune 500 clients in virtually all industries. During his tenure at TNS, he embarked on a full transformation of the company’s operations, which resulted in a significant improvement in profitability across TNS.\nFrom 2006 to 2008, Mr. Kieselstein led Dun & Bradstreet’s Small Business Division, the company’s largest and fastest growing division. While at Dun & Bradstreet, Mr. Kieselstein integrated three distinct operations into a single, customer-centric business unit, and he launched several new product suites that accelerated overall performance.\nPrior to Dun & Bradstreet, Kieselstein served in a range of key leadership roles at Time Warner. As Chief Executive of the Parenting Media Group, he repositioned the Parenting brand, resulting in 30% revenue growth and the unseating of the long-time category leader within 18 months. As President and Chief Executive of the Personal Finance Media Group, Kieselstein created a partnership with CNN that resulted in the creation of CNNMoney, one of the world’s most successful personal finance web properties. Earlier in his career, he also held a number of marketing management positions at FORTUNE Magazine, and launched Time Inc.’s centralized direct marketing and database division.\nMr. Kieselstein holds an MBA from Northwestern University’s Kellogg Graduate School of Management, where he serves on the Alumni Board. He received his BA in Economics from Binghamton University.\nAbout MidOcean Partners\nEstablished in 2003, MidOcean Partners is a premier New York-based alternative asset manager that specializes in middle market private equity and alternative credit investments. Since inception, the focus of the private equity funds has been on high-quality middle market companies with attractive strategic, operational and financial growth opportunities in the consumer and business services sectors. MidOcean Credit Partners was launched in 2009 and manages approximately $6.9 billion across a series of alternative credit strategies, collateralized loan obligations (“CLOs”), and customized separately managed accounts as of November 30, 2017. For more information, please visit MidOcean’s website ( www.midoceanpartners.com ).\n //www.businesswire.com/news/home/20180109006367/en/\nMedia Relations:\nMidOcean Partners\nBradley Tipper\nIR@midoceanpartners.com\nSource: MidOcean Partners", "external_links": ["http://www.businesswire.com/news/home/20180109006367/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.midoceanpartners.com&esheet=51740384&newsitemid=20180109006367&lan=en-US&anchor=www.midoceanpartners.com&index=1&md5=4494dcb05d6bd55e8a9b6bddb1598726"], "published": "2018-01-09T20:00:00.000+02:00", "crawled": "2018-01-09T21:16:25.037+02:00", "highlightTitle": ""}