{"organizations": [], "uuid": "72798edb155e343c170dde05ce9e5db2e9b5f867", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222803052&w=1200&r=LYNXMPEE0G1K6", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-eurozone-germany-centeno/eurogroups-centeno-urges-completion-of-bank-union-backs-euro-zone-budget-idUKKBN1F62IM", "country": "US", "domain_rank": 408, "title": "Eurogroup's Centeno urges completion of bank union, backs euro zone budget", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T20:50:00.000+02:00", "replies_count": 0, "uuid": "72798edb155e343c170dde05ce9e5db2e9b5f867"}, "author": "", "url": "https://uk.reuters.com/article/uk-eurozone-germany-centeno/eurogroups-centeno-urges-completion-of-bank-union-backs-euro-zone-budget-idUKKBN1F62IM", "ord_in_thread": 0, "title": "Eurogroup's Centeno urges completion of bank union, backs euro zone budget", "locations": [], "entities": {"persons": [{"name": "centeno", "sentiment": "negative"}, {"name": "mario centeno", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "finance ministry", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 6:51 PM / Updated 5 minutes ago Eurogroup's Centeno urges completion of bank union, backs euro zone budget Reuters Staff 2 Min Read \nBERLIN (Reuters) - The euro zone must complete its banking union by introducing a bank deposit insurance scheme and should have a fiscal capacity which would help countries tackle crises not of their own making, the new chairman of euro zone finance ministers said. \nSpeaking at the German finance ministry, Portuguese Finance Minister Mario Centeno, who took the reins of the euro zone’s most powerful economic policy-making body only last week, said he realised the setting up of the deposit insurance scheme would take time. \n“Completing the banking union should be a top priority,” Centeno said. \nThe Banking union now only lacks a common deposit insurance scheme but introducing it is politically difficult because Germany is concerned that with high ratios of bad loans in various banking sectors across Europe, German savers may be first to be asked to help pay depositors elsewhere. \n“This process does not need to come with a cost for domestic insurance schemes, but needs to be seen in a complementary way,” Centeno said. “I believe a first step of a long, step-by-step controlled process will be enough to generate a new wave of confidence in the markets.” \nHe also backed the idea of creating a euro zone pool of money, called a “fiscal capacity”, that could be used to help countries that are fighting crises not of their own making, called “external shocks” in EU jargon. \n“We should also continue discussing other ideas, which have a longer-term horizon, such as a common fiscal capacity of a reasonable and realistic size,” he said. \n“To be clear: a common fiscal capacity does not entail permanent transfers – there are no proposals aiming at that. And it has to be designed in a way to avoid moral hazard,” he said, addressing another German sensitivity. Reporting By Joseph Nasr, writing by Jan Strupczewski", "external_links": [], "published": "2018-01-17T20:50:00.000+02:00", "crawled": "2018-01-17T21:23:16.009+02:00", "highlightTitle": ""}