{"organizations": [], "uuid": "2e3ddf98f7b3341d8b03641d895b8adb44034b80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-bonds-pensionfunds/rpt-column-bond-bear-market-not-if-pension-funds-can-help-it-mcgeever-idUSL8N1PJ3VB", "country": "US", "domain_rank": 408, "title": "RPT-COLUMN-Bond bear market? Not if pension funds can help it: McGeever", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T09:17:00.000+02:00", "replies_count": 0, "uuid": "2e3ddf98f7b3341d8b03641d895b8adb44034b80"}, "author": "", "url": "https://www.reuters.com/article/global-bonds-pensionfunds/rpt-column-bond-bear-market-not-if-pension-funds-can-help-it-mcgeever-idUSL8N1PJ3VB", "ord_in_thread": 0, "title": "RPT-COLUMN-Bond bear market? Not if pension funds can help it: McGeever", "locations": [], "entities": {"persons": [{"name": "mcgeever", "sentiment": "negative"}, {"name": "mcgeever reute", "sentiment": "neutral"}, {"name": "jamie mcgeever", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 7:19 AM / Updated an hour ago RPT-COLUMN-Bond bear market? Not if pension funds can help it: McGeever Reuters Staff \n(Repeats Wednesday item without changes) \nBy Jamie McGeever \nLONDON, Jan 24 (Reuters) - The death of the bond market bull run has been greatly exaggerated. \nThe life-savers are pension funds, whose demand for long-term fixed income assets could reach record levels this year - and, counterintuitively, it’s the surge in world equity markets that will play a large part in fuelling this appetite. \nThat’s because pension funds tend to maintain a balance in their portfolios that might typically be split 60 percent equities and 40 percent bonds. \nWorld stocks rose 20 percent last year, significantly outpacing the average on bond markets, meaning the relative value of funds’ equity holdings has increased without a single new share being bought. \nTo maintain the balance of their portfolios, pension fund managers have been selling equities and buying more bonds, and their notable demand for the latter counters the popular narrative that the 35-year rally in fixed income is over. \nIt’s a similar dynamic to the way central banks and reserve managers act when the dollar, the world’s main reserve currency, weakens. To keep the currency weightings of their reserves steady, their demand for dollars naturally increases the more the greenback weakens. \nAccording to the Global Market Strategy team at JP Morgan, pension funds and insurance companies in the G4 - United States, euro zone, Japan and Britain - will buy at least $640 billion of bonds this year. \nThat’s $200 billion more than last year and would match 2016’s total, one of the highest in the last decade. \nThe signs are that this year’s figure might end up being a record amount and eclipsing the $700 billion bought in 2012, especially if stocks continue to push higher. \n“The stronger the equity market, the stronger these rebalancing flows,” said Nikolaos Panigirtzoglou, Managing Director at JP Morgan’s Global Markets Strategy team in London. \nPanigirtzoglou and his colleagues calculate that every one percent rise in stock markets will require around $25 billion of bond purchases from U.S. defined benefit pension funds alone. With Wall Street up over 5 percent already this year, that’s more than $125 billion of pending demand for bonds right away before the UK, euro zone and Japan are factored in. \nPension funds’ portfolio rebalancing can be achieved by selling equities as well as buying bonds. And they are doing that too. \nPanigirtzoglou estimates that pension funds sold around $350 billion of equities last year and will sell an additional $200 billion this year. This isn’t a problem for stocks, as the relentless rally to new highs shows. The supply of fresh equity on the market is low and demand from buyers like retail investors is very strong. \nPension funds’ bond market footprint is larger. Assuming they and insurance companies buy as much as JP Morgan and others estimate, long-term yields may not rise at all this year and yield curves will remain flat. \nPension funds are in bonds for the long haul, and aren’t swayed by weekly or monthly price fluctuations. The higher bond yields go, the more pension funds will buy as they look to lock in long-term income streams to meet their liabilities. \nA survey last year by Mercer, a retirement and investment group, revealed that European pension funds would be inclined to raise their bond holdings when average long-term sovereign bond yields reached 2.8 percent. The 30-year U.S. Treasury yield has mostly been above that level since late 2016, and is currently above 2.9 percent. \nThe world economy is booming. The IMF said this week it expects global growth of 3.9 percent this year. That’s an extra $3 trillion of wealth, much of which will find its way into financial assets, including bonds. \nBillionaire bond veteran Bill Gross of Janus Henderson is a vocal bond bear, saying this month that “bonds, like men, are in a bear market.” Strategists at most big investment bank are advising extreme caution on buying bonds too. \nIt’s advice that pension funds will ignore. Reporting by Jamie McGeever; editing by John Stonestreet", "external_links": [], "published": "2018-01-25T09:17:00.000+02:00", "crawled": "2018-01-25T09:55:12.039+02:00", "highlightTitle": ""}