{"organizations": [], "uuid": "92e1b90408adbc325acf356c1215847c99bedc50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-wheeler-real-estate-investment-trust-inc-announces-resignation-of-chief-financial-officer-and-search-for-permanent.html", "country": "US", "domain_rank": 767, "title": "Wheeler Real Estate Investment Trust, Inc. Announces Resignation of Chief Financial Officer and Search for Permanent Successor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:05:00.000+02:00", "replies_count": 0, "uuid": "92e1b90408adbc325acf356c1215847c99bedc50"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-wheeler-real-estate-investment-trust-inc-announces-resignation-of-chief-financial-officer-and-search-for-permanent.html", "ord_in_thread": 0, "title": "Wheeler Real Estate Investment Trust, Inc. Announces Resignation of Chief Financial Officer and Search for Permanent Successor", "locations": [], "entities": {"persons": [{"name": "graham", "sentiment": "none"}, {"name": "wilkes graham", "sentiment": "none"}, {"name": "matthew reddy", "sentiment": "none"}, {"name": "reddy", "sentiment": "none"}], "locations": [{"name": "virginia", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "ga", "sentiment": "none"}], "organizations": [{"name": "wheeler real estate investment trust, inc", "sentiment": "neutral"}, {"name": "wheeler real estate investment trust, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VIRGINIA BEACH, Va., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Wheeler Real Estate Investment Trust, Inc. (NASDAQ:WHLR) (“Wheeler” or the “Company”) today announced that Wilkes Graham has notified the Company of his intention to resign as Chief Financial Officer to accept a position with a privately-held real estate development company located in Atlanta, GA. The resignation will take effect after a transition period, which is expected to end on or before March 4, 2018. Over the next sixty days of the transition, we expect Mr. Graham will be fully engaged with the Company’s fourth quarter close, earnings announcement and the signing and filing of our 10-K.\nThe Company is in the process of engaging a professional search firm to assist in the hiring of Mr. Graham’s replacement. In the event that the Company has not hired a permanent replacement prior to the effectiveness of Mr. Graham’s resignation, Matthew Reddy, the Company’s Chief Accounting Officer, will serve as the Company’s interim Chief Financial Officer while the Company completes the search process. Mr. Reddy is a certified public accountant and has been with the Company since June 2015 as Chief Accounting Officer. Prior to joining Wheeler, Mr. Reddy was the Assistant Vice President of Online Products at Liberty Tax Service (NASDAQ:TAX). While employed at Liberty, Mr. Reddy was also employed as Director of Finance from 2011 to 2014, and Manager of Financial Reporting from 2008 to 2011. Prior to joining Liberty, Mr. Reddy worked at KPMG LLP as a Senior Auditor. Rebecca Schiefer, the Company's Director of Accounting, will continue to lead the day-to-day operations of the Company's accounting department.\n\"We want to thank Wilkes for his contributions to our Company during his tenure and wish him the best in his new position,\" said Jon Wheeler, Chairman and Chief Executive Officer of the Company. \"Our primary goal remains to serve our shareholders through a dedicated business strategy that is executed by experienced real estate and financial executives. We will work to locate and hire a capable successor in a timely fashion. Due to the financial and accounting processes and procedures we have implemented, and the increased board interaction and oversight from our Operating Committee, we are confident that our experienced financial and accounting teams will continue to efficiently run the financial operations of the Company while we search for his successor.\"\nAbout Wheeler Real Estate Investment Trust, Inc.\nHeadquartered in Virginia Beach, VA, Wheeler Real Estate Investment Trust, Inc. is a fully-integrated, self-managed commercial real estate investment company focused on acquiring and managing income-producing retail properties with a primary focus on grocery-anchored centers. Wheeler’s portfolio contains well-located, potentially dominant retail properties in secondary and tertiary markets that generate attractive risk-adjusted returns, with a particular emphasis on grocery-anchored retail centers.\nAdditional information about Wheeler Real Estate Investment Trust, Inc. can be found at the Company’s corporate website: www.whlr.us\nForward-Looking Statements\nThis press release may contain “forward-looking” statements as defined in the Private Securities Litigation Reform Act of 1995. When the Company uses words such as “may,” “will,” “intend,” “should,” “believe,” “expect,” “anticipate,” “project,” “estimate” or similar expressions that do not relate solely to historical matters, it is making forward-looking statements. The Company’s expected results may not be achieved, and actual results may differ materially from expectations. Specifically, the Company’s statements regarding: (i) the Company’s ability to continue to efficiently run its financial operations; (ii) the final date of Mr. Graham’s employment with the Company; (iii) the Company’s ability to timely find a qualified replacement for Mr. Graham; and (iv) Mr. Graham’s involvement in the Company’s fourth quarter close, earnings announcement and the signing and filing of its 10-K are forward-looking statements. Forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties and other factors, some of which are beyond the Company’s control, are difficult to predict and could cause actual results to differ materially from those expressed or forecasted in the forward-looking statements. For these reasons, among others, investors are cautioned not to place undue reliance upon any forward-looking statements in this press release. Additional factors that could cause the Company’s actual results to differ materially from those expressed or forecasted in forward-looking statements are discussed in the Company's filings with the U.S. Securities and Exchange Commission, which are available for review at www.sec.gov . The Company undertakes no obligation to publicly revise these forward‐looking statements to reflect events or circumstances that arise after the date hereof.\nCONTACT:\nWheeler Real Estate Investment Trust, Inc.\nWilkes Graham\nChief Financial Officer\n(757) 627-9088\nWilkes@whlr.us\nLaura Nguyen\nDirector of Investor Relations\n(757) 627-9088\nLaura@whlr.us\nSource:Wheeler Real Estate Investment Trust, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/ff2a7382-3289-4942-8a44-a5adfe2c37df", "https://www.globenewswire.com/Tracker?data=IOXgcYNsp_4PyP0wGS2GrBi9lRPwr8OBCjglMOF9gFj6ZiVZXWXLFoFyfSeIOJjfeZIKbm68wnpfIz1jELyZCw=="], "published": "2018-01-08T16:05:00.000+02:00", "crawled": "2018-01-08T19:38:56.015+02:00", "highlightTitle": ""}