{"organizations": [], "uuid": "ea78e493c7e3638bb50a074a434d6da518353018", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224504007&w=1200&r=LYNXMPEE0M18P", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-trump-russia/u-s-attorney-general-questioned-in-special-counsel-russia-probe-nyt-idUSKBN1FC219", "country": "US", "domain_rank": 408, "title": "U.S. attorney general questioned in special counsel Russia probe: New York Times", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:12:00.000+02:00", "replies_count": 0, "uuid": "ea78e493c7e3638bb50a074a434d6da518353018"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-russia/u-s-attorney-general-questioned-in-special-counsel-russia-probe-nyt-idUSKBN1FC219", "ord_in_thread": 0, "title": "U.S. attorney general questioned in special counsel Russia probe: New York Times", "locations": [], "entities": {"persons": [{"name": "jeff sessions", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "chizu nomiyama", "sentiment": "none"}, {"name": "sarah isgur flores", "sentiment": "none"}, {"name": "doina chiacuediting", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "new york times", "sentiment": "negative"}, {"name": "new york times reuters", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 3:11 PM / Updated 21 minutes ago U.S. attorney general questioned in special counsel Russia probe Sarah N. Lynch 6 Min Read \nWASHINGTON (Reuters) - U.S. Attorney General Jeff Sessions was questioned last week by the special counsel’s office investigating potential collusion between Russia and President Donald Trump’s 2016 presidential campaign, the U.S. Justice Department said on Tuesday. \nThe interview marked the first time that Special Counsel Robert Mueller’s office is known to have interviewed a member of Trump’s Cabinet, and is another milestone in an investigation that has hung over Trump’s year-old presidency. \n“I‘m not at all concerned,” Trump told reporters at the White House when asked about the development. \nSessions was the first U.S. senator to endorse Trump’s candidacy and served as an adviser to the campaign before the Republican president appointed him as the top U.S. law enforcement official. Trump has openly criticized Sessions for recusing himself from overseeing the Russia probe last March after media reports that he had failed to disclose 2016 meetings with Moscow’s then-ambassador, Sergei Kislyak. \nThe recusal paved the way for Deputy Attorney General Rod Rosenstein, the Justice Department’s No. 2 official, to appoint Mueller as special counsel in May 2017. Among other matters, Mueller is looking into whether Trump has sought to obstruct the Russia investigation. \nIan Prior, a Justice Department spokesman, confirmed a New York Times report that Sessions met for hours with Mueller’s team last week. Prior provided no additional details. \nMueller’s team is expected to be interested in meetings between Sessions and Kislyak during the campaign, as well as the attorney general’s involvement in Trump’s firing of former FBI Director James Comey last May, an episode central to the question of whether Trump may have committed obstruction of justice. \nU.S. intelligence agencies have concluded that Russia interfered in the 2016 campaign using hacking and propaganda to attempt to tilt the race in favor of Trump. Russia has denied it. Trump has denied any collusion with Russia, and has called the Mueller’s investigation a “witch hunt” and “hoax.” \n“We believe it will end soon and find what we’ve known all along, which is that there was no collusion during the 2016 campaign and no findings of wrongdoing,” White House spokesman Raj Shah told Fox News, referring to Mueller’s investigation. \nAn attorney representing Sessions declined to comment. \n‘IN THE MIDDLE’ \nStanford University law professor David Sklansky said it would be hard to see how Mueller could carry out the investigation without interviewing Sessions. “The focus of the investigation is ties between members of the Trump campaign and Russian officials, and Sessions was in the middle of that.” \nDemocrats have accused Sessions of lying to Congress by failing to disclose meetings with Kislyak during the campaign. Sessions has now acknowledged meetings with Kislyak including one in his Senate office and another at a event at the Republican National Convention, and did not rule out a “brief interaction” with Kislyak at an event at a Washington hotel. \nHis public account of other matters related to Russia also has evolved. Sessions initially testified to Congress he was unaware of any Trump campaign contacts with Russia, but in November modified that assertion, saying he was aware of contact between the campaign and Russian intermediaries. \nSessions has denied lying, saying he was “honest and correct” and not trying to mislead Congress. He has frequently said he has trouble remembering some of the meetings. \nTrump fired Comey after Sessions and Rosenstein penned a memo recommending his ouster over his prior handling of the investigation into former Secretary of State Hillary Clinton’s use of a private email server. Clinton was the Democratic presidential candidate who lost to Trump in 2016. \nTrump later said he fired Comey over “this Russia thing,” a comment that raised questions about whether he was attempting to obstruct the FBI’s investigation. Mueller took over the investigation after being appointed special counsel. \nSessions’ participation in a March 31, 2016, meeting of Trump’s national security campaign advisers could be of interest to Mueller. \nAt that meeting, which Sessions led, former campaign volunteer and adviser George Papadopoulos offered to help broker a meeting between Trump and Russian President Vladimir Putin. Papadopoulos has pleaded guilty to lying to the FBI, and is now cooperating with Mueller. \nSessions has said he now recalls the proposal by Papadopoulos, and told Congress he pushed back against the idea. \nMueller has charged four people in his wide-ranging investigation. In addition to Papadopoulos, Trump’s former national security adviser, Michael Flynn, pleaded guilty to lying to the FBI. Trump’s former campaign manager, Paul Manafort, and Manafort’s business partner, Rick Gates, have been charged with counts including failing to register as foreign agents and conspiracy to launder money. \nSessions was the latest high-level current or former Trump administration figure to be interviewed by Mueller’s team. Former White House strategist Steve Bannon also has agreed to be interviewed by Mueller’s investigators. \nTrump this month refused to commit to being interviewed by Mueller, saying “I’ll speak to attorneys” about the matter. Reporting by Sarah N. Lynch; Additional reporting by Ayesha Rascoe and Makini Brice; Editing by Chizu Nomiyama and Will Dunham", "external_links": [], "published": "2018-01-23T17:12:00.000+02:00", "crawled": "2018-01-23T17:26:25.000+02:00", "highlightTitle": ""}