{"organizations": [], "uuid": "f93bcc1d4c3ffac3eb8eea16741147702ccfe7bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222199171&w=1200&r=LYNXMPEE0E0WZ", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-eu-northern-france/at-port-in-northern-france-brexit-occupies-minds-and-looms-over-planning-idUKKBN1F41PS", "country": "US", "domain_rank": 408, "title": "At port in northern France, Brexit occupies minds and looms over planning", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T19:37:00.000+02:00", "replies_count": 0, "uuid": "f93bcc1d4c3ffac3eb8eea16741147702ccfe7bd"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-northern-france/at-port-in-northern-france-brexit-occupies-minds-and-looms-over-planning-idUKKBN1F41PS", "ord_in_thread": 0, "title": "At port in northern France, Brexit occupies minds and looms over planning", "locations": [], "entities": {"persons": [{"name": "jean-marc puissesseau", "sentiment": "none"}, {"name": "matthias blamont", "sentiment": "none"}, {"name": "puissesseau", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 1:33 PM / Updated 12 minutes ago At port in northern France, Brexit occupies minds and looms over planning Matthias Blamont 5 Min Read \nCALAIS, France (Reuters) - With construction underway, Jean-Marc Puissesseau may have to rework an 800 million euro (£712 million) project to double the capacity of Calais’ port because of Britain’s exit from the European Union. FILE PHOTO: View of cross-Channel ferries in the port of Calais, France, after Britain's referendum results to leave the European Union were announced June 24, 2016. REUTERS/Pascal Rossignol/File Photo \nThe fortunes of France’s busiest passenger port -- just 20 miles (33 km) across the water from Britain -- hinge on the UK’s future trade ties with the EU, an issue that must be negotiated between now and March next year. \nGiven Britain has said it will leave the EU’s single market and customs union, with profound implications for customs-free cross-Channel trade as well as Britain’s economy, Puissesseau worries his plans may be overly optimistic. \n“The economic model for this new port is based on an increase in traffic,” said the general manager of the port. “It’s a strategic investment for the future of the town.” \nHis blueprint is based on annual revenue growth of 2 percent. But that prospect looks remote if Britain goes for what’s been dubbed “hard” Brexit and leaves the single market and customs union completely, which would likely reduce the amount of trade through Calais in the short term. \nIn such a scenario, he would have to substantially modify plans, not least because the port lacks the infrastructure to accommodate customs checks for the 2 million trucks it handles each year. \n“If we get a hard Brexit, the whole plan will be at risk because we won’t be able to finance the investment,” he said expressing concern too about the wider impact on the Hauts-de-France region around Calais. \nAlready one of France’s poorest areas, the fear is that post-Brexit tariffs and a return to a customs border will slow transit times, pushing up the cost of goods and squeezing margins. It could mean traffic being diverted elsewhere. \nWith unemployment well above the national average of 9.5 percent, officials fret Hauts-de-France will be left further behind. The far-right National Front party has made inroads. \n“One has to understand that just two additional minutes for (customs) checks means kilometres of tailbacks,” said Philippe Hourdain, head of the Hauts-de-France Chamber of Commerce. “For us, everything depends on whether we get a hard or soft Brexit.” FILE PHOTO: View of the port of Calais, France, after Britain's referendum results to leave the European Union were announced June 24, 2016. REUTERS/Pascal Rossignol/File Photo CLOSER TO LONDON THAN PARIS \nPresident Emmanuel Macron will hold talks with Britain’s Theresa May in southern England on Thursday, discussing Brexit and the Le Touquet accord, a 2003 agreement that effectively allowed Britain to establish a border in France. \nMacron wants Britain to pay a greater share of the financial burden France says it has incurred from dealing with migrants at the frontier and handling more asylum demands. \nIf Britain and France fail to strike a new deal, the nuclear option for France would be to return to border posts on either side of the Channel, one government source said. \nThat would further weigh on Hauts-de-France, which in many respects sees its future tied more closely to London than French cities. It’s capital, Lille, is 80 minutes from London by train. \n“What’s key for us is that Brexit doesn’t make Britain poorer,” said Jean-Paul Mulot, a London-based adviser to Hauts-de-France leader Xavier Bertrand. “Our position is to do all we can to reinforce the cooperation and investments between the two sides of the Channel.” \nOn a recent dull, foggy morning in Calais, trade in high street stores was slow. Arcade machines chimed in an empty casino hall and locals nursed early glasses of beer. \nNo French town has borne the brunt of the European migration crisis more than Calais. In 2016, former president Francois Hollande sent bulldozers to clear a sprawling migrant camp near the port dubbed “The Jungle”, a symbol of the EU’s failure to tackle the influx of refugees and economic migrants from Africa and the Middle East. \nNow it is Brexit at the front of people’s minds, even if there are some positive signs for the region, too, with Britain’s Liberty House upping its investment in nearby Dunkirk. \n“Everyone talks about Brexit, but no one really knows how it’s going to work out,” said Patrick Genier, a 55-year-old electrical engineer. “What we need is for business to flourish. The jungle is no more, but no one wants Calais to suffer another suckerpunch from Brexit.” Reporting by Matthias Blamont; Writing by Richard Lough; Editing by Luke Baker and Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-15T19:37:00.000+02:00", "crawled": "2018-01-15T19:58:37.016+02:00", "highlightTitle": ""}