{"organizations": [], "uuid": "01421e02f27cc0ef00e8607fecfb9a9f7231f8d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-telco-cuba-amgentech-holdings-completes-acquisition-advisory-board-announcements-and-debt-reductions--corporate-update.html", "country": "US", "domain_rank": 767, "title": "Telco Cuba / Amgentech Holdings Completes Acquisition, Advisory Board Announcements, and Debt Reductions -- Corporate Update", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "01421e02f27cc0ef00e8607fecfb9a9f7231f8d1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-telco-cuba-amgentech-holdings-completes-acquisition-advisory-board-announcements-and-debt-reductions--corporate-update.html", "ord_in_thread": 0, "title": "Telco Cuba / Amgentech Holdings Completes Acquisition, Advisory Board Announcements, and Debt Reductions -- Corporate Update", "locations": [], "entities": {"persons": [{"name": "davie", "sentiment": "negative"}, {"name": "frank gerardi", "sentiment": "none"}, {"name": "carlos sequera yepez", "sentiment": "none"}, {"name": "sequera yepez", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "telco cuba", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}], "organizations": [{"name": "inc.", "sentiment": "negative"}, {"name": "advisory board announcements", "sentiment": "negative"}, {"name": "telco cuba / amgentech holdings completes acquisition", "sentiment": "negative"}, {"name": "amgentech holdings, inc.", "sentiment": "neutral"}, {"name": "naked papers brands, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVIE, Fla., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Telco Cuba, Inc. / Amgentech Holdings, Inc. (OTCPK: QBAN), a publicly traded holding company, announces the following corporate updates.\nThe company has completed the asset acquisition of Naked Papers, Inc. ( http://www.nakedpapers.com) . Naked Papers is a brand of cellulose based clear rolling paper. The purchase includes all rights to the brand and inventory. The acquisition is to become a subsidiary of QBAN under the company name – Naked Papers Brands, Inc., providing an entry into the marijuana sector, selling ancillary products with an established brand.\nThe company has elected Dr. Carlos Sequera Yepez to the business advisory board of the company. Dr. Sequera Yepez is a seasoned Venezuelan politician, businessman and international business expert with interests throughout South America. Dr. Sequera Yepez will be instrumental in identifying and aiding in the negotiation of acquisitions as the company embarks on creating a portfolio of companies that bring a high level of shareholder value.\nThe company has elected Mr. Frank Gerardi to the business advisory board of the company. Mr. Gerardi has led a distinguished career as a former NYSE Member, NASD Registered Principle, and President of a NYSE Member Firm, former Chairman and CEO of Teligent (TLGT / formerly IGI Labs, Inc.) and the former director and chair of the audit committee of Dyadic (DYAI). Mr. Gerardi has been the president of Univest Management since 1986, providing consulting services to public and private companies for over 30 years. Mr. Gerardi’s background makes him uniquely qualified to provide the expertise and advice necessary for the company to complete its mission in becoming a successful holding company.\nDuring fiscal year 2017, the company wrote off approximately 3.4 Million dollars, due to the write-off of an interest the company held and other directives aimed towards creating an improved financial posture. Further, the company has settled a lawsuit a note holder brought to court in 2014. The settlement is for an amount that is inferior to the amount demanded.\nDuring the fourth quarter 2017, an investor forfeited approximately 92 million shares. The shares were a combination of common and preferred shares. The investor was the single largest beneficial owner besides the CEO.\nThe company has refocused its efforts on becoming a holding company through strategic acquisitions. Naked Papers, our first acquisition to this end, provides a high value company to QBAN.\nCurrent uncertainty in the country of Cuba has caused the company to retrain its focus. The company remains steadfast in its intention to capitalize on efforts to date and remains vigilant to any changes that may provide an inroad into Cuba. Lastly, the company has terminated its efforts to acquire the wireless internet service provider it signed a definitive purchase agreement with, due to several factors including a decrease in value of the target acquisition.\nThe company will continue to use its twitter accounts, “@amgentech”, “@nakedpapers”, and “@telcocuba” to regularly inform our shareholder base and the investment community on the many initiatives currently being worked on by Amgentech Holdings, Inc.\nAbout Amgentech Holdings, Inc.\nQBAN is currently in the process of changing its corporate name from Telco Cuba, Inc. to Amgentech Holdings, Inc. The use of both names throughout this press release is intended to clarify that both names relate to QBAN.\nQBAN is a holding corporation headquartered in Davie, Florida, which, through its operating subsidiaries, engages in providing technology infrastructure solutions, software development, and VoIP and website design, and clear rolling paper under the Naked Papers brand. QBAN’s principal executive offices are located at 4960 SW 52 Street, 404, Davie, Florida 33314, and its telephone number at that location is (305) 747 - 7646. QBAN’s web address is http://www.amgentechholdings.com / http://www.telcocuba.com .\nThis news release contains \"forward-looking statements\", as that term is defined in section 27a of the united states securities act of 1933, as amended, and section 21e of the united states securities exchange act of 1934, as amended. Statements in this news release, which are not purely historical, are forward-looking statements and include any statements regarding beliefs, plans, expectations or intentions regarding the future. Except for the historical information presented herein, matters discussed in this news release contain forward-looking statements that are subject to certain risks and uncertainties that could cause actual results to differ materially from any future results, performance or achievements expressed or implied by such statements. Statements that are not historical facts, including statements that are preceded by, followed by, or that include such words as \"estimate\", \"anticipate\", \"believe\", \"plan\" or \"expect\" or similar statements are Forward-looking statements contained in this news release include statements relating to other publicly available information regarding the company.\nNON SOLICITATION:\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy any of these securities, nor will there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale is not permitted. Any securities offered or issued in connection with the above-referenced merger and/or investment have not been registered, and will be offered pursuant to an exemption from registration.\nEmail us at:\nWilliam J Sanchez, Chairman/CEO\nwilliam@amgentechholdings.com\n(305) 747 7647 x 101\nFollow “QBAN” on Twitter\n@amgentech\n@nakedpapers\n@telcocuba\nStock Symbol: QBAN\nCompany Website: www.amgentechholdings.com\nCompany Website: www.amgentech.com\nCompany Website: www.nakedpapers.com\nCompany Website: www.telcocuba.com\nSource:Telco CUBA Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=Ct201XEHW2RGHF0iE5bjRvhuDNQV2BvXHF2ZNsWDrWkPOFHQNPrXQE2bHZTGF7WxmyOhay3kPuDIDONcGAGk_loM7YrhB_972aFrEK8m1uk=", "https://www.globenewswire.com/Tracker?data=SwEesCPgt_xsv2RzsMSn_Rr5erKqkiJGkNPOml3eNRTVsk5KZPxro8JSBsMg_3sVrkLjAnbmKBWw1Rw_ryGtgF-aX5tv0dwMBMQdgC7EuDmZhw9f6Uq2dGZpJD12NxwM", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e6f805b4-54dc-4140-b1f4-ca2ac0a3f127", "https://www.globenewswire.com/Tracker?data=Ct201XEHW2RGHF0iE5bjRqz49T94nem8ifXxq_kM63-cj21Xf71uIU-pExoheTN9NrIQfxryzKxruXW0JiSYvhSpY8Z79YvNsLmmRyyD-0w=", "https://www.globenewswire.com/Tracker?data=8geIXjBEofgRXrgbHKIVgOchx-yLSr3iQ0v1F_XHIEQBjv6NM1tSO3yHRBoRLLtYfPny9nwN896UF59FMoYg5HsCjwDOOeLmmttyEJdOnpw=", "https://www.globenewswire.com/Tracker?data=Ct201XEHW2RGHF0iE5bjRnWP5pFkxmcemfmM4cX1UkZuahSCWAbly2AzUUcoVdwPax88h6pmoHUTMaC9EYHBugXvnc8-P8fFhIKkccmIcRSvHV8MUzEQ-MjKG2rgNqak", "https://www.globenewswire.com/Tracker?data=Mi9uHIziud9mIgZ-0s6s6uuwWDP4DwusQfa4GJC6ihcpWu0UVj4Rv3NynUXqs_DxmXm66dTMwDkdg8MBc3GJAw==", "https://www.globenewswire.com/Tracker?data=FcT4OmQ3fnCLRuhtTdhiGQrr25szqaU5h7lwvbvj2XNLLgZrUKXRExnjkPzv8N4dSSOLe6tRKkmPYXMLxF-8rvpdrz1DQrudQd49oYUidSI=", "https://www.globenewswire.com/Tracker?data=SwEesCPgt_xsv2RzsMSn_VDLl4nuZxvraqtMj3VhjaPEWrDuoFzbrU0oOcHStS2DHe5b5GB3tg8mg6sIUVJ70A=="], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T18:51:58.010+02:00", "highlightTitle": ""}