{"organizations": [], "uuid": "d9f4385b4894f2e1c988dab2efde8bd3a2909bc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-safrica-drought-capetown/drought-hit-cape-town-at-point-of-no-return-tightens-water-targets-idUSKBN1F71Y4", "country": "US", "domain_rank": 408, "title": "Drought-hit Cape Town at 'point of no return', tightens water targets", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:20:00.000+02:00", "replies_count": 0, "uuid": "d9f4385b4894f2e1c988dab2efde8bd3a2909bc5"}, "author": "", "url": "https://www.reuters.com/article/us-safrica-drought-capetown/drought-hit-cape-town-at-point-of-no-return-tightens-water-targets-idUSKBN1F71Y4", "ord_in_thread": 0, "title": "Drought-hit Cape Town at 'point of no return', tightens water targets", "locations": [], "entities": {"persons": [{"name": "patricia de lille", "sentiment": "none"}], "locations": [{"name": "cape town", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "de lille", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAPE TOWN (Reuters) - South Africa’s drought-stricken Cape Town told residents on Wednesday they would need to cut their daily water consumption by almost half from next month as authorities scramble to prevent the city running out of water as soon as in April.\nStruggling to cope with its worst drought in a century, Cape Town, South Africa’s second-largest city and a major tourist hub, last cut water consumption targets in October but its mayor said on Wednesday that too few residents were paying them any heed.\nFrom Feb. 1, the target for water consumption per person would be lowered to 50 litres (13 gallons) from 87 litres a day, and the collective consumption target to 450 million litres from 500 million litres a day, Mayor Patricia de Lille said.\nAccording to an official, Cape Town as a whole consumed 618 million litres of water on Monday.\n“We have reached a point of no return,” De Lille said in a statement. The new targets will remain in place for 150 days before the city reassesses the situation.\n“Day Zero” - the day the taps run dry - is now expected on April 21, a day earlier than previously forecast, according to the statement.\nBesides a huge public awareness campaign, teams have also intensified leak detection and repairs, as well as extending the use of treated effluent water which offset the use of drinking water for non-potable purposes, De Lille said.\nShe also said the city would be voting on a punitive tariff this Friday that will see “exponentially higher” water rates for residents who exceed their limits.\nThe city has also tried to limit water consumption by reducing the water pressure and stepping up the installation of water management devices in high-consumption households.\nAn average bath holds around 80 litres of water.\nReporting by Wendell Roelf; Editing by Ed Stoddard and Raissa Kasolowsky\n ", "external_links": [], "published": "2018-01-18T16:20:00.000+02:00", "crawled": "2018-01-18T16:53:27.009+02:00", "highlightTitle": ""}