{"organizations": [], "uuid": "2a380d9d2db02c4fc17e4527fcc920e116d85f89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/26/104609783-Trump_Putin_.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/passing-on-sanctions-trump-goes-even-softer-on-russia-than-expected.html", "country": "US", "domain_rank": 767, "title": "Passing on sanctions, Trump goes even softer on Russia than expected", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T17:04:00.000+02:00", "replies_count": 0, "uuid": "2a380d9d2db02c4fc17e4527fcc920e116d85f89"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/30/passing-on-sanctions-trump-goes-even-softer-on-russia-than-expected.html", "ord_in_thread": 0, "title": "Passing on sanctions, Trump goes even softer on Russia than expected", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "mike pompeo", "sentiment": "none"}, {"name": "mikhail klimentyev", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "hamburg", "sentiment": "none"}, {"name": "getty images russia", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "world news passing", "sentiment": "negative"}, {"name": "cia", "sentiment": "none"}, {"name": "tass", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump once again stands accused of being soft on Russia after he bypassed a deadline to hand down new sanctions on the country.\nThe Trump administration announced late Monday that it would not yet impose new sanctions on Russia as mandated by the Countering America's Adversaries Through Sanctions Act (CAATSA), enacted in August to punish Moscow for its alleged interference in the 2016 U.S. election and military interference in Ukraine.\nThe move, or lack thereof, is widely being chalked up as a win for Russia.\n\"The champagne corks will be popping again in Moscow this morning with another major win for (Vladimir) Putin over the DC establishment,\" said Timothy Ash, senior sovereign strategist for emerging markets at Bluebay Asset Management. \"No new sanctions — Russian markets are likely to be cheered by this as expectations in Moscow at least (were) for much worse outcomes.\"\nDefending the decision, State Department spokeswoman Heather Nauert claimed that CAATSA itself, passed last year with bipartisan support, is sufficient legislation against the Russians and therefore no more action is needed.\n\"Sanctions on specific entities or individuals will not need to be imposed because the legislation is, in fact, serving as a deterrent,\" she said in a statement.\nAs required by the legislation, the Trump administration on Monday released a Treasury Department-compiled list of Russian political and business figures that it stated is \"not a sanctions list\", refusing to add their names to the existing blacklist. Some of the figures and entities named were already subject to U.S. sanctions imposed under the Obama administration.\n\"Moscow had anticipated a much more aggressive approach from Washington, with Kremlin officials pre-emptively describing the new list as an attempt to interfere with the March presidential election,\" Daragh McDowell, principal Russia analyst at Verisk Maplecroft, told CNBC in an email.\n\"Depending on the reaction of the U.S. Congress to the White House's actions, it seems highly unlikely that new economic and political sanctions will be applied on Russia by the U.S. during President Trump's tenure,\" McDowell said.\nMissing deadlines Monday marked 180 days after the bill's original signing, the deadline by which the Trump administration would have had to impose penalties against entities doing business with Russia's defense and intelligence sectors. The measures varied in intensity, from banning certain export licenses and corporate visas, to prohibiting all bank transfers involving \"interests of sanctioned entities\" under U.S. jurisdiction.\nWhile overwhelmingly passed by Congress in July, CAATSA was signed in August amid much protest from the president, who called it \"seriously flawed.\" The sanctions tug-of-war between Congress and the administration has played out in the shadow of U.S. Special Counsel Robert Mueller's investigations over Russia's election interference and whether Trump's campaign team colluded with the Russian government.\nDrew Angerer | Getty Images | Getty Images News Suspicion over Trump's ties to Moscow grew when the White House missed a pivotal CAATSA deadline in October to name Russian defense and intelligence entities slated for new sanctions, finally complying after three weeks.\nTrump's administration has consistently denied any ties with Russia, insisting that it aims solely to pursue a warmer relationship with the longtime U.S. adversary.\n\"Russian-U.S. relations remain extremely tense and the failure to impose measures under CAATSA is unlikely to improve them,\" Maximilian Hess, senior political risk analyst at AKE Group, told CNBC on Tuesday. \"However, it could prove an early part of a diplomatic push to seek a better relationship with the Kremlin, something Trump has long said he desires.\"\n'Off the hook, yet again' The State Department's claim that CAATSA is deterring Russian arms sales is already being questioned and may be \"premature,\" Hess added, noting Saudi Arabia's recently announced purchase of Russia's S-400 air defense system and additional arms sales to Turkey.\nMembers of Congress are already expressing their dismay over the White House decision.\n\"The Trump administration had a decision to make, whether they would follow the law and crack down on those responsible for attacking American democracy in 2016,\" Rep. Eliot Engel, a member of the House Foreign Affairs Committee and a Democrat, said in a statement. \"They chose instead to let Russia off the hook yet again.\"\nSenator Claire McCaskill, a Democrat on the Armed Services Committee, called Trump's bypassing of Congressional legislation a \"constitutional crisis.\"\nTweet1\nMeanwhile, Senator Bob Corker, a Republican who helped design the sanctions law, said he was not concerned over Trump's decision. \"This is when sanctions season begins, and so they'll be rolling them out,\" he told reporters, adding that the administration was taking this \"very seriously.\"\nTrump has sparked controversy with his proclivity for praising Putin, having called him a \"strong leader\" and defending his military involvement in Syria, among other things.\nDespite Trump's apparent softness, the Kremlin has portrayed the Treasury list's publication Monday as a hostile act and described the countries' bilateral relations as in an \"unprecedented situation.\"\n\"This indicates that despite the White House's reticence in imposing new sanctions, Moscow has given up on improving relations with Washington for the time being and will continue to stoke domestic anti-Western sentiment to prop up Putin's legitimacy,\" McDowell said.\nCIA director Mike Pompeo, a Trump ally, recently warned that he expects Russia to attempt interference in the upcoming U.S. mid-term elections in November. Bluebay's Ash agrees.\n\"For Putin his Project Trump gig worked so well in the run-up to the 2016 elections, and while getting caught out he suffered no consequences,\" Ash said. \"So he might well be minded to double up again.\"", "external_links": [], "published": "2018-01-30T17:04:00.000+02:00", "crawled": "2018-01-30T17:04:06.000+02:00", "highlightTitle": ""}