{"organizations": [], "uuid": "b485826e6939019d23525151b786868f1161deec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222906395&w=1200&r=LYNXMPEE0H06S", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-wtafinals/wta-finals-to-move-to-shenzhen-from-singapore-in-2019-idUKKBN1F70AT", "country": "US", "domain_rank": 408, "title": "WTA Finals to move to Shenzhen from Singapore in 2019", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T05:00:00.000+02:00", "replies_count": 0, "uuid": "b485826e6939019d23525151b786868f1161deec"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-wtafinals/wta-finals-to-move-to-shenzhen-from-singapore-in-2019-idUKKBN1F70AT", "ord_in_thread": 0, "title": "WTA Finals to move to Shenzhen from Singapore in 2019", "locations": [], "entities": {"persons": [{"name": "steve simon", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "shenzhen", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "wta", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 3:04 AM / Updated 4 hours ago WTA Finals to move to Shenzhen from Singapore in 2019 Reuters Staff 2 Min Read \nMELBOURNE (Reuters) - China’s growing influence over women’s tennis moved up a notch on Thursday when the southern metropolis of Shenzhen was announced as the new venue for the season-ending WTA Finals from 2019 to 2028. \nShenzhen, which already hosts a WTA tournament in early January, will take over from Singapore on the back of a bid which promised to build a new 12,000-seat downtown venue and double the prize money to $14 million. \nThe top eight women and doubles pairings compete in the tournament, which has run in various guises since 1972 but has always sat well below the four grand slams in terms of prestige. \n“It gives me great pleasure to announce that the dynamic city of Shenzhen has been chosen to host the WTA Finals, the WTA’s crown jewel season finale, for the next decade,” the tour’s chairman Steve Simon said in a statement. \n“This will easily be the largest and most significant WTA Finals deal in the 45 years since the WTA was founded and promises to take the event to a spectacular new level.” Tennis - WTA Tour Finals - Singapore Indoor Stadium, Singapore - October 29, 2017 Denmark's Caroline Wozniacki celebrates during the final against USA's Venus Williams REUTERS/Jeremy Lee \nSingapore, which started its five-year deal to host the Finals in 2014, Manchester, Prague and St Petersburg all made bids to host the tournament but Shenzhen’s offer to double the prize money would have been difficult to ignore. \nShenzhen will be the 10th city to host the tournament but the first since New York City, from 1979 to 2000, to give it a home for a decade or more. \nThe WTA is in its 10th year of a marketing push into China, which has seen a string of tournaments spring up in the world’s most populous nation. \n“Shenzhen is an exciting, fast-evolving metropolis of 68 million people,” said WTA President Micky Lawler. \n“As China’s new generation of players follow in the footsteps of Li Na, the local fans will have their own national heroines to cheer, but we also know from our existing events in the region led by the China Open that they will support all of the stars of the WTA with tremendous enthusiasm.” Reporting by Nick Mulvenney in Sydney, editing by Peter Rutherford", "external_links": [], "published": "2018-01-18T05:00:00.000+02:00", "crawled": "2018-01-18T06:40:04.009+02:00", "highlightTitle": ""}