{"organizations": [], "uuid": "a74db086c0fbb9d38c35430499f9e494a0bd87c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-total-reinforces-its-position-in-deepwater-gulf-of-mexico-by-entering-the-anchor-discovery.html", "country": "US", "domain_rank": 767, "title": "Total Reinforces Its Position In Deepwater Gulf Of Mexico By Entering The Anchor Discovery", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.998, "site_type": "news", "published": "2018-01-24T10:20:00.000+02:00", "replies_count": 0, "uuid": "a74db086c0fbb9d38c35430499f9e494a0bd87c3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-total-reinforces-its-position-in-deepwater-gulf-of-mexico-by-entering-the-anchor-discovery.html", "ord_in_thread": 0, "title": "Total Reinforces Its Position In Deepwater Gulf Of Mexico By Entering The Anchor Discovery", "locations": [], "entities": {"persons": [{"name": "arnaud breuillac", "sentiment": "none"}, {"name": "wilcox", "sentiment": "none"}, {"name": "samson", "sentiment": "none"}], "locations": [{"name": "deepwater gulf of mexico", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "louisiana", "sentiment": "none"}, {"name": "gulf of mexico", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "green canyon 761", "sentiment": "none"}], "organizations": [{"name": "tta", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "group", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "samson offshore anchor", "sentiment": "none"}, {"name": "maersk oil", "sentiment": "none"}, {"name": "chevron", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS--(BUSINESS WIRE)-- Regulatory News:\nTotal (Paris:FP)(LSE:TTA)(NYSE:TOT) has signed an agreement with Samson in order to acquire Samson Offshore Anchor, LLC, which holds a 12.5% interest in four blocks covering the Anchor discovery, one of the most significant recent discoveries in the Gulf of Mexico (GoM), USA. The deal also includes a 12.5% interest in the nearby exploration block Green Canyon 761, where Total already has a 25% interest.\n“The entry in the Anchor discovery further increases Total’s footprint in deepwater Gulf of Mexico. It follows our entry in seven exploration prospects located in the promising Wilcox (Central GoM) and Norphlet (Eastern GoM) plays thanks to an agreement signed with Chevron last September, and in the Jack field where the Group will acquire a 25% interest as part of the Maersk Oil deal”, stated Arnaud Breuillac, President Exploration & Production at Total.\nDiscovered in the Wilcox play in 2014, Anchor is located approximately 225 kilometers off the coast of Louisiana in more than 1,500 meters of water. Additional prospective resources have been identified in the Anchor vicinity, strengthening the potential of the asset.\nAnchor is operated by Chevron (55%) alongside Cobalt (20%), and Venari (12.5%).\nTotal Exploration & Production in the United States\nTotal has been active in Exploration & Production in the United States since 1957.\nIn the Gulf of Mexico, Total focuses on the deep water domain with participations in two producing fields, Tahiti with 17%, operated by Chevron, and Chinook with 33.33%, operated by Petrobras, as well as in the discovery of North Platte with 40%, operated by Cobalt International Energy. As part of the acquisition of Maersk Oil company, Total will become a 25% partner in the Chevron operated Jack field. Total also holds participations in over 160 exploration leases.\nOnshore, Total operates about 100,000 barrels of oil equivalent per day (shale gas production) in the Barnett play and is a 25% participant in a JV operated by Chesapeake in the Utica shale play.\nAbout Total\nTotal is a global integrated energy producer and provider, a leading international oil and gas company, a major player in low-carbon energies. Our 98,000 employees are committed to better energy that is safer, cleaner, more efficient, more innovative and accessible to as many people as possible. As a responsible corporate citizen, we focus on ensuring that our operations in more than 130 countries worldwide consistently deliver economic, social and environmental benefits.\n* * * * *\nCautionary note\nThis press release, from which no legal consequences may be drawn, is for information purposes only. The entities in which TOTAL S.A. directly or indirectly owns investments are separate legal entities. TOTAL S.A. has no liability for their acts or omissions. In this document, the terms “Total” and “Total Group” are sometimes used for convenience where general references are made to TOTAL S.A. and/or its subsidiaries. Likewise, the words “we”, “us” and “our” may also be used to refer to subsidiaries in general or to those who work for them.\nThis document may contain forward-looking information and statements that are based on a number of economic data and assumptions made in a given economic, competitive and regulatory environment. They may prove to be inaccurate in the future and are subject to a number of risk factors. Neither TOTAL S.A. nor any of its subsidiaries assumes any obligation to update publicly any forward-looking information or statement, objectives or trends contained in this document whether as a result of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006660/en/\nTotal\nMedia Relations:\n+33 1 47 44 46 99\npresse@total.com\n@TotalPress\nor\nInvestor Relations:\n+44 (0)207 719 7962\nir@total.com\nSource: Total", "external_links": ["http://www.businesswire.com/news/home/20180123006660/en/"], "published": "2018-01-24T10:20:00.000+02:00", "crawled": "2018-01-24T11:31:52.000+02:00", "highlightTitle": ""}