{"organizations": [], "uuid": "5981bc8f81a450361efe94ff00a5607f622b9c1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224454023&w=1200&r=LYNXMPEE0M0T6", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/india-politics/shiv-sena-breaks-ties-with-bjp-ahead-of-2019-elections-idINKBN1FC1FJ", "country": "US", "domain_rank": 408, "title": "Shiv Sena breaks ties with BJP ahead of 2019 elections", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T14:00:00.000+02:00", "replies_count": 0, "uuid": "5981bc8f81a450361efe94ff00a5607f622b9c1e"}, "author": "", "url": "https://in.reuters.com/article/india-politics/shiv-sena-breaks-ties-with-bjp-ahead-of-2019-elections-idINKBN1FC1FJ", "ord_in_thread": 0, "title": "Shiv Sena breaks ties with BJP ahead of 2019 elections", "locations": [], "entities": {"persons": [{"name": "modi", "sentiment": "none"}, {"name": "thackeray", "sentiment": "none"}, {"name": "keshav upadhyay", "sentiment": "none"}, {"name": "uddhav thackeray", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "maharashtra", "sentiment": "none"}, {"name": "maharastra", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "bjp", "sentiment": "negative"}, {"name": "shiv sena", "sentiment": "negative"}, {"name": "sena", "sentiment": "none"}, {"name": "bharatiya janata party", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Reuters) - A powerful regional political party has snapped ties with India’s ruling Bharatiya Janata Party (BJP) ahead of general elections in 2019, a party leader said on Tuesday, ending a nearly three-decade-old alliance based on nationalist ideology.\nThe Shiv Sena, a partner in the governing coalition formed by Prime Minister Narendra Modi’s BJP in Maharastra, has decided to contest elections on its own, the party’s president, Uddhav Thackeray, said.\n“We will contest elections in all states without making an alliance,” Thackeray said.\nThe decision makes the Shiv Sena the first major political outfit to break an alliance with the BJP since Modi became prime minister in 2014.\n“The BJP has always wanted an alliance of nationalist parties,” said Keshav Upadhyay, a BJP spokesman in Maharashtra. “The Sena’s decision does not worry us. We have a strong network of cadres in the state to contest elections on our own.”\nThe Shiv Sena enjoys considerable political clout in Maharastra, home to India’s financial capital of Mumbai, and like the BJP, it believes India is a fundamentally Hindu nation, despite its secular constitution.\nFlags are displayed during a joint election rally of Bharatiya Janata Party (BJP) and Hindu hardline party Shiv Sena in Mumbai April 5, 2009. REUTERS/Arko Datta/Files Despite being allies in the state government, power sharing has led to discord between the two parties. The chief minister of Maharashtra is a member of the BJP.\n“The BJP has become arrogant after winning more seats in 2014 assembly elections, it has neglected its alliance partner in power sharing,” said a senior Shiv Sena leader, who declined to be identified as the party is still in the state government.\nThackeray did not specify if the Sena would withdraw support to the state government in Maharashtra, where it has 63 seats in the 288-member state assembly, compared to the 122 held by the BJP.\nIn Davos, the state’s chief minister, Devendra Fadnavis, told reporters his government would complete its full five-year term.\nThe state government’s popularity has waned because it has failed to tackle rural distress, said political analyst Pratap Asbe.\n“It would be difficult for the BJP to secure a majority in Maharashtra in 2019 without the support of the Shiv Sena,” he said.\nIn the last two decades, no party has won the votes needed to form a majority government in Maharashtra, which sends the second-largest number of lawmakers to the parliament.\nReporting by Rajendra Jadhav Editing by Rupam Jain and Clarence Fernandez\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-23T14:00:00.000+02:00", "crawled": "2018-01-23T14:24:49.053+02:00", "highlightTitle": ""}