{"organizations": [], "uuid": "312c2b140a6667b14692f203f1981019239a0ecb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/06/03/103688331-GettyImages-187258949.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/big-price-differences-for-common-surgeries-in-minnesota.html", "country": "US", "domain_rank": 767, "title": "Big price differences for common surgeries in Minnesota", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.158, "site_type": "news", "published": "2018-01-04T20:19:00.000+02:00", "replies_count": 0, "uuid": "312c2b140a6667b14692f203f1981019239a0ecb"}, "author": "Dan Mangan", "url": "https://www.cnbc.com/2018/01/04/big-price-differences-for-common-surgeries-in-minnesota.html", "ord_in_thread": 0, "title": "Big price differences for common surgeries in Minnesota", "locations": [], "entities": {"persons": [{"name": "lefteris pitarakis", "sentiment": "none"}], "locations": [{"name": "minnesota", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The prices paid in Minnesota for several common surgical procedures vary dramatically depending on the hospital where the operation occurs, a new report has found. \nAnd that finding could lead some employers in that state to start making changes to how much they are willing to pay for those services — and where their insured employees can have the procedures done with coverage.\nA total knee replacement operation , for example, can cost as low as around $6,200 in one Minnesota hospital — but as much as nearly $47,000 in another, according to the analysis.\nThat higher price is almost eight times greater than the lowest price.\nAnd a cesarean section delivery of a baby can cost almost five times more at the highest priced hospital, $22,831, than it does at the lowest-priced hospital, $4,693.\nFor a traditional delivery, the highest price identified in the report was $12,303, or more than four times the lowest price, or $2,872.\nFor a total hip replacement , the highest price at a Minnesota hospital was $38,409, more than five times the lowest price of $6,666.\nThe report, issued by the Minnesota Department of Health , is based on claims data for procedures paid for by job-based insurance plans. A group of employers in the state collaborated with the health department for the report.\n\"This is eye-opening information for the purchasers of health care,\" said Carolyn Pare, president and CEO of the Minnesota Health Action Group , which is comprised of both public and private purchasers of health insurance.\n\"Employers have long suspected that there is a great deal of variation in both the quality and the cost of health care, but to be able to see the actual numbers provides them an opportunity to make better purchasing decisions,\" Pare said.\nState health economist Stefan Gildemeister said the report, the first in a planned series on hospital procedure prices, could help health-care markets work more effectively by increasing transparency.\n\"By some estimates, pricing failures from the lack of transparent information on health-care costs contribute more than 14 percent to waste or inefficiency in today's health-care spending,\" Gildemeister said.\n\"We hope this and other upcoming analyses on price variation in Minnesota can provide value to individuals and employers, and contribute to discussions about sustainability in health-care spending growth.\"", "external_links": [], "published": "2018-01-04T20:19:00.000+02:00", "crawled": "2018-01-04T20:19:12.003+02:00", "highlightTitle": ""}