{"organizations": [], "uuid": "3cce01d901b5768e0d431e0eaf4fa8659143705b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-edwin-ed-hada-appointed-as-presidentceo-of-los-angeles-police-federal-credit-union.html", "country": "US", "domain_rank": 767, "title": "Edwin \"Ed\" Hada Appointed as President/CEO of Los Angeles Police Federal Credit Union", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:51:00.000+02:00", "replies_count": 0, "uuid": "3cce01d901b5768e0d431e0eaf4fa8659143705b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-edwin-ed-hada-appointed-as-presidentceo-of-los-angeles-police-federal-credit-union.html", "ord_in_thread": 0, "title": "Edwin \"Ed\" Hada Appointed as President/CEO of Los Angeles Police Federal Credit Union", "locations": [], "entities": {"persons": [{"name": "edwin", "sentiment": "negative"}, {"name": "hada", "sentiment": "negative"}, {"name": "lorie taylor", "sentiment": "none"}, {"name": "ed", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "los angeles police federal credit union van nuys", "sentiment": "none"}, {"name": "lapfcu", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "los angeles police federal credit union", "sentiment": "negative"}, {"name": "information systems", "sentiment": "none"}, {"name": "finance and administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VAN NUYS, Calif., Jan. 17, 2018 /PRNewswire/ -- Los Angeles Police Federal Credit Union (LAPFCU) has appointed Edwin \"Ed\" Hada as President and CEO, effective January 1, 2018. In his new appointment, Hada is responsible for operations and administration of the 39,400 member organization which has $906 million in assets, and addresses the savings and lending needs of the Los Angeles law enforcement community.\nHada previously served for over 10 years as Senior Vice President/Chief Finance Officer, Finance and Administration, at LAPFCU, where he was responsible for overseeing the Finance, Human Resources and Information Systems departments.\n\"We are very pleased to announce our appointment of Mr. Hada,\" explained Lorie Taylor, Chair of the Board for LAPFCU. \"Ed comes to this position with outstanding credentials. He was responsible in great part for helping the credit union to maintain financial stability during the extended recession. Additionally, over recent years, we have seen great strides in our efforts to bring technological enhancements to members. Again, Ed led the team that is responsible for those achievements.\"\n\"I am very honored to accept this position, and look forward to helping LAPFCU to fulfill its mission of providing rewarding financial solutions for its members,\" added Hada. \"We have made great strides over the years in serving our members, and I look forward to furthering that legacy.\"\nBefore coming to LAPFCU, Hada served seven years at WesCorp, a corporate credit union, where he worked as Vice President of Financial Consulting Services and oversaw WesCorp's consulting services to member credit unions for ALM and balance sheet management. He also served as WesCorp's Vice President of Investment Operations for three years.\nHada earned his bachelor's degree in economics from Occidental College in Los Angeles. He also completed the Executive Leadership Skills Program at Graziadio School of Business and Management, Pepperdine University. He is a member of the CUNA (Credit Union National Association) CFO Council, and has been a speaker at numerous credit union industry groups and conferences.\nAbout Los Angeles Police Federal Credit Union\nLos Angeles Police Federal Credit Union (LAPFCU) was founded in 1936 and is based in Van Nuys, California. The Credit Union, with assets of $906 million, currently serves 39,400 members through an expansive roster of savings and loans products and services. For more information, call Manny Padilla, Jr., vice president of Marketing and Business Development, at (818) 779-3311 or visit www.lapfcu.org .\nAttn. Editors: A photo of Mr. Hada can be found at the link below:\nhttps://www.lapfcu.org/wp-content/uploads/2018/01/EdHada.jpg\nView original content: http://www.prnewswire.com/news-releases/edwin-ed-hada-appointed-as-presidentceo-of-los-angeles-police-federal-credit-union-300584237.html\nSOURCE Los Angeles Police Federal Credit Union", "external_links": ["http://www.prnewswire.com/news-releases/edwin-ed-hada-appointed-as-presidentceo-of-los-angeles-police-federal-credit-union-300584237.html", "http://www.lapfcu.org/"], "published": "2018-01-18T00:51:00.000+02:00", "crawled": "2018-01-18T03:32:24.000+02:00", "highlightTitle": ""}