{"organizations": [], "uuid": "6a618e8a551cbae68a9453a4e50f420830681695", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220791860&w=1200&r=LYNXMPEE090JM", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-germany-politics/german-social-democrats-wary-as-coalition-talks-enter-crunch-stage-idUKKBN1EZ10Z", "country": "US", "domain_rank": 408, "title": "German Social Democrats wary as coalition talks enter crunch stage", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T12:41:00.000+02:00", "replies_count": 0, "uuid": "6a618e8a551cbae68a9453a4e50f420830681695"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-politics/german-social-democrats-wary-as-coalition-talks-enter-crunch-stage-idUKKBN1EZ10Z", "ord_in_thread": 0, "title": "German Social Democrats wary as coalition talks enter crunch stage", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "paul carrel", "sentiment": "none"}, {"name": "reuters/hannibal hanschke  merkel", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}, {"name": "andreas rinke", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "christian democratic union", "sentiment": "none"}, {"name": "cdu", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "social democratic party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 42 AM / Updated 26 minutes ago German Social Democrats wary as coalition talks enter crunch stage Andreas Rinke , Paul Carrel 4 Min Read \nBERLIN (Reuters) - German Social Democrats sounded downbeat about their coalition talks with Chancellor Angela Merkel’s conservatives on Wednesday, a day before both camps decide whether they want to move to formal negotiations on establishing a new government. FILE PHOTO - Leader of the Christian Democratic Union (CDU) and the acting German Chancellor Angela Merkel and Social Democratic Party (SPD) leader Martin Schulz shakes hands before exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 7, 2018. REUTERS/Hannibal Hanschke \nMerkel, weakened by an election setback in September, turned to the left-leaning Social Democrats (SPD) to seek a re-run of their so-called “grand coalition” after the collapse in November of talks on a three-way coalition untested at national level. \nThe chancellor, who has won widespread respect abroad in more than 12 years in power, needs the coalition talks to succeed in order to avoid her personal authority being further undermined and Germany’s international standing diminished. \nThe Social Democrats know this, and are playing hard ball. \n“The mood is like the weather,” Ralf Stegner, one of the SPD’s deputy leaders, said as he gazed at the cloudy sky above Berlin ahead of Wednesday’s talks. \nSPD leader Martin Schulz added: “It will be a long day.” \nAs Europe’s largest economy and pre-eminent power broker, Germany is crucial to the region’s fortunes. Berlin’s partners are eagerly awaiting a new German government to help drive forward Brexit talks, euro zone reform and EU diplomatic initiatives. \nSenior officials from the SPD, Merkel’s Christian Democrats (CDU) and their Bavarian sister party, the Christian Social Union (CSU), have been holding exploratory talks this week on whether to pursue formal coalition negotiations. FILE PHOTO - Social Democratic Party (SPD) member Ralf Stegner speaks to the media at the board meeting at the party headquarters in Berlin, Germany, November 27, 2017. REUTERS/Axel Schmidt \nThe talks are due to conclude on Thursday, before SPD leaders recommend to their members whether they should shift into official negotiations. \n“We have a lot of work ahead of us today and tomorrow,” said conservative Finance Minister Peter Altmaier. \nParticipants have described the negotiations as “good”, but SPD leaders need to convince their party members as they are offering them a vote on Jan. 21 on whether to proceed. \nThe leader of the Jusos youth branch of the SPD told broadcaster ARD that a deal between the coalition negotiators to drop plans to lower carbon dioxide emissions by 40 percent from 1990 levels by 2020 “was not a good start to these talks”. \nMerkel has ruled with the SPD in a sometimes unwieldy “grand coalition” in two of her three previous terms in office, including in the last parliament from 2013-2017. But both parties bled support in the Sept. 24 election, which saw the far-right Alternative for Germany (AfD) enter the Bundestag (national parliament) for the first time. \nMany in the SPD rank-and-file oppose a repeat of the grand coalition as they fear it will further diminish the identity of the party, which suffered its worst result in September’s vote since 1933. Some SPD members are also concerned that a new grand coalition would make the AfD the main opposition party. \nDespite such reticence, German media reported on Tuesday that conservative and SPD negotiators had reached agreement on a law to attract skilled immigrants. \nShould the two biggest party groups fail to agree on moving ahead, Merkel could try to form a minority government or Germany could face new elections. \nPresident Frank-Walter Steinmeier, eager to broker a deal, is keenly aware that the source of Germany’s international clout is its economic might and that businesses want a stable coalition soon to end the uncertainty and avoid another vote. Writing by Paul Carrel; editing by Mark Heinrich", "external_links": [], "published": "2018-01-10T12:41:00.000+02:00", "crawled": "2018-01-10T13:06:55.013+02:00", "highlightTitle": ""}