{"organizations": [], "uuid": "36abaa9c3197b7a0d0465d9a2cd40e43c6c9a5c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/canada-pipeline-transmountain/update-1-canadian-city-argues-trans-mountain-pipeline-route-harmful-idUSL2N1PI1BW", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Canadian city argues Trans Mountain pipeline route harmful", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T06:07:00.000+02:00", "replies_count": 0, "uuid": "36abaa9c3197b7a0d0465d9a2cd40e43c6c9a5c0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/canada-pipeline-transmountain/update-1-canadian-city-argues-trans-mountain-pipeline-route-harmful-idUSL2N1PI1BW", "ord_in_thread": 0, "title": "UPDATE 1-Canadian city argues Trans Mountain pipeline route harmful", "locations": [], "entities": {"persons": [{"name": "julie gordon", "sentiment": "none"}, {"name": "kinder morgan", "sentiment": "none"}, {"name": "gregory mcdade", "sentiment": "none"}], "locations": [{"name": "trans mountain", "sentiment": "none"}, {"name": "kinder morgan canada", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "burnaby", "sentiment": "none"}, {"name": "burnaby", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "trans mountain", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts first sentence to reflect that hearing has begun, adds comments by city and company officials, changes dateline, previous VANCOUVER)\nBy Julie Gordon\nBURNABY, British Columbia, Jan 23 (Reuters) - The proposed route of Kinder Morgan Canada’s C$7.4 billion ($5.9 billion) Trans Mountain pipeline expansion will pass through a conservation area in Burnaby, British Columbia, potentially harming sensitive ecosystems, the city argued on Tuesday.\nThe Vancouver suburb also questioned, in an often testy exchange during its first day of route hearings in front of Canada’s national energy regulator, the company’s efforts to consult with the city prior to choosing its final path.\n“There’s been absolutely no consultation here,” Burnaby’s lawyer, Gregory McDade, told reporters outside the hearings, adding: “At the very least, we shouldn’t allow the pipeline company to come in and steal our parks and green spaces as the easy way to build their pipeline.”\nIn response, Kinder Morgan said Trans Mountain would run between an existing rail line and highway adjacent to the conservation area, adding it had done extensive in-person and online consultation in the city.\n“What we’ve chosen is the route that we think is the least disruptive for the community,” spokeswoman Ali Hounsell told Reuters.\nBurnaby, a city of 233,000, is a staunch opponent to the proposed twinning of the Trans Mountain oil pipeline and is hoping to use the National Energy Board (NEB) route hearings to block the construction of the project.\nWhile the expansion was approved by the Canadian government in 2016, the hearings are to help determine the exact route of the 1,147-kilometer (712 mile) pipeline.\nThe project entails building a second pipeline largely along the route of the existing one, though it will follow a new path through the Vancouver area, which has grown more dense in the decades since the original line was built.\nBurnaby has been sparring with Kinder Morgan for years over the project, which would nearly triple capacity to 890,000 barrels per day on the line from Alberta’s energy heartland to a marine terminal in the city.\nThe city has repeatedly used its municipal permitting power to delay work related to the project. Last week, Kinder Morgan pushed back the startup of the expanded line to December 2020, adding another three months to a previous nine-month delay it has blamed on the permitting difficulty.\nThe project is backed by Canadian oil producers, who are desperate for access to new international markets for their product. It faces opposition from some municipalities, aboriginal groups and environmental activists.\nThe current round of route hearings will run until Jan. 31, with more to come in communities all along the pipeline’s path. The route must be finalized before full construction can begin. ($1 = 1.2466 Canadian dollars) (Reporting by Julie Gordon in Burnaby, B.C.; Editing by Andrew Hay and Matthew Lewis)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T06:07:00.000+02:00", "crawled": "2018-01-24T15:38:49.009+02:00", "highlightTitle": ""}