{"organizations": [], "uuid": "c7c6dbdba072f2f52da67ff6139e880924680415", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-sap-se-stellar-new-cloud-bookings-up-31-percent-in-q4-at-constant-currencies--eps-up-double-digits.html", "country": "US", "domain_rank": 767, "title": "SAP SE: Stellar New Cloud Bookings, Up 31% in Q4 at Constant Currencies - EPS Up Double Digits", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T09:01:00.000+02:00", "replies_count": 0, "uuid": "c7c6dbdba072f2f52da67ff6139e880924680415"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-sap-se-stellar-new-cloud-bookings-up-31-percent-in-q4-at-constant-currencies--eps-up-double-digits.html", "ord_in_thread": 0, "title": "SAP SE: Stellar New Cloud Bookings, Up 31% in Q4 at Constant Currencies - EPS Up Double Digits", "locations": [], "entities": {"persons": [{"name": "leonardo", "sentiment": "none"}, {"name": "luka mucic", "sentiment": "none"}, {"name": "bill mcdermott", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "sap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALLDORF, Germany, Jan. 30, 2018 /PRNewswire/ -- SAP SE (NYSE: SAP) today announced its preliminary financial results for the fourth quarter and twelve months ended December 31, 2017.\n\"We promised fast cloud growth – we delivered! Only SAP continues this growth trifecta at scale with cloud, software and operating income. The record setting adoption of S/4HANA has ignited the entire SAP cloud. Customers are inventing industry next practices for the intelligent enterprise with SAP Leonardo. SAP's future is rock solid!\" - Bill McDermott, CEO\n\"We ended the year strongly with new cloud bookings surging 31% on top of a stellar prior Q4. As promised we initiated the margin turnaround with a Q4 Non-IFRS operating margin of 35.2% at constant currencies. This paves the way for the strong growth and margin expansion we expect in 2018 and beyond.\" - Luka Mucic, CFO\nBusiness Highlights\nFinancial Highlights\nFull Year 2017\nSAP has consistently met all its outlook metrics ever since it laid out its 2020 ambitions in early 2015. The year 2017 was no different: Even after multiple guidance raises during the year SAP hit all its outlook metrics.\nFor the full year 2017, cloud and software revenue grew by 6% (IFRS) or 8% (non-IFRS at constant currencies), achieving the full year outlook raised in October (7.0% to 8.5% growth non-IFRS at constant currencies). Cloud subscriptions and support revenue was €3.77 billion (IFRS) or €3.83 billion (non-IFRS at constant currencies), achieving the full year outlook (€3.8 to €4.0 billion non-IFRS at constant currencies). Software revenue was €4.87 billion (IFRS), stable year over year or up 2% (non-IFRS at constant currencies). Total revenue was €23.46 billion (IFRS) or €23.77 billion (non-IFRS at constant currencies), reaching the upper end of the full year outlook raised in October (€23.4 to €23.8 billion non-IFRS at constant currencies).\nNew cloud bookings 1 in the full year was €1.45 billion or up 26% (up 30% at constant currencies). New cloud and software license order entry 2 grew by 17% at constant currencies year over year in the full year. Cloud subscriptions and support backlog 3 increased 38%, reaching €7.5 billion at year-end.\nFor the full year 2017, operating profit was €4.88 billion (IFRS) or €6.92 billion (non-IFRS at constant currencies), achieving the full year outlook raised in October (€6.85 to €7.00 billion non-IFRS at constant currencies). Earnings per share increased 10% to €3.36 (IFRS) and 14% to €4.44 (non-IFRS), driven by the strong operating performance, another great contribution from Sapphire Ventures, and one-time tax benefits from an intra group transfer of intellectual property rights to SAP SE and the U.S. tax reform.\nSAP's rapidly expanding cloud business together with solid growth in support revenue continued to drive the share of more predictable revenue. The total of cloud subscriptions & support revenue and software support revenue was 63% of total revenue for the full year 2017, up 1 percentage points.\nOperating cash flow for the full year was €5.05 billion, an increase of 9% year over year. Free cash flow increased 4% year over year to €3.77 billion. At year end, net liquidity was –€1.48 billion, an improvement of €1.7 billion year over year. In the full year, the company bought back €500 million in shares and paid a dividend of €1.5 billion.\nFourth Quarter 2017\nSAP's fast growth in the cloud continued in the fourth quarter. New cloud bookings grew by 22% (31% at constant currencies) in the fourth quarter and reached €591 million, delivering on the promise made in October to reaccelerate new cloud bookings. Cloud subscriptions and support revenue grew 20% year over year to €995 million (IFRS) or 28% (non-IFRS at constant currencies). Software revenue was €2.06 billion (IFRS), down 5% year over year or 1% (non-IFRS at constant currencies). Cloud and software revenue was €5.81 billion (IFRS), up 1% year over year or 6% (non-IFRS at constant currencies). Total revenue was €6.81 billion (IFRS) up 1% year over year or 6% (non-IFRS at constant currencies). New cloud and software license order entry grew by 13% at constant currencies year over year in the fourth quarter.\nFourth quarter operating profit was up 1% year over year to €1.96 billion (IFRS) or up 6% (non-IFRS at constant currencies). Throughout 2017 SAP steadily worked on improving its operating margin performance. While the non-IFRS operating margin at constant currencies declined 1.4 percentage points year over year in the first half of 2017, this improved to a drop of 0.9 percentage points year over year in the third quarter. As planned, the fourth quarter signaled the beginning of a turnaround with a decline of only 0.1 percentage points year over year. Earnings per share increased 21% to €1.55 (IFRS) and increased 16% to €1.77 (non-IFRS), reflecting the one-time tax benefits outlined above.\nSAP S/4HANA\nSAP's next generation ERP S/4HANA sits at the core of the Intelligent Enterprise. With S/4HANA customers can massively simplify their IT landscape, run live and reinvent their business model for the digital economy across both cloud and on-premise deployments.\nS/4HANA adoption grew to more than 7,900 customers, up around 46% year over year. In the fourth quarter, approximately 1,000 additional customers signed up of which more than 40% were net new. S/4HANA continues to be adopted by world-class global companies, including Standard Chartered, Puma, Emirates Group, Unilever and Philips66 in the quarter.\nS/4HANA Cloud is positioned as a leader in three categories by industry analyst firm IDC: Midmarket ERP, Large Enterprise ERP and Finance & Accounting. Cirque du Soleil and Fraport AG were among those selecting S/4HANA Cloud in the fourth quarter.\nSAP Leonardo\nSAP Leonardo brings together deep process and industry expertise, advanced design thinking methodology and cutting edge software capabilities such as IoT, Big Data, Machine Learning, Analytics, and Blockchain. SAP Leonardo is about orchestrating these disruptive capabilities to create completely new ways of working and new business models. The San Francisco 49ers are among many others that adopted SAP Leonardo solutions in the fourth quarter to redefine their businesses and become intelligent enterprises.\nHuman Capital Management\nWith SuccessFactors and Fieldglass, SAP delivers total workforce management across both permanent and contingent labor. Increasingly, HR is asked to include external workers in planning and to effectively establish a total talent supply. The SuccessFactors suite is localized for 89 countries and 42 languages. SuccessFactors Employee Central, which is the core of SAP's HCM offering, ended the year with more than 2,300 total customers and scored numerous competitive wins in the fourth quarter including Foxconn, Akzo Nobel and Beiersdorf, Inc.\nCustomer Engagement and Commerce\nSAP's next generation customer engagement solutions enable businesses to manage their front office across the entire spectrum from marketing to sales to services – seamlessly and in real-time. Businesses get a single view of their customer – be it social, retail or e-commerce. SAP's Customer Engagement and Commerce (CEC) solutions serve both B2C and B2B across a wide range of industries, including retail, telco, financial services, manufacturing and the public sector. SAP's CEC solutions once again achieved strong double-digit growth in new cloud bookings. Robert Bosch and Deutsche Telekom chose Hybris this quarter. In the fourth quarter, SAP closed the acquisition of Gigya, a market leader for customer identity and access management. This will further enhance SAP's CEC solutions by enabling companies to better manage customers' profile, preference and consent, with customers maintaining control of their data at all times.\nBusiness Networks\nEach of SAP's business network solutions provides a rich, open, global platform that connects a large ecosystem of customers, suppliers, partners and developers delivering ever expanding content and innovation. On the Ariba Network, over 3.1 million companies in over 180 countries collaborate and trade over $1 trillion in goods and services annually. The Ariba Network provides transparency and insight into supply chains that enable companies to ensure they are acting in ethically responsible ways. In the fourth quarter, we had deals with Ford Motor and Coca-Cola.\nSAP Concur helps close to 50 million end users to effortlessly process travel and expenses. In the fourth quarter, we had deals with Vodafone and Barclays. With SAP Fieldglass customers manage over 4.3 million contingent workers in more than 180 countries. In the fourth quarter, UBS chose SAP Fieldglass. In the fourth quarter, total revenue in the SAP Business Network segment was up 18% to €615 million at constant currencies year over year and the gross margin improved 2 percentage points to 77%.\nRegional Revenue Performance in the Fourth Quarter 2017\nSAP had a solid performance in the EMEA region with cloud and software revenue increasing 3% (IFRS) and 4% (non-IFRS at constant currencies). Cloud subscriptions and support revenue was exceptional and grew by 51% (IFRS) and 56% (non-IFRS at constant currencies) with Germany and Russia being the highlights. In addition, SAP had strong double-digit software revenue growth in Russia, Switzerland and the Netherlands.\nThe Company was significantly impacted by currency headwinds in the Americas region. Cloud and software revenue declined by 3% (IFRS), but was up 6% (non-IFRS at constant currencies). Cloud subscriptions and support revenue increased by 7% (IFRS) and 16% (non-IFRS at constant currencies). In Latin America, Brazil was a highlight with an overall strong performance. In North America, Canada had strong double digit growth in software revenue.\nIn the APJ region, SAP had a very strong performance in both cloud and software revenue as well as cloud subscriptions and support revenue despite strong currency headwinds. Cloud and software revenue was up 4% (IFRS) and 11% (non-IFRS at constant currencies). Cloud subscriptions and support revenue grew by 38% (IFRS) and 49% (non-IFRS at constant currencies) with China and Japan being highlights. For software revenue, both Australia and Singapore had an impressive quarter with double-digit growth.\nFinancial Results at a Glance\nFourth Quarter 2017 1)\nIFRS\nNon-IFRS 2)\n€ million, unless otherwise stated\nQ4 2017\nQ4 2016\n∆ in %\nQ4 2017\nQ4 2016\n∆ in %\n∆ in %\nconst.\ncurr.\nNew Cloud Bookings 3)\nN/A\nN/A\nN/A\n591\n483\n22\n31\nCloud subscriptions and support\n995\n827\n20\n997\n827\n21\n28\nSoftware licenses and support\n4,813\n4,933\n–2\n4,813\n4,934\n–2\n2\nCloud and software\n5,807\n5,760\n1\n5,809\n5,761\n1\n6\nTotal revenue\n6,805\n6,724\n1\n6,807\n6,724\n1\n6\nShare of predictable revenue (in %)\n55\n53\n2pp\n55\n53\n2pp\nOperating profit\n1,964\n1,950\n1\n2,364\n2,375\n0\n6\nProfit after tax\n1,867\n1,526\n22\n2,136\n1,826\n17\nBasic earnings per share (€)\n1.55\n1.27\n21\n1.77\n1.53\n16\nNumber of employees (FTE, December 31)\n88,543\n84,183\n5\nN/A\nN/A\nN/A\nN/A\nFull Year 2017 1)\nIFRS\nNon-IFRS 2)\n€ million, unless otherwise stated\nQ1–Q4\n2017\nQ1–Q4\n2016\n∆ in %\nQ1–Q4\n2017\nQ1–Q4\n2016\n∆ in %\n∆ in %\nconst. curr.\nNew Cloud Bookings 3)\nN/A\nN/A\nN/A\n1,448\n1,147\n26\n30\nCloud subscriptions and support\n3,769\n2,993\n26\n3,771\n2,995\n26\n28\nSoftware licenses and support\n15,780\n15,431\n2\n15,781\n15,434\n2\n4\nCloud and software\n19,549\n18,424\n6\n19,552\n18,428\n6\n8\nTotal revenue\n23,461\n22,062\n6\n23,464\n22,067\n6\n8\nShare of predictable revenue (in %)\n63\n61\n1pp\n63\n61\n1pp\nOperating profit\n4,877\n5,135\n–5\n6,769\n6,633\n2\n4\nProfit after tax\n4,056\n3,634\n12\n5,356\n4,658\n15\nBasic earnings per share (€)\n3.36\n3.04\n10\n4.44\n3.90\n14\nNumber of employees (FTE, December 31)\n88,543\n84,183\n5\nN/A\nN/A\nN/A\nN/A\n1) All figures are unaudited.\n2) For a detailed description of SAP's non-IFRS measures see Explanation of Non-IFRS Measures online. For a breakdown of the individual adjustments see table \"Non-IFRS Adjustments by Functional Areas\" in this Quarterly Statement.\n3) As this is an order entry metric, there is no IFRS equivalent.\nDue to rounding, numbers may not add up precisely.\nBusiness Outlook 2018\nThe Company is providing the following 2018 outlook:\nBased on the continued strong momentum in SAP's cloud business the Company expects full year 2018 non-IFRS cloud subscriptions and support revenue to be in a range of €4.8 billion − €5.0 billion at constant currencies (2017: €3.77 billion). This range represents a growth rate of 27% – 33% at constant currencies. The Company expects full year 2018 non-IFRS cloud and software revenue to be in a range of €20.7 – €21.1 billion at constant currencies (2017: €19.55 billion). This range represents a growth rate of 6% – 8% at constant currencies. The Company expects full year 2018 non-IFRS total revenue to be in a range of €24.6 billion − €25.1 billion at constant currencies (2017: €23.46 billion). This range represents a growth rate of 5% – 7% at constant currencies. The Company expects full-year 2018 non-IFRS operating profit to be in a range of €7.3 billion − €7.5 billion at constant currencies (2017: €6.77 billion). This range represents a growth rate of 8% – 11% at constant currencies.\nThis outlook does not include any contributions from Callidus Software Inc. The company will provide an update on its outlook subsequent to the closing of the contemplated acquisition.\nWhile the Company's full-year 2018 business outlook is at constant currencies, actual currency reported figures are expected to be impacted by currency exchange rate fluctuations as we progress through the year. If exchange rates remain at the early January level for the rest of the year, we expect non-IFRS cloud and software revenue to experience a currency headwind in a range of –7 to –9pp in Q1 18 and –3 to –5pp for the full year 2018 and non-IFRS operating profit to experience a currency headwind in a range of –6 to –8pp in Q1 18 and –4 to –6pp for the full year 2018.\nIFRS 15 Impact\nAs of January 1, 2018, SAP changed several of its accounting policies to adopt IFRS 15 'Revenue from Contracts with Customers'. Under the IFRS 15 adoption method chosen by SAP prior years are not restated to conform to the new policies. Consequently, the year-over-year growth of revenue and profit in 2018 will be impacted by the new policies.\nThe Company expects the impact of the policy change 4 on revenue, operating expenses and profit to be as follows:\nRevenues are expected to experience a benefit of substantially less than €0.1 billion with most of the difference resulting from exercises of customer software purchase options granted in prior years which result in software revenue. Operating expenses are expected to benefit, in cost of sales and marketing, in the amount of approximately €0.2 billion from higher capitalization of sales commissions. Other policy changes will weigh on operating expenses with an additional cost of revenue of substantially less than €0.1 billion. The above-mentioned effects will result in a net positive impact on operating profit of approximately €0.2 billion.\nAmbition 2020\nLooking beyond 2018, SAP is also reiterating its 2020 ambition for cloud, total revenue, operating profit and more predictable revenue share last provided at the beginning of 2017 to reflect the Company's consistent fast growth in the cloud, solid software momentum and operating profit expansion. Despite the currency headwinds in 2017 SAP continues to strive to reach the following in 2020:\n€8.0 − €8.5 billion non-IFRS cloud subscriptions and support revenue €28 − €29 billion non-IFRS total revenue €8.5 − €9.0 billion non-IFRS operating profit SAP continues to expect the share of more predictable revenue (defined as the total of cloud subscriptions & support revenue and software support revenue) to reach 70% − 75% in 2020.\nSAP will discuss the key drivers behind the long-term growth aspirations in its Integrated Report and at the Company's Capital Markets Day in New York on March 6 th , 2018.\nThe full Q4 2017 Quarterly Statement can be downloaded from http://www.sap.com/investors/sap-2017-q4-statement\nAdditional Information\nGeneral Remarks about this Quarterly Statement and the SAP Integrated Report\nSince Q1 2016, we issue a quarterly statement for each of the four fiscal quarters. Additionally, we issue a half year report and a full year integrated report. SAP's 2016 Integrated Report and 2016 Annual Report on Form 20-F were published on February 28, 2017, and are available for download at www.sapintegratedreport.com . The 2017 Integrated Report and Annual Report on Form 20-F will be published on February 28, 2018, and will be available for download under the same link.\nFor a more detailed description of all of SAP's non-IFRS measures and their limitations as well as our constant currency and free cash flow figures see Explanation of Non-IFRS Measures online.\nWebcast\nSAP senior management will host a press conference in Walldorf today at 10:00 AM (CET) /9:00 AM (GMT) / 4:00 AM (Eastern) / 1:00 AM (Pacific), followed by a financial analyst conference call at 2:00 PM (CET) / 1:00 PM (GMT) / 8:00 AM (Eastern) / 5:00 AM (Pacific). Both conferences will be webcast live on the Company's website at www.sap.com/investor and will be available for replay. Supplementary financial information pertaining to the full-year and quarterly results can be found at www.sap.com/investor .\nAbout SAP\nAs market leader in enterprise application software, SAP (NYSE: SAP) helps companies of all sizes and industries run better. From back office to boardroom, warehouse to storefront, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable more than 378,000 business and public sector customers to operate profitably, adapt continuously, and grow sustainably. For more information, visit www.sap.com .\nFor more information, financial community only:\nStefan Gruber\n+49 (6227) 7-44872\ninvestor@sap.com , CET\nFollow SAP Investor Relations on Twitter at @sapinvestor.\nFor more information, press only:\nNicola Leske\n+49 (6227) 7-50852\nnicola.leske@sap.com , CET\nDaniel Reinhardt\n+49 (6227) 7-40201\ndaniel.reinhardt@sap.com , CET\nRajiv Sekhri\n+49 (6227) 7-74871\nrajiv.sekhri@sap.com , CET\nFor customers interested in learning more about SAP products:\nGlobal Customer Center:\n+49 180 534-34-24\nUnited States Only:\n+1 (800) 872-1SAP (+1-800-872-1727)\nAny statements contained in this document that are not historical facts are forward-looking statements as defined in the U.S. Private Securities Litigation Reform Act of 1995. Words such as \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"forecast,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"predict,\" \"should\" and \"will\" and similar expressions as they relate to SAP are intended to identify such forward-looking statements. SAP undertakes no obligation to publicly update or revise any forward-looking statements. All forward-looking statements are subject to various risks and uncertainties that could cause actual results to differ materially from expectations. The factors that could affect SAP's future financial results are discussed more fully in SAP's filings with the U.S. Securities and Exchange Commission (\"SEC\"), including SAP's most recent Annual Report on Form 20-F filed with the SEC. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of their dates.\n© 2018 SAP SE. All rights reserved.\nNo part of this publication may be reproduced or transmitted in any form or for any purpose without the express permission of SAP SE. The information contained herein may be changed without prior notice.\nSome software products marketed by SAP SE and its distributors contain proprietary software components of other software vendors. National product specifications may vary.\nThese materials are provided by SAP SE and its affiliated companies (\"SAP Group\") for informational purposes only, without representation or warranty of any kind, and SAP Group shall not be liable for errors or omissions with respect to the materials. The only warranties for SAP Group products and services are those that are set forth in the express warranty statements accompanying such products and services, if any. Nothing herein should be construed as constituting an additional warranty.\nSAP and other SAP products and services mentioned herein as well as their respective logos are trademarks or registered trademarks of SAP SE (or an SAP affiliate company) in Germany and other countries. Please see http://www.sap.com/corporate-en/legal/copyright/index.epx#trademark for additional trademark information and notices.\n1 New cloud bookings consist of order entry of a given period that is expected to be classified as cloud subscriptions and support revenue and results from purchases by new customers and from incremental purchases by existing customers. Consequently, orders to renew existing contracts are not included. The order amount must be committed. Consequently, due to their pay-per-use nature, business network transaction fees which do not include a committed minimum consumption are not reflected in the bookings metric (e.g. SAP Ariba and SAP Fieldglass transaction-based fees). Amounts included in the measures are generally annualized.\n2 New cloud and software license order entry is the total of new cloud order entry and software license order entry. The new cloud order entry metric is identical to the new cloud bookings metric defined above except that it considers the total contract value (TCV) of the orders where the new cloud bookings metric considers the orders' annualized contract value (ACV). Software license order entry is the total of all orders received in a given period, the revenue from which is expected to be classified as software license revenue. The support services commonly sold with the software licenses are not included in the software license order entry metric.\n3 Cloud subscription and support backlog represents expected future cloud subscriptions & support revenue that is contracted but not yet invoiced and thus not recorded in deferred revenue.\n4 \"Impact of the accounting policy change\" means the difference between a revenue and profit measure determined under SAP's new IFRS 15-based policies and the respective measure as it would stand had our previous accounting policies continued to apply.\nView original content with multimedia: http://www.prnewswire.com/news-releases/sap-se-stellar-new-cloud-bookings-up-31-in-q4-at-constant-currencies---eps-up-double-digits-300589997.html\nSOURCE SAP SE", "external_links": ["http://www.sap.com/investors/sap-2017-q4-statement", "http://www.sap.com/investors/sap-non-ifrs-measures", "http://www.sapintegratedreport.com/", "http://www.prnewswire.com/news-releases/sap-se-stellar-new-cloud-bookings-up-31-in-q4-at-constant-currencies---eps-up-double-digits-300589997.html", "http://www.sap.com/corporate-en/legal/copyright/index.epx%23trademark", "http://www.sap.com/investor", "http://www.sap.com/corporate-en/legal/copyright/index.epx#trademark", "http://www.sap.com/"], "published": "2018-01-30T09:01:00.000+02:00", "crawled": "2018-01-30T10:27:19.002+02:00", "highlightTitle": ""}