{"organizations": [], "uuid": "03282eab7918025d708bc4eb2fe0eb0481dbe925", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-egypt-politics/egypts-elections-find-last-minute-challenger-to-sisi-idUKKBN1FI1B3", "country": "US", "domain_rank": 408, "title": "Egypt's elections find last-minute challenger to Sisi", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T13:44:00.000+02:00", "replies_count": 0, "uuid": "03282eab7918025d708bc4eb2fe0eb0481dbe925"}, "author": "", "url": "https://uk.reuters.com/article/uk-egypt-politics/egypts-elections-find-last-minute-challenger-to-sisi-idUKKBN1FI1B3", "ord_in_thread": 0, "title": "Egypt's elections find last-minute challenger to Sisi", "locations": [], "entities": {"persons": [{"name": "hosni mubarak", "sentiment": "none"}, {"name": "mousa", "sentiment": "none"}, {"name": "mousa mostafa mousa", "sentiment": "none"}, {"name": "mohamed mursi", "sentiment": "none"}, {"name": "ghad", "sentiment": "none"}, {"name": "abdel fattah", "sentiment": "none"}, {"name": "sisi", "sentiment": "none"}], "locations": [{"name": "cairo", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "sisi   egypt", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "sisi reuters staff", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 11:48 AM / Updated 14 minutes ago Egyptian politician emerges as sole election challenger to Sisi Reuters Staff 4 Min Read \nCAIRO (Reuters) - An Egyptian politician emerged just ahead of a deadline on Monday as the sole challenger to President Abdel Fattah al-Sisi in an election in March the incumbent is set to win after other candidates withdrew citing repression. \nMousa Mostafa Mousa leads the Ghad party that has endorsed Sisi for a second term and even organised events to help nominate the former military commander as recently as last week. \nSisi was elected in 2014, a year after leading the army to oust President Mohamed Mursi, an Islamist. It is the third election since protests in 2011 unseated long-time ruler Hosni Mubarak. \nSeveral leading opposition figures called on Sunday for an election boycott, blaming repression that has cleared the field of challengers and left Sisi’s top opponent in jail. \nAt the time of Mousa’s registration, his personal Facebook page included a cover photo with Sisi’s face and “we support you as president of Egypt” written beneath it. \n“We were supporting President Sisi before the decision to participate was taken,” deputy head of the Ghad party Mahmoud Mousa told Reuters. \n“We have a respectable programme that we are offering to the Egyptian people and we are presenting ourselves just like any other candidate would,” he said. \nMousa said he registered his candidacy at the electoral commission after having collected the required number of nomination pledges, submitting his official paperwork just minutes before the final deadline. Samir Abdel Azem (C) Egyptian Lawyer of Ghad Party chairperson Moussa Mostafa Moussa carries the presidential candidacy papers in front of the National Election Authority, in Cairo, Egypt January 29, 2018. REUTERS/Mohamed Abd El Ghany \nWould-be candidates were required to register by 2 p.m. (1200 GMT) on Monday after clinching at least 20 nominations from parliament or 25,000 pledges from citizens across the country. \nMousa said he had netted 47,000 pledges and the backing of 27 lawmakers. The electoral commission said last week that Sisi had earned more than 1 million pledges. Over 500 of parliament’s 595 lawmakers had already pledged support for Sisi. Slideshow (2 Images) \nThe vote, slated for March 26-28, has come under heavy criticism from the United Nations, rights groups, and opposition figures who say its environment has been compromised by intimidation of opposition supporters, arrests, and a nomination process stacked in favour of the incumbent. \nThe electoral commission has said that it will ensure the vote is fair and transparent. \nThe last-minute bid comes days after Hisham Genena, a former anti-corruption watchdog chief who had been working to elect former military chief of staff Sami Anan, was attacked and badly wounded outside his home on Saturday. \nAnan’s campaign was abruptly halted after he was arrested last week and accused of running for office without military permission. \nFollowing the attack, a group of prominent figures including members of Anan’s campaign, former Islamist presidential candidate Abdel Moneim Abol Foutoh, and Mohamed Anwar Sadat, who halted his own presidential bid out of concern for the safety of his campaigners, called for a boycott. \nThey said the state’s policies were paving the way for extended limits to presidential terms and were “removing any opportunity for the peaceful transfer of power”. Reporting by Momen Saeed Attallah, Nadine Awadalla, and Mahmoud Mourad; Writing by Eric Knecht; Editing by Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-29T13:44:00.000+02:00", "crawled": "2018-01-29T14:19:08.005+02:00", "highlightTitle": ""}