{"organizations": [], "uuid": "8b77187810c57bd5dba1cab3c174094506bebb30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-romania-government/romanias-president-names-european-lawmaker-dancila-as-pm-designate-idUSKBN1F623R", "country": "US", "domain_rank": 408, "title": "Romania's President names European lawmaker Dancila as PM designate", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T18:12:00.000+02:00", "replies_count": 0, "uuid": "8b77187810c57bd5dba1cab3c174094506bebb30"}, "author": "", "url": "https://www.reuters.com/article/us-romania-government/romanias-president-names-european-lawmaker-dancila-as-pm-designate-idUSKBN1F623R", "ord_in_thread": 0, "title": "Romania's President names European lawmaker Dancila as PM designate", "locations": [], "entities": {"persons": [{"name": "danci", "sentiment": "negative"}, {"name": "dancila", "sentiment": "negative"}, {"name": "iohannis", "sentiment": "none"}, {"name": "klaus iohannis", "sentiment": "none"}, {"name": "viorica dancila", "sentiment": "none"}, {"name": "radu marinas", "sentiment": "none"}, {"name": "hugh lawson", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "bucharest", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}, {"name": "social democrat", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 4:12 PM / in an hour Romanian president picks Dancila as new PM, graft in spotlight Luiza Ilie , Radu-Sorin Marinas 4 Min Read \nBUCHAREST (Reuters) - Romania’s President Klaus Iohannis appointed European Parliament lawmaker Viorica Dancila as prime minister-designate on Wednesday, the country’s third head of the government in a year and its first female premier. \nHer appointment will mostly be judged at home and by investors on whether it will hamper or facilitate the European Union state’s struggle to stamp out high-level corruption. \nIt had been widely thought Iohannis might veto the Social Democrats’ (PSD) pick to replace Mihai Tudose, who quit after falling out with powerful party leader Liviu Dragnea. \nDragnea is one of a number of ruling coalition members facing trial on graft charges, while the president has become an outspoken critic of the PSD’s record on combating corruption. Dragnea denies any wrongdoing. \nBut the president adhered to what he called “parliamentary arithmetic” to approve Dancila, 54, who has close ties to Dragnea from their days working for the same county council. \n“For me it’s very clear that the Social Democrats have a majority ... so I weighted all arguments and decided to name their proposal for premier,” Iohannis told reporters after holding consultations with all political parties. \n“I decided to give the PSD another chance,” he said, adding a cabinet should be formed by Feb. 1. Dragnea told reporters the vote in parliament would take place on Jan. 29. \nIohannis urged the PSD to start delivering on its electoral promises to meet the expectations of Romanians. \nPrevious party attempts to decriminalize some corruption offences were seen by the public as an attempt to avoid prosecution and sparked massive street protests. \nAnd some commentators saw the appointment of Dancila as allowing Dragnea to wield more power - potentially setting back the fight against organized crime and abuse of office. \n“Romania’s real prime minister designate is Liviu Dragnea. Dancila will be just his proxy,” said independent political commentator Cristian Patrasconiu. “This could hamper an European Union-backed drive to counter sleaze.” REVOLVING DOOR \nDespite the revolving door to the prime minister’s office and the biggest protests in Romania since the 1989 fall of communism, the PSD and junior coalition partner ALDE control government and have a solid majority in parliament. \nRomania was the EU’s fastest-growing economy last year but it remains its second-poorest and in 2018 it faces rising current account and budget deficits as well as interest rates. \nTransparency International ranks Romania as one of the European Union’s most corrupt states and Brussels keeps its justice system under special monitoring, although it has praised magistrates for their efforts to root out high-level graft. \nDragnea cannot be prime minister because of a previous conviction in a vote-rigging case. \nGiven the support of Dragnea and now the backing of the president, Dancila could push through changes to judicial rules as government decrees, bypassing the lengthy legislative process. \nTudose, as he distanced himself from Dragnea, appeared reluctant to do so, preferring to allow parliament to have its say. His predecessor, Sorin Grindeanu, backed down from changing the criminal code in the face of street protests. \nAccording to Romanian law, Dancila has 10 days to ask parliament for a vote of confidence for her cabinet, which she is expected to win by a comfortable margin. \nRomania’s leu edged up 0.1 percent on the day to trade at 4.6500 to the euro following the nomination. Writing by Justyna Pawlak; Editing by Alison Williams", "external_links": [], "published": "2018-01-17T18:12:00.000+02:00", "crawled": "2018-01-17T18:23:21.001+02:00", "highlightTitle": ""}