{"organizations": [], "uuid": "9fba4760818b675ced2ba497cb31774b29b10fcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1946, "shares": 1946, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/09/gettyimages-825626688.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/ivanka-trump-president-wolff/", "country": "US", "domain_rank": 1196, "title": "Ivanka Trump Wants to Be the First Woman President, Claims Wolff Book | Fortune", "performance_score": 10, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.628, "site_type": "news", "published": "2018-01-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "9fba4760818b675ced2ba497cb31774b29b10fcf"}, "author": "Kristen Bellstrom", "url": "http://fortune.com/2018/01/04/ivanka-trump-president-wolff/", "ord_in_thread": 0, "title": "Ivanka Trump Wants to Be the First Woman President, Claims Wolff Book | Fortune", "locations": [], "entities": {"persons": [{"name": "kristen bellstrom", "sentiment": "negative"}, {"name": "ivanka trump", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "jared kushner", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}, {"name": "ivanka", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "new york magazine", "sentiment": "none"}], "organizations": [{"name": "trump white house", "sentiment": "none"}, {"name": "town & country", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "trump organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kristen Bellstrom January 4, 2018 \nThere are plenty of juicy details in Fire and Fury: Inside the Trump White House, the new book by Michael Wolff, but for Ivanka Trump watchers, perhaps the biggest reveal is that the First Daughter hopes to eventually add another big first to her resume: President of the United States. \nAn excerpt from the book, published Wednesday in New York Magazine , describes Trump and her husband Jared Kushner (who, according to Wolff, former White House strategist Steve Bannon refers to as “Jarvanka”) settling into their new White House roles—and looking ahead: \nBetween themselves, the two had made an earnest deal: If sometime in the future the opportunity arose, she’d be the one to run for president. The first woman president, Ivanka entertained, would not be Hillary Clinton; it would be Ivanka Trump. \nSo, would she actually run? Trump’s been asked before—and her responses have been mixed. \nBack in early 2016, Town & Country asked Trump, then still EVP of development and acquisitions at the Trump Organization and head of the Ivanka Trump brand, if she’d consider getting into politics herself. “It’s not something I’ve ever been inclined to do, but I’m 34, so who knows?” she said. “At this point I would never even contemplate it, but that doesn’t mean that when I’m 50 I won’t have a change of heart.” \nSubscribe to The Broadsheet , Fortune’s daily newsletter on the world’s most powerful women. \nIn the wake of her father’s election, the question has become more pointed. In April, CBS’s Gayle King asked, “Should voters get their Ivanka 2024 campaign signs out?”“No,” said Trump, noting that, “Politics is a tough business.” \nWolff also characterizes Trump’s relationship with her father as “transactional.” According to the excerpt, “For Ivanka, it was all business—building the Trump brand, the presidential campaign, and now the White House. She treated her father with a degree of detachment, even irony, going so far as to make fun of his comb-over to others.” \nPresident Trump’s attorney, Charles Harder, is demanding that Wolff and his publisher immediately “cease and desist from any further publication, release or dissemination” of the book, saying that the firm is investigating possible defamation of the Trumps, as well as invasion of privacy. Harder has also demanded that Bannon stop making allegedly false statements against the president and his family. \n", "external_links": [], "published": "2018-01-04T02:00:00.000+02:00", "crawled": "2018-01-05T08:07:24.006+02:00", "highlightTitle": ""}