{"organizations": [], "uuid": "735edb2427385896c5fcdfe85e0292966e680235", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226922326&w=1200&r=LYNXMPEE0U0QM", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/brazil-election-poll/brazils-lula-leads-presidential-poll-despite-upheld-conviction-idINKBN1FK1HL", "country": "US", "domain_rank": 408, "title": "Brazil's Lula leads presidential poll despite upheld conviction", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T13:36:00.000+02:00", "replies_count": 0, "uuid": "735edb2427385896c5fcdfe85e0292966e680235"}, "author": "", "url": "https://in.reuters.com/article/brazil-election-poll/brazils-lula-leads-presidential-poll-despite-upheld-conviction-idINKBN1FK1HL", "ord_in_thread": 0, "title": "Brazil's Lula leads presidential poll despite upheld conviction", "locations": [], "entities": {"persons": [{"name": "lula", "sentiment": "negative"}, {"name": "sao paulo", "sentiment": "none"}, {"name": "jair bolsonaro", "sentiment": "none"}, {"name": "luiz inacio lula da silva", "sentiment": "none"}, {"name": "marina silva", "sentiment": "none"}, {"name": "datafolha", "sentiment": "none"}, {"name": "bolsonaro", "sentiment": "none"}, {"name": "geraldo alckmin", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "sao paulo", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 11:37 AM / in 17 minutes Brazil's Lula leads presidential poll despite upheld conviction Reuters Staff 3 Min Read \nSAO PAULO (Reuters) - Former Brazilian President Luiz Inacio Lula da Silva leads in the first presidential poll published since an appeals court upheld his conviction on corruption charges, a decision which is likely to knock him out of contention for the October election. \nThe Datafolha survey published on Wednesday in the Folha de S.Paulo newspaper shows that if Lula cannot run, right-wing candidate Jair Bolsonaro would take the lead and make it to the second round. \nThe poll showed that Bolsonaro would lose badly in a second-round vote to environmentalist and two-time presidential hopeful Marina Silva, and be in a second-round dead heat with likely center-right candidate Geraldo Alckmin, the governor of Sao Paulo state. \nIf Lula is not allowed to run by the courts, a record 32 percent of Brazilians polled by Datafolha said they would vote for no one in the presidential race. \nShowing widespread contempt for a political class engulfed by kickback scandals since 2014, while Lula leads in the polls, he also has by far the highest rejection rate among voters, at 40 percent. LULA RUNS \nThe survey showed that Lula, as the former president is known, would receive 34 percent of the first-round vote if he can run, compared with 16 percent for right-wing candidate Jair Bolsonaro and 8 percent for Marina Silva. \nThe poll also indicated that Lula would beat all other likely candidates in a second-round runoff race, required if no single candidate wins a majority of the vote in the first round. \nIf Lula does not run, Bolsonaro would get 18 percent of first-round vote while Marina Silva would get 13 percent and Gomes 10 percent. TV presenter Luciano Huck and Alckmin would each get 8 percent of the votes without Lula. \nThe Datafolha interviews were conducted on Jan. 29-30, a few days after three appellate court judges voted to uphold Lula’s convictions on taking bribes and money laundering. \nLula, Brazil’s first working-class leader, held office from 2003 to 2010. He remains free pending future appeals. \nDatafolha interviewed 2,826 people across Brazil. The margin of error is two percentage points. Reporting by Ana Mano and Brad Brooks; Editing by Angus MacSwan", "external_links": [], "published": "2018-01-31T13:36:00.000+02:00", "crawled": "2018-01-31T14:04:58.008+02:00", "highlightTitle": ""}