{"organizations": [], "uuid": "b8977273e1b14f0f81f9ed56bd702756fe5e0bbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226283106&w=1200&r=LYNXMPEE0S0TO", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/uk-japan-cryptocurrency-girlband/japans-cryptocurrency-girl-band-stays-loyal-to-virtual-money-after-cyber-heist-idUKKBN1FI1DY", "country": "US", "domain_rank": 408, "title": "Japan's cryptocurrency girl band stays loyal to virtual money after cyber heist", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:00:00.000+02:00", "replies_count": 0, "uuid": "b8977273e1b14f0f81f9ed56bd702756fe5e0bbf"}, "author": "", "url": "https://uk.reuters.com/article/uk-japan-cryptocurrency-girlband/japans-cryptocurrency-girl-band-stays-loyal-to-virtual-money-after-cyber-heist-idUKKBN1FI1DY", "ord_in_thread": 0, "title": "Japan's cryptocurrency girl band stays loyal to virtual money after cyber heist", "locations": [], "entities": {"persons": [{"name": "shirahama", "sentiment": "none"}, {"name": "hinano shirahama", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "virtual currency girls", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "nem", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 12:08 PM / Updated 6 hours ago Japan's cryptocurrency girl band stays loyal to virtual money after cyber heist Reuters Staff 3 Min Read \nTOKYO (Reuters) - Members of a Japanese girl pop group, the Virtual Currency Girls, said on Monday they had refused an offer to be paid in yen and would stay loyal to cryptocurrencies despite a $530 million cyber heist jeopardising their chances of getting paid. \nA cryptocurrency account that pays part of the band’s salary was among those frozen as a result of the suspension of trading at Tokyo-based Coincheck exchange on Friday following the theft of NEM, one of the world’s most popular digital currencies. \n“Our manager offered to pay us in yen, but we declined,” said Hinano Shirahama, who is the band’s bitcoin character. \nDressed in maid costumes and wearing wrestling masks adorned with fuzzy pom-pom ears and cryptocurrency symbols the eight Virtual Currency Girls are a pop music manifestation of the digital currency frenzy that has swept Japan and other parts of the world. \nShirahama and other group members said they would stay together regardless of the setback. Formed by an entertainment promoter the band debuted this month and have yet to garner a significant following. \nVirtual Currency Girls, which performs songs such as “The Moon, Cryptocurrencies and Me” are paid in cryptocurrency for tickets and merchandise at their concerts. A member of JapanÕs idol group \"Virtual Currency Girls\" wearing a mask featuring the NEM cryptocurrency logo poses after performing on their debut stage in Tokyo, Japan, January 12, 2018. Picture taken January 12, 2018. REUTERS/Kim Kyung-Hoon \nRegulators fear both the rampant speculation in cryptocurrencies and risk that the markets could be used for funding criminal and terrorist groups. \nJapan’s Financial Services Agency (FSA) only began requiring exchanges to register from April 2017. Half of the 32 operators are still awaiting approval. Slideshow (3 Images) \nIn 2014, Japan’s Mt. Gox, which once handled 80 percent of the world’s bitcoin trades, filed for bankruptcy after losing around half a billion dollars worth of bitcoins. \nLast month, South Korean exchange Youbit shut down and filed for bankruptcy after being hacked twice. \nJapan’s FSA on Friday criticized Coincheck for failing to take adequate security precautions to foil hacking attacks and said it would begin inspections at other exchanges. \n“Coincheck has some responsibility, but the real culprit is the hacker,” said Koharu Kamikawa wearing her fur-eared mask with the NEM cryptocurrency logo on her forehead. Reporting by Hyun Oh and Tim Kelly; editing by Simon Cameron-Moore", "external_links": [], "published": "2018-01-29T16:00:00.000+02:00", "crawled": "2018-01-29T22:00:14.003+02:00", "highlightTitle": ""}