{"organizations": [], "uuid": "dd51fe675f2c37984b05d70f78d33e9cff99546e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939105-coffeeshop.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/17/5-rude-emails-you-send-without-realizing-it.html", "country": "US", "domain_rank": 767, "title": "5 rude emails you send without realizing it", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T19:39:00.000+02:00", "replies_count": 0, "uuid": "dd51fe675f2c37984b05d70f78d33e9cff99546e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/17/5-rude-emails-you-send-without-realizing-it.html", "ord_in_thread": 0, "title": "5 rude emails you send without realizing it", "locations": [], "entities": {"persons": [{"name": "birchbox", "sentiment": "none"}, {"name": "travis bradberry", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Even the most likable and well-mannered among us can still look like jerks in an email. Writing an email that comes across just like you do in person is a fine art.\nDuring a conversation, you adjust your tone, facial expression, gestures and posture in order to fit the mood of what you're conveying. You do this because people tend to be much more responsive to how you say things than to what you actually say.\nMore from Travis Bradberry: \n10 silly things you do that make you less likable \n5 signs you're much smarter than average \n9 signs you're successful—even if it doesn't feel like it \nEmail strips a conversation bare. It's efficient, but it turns otherwise easy interactions into messy misinterpretations. Without facial expressions and body posture to guide your message, people look at each word you type as an indicator of tone and mood.\nMost of the mistakes people make in their emails are completely avoidable. The following list digs into these subtle mistakes and hidden blunders.\nshow chapters Birchbox's CEO shares what she learned from cold emailing Steve Jobs      4:01 PM ET Wed, 10 May 2017 | 00:55 The Compulsive CC and Reply All CCing people all the time is one of the most annoying things you can do via email. I'd say it's the most annoying, but this honor is bestowed upon the excessive \"reply all.\" If someone sends an email to you and a bunch of other people, do you really think every recipient needs to get another email from you saying \"thanks\"? They don't, and when you do this, it sends people climbing up a wall.\nThe trick for knowing when to CC someone is to treat your email as if it's an in-person meeting. The question then becomes this: \"Would it be necessary or helpful to have this person come to the meeting?\" If the answer is no, then don't waste his or her time with an email. As for reply all, just don't do it. Even if someone else in the thread replies all, you're still annoying everyone to death when you join the fray. If you have something to say, it's better to send this directly (and privately) to the original sender and let him or her decide if the group should know about it too.\nThe Way-Too-Brief All too often, the cause of email conflict is an imbalance between the effort in the initial email and the effort in the response to that email. When someone types up a detailed paragraph outlining important issues, they expect you to respond carefully. Sending back \"Got it\" or \"Noted\" just doesn't do the trick. Without knowledge of your intent and tone, brief responses come across as apathetic and even sarcastic to the receiver. This is unfortunate because this is rarely the sender's intent.\nThe best way to avoid being misinterpreted in a brief response is to share your intent. Even responding with \"I'm a little busy but should be able to read it later this week\" comes across much better than \"Got it,\" which a lot of people will interpret as indifference.\nshow chapters The email trick that makes Ryan Seacrest super efficient      12:13 PM ET Thu, 27 July 2017 | 00:58 The \"URGENT\" Subject Line Subject lines that say \"URGENT\" or \"ASAP\" show complete disregard for the recipient. If your email is that urgent, pick up the phone and give the person a call. Even in the rare instance when an email actually is urgent, labeling it as such in the subject line is unnecessary and sets a strong, negative tone.\nThe key to avoiding \"URGENT\" subject lines is twofold. First, if the issue is best dealt with in any form other than email, then that's how you should be dealing with it. Second, if this is not the case, then the issue lies in your ability to create a strong subject line. After all, people check their email frequently, so as long as your subject line catches their eye, it will get the job done. Instead of labeling the email as urgent, ask yourself why the email is urgent. The answer to this question is your new subject line. If a client needs an answer today, then simply make your subject line \"Client Needs Response Today.\" This maintains the sense of urgency without setting a rude, desperate tone.\nThe Debbie Downer Sending emails that consistently tell people what they do wrong and what they shouldn't be doing really takes a toll. Even if you are trying to offer constructive criticism, you need to avoid negativity in your emails at all costs. Since people are unable to hear your tone directly, they read into the connotations of words and create a tone in their head as they go along. Negatives become especially negative in email form.\nWhenever you find yourself using negative words like \"don't,\" \"can't,\" \"won't\" or \"couldn't,\" turn them into positives. Making this change transforms the entire tone of the message. For example, instead of saying, \"You can't complete reports like this in the future,\" say, \"Next time you complete a report, please…\" When you must deliver negative feedback, don't do it in an email. Just hop on the telephone or walk down the hall.\nshow chapters CEO of a $16 billion business says the way you write emails can break your career      6:56 PM ET Wed, 30 Nov 2016 | 00:55 The Robot It's easy to think of email as a way to get something done quickly, but when you do this to the extreme, you come across as inhuman. You wouldn't walk into someone's office and hand them a report to do without acknowledging them somehow. Jumping straight into the nitty-gritty might seem like the most effective thing to do, but it leaves a lasting negative impression.\nFixing this one is simple. Just take an extra second to greet the person you're writing to. You don't have to ask your recipient about his or her weekend. Just a simple acknowledgment of the individual as a human being is all it takes. This keeps the tone much more respectful than it would be if you were to simply send assignments.\nBringing it all together The trickiest thing about emailing is making certain that people perceive your message the way you intend them to. You must be socially aware to pull this off. That is, be willing to take the time to consider how things look from your recipient's perspective before you hit \"send.\"\nDr. Travis Bradberry is the award-winning co-author of the No. 1 bestselling book, \"Emotional Intelligence 2.0\" and the co-founder of TalentSmart, the world's leading provider of emotional intelligence tests and training, serving more than 75 percent of Fortune 500 companies. \nLike this story? Like CNBC Make It on Facebook . \nDon't miss: Here's the first big purchase Bill Gates made when Microsoft started taking off \nThis article originally appeared on LinkedIn. \nFollow CNBC Make It on show chapters Stop checking your email right away, says Tony Hsieh      10:19 AM ET Mon, 20 Feb 2017 | 01:13", "external_links": [], "published": "2018-01-17T19:39:00.000+02:00", "crawled": "2018-01-17T20:10:49.005+02:00", "highlightTitle": ""}