{"organizations": [], "uuid": "37d6f68886957d938e2adea24f1d1a7d04521068", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226449780&w=1200&r=LYNXMPEE0T026", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-global-oil/u-s-oil-extends-decline-weighed-down-by-dollar-rising-output-idUSKBN1FJ04X", "country": "US", "domain_rank": 408, "title": "U.S. oil extends decline, weighed down by dollar, rising output", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T09:03:00.000+02:00", "replies_count": 0, "uuid": "37d6f68886957d938e2adea24f1d1a7d04521068"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-oil/u-s-oil-extends-decline-weighed-down-by-dollar-rising-output-idUSKBN1FJ04X", "ord_in_thread": 0, "title": "U.S. oil extends decline, weighed down by dollar, rising output", "locations": [], "entities": {"persons": [], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 1:03 AM / in 3 hours Oil falls for a second day as investor risk appetite wanes Bryan Sims 3 Min Read \nHOUSTON (Reuters) - Oil prices fell for a second day on Tuesday, driven by ongoing evidence of rising U.S. crude output, while wary investors sold off stocks, bonds and commodities. \nBrent crude futures LCOc1 were down 65 cents, or 0.9 percent, at $68.81 a barrel at 12:52 p.m. EST (1752 GMT) after touching a session low of $68.40. \nU.S. West Texas Intermediate futures CLc1 were trading $1.21, or 1.8 percent, lower at $64.35 a barrel. \n“Even though the market’s sentiment is strongly bullish, we need to see a good pullback soon that frees up some length for large traders to buy back in again at lower levels. I think we may be seeing that game starting now,” said Dean Rogers, senior analyst and general manager at Kase & Co in Albuquerque, New Mexico. \nU.S. blue-chip stocks opened under pressure, weighed down by a jump in government bond yields and an earlier rise in the dollar .DXY. [.N][USD/] \nU.S. stocks fell for a second straight day, with the Dow Jones Industrial Average tumbling as much as 352 points, the steepest intraday point drop since May 17, hammered by a rise in bond yields and a decline in healthcare companies. \nWith oil’s negative correlation to the dollar reaching its strongest in a month, even continued signs of robust demand for crude were not enough to ward off profit taking following last week’s rise to three-year highs. \nOil’s inverse relationship to the dollar, whereby a stronger currency makes it more expensive for non-U.S. investors to buy dollar-denominated assets, has reasserted itself this week. \n“Correlations are funny things. Sometimes they work and sometimes they don’t. For most of 2017, the relationship between the dollar and the oil price was not obvious,” PVM Oil Associates strategist Tamas Varga said in a note. \n“This is the trend that seems to be turning, judging by yesterday’s price action and this morning’s moves. Rising U.S. bond yields caused dollar shorts cover and as a result oil prices fell.” \nExpectations that U.S. crude inventories have risen for the first time in 11 weeks may also be keeping oil under pressure, according to a preliminary poll by Reuters on Monday. [EIA/S] USOILC=ECI \nIndustry group the American Petroleum Institute will issue its data on stocks for last week on at 4:30 p.m. EST, followed by official figures from the U.S. Energy Department on Wednesday morning. \nU.S. production is already on par with that of Saudi Arabia, the biggest producer in the Organization of the Petroleum Exporting Countries (OPEC). Only Russia produces more, averaging 10.98 million barrels per day (bpd) in 2017. Additional reporting by Amanda Cooper in London and Henning Gloystein in SingaporeEditing by Marguerita Choy", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T09:03:00.000+02:00", "crawled": "2018-01-30T03:11:59.005+02:00", "highlightTitle": ""}