{"organizations": [], "uuid": "684c7fcb27d4a541b9f87893a1ec09992f58f6c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221132116&w=1200&r=LYNXMPEE0A0Y8", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-israel-palestinians-settlements/israel-approves-hundreds-of-new-settlement-homes-ngo-idUSKBN1F01MQ", "country": "US", "domain_rank": 408, "title": "Israel approves hundreds of new settlement homes: NGO", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:09:00.000+02:00", "replies_count": 0, "uuid": "684c7fcb27d4a541b9f87893a1ec09992f58f6c2"}, "author": "", "url": "https://www.reuters.com/article/us-israel-palestinians-settlements/israel-approves-hundreds-of-new-settlement-homes-ngo-idUSKBN1F01MQ", "ord_in_thread": 0, "title": "Israel approves hundreds of new settlement homes: NGO", "locations": [], "entities": {"persons": [{"name": "mustafa barghouti", "sentiment": "none"}, {"name": "jeffrey heller", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "east jerusalem", "sentiment": "none"}, {"name": "gaza strip", "sentiment": "none"}, {"name": "west bank", "sentiment": "none"}], "organizations": [{"name": "civil administration", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 1:10 PM / Updated 5 hours ago Israel approves hundreds of new settlement homes: NGO Jeffrey Heller 3 Min Read \nJERUSALEM (Reuters) - Israel has given final building approval for 352 homes in settlements in the occupied West Bank, an anti-settlement movement said on Thursday - construction that Palestinians see as jeopardizing their prospects for statehood. \nThe Peace Now group said a meeting on Wednesday by a planning committee of Israel’s military-run Civil Administration for the West Bank also moved plans for 770 other settler homes to more advanced stages. \nSettlements are one of the most heated issues in efforts to revive Israeli-Palestinian peace talks, frozen since 2014. \n“I think what Israel is doing is a purposeful, well-planned process of destruction of the two-state solution and possibility of the establishment of a Palestinian state,” Mustafa Barghouti, a Palestinian lawmaker, said of the committee’s decision. \nPalestinians want the West Bank for a future state, along with East Jerusalem and the Gaza Strip. Most countries consider as illegal the settlements that Israel built in the territory it captured in the 1967 Middle East war. \nIsrael disputes that its settlements are illegal. Its government says their future should be determined in peace talks and that the Palestinians’ refusal to recognize Israel as a Jewish state and declare an end to a decades-old conflict are the real obstacles to peace. \nSome 500,000 Israelis live in the West Bank and East Jerusalem, areas that are home to more than 2.6 million Palestinians. \nHagit Ofran, a Peace Now spokeswoman, said the new round of construction approvals was “not a dramatic change” from last year’s pace, when Israel gave the go-ahead for 6,742 housing projects in the West Bank - a figure described by Peace Now as the highest since 2013. \nBut she noted that many of the latest housing projects were slated for settlements deep inside the West Bank, “especially in places that Israel would need to (evacuate) in case of a (peace) agreement - which means our government is trying to prevent a two-state solution”. \nBarghouti linked the increased settlement activity to the 2016 election of U.S. President Donald Trump, a Republican who has been less critical than his predecessor, Democrat Barack Obama, of Israel on the issue. \n“These settlements could have been stopped by the United States,” he told Reuters. \nThe latest construction plans were first announced by Israeli Defence Minister Avigdor Lieberman earlier this week. \nAsked about them, a U.S. State Department official said on Tuesday there had been no change in policy on settlements and the Israeli government had made clear that going forward “its intent is to adopt a policy regarding settlement activity that takes the president’s concerns into consideration.” Reporting by Jeffrey Heller and Miriam Berger; writing by Jeffrey Heller; editing by Mark Heinrich", "external_links": [], "published": "2018-01-11T15:09:00.000+02:00", "crawled": "2018-01-11T15:31:29.029+02:00", "highlightTitle": ""}