{"organizations": [], "uuid": "28697a3daa3e12507c2af296d099073085600bc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-bounce-short-lived-as-euro-stays-above-1-20-idUSL8N1OZ0WF", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar bounce short-lived as euro stays above $1.20", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.053, "site_type": "news", "published": "2018-01-04T16:49:00.000+02:00", "replies_count": 0, "uuid": "28697a3daa3e12507c2af296d099073085600bc1"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-bounce-short-lived-as-euro-stays-above-1-20-idUSL8N1OZ0WF", "ord_in_thread": 0, "title": "FOREX-Dollar bounce short-lived as euro stays above $1.20", "locations": [], "entities": {"persons": [{"name": "jemima kelly", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar drops against basket after modest recovery\n* Strong US data, hawkish Fed minutes, provide some support\n* Greenback gains against yen as risk assets rally\n* Bitcoin down 5 percent\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Jemima Kelly\nLONDON, Jan 4 (Reuters) - The dollar edged down on Thursday, having recovered modestly the previous day from a three-month low, with upbeat U.S. data and minutes from the Federal Reserve unable to lift pressure from the struggling currency.\nThe dollar index, which measures it against a basket of six major currencies, slipped to its lowest since Sept. 20 on Tuesday, as optimism about the euro zone economy drove the single currency above $1.20 for the first time in 3-1/2 months.\nThe U.S. currency was given some reprieve on Wednesday, bouncing after strong manufacturing and construction data. It gained further support from the Fed’s latest minutes, which indicated the central bank is still poised to raise interest rates several times this year.\nBut by 0824 GMT on Thursday it was back in negative territory, with its index down 0.1 percent on the day.\nThe euro had dipped in early trade in Asia, reaching $1.2005, but it then bounced back to trade at $1.2029, up 0.1 percent on the day.\n“We see some very positive euro sentiment in the market right now, and if it goes down too much against the U.S. dollar that’s going to begin again... The market is not confident enough right now that levels below $1.20 are justified,” said Commerzbank currency strategist Esther Reichelt in Frankfurt.\n“That might change with the U.S. employment data coming in strong,” she said, adding that U.S. wages numbers due on Friday could be key in determining the dollar’s direction.\nIn the minutes from their Dec. 12-13 meeting, Fed policymakers acknowledged the U.S. labour market’s solid gains and the expansion in economic activity, even as they affirmed worries about persistently low inflation.\nThat suggested the central bank will continue to pursue a gradual approach to raising rates but could hasten the pace if inflation accelerates.\nThe U.S. currency was higher against the yen, trading up 0.2 percent at 112.655 yen on strong risk appetite across markets. It touched a 2-1/2-week low of 112.055 on Tuesday after declining steadily from a high above 113.750, scaled in December.\nBuoyed by overnight gains on Wall Street, Tokyo’s Nikkei began the first day of trading in 2018 by rallying 2.5 percent.\nMakoto Noji, senior strategist at SMBC Nikko Securities in Tokyo, expects dollar/yen to stay around 110 yen in the medium term.\n“Yen demand stemming from Japan’s current account surplus will be checked by yen selling pressure stemming from ‘risk-on’ generated by global economic growth,” he said. “Dollar/yen is likely to remain in range around 110 yen amid this tug-of-war.”\nBitcoin was down almost 5 percent on the Bitstamp exchange at around $14,430, having lost more than a quarter of its value since hitting record highs in mid-December. (Reporting by Jemima Kelly; Additional reporting by Shinichi Saoshiro in Tokyo; editing by John Stonestreet)\n ", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T16:49:00.000+02:00", "crawled": "2018-01-04T21:17:59.000+02:00", "highlightTitle": ""}