{"organizations": [], "uuid": "9cbb8bb25040e3e33c93d3e1d0627d9c730b7457", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-caribbean-refinery/chinas-debt-ridden-guangdong-zhenrong-taps-private-refiner-for-caribbean-project-idUSL4N1P31CW", "country": "US", "domain_rank": 408, "title": "China's debt-ridden Guangdong Zhenrong taps private refiner for Caribbean project", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T07:15:00.000+02:00", "replies_count": 0, "uuid": "9cbb8bb25040e3e33c93d3e1d0627d9c730b7457"}, "author": "", "url": "https://www.reuters.com/article/china-caribbean-refinery/chinas-debt-ridden-guangdong-zhenrong-taps-private-refiner-for-caribbean-project-idUSL4N1P31CW", "ord_in_thread": 0, "title": "China's debt-ridden Guangdong Zhenrong taps private refiner for Caribbean project", "locations": [], "entities": {"persons": [{"name": "chen aizhu", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "guangdong zhenrong", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "curacao", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "guangdong zhenrong energy", "sentiment": "none"}, {"name": "pdvsa", "sentiment": "none"}, {"name": "baota petrochemical", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 5:16 AM / Updated an hour ago China's debt-ridden Guangdong Zhenrong taps private refiner for Caribbean project Reuters Staff \n* Guangdong Zhenrong asks Baota Petrochemical to join project \n* Baota obtains $3 bln preliminary financing for Curacao refinery \n* Guangdong Zhenrong could be restructured after wind-up order \nBy Chen Aizhu \nBEIJING, Jan 10 (Reuters) - China’s debt-ridden Guangdong Zhenrong Energy (GZE) has asked a private refining group to join a multi-billion dollar investment in an aging Caribbean oil plant to shore up financing on the deal, said two Chinese executives involved in the matter. \nThe Curacao government last week scrapped a preliminary deal with Guangdong Zhenrong to operate the century-old Isla refinery, saying the state-controlled commodity trader lacked the financial muscle for the job on its own. \nTaking over the 335,000 barrels-per-day (bpd) refinery, operated for decades by Venezuela’s cash-strapped state oil firm PDVSA, would give China a foothold in the Caribbean’s second-largest refinery, which has also been a key transfer point for Venezuelan oil heading to Asia. \nChen Bingyan, Guangdong Zhenrong’s chief negotiator for the project, acknowledged that the Chinese commodity trader is saddled with heavy debt after rapid expansion but said that should not stop it from pressing ahead on the investment. \n“Guangdong Zhenrong is facing financial difficulties and it will take time to sort out those problems ... because of this, we’ve brought on a large private Chinese firm to join the project,” Chen told Reuters. \nBaota Petrochemical Group, a privately-run refining and petrochemical group in northern China, has emerged as the new partner in the Curacao project, which requires $3.4 billion to revamp the aging oil plant. \n“What’s more important, Baota has obtained $3 billion worth of financial support from the Asia Development & Investment Bank,” Chen said. \nChen said the bank’s offer of financial support will be valid until January 2019, and its release of loans will be subject to the involved parties signing a final commercial contract and obtaining regulatory approvals. \nSet up in 2009, Kuala Lumpur-based Asia Development & Investment Bank (ADIB) was funded by China Development Bank and oil-producing nations such as Malaysia and Saudi Arabia. The bank manages a credit line of $40 billion with a focus on energy investments, according to the bank’s website. \nADIB declined to comment. The Curacao government did not immediately respond to emails asking for information about how Baota’s involvement would impact the refinery deal. \nZhu Sheng, managing director of the Baota group’s Hong Kong operation, said his company is doing due diligence on the Curacao project after its chairman visited the site last month. \n“After initial analysis of the refinery, its terminal and storage facilities, we are confident we can turn around the plant and maximize its profits,” said Zhu. \nThe Caribbean is not unfamiliar to Baota, one of China’s largest independent refineries. Baota considered an opportunity in 2015 to refurbish a refinery in the island nation of Aruba, Zhu said, but little advance was made in that direction. \nA feasibility report on how to revamp the Isla refinery is being drafted and expected to be completed in February for submission to China’s National Reform and Development Commission for assessment, said Guangdong Zhenrong’s Chen. \nGuangdong Zhenrong, 44.3 percent owned by state oil trader Zhuhai Zhenrong Corp - which is now subsidiary of state-controlled conglomerate Nam Kwong Group - could also be restructured, said Chen, who gave no further details. \nThat could help address questions that were raised about Guangdong Zhenrong’s financial standing last year when it was ordered by Hong Kong High Court to wind up, according to a statement in September by its listed unit Titan Petrochemicals . \n“Although banks are unlikely to support GZE, the firm could continue to act as the mastermind and coordinator for the Curacao project,” Xiong Shaohui, Guangdong Zhenrong chairman, told Reuters. Reporting by Chen Aizhu; Editing by Tom Hogue", "external_links": [], "published": "2018-01-10T07:15:00.000+02:00", "crawled": "2018-01-10T08:11:24.007+02:00", "highlightTitle": ""}