{"organizations": [], "uuid": "a8a101eee0f943589e19bb382a1e71afe5d6a4ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223368352&w=1200&r=LYNXMPEE0I13N", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews\r", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-military-china-russia/pentagon-puts-countering-china-russia-at-center-of-u-s-defense-strategy-idUSKBN1F81TR", "country": "US", "domain_rank": 408, "title": "Pentagon puts countering China, Russia at center of U.S. defense strategy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:13:00.000+02:00", "replies_count": 0, "uuid": "a8a101eee0f943589e19bb382a1e71afe5d6a4ab"}, "author": "", "url": "https://www.reuters.com/article/us-usa-military-china-russia/pentagon-puts-countering-china-russia-at-center-of-u-s-defense-strategy-idUSKBN1F81TR", "ord_in_thread": 0, "title": "Pentagon puts countering China, Russia at center of U.S. defense strategy", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "pentagon", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "u.s. defense department", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The U.S. military has put countering China and Russia at the center of a new national defense strategy unveiled on Friday, the latest sign of shifting American priorities after more than a decade and a half of focusing on the fight against Islamist militants.\nIn unveiling the new strategy, which will set priorities for the Pentagon for years to come, Defense Secretary Jim Mattis called China and Russia “revisionist powers” that “seek to create a world consistent with their authoritarian models.”\nThe so-called “National Defense Strategy” represents the latest sign of hardening resolve by President Donald Trump’s administration to address challenges from Russia and China, at the same time he is pushing for improved ties with Moscow and Beijing to rein in a nuclear North Korea.\n“We will continue to prosecute the campaign against terrorists that we are engaged in today, but great power competition, not terrorism, is now the primary focus of U.S. national security,” Mattis said in a speech presenting the strategy document, the first of its kind since at least 2014.\nIt sets priorities for the U.S. Defense Department that are expected to be reflected in future defense spending requests. The Pentagon on Friday released an unclassified, 11-page version of the document, which did not provide details on how the shift toward countering China and Russia would be carried out.\nRussian Foreign Minister Sergei Lavrov, speaking through an interpreter at a news conference at the United Nations, said the United States was using a confrontational approach.\n“It is regrettable that instead of having a normal dialogue, instead of using the basis of international law, the U.S. is striving to prove their leadership through such confrontational strategies and concepts,” Lavrov said.\n”We’re open for dialogue, we’re prepared to discuss military doctrines,” he added.\nThere was no immediate response from China.\nElbridge Colby, deputy assistant secretary of defense for strategy and force development, said at a briefing with reporters that Russia was far more brazen than China in its use of military power.\nRussia annexed Ukraine’s Crimean peninsula in 2014 and intervened militarily in Syria to support its ally, Syrian President Bashar al-Assad. Still, Moscow was limited by its economic resources, Colby said.\nChina, on the other hand, was described as economically and militarily ascendant. China has embarked on far-reaching military modernization that Colby said was in “deep contravention to our interests.”\nSUPPORT FOR ALLIANCES The document also listed North Korea among the Pentagon’s priorities, citing the need to focus U.S. missile defenses against the threat from Pyongyang, which beyond its nuclear weapons has also amassed an arsenal of biological, chemical, and conventional arms.\nThe document said that international alliances would be critical for the U.S. military, by far the world’s best-resourced. But it also stressed a need for burden-sharing, an apparent nod to Trump’s public criticism of allies who he says unfairly take advantage of U.S. security guarantees.\nTrump has called the NATO alliance “obsolete”, but Mattis said the United States would strengthen its traditional alliances while building new partnerships and listening more to other nations’ ideas.\n“We will be willing to be persuaded by them recognizing that not all good ideas come from the country with the most aircraft carriers,” Mattis said.\nThe Pentagon is also working on a policy document on the country’s nuclear arsenal. While Mattis did not specifically address that review, he said the priority is deterrence.\n“How do we maintain a safe and effective nuclear deterrence so those weapons are never used? It is a nuclear deterrent, it is not a war fighting capability unless it is the worst day in our nation or the world’s history,” Mattis said.\nMattis had harsh words for the U.S. Congress and its inability to reach agreement on budgets.\nThe U.S. military’s competitive edge has eroded “in every domain of warfare” he said, partly because of inconsistent funding. A bill to fund the government only through Feb. 16, approved on Thursday night by the House of Representatives, appeared on the verge of collapse in the Senate.\n“As hard as the last 16 years of war have been, no enemy in the field has done more to harm the readiness of the U.S. military than the combined impact” of spending caps and short-term funding.\nIn sheer spending terms, the United States’ military outlay per year is still far more than China and Russia. The United States is spending $587.8 billion per year on its military, China $161.7 billion and Russia $44.6 billion.\nReporting by Idrees Ali; additional reporting by Michelle Nichols at the United Nations; Editing by Mary Milliken and Grant McCool\n ", "external_links": [], "published": "2018-01-19T17:13:00.000+02:00", "crawled": "2018-01-19T17:35:39.000+02:00", "highlightTitle": ""}