{"organizations": [], "uuid": "a08babb367cd7a85afdd7cf75855ea410b1bac95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226762251&w=1200&r=LYNXMPEE0U00I", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-economy/uk-consumers-and-businesses-strike-more-confident-tone-surveys-idUKKBN1FK019", "country": "US", "domain_rank": 408, "title": "UK consumers and businesses strike more confident tone - surveys", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T02:15:00.000+02:00", "replies_count": 0, "uuid": "a08babb367cd7a85afdd7cf75855ea410b1bac95"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-economy/uk-consumers-and-businesses-strike-more-confident-tone-surveys-idUKKBN1FK019", "ord_in_thread": 0, "title": "UK consumers and businesses strike more confident tone - surveys", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "lloyds bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "gfk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 12:15 AM / Updated 6 hours ago UK consumers and businesses strike more confident tone - surveys Reuters Staff 2 Min Read \nLONDON, Jan 31 (Reuters) - British consumers and businesses started 2018 in an improved mood, according to surveys that offered some optimism about what many analysts think will be a tough year for the economy as it heads for Brexit. \nThe headline gauge of consumer confidence, compiled by market research firm GfK for the European Commission, rose to a four-month high of -9. That was up from December’s four-year low of -13 that analysts had expected to see repeated. \nSeparately, Lloyds Bank’s business confidence barometer rose to 35 percent from 28 percent in December, a nine-month high. \nOverall the surveys suggested that a pick-up in economic growth at the end of 2017 might have carried through into the start of this year, ahead of Britain’s scheduled exit from the European Union in March 2019. \nBut despite improving on the month, the GfK consumer confidence index stood at its weakest level for any January since 2013. \n“This off-trend number could be a temporary blip rather than a strong sign of recovery,” said Joe Staton, head of market dynamics at GfK. \nThe Lloyds survey of 1,200 companies questioned over the first half of January showed the proportion of businesses that were positive about Brexit grew to 31 percent from 16 percent. Hiring intentions also improved. \n“Although business prospects have softened from last month’s high, overall business confidence has started the year on a strong footing,” said Hann-Ju Ho, economist at Lloyds. \nBritish Prime Minister Theresa May secured a preliminary agreement with the EU in December that reduced the risk of a no-deal Brexit. \nBut another survey from the Recruitment and Employment Confederation that surveyed 600 companies involved in hiring between November and December showed employer confidence was at its weakest level since the June 2016 Brexit vote. \nSeparately, the British Retail Consortium said shop prices fell 0.5 percent in the year to January, a slightly shallower decline than the 0.6 percent drop in December. Reporting by Andy Bruce, editing by William Schomberg", "external_links": [], "published": "2018-01-31T02:15:00.000+02:00", "crawled": "2018-01-31T02:45:37.006+02:00", "highlightTitle": ""}