{"organizations": [], "uuid": "7e0a1e9c05e24197ebdc473b19ae94f5f54a4230", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221452555&w=1200&r=LYNXMPEE0B0YC", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-kenworthy/kenworthy-proud-to-represent-us-lgbt-community-in-pyeongchang-idUKKBN1F11MG", "country": "US", "domain_rank": 408, "title": "Kenworthy proud to represent US, LGBT community in Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:30:00.000+02:00", "replies_count": 0, "uuid": "7e0a1e9c05e24197ebdc473b19ae94f5f54a4230"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-kenworthy/kenworthy-proud-to-represent-us-lgbt-community-in-pyeongchang-idUKKBN1F11MG", "ord_in_thread": 0, "title": "Kenworthy proud to represent US, LGBT community in Pyeongchang", "locations": [], "entities": {"persons": [{"name": "jack t", "sentiment": "neutral"}, {"name": "kenworthy", "sentiment": "neutral"}, {"name": "gus kenworthy", "sentiment": "none"}, {"name": "reuters/lucas jackson  kenworthy", "sentiment": "none"}], "locations": [{"name": "pyeongchang", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "times square", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "espn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 35 PM / Updated 6 minutes ago Kenworthy proud to represent US, LGBT community in Pyeongchang Jack Tarrant 4 Min Read \nLONDON (Reuters) - Gus Kenworthy was terrified about the consequences of coming out as gay in 2015 but the American skier says that his decision prompted a huge outpouring of unexpected support and has allowed him to compete without the weight of the world on his shoulders. Olympian freestyle skier Gus Kenworthy speaks during an event in Times Square to celebrate 100 days from the start of the PyeongChang 2018 Olympic Games in South Korea, in New York, U.S., November 1, 2017. REUTERS/Lucas Jackson \nKenworthy, an Olympic silver medal winner in the ski slopestyle at Sochi, came out in a cover story for ESPN The Magazine to become the first openly gay action sports athlete. \n“I had set myself up for the worst case scenario,” he told Reuters by telephone from his winter base in Colorado. “I thought I was going to be turned against and become this pariah.” \nKenworthy had already told his close family and friends, who were all very supportive. Their support, along with a desire to be an inspiration for other young men and women scared to come out as homosexual, drove Kenworthy to make the decision. \n“I knew I would feel so much better because I was being authentic and maybe it would help kids going through the same transition as me,” said Kenworthy. \n“I thought it would maybe help other people, either in professional sports or amateur sports or even just in communities where they felt isolated and scared to be themselves.” \nWithin minutes of the news breaking, Kenworthy’s telephone was blowing up. \n“I had so much support coming in and so my phone just couldn’t handle it and I couldn’t handle it either,” he said. \n“I was crying and it is quite a weird sensation to set yourself up for one outcome and then get the total opposite.” \nKenworthy says his decision has led to a change in what he calls his “headspace” going into competitions. Instead of compartmentalizing his life he is able to be himself and this has contributed to a greater sense of freedom and confidence. \nThe change means Kenworthy is more confident than ever heading into the Pyeongchang Winter Games next month. \n“I am more open with everyone in my life and I think it just translates into me being able to ski a little bit more freely and not have so much to focus on and worry about,” he added. LGBT ICON \nDespite his achievements on the slopes, Kenworthy is known by many as the ‘gay skier’. Instead of shying away from the tag, Kenworthy has embraced it and hopes to serve as an inspiration for lesbian, gay, bisexual and transgender people (LGBT) around the world. \nIf, as Kenworthy says, he can be a gay man at the top of the world, an Olympic gold medallist, then it would prove a lot of people wrong. \n“Nothing would make me happier,” he said. \n”The Olympics is a cool opportunity to represent our country, which is amazing, but I have another community I am competing for and that is the LGBT community. \n”There are all these stereotypes and stigmas that people have associated in their mind over time but nothing breaks barriers down more than visibility or representation. \n”Having someone at the Olympics, the pinnacle event in sports, competing against the best in the world and being out and proud and gay and getting a medal, it would be amazing. \n“There is pressure that comes with this responsibility and I feel I have a responsibility to the LGBT community now. I want to lead by example and I want to be a positive example and an inspiration for any kids that I can.” \nAfter Kenworthy’s silver medal in Sochi, he went to the White House with the rest of the U.S. Olympic team to meet then President Barack Obama, as per tradition. It was an experience Kenworthy describes as “thrilling”. \nHowever, if he is invited to the White House this time around, Kenworthy said he would politely decline. \n“I am very proud to represent the U.S. but I don’t stand by (U.S. President Donald) Trump and his cabinet and their policies,” said Kenworthy. \n”I do not want to feign approval for policies that are in place and things that are being pushed at the moment, by going. If I was invited I would decline my spot.” Editing by Peter Rutherford", "external_links": [], "published": "2018-01-12T15:30:00.000+02:00", "crawled": "2018-01-12T15:51:26.011+02:00", "highlightTitle": ""}