{"organizations": [], "uuid": "e837e72f2007b6cb39ca0b5bb8ca29a2a37697d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-amtrust-financial-services-inc-announces-retention-of-financial-advisor-to-review-proposal-by-stone-point-capital-the-ceo.html", "country": "US", "domain_rank": 767, "title": "AmTrust Financial Services, Inc. Announces Retention of Financial Advisor to Review Proposal by Stone Point Capital, the CEO and the Karfunkel Family", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.842, "site_type": "news", "published": "2018-01-19T15:30:00.000+02:00", "replies_count": 0, "uuid": "e837e72f2007b6cb39ca0b5bb8ca29a2a37697d5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-amtrust-financial-services-inc-announces-retention-of-financial-advisor-to-review-proposal-by-stone-point-capital-the-ceo.html", "ord_in_thread": 0, "title": "AmTrust Financial Services, Inc. Announces Retention of Financial Advisor to Review Proposal by Stone Point Capital, the CEO and the Karfunkel Family", "locations": [], "entities": {"persons": [{"name": "barry d. zyskind", "sentiment": "none"}, {"name": "leah karfunkel", "sentiment": "none"}, {"name": "george karfunkel", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "amtrust financial services, inc", "sentiment": "neutral"}, {"name": "stone point capital", "sentiment": "neutral"}, {"name": "amtrust financial services, inc.", "sentiment": "neutral"}, {"name": "willkie farr & gallagher llp", "sentiment": "none"}, {"name": "amtrust", "sentiment": "none"}, {"name": "special committee", "sentiment": "none"}, {"name": "stone point capital llc", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "deutsche bank securities inc.", "sentiment": "none"}, {"name": "bofa merrill lynch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 19, 2018 (GLOBE NEWSWIRE) -- AmTrust Financial Services, Inc. (Nasdaq:AFSI) (“AmTrust”) , announced that the special committee of its board of directors has retained Deutsche Bank Securities Inc. as its financial advisor. The Special Committee, with the assistance of Deutsche Bank and its legal advisor, Willkie Farr & Gallagher LLP, is evaluating the proposal received on January 9, 2018 from private equity funds managed by Stone Point Capital LLC, together with Barry D. Zyskind, Chairman and CEO of AmTrust, George Karfunkel and Leah Karfunkel (collectively, the “Karfunkel-Zyskind Family”), to acquire all of the outstanding shares of common stock of AmTrust that the Karfunkel-Zyskind Family does not already own or control for $12.25 per share in cash. There can be no assurance that any agreement will be executed or that a transaction will be approved or consummated.\nAmTrust has retained BofA Merrill Lynch to serve as its financial advisor.\nAbout AmTrust Financial Services, Inc.\nAmTrust Financial Services, Inc., a multinational insurance holding company headquartered in New York, offers specialty property and casualty insurance products, including workers' compensation, commercial automobile, general liability and extended service and warranty coverage through its primary insurance subsidiaries rated \"A\" (Excellent) by A.M. Best. AmTrust is included in the Fortune 500 list of largest companies. For more information about AmTrust visit www.amtrustfinancial.com .\nAmTrust Financial Services\nChaya Cooperberg\nChief Communications Officer & SVP Corporate Affairs\nchaya.cooperberg@amtrustgroup.com\n(646) 458-3332\nJisoo Suh\nDirector of Investor Relations\njisoo.suh@amtrustgroup.com\n(646) 458-3367\nHunter Hoffmann\nGlobal Director of Public Relations\nHunter.Hoffmann@amtrustgroup.com\n646.458.3362\nForward Looking Statements\nThis news release contains certain forward-looking statements that are intended to be covered by the safe harbors created by the Private Securities Litigation Reform Act of 1995. When we use words such as \"anticipate,\" \"intend,\" \"plan,\" \"believe,\" \"estimate,\" \"expect,\" or similar expressions, we do so to identify forward-looking statements. Examples of forward-looking statements include the plans and objectives of management for future operations, including those relating to future growth of our business activities and availability of funds, projections of the impact of potential errors or misstatements in our financial statements, and estimates of the impact of material weaknesses in our internal control over financial reporting, and are based on current expectations that involve assumptions that are difficult or impossible to predict accurately and many of which are beyond our control. Actual results may differ materially from those expressed or implied in these statements as a result of significant risks and uncertainties, including, but not limited to, non-receipt of expected payments from insureds or reinsurers, changes in interest rates, a downgrade in the financial strength ratings of our insurance subsidiaries, the effect of the performance of financial markets on our investment portfolio, the amounts, timing and prices of any share repurchases made by us under our share repurchase program, development of claims and the effect on loss reserves, accuracy in projecting loss reserves, the cost and availability of reinsurance coverage, the effects of emerging claim and coverage issues, changes in the demand for our products, our degree of success in integrating acquired businesses, the effect of general economic conditions, state and federal legislation, regulations and regulatory investigations into industry practices, the impact of known or potential errors or misstatements in our financial statements, our ability to timely and effectively remediate the material weaknesses in our internal control over financial reporting and implement effective internal control over financial reporting and disclosure controls and procedures in the future, risks associated with conducting business outside the United States, the impact of Brexit, developments relating to existing agreements, disruptions to our business relationships with Maiden Holdings, Ltd. or National General Holdings Corp., breaches in data security or other disruptions with our technology, heightened competition, changes in pricing environments, and changes in asset valuations. Additional information about these risks and uncertainties, as well as others that may cause actual results to differ materially from those projected, is contained in our filings with the SEC, including our Annual Report on Form 10-K and our quarterly reports on Form 10-Q. The projections and statements in this news release speak only as of the date of this release and we undertake no obligation to update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise, except as may be required by law.\nSource: AmTrust Financial Services, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=BS4HNstygJsefeJg5dki26kIACBARh6Fg1F0yFNbgoEtflaCunTBsShtWM2cRExLoNua6VA454dlhUwNvvS6ExtSTb_0LeQPuzneSk2h_n4=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/53c01d47-7a7f-4a03-9a0b-9f1cdf4c51c9"], "published": "2018-01-19T15:30:00.000+02:00", "crawled": "2018-01-19T16:06:24.000+02:00", "highlightTitle": ""}