{"organizations": [], "uuid": "1471a951d9cb26f176f6edead4c24d5accccc590", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/ethereum-price-mining-nvidia-amd-stock.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/23/ethereum-price-mining-nvidia-amd-stock/", "country": "US", "domain_rank": 1196, "title": "Why Ethereum's Price Is Still a Boon for Nvidia and AMD | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.811, "site_type": "news", "published": "2018-01-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "1471a951d9cb26f176f6edead4c24d5accccc590"}, "author": "Lucinda Shen", "url": "http://fortune.com/2018/01/23/ethereum-price-mining-nvidia-amd-stock/", "ord_in_thread": 0, "title": "Why Ethereum's Price Is Still a Boon for Nvidia and AMD | Fortune", "locations": [], "entities": {"persons": [{"name": "sebastian kastner", "sentiment": "negative"}, {"name": "moore", "sentiment": "none"}, {"name": "joseph moore", "sentiment": "none"}, {"name": "lucinda shen", "sentiment": "none"}, {"name": "akos stiller", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}], "organizations": [{"name": "amd", "sentiment": "negative"}, {"name": "nvidia", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "ethereum", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ethereum How Ethereum Is Boosting Nvidia and AMD Sebastian Kastner, lead engineer at HydroMiner GmbH, handles cable connections between cryptocurrency mining rigs on racks at the company's mining facility in Austria on Jan. 19, 2018. Akos Stiller—Bloomberg via Getty Images By Lucinda Shen January 23, 2018 \nThe recent drop in Ethereum prices may have hurt quite a few investors betting on the rise of cryptocurrency—but the digital coin is still a boon to investors of semiconductor stocks Nvidia (nvda) and Advanced Micro Devices (AMD). \nAt least for now. \nThat’s based on a Tuesday note from Morgan Stanley analysts led by Joseph Moore, who say that Ethereum prices have remained high overall—up about 8,900% over the past year—making Ethereum mining more profitable. In turn, that profitability has driven consumers to snap up graphics processing units (GPUs) used to mine, or acquire new cryptocurrencies, from major suppliers such as AMD and Nvidia. \nThe profitability of mining Ethereum has risen over 200% since October, wrote Moore, despite falling below $1,000 earlier this week. \nAccording to Morgan Stanley estimates, miners today earn roughly $1.76 each day in profits per each GPU owned. That’s up from 56 cents in October. Those figures assume the miner owns an AMD Radeon 580 and pays roughly 70 cents per day for each GPU’s electricity. \nComputing power dedicated to Ethereum mining rose by 2,200 terahash per minute in the third quarter to 3,672 terahash per minute in the fourth quarter, the bank said. \nBased on the continued profitability of Ethereum mining and the increase in computing power dedicated to it, Morgan Stanley boosted its fourth quarter 2017 sales estimates for both AMD and Nvidia. The increase in demand for GPUs for Bitcoin or cryptocurrency mining already helped boost sales for Nvidia and AMD in 2017. The bank said it expects AMD (amd) to post revenues of $1.55 billion in the fourth quarter of 2017 and $1.43 billion in the first quarter of 2018, each up $100 million from the bank’s previous estimates. \nMorgan Stanley also said it expects Nvidia’s revenues to come in at $2.81 billion for the first quarter of 2018 and $2.55 billion for the second quarter. \nShares of AMD and Nvidia rove 2% each in trading Tuesday. \nCryptocurrency is infamously volatile, turning GPU sales from Bitcoin mining into something of an unreliable crutch should profitability from the venture sink alongside cryptocurrency prices. \nDue to the surge in digital assets like Bitcoin and Ethereum, the price of GPUs have also soared, which could create something of a cap on GPU sales from cryptocurrency mining. Higher GPU prices also lower profitability for miners. \n“We are raising estimates meaningfully for both graphics vendors, but sustainability is a long-term issue especially for AMD,” Morgan Stanley analysts wrote Tuesday. \nEthereum prices were relatively flat at $1,000 while Bitcoin rose to $11,200, up 4%, on Tuesday. Ethereum rose close to $1,400 earlier this year. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T02:00:00.000+02:00", "crawled": "2018-01-24T04:40:26.056+02:00", "highlightTitle": ""}