{"organizations": [], "uuid": "13044a065ed8a0d14f3ff8fb8bdb44c26f88eae7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220294603&w=1200&r=LYNXMPEE07102", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/uk-britain-eu-banks/city-of-london-says-brexit-job-fears-may-be-over-egged-idUSKBN1EX1LQ", "country": "US", "domain_rank": 408, "title": "City of London says Brexit job fears may be over-egged", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:06:00.000+02:00", "replies_count": 0, "uuid": "13044a065ed8a0d14f3ff8fb8bdb44c26f88eae7"}, "author": "", "url": "https://www.reuters.com/article/uk-britain-eu-banks/city-of-london-says-brexit-job-fears-may-be-over-egged-idUSKBN1EX1LQ", "ord_in_thread": 0, "title": "City of London says Brexit job fears may be over-egged", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "huw jones", "sentiment": "none"}, {"name": "browne", "sentiment": "none"}, {"name": "jeremy browne", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 3:17 PM / Updated an hour ago City of London says Brexit job fears may be over-egged Huw Jones 4 Min Read \nLONDON (Reuters) - British banking, insurance and asset management job losses to the European Union due to Brexit might not be as heavy as initially feared, the City of London financial district said on Monday. \nJeremy Browne, the City’s EU envoy, said UK-based firms opening hubs in the bloc after Britain leaves next year are looking for the least disruption possible. \n“It may end up for quite a lot of them being a bit less dramatic than it might appear,” Browne said as Britain embarks on a new phase of talks with the EU over its exit. \n“It don’t think they are saying ‘Shall we abandon London?',” Browne told a press briefing as he begins a five-month trip around EU states to meet policymakers. \nFinancial services in Britain raise over 70 billion pounds ($95 billion) in taxes annually, but Browne said new hubs will likely be staffed by hundreds rather than thousands. \nThe City expects 5,000 to 13,000 job losses among the 1.1 million people employed in the sector across Britain. This chimes with 10,000 losses the Bank of England said is plausible on Brexit Day in March 2019. \nConsultants like Oliver Wyman have forecast losses of 75,000 or far higher, though over several years. \nBrowne, a former junior UK foreign minister, said France sees winning UK financial jobs as a “national endeavour” led by French President Emmanuel Macron. Germany is also courting financial jobs, but in a less “emotionally attached” way. UNOCCUPIED GROUND \nBritain and the EU agreed in December to open talks on a transition period and final trading terms. \nBrowne said transition should ideally not depart dramatically from the UK’s current links with the bloc, though some “tweaks” were inevitable. \n“Speed is of the essence,” Browne said. \nThe City wants an imaginative trade deal that is more comprehensive than the one negotiated by the bloc with Canada, but stopping short of joining Norway in the European Economic Area (EEA), he said. \nBrowne refers to this as “unoccupied ground”, meaning no such trade deal on financial services has been done with the EU before. \nNorway pays into the bloc’s budget and accepts free movement of EU citizens within its borders, conditions that pro-Brexit lawmakers in Britain reject on sovereignty grounds. \n“There is a lot of space between Canada and being in the EEA,” Browne said. \nAdopting the EU’s “one-way” system of equivalence, whereby the EU grants market access to foreign banks if they operate under similar rules to those of the bloc, is a non-starter for most in the City, Browne said. \n“People are quite hardline about not having equivalence as the final state,” Browne said. \nThe City wants a trade deal that would allow the UK and EU to accept each other’s financial rules, with a mechanism to resolve any disputes, a more partnership-based approach than equivalence. \nThe EU is, however, very worried about how non-EU countries like Switzerland or the United States would react if it gave preferential treatment to the City, Browne said. \nThe Bank of England said in December it would spare EU banks in London from having to find costly capital to convert from branches to subsidiaries after Brexit if EU regulators reciprocated. \nFinancial lawyers like Barney Reynolds have said that some form of equivalence may be Britain’s most realistic bet in the immediate term given the time it takes to negotiate trade deals. Reporting by Huw Jones; Editing by Adrian Croft", "external_links": [], "published": "2018-01-08T17:06:00.000+02:00", "crawled": "2018-01-08T18:43:49.040+02:00", "highlightTitle": ""}