{"organizations": [], "uuid": "48d36334f268b4385c5295861d9c7aef142ad8ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-avexis-announces-pricing-of-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "AveXis Announces Pricing of Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-17T04:18:00.000+02:00", "replies_count": 0, "uuid": "48d36334f268b4385c5295861d9c7aef142ad8ca"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-avexis-announces-pricing-of-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "AveXis Announces Pricing of Public Offering of Common Stock", "locations": [], "entities": {"persons": [{"name": "avexis", "sentiment": "none"}], "locations": [], "organizations": [{"name": "avexis announces pricing of public offering of common stock chicago", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 16, 2018 (GLOBE NEWSWIRE) -- AveXis, Inc. (NASDAQ:AVXS) today announced the pricing of an underwritten public offering of 3,921,600 shares of its common stock at a public offering price of $102.00 per share, before underwriting discounts and commissions. The net proceeds to AveXis from the offering, after deducting the underwriting discounts and commissions and estimated offering expenses payable by AveXis, are expected to be approximately $375.5 million. The offering is expected to close on or about January 19, 2018, subject to customary closing conditions. In addition, AveXis has granted the underwriters a 30-day option to purchase up to an additional 588,240 shares of common stock at the public offering price, less the underwriting discounts and commissions.\nAveXis intends to use its existing cash and cash equivalents and the net proceeds of the offering to fund its research, manufacturing and clinical activities to support its programs in SMA, Rett syndrome and ALS, to fund its pre-commercial activities, including medical affairs, development of commercial initiatives for the potential launch of AVXS-101 and licensing activities, and for general corporate purposes and working capital.\nGoldman Sachs & Co. LLC, Jefferies LLC and BofA Merrill Lynch are acting as joint book-running managers. BMO Capital Markets Corp. is acting as lead manager.\nThe offering is being made pursuant to a shelf registration statement on Form S-3 that was filed by AveXis with the Securities and Exchange Commission (“SEC”) and became automatically effective on March 17, 2017. The offering is being made only by means of a written prospectus and prospectus supplement that form a part of the registration statement. A preliminary prospectus supplement and accompanying prospectus relating to and describing the terms of the offering has been filed with the SEC. A final prospectus supplement and accompanying prospectus will be filed with the SEC. Copies of the preliminary prospectus supplement and the accompanying prospectus and copies of the final prospectus supplement and accompanying prospectus, when available, may be obtained for free by visiting EDGAR on the SEC’s website at www.sec.gov . Alternatively, copies of the final prospectus supplement and the accompanying prospectus, when available, may also be obtained for free from the offices of Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, NY 10282; by telephone at 1-866-471-2526; or by email at prospectus-ny@ny.email.gs.com , Jefferies LLC, Attention: Equity Syndicate Prospectus Department, 520 Madison Avenue, 2nd Floor, New York, NY 10022; by phone at 1-877-821-7388; or by email at Prospectus_Department@Jefferies.com , or BofA Merrill Lynch at NC1-004-03-43, 200 North College Street, 3rd floor, Charlotte, NC 28255-0001, Attention: Prospectus Department or by email at dg.prospectus_requests@baml.com .\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy any of these securities, nor shall there be any sale of these securities in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the applicable securities laws of such state or jurisdiction.\nAbout AveXis, Inc.\nAveXis is a clinical-stage gene therapy company developing treatments for patients suffering from rare and life-threatening neurological genetic diseases. The company’s initial proprietary gene therapy candidate, AVXS-101, is in the pivotal phase of study for the treatment of SMA Type 1, and a Phase 1 trial for SMA Type 2. The company also intends to expand its development of gene therapy into two additional rare neurological monogenic disorders: Rett syndrome and a genetic form of amyotrophic lateral sclerosis caused by mutations in the superoxide dismutase 1 gene.\nMedia Inquiries:\nLauren Barbiero\nW2O Group\n646-564-2156\nlbarbiero@w2ogroup.com\nInvestor Inquiries:\nJim Goff\nAveXis, Inc.\n650-862-4134\njgoff@avexis.com\nSource:AveXis, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/e4a9d2a6-4c35-48a8-8442-a48dbc2dea16", "https://www.globenewswire.com/Tracker?data=PzXXf2IqGD_itbgT4mR_HhGTenEGAG5pOye4-USfQKZiSZueyZVTpUvkQC_1O4hHQXmoL-o-7EQWW7Cvnbolsg==", "https://www.globenewswire.com/Tracker?data=JxK4R2j4_jX70YovzULi0S44ezUyTZy-aZk_DDBx24Sd3yV8b3Dp1FtWnoURRtGihSNA1EoG2lqulWxXxPepfqyLki4FcNe0BkXeh4XZ7haWYDGzw_Z2mCVCGI_YrCvQC6hrrIDUX2RULjD1pMEyPA==", "https://www.globenewswire.com/Tracker?data=e65YJN3QDKHgzGwELoweRG6QKH3nVggRbfXpYOZsA84atVg0YrM_moSzONeZLVWKqKF3zNcaY2u_KWC1IEIvr9M1FNmUfsc-ukmblrgMtfk=", "https://www.globenewswire.com/Tracker?data=aDAmBNmNnNv2vGaRja8xm4j4DdhK2ct2LTJkZ0qBIJOkGHWdO2U_i3KjHgU5jLTWex7EkIcAk7CKW3bdbQocS0R9xRH1uB_0GuYEkQYeOwjHZdWdycMkFdbzWsgYRYWZ2ZIUvSMCzj9S5_GS6qrRLOjzaDeWCw39h18VGH2CHiTEfE896MbaoAS9mJ3KW0bhy14gkfojKBhffAexHjjvJUaaOxDOMd1FLaFin0bdKi_VDpZtKLuvwihTObN-R4nBmnZfqQeKT_T9u0p20mBjAVHN4VRjadCA5SWwTIP-lBc=", "https://www.globenewswire.com/Tracker?data=Gf5zcisia5a258JsAtzhFDlHqIkNkXgIsBc1zhVai9auJlI485_DZiaNFL7FOVBOZD74xfDH6pXkRZSXTG49sA=="], "published": "2018-01-17T04:18:00.000+02:00", "crawled": "2018-01-17T05:17:43.022+02:00", "highlightTitle": ""}