{"organizations": [], "uuid": "20350064e36739add6be39b762a14698789fbee6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 35, "shares": 35, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/06/05/103690816-GettyImages-453058096.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/24/cramer-unpacks-the-wild-action-in-a-new-kind-of-market.html", "country": "US", "domain_rank": 767, "title": "Cramer unpacks the wild action in a 'new' kind of market", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T01:12:00.000+02:00", "replies_count": 0, "uuid": "20350064e36739add6be39b762a14698789fbee6"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/24/cramer-unpacks-the-wild-action-in-a-new-kind-of-market.html", "ord_in_thread": 0, "title": "Cramer unpacks the wild action in a 'new' kind of market", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "neutral"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "After a whiplash in the major averages on Wednesday drove the stock market to soaring highs before it fell to tumultuous lows, CNBC's Jim Cramer realized he needed to reevaluate.\nStocks opened to a healthy rally in the morning, but by midday, the Dow had fallen over 250 points. Shortly after Cramer wrote a piece about investors being too negative on stocks, the market shot back up to its rallying levels.\n\"That was the moment I realized it's time to adopt a new view about this market,\" the \" Mad Money \" host said. \"We have a 9:30 to 11:00 a.m. session. Then another one goes from 11:00 to 2:00, and then the final one covers the last couple hours before the close. This is the only way that we can make sense of what's currently going on.\"\nCramer partially attributed the wild action to the confusion of earnings season. The headline numbers rarely tell the full story; if investors did their own homework, they would often reach different conclusions, he said.\nThis time, Cramer decided to do the homework for investors to explain the peculiar intraday decline that plagued equities for several hours.\nHe began with the initial cause of the weakness: Texas Instruments' badly received earnings report .\n\"Having the misfortune of having to do all the homework, as I do, I can tell you that this was definitively not a bad quarter from TXN. It was actually an excellent quarter,\" the \"Mad Money\" host said. \"Why'd the stock go down? Simple: The stock of Texas Instruments started the year at $105 and it shot up to $120 ... ahead of the quarter, so therefore it kind of was due for a pullback.\"\nTexas Instruments' management did not help the case on the conference call, Cramer added. He even wondered if it was a mistake that the chipmaker's head of investor relations called its personal electronics business a \"mixed bag.\"\n\"When I heard the phrase 'mixed bag' with a stock that had just rallied 15 straight points, ... I knew it was all she wrote for Texas Instruments. I prayed for a do-over, that they could somehow take it back,\" Cramer said.\nBut that phrase wielded the power to take almost every single semiconductor-related stock plummeting.\nThe next leg of weakness came from surveys of Apple's suppliers that indicated iPhone sales may have declined since last quarter.\nWhile Cramer had no true insights about sales for the latest iPhone or its components, he admitted that it was possible they were not up to par and that investors wouldn't be hurt taking profits in their Apple positions.\n\"However, in what may be the loneliest defense of Apple I've made in ages, let me just say that even if sales are weaker, this company's been able to triumph over moments of weakness in the past,\" he argued. \"Remember, Apple's less a tech stock than a consumer products company with [a] terrific revenue stream and fabulous technological prowess. But that doesn't mean it never gets hit.\"\nThe last negative catalyst in Wednesday's market was General Electric's earnings report, in which the company disclosed that the Securities and Exchange Commission was investigating its accounting practices.\n\"My discipline says that accounting irregularities always equal sell, but I don't think this one's as bad as the people who bailed on the stock seemed to believe,\" Cramer said.\nAll in all, even with the investigation, General Electric's tepid quarter was no reason to sell the entire industrial cohort, the \"Mad Money\" host argued.\n\"Bottom line: we had two terrific sessions today, but we also had one hideous one. Pick your poison,\" Cramer said. \"I say if this pattern continues, you want to use the weakness to buy your favorites and use the strength to ring the register. But I hope things get less crazy — I'm not sure I can handle 15 trading days a week.\"\nWATCH: Cramer walks investors through the market's swings show chapters Cramer unpacks the wild action in a 'new' kind of market—one with 3 trading sessions a day 19 Hours Ago | 12:53 Disclosure: Cramer's charitable trust owns shares of Apple and General Electric.\n ", "external_links": [], "published": "2018-01-25T01:12:00.000+02:00", "crawled": "2018-01-25T01:38:00.004+02:00", "highlightTitle": ""}