{"organizations": [], "uuid": "f82a918a33a08d71dea00e1b2392618f379c5e59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-healthcare-services-group-inc-increases-fourth-quarter-cash-dividend-provides-update-on-2017-results.html", "country": "US", "domain_rank": 767, "title": "Healthcare Services Group, Inc. Increases Fourth Quarter Cash Dividend, Provides Update on 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:43:00.000+02:00", "replies_count": 0, "uuid": "f82a918a33a08d71dea00e1b2392618f379c5e59"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-healthcare-services-group-inc-increases-fourth-quarter-cash-dividend-provides-update-on-2017-results.html", "ord_in_thread": 0, "title": "Healthcare Services Group, Inc. Increases Fourth Quarter Cash Dividend, Provides Update on 2017 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BENSALEM, Pa., Jan. 30, 2018 (GLOBE NEWSWIRE) -- Healthcare Services Group, Inc.’s (NASDAQ:HCSG) Board of Directors has declared a quarterly cash dividend of $0.19125 per common share, payable on March 23, 2018 to shareholders of record at the close of business on February 16, 2018. This represents the 59th consecutive quarterly cash dividend payment, as well as the 58th consecutive increase since our initiation of quarterly cash dividend payments in 2003.\nOn December 22, 2017, the Tax Cuts and Jobs Act was signed into law, enacting significant changes to corporate tax rates, as well as business-related exclusions, deductions and credits. During the fourth quarter 2017, the Company recognized the effects of the changes in the tax law and rates on its deferred tax balances. The Company expects the impact of this remeasurement to increase its provision for income taxes by approximately $4.5 million.\nThe Company estimates that its effective tax rate for 2018 including the impact of its continuing participation in the Work Opportunity Tax Credit program, will be approximately 21% to 23%.\nThe Company intends to release financial results for the three months and year ended December 31, 2017 on Tuesday, February 6, 2018. The Company will host a conference call on Wednesday, February 7, 2018 at 8:30 a.m. Eastern Time to discuss its results for the three months and year ended December 31, 2017. The call may be accessed via phone at 800-893-5360. The call will be simultaneously webcast under the “Events & Presentations” section of the investor relations page on our website, www.hcsg.com . A replay of the webcast will also be available on our website through approximately 10:00 p.m. Eastern Time on Wednesday, February 7, 2018. The webcast will also be available on our website for one year following the date of the earnings call.\nCautionary Statement Regarding Forward-Looking Statements\nThis release and any schedules incorporated by reference into it may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which are not historical facts but rather are based on current expectations, estimates and projections about our business and industry, and our beliefs and assumptions. Words such as “believes,” “anticipates,” “plans,” “expects,” “ will,” “goal,” and similar expressions are intended to identify forward-looking statements. The inclusion of forward-looking statements should not be regarded as a representation by us that any of our plans will be achieved. We undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Such forward-looking information is also subject to various risks and uncertainties. Such risks and uncertainties include, but are not limited to, risks arising from our providing services exclusively to the health care industry, primarily providers of long-term care; having several significant clients which, both individually and in the aggregate, accounted for a significant portion of our total consolidated revenues for the year ended December 31, 2017; credit and collection risks associated with this industry; our claims experience related to workers’ compensation and general liability insurance; the effects of changes in, or interpretations of laws and regulations governing the industry, our workforce and services provided, including state and local regulations pertaining to the taxability of our services and other labor related matters such as minimum wage increases; continued realization of tax benefits arising from our corporate reorganization and self-funded health insurance program; risks associated with the reorganization of our corporate structure; realization of our expectations regarding the impact of the Tax Cuts and Jobs Act on our financial results; and the risk factors described in Part I of our Form 10-K for the fiscal year ended December 31, 2016 under “Government Regulation of Clients,” “Competition’’ and “Service Agreements and Collections,” and under Item IA “Risk Factors” in such Form 10-K.\nThese factors, in addition to delays in payments from clients and/or clients in bankruptcy or clients with which we are in litigation to collect payment, have resulted in, and could continue to result in, significant additional bad debts in the near future. Additionally, our operating results would be adversely affected if unexpected increases in the costs of labor and labor-related costs, materials, supplies and equipment used in performing services could not be passed on to our clients.\nIn addition, we believe that to improve our financial performance we must continue to obtain service agreements with new clients, retain and provide new services to existing clients, achieve modest price increases on current service agreements with existing clients and maintain internal cost reduction strategies at our various operational levels. Furthermore, we believe that our ability to sustain the internal development of managerial personnel is an important factor impacting future operating results and the successful execution of our projected growth strategies.\nHealthcare Services Group, Inc. is the largest national provider of professional housekeeping, laundry and dietary services to long-term care and related health care facilities.\nCompany Contacts: Theodore Wahl Matthew J. McKee President and Chief Executive Officer Senior Vice President of Strategy 215-639-4274 investor-relations@hcsgcorp.com\nSource:Healthcare Services Group, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=KY88x9grz0Qv04bAZEC8OGvJu6ru4bEFcZRGkhC8jxBCChxCs5KsW4141d5XQB0vwnjPwHW7OqJRYv-9H9qz6Q==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/21ba1a5b-807b-4ddd-b5db-33fb25994be2"], "published": "2018-01-31T01:43:00.000+02:00", "crawled": "2018-01-31T02:07:45.000+02:00", "highlightTitle": ""}