{"organizations": [], "uuid": "1f373f6cb062b7da2ee59c71e21084a518e3969d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/china", "section_title": "China | Reuters.com", "url": "https://www.reuters.com/article/us-china-economy-data/another-chinese-city-admits-fake-economic-data-idUSKBN1F60I1", "country": "US", "domain_rank": 408, "title": "Another Chinese city admits 'fake' economic data", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-17T13:46:00.000+02:00", "replies_count": 0, "uuid": "1f373f6cb062b7da2ee59c71e21084a518e3969d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-economy-data/another-chinese-city-admits-fake-economic-data-idUSKBN1F60I1", "ord_in_thread": 0, "title": "Another Chinese city admits 'fake' economic data", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "baotou", "sentiment": "none"}, {"name": "inner mongolia", "sentiment": "none"}, {"name": "inner mongolia autonomous region", "sentiment": "none"}, {"name": "tianjin", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - A northern industrial city in China said its 2017 fiscal revenue was significantly less than it had earlier estimated partly due to “fake” additions, making a revision just days after reports of similar incidents fueled scepticism over official data.\nBaotou in China’s Inner Mongolia Autonomous Region revised its estimated fiscal revenue in 2017 lower by nearly 50 percent in an annual work report, a copy of which was published on the Baotou government’s website on Jan. 13.\nThe Baotou city government said in the report that the revision was due to factors including “fake additions”. It did not say how the additions came about or who was responsible.\nDays earlier, the governments of Inner Mongolia and Tianjin, a large port city in northern China, said their fiscal and economic numbers for 2016 had been overstated.\n“We have been trying to change our mindset and change the course of our development model,” the Baotou government said, while pledging to tame government borrowings in part by halting debt-burdened public projects.\nBaotou was forced to halt an ambitious subway construction project earlier last year as the central government questioned its ability to finance the debt.\nInner Mongolia cut its industrial output figure for 2016 by 40 percent, according to the official Xinhua news agency on Jan. 3. It also said fiscal revenue for that year ought to be 26 percent less than initially stated. It did not give details.\nThe 2016 gross domestic product of Tianjin’s Binhai New Area - an economic zone once touted to become China’s Manhattan - was actually about a third smaller than previously announced, according to a commentary in the official People’s Daily on Jan. 15.\nThe incidents of data fraud coincided with a campaign led by Beijing to crackdown on risky lending, aimed partly at curbing runaway local government debt.\nThe People’s Daily said that while inflated data may look good on paper, it would lead to more stress in the less developed hinterland as it would cause the central government to reduce funding.\nIn January last year, the northeastern province of Liaoning said it had faked fiscal data from 2011 to 2014, becoming the first province to make such an admission.\nChinese provinces and cities have long been suspected of cooking up numbers, with the focus on local government officials, whose performance are often assessed based on how well their respective economies have performed.\nChina’s top leaders signaled a shift in priority as the country strives to be more quality driven. In an agenda-setting Communist Party congress in October, President Xi Jinping said China has now entered a “new era” where the country will prize quality growth over quantity.\nChina is set to release its 2017 GDP data on Thursday. Premier Li Keqiang has signaled that GDP growth should be around 6.9 percent, accelerating from a 26-year low of 6.7 percent in 2016.\nReporting by Yawen Chen and Ryan Woo; Editing by Simon Cameron-Moore\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T13:46:00.000+02:00", "crawled": "2018-01-17T11:53:19.009+02:00", "highlightTitle": ""}