{"organizations": [], "uuid": "27be2af5ca181b7d0c221582cded12055c08f1c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224556524&w=1200&r=LYNXMPEE0M1MN", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-worldcup-bids/trump-factor-looms-as-morocco-launch-bid-to-beat-north-american-world-cup-idUKKBN1FC2MG", "country": "US", "domain_rank": 408, "title": "Trump factor looms as Morocco launch bid to beat North American World Cup", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T20:37:00.000+02:00", "replies_count": 0, "uuid": "27be2af5ca181b7d0c221582cded12055c08f1c5"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-worldcup-bids/trump-factor-looms-as-morocco-launch-bid-to-beat-north-american-world-cup-idUKKBN1FC2MG", "ord_in_thread": 0, "title": "Trump factor looms as Morocco launch bid to beat North American World Cup", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "gulati", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "sunil gulati", "sentiment": "none"}, {"name": "simon evans", "sentiment": "none"}], "locations": [{"name": "morocco", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "fifa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 39 PM / Updated 11 minutes ago Trump factor looms as Morocco launch bid to beat North American World Cup Simon Evans 4 Min Read \nLONDON (Reuters) - The competing bids for the 2026 World Cup, the first that will feature an expanded 48-team field, began their campaigns in earnest on Tuesday ahead of June’s FIFA congress vote -- with the Donald Trump factor one of the key unknowns. \nThe three-nation North American bid featuring the United States, Canada and Mexico starts as clear favourites but Morocco are hoping to follow South Africa and become the second African nation to host the global event. \nWith a host of existing large stadiums and ready infrastructure to call on, North American bid head Sunil Gulati is confident his team can win over FIFA as a low-risk, high-income option. \n“We think the certainty and risk-aversion we can provide for the central piece of revenue for FIFA going forward is pretty compelling,” Gulati told reporters at a briefing in London. \nWhile the technical details will be submitted in mid-March to FIFA and the vote comes at June’s congress in Moscow, the impact of Donald Trump’s presidency could be an influence. \nTrump’s reported comments about “shithole countries” during a recent White House meeting discussing immigrants from Haiti and African nations are unlikely to have helped the North American bid, which will be voted on by all 207 member nations of FIFA. \nBut Gulati brushed off suggestions that Trump’s words could have a major impact on the vote. \n“Whether it’s the Olympics or the World Cup we cannot control the politics. It will change over time and we have all of the assurances we need from all three governments to support the bid,” he said. \nGulati flew into London with Mexican FA head Decio de Maria and Canadian Victor Montagliani, president of the regional CONCACAF confederation which covers North America as well as Central America and the Caribbean. RIVAL BID \nBut the Moroccan bid, which is working with renowned international sports consultancy Vero Communications, also chose Tuesday to launch their campaign. \nAt a gathering in Casablanca, the bid’s logo, leadership team and social media channels were unveiled with officials promising their bid would be compelling. \n“Morocco 2026 will showcase the best of football, at the heart of the world in the dynamic continent of Africa. We are ready to welcome the world and it is our promise to stage a tournament overflowing with real passion and to celebrate the game’s values of unity, peace and integrity,” said Moulay Hafid Elalamy, Chairman of the Morocco 2026 Bid Committee. \nThe North African country bid unsuccessfully to stage the 1994, 1998, 2006 and 2010 World Cups. \nThe country was second to the United States in 1994, behind France in 1998 and narrowly lost out to South Africa in its offer to stage the 2010 finals, the only time the tournament has been held in Africa. \nWhile Gulati stressed that the extra games and high-capacity NFL stadiums would ensure a record five million tickets would be on sale for the tournament, the Moroccans have plenty of work to do to identify venues for the expanded tournament. \n“We may surprise many people with our strong infrastructure and commercial offering, and we will highlight our wonderful welcome, host cities and stunning locations. It promises to be a truly special bid,” said Fouzi Lekjaa, President of the Royal Moroccan Football Federation (FRMF). \nFIFA produced new bidding criteria after the organisation was heavily criticised over the selection process for the 2018 and 2022 World Cup finals, won by Russia and Qatar respectively. Reporting by Simon Evans; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-23T20:37:00.000+02:00", "crawled": "2018-01-23T20:52:16.015+02:00", "highlightTitle": ""}