{"organizations": [], "uuid": "578cf9e2722ee015b9514762329b762593d2b57e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-less-complicated-companies-achieve-above-average-revenue-growth-and-profit-margins-new-study-shows.html", "country": "US", "domain_rank": 767, "title": "Less Complicated Companies Achieve Above-Average Revenue Growth and Profit Margins, New Study Shows", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T08:01:00.000+02:00", "replies_count": 0, "uuid": "578cf9e2722ee015b9514762329b762593d2b57e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-less-complicated-companies-achieve-above-average-revenue-growth-and-profit-margins-new-study-shows.html", "ord_in_thread": 0, "title": "Less Complicated Companies Achieve Above-Average Revenue Growth and Profit Margins, New Study Shows", "locations": [], "entities": {"persons": [], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "the boston consulting group", "sentiment": "none"}, {"name": "bcg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Corporations often respond to an increasingly complex business environment by adding new functions, layers, roles, rules, and processes, hampering productivity and hindering growth and profitability, according to a recent study conducted by The Boston Consulting Group (BCG). Reducing complicatedness, the results suggest, can significantly improve responsiveness and create competitive advantage over slower-moving rivals.\nBCG’s Smart Simplicity team surveyed corporate leaders, managers, and employees at more than 1,000 companies about their company’s business practices in eight key dimensions previously identified as common sources of excessive complicatedness. Survey respondents can compare their company’s results with those of comparable companies by industry, size, and geographic location. This benchmarking tool can reveal a wealth of information that can help companies pursue their own simplification agenda.\nThe eight dimensions of complicatedness include leadership; strategy and transformation agenda; structure; activities and roles; processes, systems, and IT; decision making; performance management; and people and interactions.\n“Companies in every industry are struggling to boost growth and profitability in an increasingly complex and competitive business environment,” said Reinhard Messenböck, senior partner and managing director at BCG and coauthor of the study. “Rather than blaming external factors for their troubles, successful company leaders examine their own organizations more closely.”\nComplicatedness can affect any kind of company, the study shows. Size doesn’t matter. Complicatedness can affect even the smallest companies if their processes, systems, and cultures hamper efforts to respond effectively to changing market conditions and customer demands.\nComplicatedness does, however, vary by industry. Technology, media, and telecom companies, for example, are generally less burdened by complicated structures and processes that might slow their ability to react to fast-changing markets. But health care and public-sector organizations that face high levels of external complexity tend to respond with excessive levels of complicatedness.\nAnd the perception of complicatedness varies by role. Corporate leaders perceive far less complicatedness at their companies than lower-level employees do. This finding is critical, says Yves Morieux, senior partner and managing director at BCG and coauthor of the study: “Top leaders have a substantial impact on their company’s degree of complicatedness. Yet they often fail to see just how much excessively complicated activities, processes, and interactions reduce employee productivity. They see the disappointing outcomes, but the root causes are much less clear to them. They are not regularly in the trenches, so they rarely feel the painful effects of complicatedness. This can make efforts to simplify their company significantly more difficult.”\nBCG recommends a four-step approach to implementing a lasting simplification solution: identify performance issues caused by complicatedness, diagnose the causes of complicatedness, develop interventions that address the causes of specific performance issues, and apply the specific interventions.\nTo read “How Complicated Is Your Company?” visit: https://www.bcg.com/publications/2018/complicated-company.aspx .\nTo take the Complicatedness Survey and compare your level of complicatedness with that of other companies, visit https://www.113.vovici.net/se/13B2588B6597EE20 .\nTo arrange an interview with one of the authors, please contact Eric Gregoire at +1 617 850 3783 or gregoire.eric@bcg.com .\nAbout The Boston Consulting Group\nThe Boston Consulting Group (BCG) is a global management consulting firm and the world’s leading advisor on business strategy. We partner with clients from the private, public, and not-for-profit sectors in all regions to identify their highest-value opportunities, address their most critical challenges, and transform their enterprises. Our customized approach combines deep insight into the dynamics of companies and markets with close collaboration at all levels of the client organization. This ensures that our clients achieve sustainable competitive advantage, build more capable organizations, and secure lasting results. Founded in 1963, BCG is a private company with offices in more than 90 cities in 50 countries. For more information, please visit bcg.com .\nThe Boston Consulting Group\nEric Gregoire\nGlobal Media Relations Manager\nTel +1 617 850 3783\nFax +1 617 850 3701\ngregoire.eric@bcg.com\nSource: BCG", "external_links": ["https://www.113.vovici.net/se/13B2588B6597EE20", "https://www.globenewswire.com/NewsRoom/AttachmentNg/00bd4b0b-927b-4a38-92f8-f2a968c79db4", "http://www.bcg.com/", "https://www.bcg.com/publications/2018/complicated-company.aspx"], "published": "2018-01-16T08:01:00.000+02:00", "crawled": "2018-01-16T08:30:22.002+02:00", "highlightTitle": ""}