{"organizations": [], "uuid": "e52ba55d41b0f9a273de718953f2ab70f9b952ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-global-eagle-reports-financial-results-for-first-three-quarters-of-2017.html", "country": "US", "domain_rank": 767, "title": "Global Eagle Reports Financial Results for First Three Quarters of 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:45:00.000+02:00", "replies_count": 0, "uuid": "e52ba55d41b0f9a273de718953f2ab70f9b952ee"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-global-eagle-reports-financial-results-for-first-three-quarters-of-2017.html", "ord_in_thread": 0, "title": "Global Eagle Reports Financial Results for First Three Quarters of 2017", "locations": [], "entities": {"persons": [{"name": "jeff leddy", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "global eagle", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "global eagle entertainment inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Today Becomes Current with SEC Reporting Obligations\nToday Satisfies All NASDAQ Continued Listing Conditions\nLOS ANGELES, Jan. 31, 2018 (GLOBE NEWSWIRE) -- Global Eagle Entertainment Inc. (NASDAQ:ENT) (“Global Eagle,” the “Company” or “we”), a leading provider of media, content, connectivity and data analytics to markets across air, sea and land, today announces unaudited financial results for the nine months ended September 30, 2017. Today, the Company will file with the Securities and Exchange Commission (“SEC”) its Quarterly Reports on Form 10-Q for the quarters ended March 31, June 30 and September 30, 2017. For the nine-month period ended September 30, 2017, Global Eagle recorded revenue of $460 million; incurred a net loss of $223 million; and generated Adjusted EBITDA* of $48.3 million.\n“Today, we become current with our SEC reporting and will have met all of Nasdaq’s conditions for continued listing,” commented Jeff Leddy, CEO of Global Eagle. “The results for our first three quarters of 2017 are consistent with our goal of building a solid foundation for Global Eagle. We have worked internally to drive operational improvements through integration of our products, personnel and locations, setting the foundation for continuous efficiency gains as we move into 2018.”\nOver the past year, Global Eagle has improved service levels to its customers and their end-users through more efficient network management, due in part to the implementation of technology from prior acquisitions. Further, the Company continues to strengthen its go-to-market strategy by developing solutions that enhance the customer’s entertainment experience, such as the Company’s new Ocean Prime TV product for maritime markets. Ocean Prime TV is an extension of the Company’s successful aviation IPTV and cruise-television products, which the Company has customized for broader maritime segments.\n“We have made important investments in customer service and operational excellence to improve the delivery of our world class products to airline, cruise and yacht passengers and other end-users,” continued Mr. Leddy. “Our emphasis on operational execution combined with our improved go-to-market strategy has been validated recently with multiple new business wins in both our Media & Content and Connectivity segments.”\nPaul Rainey, CFO of Global Eagle, remarked, “Beginning in 2017 and continuing into 2018, we began strengthening our finance functions and shared services, which we expect will lead to lower one-time cash expenses and reduce overall operating expenses as we move into 2018. We plan to drive margin expansion through operating leverage driven by organic revenue growth, the integration of past acquisitions, and the continued implementation of finance and operational control systems and processes. Additionally, we are putting particular emphasis on improving our cash-flow generation in 2018.”\nCompany Highlights\nTotal revenue for the nine-month period ended September 30, 2017 was $460 million, a 23% increase over the prior-year period. The increase over the prior-year period was driven by the acquisition of Emerging Markets Communications in late July 2016 (“EMC”) and growth in service revenue in our Connectivity segment due to new aircraft, vessel and site additions, which was partially offset by a revenue decline in our Media & Content segment. The Connectivity segment significantly increased Wi-Fi performance to our largest customers, which—when coupled with our improved bandwidth management technologies and efficiencies—has delivered scalability and streaming-class capability for airline, cruise, yacht, and other customers. The Media & Content segment successfully launched its award-winning mobile content app for offline movie viewing pre-, post- and during flight. The Company expanded its advertising product, including with IPTV, and has pre-sold significant advertising inventory for 2018.\nCovenant Compliance and Listing Update\nThe Company has been compliant with its financial covenants in its credit agreement and expects to continue to remain in compliance throughout 2018. After filing its 2017 Quarterly Reports on Form 10-Q later today, the Company will have fulfilled the conditions set by Nasdaq for continued listing and expects Nasdaq to confirm shortly that it is discontinuing its delisting proceedings.\nWebcast\nGlobal Eagle will host a live webcast tomorrow (Thursday, February 1, 2018) at 12:00 p.m. ET (9:00 a.m. PT). The Company will make the webcast available on the Investor Relations section of its website at http://investors.geemedia.com/events.cfm . An archive of the webcast replay will be on its website for 30 days following the event.\nAbout Global Eagle\nGlobal Eagle is a leading provider of media, content, connectivity and data analytics to markets across air, sea and land. Global Eagle offers a fully integrated suite of rich media content and seamless connectivity solutions to airlines, cruise lines, commercial ships, high-end yachts, ferries and land locations worldwide. With approximately 1,500 employees and 50 offices on six continents, the Company delivers exceptional service and rapid support to a diverse customer base. Find out more at: www.GlobalEagle.com .\nContact:\nPeter A. Lopez\nVice President, Investor Relations\n+1 310-740-8624\ninvestor.relations@geemedia.com\npr@geemedia.com\n* About Non-GAAP Financial Measures\nTo supplement our consolidated financial statements, which are prepared and presented in accordance with accounting principles generally accepted in the United States, or GAAP, we present Adjusted EBITDA, which is a non-GAAP financial measure, as a measure of our performance. The presentation of Adjusted EBITDA is not intended to be considered in isolation from, or as a substitute for, or superior to, net income (loss) or any other performance measures derived in accordance with GAAP or as an alternative to net cash provided by operating activities or any other measures of our cash flows or liquidity. Further, we note that Adjusted EBITDA as presented herein is defined and calculated differently than the “Consolidated EBITDA” definition in our senior-secured credit agreement, which Consolidated EBITDA definition we use for financial-covenant-compliance purposes thereunder and as a measure of our liquidity. For more information on the non-GAAP financial measure used herein, please see the table entitled “Reconciliation of GAAP to Non-GAAP Measure” at the end of this release.\nAdjusted EBITDA is one of the primary measures used by our management and Board of Directors to understand and evaluate our financial performance and operating trends, including period to period comparisons, to prepare and approve our annual budget and to develop short and long term operational plans. Additionally, Adjusted EBITDA is one of the primary measures used by the Compensation Committee of our Board of Directors to establish the funding targets for (and subsequent funding of) our Annual Incentive Plan bonuses for our employees and executives. We believe our presentation of Adjusted EBITDA is useful to investors both because it allows for greater transparency with respect to key metrics used by management in its financial and operational decision-making and because our management frequently uses it in discussions with investors, commercial bankers, securities analysts and other users of our financial statements.\nWe define Adjusted EBITDA as net income (loss) before (a) interest expense (income), (b) income tax expense (benefit) and (c) depreciation and amortization (including relating to equity-method investments) and loss on disposal and impairment of fixed assets, and we then further adjust that result to exclude (1) change in fair value of financial instruments, (2) other (income) expense, including primarily, when applicable, (gains) losses from investments and foreign-currency-transaction (gains) losses, (3) goodwill impairment expense, (4) stock-based compensation expense, (5) strategic-transaction, integration and realignment expenses (as described below), (6) auditor and related third-party professional fees and expenses related to our internal-control deficiencies (and the remediation thereof) and delays in our 2016 audit process, (7) excess content expenses (as described below), (8) securities class-action expenses (as described below), (9) losses on significant customer bankruptcies (as described below) and (10) restructuring expenses pursuant to our September 2014 integration plan (when applicable in the period). Management does not consider these items to be indicative of our core operating results.\n“Excess content expenses” includes the additional purchasing costs that we incurred in 2017 to procure movie content for our customers, notwithstanding that we could have procured equivalent content under our (preferential-pricing) output arrangements with major studios. We incurred these additional costs because we could not timely identify and measure our movie-content expenditures and procurement during the period due to weaknesses in our control environment.\n“Losses on significant customer bankruptcies” includes (1) our provision for bad debt associated with the bankruptcies of Air Berlin and Alitalia (two of our Media & Content customers) in 2017, together with (2) the costs ( e.g ., content acquisition fees) that we incurred to maintain service to those customers during their bankruptcy proceedings in order to preserve the customer relationship.\n“Securities class-action expenses” includes third-party professional fees and expenses associated with the securities class-action lawsuits filed against us in 2017.\n“Strategic-transaction, integration and realignment expenses” includes (1) transaction-related expenses and costs (including third-party professional fees) attributable to acquisition, financing, investment and other strategic-transaction activities, (2) integration and realignment expenses and allowances, (3) employee-severance, retention and relocation expenses, (4) purchase-accounting adjustments for deferred revenue, costs and credits associated with companies and businesses that we have acquired through our M&A activities, (5) service-level-agreement penalties incurred during our Eagle-1 migration and setup in its new orbital slot in 2017, and (6) claims at companies or businesses that we acquired through our M&A activities for underlying liabilities that pre-dated our acquisition of those companies or businesses. In respect of clause (6) in this definition, we include ( i.e ., exclude from net income (loss)) any estimated loss contingencies and provisions for legal settlements relating to those liabilities.\nCautionary Note Concerning Forward-Looking Statements\nCertain statements in this press release may constitute “forward-looking” statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include, without limitation, statements with respect to our cash-flow generation, revenue growth and margin expansion in future periods, SEC reporting compliance, continued financial-covenant compliance under our credit agreement, the cessation of Nasdaq’s delisting proceedings, M&A integration activities, our systems and process implementation activities, business outlook, industry, business strategy, plans, goals and expectations concerning our market position, international expansion, future technologies, future operations, margins, profitability, future efficiencies, capital expenditures, liquidity and capital resources and other financial and operating information. When used in this discussion, the words “anticipate,” “assume,” “believe,” “budget,” “continue,” “could,” “estimate,” “expect,” “intend,” “may,” “plan,” “potential,” “predict,” “project,” “should,” “will,” “future” and the negative of these or similar terms and phrases are intended to identify forward-looking statements in this press release.\nForward-looking statements reflect our current expectations regarding future events, results or outcomes. These expectations may or may not be realized. Although we believe the expectations reflected in the forward-looking statements are reasonable, we can give you no assurance these expectations will prove to have been correct. Some of these expectations may be based upon assumptions, data or judgments that prove to be incorrect. Actual events, results and outcomes may differ materially from our expectations due to a variety of known and unknown risks, uncertainties and other factors. Although it is not possible to identify all of these risks and factors, they include, among others, the following:\nour ability to remediate material weaknesses in our internal control over financial reporting and to complete such remediation in a timely manner, and the effect of those weaknesses on our ability to forecast our operations and financial performance; our ability to maintain effective disclosure controls and internal control over financial reporting; our ability to maintain sufficient cash flow and liquidity to operate our business; our ability to implement new revenue recognition standards in a timely manner; our dependence on the travel industry; future acts or threats of terrorism; our ability to obtain new customers and renew agreements with existing customers, and particularly our dependence on our existing relationship with Southwest Airlines; our ability to retain and effectively integrate and train key members of senior management; our ability to recruit, train and retain highly skilled technical employees, particularly in our finance and IT functions; our ability to receive the anticipated cash distributions or other benefits from our investment in the Wireless Maritime Services joint venture; the effect of a variety of complex U.S. and foreign tax laws and regimes due to the global nature of our business; our ability to continue to be able to make claims for investment tax credits in Canada; our exposure to foreign currency risks and a lack of a formalized hedging strategy; our need to invest in and develop new broadband technologies and advanced communications and secure networking systems, products and services and antenna technologies, as well as their market acceptance; increased demand by customers for greater bandwidth, speed and performance and increased competition from new technologies and market entrants; customer attrition due to direct arrangements between satellite providers and customers; our reliance on “sole source” service providers and other third parties for key components and services that are integral to our product and service offerings; the potential need to materially increase our investments in product development and equipment; our ability to expand our international operations and the risks inherent in our international operations; service interruptions or delays, technology failures, damage to equipment or software defects or errors and the resulting impact on our reputation and ability to attract, retain and serve our customers; equipment failures or software defects or errors that may damage our reputation or result in claims in excess of our insurance coverage; satellite failures or degradations in satellite performance; our ability to integrate businesses or technologies we have acquired or may acquire in the future; our use of fixed-price contracts for satellite bandwidth and potential cost differentials that may lead to losses if the market price for that service declines relative to our committed cost; pricing pressure from suppliers and customers in our Media & Content segment and a reduction in the industry’s use of intermediary content service providers (such as us); a reduction or elimination of the time between our receipt of content and it being made available to the rental or home viewing market ( i.e ., the “early release window”); a reduction in the volume or quality of content produced by studios, distributors or other content providers; increased on-board use of personal electronic devices and content accessed and downloaded prior to travel and our ability to compete as a content provider against “over the top” download services and other companies that offer in-flight entertainment systems; increased competition in the IFE and IFC system supply chain; our ability to plan expenses and forecast revenue due to the long sales cycle of many of our Media & Content segment’s products; our use of fixed-price contracts in our Media & Content segment that may lead to losses in the future if the market price for that service declines relative to our committed cost; our ability to develop new products or enhance those we currently provide in our Media & Content segment; our ability to protect our intellectual property; the effect of any data or privacy breaches, data or privacy theft, unauthorized access to our internal systems of Connectivity or Media & Content systems or phishing or hacking; our ability to successfully implement a new enterprise resource planning system; the costs to defend and/or settle current and potential future civil intellectual property lawsuits (including relating to music and other content infringement) and related claims for indemnification; changes in regulations and our ability to obtain regulatory approvals to provide our services or to operate our business in particular countries or territorial waters; compliance with U.S. and foreign regulatory agencies, including the Federal Aviation Administration and Federal Communications Commission and their foreign equivalents in the jurisdictions in which we and our customers operate; changes in government regulation of the Internet, including e-commerce or online video distribution; our ability to comply with trade, export, anti-money laundering and foreign corrupt practices and data protection laws, especially the Foreign Corrupt Practices Act; costs associated with stockholder litigation and our indemnification obligations with respect to current and former executive officers and directors; limitations on our cash flow available to make investments due to our substantial indebtedness and our ability to generate sufficient cash flow to make payments thereon; our ability to repay the principal amount of our bank debt and/or convertible notes at maturity, to raise the funds necessary to settle conversions of our convertible notes or to repurchase our convertible notes upon a fundamental change or on specified repurchase dates or due to future indebtedness; the conditional conversion of our convertible notes; the effect on our reported financial results of the accounting method for our convertible notes; the impact of the fundamental change repurchase feature of the indenture governing our convertible notes on our price or potential as a takeover target; the dilution or price depression of our common stock that may occur as a result of the conversion of our convertible notes; our ability to meet the continued listing requirements of Nasdaq, in particular given our recent history of delinquent periodic filings with the U.S. Securities and Exchange Commission; our eligibility to use Form S-3 to register the offer and sale of securities; conflicts between our interests and the interests of our largest stockholders; volatility of the market price of our securities; the dilution of our common stock that may occur as a result of the exercise of outstanding warrants; anti-takeover provisions contained in our charter and bylaws; the dilution of our common stock if we issue additional equity or convertible debt securities; and other risks and factors listed under “Risk Factors” in our Annual Report on Form 10-K for the year ended December 31, 2016 that we filed with the SEC on November 17, 2017 and in our subsequently filed Quarterly Reports on Form 10-Q.\nThe forward-looking statements herein speak only as of the date the statements are made (which is the date of this press release). You should not put undue reliance on any forward-looking statements. We assume no obligation to update forward-looking statements to reflect actual results, changes in assumptions or changes in other factors affecting forward-looking information, except to the extent required by applicable securities laws. If we do update one or more forward-looking statements, no inference should be drawn that we will make additional updates with respect to those or other forward-looking statements.\nFinancial Information\nThe table below presents financial results for the nine months ended September 30, 2017 and 2016.\nGlobal Eagle Entertainment Inc. Condensed Consolidated Statements of Operations (In thousands, except per share amounts) (Unaudited) Nine Months Ended September 30, 2017 2016 Revenue $ 459,871 $ 372,991 Operating expenses: Cost of sales 341,580 255,202 Sales and marketing 30,376 19,553 Product development 26,921 25,078 General and administrative 109,372 82,395 Legal Settlement 785 41,688 Amortization of intangible assets 32,849 24,055 Goodwill impairment 78,000 - Total operating expenses 619,883 447,971 Loss from operations (160,012 ) (74,980 ) Other income (expense), net: Interest income (expense), net (43,935 ) (7,829 ) Loss on Extinguishment of Debt (14,389 ) - Income (loss) from equity method investments 3,911 2,065 Change in fair value of financial instruments 2,672 17,982 Other income (expense), net 38 (4,623 ) Loss before income taxes (211,715 ) (67,385 ) Provision (benefit) for income taxes 10,993 (46,167 ) Net loss $ (222,708 ) $ (21,218 ) Net income (loss) per share Basic $ (2.57 ) $ (0.27 ) Diluted $ (2.57 ) $ (0.27 ) Weighted average shares – basic and diluted Basic 86,710 79,892 Diluted 86,710 79,892\nGlobal Eagle Entertainment Inc. Condensed Consolidated Balance Sheet (In thousands) (Unaudited) September 30, December 31, 2017 2016 CURRENT ASSETS: Cash and cash equivalents $ 58,037 $ 50,686 Restricted cash 1,021 17,992 Accounts receivable, net 113,924 120,492 Inventories 29,793 25,986 Prepaid expenses 20,615 17,658 Other current assets 11,987 20,786 TOTAL CURRENT ASSETS: 235,377 253,600 Content library 9,581 21,470 Property, plant and equipment, net 200,894 166,049 Goodwill 248,693 327,836 Intangible assets, net 133,737 166,720 Equity method investments 155,378 156,527 Other non-current assets 8,636 7,233 Total Assets $ 992,296 $ 1,099,435 Liabilities and Stockholders' Equity CURRENT LIABILITIES: Accounts payable and accrued liabilities 191,611 240,344 Deferred revenue 6,610 6,970 Current portion of long-term debt 13,424 2,069 Other current liabilities 10,849 11,754 TOTAL CURRENT LIABILITIES: 222,494 261,137 Deferred revenue, non-current 1,067 1,536 Long-term debt 601,653 468,231 Deferred tax liabilities 31,801 33,205 Other non-current liabilities 30,038 36,329 Total Liabilities 887,053 800,438 Stockholders' Equity Common stock 10 9 Treasury stock, 3,053,634 shares at September 30, 2017 and December 31, 2016 (30,659 ) (30,659 ) Additional paid-in capital 776,033 747,005 Subscriptions receivable (566 ) (553 ) Accumulated deficit (639,385 ) (416,389 ) Accumulated other comprehensive loss (190 ) (416 ) Total Stockholder's Equity 105,243 298,997 Total Liabilities and Stockholders' Equity $ 992,296 $ 1,099,435\nGlobal Eagle Entertainment Inc. Reconciliation of GAAP to Non-GAAP Measure (In thousands) (Unaudited) Nine Months Ended\nSeptember 30, Adjusted EBITDA reconciliation: 2017 2016 Net income (loss) (222,708 ) (21,218 ) Interest expense (income) 58,324 7,829 Income tax expense (benefit) 10,993 (46,167 ) Depreciation and amortization and loss on disposal and impairment of fixed assets 73,342 38,169 Change in fair value of financial instruments (2,672 ) (17,982 ) Other (income) expense (38 ) 4,623 Goodwill impairment expense 78,000 - Stock-based compensation expense 4,000 8,062 Strategic-transaction, integration and realignment expenses 20,209 64,869 Internal-control and delayed audit expenses 23,458 - Excess content expenses 1,987 - Securities class-action expenses 869 - Losses on significant customer bankruptcies 2,537 - Adjusted EBITDA 48,301 38,185 See \"About Non-GAAP Financial Measures\" in the accompanying press release, including our definition of Adjusted EBITDA described therein.\nSource:Global Eagle Entertainment Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=lMgl8Fv4YsrGi-9UCbu6orNAA36p7EtL5v53766weL21q9UykRO6I6rVFsDVjvw2YD00xTRs55ANU-dmpVD7dY2EE5RCAreoHhbiIIc2WwExQtCkb2A1K21va4oS4InWT366DmkxqZXmAKF8FRyY9A==", "https://www.globenewswire.com/Tracker?data=tyjVtpbO9IuBg0azQQ9HtElaQ7dG_MfP37yoRbsWn7KvwLHyndlsVBOw4ST5Sbtkt3JJcFkXw0IHTPy0dE0vHHlmQe57z2N_qdXn5-fRDP5kwq-wdfmClOEn8ak-7NgP", "https://www.globenewswire.com/Tracker?data=Rx7HbZzzEb3Mzz3rGCW1k6plpMQmeumXgJuOFlVM87c5POhF5jeq0AF5nX1am8xtMfy6UyumtBxCayxs5csezTUC7jbACsE5JeWpP5tgHnw=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/26032837-5298-4df0-8b08-c302834bae55", "https://www.globenewswire.com/Tracker?data=I1tjsBTM4qe7n6xZMSAQQi9KUdj8PKxdJWAqibkpo2U2H1jyxFdwBKefYh8tRAl2svZUps4A4kU6hNo98qEDXw==", "http://investors.geemedia.com/events.cfm"], "published": "2018-01-31T16:45:00.000+02:00", "crawled": "2018-01-31T18:36:06.023+02:00", "highlightTitle": ""}