{"organizations": [], "uuid": "17be613af4699d389bdd6c7f1bde4ab03f46b0d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223878597&w=1200&r=LYNXMPEE0K0IN", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/emerging-borrowing-sin/analysis-emerging-economies-free-of-original-sin-but-companies-still-unforgiven-idINKBN1FA0N5", "country": "US", "domain_rank": 408, "title": "Analysis: Emerging economies free of \"original sin\" but companies still unforgiven", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T16:05:00.000+02:00", "replies_count": 0, "uuid": "17be613af4699d389bdd6c7f1bde4ab03f46b0d8"}, "author": "", "url": "https://in.reuters.com/article/emerging-borrowing-sin/analysis-emerging-economies-free-of-original-sin-but-companies-still-unforgiven-idINKBN1FA0N5", "ord_in_thread": 0, "title": "Analysis: Emerging economies free of \"original sin\" but companies still unforgiven", "locations": [], "entities": {"persons": [{"name": "barry eichengreen", "sentiment": "none"}, {"name": "ricardo hausmann", "sentiment": "none"}, {"name": "sujata rao", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Most developing nations have been absolved of the “original sin” that blocked them using their own currencies to raise money abroad, but their companies’ sins have still not been forgiven, as the huge debt they have racked up in “hard” currency attests.\nOriginal sin, which is how economists Barry Eichengreen and Ricardo Hausmann described the dilemma for emerging market (EM) economies that were unable to borrow abroad in their own currencies, is now largely a thing of the past for sovereign debt.\nCorporate borrowing in local currencies has not taken off, however. For one thing, much of the debt is not easily accessible to foreign investors; for another, borrowing in dollars, pounds or euros is usually cheaper, especially since the crash in Western interest rates after 2009.\nAbove all, investors see these securities as inherently riskier than government debt.\n“Sovereigns can issue debt in hard currency or local currency, but that’s a luxury which is not there yet for most corporates,” said Abhishek Kumar, lead portfolio manager for emerging markets at State Street Global Advisors.\nOutstanding emerging corporate debt denominated in hard currencies has doubled since 2007 to $7 trillion, according to the financial industry body, the Institute of International Finance (IIF), nearly 7 times than EM governments’ at around $1.1 trillion.\nGovernments are now using currencies such as the rand and rouble for more than 80 percent of their borrowing. Hard currency movements still affect the price at which they borrow but their vulnerability to exchange rate swings is far less than it was.\nThe shift towards greater acceptance of emerging currencies was highlighted recently when several central banks confirmed they now hold China’s yuan in their forex reserves.\nLike emerging markets economies that suffered currency crises in the 1990s, companies risk a strengthening in the dollar or euro against the currencies in which they earn revenues, which can make debt repayment significantly costlier.\nAlso, with U.S. interest rates rising, investors could demand higher and higher yields to “roll over” maturing debt.\nThe IIF and the Bank for International Settlements have repeatedly warned of these risks. Earlier this month, the IIF said the borrowing binge of the past decade meant large amounts of hard currency debt would need to be rolled over in coming years, with around $450 billion due for repayment in 2018.\n“Rising global interest rates will add to worries about the debt servicing capacity of highly indebted firms and governments,” it said [nL8N1OZ46E].\nEmerging market companies also have up to $30 trillion in domestic currency debt but this is mostly in bank loans and almost all is held locally. Most bonds issued in domestic currencies are not eligible for processing through Euroclear, the international post-trade services system which increases convenience and transparency.\nGROWING MARKET Prospects for emerging currency corporate bonds looked bright in 2014, when Bank of America Merrill Lynch launched a special index with around 250 “Euroclearable” securities.\nBut more than three years later, the index is still not tracked by any passive funds, according to the ICE exchange, which took over BAML indices in 2017. JPMorgan, which runs the most widely used emerging debt indexes, still does not have a local corporate bond benchmark.\nOne of the few active funds in the sector is run by Brent David, a portfolio manager at BlueBay Asset Management. He says the market is improving and estimates up to $500 billion of corporate local bonds are now Euroclearable, twice the amount in 2014.\nWhile that’s less than a tenth of outstanding bonds, he expects the number will rise as Chinese and Indian firms issue yuan and rupee debt in Hong Kong, Singapore or London.\n“More and more corporates are feeling the need to shift to issuing in their own currencies. They are trying to diversify their investor base, and to tap foreign investors they have to issue in Euroclearable format,” David said.\nFor David, a key attraction is that the BAML index’s average yield is roughly two percentage points above JPMorgan’s GBI-EM sovereign debt benchmark, after taking into account its shorter duration.\nIt also offers exposure to the Indian and Chinese currencies, which are not part of the GBI-EM, he said.\nILLIQUID For the market to really take off, however, foreign funds need bigger sizes and trading volumes, which will be difficult to achieve without developing pension and asset management industries within emerging markets.\nNot all companies will be keen to undertake the disclosures and operational complexities that Euroclear involves.\nEven when bonds are Euroclearable, investors are wary. Russian lender Sberbank estimates foreigners own less than 5 percent of the corporate rouble bond market, which has over $100 billion outstanding and has been Euroclearable since 2013.\nIn contrast, they hold a third of rouble government debt.\n“You have to weigh up: do you get compensated enough if you go into a non-sovereign instrument?” said Paul Greer, assistant portfolio manager at Fidelity International.\n“With local corporate bonds, you get a small amount of spread over the sovereign curve but you have to deal with FX risk, credit risk and interest rate risk.”\nIrresistibly cheap global borrowing costs may also have hampered the market’s development - dollar-denominated emerging corporate bonds yield an average 5.2 percent, according to the CEMBI Global index. That’s well below what firms from Brazil or India would pay to borrow in their own currencies.\nThat’s an incentive to keep borrowing in hard currency, said Guy Stear, co-head of fixed income research at Societe Generale.\n“Companies might think ‘I am taking risks here in terms of original sin, but on the other hand I am happy today because my overall funding cost is low’,” Stear said.\nReporting by Sujata Rao; Graphic by Ritvik Carvalho; Editing by Sonya Hepinstall\n ", "external_links": [], "published": "2018-01-21T16:05:00.000+02:00", "crawled": "2018-01-21T16:22:54.000+02:00", "highlightTitle": ""}