{"organizations": [], "uuid": "14ce69c51419b12c58f6f7905f50e11d1b60879d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-meridian-bancorp-inc-reports-net-income-for-the-fourth-quarteraand-year-ended-december-31-2017.html", "country": "US", "domain_rank": 767, "title": "Meridian Bancorp, Inc. Reports Net Income for the Fourth Quarter and Year Ended December 31, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-24T00:10:00.000+02:00", "replies_count": 0, "uuid": "14ce69c51419b12c58f6f7905f50e11d1b60879d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-meridian-bancorp-inc-reports-net-income-for-the-fourth-quarteraand-year-ended-december-31-2017.html", "ord_in_thread": 0, "title": "Meridian Bancorp, Inc. Reports Net Income for the Fourth Quarter and Year Ended December 31, 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "nasd", "sentiment": "negative"}, {"name": "meridian bancorp, inc", "sentiment": "neutral"}, {"name": "meridian bancorp, inc.", "sentiment": "neutral"}, {"name": "meetinghouse bank", "sentiment": "none"}, {"name": "east boston savings bank", "sentiment": "none"}, {"name": "meetinghouse bancorp, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Meridian Bancorp, Inc. (the “Company” or “Meridian”) (NASDAQ:EBSB), the holding company for East Boston Savings Bank (the “Bank”), announced net income of $9.0 million, or $0.17 per diluted share, for the quarter ended December 31, 2017, down from $13.3 million, or $0.25 per diluted share, for the quarter ended September 30, 2017 and $11.3 million, or $0.22 per diluted share, for the quarter ended December 31, 2016. For the year ended December 31, 2017, net income was $42.9 million, or $0.82 per diluted share, up from $34.2 million, or $0.65 per diluted share, for the year ended December 31, 2016. Net income for the quarter and year ended December 31, 2017 reflects a charge of approximately $7.0 million, or $0.13 per diluted share, related to enactment of the Tax Cuts and Jobs Act (the “Tax Act”) on December 22, 2017. Non-recurring merger and acquisition expenses totaling $1.8 million for the quarter and $2.1 million for the year ended December 31, 2017 related to the Company’s acquisition of Meetinghouse Bancorp, Inc. and Meetinghouse Bank (“Meetinghouse”) completed on December 29, 2017 are also reflected in the Company’s results. The Company’s return on average assets was 0.70% for the quarter ended December 31, 2017, down from 1.10% for the quarter ended September 30, 2017 and 1.05% for the quarter ended December 31, 2016. For the year ended December 31, 2017, the Company’s return on average assets was 0.89%, up from 0.87% for the year ended December 31, 2016. The Company’s return on average equity was 5.56% for the quarter ended December 31, 2017, down from 8.40% for the quarter ended September 30, 2017 and 7.51% for the quarter ended December 31, 2016. For the year ended December 31, 2017, the Company’s return on average equity was 6.82%, up from 5.77% for the year ended December 31, 2016.\nRichard J. Gavegnano, Chairman, President and Chief Executive Officer, said, “Meridian earned record net income of $42.9 million for the year 2017, up $8.8 million, or 26%, from the prior record set in 2016, even after the $7.0 million tax charge resulting from the Tax Act and $2.1 million of acquisition expenses. Without these non-recurring expenses, our net income for 2017 would have been $51 million, up 50% from 2016. The strong organic loan and deposit growth that continues to drive our earnings to new records also increased total assets to $5.3 billion during the year. The Meetinghouse acquisition added $120 million in assets, including $76 million in loans, $94 million in deposits and two branches in the Boston neighborhoods of Dorchester and Roslindale that provide us with a platform for expansion of our market share in the surrounding areas.”\nMr. Gavegnano added, “A major element of our enhanced commitments to our employees, infrastructure investment and charitable giving as previously announced is to expand our core banking franchise to areas not being served by a community bank. We are moving forward with plans to open four new branches in Boston’s Cleveland Circle and Brigham Circle neighborhoods and north of Boston in Lynnfield and West Peabody in 2018 as we continue to evaluate additional branch opportunities within our metropolitan Boston footprint.”\nThe Company’s net interest income was $39.3 million for the quarter ended December 31, 2017, up $1.3 million or 3.4%, from the quarter ended September 30, 2017 and $5.9 million, or 17.7%, from the quarter ended December 31, 2016. The interest rate spread and net interest margin on a tax-equivalent basis were 2.97% and 3.20%, respectively, for the quarter ended December 31, 2017 compared to 3.08% and 3.30%, respectively, for the quarter ended September 30, 2017 and 3.09% and 3.31%, respectively, for the quarter ended December 31, 2016. For the year ended December 31, 2017, net interest income increased $23.6 million, or 19.3%, to $146.2 million from the year ended December 31, 2016. The net interest rate spread and net interest margin on a tax-equivalent basis were 3.01% and 3.23%, respectively, for the year ended December 31, 2017 compared to 3.13% and 3.34%, respectively, for the year ended December 31, 2016 The increases in net interest income were primarily due to loan growth, partially offset by increases in the average balances of total deposits and borrowings and the cost of funds for the quarter and year ended December 31, 2017 compared to the respective prior periods.\nTotal interest and dividend income increased to $50.9 million for the quarter ended December 31, 2017, up $2.9 million, or 6.1%, from the quarter ended September 30, 2017 and $9.6 million, or 23.3%, from the quarter ended December 31, 2016, primarily due to growth in the Company’s average loan balances to $4.556 billion and increases in the yield on loans, to 4.39% on a tax-equivalent basis, of eight basis points from the quarter ended September 30, 2017 and five basis points from the quarter ended December 31, 2016. The Company’s yield on interest-earning assets on a tax-equivalent basis was 4.11% for the quarter ended December 31, 2017, down two basis points from the quarter ended September 30, 2017 and up six basis points from the quarter ended December 31, 2016. For the year ended December 31, 2017, the Company’s total interest and dividend income increased $35.4 million, or 23.7%, to $185.1 million from the year ended December 31, 2016 primarily due to growth in the average loan balances of $791.7 million, or 22.6%, to $4.287 billion. The Company’s yield on interest-earning assets on a tax-equivalent basis was 4.06% for the year ended December 31, 2017, up one basis point from the year ended December 31, 2016.\nTotal interest expense increased to $11.5 million for the quarter ended December 31, 2017, up $1.6 million, or 16.4%, from the quarter ended September 30, 2017 and $3.7 million, or 47.4%, from the quarter ended December 31, 2016. Interest expense on deposits increased to $10.1 million for the quarter ended December 31, 2017, up $1.6 million, or 18.4%, from the quarter ended September 30, 2017 and $3.1 million, or 45.1%, from the quarter ended December 31, 2016 primarily due to growth in average total deposits to $3.992 billion and increases in the cost of average total deposits to 1.00% from 0.91% for the quarter ended September 30, 2017, and 0.83% for the quarter ended December 31, 2016. Interest expense on borrowings increased to $1.4 million for the quarter ended December 31, 2017, up $56,000, or 4.0%, from the quarter ended September 30, 2017 and $576,000, or 66.4%, from the quarter ended December 31, 2016 primarily due to growth in average total borrowings to $486.9 million. The Company’s total cost of funds was 1.02% for the quarter ended December 31, 2017, up eight basis points from the quarter ended September 30, 2017 and 17 basis points from the quarter ended December 31, 2016. Total interest expense increased $11.8 million, or 43.4%, to $38.9 million for the year ended December 31, 2017 from the year ended December 31, 2016. Interest expense on deposits increased $9.9 million, or 40.9%, to $34.0 million for the year ended December 31, 2017 from the year ended December 31, 2016 due to the growth in average total deposits of $682.5 million, or 22.4%, to $3.732 billion and an increase in the cost of average total deposits of 12 basis points to 0.91%. Interest expense on borrowings increased $1.9 million, or 63.6%, to $4.9 million for the year ended December 31, 2017 from the year ended December 31, 2016 due to the growth in average total borrowings of $133.6 million, or 48.1%, to $411.2 million and an increase in the cost of average total borrowings of 11 basis points to 1.20%. The Company’s cost of funds increased 12 basis points to 0.94% for the year ended December 31, 2017 compared to the year ended December 31, 2016.\nMr. Gavegnano noted, “Rising net interest income, the key component of our record earnings pace, continues to be driven by strong organic loan growth. Our loan portfolio, excluding acquired with Meetinghouse, rose $648 million, or 17%, on loan originations of $1.8 billion in 2017. Our net interest income rose 19% in 2017 despite a rising short-term interest rate environment that contributed to the 12 basis point increase in our cost of funds to 0.94% and an 11 basis point decline in our net interest margin to 3.23%.”\nThe Company recognized a reversal of $715,000 in its provision for loan losses for the quarter ended December 31, 2017, compared to provisions of $2.5 million for the quarter ended September 30, 2017 and $1.3 million from the quarter ended December 31, 2016. For the year ended December 31, 2017, the provision for loan losses was $4.9 million compared to $7.2 million for the year ended December 31, 2016. The allowance for loan losses was $45.2 million or 0.97% of total loans at December 31, 2017, compared to $45.6 million or 1.00% of total loans at September 30, 2017, and $40.1 million or 1.02% of total loans at December 31, 2016. The changes in the provision and the allowance for loan losses were based on management’s assessment of loan portfolio growth and composition changes, declines in historical charge-off trends, reduced levels of problem loans and other improving asset quality trends, with reductions in the provision for loan losses for the quarter and year ended December 31, 2017 reflecting improvement in these asset quality factors during the year.\nNet recoveries totaled $257,000 for the quarter ended December 31, 2017, or 0.02% of average loans outstanding on an annualized basis compared to net charge-offs of $44,000 for the quarter ended September 30, 2017, and net recoveries of $147,000 for the quarter ended December 31, 2016, or 0.02% of average loans on an annualized basis. For the year ended December 31, 2017, net recoveries totaled $177,000, or 0.00% of average loans outstanding compared to net charge-offs of $436,000, or 0.01% of average loans outstanding, for the year ended December 31, 2016.\nNon-accrual loans were $8.4 million, or 0.18% of total loans outstanding, at December 31, 2017; down $815,000, or 8.9%, from September 30, 2017; and down $5.1 million, or 37.8%, from December 31, 2016. Non-performing assets were $8.4 million, or 0.16% of total assets, at December 31, 2017, compared to $10.9 million, or 0.21% of total assets, at September 30, 2017, and $13.4 million, or 0.30% of total assets, at December 31, 2016.\nMr. Gavegnano commented, “We saw continuing improvement in our asset quality during 2017, as non-performing assets declined to 0.16% of total assets, the lowest level since 2006, with negligible loan charge-off activity. This improvement reflects our ongoing emphasis on maintaining disciplined underwriting, credit monitoring and collection processes.”\nNon-interest income was $8.7 million for the quarter ended December 31, 2017, up from $5.3 million for the quarter ended September 30, 2017 and up from $5.6 million for the quarter ended December 31, 2016. Non-interest income increased $3.5 million, or 65.8%, as compared to the quarter ended September 30, 2017, primarily due to a $5.2 million increase in gain on sales of securities, net, partially offset by a $1.7 million gain on a life insurance distribution related to a banked-owned life insurance claim recognized during the third quarter of 2017. As compared to the quarter ended December 31, 2016, non-interest income increased $3.1 million, or 55.1%, primarily due to a $3.4 million increase in gain on sales of securities, net. For the year ended December 31, 2017, non-interest income increased $8.9 million, or 62.5%, to $23.1 million from $14.2 million for the year ended December 31, 2016, primarily due to a $6.3 million increase in gain on sale of securities, net, the $1.7 million gain on a life insurance distribution, and a $1.1 million increase in loan fees. The increases in loan fees are primarily due to $1.3 million of loan swap fee income recognized in the second quarter of 2017.\nNon-interest expenses were $23.9 million, or 1.85% of average assets for the quarter ended December 31, 2017, compared to $20.8 million, or 1.71% of average assets for the quarter ended September 30, 2017 and $19.8 million, or 1.84% of average assets for the quarter ended December 31, 2016. Non-interest expenses increased $4.1 million, or 20.7%, compared to the quarter ended December 31, 2016, due primarily to increases of $1.8 million in merger and acquisition expenses, $1.6 million in salaries and employee benefits, $343,000 in deposit insurance premiums, $260,000 in other general and administrative expenses, and $200,000 in data processing. For the year ended December 31, 2017, non-interest expenses increased $10.5 million, or 13.5%, to $88.0 million from $77.5 million for the year ended December 31, 2016, due to increases of $4.3 million in salaries and employee benefits, $2.1 million in merger and acquisition expenses, $951,000 in deposit insurance premiums, $777,000 in data processing expenses, $724,000 in occupancy and equipment expenses, $704,000 in professional services, $491,000 in other general and administrative expenses, and $436,000 in marketing and advertising expenses. The increases in salaries and employee benefits expenses reflect annual increases in employee compensation and health benefits during the first quarter of 2017 and a 20% bonus enhancement to the Bank’s Incentive Compensation Plan for 2017. In addition, the increases in salaries and employee benefits, and occupancy and equipment expenses include costs associated with the expansion of our branch and regulatory compliance staff. Professional services increased primarily due to additional costs related to regulatory compliance projects. The Company’s efficiency ratio, which excludes non-recurring merger and acquisition expenses, was 52.61% for the quarter ended December 31, 2017 compared to 48.40% for the quarter ended September 30, 2017 and 54.33% for the quarter ended December 31, 2016. For the year ended December 31, 2017, the efficiency ratio was 53.71% compared to 57.95% for the year ended December 31, 2016.\nMr. Gavegnano said, “Our efficiency ratio improved to 53.71% in 2017 from 57.95% in 2016, primarily due to the 19% rise in net interest income. Non-interest expenses, without the non-recurring Meetinghouse acquisition expenses of $2.1 million in 2017 that were excluded from the determination of our efficiency ratio, increased 11%. The significant expenses related to the Meetinghouse acquisition and our regulatory compliance infrastructure enhancements are now behind us. As we move forward with prudent staffing and capital commitments related to our planned branch expansion, we believe these investments will ultimately contribute to further improvement in our financial performance.”\nThe Company recorded a provision for income taxes of $15.9 million for the quarter ended December 31, 2017, reflecting an effective tax rate of 63.7%, compared to $6.7 million, or an effective tax rate of 33.5%, for the quarter ended September 30, 2017, and $6.6 million, or an effective tax rate of 37.0%, for the quarter ended December 31, 2016. For the year ended December 31, 2017, the provision for income taxes was $33.5 million, reflecting an effective tax rate of 43.8%, compared to $17.9 million, or an effective tax rate of 34.3%, for the year ended December 31, 2016. The changes in the income tax provision and effective tax rate were primarily due to the $7.0 million charge related to enactment of the Tax Act that required the Company to revalue its net deferred tax asset. This charge may be subject to adjustment in future periods.\nTotal assets were $5.299 billion at December 31, 2017, up $213.0 million, or 4.2%, from $5.086 billion at September 30, 2017 and $863.5 million, or 19.5%, from $4.436 billion at December 31, 2016. The growth in assets includes $120.4 million of assets acquired in the Meetinghouse acquisition. Net loans were $4.623 billion at December 31, 2017, up $120.9 million, or 2.7%, from September 30, 2017, and $724.1 million, or 18.6%, from December 31, 2016, including $73.6 million of loans acquired in the Meetinghouse acquisition. Loan originations totaled $452.9 million during the quarter ended December 31, 2017 and $1.763 billion during the year ended December 31, 2017. The net increase in loans for the year ended December 31, 2017 was primarily due to increases of $287.2 million in commercial real estate loans, $216.7 million in multi-family loans, $138.5 million in construction loans, $71.2 million in one- to four-family loans and $10.2 million in commercial and industrial loans. Cash and due from banks was $402.7 million at December 31, 2017, an increase of $166.3 million, or 70.3% from December 31, 2016. Securities available for sale were $38.4 million at December 31, 2017, a decrease of $29.3 million, or 43.3%, from $67.7 million at December 31, 2016.\nTotal deposits were $4.108 billion at December 31, 2017, an increase of $162.4 million, or 4.1%, from $3.945 billion at September 30, 2017 and an increase of $632.0 million, or 18.2%, from $3.476 billion at December 31, 2016. Contributing to the growth was $93.8 million of deposits acquired in the Meetinghouse acquisition. Core deposits, which exclude certificate of deposits, increased $389.6 million, or 16.6%, during the year ended December 31, 2017 to $2.737 billion, or 66.6% of total deposits. Total borrowings were $513.4 million, up $42.4 million, or 9.0%, from September 30, 2017 and up $190.9 million, or 59.2%, from December 31, 2016.\nTotal stockholders’ equity increased $6.0 million, or 0.9%, to $646.4 million at December 31, 2017 from $640.4 million at September 30, 2017, and $39.1 million, or 6.4%, from $607.3 million at December 31, 2016. The increase for the year ended December 31, 2017 was primarily due to net income of $42.9 million, and $6.5 million related to stock-based compensation plans partially offset by $1.7 million in accumulated other comprehensive losses, reflecting a decrease in the fair value of available-for-sale securities, partially offset by dividends of $0.17 per share totaling $8.7 million. Stockholders’ equity to assets was 12.20% at December 31, 2017, compared to 12.59% at September 30, 2017 and 13.69% at December 31, 2016. Book value per share increased to $11.96 at December 31, 2017 from $11.33 at December 31, 2016. Tangible book value per share increased to $11.54 at December 31, 2017 from $11.08 at December 31, 2016. Market price per share increased $1.70, or 9.0%, to $20.60 at December 31, 2017 from $18.90 at December 31, 2016. At December 31, 2017, the Company and the Bank continued to exceed all regulatory capital requirements.\nAs of December 31, 2017, the Company had repurchased 2,059,611 shares of its stock at an average price of $13.71 per share, or 75.2% of the 2,737,334 shares authorized for repurchase under the Company’s repurchase program adopted in August 2015. The Company did not repurchase any of its shares during the year ended December 31, 2017.\nMeridian Bancorp, Inc. is the holding company for East Boston Savings Bank. East Boston Savings Bank, a Massachusetts-chartered stock savings bank founded in 1848, operates 33 full-service locations and one mobile location in the greater Boston metropolitan area. We offer a variety of deposit and loan products to individuals and businesses located in our primary market, which consists of Essex, Middlesex, Norfolk and Suffolk Counties, Massachusetts. For additional information, visit www.ebsb.com .\nForward Looking Statements\nCertain statements herein constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements may be identified by words such as “believes,” “will,” “expects,” “project,” “may,” “could,” “developments,” “strategic,” “launching,” “opportunities,” “anticipates,” “estimates,” “intends,” “plans,” “targets” and similar expressions. These statements are based upon the current beliefs and expectations of Meridian Bancorp, Inc.’s management and are subject to significant risks and uncertainties. Actual results may differ materially from those set forth in the forward-looking statements as a result of numerous factors. Factors that could cause such differences to exist include, but are not limited to, general economic conditions, changes in interest rates, regulatory considerations, and competition and the risk factors described in the Company’s Annual Report on Form 10-K and Quarterly Reports on Form 10-Q as filed with the Securities and Exchange Commission. Should one or more of these risks materialize or should underlying beliefs or assumptions prove incorrect, Meridian Bancorp, Inc.’s actual results could differ materially from those discussed. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this release.\nMERIDIAN BANCORP, INC. AND SUBSIDIARIES CONSOLIDATED BALANCE SHEETS (Unaudited) December 31, 2017 September 30, 2017 December 31, 2016 (Dollars in thousands) ASSETS Cash and due from banks $ 402,687 $ 300,297 $ 236,423 Certificates of deposit 69,326 75,192 80,323 Securities available for sale, at fair value 38,364 44,661 67,663 Federal Home Loan Bank stock, at cost 24,947 22,976 18,175 Loans held for sale 3,772 3,707 3,944 Loans: One- to four-family 603,680 560,393 532,450 Home equity lines of credit 48,393 42,042 42,913 Multi-family 779,637 702,631 562,948 Commercial real estate 2,063,781 2,070,761 1,776,601 Construction 641,306 604,487 502,753 Commercial and industrial 525,604 561,769 515,430 Consumer 10,761 10,222 9,712 Total loans 4,673,162 4,552,305 3,942,807 Allowance for loan losses (45,185 ) (45,643 ) (40,149 ) Net deferred loan origination fees (5,179 ) (4,794 ) (3,990 ) Loans, net 4,622,798 4,501,868 3,898,668 Bank-owned life insurance 40,336 40,052 40,745 Foreclosed real estate, net — 1,690 — Premises and equipment, net 40,967 40,077 41,427 Accrued interest receivable 12,902 11,580 10,381 Deferred tax asset, net 15,244 21,487 21,461 Goodwill 19,638 13,687 13,687 Other intangible assets 3,243 — — Other assets 5,231 9,140 3,105 Total assets $ 5,299,455 $ 5,086,414 $ 4,436,002 LIABILITIES AND STOCKHOLDERS' EQUITY Deposits: Non interest-bearing demand deposits $ 477,428 $ 455,540 $ 431,222 Interest-bearing demand deposits 1,004,155 896,561 630,413 Money market deposits 921,895 975,246 980,344 Regular savings and other deposits 333,774 324,895 305,632 Certificates of deposit 1,370,609 1,293,227 1,128,226 Total deposits 4,107,861 3,945,469 3,475,837 Long-term debt 513,444 471,069 322,512 Accrued expenses and other liabilities 31,751 29,472 30,356 Total liabilities 4,653,056 4,446,010 3,828,705 Stockholders' equity: Preferred stock, $0.01 par value, 50,000,000 shares authorized; none issued — — — Common stock, $0.01 par value, 100,000,000 shares authorized; 54,039,316, 53,947,394 and 53,596,105 shares issued at December 31, 2017, September 30, 2017 and December 31, 2016, respectively 540 539 536 Additional paid-in capital 395,716 393,903 390,065 Retained earnings 268,533 262,079 234,290 Accumulated other comprehensive income 128 2,622 1,806 Unearned compensation - ESOP, 2,557,036, 2,587,477 and 2,678,800 at December 31, 2017, September 30, 2017 and December 31, 2016, respectively (18,518 ) (18,739 ) (19,400 ) Total stockholders' equity 646,399 640,404 607,297 Total liabilities and stockholders' equity $ 5,299,455 $ 5,086,414 $ 4,436,002\nMERIDIAN BANCORP, INC. AND SUBSIDIARIES CONSOLIDATED STATEMENTS OF NET INCOME (Unaudited) Three Months Ended Years Ended December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 (Dollars in thousands, except per share amounts) Interest and dividend income: Interest and fees on loans $ 49,144 $ 46,597 $ 40,172 $ 179,425 $ 145,541 Interest on debt securities: Taxable 42 58 159 302 866 Tax-exempt 14 — 19 32 114 Dividends on equity securities 223 275 346 1,066 1,529 Interest on certificates of deposit 185 221 115 814 495 Other interest and dividend income 1,265 819 438 3,465 1,147 Total interest and dividend income 50,873 47,970 41,249 185,104 149,692 Interest expense: Interest on deposits 10,100 8,528 6,962 33,982 24,124 Interest on short-term borrowings — — — 4 6 Interest on long-term debt 1,444 1,388 868 4,926 3,007 Total interest expense 11,544 9,916 7,830 38,912 27,137 Net interest income 39,329 38,054 33,419 146,192 122,555 Provision for loan losses (715 ) 2,458 1,304 4,859 7,180 Net interest income, after provision for loan losses 40,044 35,596 32,115 141,333 115,375 Non-interest income: Customer service fees 2,170 2,081 2,233 8,517 8,491 Loan fees 88 180 335 1,970 918 Mortgage banking gains, net 109 176 125 457 573 Gain on sales of securities, net 6,058 865 2,627 9,305 3,020 Income from bank-owned life insurance 284 294 294 1,158 1,188 Gain on life insurance distribution — 1,657 — 1,657 — Total non-interest income 8,709 5,253 5,614 23,064 14,190 Non-interest expenses: Salaries and employee benefits 13,761 12,973 12,167 53,161 48,828 Occupancy and equipment 2,798 2,676 2,881 11,533 10,809 Data processing 1,531 1,528 1,331 5,912 5,135 Marketing and advertising 1,131 715 973 3,653 3,217 Professional services 804 624 969 3,669 2,965 Deposit insurance 824 660 481 2,988 2,037 Merger and acquisition 1,784 271 — 2,055 — Other general and administrative 1,236 1,367 976 4,994 4,503 Total non-interest expenses 23,869 20,814 19,778 87,965 77,494 Income before income taxes 24,884 20,035 17,951 76,432 52,071 Provision for income taxes 15,863 6,702 6,642 33,487 17,881 Net income $ 9,021 $ 13,333 $ 11,309 $ 42,945 $ 34,190 Earnings per share: Basic $ 0.18 $ 0.26 $ 0.22 $ 0.84 $ 0.67 Diluted $ 0.17 $ 0.25 $ 0.22 $ 0.82 $ 0.65 Weighted average shares: Basic 51,425,793 51,229,203 50,940,037 51,153,665 51,128,914 Diluted 53,026,141 52,672,962 52,102,511 52,663,597 52,248,308\nMERIDIAN BANCORP, INC. AND SUBSIDIARIES NET INTEREST INCOME ANALYSIS (Unaudited) Three Months Ended December 31, 2017 September 30, 2017 December 31, 2016 Average\nBalance Interest (1) Yield/\nCost (1)(6) Average\nBalance Interest (1) Yield\nCost (1)(6) Average\nBalance Interest (1) Yield/\nCost (1)(6) (Dollars in thousands) Assets: Interest-earning assets: Loans (2) $ 4,555,544 $ 50,361 4.39 % $ 4,402,966 $ 47,855 4.31 % $ 3,792,961 $ 41,394 4.34 % Securities and certificates of deposit 110,900 554 1.98 132,972 658 1.96 147,509 778 2.10 Other interest-earning assets (3) 375,712 1,265 1.34 208,193 819 1.56 244,241 438 0.71 Total interest-earning assets 5,042,156 52,180 4.11 4,744,131 49,332 4.13 4,184,711 42,610 4.05 Noninterest-earning assets 115,174 115,491 113,336 Total assets $ 5,157,330 $ 4,859,622 $ 4,298,047 Liabilities and stockholders' equity: Interest-bearing liabilities: Interest-bearing deposits $ 965,096 $ 2,624 1.08 $ 819,965 1,874 0.91 $ 577,419 $ 1,025 0.71 Money market deposits 920,676 2,176 0.94 966,340 2,240 0.92 907,157 1,955 0.86 Regular savings and other deposits 321,436 113 0.14 323,621 113 0.14 301,832 108 0.14 Certificates of deposit 1,322,382 5,187 1.56 1,169,264 4,301 1.46 1,139,816 3,874 1.35 Total interest-bearing deposits 3,529,590 10,100 1.14 3,279,190 8,528 1.03 2,926,224 6,962 0.95 Borrowings 486,882 1,444 1.18 468,642 1,388 1.18 325,421 868 1.06 Total interest-bearing liabilities 4,016,472 11,544 1.14 3,747,832 9,916 1.05 3,251,645 7,830 0.96 Noninterest-bearing demand deposits 462,684 450,890 416,727 Other noninterest-bearing liabilities 29,596 26,228 26,977 Total liabilities 4,508,752 4,224,950 3,695,349 Total stockholders' equity 648,578 634,672 602,698 Total liabilities and stockholders' equity $ 5,157,330 $ 4,859,622 $ 4,298,047 Net interest-earning assets $ 1,025,684 $ 996,299 $ 933,066 Fully tax-equivalent net interest income 40,636 39,416 34,780 Less: tax-equivalent adjustments (1,307 ) (1,362 ) (1,361 ) Net interest income $ 39,329 $ 38,054 $ 33,419 Interest rate spread (1)(4) 2.97 % 3.08 % 3.09 % Net interest margin (1)(5) 3.20 % 3.30 % 3.31 % Average interest-earning assets to average interest-bearing liabilities 125.54 % 126.58 % 128.70 % Supplemental Information: Total deposits, including noninterest-bearing demand deposits $ 3,992,274 $ 10,100 1.00 % $ 3,730,080 $ 8,528 0.91 % $ 3,342,951 $ 6,962 0.83 % Total deposits and borrowings, including noninterest-bearing demand deposits $ 4,479,156 $ 11,544 1.02 % $ 4,198,722 $ 9,916 0.94 % $ 3,668,372 $ 7,830 0.85 % (1) Income on debt securities, equity securities and revenue bonds included in commercial real estate loans, as well as resulting yields, interest rate spread and net interest margin, are presented on a tax-equivalent basis. The tax-equivalent adjustments are deducted from tax-equivalent net interest income to agree to amounts reported in the consolidated statements of net income. For the three months ended December 31, 2017, September 30, 2017 and December 31, 2016, yields on loans before tax-equivalent adjustments were 4.28%, 4.20% and 4.21%, respectively, yields on securities and certificates of deposit before tax-equivalent adjustments were 1.66%, 1.65% and 1.72%, respectively, and yield on total interest-earning assets before tax-equivalent adjustments were 4.00%, 4.01% and 3.92%, respectively. Interest rate spread before tax-equivalent adjustments for the three months ended December 31, 2017, September 30, 2017 and December 31, 2016 was 2.86%, 2.96% and 2.96%, respectively, while net interest margin before tax-equivalent adjustments for the three months ended December 31, 2017, September 30, 2017 and December 31, 2016 was 3.09%, 3.18% and 3.18%, respectively.\n(2) Loans on non-accrual status are included in average balances.\n(3) Includes Federal Home Loan Bank stock and associated dividends.\n(4) Interest rate spread represents the difference between the tax-equivalent yield on interest-earning assets and the cost of interest-bearing liabilities.\n(5) Net interest margin represents net interest income (tax-equivalent basis) divided by average interest-earning assets.\n(6) Annualized.\nMERIDIAN BANCORP, INC. AND SUBSIDIARIES NET INTEREST INCOME ANALYSIS (Unaudited) Years Ended December 31, 2017 December 31, 2016 Average\nBalance Interest (1) Yield/\nCost (1) Average\nBalance Interest (1) Yield/\nCost (1) (Dollars in thousands) Assets: Interest-earning assets: Loans (2) $ 4,286,830 $ 184,337 4.30 % $ 3,495,088 $ 150,182 4.30 % Securities and certificates of deposit 132,872 2,630 1.98 183,828 3,629 1.97 Other interest-earning assets (3) 266,945 3,465 1.30 146,786 1,147 0.78 Total interest-earning assets 4,686,647 190,432 4.06 3,825,702 154,958 4.05 Noninterest-earning assets 113,254 116,985 Total assets $ 4,799,901 $ 3,942,687 Liabilities and stockholders' equity: Interest-bearing liabilities: Interest-bearing demand deposits $ 799,377 $ 7,315 0.92 $ 469,103 $ 2,988 0.64 Money market deposits 971,692 8,865 0.91 857,952 7,025 0.82 Regular savings and other deposits 317,717 448 0.14 296,951 424 0.14 Certificates of deposit 1,193,803 17,354 1.45 1,042,425 13,687 1.31 Total interest-bearing deposits 3,282,589 33,982 1.04 2,666,431 24,124 0.90 Borrowings 411,200 4,930 1.20 277,586 3,013 1.09 Total interest-bearing liabilities 3,693,789 38,912 1.05 2,944,017 27,137 0.92 Non interest-bearing demand deposits 448,952 382,644 Other noninterest-bearing liabilities 27,221 23,879 Total liabilities 4,169,962 3,350,540 Total stockholders' equity 629,939 592,147 Total liabilities and stockholders' equity $ 4,799,901 $ 3,942,687 Net interest-earning assets $ 992,858 $ 881,685 Fully tax-equivalent net interest income 151,520 127,821 Less: tax-equivalent adjustments (5,328 ) (5,266 ) Net interest income $ 146,192 $ 122,555 Interest rate spread (1)(4) 3.01 % 3.13 % Net interest margin (1)(5) 3.23 % 3.34 % Average interest-earning assets to average interest-bearing liabilities 126.88 % 129.95 % Supplemental Information: Total deposits, including noninterest-bearing demand deposits $ 3,731,541 $ 33,982 0.91 % $ 3,049,075 $ 24,124 0.79 % Total deposits and borrowings, including noninterest-bearing demand deposits $ 4,142,741 $ 38,912 0.94 % $ 3,326,661 $ 27,137 0.82 % (1) Income on debt securities, equity securities and revenue bonds included in commercial real estate loans, as well as resulting yields, interest rate spread and net interest margin, are presented on a tax-equivalent basis. The tax-equivalent adjustments are deducted from tax-equivalent net interest income to agree to amounts reported in the consolidated statements of net income. For the years ended December 31, 2017, and 2016, yields on loans before tax-equivalent adjustments were 4.19% and 4.16%, respectively, yields on securities and certificates of deposit before tax-equivalent adjustments were 1.67% and 1.63%, respectively, and yield on total interest-earning assets before tax-equivalent adjustments were 3.95% and 3.91%, respectively. Interest rate spread before tax-equivalent adjustments for the years ended ended December 31, 2017, and 2016 was 2.90% and 2.99%, respectively, while net interest margin before tax-equivalent adjustments for the years ended December 31, 2017, and 2016 was 3.12% and 3.20%, respectively.\n(2) Loans on non-accrual status are included in average balances.\n(3) Includes Federal Home Loan Bank stock and associated dividends.\n(4) Interest rate spread represents the difference between the tax-equivalent yield on interest-earning assets and the cost of interest-bearing liabilities.\n(5) Net interest margin represents net interest income (tax-equivalent basis) divided by average interest-earning assets.\nMERIDIAN BANCORP, INC. AND SUBSIDIARIES SELECTED FINANCIAL HIGHLIGHTS (Unaudited) Three Months Ended Years Ended December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 Key Performance Ratios Return on average assets (1) 0.70 % 1.10 % 1.05 % 0.89 % 0.87 % Return on average equity (1) 5.56 8.40 7.51 6.82 5.77 Interest rate spread (1) (2) 2.97 3.08 3.09 3.01 3.13 Net interest margin (1) (3) 3.20 3.30 3.31 3.23 3.34 Non-interest expense to average assets (1) 1.85 1.71 1.84 1.83 1.97 Efficiency ratio (4) 52.61 48.40 54.33 53.71 57.95\nDecember 31,\n2017 September 30,\n2017 December 31,\n2016 (Dollars in thousands) Asset Quality Non-accrual loans: One- to four-family $ 6,890 $ 7,055 $ 8,487 Home equity lines of credit 562 563 674 Commercial real estate 388 862 2,807 Construction - 173 815 Commercial and industrial 523 525 653 Total non-accrual loans 8,363 9,178 13,436 Foreclosed assets — 1,690 — Total non-performing assets $ 8,363 $ 10,868 $ 13,436 Allowance for loan losses/total loans 0.97 % 1.00 % 1.02 % Allowance for loan losses/non-accrual loans 540.30 497.31 298.82 Non-accrual loans/total loans 0.18 0.20 0.34 Non-accrual loans/total assets 0.16 0.18 0.30 Non-performing assets/total assets 0.16 0.21 0.30 Capital and Share Related Stockholders' equity to total assets 12.20 % 12.59 % 13.69 % Book value per share $ 11.96 $ 11.87 $ 11.33 Tangible book value per share (5) $ 11.54 $ 11.62 $ 11.08 Market value per share $ 20.60 $ 18.65 $ 18.90 Shares outstanding 54,039,316 53,947,394 53,596,105 (1) Annualized.\n(2) Interest rate spread represents the difference between the tax-equivalent yield on interest-earning assets and the cost of interest-bearing liabilities.\n(3) Net interest margin represents net interest income (tax-equivalent basis) divided by average interest-earning assets.\n(4) The efficiency ratio is a non-GAAP measure representing non-interest expense, excluding merger and acquisition expenses, divided by the sum of net interest income and non-interest income excluding gains or losses on sales of securities. The efficiency ratio is a common measure used by banks to understand expenses related to the generation of revenue. We have removed gains or losses on sales of securities as management deems them to be discretionary and not representative of operating performance. We have removed merger and acquisition expenses as management deems them to be not representative of operating performance. Presented on a basis including merger and acquisition expenses and gains or losses on sales of securities, the efficiency ratio was 46.69%, 48.06% and 50.67% for the quarters ended December 31, 2017, September 30, 2017 and December 31, 2016, respectively, and 51.97% and 56.67% for the years ended December 31, 2017 and 2016, respectively.\n(5) Tangible book value per share represents total stockholders’ equity less goodwill and other intangible assets divided by the number of shares outstanding.\nContact: Richard J. Gavegnano, Chairman, President and Chief Executive Officer\n(978) 977-2211\nSource:Meridian Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/91929bb1-1c62-4a0a-9141-4390c3294336"], "published": "2018-01-24T00:10:00.000+02:00", "crawled": "2018-01-24T00:39:10.005+02:00", "highlightTitle": ""}