{"organizations": [], "uuid": "6c7053c31b6db82975ea4135254cb3198837b533", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104962817-GettyImages-822521682.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19794221/device/rss", "section_title": "Europe News", "url": "https://www.cnbc.com/2018/01/24/european-markets-set-for-mixed-open-on-us-trade-war-concerns.html", "country": "US", "domain_rank": 767, "title": "European markets set for mixed open on US trade war concerns", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T08:14:00.000+02:00", "replies_count": 0, "uuid": "6c7053c31b6db82975ea4135254cb3198837b533"}, "author": "Justina Crabtree", "url": "https://www.cnbc.com/2018/01/24/european-markets-set-for-mixed-open-on-us-trade-war-concerns.html", "ord_in_thread": 0, "title": "European markets set for mixed open on US trade war concerns", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.k.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "ahold delhaize", "sentiment": "none"}, {"name": "world trade organization", "sentiment": "none"}, {"name": "novartis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "European stocks closed lower Wednesday, as investors digested fresh corporate news, while keeping an eye on political developments.\nSymbol Name Price   Change %Change Volume FTSE --- DAX --- CAC --- IBEX 35 --- The pan-European STOXX 600 closed 0.5 percent lower provisionally, with most sectors and major bourses in negative territory.\nUtilities were one of the worst performing sectors, with France's Suez sinking over 16 percent to the bottom of the STOXX 600. The utilities group tanked after it lowered its 2017 goals, stating that it expected earnings before interest and tax (EBIT) to drop 2 percent, to 1.28 billion euros ($1.58 billion) in 2017.\nU.K. retailer WH Smith came off its lows, but remained in the red after it announced that total sales for the 20-week period up until January 20 2018, including Christmas, had been flat year-on-year.\nSage saw group organic revenue rise 6.3 percent during the first three months of the year, however, shares fell more than 6 percent in trade. Investec said that the first-quarter results were \"slightly disappointing,\" according to Reuters.\nNot all reported earnings were seen as negative however. Swiss drugmaker Novartis was a top performer, rising 2.7 percent after the company announced that full-year sales had risen 2 percent, with the CEO describing 2017 as a \"landmark year for innovation.\"\nMeanwhile, shares of the London Stock Exchange Group jumped close to the top of the pan-European benchmark after Sky News reported that TCI, an activist hedge fund with a 5 percent stake in the exchange, expects a $15 billion takeover bid for the company from either CME Group or Intercontinental Exchange (ICE). The LSE's stock moved almost 5 percent higher.\nOn Wall Street, stocks opened higher on the back of stronger-than-expected quarterly results.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nLooking to data, the number of people employed in the U.K. rose by 102,000 during the months of September to November 2017, according to data by the Office for National Statistics, bringing those in employment to a record 32.2 million. Following the release, sterling rallied against the U.S. dollar, while the U.K.'s FTSE 100 fell deep into the red.\nIn Europe, the world's business and political elite continue their conclave at the mountain resort of Davos, Switzerland, for the World Economic Forum's Annual Conference . During his keynote speech, French president Emmanuel Macron said globalization is going through a major crisis. Trump and a delegation of White House officials are scheduled to depart Washington for the meeting on Wednesday.", "external_links": [], "published": "2018-01-24T08:14:00.000+02:00", "crawled": "2018-01-24T09:23:40.016+02:00", "highlightTitle": ""}