{"organizations": [], "uuid": "561d76365123275e7f8377695d7f8426c4ab29a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/18/reuters-america-update-2-oil-stable-on-threats-of-rebel-attacks-in-nigeria-falling-u-s-crude-stocks.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-Oil stable on threats of rebel attacks in Nigeria, falling U.S. crude stocks", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T10:06:00.000+02:00", "replies_count": 0, "uuid": "561d76365123275e7f8377695d7f8426c4ab29a4"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/reuters-america-update-2-oil-stable-on-threats-of-rebel-attacks-in-nigeria-falling-u-s-crude-stocks.html", "ord_in_thread": 0, "title": "UPDATE 2-Oil stable on threats of rebel attacks in Nigeria, falling U.S. crude stocks", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "niger delta avengers", "sentiment": "negative"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "crude stocks@\n* Nigeria's Niger Delta Avengers threaten oil sector attacks\n* U.S. crude stocks down by 5.1 mln at 411.5 mln -API\n* But gasoline, distillate stocks rise on ample fuel supplies (Re-leads, adds comment, updates prices)\nSINGAPORE, Jan 18 (Reuters) - Oil prices were stable on Thursday, supported by tighter inventories of crude as well as rebel threats of an attack on Nigeria's petroleum industry, but the market was weighed down by a reported rise in U.S. fuel stocks.\nBrent crude futures were at $69.34 at 0753 GMT, down 4 cents from their last close. On Monday, they hit their highest since December 2014 at $70.37 a barrel.\nU.S. West Texas Intermediate (WTI) crude futures were at $64.03 a barrel, up 6 cents from their last settlement. WTI marked it highest since December 2014 at $64.89 on Tuesday.\nTraders said that oil markets were generally well supported by supply cuts led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia, who started to withhold production in January last year and are expected to continue their restraint through 2018.\nDespite this, analysts said the recent oil price rally, which has lifted crude by around 14 percent since early December, may be about to run out of steam.\nData from the American Petroleum Institute (API) on Wednesday showed a well supplied fuel product market, which could mean lower crude demand going forward.\nU.S. refinery crude runs fell by 420,000 barrels per day (bpd) and refined product stocks rose, implying a well supplied market.\nGasoline stocks rose by 1.8 million barrels while distillate fuels stockpiles, which include diesel and heating oil, climbed by 609,000 barrels, the API data showed.\nRefined product supplies in Asia are also healthy, largely thanks to a sharp rise in exports from China.\n\"The upside is now limited for oil prices ... U.S. oil producers will ramp up production in the coming months ... U.S. shale oil output will increase by a good 111,000 barrels per day (bpd) next month to 10 million bpd, and ... will rise to about 11 million bpd by the end of next year. This would put the U.S. on par with Saudi Arabia and Russia's output,\" said Fawad Razaqzada, market analyst at future brokerage Forex.com .\nCoface, a French trade credit insurance company, said it \"forecasts oil prices will consolidate some gains to average $65 (per barrel) in 2018.\"\nThe firm said the reasons for this expected slowdown were an expected rise in U.S. oil output as well as a slowdown in demand growth.\nDespite this, traders said prices were unlikely to fall far due to risks to supply disruptions.\nIn Nigeria, the militant group Niger Delta Avengers threatened to launch attacks on the country's oil sector in the next few days.\nMarkets were also supported by a drop in available crude inventories.\nU.S. crude inventories fell by 5.1 million barrels in the week ended Jan. 12 to 411.5 million, according to the API.\nOfficial U.S. oil inventory and production data is due on Thursday from the Energy Information Administration (EIA).\n(Reporting by Henning Gloystein; Editing by Richard Pullin and Christian Schmollinger)", "external_links": [], "published": "2018-01-18T10:06:00.000+02:00", "crawled": "2018-01-19T09:12:42.003+02:00", "highlightTitle": ""}