{"organizations": [], "uuid": "a390106fdffe38ef522b0a79004d2b9d200e3e3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223085997&w=1200&r=LYNXMPEE0H1HY", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-turkey-security-lobby/turkey-business-lobby-calls-for-end-to-emergency-rule-idUKKBN1F72GC", "country": "US", "domain_rank": 408, "title": "Turkey business lobby calls for end to emergency rule", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:15:00.000+02:00", "replies_count": 0, "uuid": "a390106fdffe38ef522b0a79004d2b9d200e3e3d"}, "author": "", "url": "https://uk.reuters.com/article/uk-turkey-security-lobby/turkey-business-lobby-calls-for-end-to-emergency-rule-idUKKBN1F72GC", "ord_in_thread": 0, "title": "Turkey business lobby calls for end to emergency rule", "locations": [], "entities": {"persons": [{"name": "erdogan", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}], "organizations": [{"name": "freedom house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ece toksabay", "sentiment": "none"}, {"name": "ak party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 5:19 PM / Updated 18 minutes ago Turkey business lobby calls for end to emergency rule Ece Toksabay 3 Min Read \nANKARA (Reuters) - Turkey’s main business lobby on Thursday called on the government to end the state of emergency as parliament extended it for a sixth time since it was imposed after an attempted coup in 2016. \nEmergency rule allows President Tayyip Erdogan and the government to bypass parliament in passing new laws and allows them to suspend rights and freedoms. More than 50,000 people have been arrested since its introduction and 150,000 have been sacked or suspended from their jobs. \nThe Turkish parliament on Thursday voted to extend the state of emergency, with the ruling AK Party and the nationalist opposition voting in favour. \nRights groups and some of Turkey’s Western allies fear Erdogan is using the crackdown to stifle dissent and crush his opponents. Freedom House, a Washington-based watchdog, downgraded Turkey to “not free” from “partly free” in an annual report this week. \nIn order to preserve its international reputation, Turkey needs to start normalising rapidly, Erol Bilecik, the head of the TUSIAD business lobby said. \n“The first step in that regard is bringing an end to the state of emergency,” he told a meeting in Istanbul. \nParliament was due to extend emergency rule after the national security council on Wednesday recommended it do so. \nThe state of emergency has negatively impacted foreign investors’ decisions, another senior TUSIAD executive said. \n“As Turkey takes steps towards becoming a state of law, direct investments will increase, growth will accelerate, more jobs will be created,” Tuncay Ozilhan said, adding that he hoped this would be the last extension of emergency rule. \nThe government says its measures are necessary to confront multiple security challenges and root out supporters of the cleric Fethullah Gulen, whom it blames for the coup attempt. Gulen has denied any involvement. \nBut critics fear Erdogan is pushing the NATO member towards greater authoritarianism. \nSome 30 emergency decrees have been published since the failed coup. They contain 1,194 articles and cover defence, security, the judiciary, education and health, widely restructuring the relationship between the state and the citizen. \nA total of 2,271 private educational institutions have been shut down in the crackdown, as well as 19 labour unions, 15 universities, 49 hospitals and 148 media outlets. \nThe two co-heads of Turkey’s pro-Kurdish opposition party, parliament’s third-largest, are in jail on terrorism charges, as are several of the parties deputies. \nThe Turkish Journalists’ Association says about 160 journalists are in jail, most held since the failed coup. Last year, the Committee to Protect Journalists called Turkey the world’s top jailer of journalists. Additional reporting by Ebru Tuncay and Ali Kucukgocmen in Istanbul; Writing by David Dolan; Editing by Robin Pomeroy", "external_links": [], "published": "2018-01-18T19:15:00.000+02:00", "crawled": "2018-01-18T19:44:57.027+02:00", "highlightTitle": ""}