{"organizations": [], "uuid": "8eafa3c696c8d23123f7729ccc7492aa7b478537", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-foamix-names-mr-david-domzalski-as-a-member-of-the-board-of-foamix-pharmaceuticals.html", "country": "US", "domain_rank": 767, "title": "Foamix Names Mr. David Domzalski as a Member of the Board of Foamix Pharmaceuticals", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "8eafa3c696c8d23123f7729ccc7492aa7b478537"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-foamix-names-mr-david-domzalski-as-a-member-of-the-board-of-foamix-pharmaceuticals.html", "ord_in_thread": 0, "title": "Foamix Names Mr. David Domzalski as a Member of the Board of Foamix Pharmaceuticals", "locations": [], "entities": {"persons": [{"name": "david domzalski", "sentiment": "negative"}, {"name": "foamix", "sentiment": "none"}, {"name": "domzalski", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "bridgewater", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "foamix pharmaceuticals ltd", "sentiment": "negative"}, {"name": "board of foamix pharmaceuticals rehovot", "sentiment": "negative"}, {"name": "foamix pharmaceuticals inc.", "sentiment": "none"}, {"name": "foamix", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "REHOVOT, Israel and BRIDGEWATER, N.J., Jan. 03, 2018 (GLOBE NEWSWIRE) -- Foamix Pharmaceuticals Ltd. (NASDAQ:FOMX) (“Foamix”), a clinical stage specialty pharmaceutical company focused on developing and commercializing proprietary topical foams to address unmet needs in dermatology, today announced the appointment of Mr. David Domzalski, Foamix’s Chief Executive Officer (CEO), as a member of its board of directors.\nMr. Domzalski has 25 years of experience in the pharmaceutical industry. He joined Foamix in 2014 as President of Foamix Pharmaceuticals Inc., the company’s U.S. subsidiary, and was appointed as the company’s CEO in July of 2017. Since joining Foamix, he has been instrumental in leading the growth and evolution of the company, including the company’s successful IPO and subsequent follow-on offerings, the formation and build-out of the company’s U.S. operations and the advancement of two late-stage clinical development programs – FMX101 for moderate-to-severe acne and FMX103 for moderate-to-severe papulopustular rosacea – both of which are currently in Phase 3 clinical trials.\nMr. Domzalski replaces Dr. Dov Tamarkin, the former CEO and a co-founder of Foamix, who is retiring from the Board after having completed the orderly transition of his managerial duties over the past 6 months.\nAbout Foamix Pharmaceuticals\nFoamix is a specialty pharmaceutical company focused on the development and commercialization of proprietary, innovative and differentiated topical drugs for dermatological therapy.\nThe company’s clinical stage product candidates include FMX101, a novel minocycline foam for the treatment of moderate-to-severe acne, FMX102 for the treatment of impetigo, FMX103 for the treatment of rosacea, and FDX104, a doxycycline foam for the management of acne-like rash induced by EGFRI anticancer drugs.\nIn addition, Foamix has development and license agreements relating to its technology with various pharmaceutical companies including Bayer HealthCare and others.\nFor more information, please visit www.foamixpharma.com .\nForward Looking Statements\nThis press release may include forward-looking statements within the meaning of Section 27A of the U.S. Securities Act of 1933, as amended, Section 21E of the U.S. Securities Exchange Act of 1934, as amended, and the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements are statements that are not historical facts, such as statements regarding assumptions, expectations, forecasts, beliefs or intentions related to financial results, commercial results, timing and results of clinical trials and U.S. FDA and other regulatory agencies authorizations. Forward-looking statements are based on our current knowledge and our present beliefs and expectations regarding possible future events and are subject to risks, uncertainties and assumptions. Actual results and the timing of events could differ materially from those anticipated in these forward-looking statements as a result of various factors including, but not limited to, unexpected delays, excess costs or unfavorable results of clinical trials, delays or denial in the U.S. FDA approval process, additional competition in the acne market, denial of reimbursement by third party payors or inability to raise additional capital. We discuss many of these risks in greater detail under the heading “Risk Factors” in our most recent Annual Report on Form 20-F (File No. 17625089) filed on February 21, 2017, and elsewhere in that Annual Report. Any forward-looking statements that may be made herein speak only as of the date of this release and Foamix undertakes no obligation to update publicly such forward-looking statements to reflect subsequent events or circumstances, except as otherwise required by law.\nContact :\nIlan Hadar\nFoamix Pharmaceuticals Ltd.\n+972-8-9316233\nIR@foamixpharma.com\nU.S. Investor Relations\nMichael Rice\nLifeSci Advisors, LLC\n646-597-6979\nmrice@lifesciadvisors.com\nSource:Foamix, Ltd.", "external_links": ["https://www.globenewswire.com/Tracker?data=JFrk4-QeKFQ-mA8yAqLk1nB7ObhPjqnh3smg9cOWZxBUUI74EB8nMp2f4omIAwzn9LrqRWL71sMut_opiXsRAUijBsDFy63xQorHIJ9L8Js=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/20c35e1f-05f5-4c24-80ca-6d639d3aaa24", "https://www.globenewswire.com/Tracker?data=P_MRQPWucL1rT-I_DbYWZDj8TnemDgmUEAuP-WpMeWsegC_SvLzSwPYDJO30WnrcZAueylRDV-jEZS63KpQSWPypVDs3ZMTgT4cYNNOioFM=", "https://www.globenewswire.com/Tracker?data=eR8SLY5QKAbWyhJNJJKMpCvqcsCfUJu1BnMs4DOJk0OPj2-ob8TP8k96vqT6HPQlXWmBV_hwI5y2MnplS3sh9BlCN4kSco8ysSoJjmHmze0="], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T18:40:56.013+02:00", "highlightTitle": ""}