{"organizations": [], "uuid": "47fe935506c4ac013e2bdfda84a1e0a40e9b6326", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 454}, "facebook": {"likes": 399, "shares": 399, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GC735_wynn01_ZG_20180130170037.jpg", "site_section": "http://feeds.marketwatch.com/marketwatch/topstories?format=xml", "section_title": "MarketWatch.com - Top Stories", "url": "https://www.wsj.com/articles/republican-national-committee-won-t-immediately-return-wynn-donations-1517340277", "country": "US", "domain_rank": 387, "title": "The Wall Street Journal: RNC won't return Steve Wynn’s donations without ‘due process’", "performance_score": 3, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:04:00.000+02:00", "replies_count": 0, "uuid": "47fe935506c4ac013e2bdfda84a1e0a40e9b6326"}, "author": "", "url": "https://www.wsj.com/articles/republican-national-committee-won-t-immediately-return-wynn-donations-1517340277", "ord_in_thread": 0, "title": "The Wall Street Journal: RNC won't return Steve Wynn’s donations without ‘due process’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "32 COMMENTS The chairwoman of the Republican National Committee said Tuesday that the party wouldn’t return donations from Steve Wynn, its former finance chairman who faces allegations of sexual misconduct dating back decades, unless an investigation by his company’s outside directors finds wrongdoing.\nIn an interview with Fox News, Ronna Romney McDaniel called the allegations against Mr. Wynn, published by The Wall Street Journal last week, “deeply troubling” and noted that Mr. Wynn had stepped down from his post as finance chairman on Saturday. But the RNC has no current plans to refund Mr. Wynn’s donations, she said.\n“Steve has denied these allegations,” she said. “There is an investigation that will take place. He should be allowed due process. If he is found of any wrongdoing we’ll return 100% of that money. But we’ll let due process take place.”\nMs. McDaniel said the RNC was “moving forward” and Chicago Cubs co-owner Todd Ricketts has been offered the lead fundraising position for the RNC, according to a person close to Mr. Ricketts. Mr. Ricketts would need to be confirmed in a vote Wednesday by the RNC. Two people close to the RNC confirmed Mr. Ricketts is the only person in the mix for the national finance chairmanship.\nMr. Ricketts, son of TD Ameritrade founder Joe Ricketts, has been in Mr. Trump’s orbit since shortly after the election. In the closing weeks of the presidential race, he helped raise at least $66 million for outside groups called Future 45 and 45Committee, Federal Election Commission reports show.\nMr. Wynn has donated nearly $400,000 to the RNC since 2003. Ms. McDaniel said the committee will suspend it decision on returning it and “let the investigation take place.”\nAn RNC spokesman said Ms. McDaniel was referring to the current investigation by the board of Wynn Resorts. The Wynn Resorts board late Friday said its independent directors would form a special committee to investigate the allegations against Mr. Wynn.\nThe Journal on Friday reported that shortly after Mr. Wynn opened his flagship Wynn Las Vegas in 2005, a manicurist who worked there told a colleague Mr. Wynn forced her to have sex. The casino billionaire later paid the manicurist a $7.5 million settlement.\nBeyond that incident, dozens of people the Journal interviewed who have worked at Mr. Wynn’s casinos described a pattern of sexual misconduct.\nNewsletter Sign-up Mr. Wynn said it was “preposterous” that he would assault a woman. He didn’t provide further response to other allegations of sexual misconduct that the Journal inquired about before publishing Friday’s article. He said the accusations were the work of his ex-wife, Elaine Wynn, as part of litigation between them. An attorney for Ms. Wynn denied that.\nThe RNC’s response to the allegations against Mr. Wynn is a departure from that of many members of the party. Lawmakers including House Speaker Paul Ryan (R., Wis.) and committees including the Republican Governors Association in recent days have refunded the Wynn donations or transferred them to charities.\nFollowing allegations of sexual assault against longtime Democratic donor Harvey Weinstein last year, the RNC repeatedly pressured Democratic groups and candidates to return money from the donor, releasing a video calling for them to “put your money where your mouth is.”\n“If the DNC truly stands up for women like they say they do, then returning Weinstein’s dirty money should be a no-brainer,” Ms. McDaniel tweeted in October.\nThe Democratic National Committee ultimately opted to donate more than $30,000 to various causes , including Emily’s List, a political-action committee funding Democratic women candidates who support abortion rights. The donations represented a fraction of the nearly $500,000 Mr. Weinstein had given to Democratic Party organizations, and the committee drew criticism for transferring the funds to liberal political groups rather than to nonprofits.\nIn the Fox interview, Ms. McDaniel drew a contrast between the responses to allegations of sexual misconduct by Messrs. Wynn and Weinstein, as well as by Sen. Al Franken, a Democratic senator who stepped down following a spate of accusations against him.\n“Steve has denied these allegations, unlike Harvey Weinstein and Al Franken and others,” Ms. McDaniel said.\nMr. Franken was accused of groping or forcibly kissing women; Messrs. Weinstein and Wynn have both been accused of forcing women to have sex.\nMr. Franken has said he remembered some of the alleged transgressions differently and denied other allegations outright. Mr. Weinstein has apologized for his past behavior with colleagues but denied allegations of nonconsensual sex.\nAsked about the $7.5 million settlement Mr. Wynn paid to the manicurist who accused him of forcing her to have sex, the RNC spokesman pointed to Mr. Wynn’s denial of the accusations against him.\n—Julie Bykowicz contributed to this article.\nWrite to Rebecca Ballhaus at Rebecca.Ballhaus@wsj.com", "external_links": [], "published": "2018-01-31T00:04:00.000+02:00", "crawled": "2018-01-31T00:08:19.014+02:00", "highlightTitle": ""}