{"organizations": [], "uuid": "c972b08e3b281bf6336f832c309047a9e2b9bed8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-tiger-rentals-completes-acquisition-of-production-management-industries-pmi-a-leading-provider-of-cleaning-and-environmental.html", "country": "US", "domain_rank": 767, "title": "Tiger Rentals Completes Acquisition of Production Management Industries (PMI), a Leading Provider of Cleaning and Environmental Services to Oilfield Companies in the Gulf of Mexico and Texas", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-02T21:02:00.000+02:00", "replies_count": 0, "uuid": "c972b08e3b281bf6336f832c309047a9e2b9bed8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-tiger-rentals-completes-acquisition-of-production-management-industries-pmi-a-leading-provider-of-cleaning-and-environmental.html", "ord_in_thread": 0, "title": "Tiger Rentals Completes Acquisition of Production Management Industries (PMI), a Leading Provider of Cleaning and Environmental Services to Oilfield Companies in the Gulf of Mexico and Texas", "locations": [], "entities": {"persons": [], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "gulf of mexico", "sentiment": "none"}, {"name": "texas beaumont", "sentiment": "none"}], "organizations": [{"name": "tiger rentals completes acquisition of production management industries", "sentiment": "neutral"}, {"name": "environmental services to oilfield companies", "sentiment": "neutral"}, {"name": "production management industries", "sentiment": "none"}, {"name": "environmental services", "sentiment": "none"}, {"name": "superior energy services", "sentiment": "none"}, {"name": "production maintenance cleaning services", "sentiment": "none"}, {"name": "pmi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEAUMONT, Texas--(BUSINESS WIRE)-- Tiger Rentals Group, LLC (together with its affiliated companies, “ Tiger Rentals ”), a leading global oilfield and industrial equipment rental and services company, has completed the acquisition of the equity of Production Management Industries (“PMI”) from Superior Energy Services. Terms of the transaction were not disclosed. The acquisition will expand Tiger’s value-added service offerings to its existing offshore and onshore oilfield customers.\nFor over 20 years, PMI has been a leading provider of cleaning and environmental services to oilfield companies in the Gulf of Mexico and Texas. PMI maintains the highest safety and environmental standards in the industry. Services provided include:\nProduction Maintenance Cleaning Services: Comprehensive range tank and vessel cleaning services for tanks and vessels used in offshore production. Drilling Cleaning Services: Automated cleaning services for mud tanks, rigs, and dry bulk tanks used in drilling and completions. Environmental Services: Remediation and site restoration activities for oilfield sites.\n“Tiger Rentals is pleased to add PMI’s exceptional cleaning and environmental services to our portfolio of customer offerings,” said Colby Crenshaw, President of Tiger Rentals. “Now our customers can not only rent equipment from Tiger Rentals, but they can rely on us for a broader selection of value-added products and services globally.”\nPMI features the Mud Hog automated cleaning system for boats, rigs, and portable tanks in support of its customers’ offshore drilling activities. The Mud Hog system is one of the most efficient automated cleaning systems in the Gulf of Mexico and is utilized by many major oil companies. PMI will soon introduce the Mud Hog Generation 3 modular system that can be efficiently mobilized anywhere in the world. Crenshaw added, “We are particularly excited about bringing PMI’s proprietary automated cleaning technology to Tiger’s international customers.”\n“The PMI team is pleased to be joining Tiger Rentals’ world class equipment rental and service organization. PMI’s cleaning and environmental services are an ideal fit with Tiger’s existing customer base and geographic footprint,” said Don Mehrtens, General Manager of PMI. “Our customers should expect no changes in the services they are receiving currently.”\nAbout Tiger Rental Group\nTiger Rentals is a leading international provider of offshore oilfield equipment rental services (Tiger Offshore Rentals), onshore equipment rental services to the E&P, midstream, petrochemical, and industrial sectors (Tiger Industrial), energy-related safety equipment rental and services (Tiger Safety), and cleaning and environmental services (Tiger PMI). For more information, visit www.TigerRentals.com .\nTiger Offshore provides specialty transport tanks and logistics equipment rental to the offshore oil and gas market. Our equipment is used to safely transport, store and process drilling fluids, liquids, waste, tools, refrigerated goods, dry goods, and more. Our fleet includes cargo carrying units, baskets, boxes, containers, tanks and vessels. We also offer slings & rigging, mixing units, mud tank packages, flooring, rotating equipment, and waste services. Tiger provides a full array of equipment and services solutions to customers in North America, South America, Africa, the Mediterranean, and the Middle East. For more information, visit www.TigerOffshoreRentals.com .\nTiger Industrial is a leading provider of rental equipment and services to the upstream, midstream, and downstream energy, chemical, and processing sectors. We have multiple locations in the US that offer a full range of high-quality equipment for pumping, cleaning, shelter, flooring, and power generation. Our fleet includes blast resistant buildings, heavy duty pumps, portable generators, pressure washers, lighting, and ECOmat TM flooring solutions. For more information, visit www.TigerIndustrialRentals.com .\nTiger Safety offers the domestic and international oil and gas industry a full array of safety equipment and services. Our company is backed by years of safety industry knowledge and experience. Equipment and services offered include H2S safety, confined space and rescue, well testing equipment, cameras and communication, personal protective equipment, lighting equipment, safety trailers, and rotating equipment. For more information, visit www.TigerSafetyRentals.com .\nTiger PMI provides cleaning and environmental services to the onshore and offshore oil and gas market. PMI is one of the safest, most reliable, and most time efficient solutions for its customers’ vessel and rig cleaning needs. In addition, PMI offers remediation and restoration activities for onshore drilling and completions sites. For more information, visit www.pmi.net .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005616/en/\nTiger Rentals\nColby Crenshaw, 409-832-9336\nPresident\ncolby.crenshaw@modernusa.com\nSource: Tiger Rentals Group, LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.TigerOffshoreRentals.com&esheet=51736616&newsitemid=20180102005616&lan=en-US&anchor=www.TigerOffshoreRentals.com&index=2&md5=93b36f4b47a24f1df27696a7a4c197b7", "http://www.businesswire.com/news/home/20180102005616/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftigerindustrialrentals.com%2FLocations.html&esheet=51736616&newsitemid=20180102005616&lan=en-US&anchor=locations&index=3&md5=f1ee1c6750b5da3df96ea338201315ce", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pmi.net&esheet=51736616&newsitemid=20180102005616&lan=en-US&anchor=www.pmi.net&index=6&md5=3b00971379e39b7e49b0f767cc2ca96b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.TigerSafetyRentals.com&esheet=51736616&newsitemid=20180102005616&lan=en-US&anchor=www.TigerSafetyRentals.com&index=5&md5=b734b4b6e4309510ec2700eb6735f1b9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.TigerRentals.com&esheet=51736616&newsitemid=20180102005616&lan=en-US&anchor=www.TigerRentals.com&index=1&md5=eac8c53c380f4be59246b61440eba57a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.TigerIndustrialRentals.com&esheet=51736616&newsitemid=20180102005616&lan=en-US&anchor=www.TigerIndustrialRentals.com&index=4&md5=3c504f61b24198aa8e31666ebb0ef697"], "published": "2018-01-02T21:02:00.000+02:00", "crawled": "2018-01-02T23:41:08.008+02:00", "highlightTitle": ""}