{"organizations": [], "uuid": "c90a3870897335dca8c4494c3c1f1e121a001b8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/environment/", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-safrica-drought-capetown/without-rain-south-africas-cape-town-may-run-out-of-water-by-april-idUSKBN1F51DC", "country": "US", "domain_rank": 408, "title": "Without rain, South Africa's Cape Town may run out of water by April", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:14:00.000+02:00", "replies_count": 0, "uuid": "c90a3870897335dca8c4494c3c1f1e121a001b8a"}, "author": "", "url": "https://www.reuters.com/article/us-safrica-drought-capetown/without-rain-south-africas-cape-town-may-run-out-of-water-by-april-idUSKBN1F51DC", "ord_in_thread": 0, "title": "Without rain, South Africa's Cape Town may run out of water by April", "locations": [], "entities": {"persons": [{"name": "xanthea limberg", "sentiment": "none"}, {"name": "wendell roelf", "sentiment": "none"}], "locations": [{"name": "cape town", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "world travel and tourism council", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAPE TOWN (Reuters) - South Africa’s Cape Town, one of the world’s iconic tourist destinations, could run out of water by April as the city’s worst drought in a century risks forcing residents to join queues for emergency rations.\n“Day Zero” - the date taps are due to run dry - has crept forward to April 22 as city authorities race to build desalination plants and drill underground boreholes.\nAlmost 2 million tourists flock to Cape Town every year to bathe on sandy white beaches, explore natural features like Table Mountain or to sip wine in dozens of nearby vineyards.\nTravel and tourism accounted for an estimated 9 percent or 412 billion rand ($33 billion) of South Africa’s economic output last year, according to the World Travel and Tourism Council.\n“At the current rate the city is likely to reach Day Zero on 22 April,” said councilor Xanthea Limberg, Cape Town’s mayoral committee member for water.\n“There is a real risk that residents will have to line up.”\nAt a trial water collection site, similar to an estimated 200 the city may introduce, people line up between metal fences waiting to fill up containers from standpipes.\nA maximum 25 litres of water will be provided per person, per day, officials said.\nLimberg said the dire situation was being worsened by some people ignoring a push for residents and visitors to use no more than 87 litres of water per person per day.\nSigns warn residents of water restrictions in Cape Town, South Africa October 17, 2017. REUTERS/Mike Hutchings Cape Town is home to many wealthy residents who have swimming pools and sprinkler systems, although the city does not want to play a “blame game” as lots of affluent residents are saving water, she said.\nBusinesses in the hospitality industry also say they are trying to help, limiting showers to two minutes and using water used for washing dishes and clothes to water gardens.\nAuthorities want to reduce the city’s consumption to 500 million litres a day - half the amount used two years ago.\n“Everyone is taking as many steps and measures that they possibly can to try and make sure we don’t reach Day Zero,” said Gabrielle Bolton, spokeswoman for the five-star Belmond Mount Nelson hotel.\nIn a possible sign of things to come, security guards have been monitoring a steady flow of cars and people lining up at AB-Inbev’s Newlands brewery to get up to 25 litres of free water from a mountain stream on its property.\nThe popular Newlands public swimming pool across the road from the brewery has been closed due to water restrictions with still two months of the South African summer left to run.\nCity officials say dam levels dipped below 30 percent in the first week of the new year, with only about 19.7 percent of that water considered usable. Residents will have to line up for water when dams reach 13.5 percent.\n“I am concerned we will run out of water and it is difficult,” said Susan Jones, a grandmother who regularly visits the Newlands spring taps.\n“We are making do. We have to.”\n($1 = 12.3427 rand)\nReporting by Wendell Roelf; Editing by Joe Brock\n ", "external_links": [], "published": "2018-01-16T14:14:00.000+02:00", "crawled": "2018-01-16T14:29:22.002+02:00", "highlightTitle": ""}