{"organizations": [], "uuid": "9dc2fccd63195fb1ca25ce893ace64144802ffef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/brainstorm-health-daily-01-24-18/", "country": "US", "domain_rank": 1196, "title": "Brainstorm Health: Apple Health Records, Safe Injection Sites, Novartis Earnings | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-24T02:00:00.000+02:00", "replies_count": 0, "uuid": "9dc2fccd63195fb1ca25ce893ace64144802ffef"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/24/brainstorm-health-daily-01-24-18/", "ord_in_thread": 0, "title": "Brainstorm Health: Apple Health Records, Safe Injection Sites, Novartis Earnings | Fortune", "locations": [], "entities": {"persons": [{"name": "sy", "sentiment": "neutral"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "novartis", "sentiment": "negative"}, {"name": "safe injection sites", "sentiment": "negative"}, {"name": "apple health records", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 \nHello, readers! This is Sy. \nAmerica’s opioid epidemic is so brutal and pervasive that it’s literally contributing to lower life expectancy across the nation and hitting the U.S. workforce participation rate . Prescription painkiller and opioid overdoses are now killing more than 30,000 Americans per year. The federal government has begun taking some steps to stem the tide, including by making it easier for non-doctors to prescribe opioid addiction treatment . But the city of Philadelphia is taking things a step further, with officials across the local government announcing Tuesday that they would whole-heartedly endorse a program of “safe injection sites”—i.e., locations where drug users can use their product of choice while in the company of medical professionals who could save them from an overdose. \nThis is, undoubtedly, a controversial proposition. These safe injection sites wouldn’t be run by the city, but rather outsourced to private organizations who step up. Critics say it would amount to a sanctioning of illegal drug use; some public health advocates reply that, in a time of medical crisis, it’s better to prioritize people’s health and safety, even if it means (in some ways) giving dangerous and illegal drug use a pass. \nWhile officials like Pennsylvania’s new state attorney general have said they wouldn’t target individuals who use or operate such sites (if they’re eventually set up), there would be significant tensions between the city, state, and federal government on the program—especially given Attorney General Jeff Sessions’ hardline position on recreational drug use. One DEA spokesperson has already said that the “proposed government-sanctioned sites would encourage and normalize heroin use, thereby increasing demand for opiates.” \nThe injection sites would by no means be the only avenue for fighting opioid addiction, Philadelphia officials say. A comprehensive strategy encouraging non-opioid treatments and medication-assisted addiction therapy must also be part of the strategy. But the heart wrenching question for the city is: Is it better to keep going with a zero-tolerance policy, or to make sure that those who are addicted to opioids stay alive long enough to recover? \nRead on for the day’s news. Sy Mukherjee @the_sy_guy DIGITAL HEALTH \nApple wants to put your medical records into its Health app. Apple is making yet another big move into the health care space—and this time, it involves electronic medical records, those essential bits of health data which (for some reason) still require many Americans to use a fax machine to ascertain. (I speak from personal experience.) And Apple’s line up an impressive roster of major medical facilities for the upcoming feature. “The updated Health Records section within the Health app brings together hospitals, clinics and the existing Health app to make it easy for consumers to see their available medical data from multiple providers whenever they choose,” wrote the company in a press release. “Johns Hopkins Medicine, Cedars-Sinai, Penn Medicine and other participating hospitals and clinics are among the first to make this beta feature available to their patients.” More on this later. ( Apple ) INDICATIONS \nNovartis reports stronger than expected turnaround under new incoming CEO. Swiss pharma giant Novartis’ incoming CEO, Vas Narasimhan, outlined an ambitious and rosy-eyed prospect for the company in the coming years during an earnings calls Wednesday. Narasimhan predicted 12 “major” product launches in the next two years while reporting a better-than-expected $12.9 billion in net revenues in the fourth quarter of 2017. Two treatments Novartis expects to grow dramatically? Entresto, a heart failure drug, and Cosentyx, used to treat psoriasis. ( Financial Times ) THE BIG PICTURE \nAetna faces civil fine over HIV status leak. Health insurer Aetna has been fined by New York (a relatively minor $1.15 million civil penalty) over its recent HIV status debacle. Aetna sent out envelopes to some 2,460 HIV-positive New York residents that revealed their HIV statuses through large transparent windows on the front side of the mailers; the company says it will work to revamp its privacy practices in addition to paying the fine. ( Reuters ) REQUIRED READING ", "external_links": [], "published": "2018-01-24T02:00:00.000+02:00", "crawled": "2018-01-25T12:57:56.007+02:00", "highlightTitle": ""}