{"organizations": [], "uuid": "493b988de3b281aec750c330550c0801b6273b7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/05/104147029-GC-Image2.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/how-grant-cardone-plans-to-go-from-millionaire-to-billionaire.html", "country": "US", "domain_rank": 767, "title": "How Grant Cardone plans to go from millionaire to billionaire", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-23T15:00:00.000+02:00", "replies_count": 0, "uuid": "493b988de3b281aec750c330550c0801b6273b7d"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/22/how-grant-cardone-plans-to-go-from-millionaire-to-billionaire.html", "ord_in_thread": 0, "title": "How Grant Cardone plans to go from millionaire to billionaire", "locations": [], "entities": {"persons": [{"name": "grant cardone", "sentiment": "negative"}, {"name": "cardone", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Before Grant Cardone built his multi-million dollar fortune, he was stuck in a sales job he hated, earning $3,000 a month. He set the goal of upping his income, he tells CNBC Make It : \"I was making $3,000 a month and I wanted to make $4,000. That $1,000 was the single most important goal I've ever achieved in my life.\"\nIn fact, he remembers that first income jump better than he remembers the first million he made . It was significant because \"it showed me that I was in control of and had the ability to accomplish my goals,\" says Cardone.\nHe started thinking bigger, and that mindset shift eventually led to his seven-figure status.\nToday, Cardone is gunning to become a billionaire , and he already has the tools and mindset in place to get there.\nCourtesy of Grant Cardone Self-made millionaire Grant Cardone The size of the goal \"really doesn't matter,\" he says. Rather, what's important is knowing that you can set a target and then hit it. \nWhile a big part of the transition from millionaire to billionaire is mental, there are also tangible steps he's going to take, and steps that anyone can take to achieve major financial goals , he says. Regardless of how much you want to earn — $10,000, $1 million or $1 billion — you start by setting a specific goal and crunching the numbers.\n\"Number one: You do the math,\" says Cardone. If you can figure out a way to get 5,000 people to buy a $200 product, you'd have $1 million, he points out. Or, if 5,000 people paid you $17 a month for 12 months, that would also get you to $1 million.\nNext, find out who has the money, spend time with them and figure out what service, product or idea you can offer them. There's no shortage of money in the world, Cardone says. The key is to get in front of those who have it — investors or potential buyers — and provide them with value .\nNow that Cardone has his specific goal — $1 billion — to get there, he says, \"I just need to do the math, find out who's got it [the money], find out what they want and deliver that product or service.\"\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: The underused strategy this self-made millionaire uses to get ahead \n\nVideo by Andrea Kramar \nshow chapters Self-made millionaire: You should work through the holidays      10:55 AM ET Thu, 9 March 2017 | 01:05", "external_links": [], "published": "2018-01-23T15:00:00.000+02:00", "crawled": "2018-01-23T15:10:32.000+02:00", "highlightTitle": ""}