{"organizations": [], "uuid": "a3136ca7c73cee23d9f2f4c85e3e178ede3a629e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/10/gettyimages-509007636.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/facebooks-new-feed-and-the-news/", "country": "US", "domain_rank": 1196, "title": "Facebook Changes News Feed to Exclude Journalism | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.374, "site_type": "news", "published": "2018-01-16T11:16:00.000+02:00", "replies_count": 0, "uuid": "a3136ca7c73cee23d9f2f4c85e3e178ede3a629e"}, "author": "Adam Lashinsky", "url": "http://fortune.com/2018/01/16/facebooks-new-feed-and-the-news/", "ord_in_thread": 0, "title": "Facebook Changes News Feed to Exclude Journalism | Fortune", "locations": [], "entities": {"persons": [{"name": "adam lashinsky", "sentiment": "negative"}], "locations": [{"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "facebook changes news feed", "sentiment": "negative"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Adam Lashinsky 9:16 AM EST \nThis article first appeared in Data Sheet, Fortune’s daily newsletter on the top tech news. Sign up here . \nFacebook (fb) was one of the pioneers of the Silicon Valley concept of “growth hacking.” Early in its existence it recognized that while all businesses focused on metrics, many focused on the wrong ones, most often ignoring the metrics that lead to a company’s growth. As an example, focusing on sales might seem like the right thing to do. For Facebook, focusing on “likes” or time spent on its sites by users and so on would lead to sales (and profits) and therefore were a better metric than simply trying to sell more ads. \nThe news industry has been famously clueless about the right metrics for its business. It focused on eyeballs or page views and then unique visitors, not even being able to agree on accurate measurements for the last of these. As part of this hunt for users, one of the metrics publishers chased was the number of times text stories and videos were viewed on Facebook. Never mind that Facebook took the vast majority of revenue from these views and also controlled relationships with advertisers. Foolish publishers poured precious resources into promoting their product on Facebook, where the money was never very good (except for Facebook) and grew progressively worse. \nThat game is up. Facebook is pushing a new metric now: “meaningful social interactions.” What exactly that means will be up to Facebook, as usual, to define. What it won’t be is professionally promoted material, whether from publishers or others. Facebook is probably glad to be rid of the responsibility of pretending to care about publishers, a needy and complaining lot whose mission didn’t truly overlap with Facebook’s. (Audrey Cooper, editor in chief of The San Francisco Chronicle , neatly summarizes the news industry’s frustration here .) \nJournalists want to inform, tell stories, and even entertain. Facebook wants to connect people who know each other. These just aren’t the same activities, and while there’s some overlap they never will be. \n*** \nSome of my holiday weekend reading: \n* James Stewart, one of America’s finest business journalists and longform storytellers, reminds us of his vast range in this sorrowful, spare, and ultimately inspiring yarn in The New Yorker about Eric Sun, a Facebook engineer and violinist who died far too young. \n* Though I enjoyed my brief stay at the too-big, too-chaotic, too-yucky CES show in Las Vegas last week, I enjoyed Farhad Manjoo’s none-too-subtle takedown-cum-review of the event he didn’t attend: “CES Is Back, and It’s … Meh.” \n* If you’re as fascinated by modern China as I am, read this weird, scattered, fascinating, barely coherent account of the improbable Chinese billionaire Guo Wengui in this weekend’s New York Times Magazine . \n* Lastly, I heartily recommend this fine example of magazine making, the Times magazine’s gorgeously produced photo-essay about a very old technology: pencils. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-16T11:16:00.000+02:00", "crawled": "2018-01-16T22:16:30.039+02:00", "highlightTitle": ""}