{"organizations": [], "uuid": "2c75cbcb515dca4fbd9ff042d3026c1b51cca9d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/06/103998489-GettyImages-611658510.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/23/brazil-believes-its-growth-rate-will-be-double-the-imfs-forecast.html", "country": "US", "domain_rank": 767, "title": "Brazil believes its growth rate will be double the IMF’s forecast", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:55:00.000+02:00", "replies_count": 0, "uuid": "2c75cbcb515dca4fbd9ff042d3026c1b51cca9d7"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/23/brazil-believes-its-growth-rate-will-be-double-the-imfs-forecast.html", "ord_in_thread": 0, "title": "Brazil believes its growth rate will be double the IMF’s forecast", "locations": [], "entities": {"persons": [{"name": "henrique meirelles", "sentiment": "none"}, {"name": "meirelles", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "imf", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brazil expects to see upwards of 3 percent gross domestic product (GDP) growth in 2018, Brazilian Finance Minister Henrique Meirelles told CNBC Tuesday, a figure that flies in the face of the International Monetary Fund's (IMF) forecast of 1.5 percent.\nSpeaking at the World Economic Forum in Davos , the head policymaker for Latin America's largest economy explained why he thought the IMF's forecast was wrong.\n\"The numbers have been revised every day, or every week, or every month by the IMF in general,\" the finance minister said. \"The market has moved steadily up, around 2.85 today. In our case we have been leading the market last year, we have this forecast that is going to happen, which is about 1.1 percent for 2017, and we think this year it's going be around 3 percent or higher.\"\nMeirelles cited future pension reform, GDP growth and the country's upcoming elections as cause for optimism. Brazilians will head to the polls in October 2018, with many hoping to bring an end to years of corruption-plagued administrations.\nMeirelles took the position in 2016 amid the global commodities downturn and during the impeachment of former president Dilma Rousseff, previously serving as central bank governor from 2003 to 2011.\nCris Faga | LatinContent | Getty Images Members of the Roofless Movement protest againts economic reforms proposed by President Michel Temer at Paulista Avenue in Sao Paulo on June 30, 2017. Brazil's GDP did show signs of recovery in the fourth quarter of 2017 for the first time after suffering the longest recession in its history, though further confidence in the country remains sensitive to political developments, according to the Organization of Economic Cooperation and Development (OECD).\nMeirelles would not confirm whether he will make a presidential bid for October, though he told CNBC he is thinking about it, and will make his decision in \"late March or early April.\"\n\"If the decision in October proves to be the right one and the country embarks on a higher growth rate next year which I think is possible, I think the story could be a reasonable one, or even a very good one,\" he said.\nBrazil's government has pledged a raft of reforms, but regional watchers warn that continued reform is not guaranteed, particularly given the country's upcoming presidential election in October 2018 which will pit unpopular incumbent Michel Temer against the scandal-ridden former president Lula da Silva. Investors are already warning of volatility .\nDogged by political corruption scandals and high-profile arrests, the country of 208 million continues to miss out on stronger growth thanks to a combination of red tape, protectionist measures, low export levels, high import tariffs and inadequate infrastructure.\nCredit Suisse in 2017 named Brazil the most closed emerging market economy, and Standard & Poor's recently downgraded Brazil's credit rating, citing slow political progress.\nshow chapters What is Davos? 15 Hours Ago | 03:12", "external_links": [], "published": "2018-01-23T17:55:00.000+02:00", "crawled": "2018-01-23T17:26:21.000+02:00", "highlightTitle": ""}