{"organizations": [], "uuid": "cfc96b5811ba8eef179da61b5ee68eb4ce2ee945", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-microstrategy-announces-fourth-quarter-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "MicroStrategy Announces Fourth Quarter 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:05:00.000+02:00", "replies_count": 0, "uuid": "cfc96b5811ba8eef179da61b5ee68eb4ce2ee945"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-microstrategy-announces-fourth-quarter-2017-financial-results.html", "ord_in_thread": 0, "title": "MicroStrategy Announces Fourth Quarter 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "va.", "sentiment": "none"}], "organizations": [{"name": "microstrategy", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TYSONS CORNER, Va.--(BUSINESS WIRE)-- MicroStrategy ® Incorporated (Nasdaq: MSTR), a leading worldwide provider of enterprise analytics and mobility software, today announced financial results for the three-month period ended December 31, 2017 (the fourth quarter of its 2017 fiscal year).\nFourth quarter 2017 revenues were $138.1 million versus $140.1 million for the fourth quarter of 2016, a 1.4% decrease. Product licenses and subscription services revenues for the fourth quarter of 2017 were $40.8 million versus $45.8 million for the fourth quarter of 2016, a 10.9% decrease. Product support revenues for the fourth quarter of 2017 were $75.0 million versus $72.7 million for the fourth quarter of 2016, a 3.2% increase. Other services revenues for the fourth quarter of 2017 were $22.3 million versus $21.6 million for the fourth quarter of 2016, a 3.1% increase. Foreign currency effects had a favorable impact on revenues for the fourth quarter of 2017.\nOperating expenses for the fourth quarter of 2017 were $94.6 million versus $80.1 million for the fourth quarter of 2016, an 18.2% increase. MicroStrategy did not capitalize any software development costs during the fourth quarter of 2017 or 2016.\nIncome from operations for the fourth quarter of 2017 was $18.8 million versus $36.7 million for the fourth quarter of 2016. Net loss for the fourth quarter of 2017 was $26.2 million, or $(2.29) per share on a diluted basis, as compared to net income of $31.1 million, or $2.69 per share on a diluted basis, for the fourth quarter of 2016. This net loss included an estimated one-time tax charge of $44.0 million resulting from the recent enactment of U.S. corporate tax reform legislation. This charge is comprised of a $40.3 million tax expense related to the mandatory deemed repatriation of certain foreign earnings and profits, which we intend to elect to pay over an eight-year period beginning in 2018, and $3.7 million related to the re-measurement of net deferred tax assets arising from the new lower corporate tax rate effected by the legislation. Excluding the impact of this legislation, non-GAAP net income for the fourth quarter of 2017 was $17.8 million, or $1.55 per share on a diluted basis.\nAdditionally, non-GAAP income from operations, which excludes share-based compensation expense and restructuring costs, was $22.5 million for the fourth quarter of 2017 versus $40.1 million for the fourth quarter of 2016. The tables at the end of this press release include a reconciliation of GAAP to non-GAAP financial measures for the three months ended December 31, 2017 and 2016. An explanation of non-GAAP financial measures is also included under the heading “Non-GAAP Financial Measures” below.\nAs of December 31, 2017, MicroStrategy had cash and cash equivalents and short-term investments of $675.2 million, as compared to $589.4 million as of December 31, 2016, an increase of $85.8 million. As of December 31, 2017, MicroStrategy had 9.4 million shares of class A common stock and 2.0 million shares of class B common stock outstanding.\nConference Call\nMicroStrategy will be discussing its fourth quarter 2017 financial results on a conference call today beginning at approximately 5:00 p.m. EST. To access the conference call, dial (844) 824-7425 (domestically) or (716) 220-9429 (internationally) and use conference ID 2991359. A live webcast and replay of the conference call will be available under the “Events” section on MicroStrategy’s investor relations website at http://ir.microstrategy.com/events.cfm . The replay will be available beginning approximately two hours after the call concludes until February 1, 2018 at (855) 859-2056 (domestically) or (404) 537-3406 (internationally) using the passcode 2991359. An archived webcast will also be available under the “Events” section on MicroStrategy’s investor relations website at http://ir.microstrategy.com/events.cfm .\nMicroStrategy 10.10™ Empowers Individuals, Departments and Enterprises with Massive Update to Data Discovery & Dossier Authoring\nIn December 2017, MicroStrategy announced the general availability of MicroStrategy 10.10, the newest feature release to the company’s MicroStrategy 10™ platform. This feature release empowers business teams to confidently embrace an enterprise-wide, data-driven culture by introducing two exciting products -- a completely redesigned and more powerful MicroStrategy Desktop™ and the new MicroStrategy Workstation.\n“We are incredibly excited to release MicroStrategy 10.10, which empowers business teams to confidently author, promote and certify analytics content, operationalize dossiers, and deliver the agility a business needs, along with the governance that IT requires,” said Tim Lang, Senior Executive Vice President and Chief Technology Officer, MicroStrategy Incorporated. “The latest capabilities in MicroStrategy 10.10 are part of MicroStrategy’s commitment to deliver the next generation of enterprise analytics to our customers so they can discover growth opportunities, solve complex business problems, and drive real results.”\nMicroStrategy 10.10 Takes Data Discovery & Dossier Authoring to New Levels\nMicroStrategy 10.10 builds on the game-changing release of MicroStrategy 10.9™, which introduced the Dossier™ feature and MicroStrategy Library™. Dossier and MicroStrategy Library deliver a new storybook experience for everyone across the enterprise and make it easy to consume, share, and collaborate around analytics. MicroStrategy 10.10 builds on these features by empowering analysts, developers and administrators to author, promote and operationalize the Dossier and MicroStrategy Library functionalities via MicroStrategy Desktop and MicroStrategy Workstation, in addition to web interfaces.\nRedesigned MicroStrategy Desktop Promotes Data-Driven Culture\nThe newest generation of MicroStrategy Desktop, MicroStrategy’s free data discovery tool, delivers a completely redesigned interface and significant enhancements to the previous version. Available for both PC and Mac, the client allows users to connect to more than 80 data sources and easily build powerful dossiers to visually tell stories with data. For the first time, analysts and data scientists are able to work in a secure, collaborative environment either offline or online by connecting to the MicroStrategy Server™, on-premise or in the cloud. By connecting to and working directly on the MicroStrategy Server, MicroStrategy Desktop users can more easily leverage the platform capabilities, such as discussion threads and alerts and notifications, to drive adoption across the workforce. Download MicroStrategy Desktop for free today.\nNew MicroStrategy Workstation Turbocharges Administration & Content Development\nMicroStrategy 10.10 introduces MicroStrategy Workstation, a new addition to the MicroStrategy product line. This powerful tool gives administrators and content developers the ability to quickly and easily build and maintain scalable enterprise content, create users and groups, assign security roles, schedule and publish data mashups for business teams, and do much more. MicroStrategy Workstation delivers these administrative capabilities to both the PC and Mac via a powerful client.\nNew Certification Capability Operationalizes Governed Data Discovery\nMicroStrategy Desktop and MicroStrategy Workstation allow analysts, data stewards and administrators who have the \"certifier\" privilege to watermark dossiers and analytics content with a “certified stamp.” With this capability, business teams can identify and highlight trusted dossiers that are built on certified and approved data, and can confidently broadcast that to a larger audience. This helps teams boldly deploy self-service capabilities, while facilitating governance and confident access to trusted data at the departmental level.\nMicroStrategy Workstation Administrators Can Provision New Cloud Servers with AWS in a Matter of Minutes\nMicroStrategy Workstation’s intuitive visual interface allows administrators to easily spin up and manage an enterprise analytics environment in the cloud in a matter of minutes. Administrators can accomplish this without leaving the interface. Administrators can create multiple MicroStrategy on AWS connections from MicroStrategy Workstation and control the environments by being able to start, stop, restart and terminate the cloud server directly from MicroStrategy Workstation. Further management of the cloud server can be performed from the administrative portal.\nNew User Management Capabilities on MicroStrategy Workstation Facilitate Personalization\nMicroStrategy Workstation simplifies the process of creating and managing users and user groups, assigning security roles, and managing access permissions. By bringing these powerful administrative capabilities to a user-friendly and modern interface, version 10.10 makes it easier to organize teams for secure and personalized sharing and collaboration – all with the necessary governance in place. Administrators can access a user-friendly interface to easily change the security role of users or user groups and control their ability to browse, read, use, execute, write, delete and control dossiers, documents or reports. With version 10.10, the most commonly used roles are readily available to be assigned to users: Administrator, Certifier, Analyst and Consumer. Beyond that, administrators can customize and restrict security access (ACLs) as needed.\nOrganizations Can Leverage Many More Data Connectors with MicroStrategy Web™, MicroStrategy Desktop & MicroStrategy Workstation\nWith MicroStrategy 10.10, new data connectors, such as data.world, Neo4j, TapClicks, Microsoft Azure Cosmos DC and SurveyMonkey, are available in the Connector Gallery of the MicroStrategy Community . With version 10.10, organizations can add custom connectors to all MicroStrategy authoring interfaces, including MicroStrategy Workstation and MicroStrategy Desktop, via the Data Connector API. With the ability to leverage new and unique connectors, organizations can use all MicroStrategy authoring interfaces to easily build analytics and mobility applications.\n100+ Enhancements Available Across the MicroStrategy Platform\nIn addition to the newest generation of MicroStrategy Desktop and the release of MicroStrategy Workstation, version 10.10 delivers dozens of new features across MicroStrategy Web, MicroStrategy Mobile™, MicroStrategy on AWS, APIs, MicroStrategy Server, and Usher ® , along with several performance and reliability enhancements across the platform. New enhancements include:\nConditional metrics for dossier authoring in MicroStrategy Web, MicroStrategy Desktop and MicroStrategy Workstation, allowing analysts to add filters on specific metrics to create more powerful dossiers; Enhanced PDF export properties offering analysts the ability to deliver highly formatted PDFs; Improvements in hierarchy reporting with optimized filtering performance to handle large hierarchies more efficiently; iOS11 certification for the MicroStrategy Mobile and MicroStrategy Library apps for iPads; Ability to deploy MicroStrategy on AWS on Amazon Linux; and Significant enhancements to Usher Professional™, making it a more robust enterprise directory and communications tool.\nMicroStrategy 10.4™ Hotfix 6 Generally Available to Customers\nAlongside the MicroStrategy 10.10 feature release, MicroStrategy 10.4 hotfix 6 became generally available to customers. This hotfix improves overall product stability, includes over 150 customer-reported enhancements and fixes across the platform, and introduces several stability, performance, and security enhancements to the MicroStrategy 10.4 platform release.\nCustomers can apply the 10.4.6 hotfix directly on top of their existing 10.4 deployments since it already includes the earlier hotfixes. The 10.4.6 hotfix is available on Windows, Linux, AIX and Solaris and can be downloaded here . This hotfix does not require a metadata update, but rather lays down the patches on top of your existing environment.\nMicroStrategy Recognized as a Leader in 2017 Dresner Advisory Services Embedded Business Intelligence Market Study\nIn December 2017, MicroStrategy announced that Dresner Advisory Services named MicroStrategy a leader in the “2017 Wisdom of Crowds ® Embedded Business Intelligence Market Study” report. Twenty-four business intelligence (BI) and analytics providers offering embedded analytics solutions were evaluated based on a set of criteria in two categories of functionality: “features” and “architecture.” MicroStrategy was a top vendor for product features.\n“We congratulate MicroStrategy on their performance in this year’s study,” said Howard Dresner, President, Founder and Chief Research Officer of Dresner Advisory Services. “Our research shows that embedded BI is in the top third of all technologies and initiatives strategic to business intelligence, behind the most mainstream BI practices (reporting, dashboards, and end-user self-services), but ahead of other widely discussed initiatives including cloud, Big Data, and IoT. This reflects the growing demand for embedded technologies, and the overall expansion of business intelligence and analytics in the world today.”\nAccording to the report, the most important objective for embedded BI today is “in-context insights and analysis,” followed closely by broadening the access to data throughout an organization internally. Specific to the functionality criteria, user respondents stated that today’s BI users prefer lightweight, embedded-BI architecture, most often through HTML and web services. The report also discusses how users look for embedded-BI features to support manipulation of non-static BI objects through drill-down and filtering, as well as functionality such as single sign-on.\nThe Dresner study is the latest in a line of increasing industry recognition for MicroStrategy, which was named a leader in “ The Forrester Wave™: Enterprise BI Platforms With Majority On-Premises Deployments, Q3 2017 ” report, and named a market leader and ranked first in data discovery product capabilities in the BARC Score Data Discovery Report, published in July 2017. To download a copy of the “2017 Wisdom of Crowds Embedded Business Intelligence Market Study,” click here .\nMicroStrategy Held 21 st Annual World Conference in Las Vegas\nIn January 2018, MicroStrategy hosted its 21 st annual user conference, MicroStrategy World™ 2018, at The Cosmopolitan of Las Vegas. MicroStrategy World 2018 brought thousands of product experts, thought leaders and MicroStrategy users together for a full three-day conference of technology-focused discussion, with over 200 sessions and 70 customer speakers. The conference showcased MicroStrategy advancements that are shaping the future of enterprise analytics.\nMicroStrategy 10.10, the newest feature release on the MicroStrategy 10 platform, took center stage at MicroStrategy World. Attendees saw demos of the latest capabilities in MicroStrategy 10.10 and got hands-on experience with the next generation of enterprise analytics so they can discover growth opportunities, solve complex business problems, and drive real results.\nMore than 200 presentations explored innovative uses of enterprise analytics and mobility and how these technologies can be applied to drive business success. Topics included AI and machine learning, AWS, Big Data and Hadoop technologies, including Spark and Cloudera, custom and D3 visualizations, enterprise adoption, IoT, mobile analytics apps for iPad and Android devices, Natural Language Generation, R and advanced analytics, and security. Sessions also showcased key analytics and mobility business solutions for a wide range of industries and functions, including retail, finance and healthcare.\nLeading Experts Discussed the Future of Analytics\nAttendees heard inspirational stories from industry leaders, visionary voices, change agents and expert practitioners on how MicroStrategy and the power of analytics, Big Data, mobile, IoT and AI applications has helped them to deliver the best and most innovative solutions to the enterprise.\nMicroStrategy World featured speakers included Billy Beane, Executive Vice President of Baseball Operations, Oakland Athletics; Boris Evelson, Vice President, Principal Analyst at Forrester; Congresswoman Jacky Rosen representing the 3rd District of Nevada; and Julian Franklin-Jones, Executive Director at UBS. Interactive panel discussions with MicroStrategy’s Customer Award winners offered attendees the opportunity to learn about the innovative analytics and mobility apps developed by these visionary leaders. MicroStrategy keynote speakers included Michael J. Saylor, Chairman, President & CEO; Tim Lang, Senior Executive Vice President & CTO; David Rennyson, Senior Executive Vice President, Worldwide Sales; Steve Holdridge, Senior Executive Vice President, Worldwide Services; and Susan Cook, Executive Vice President, North America Sales.\nFirst Ever MicroStrategy World Datathon Kicked Off Conference\nMicroStrategy’s inaugural Datathon kicked off the conference, where teams of up to five people had the opportunity to face off and compete to create innovative applications, leveraging capabilities including predictive analytics, mobile apps, hundreds of powerful APIs and much more, all of which are available with the MicroStrategy platform. Teams presented their applications and the winning team received a $10,000 prize.\nNew Channel Partner Program Unveiled at Partner Day\nAt Partner Day, MicroStrategy channel partners learned about new sales and marketing tools and programs designed to support channel partner success. Channel partner organizations also got facetime with MicroStrategy’s senior leadership and met their peers from around the world at this exclusive channel partner event.\nAttendees Participated in Hands-on Workshops\nMicroStrategy World 2018 offered 16 instructor-led different workshops to develop tangible skills and training using the latest capabilities of MicroStrategy 10. These interactive sessions provided a great opportunity to get hands-on experience building next-generation analytics and mobility applications.\nInspiring Women Leaders at the Women’s Networking Event\nWorld attendees converged at the Women’s Networking Event, where MicroStrategy customers, partners, and employees had the opportunity to meet with and hear from inspiring women leaders and savvy female executives and learn about their great work across the world of analytics.\nThe “Urban Fun Run” Benefitted D.C.-based Non-profit STEM for Her\nMicroStrategy sponsored and co-hosted an Urban Fun Run with Datastrong, a BI and data warehousing solutions provider. All proceeds from the event benefitted STEM for Her , a non-profit foundation that supports young women and girls in the Washington, D.C. region who are interested in pursuing careers in science, technology, engineering and math fields of study.\nMany Visionary Voices in a New TED Talks-style Track\nMicroStrategy debuted “Visionary Voices,” a new TED Talks-style track to engage and inspire all of our conference attendees. A wide range of innovative speakers and industry leaders, including our day two keynote headliner Billy Beane, a fascinating former NASA astronaut and veteran of four space flights, and many more influential speakers offered their perspectives and stories on data, analytics, business, and the impact of technology on everyday life.\nMicroStrategy Professional Services™ Hosted its “TechTalk” Series\nMicroStrategy Professional Services hosted its annual “TechTalk” series, a great opportunity for conference attendees to meet one-on-one with an experienced MicroStrategy consultant ready to share a wealth of expertise about their MicroStrategy implementations.\nNon-GAAP Financial Measures\nMicroStrategy is providing supplemental financial measures for income from continuing operations that excludes the impact of share-based compensation arrangements and restructuring activities, and for net income and diluted earnings per share that exclude the impact from the recent enactment of U.S. corporate tax reform legislation. These supplemental financial measures are not measurements of financial performance under generally accepted accounting principles in the United States (“GAAP”) and, as a result, these supplemental financial measures may not be comparable to similarly titled measures of other companies. Management uses these non-GAAP financial measures internally to help understand, manage and evaluate business performance and to help make operating decisions. MicroStrategy believes that these non-GAAP financial measures are also useful to investors and analysts in comparing its performance across reporting periods on a consistent basis because in the case of the supplemental measure for income from continuing operations, it excludes a significant non-cash expense that MicroStrategy believes is not reflective of its general business performance and restructuring charges that we believe are not reflective of ongoing operating results, and in the case of the supplemental measures for net income and diluted earnings per share, they exclude one-time tax charges from the recent enactment of U.S. corporate tax reform legislation. In addition, accounting for share-based compensation arrangements requires significant management judgment and the resulting expense could vary significantly in comparison to other companies. Therefore, MicroStrategy believes the use of these non-GAAP financial measures can also facilitate comparison of MicroStrategy’s operating results to those of its competitors.\nAbout MicroStrategy Incorporated\nMicroStrategy (Nasdaq: MSTR) is a worldwide leader in enterprise analytics and mobility software. A pioneer in the BI and analytics space, MicroStrategy delivers innovative software that empowers people to make better decisions and transform the way they do business. We provide our enterprise customers with world-class software and expert services so they can deploy unique intelligence applications. To learn more, visit MicroStrategy online, and follow us on LinkedIn , Twitter and Facebook .\nMicroStrategy, MicroStrategy 10, MicroStrategy 10.4, MicroStrategy 10.9, MicroStrategy 10.10, MicroStrategy Desktop, MicroStrategy Web, MicroStrategy Mobile, MicroStrategy Library, MicroStrategy Server, MicroStrategy World, MicroStrategy Professional Services, Usher, Usher Professional and Dossier are either trademarks or registered trademarks of MicroStrategy Incorporated in the United States and certain other countries. Other product and company names mentioned herein may be the trademarks of their respective owners.\nThis press release may include statements that may constitute “forward-looking statements,” including estimates of future business prospects or financial results and statements containing the words “believe,” “estimate,” “project,” “expect” or similar expressions. Forward-looking statements inherently involve risks and uncertainties that could cause actual results of MicroStrategy Incorporated and its subsidiaries (collectively, the “Company”) to differ materially from the forward-looking statements. Factors that could contribute to such differences include: the extent and timing of market acceptance of MicroStrategy’s new offerings, including MicroStrategy 10.10; the Company’s ability to recognize revenue or deferred revenue through delivery of products or satisfactory performance of services; continued acceptance of the Company’s other products in the marketplace; fluctuations in tax benefits or provisions, including changes to U.S. federal tax laws; the timing of significant orders; delays in or the inability of the Company to develop or ship new products; competitive factors; general economic conditions, including economic uncertainty in the retail industry, in which the Company has a significant number of customers; currency fluctuations; and other risks detailed in the Company’s registration statements and periodic reports filed Commission. By making these forward-looking statements, the Company undertakes no obligation to update these statements for revisions or changes after the date of this release.\nMSTR-F\nMICROSTRATEGY INCORPORATED\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share data)\nThree Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016* (unaudited) (unaudited) (unaudited) Revenues Product licenses $ 32,286 $ 38,013 $ 93,969 $ 113,503 Subscription services 8,525 7,799 32,368 30,574 Total product licenses and subscription services 40,811 45,812 126,337 144,077 Product support 75,032 72,671 289,174 285,079 Other services 22,302 21,625 89,032 83,005 Total revenues 138,145 140,108 504,543 512,161 Cost of revenues Product licenses 1,994 1,745 7,176 8,573 Subscription services 3,404 3,098 13,435 12,765 Total product licenses and subscription services 5,398 4,843 20,611 21,338 Product support 4,387 4,082 17,481 15,001 Other services 14,968 14,363 58,557 56,808 Total cost of revenues 24,753 23,288 96,649 93,147 Gross profit 113,392 116,820 407,894 419,014 Operating expenses Sales and marketing 51,977 45,292 174,612 158,740 Research and development 21,419 18,338 78,766 73,142 General and administrative 21,240 16,448 80,161 79,462 Restructuring costs 0 0\n0 45 Total operating expenses 94,636 80,078 333,539 311,389 Income from operations 18,756 36,742 74,355 107,625 Interest income, net 1,756 754 5,205 2,203 Other (expense) income, net (576 ) 3,604 (6,953 ) 3,218 Income before income taxes 19,936 41,100 72,607 113,046 Provision for income taxes 46,160 9,976 54,964 22,138 Net (loss) income $ (26,224 ) $ 31,124 $ 17,643 $ 90,908 Basic (loss) earnings per share (1): $ (2.29 ) $ 2.72 $ 1.54 $ 7.96 Weighted average shares outstanding used in computing basic (loss) earnings per share 11,447 11,433 11,444 11,425 Diluted (loss) earnings per share (1): $ (2.29 ) $ 2.69 $ 1.53 $ 7.89 Weighted average shares outstanding used in computing diluted (loss) earnings per share 11,447 11,558 11,547 11,516 (1) Basic and fully diluted earnings per share for class A and class B common stock are the same.\n* Derived from audited financial statements.\nMICROSTRATEGY INCORPORATED\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except per share data)\nDecember 31 December 31, 2017 2016* (unaudited) Assets Current assets Cash and cash equivalents $ 420,244 $ 401,975 Restricted cash 938 737 Short-term investments 254,927 187,408 Accounts receivable, net 69,500 83,319 Prepaid expenses and other current assets 18,002 11,548 Total current assets 763,611 684,987 Property and equipment, net 53,359 57,436 Capitalized software development costs, net 2,499 8,497 Deposits and other assets 2,868 5,695 Deferred tax assets, net 13,391 11,704 Total Assets $ 835,728 $ 768,319 Liabilities and Stockholders' Equity Current liabilities Accounts payable and accrued expenses $ 30,711 $ 36,628 Accrued compensation and employee benefits 41,498 43,323 Deferred revenue and advance payments, net 112,649 105,535 Total current liabilities 184,858 185,486 Deferred revenue and advance payments, net 10,181 13,915 Other long-term liabilities 50,146 16,447 Deferred tax liabilities 4 294 Total Liabilities 245,189 216,142 Stockholders' Equity Preferred stock undesignated, $0.001 par value; 5,000 shares authorized; no shares issued or outstanding 0 0 Class A common stock, $0.001 par value; 330,000 shares authorized; 15,817 shares issued and 9,412 shares outstanding, and 15,805 shares issued and 9,400 shares outstanding, respectively 16 16 Class B convertible common stock, $0.001 par value; 165,000 shares authorized; 2,035 shares issued and outstanding, and 2,035 shares issued and outstanding, respectively 2 2 Additional paid-in capital 559,918 543,974 Treasury stock, at cost; 6,405 shares (475,184 ) (475,184 ) Accumulated other comprehensive loss (5,968 ) (10,743 ) Retained earnings 511,755 494,112 Total Stockholders' Equity 590,539 552,177 Total Liabilities and Stockholders' Equity $ 835,728 $ 768,319 * Derived from audited financial statements.\nMICROSTRATEGY INCORPORATED\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nTwelve Months Ended December 31, 2017 2016* (unaudited) Operating activities: Net income $ 17,643 $ 90,908 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 12,572 17,195 Bad debt expense 2,269 224 Deferred taxes (2,011 ) (4,983 ) Release of liabilities for unrecognized tax benefits 0 (394 ) Share-based compensation expense 14,267 11,817 Excess tax benefits from share-based compensation arrangements 0 (1,244 ) Changes in operating assets and liabilities: Accounts receivable 15,348 (16,878 ) Prepaid expenses and other current assets (4,279 ) (880 ) Deposits and other assets 2,981 (4,059 ) Accounts payable and accrued expenses (9,093 ) 6,981 Accrued compensation and employee benefits (3,683 ) 3,787 Accrued restructuring costs 0 (58 ) Deferred revenue and advance payments, net (1,609 ) 11,238 Other long-term liabilities 33,917 (3,065 ) Net cash provided by operating activities 78,322 110,589 Investing activities: Proceeds from redemption of short-term investments 390,720 361,680 Purchases of property and equipment (3,982 ) (2,337 ) Purchases of short-term investments (456,468 ) (354,999 ) Net cash (used in) provided by investing activities (69,730 ) 4,344 Financing activities: Proceeds from sale of class A common stock under exercise of employee stock options 1,677 1,663 Payment of taxes relating to net exercise of employee stock options 0 (3,739 ) Excess tax benefits from share-based compensation arrangements 0 1,244 Payments on capital lease obligations and other financing arrangements (21 ) (172 ) Net cash provided by (used in) financing activities 1,656 (1,004 ) Effect of foreign exchange rate changes on cash, cash equivalents, and restricted cash 8,222 (4,176 ) Net increase in cash, cash equivalents, and restricted cash 18,470 109,753 Cash, cash equivalents, and restricted cash, beginning of year 402,712 292,959 Cash, cash equivalents, and restricted cash, end of year $ 421,182 $ 402,712 * Derived from audited financial statements.\nMICROSTRATEGY INCORPORATED\nREVENUE AND COST OF REVENUE DETAIL\n(in thousands)\nThree Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016* (unaudited) (unaudited) (unaudited) Revenues Product licenses and subscription services: Product licenses $ 32,286 $ 38,013 $ 93,969 $ 113,503 Subscription services 8,525 7,799 32,368 30,574 Total product licenses and subscription services 40,811 45,812 126,337 144,077 Product support 75,032 72,671 289,174 285,079 Other services: Consulting 20,336 19,103 79,818 73,400 Education 1,966 2,522 9,214 9,605 Total other services 22,302 21,625 89,032 83,005 Total revenues 138,145 140,108 504,543 512,161 Cost of revenues Product licenses and subscription services: Product licenses 1,994 1,745 7,176 8,573 Subscription services 3,404 3,098 13,435 12,765 Total product licenses and subscription services 5,398 4,843 20,611 21,338 Product support 4,387 4,082 17,481 15,001 Other services: Consulting 13,439 12,557 52,018 50,866 Education 1,529 1,806 6,539 5,942 Total other services 14,968 14,363 58,557 56,808 Total cost of revenues 24,753 23,288 96,649 93,147 Gross profit $ 113,392 $ 116,820 $ 407,894 $ 419,014 * Derived from audited financial statements.\nMICROSTRATEGY INCORPORATED\nDEFERRED REVENUE DETAIL\n(in thousands)\nDecember 31 December 31, 2017 2016* (unaudited) Current: Deferred product licenses revenue $ 11,113 $ 13,023 Deferred subscription services revenue 17,324 18,303 Deferred product support revenue 168,043 162,781 Deferred other services revenue 9,465 10,015 Gross current deferred revenue and advance payments\n205,945 204,122 Less: unpaid deferred revenue (93,296 ) (98,587 ) Net current deferred revenue and advance payments $ 112,649 $ 105,535 Non-current: Deferred product licenses revenue $ 7,169 $ 9,118 Deferred subscription services revenue 126 1,307 Deferred product support revenue 4,826 5,751 Deferred other services revenue 628 690 Gross non-current deferred revenue and advance payments 12,749 16,866 Less: unpaid deferred revenue (2,568 ) (2,951 ) Net non-current deferred revenue and advance payments $ 10,181 $ 13,915 Total current and non-current: Deferred product licenses revenue $ 18,282 $ 22,141 Deferred subscription services revenue 17,450 19,610 Deferred product support revenue 172,869 168,532 Deferred other services revenue 10,093 10,705 Gross current and non-current deferred revenue and advance payments 218,694 220,988 Less: unpaid deferred revenue (95,864 ) (101,538 ) Net current and non-current deferred revenue and advance payments $ 122,830 $ 119,450 * Derived from audited financial statements.\nMICROSTRATEGY INCORPORATED\nRECONCILIATION OF GAAP TO NON-GAAP MEASURES\n(in thousands, except per share data)\nThree Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 (unaudited) (unaudited) (unaudited) (unaudited) Reconciliation of non-GAAP income from operations: Income from operations $ 18,756 $ 36,742 $ 74,355 $ 107,625 Share-based compensation expense 3,710 3,393 14,267 11,817 Restructuring costs 0 0 0 45 Non-GAAP income from operations $ 22,466 $ 40,135 $ 88,622 $ 119,487 Reconciliation of non-GAAP net income: Net (loss) income $ (26,224 ) $ 31,124 $ 17,643 $ 90,908 Tax charge due to the U.S. corporate tax reform legislation 44,018 0 44,018 0 Non-GAAP net income $ 17,794 $ 31,124 $ 61,661 $ 90,908 Reconciliation of non-GAAP diluted earnings per share: Non-GAAP net income $ 17,794 $ 31,124 $ 61,661 $ 90,908 Weighted average shares outstanding used in computing diluted (loss) earnings per share 11,447 11,558 11,547 11,516 Effect of previously anti-dilutive securities 26 0 0 0 Non-GAAP weighted average shares outstanding used in computing diluted earnings per share 11,473 11,558 11,547 11,516 Non-GAAP diluted earnings per share $ 1.55 $ 2.69 $ 5.34 $ 7.89 MICROSTRATEGY INCORPORATED\nWORLDWIDE EMPLOYEE HEADCOUNT\nDecember 31,\nMarch 31, June 30, September 30, December 31, 2016 2017 2017 2017 2017 Subscription services 48 41 49 50 53 Product support 171 185 176 163 172 Consulting 453 447 448 447 441 Education 39 41 42 41 41 Sales and marketing 587 620 642 635 652 Research and development 512 522 526 539 559 General and administrative 323 306 301 303 298 Total headcount 2,133 2,162 2,184 2,178 2,216\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125006222/en/\nMicroStrategy Incorporated\nInvestor Relations\nClaudia Cahill, 703-848-8600\nir@microstrategy.com\nSource: MicroStrategy Incorporated", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2F3643%2F&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=LinkedIn&index=11&md5=bbe92b1d62c65b57564b1ae6833431c4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.microstrategy.com%2Fus%2Fgo%2Fforrester-wave-bi-report%3FCID%3D70144000000fHOo&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=The+Forrester+Wave%E2%84%A2%3A+Enterprise+BI+Platforms+With+Majority+On-Premises+Deployments%2C+Q3+2017&index=7&md5=687bafe3e00b40251cbe0f9c60e8b154", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.stemforher.org%2F&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=STEM+for+Her&index=9&md5=08d7545162d196b7b51f9bc160d4b7f7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.microstrategy.com%2Fevents.cfm&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=http%3A%2F%2Fir.microstrategy.com%2Fevents.cfm&index=2&md5=057a7981860c717cc2311c9911a12f7f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.microstrategy.com%2Fevents.cfm&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=http%3A%2F%2Fir.microstrategy.com%2Fevents.cfm&index=1&md5=594ac62381628db3a371c1641e607870", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.microstrategy.com%2Fus&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=MicroStrategy&index=10&md5=0149b2782b5eaf176e3c8875a1a44269", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fcommunity.microstrategy.com%2Fs%2Fgallery%3Ftabset-89baf%3D202df&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=+Connector+Gallery&index=4&md5=d85e12af1e52a99e977367e2ab60ad49", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.microstrategy.com%2Fus%2Fget-started%2Fdesktop&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=Download+MicroStrategy+Desktop&index=3&md5=eb75356adf11a44b76f9e6c32e1e9f02", "http://www.businesswire.com/news/home/20180125006222/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fsoftware.microstrategy.com&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=here&index=6&md5=56af1ba10c3697b9f5daa3326f75d8f7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fcommunity.microstrategy.com%2Fs%2F&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=MicroStrategy+Community&index=5&md5=570bfb5eac6e844ad406c6db334aee32", "http://ir.microstrategy.com/events.cfm", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fmicrostrategy&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=Twitter&index=12&md5=96fc5c7f15fc5a4a19a4c86ac2de8706", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2Fmicrostrategy&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=Facebook&index=13&md5=c58906ac0883f2e10c96e63886107969", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.microstrategy.com%2Fus%2Fgo%2Fwisdom-of-crowds-embedded-bi-by-dresner%3FCID%3D701440000003Xy4AAE&esheet=51748663&newsitemid=20180125006222&lan=en-US&anchor=here&index=8&md5=2e53bd81425fb77f63de6f80774c7dab"], "published": "2018-01-26T00:05:00.000+02:00", "crawled": "2018-01-26T02:52:45.054+02:00", "highlightTitle": ""}