{"organizations": [], "uuid": "04bd5da25be69f2aed85aede12a847d079e03093", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104963264-GettyImages-142836690.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/india-budget-fiscal-deficit-tax-relief-rural-spending-in-focus.html", "country": "US", "domain_rank": 767, "title": "India budget: fiscal deficit, tax relief, rural spending in focus", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.178, "site_type": "news", "published": "2018-01-30T04:44:00.000+02:00", "replies_count": 0, "uuid": "04bd5da25be69f2aed85aede12a847d079e03093"}, "author": "Saheli Roy Choudhury", "url": "https://www.cnbc.com/2018/01/29/india-budget-fiscal-deficit-tax-relief-rural-spending-in-focus.html", "ord_in_thread": 0, "title": "India budget: fiscal deficit, tax relief, rural spending in focus", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "India's finance minister Arun Jaitley will have to balance two competing imperatives when he presents the country's annual budget on Feb. 1.\nHe must find a way to restore India's crown as the world's fastest growing major economy and he also needs to keep the government on a path to lowering deficits. Meanwhile, the budget will assume more importance than usual because of a general election next year.\nBroadly, economists said they expect Jaitley to present a budget that won't reduce the deficit as aggressively as in recent years. Instead, they predicted he would introduce measures to boost the rural sector , generate employment, provide some tax relief and continue with infrastructure spending.\nIn previous quarters, India's growth slowed as the economy adjusted to the crucial currency and tax reforms the government introduced. Though recent data suggested the growth momentum was returning, experts said economic conditions have become less favorable due to rising oil prices.\nIndia now expects its gross domestic product to grow 6.5 percent for the financial year ending Mar. 31. That number, if realized, would be significantly lower than the 7.1 percent growth seen in fiscal 2017 . India would also lose its growth crown to China, which grew 6.9 percent in 2017. India's fiscal year starts on April 1.\n\"India's angst is understandable,\" Sajjid Chinoy, chief India economist at J.P. Morgan, wrote in a note. \"In a year when the global economy grew at its fastest clip in seven years, Indian growth is on course to slowing to a four-year low.\"\nIn the latest economic survey released this week, Indian policymakers said they need to manage the risks to the country's macroeconomic stability and push for more growth. Stability plans included successfully resolving the bad debt problem in India's public sector banks, stabilizing the goods and services tax implementation, and managing risks around higher oil prices and asset price corrections.\nPause in deficit cutting Experts warned that if growth were to disappoint again in the new financial year, it could create new political and economic pressure on Prime Minister Narendra Modi's government ahead of 2019's elections. Therefore, the government is expected spend enough to get the economy growing past 7 percent.\nSo, market watchers will be paying close attention to Jaitley's comments on India's fiscal deficit targets for the next financial year.\nPer the country's fiscal consolidation road map, the recommended target for a budget deficit is at 3 percent of GDP. Many expect the 2018-2019 target to be slightly higher, anywhere between 3.2 to 3.5 percent.\n\"Higher commodity prices and the need to support to the nascent recovery — especially ahead of general elections in 2019 — are likely to keep the fiscal consolidation process gradual,\" economists at Standard Chartered bank said in a note. They predicted the government would set a fiscal deficit target at 3.3 percent of GDP in the new financial year.\nThe economists explained that they expect to see double-digit growth in indirect tax revenue and strong divestment proceeds for the government in fiscal 2019. But that could be offset by potential individual income tax relief measures, excise duty cuts on retail fuel products, and an increase in rural and infrastructure spending. \"This should keep the pace of fiscal consolidation slow,\" the economists wrote.\nThat said, a temporary pause in the path to fiscal consolidation will not \"necessarily translate into the emergence of macro stability risks,\" economists at Morgan Stanley said in a note.\nRadhika Rao, an economist at Singapore's DBS Bank, told CNBC that as long as the current year's deficit does not exceed 3.5 percent — the same as it was in 2016-2017 — India's commitment to fiscal consolidation would remain intact. The consensus among experts is that the current year fiscal deficit has likely exceeded the government's target of 3.2 percent.\nMiddle class tax relief After simplifying India's complex indirect tax system last year, reports suggested that Jaitley could announce some relief for the country's middle class.\nThe finance ministry was considering a proposal to raise the personal tax exemption limit from 250,000 rupees ($3,912.5) per year to 300,000 rupees or more, according to a local media outlet . The ministry was also looking into making changes in the tax brackets to lighten the taxpayers' burden, the same report said.\nIf true, that could bring some relief to many Indian households that are struggling with rising retail inflation in the country.\nDBS Bank's Rao, however, said she was skeptical about any forthcoming income tax concessions on the back of a major indirect tax overhaul. \"With revenues and tax buoyancy still adjusting to new tax rollout, I'll be surprised if any new reforms or major concessions are laid out in February,\" she said.\nshow chapters India's finance minister sees return to 7% to 8% growth ahead 8:10 PM ET Thu, 16 Nov 2017 | 03:29 Job creation mechanism This week's budget announcement could also see the introduction of a formal policy aimed at creating quality jobs in various sectors, according to local reports.\nThe Morgan Stanley economists said it was likely the government would focus on boosting employment in labor-intensive and micro-, small- and medium-enterprises. Those include the textiles and clothing, jewelry and leather industries.\n\"[W]e expect that policymakers will look to actively tackle this issue in this budget,\" they said.\nGreater focus on the rural sector Last year, Modi's Bharatiya Janata Party won the local elections in his home state of Gujarat. But what was shocking to many was the fact that, though the party fared well among urban voters, it lost footing among the state's rural population.\nThat led many to speculate that the upcoming budget could be aimed at winning back rural voters before the next general election. In a recent interview with local television channel Times Now, however, Modi denied that the budget would be populist in nature.\n\"Budget is the property of parliament. It falls under the ambit of our finance minister, so I don't want to interfere in that,\" Modi told Times Now , according to an English translation of his Hindi comments. He added, however, that it was a priority for the government to help distressed farmers.\nModi's statements in that interview suggested that the \"budget will focus on measures to alleviate rural distress and on providing basic facilities to the common man,\" Sonal Varma, chief India economist at Nomura, wrote earlier this month.\nShe added that \"fears of outright populism\" in the budget may be exaggerated. Instead, Varma said she expects that the government \"will stick to prudent populism\" and adopt policies with both economic and political benefits.\nFocus on public infrastructure spending Analysts also predicted the government will continue to spend on public infrastructure projects. Those projects help boost job creation, productivity and economic growth — something the government will be looking to achieve before heading to the polls.\nMorgan Stanley economists said there could be further announcements on funding infrastructure programs that have already been announced — those include upgrading India's railways, providing electricity connections to all un-electrified households, providing universal affordable housing and building more roads and highways.", "external_links": [], "published": "2018-01-30T04:44:00.000+02:00", "crawled": "2018-01-30T04:44:33.007+02:00", "highlightTitle": ""}