{"organizations": [], "uuid": "6e702b17f4bf14cb699c3488aee53610e7ec94d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/images/at/1515526269930.jpg", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-marino-china-commentary/commentary-inside-the-growing-backlash-against-china-idUSKBN1EY236", "country": "US", "domain_rank": 408, "title": "Commentary: Inside the growing backlash against China", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T02:08:00.000+02:00", "replies_count": 0, "uuid": "6e702b17f4bf14cb699c3488aee53610e7ec94d3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-marino-china-commentary/commentary-inside-the-growing-backlash-against-china-idUSKBN1EY236", "ord_in_thread": 0, "title": "Commentary: Inside the growing backlash against China", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "none"}, {"name": "xi", "sentiment": "none"}], "locations": [{"name": "china china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "soviet union", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China’s rise over the last generation has been impressive, with the country moving from the periphery to the center of the global system, and climbing from impoverished backwater to a position of substantial wealth and power. But the strategic environment in which China’s “lay low” approach to international affairs has helped to make it the world’s second-largest economy is changing – and a broader backlash against China is beginning.\nUnder President Xi Jinping, Beijing has been pushing an increasingly aggressive and high-profile foreign policy, attracting the sort of attention that Xi’s predecessors had carefully avoided. Now, countries that only a few years ago welcomed Chinese investment and engagement are beginning to mobilize against Chinese influence.\nThe global conditions that favored China’s rise began at the end of the Cold War. With the fall of the Soviet Union, the West in general and the United States in particular were eager to bring additional countries into the world order they felt they had created. Throughout the 1990s, faith in the liberalizing power of commerce, and in Francis Fukuyama’s thesis that the West’s triumph over Soviet socialism heralded the “End of History,” was at its height. As a consequence, concerns about China’s autocratic model were largely shelved in Western capitals.\nThe United States in particular pushed for China’s accession to the World Trade Organization, which ultimately served as an inflection point in China’s economic growth. In the 21st century, Washington has focused most of its strategic attention on Islamist terrorism, the Middle East and Afghanistan, while Europe has been preoccupied with the euro and the growth of the European Union. Only Japan has maintained solid strategic focus on Chinese power ambition over the last generation.\nWhile this was happening, Beijing played its hand skillfully. Decades earlier, when China first embarked on its economic reform project, Deng Xiaoping, China’s leader until his death in 1997, urged subsequent generations of leaders to maintain a low international profile. Espousing the dictum of “taoguang yanghui,” (literally “Hide Brightness, Cultivate Obscurity,” but typically translated in English as “Lay Low and Bide Your Time,”) Deng advocated avoiding flashy shows of power in order to shield Chinese efforts from outside scrutiny while the country wasn’t positioned to handle them properly.\nEschewing high-profile diplomacy, China kept its bilateral focus on commerce and investment, with a consistent emphasis on “win-win” cooperation, which helped win friends. At the United Nations, Chinese diplomats generally allowed Russia to take the lead in disputes over Western activities. During the global backlash against the Iraq war, Beijing was able to present itself favorably, even launching the China-Europe Strategic Partnership in 2003, allegedly to create an alternative to American unipolar power. The creation of the BRIC Forum for emerging economies in 2009 extended this argument of “China the Reliable Partner” to developing countries outside the West. Throughout this period, and despite its growing wealth and power, Beijing was able to cultivate just enough ambiguity about its intentions to frustrate skeptics in its partner countries. From Australian mines to Confucius institutes in Western universities, the expansion continued.\nConstruction workers build a new railway line near Voi town, Kenya, March 16, 2016. The $3.2 billion project was funded by China as part of its 'One Belt, One Road' initiative. REUTERS/Goran Tomasevic The last five years upended nearly all of this in very short order. Indirect diplomatic suggestions have been swapped for attention-grabbing proposals, strategic ambiguity has been abandoned for international military bases , high-profile drills , showy parades and standoffs with neighboring countries . Fueled by large state-subsidized loans, large Chinese firms were sent on international buying binges, scooping up the Waldorf Astoria in New York City and a series of famous brands such as GE and Volvo, prompting fears among some Western legislators that the acquisitions might give the Chinese government influence over crucial commercial assets.\nIn Africa too, there is increasing concern that China’s investments on the continent are less about partnership and investment than they are about Beijing trying to win naked political influence – and importing unfair labor practices – in resource-rich countries.\nAfter solidifying his control over the Chinese Communist Party in late 2017, Xi appears to have accelerated these changes. The Communist Party’s United Work Front division has begun to enforce guidelines on the behavior of Chinese university students studying overseas. In September, Chinese scholars at the University of California, San Diego, said that a branch of China’s Ministry of Education had frozen their funding after the university invited the Dalai Lama to speak at its commencement ceremony – a measure interpreted as part of Beijing’s efforts to suppress viewpoints contrary to Communist Party dogma. And finally, Xi Jinping’s signature “One Belt, One Road” infrastructure initiative, a catchall term for hundreds of billions of planned outbound investment, has recently led to China seizing ownership of a port in Sri Lanka after local entities defaulted on the extremely onerous terms that China had demanded. The local outcry was substantial, putting further China - Sri Lanka cooperation in the crosshairs and serving as a warning to other countries receiving Chinese investment.\nWhere China had chosen for the last generation to cultivate an image of itself that stood for partnership and resistance to “Western imperialism,” Xi Jinping has now tossed it out in favor of an image of a proud, swaggering Great Power that evinces little concern for how its actions are perceived abroad. Clearly, he judges this to be in the political interest of the party, which often uses nationalist rhetoric to bolster its domestic standing. Anti-China trade sentiment has now bubbled up high enough in the United States that Washington’s new strategic directive admits China to be an adversarial “revisionist power,” where softer language had been preferred in the past. Canadian and Australian politicians are starting to show substantial skepticism about Chinese involvement domestically. In Australia, a recent scandal involving payments made to a senator from a Chinese-connected businessman has led to Canberra announcing plans to ban foreigners from donating to Australian political parties.\nEven usually-close ally Pakistan – itself part of the broader One Belt, One Road program – has been on the receiving end of Chinese over-promising and under-delivering, with Beijing reported to have abruptly stopped funding for three major Pakistani roads in the project known as the China-Pakistan Economic Corridor. And just this week, French President Emmanuel Macron took the unusual step of cautioning China publicly that the Belt and Road projects “cannot be t", "external_links": ["http://www.youtube.com/watch?v=YoC0Xcjko0A", "https://www.express.co.uk/news/world/855528/World-War-3-North-Korea-naval-drill-China-Russia-nuclear-war", "https://www.weforum.org/agenda/2017/10/brics-first-next-ten-years/", "https://thediplomat.com/2017/10/the-doklam-standoff-between-india-and-china-is-far-from-over/", "https://www.wsj.com/articles/SB10001424127887324412604578512722044165756", "http://www.cbc.ca/news/politics/chain-trade-chris-hall-1.4431497", "http://www.latimes.com/world/asia/la-fg-china-africa-kenya-20170807-htmlstory.html", "https://qz.com/1080962/china-is-retaliating-against-the-university-of-california-san-diego-for-inviting-the-dalai-lama-to-speak-at-commencement/", "http://www.scmp.com/news/china/diplomacy-defence/article/2113300/chinas-djibouti-military-base-logistics-facility-or", "https://www.theguardian.com/world/2017/oct/18/xi-jinping-speech-new-era-chinese-power-party-congress", "http://www.cnn.com/2017/12/05/opinions/australia-foreign-donations-intl/index.html", "http://www.bbc.com/news/world-africa-40158093", "https://www.cnbc.com/2017/12/12/china-and-pakistan-infrastructure-spending-on-road-project-dries-up.html", "https://qz.com/749177/kenyan-rail-workers-are-protesting-against-their-chinese-employer-for-a-raise-to-5-a-day/"], "published": "2018-01-10T02:08:00.000+02:00", "crawled": "2018-01-10T02:53:44.036+02:00", "highlightTitle": ""}