{"organizations": [], "uuid": "4e8540c4de301746dfba69986494ad20e18d01a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220369186&w=1200&r=LYNXMPEE071H3", "site_section": "https://www.reuters.com/news/us", "section_title": "U.S. News | Reuters", "url": "https://www.reuters.com/article/us-new-york-traffic/new-york-city-traffic-deaths-fall-to-record-low-under-safety-program-idUSKBN1EX2D6", "country": "US", "domain_rank": 408, "title": "New York City traffic deaths fall to record low under safety program", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T06:09:00.000+02:00", "replies_count": 0, "uuid": "4e8540c4de301746dfba69986494ad20e18d01a8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-new-york-traffic/new-york-city-traffic-deaths-fall-to-record-low-under-safety-program-idUSKBN1EX2D6", "ord_in_thread": 0, "title": "New York City traffic deaths fall to record low under safety program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Led by a sharp drop in pedestrian deaths, overall traffic fatalities in New York City fell for the fourth consecutive year in 2017 to their lowest on record, thanks at least in part to an ongoing safety improvement program, city officials said on Monday. \nThe number of pedestrians, motorists and cyclists killed in accidents on New York City streets last year fell by 7 percent to 214 and by 28 percent from 2013 when officials began implementing a safety program known as Vision Zero. \nThe program, which includes a lower speed limit, tougher enforcement and improved street design, is one of the signature policies of Mayor Bill de Blasio’s first four-year term of office. His second term began last week. \n“Vision Zero is working,” de Blasio said in announcing the new statistics at a police facility in the city’s Queens borough. \nUnder Vision Zero, originally developed in Sweden, officials have been trying to eliminate traffic deaths through more than 100 initiatives that include curbing speed limits, boosting enforcement with speed cameras and high profile ticketing campaigns, as well as driver outreach and education. \nThe most striking decline was in the number of pedestrian casualties, which fell 32 percent last year to 101, and for the first time comprise less than half of the city’s overall traffic fatalities. Since 2013, pedestrian deaths have fallen by 45 percent. \nWhile stressing that even a single traffic death is one too many, officials said that New York was moving in the opposite direction of the national trend. The National Highway Traffic Safety Administration reported that U.S. traffic deaths rose more than 13 percent between 2013 and 2016. \nThe city plans to redesign more streets to make them safer and police will “deepen” their traffic enforcement efforts, the mayor said. \n“There’s a lot more to do,” the mayor said of the program and the $1.6 billion five-year commitment attached to it. \nEarlier this month, de Blasio said the city would install more than 1,500 new barrier posts on sidewalks and plazas to protect pedestrians, after at least two instances last year of drivers killing people after mounting the curb. \nIn May an intoxicated man steered a car along sidewalks for three city blocks in Times Square, killing a young woman and injuring at least 22 people. \nIn November, a man was charged with murder and providing support to Islamic State after he mowed down people on a lower Manhattan bike lane the previous month, killing eight. \nThe deaths in those two incidents were not included in the city’s report on traffic fatalities, a spokesman for the mayor said. \nReporting by Peter Szekely; Editing by Frank McGurty and Diane Craft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T06:09:00.000+02:00", "crawled": "2018-01-09T09:40:37.163+02:00", "highlightTitle": ""}