{"organizations": [], "uuid": "e99cc7abc4e99c31dc92327cf93a46d810d56b96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-concurrent-closes-previously-announced-sale-of-content-delivery-storage-business-to-vecima-networks-for-29-millionachanges.html", "country": "US", "domain_rank": 767, "title": "Concurrent Closes Previously Announced Sale of Content Delivery & Storage Business to Vecima Networks for $29 Million; Changes Name to CCUR Holdings, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-04T01:59:00.000+02:00", "replies_count": 0, "uuid": "e99cc7abc4e99c31dc92327cf93a46d810d56b96"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-concurrent-closes-previously-announced-sale-of-content-delivery-storage-business-to-vecima-networks-for-29-millionachanges.html", "ord_in_thread": 0, "title": "Concurrent Closes Previously Announced Sale of Content Delivery & Storage Business to Vecima Networks for $29 Million; Changes Name to CCUR Holdings, Inc.", "locations": [], "entities": {"persons": [], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": [{"name": "vecima networks", "sentiment": "negative"}, {"name": "ccur holdings, inc", "sentiment": "neutral"}, {"name": "ccur holdings", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "ccur holdings, inc.", "sentiment": "none"}, {"name": "vecima networks inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 03, 2018 (GLOBE NEWSWIRE) -- Concurrent (NASDAQ:CCUR) reported yesterday that it closed the previously-announced sale of its content delivery and storage business to Vecima Networks Inc. (VCM:TO) for $29 million in cash. Effective immediately, the Company has changed its name to “CCUR Holdings, Inc.” (“CCUR” or the “Company”). The Company will continue to trade on the NASDAQ market under the symbol “CCUR” and has launched a new website located at www.ccurholdings.com .\nAbout CCUR Holdings, Inc.\nCCUR Holdings, Inc. (NASDAQ:CCUR) recently divested its linux and real-time business and its content delivery and storage business. The Company is in the process of evaluating opportunities intended to maximize the value of its remaining assets, which consists primarily of cash and cash equivalents. This will include the evaluation of opportunities to invest in or acquire one or more operating businesses intended to provide appreciation in value, thereby enhancing the Company’s liquidity, and potentially allowing the Company greater ability to utilize existing NOLs. More information on the Company is available at www.ccurholdings.com .\nForward Looking Statements\nCertain statements in this communication and the documents referenced herein constitute forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements are often identified by words such as “anticipate,” “believe,” “intend,” “estimate,” “expect,” “see,” “continue,” “could,” “can,” “may,” “will,” “likely,” “depend,” “should,” “would,” “plan,” “predict,” “target,” and similar expressions, and may include references to assumptions and relate to the Company’s future prospects, developments and business strategies. Except for the historical information contained herein, the matters discussed in this communication may contain forward-looking statements that involve risks and uncertainties that may cause the Company’s actual results to be materially different from such forward-looking statements and could materially adversely affect its business, financial condition, operating results and cash flows. These risks and uncertainties include the occurrence of any event, change or other circumstances that could affect the ability of the Company to invest or acquire an operating business or otherwise maximize the Company’s assets; general business conditions; changes in overall economic conditions; the impact of competition; and other factors which are often beyond the control of the Company, as well other risks listed in the definitive proxy statement filed on November 6, 2017 or the Company’s Form 10-K filed September 20, 2017 with the Securities and Exchange Commission and risks and uncertainties not presently known to the Company or that the Company currently deems immaterial. CCUR wishes to caution you that you should not place undue reliance on such forward-looking statements, which speak only as of the date on which they were made. CCUR does not undertake any obligation to update forward-looking statements, except as required by law.\nInvestor Relations:\nDoug Sherk\n(415) 652-9100\ndsherk@evcgroup.com\nTodd Kehrli\n(310) 625-4462\ntkehrli@evcgroup.com\nSource:Concurrent Computer Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/b18e9af8-bee3-423e-b390-946439a40bd7", "https://www.globenewswire.com/Tracker?data=VEL02Xmja13cuI06Z1jk3_ATueUaLtgfcEkAZa9EaUw8mTr-TcaOLICBjxZQqQbW9vCdFZMyM9J_Q5dp2-hNmQ=="], "published": "2018-01-04T01:59:00.000+02:00", "crawled": "2018-01-04T05:25:59.008+02:00", "highlightTitle": ""}