{"organizations": [], "uuid": "a2bead97a4896facd1bb78fc677e23cc4d5be53b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-aviation-finance/global-air-finance-titans-ponder-whether-boom-will-ever-end-idUSKBN1FF24H", "country": "US", "domain_rank": 408, "title": "Global air finance titans ponder whether boom will ever end", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:48:00.000+02:00", "replies_count": 0, "uuid": "a2bead97a4896facd1bb78fc677e23cc4d5be53b"}, "author": "", "url": "https://www.reuters.com/article/us-aviation-finance/global-air-finance-titans-ponder-whether-boom-will-ever-end-idUSKBN1FF24H", "ord_in_thread": 0, "title": "Global air finance titans ponder whether boom will ever end", "locations": [], "entities": {"persons": [{"name": "tim hepher", "sentiment": "negative"}, {"name": "conor humphries", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}], "organizations": [{"name": "gpa", "sentiment": "none"}, {"name": "min read  dublin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 3:57 PM / in 31 minutes Global air finance titans ponder whether boom will ever end Tim Hepher , Conor Humphries 5 Min Read \nDUBLIN (Reuters) - As the titans of the $140-billion a year aircraft financing industry gathered in Dublin this week to celebrate an unprecedented boom, a few were casting a cold eye on mistakes of the past - and whether they could happen again. \nIreland owes its dominance of global aircraft finance to the rise and spectacular collapse in 1992 of industry pioneer Guinness Peat Aviation (GPA), which demonstrated both the risks and returns possible from financing airplanes. \nThe former GPA executives who now dominate the industry were debating which of the new players and investors that have flooded in the last five years might not have learned from those mistakes - and whether the industry had finally broken its cycle of spectacular booms and busts. \nThe five-star venues that every year host the sector’s showcase conferences were heaving with hundreds of new investors - many from China - who have poured in to a once-obscure industry as global investors engage in a desperate search for returns. \nThrongs of financiers spilled into the street from the 200-year-old Shelbourne Hotel during the Airline Economics conference, whose delegate list has tripled to 3,000 in five years. \n“Sentiment is as positive as I have seen it,” Alec Burger the head of No. 2 lessor GECAS - formed from the hulk of GPA - told a packed second conference, Global Airfinance, where airline executives buoyed by surging air traffic eyed funds to expand their fleets. \n“This will be the fourth year of global airline profits above $30 billion and that is beyond unprecedented,” Flight Ascend chief economist Peter Morris said. PEAK OR PLATEAU? \nOptimists insist the flood of Asian money - around 20 Chinese lessors have opened Dublin offices since the start of the decade - confirms the emergence of air finance as a worthy asset class in its own right. \nAengus Kelly, the former GPA employee who is now CEO of the world’s largest lessor AerCap, said the number of banks and bond investors willing to lend to his firm has mushroomed from 50 to 500 in two decades. \n“Is it the case that all of them are in for the long haul? - Of course not. Have they come in looking for yield? - Of course they have,” he said in an interview. “But I do think on a structural basis the industry is well understood and people are starting to divorce it from airline cyclicality.” \nDomhnal Slattery, head of No. 3 firm Avolon, told delegates that those who thought the market must be peaking were “cynics” and that the cyclical peak was years away. SIGNS OF INSTABILITY \nBut the money has also caused returns to collapse in the industry’s de facto spot market: buying planes from airlines and leasing them back, prompting many big players to abandon it. \nLeasing giants say they are often left at the back of a queue of two dozen firms for such deals as new players accept tiny - some argue non-existent - returns. \n“My biggest concern over the past few years has been all the liquidity chasing these assets,” Betsy Snyder, Standard & Poor’s director, said. “What happens if we get into a downturn?” \nThe risk for those prepared to wade too aggressively into this market is that rental fees don’t cover the cost of paying debt on an over-valued jet, said market veteran Bill Cumberlidge of Aviation Partners. \nYet as lease rates suffer, the value of aircraft rises as airlines find a queue of takers, even before they are delivered. That may have encouraged some airlines to order extra planes in the hope of flipping them into the sale-leaseback market. \nIf so, they could end up getting burned as markets turn against them, warned John Plueger, CEO of Air Lease. \nAs in other branches of global finance, some worry that while a tide of money moved in during an unprecedented phase of low interest rates, it could recede as quickly as rates rise. \n“I think interest rates are a real risk in the space generally,” said Matthew Little, a partner at Castlelake, a private investment firm, adding leverage was also increasing. \nThe test will be whether this pressure topples an inexperienced few or shakes the wider industry. \n“There are a lot of new players and I am sure some of them will thrive and do very well and some of them won’t,” said Peter Barrett, another GPA alumnus who runs No.4 lessor SMBC Aviation Capital. “Time will tell who the winners and losers will be.” Reporting by Conor Humphries, Tim Hepher, Graham Fahy", "external_links": [], "published": "2018-01-26T17:48:00.000+02:00", "crawled": "2018-01-26T18:11:34.011+02:00", "highlightTitle": ""}