{"organizations": [], "uuid": "4f7bd09d356aa2266f9b944085e99708573f6149", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-sandgren/sandgren-claims-first-grand-slam-win-to-land-wawrinka-clash-idUKKBN1F51MY", "country": "US", "domain_rank": 408, "title": "Sandgren claims first grand slam win to land Wawrinka clash", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:42:00.000+02:00", "replies_count": 0, "uuid": "4f7bd09d356aa2266f9b944085e99708573f6149"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-sandgren/sandgren-claims-first-grand-slam-win-to-land-wawrinka-clash-idUKKBN1F51MY", "ord_in_thread": 0, "title": "Sandgren claims first grand slam win to land Wawrinka clash", "locations": [], "entities": {"persons": [{"name": "wawrinka", "sentiment": "negative"}, {"name": "sandgren", "sentiment": "negative"}, {"name": "waw", "sentiment": "negative"}, {"name": "martyn herman", "sentiment": "none"}, {"name": "novak", "sentiment": "none"}, {"name": "djokovic", "sentiment": "none"}, {"name": "tennys sandgren", "sentiment": "none"}, {"name": "stan", "sentiment": "none"}, {"name": "stan wawrinka", "sentiment": "none"}, {"name": "jeremy chardy", "sentiment": "none"}], "locations": [{"name": "tennessee", "sentiment": "none"}], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 1:46 PM / Updated an hour ago Sandgren claims first grand slam win to land Wawrinka clash Martyn Herman 3 Min Read \nMELBOURNE (Reuters) - American battler Tennys Sandgren won his first ever grand slam singles match on Tuesday to set up a dream Australian Open clash with former champion Stan Wawrinka. \nThe aptly-named 26-year-old, who by happy coincidence hails from Tennessee, beat experienced Frenchman Jeremy Chardy 6-4 7-6(2) 6-2 to claim the most lucrative win of his injury-hit career and a guaranteed showcourt slot on Thursday. \n“I’ve watched Stan battle with Novak (Djokovic) a few times, mostly in bars after I’ve been knocked out of whatever Challenger I’ve been in, thinking these guys are pretty good,” Sandgren told Reuters. \n”It’s pretty cool. I saw that it was a potential draw but I had to focus on Chardy because I knew it was a chance. \n“How many grand slams has (Wawrinka) won? Three? I’ve won one grand slam match, so there’s a bit of difference there.” \nWhichever court he finds himself on the world number 97 will not be fazed because he played former champion Marin Cilic on Arthur Ashe on his U.S. Open main draw debut last year. \nMostly, however, he is just cherishing being able to play having undergone career-saving hip surgery in 2013. \nSandgren also qualified for the French Open last year after coming through the United States Tennis Association’s (USTA) Roland Garros Wild Card Challenge -- a series of Challenger level claycourt events in the U.S. \nHe lost in the first round to Mikhail Kukushkin but used that momentum to break into the top 100 for the first time. \nNow he feels like he belongs with the world’s elite, having spent almost his entire career cris-crossing the U.S. in his car playing on the Futures and Challenger circuit. \n“I wasn’t sure if it would ever come,” he said of his maiden grand slam victory. “I’ve not had too many looks.” \n“The Cilic match (he lost in four sets) made me think I could compete with the top guys. You don’t really know when you’re playing the Futures. You can hit the wall sometimes.” \nWhatever happens against 2014 champion Wawrinka, Sandgren will go home with at least $64,000 -- his biggest pay day. \n”It’s weird to have any kind of money in the bank. When I first started playing I had a couple of grand. I remember coming here for quallies and it was three grand to get here and back, and you’re thinking do I have enough to get home. \n“Thankfully, I’ve managed to keep my heads above water and now I‘m seeing some return on my long-term investment. It’s finally paying off.” \nWhile Wawrinka will start as a huge favourite, Sandgren says it might not be a bad time to play the Swiss 32-year-old who has been sidelined for six months with a knee injury. \n“Him perhaps not being at his sharpest can’t hurt my chances,” he said. Reporting by Martyn Herman, editing by Ed Osmond", "external_links": [], "published": "2018-01-16T15:42:00.000+02:00", "crawled": "2018-01-16T16:01:03.000+02:00", "highlightTitle": ""}