{"organizations": [], "uuid": "0f327f1c21058b204bb0a227e5e643d7f4073f26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-motif-bio-announces-filing-of-u-s-shelf-registration.html", "country": "US", "domain_rank": 767, "title": "Motif Bio Announces Filing of U.S. Shelf Registration", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T10:00:00.000+02:00", "replies_count": 0, "uuid": "0f327f1c21058b204bb0a227e5e643d7f4073f26"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-motif-bio-announces-filing-of-u-s-shelf-registration.html", "ord_in_thread": 0, "title": "Motif Bio Announces Filing of U.S. Shelf Registration", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "american depositary shares", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 19, 2018 (GLOBE NEWSWIRE) -- Motif Bio® plc (AIM/NASDAQ:MTFB), a clinical-stage biopharmaceutical company specialising in developing novel antibiotics, today announced that the Company has filed a “universal” shelf registration statement on Form F-3 with the U.S. Securities and Exchange Commission (the “SEC”). The filing of a shelf registration statement, a common practice by NASDAQ-listed companies, is intended to provide the Company with more timely and efficient access to the U.S. capital markets.\nOnce declared effective by the SEC, the shelf registration, which can remain effective for up to three years, will enable the Company to offer, issue and sell, in one or more offerings at any time (as long as the shelf registration statement remains effective), up to an aggregate of $80 million of ordinary shares, including American Depositary Shares (“ADSs”, where each ADS represents 20 ordinary shares), preference shares, warrants, subscription rights, debt securities and a combination of such securities, separately or as units. The Company currently has no specific plans to issue securities under this shelf registration. The specifics of any future offering, including the prices and terms of any securities offered by the Company, would be determined at the time of any such offering and would be described in detail in a prospectus supplement filed in connection with such offering.\nThis shelf registration statement has been filed with the SEC, but has not yet become effective. Any offers, solicitations of offers to buy, or sales of these securities will only be made once the shelf registration statement has been declared effective by the SEC, including any prospectuses and prospectus supplements. These securities may not be sold, nor may offers to buy be accepted, prior to the time that the shelf registration statement becomes effective. A copy of the base prospectus included in the shelf registration statement may be obtained on the SEC’s website at www.sec.gov . The filing of the shelf registration statement does not affect the statutory pre-emption rights of shareholders in the Company.\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any jurisdiction in which an offer, solicitation or sale would be unlawful prior to registration and qualification under the securities law of such jurisdiction.\nAbout Motif Bio\nMotif Bio plc (AIM/NASDAQ:MTFB) is a clinical-stage biopharmaceutical company engaged in the research and development of novel antibiotics designed to be effective against serious and life-threatening infections in hospitalised patients caused by multi-drug resistant bacteria, including MRSA. The Company’s lead product candidate, iclaprim, is being developed for high-risk MRSA patient populations. The first proposed indication, and near-term commercial opportunity, is for the treatment of ABSSSI, one of the most common bacterial infections, with 3.6 million patients hospitalised annually in the U.S. The Company believes that iclaprim may be suitable for first-line empiric therapy in ABSSSI patients, especially those with renal impairment, with or without diabetes. Unlike current standard of care antibiotics, in clinical trials to date, nephrotoxicity has not been observed with iclaprim and dosage adjustment has not been required in patients with renal impairment.\nIclaprim has an underutilised mechanism of action compared to other antibiotics. Clinical and microbiology data indicate iclaprim has a targeted Gram-positive spectrum of activity, low propensity for resistance development, fixed dose administration and favourable tolerability profile. Additionally, data support that the inactive metabolites of iclaprim clear through the kidneys. The Company also plans to develop iclaprim for hospital acquired bacterial pneumonia (HABP), including ventilator associated bacterial pneumonia (VABP), as there is a high unmet need for new therapies in this indication. A Phase 2 trial was conducted to study iclaprim in patients with HABP. Iclaprim has been studied in an animal model of pulmonary MRSA infection which mimics the pathophysiology observed in patients with cystic fibrosis. Iclaprim has been granted orphan drug designation by the U.S. FDA for the treatment of Staphylococcus aureus lung infections in patients with cystic fibrosis.\nIclaprim has received Qualified Infectious Disease Product (QIDP) designation from the FDA together with Fast Track status. Upon acceptance by the FDA of a New Drug Application (NDA), iclaprim will receive Priority Review status and, if approved as a New Chemical Entity, will be eligible for 10 years of market exclusivity in the US from the date of first approval, under the Generating Antibiotic Incentives Now Act (the GAIN Act). In Europe, 10 years of data exclusivity is anticipated.\nForward-Looking Statements\nThis press release contains forward-looking statements. Words such as “expect,” “believe,” “intend,” “plan,” “continue,” “may,” “will,” “anticipate,” and similar expressions are intended to identify forward-looking statements. Forward-looking statements involve known and unknown risks, uncertainties and other important factors that may cause Motif Bio’s actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Motif Bio believes that these factors include, but are not limited to, (i) the timing, progress and the results of clinical trials for Motif Bio’s product candidates, (ii) the timing, scope or likelihood of regulatory filings and approvals for Motif Bio’s product candidates, (iii) Motif Bio’s ability to successfully commercialise its product candidates, (iv) Motif Bio’s ability to effectively market any product candidates that receive regulatory approval, (v) Motif Bio’s commercialisation, marketing and manufacturing capabilities and strategy, (vi) Motif Bio’s expectation regarding the safety and efficacy of its product candidates, (vii) the potential clinical utility and benefits of Motif Bio’s product candidates, (viii) Motif Bio’s ability to advance its product candidates through various stages of development, especially through pivotal safety and efficacy trials, (ix) Motif Bio’s estimates regarding the potential market opportunity for its product candidates, and (x) the factors discussed in the section entitled “Risk Factors” in Motif Bio’s Annual Report on Form 20-F filed with the SEC on May 1, 2017, which is available on the SEC’s web site, www.sec.gov . Motif Bio undertakes no obligation to update or revise any forward-looking statements.\nFor further information please contact:\nMotif Bio plc info@motifbio.com Graham Lumsden (Chief Executive Officer) Robert Dickey IV (Chief Financial Officer) Peel Hunt LLP (NOMAD & BROKER) + 44 (0)20 7418 8900 Dr Christopher Golden Oliver Jackson\nNorthland Capital Partners Limited (BROKER)\n+44 (0)203 861 6625 David Hignell/John Howes/Rob Re", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/b04d6639-ce8a-4c9a-b7cb-e9dcebf43891", "https://www.globenewswire.com/Tracker?data=XcxR13ES35KpbH7glm6MD51tYpIqeQ8EFAYOWi0aIFGj_zEfG2kqXHTH35G5zOeXlf-ktLXLS3OZfNzSUtBZxQ=="], "published": "2018-01-19T10:00:00.000+02:00", "crawled": "2018-01-19T13:53:32.013+02:00", "highlightTitle": ""}