{"organizations": [], "uuid": "ad8cc7e2ff2d36055d8ef2d57227eda69e900170", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-coupa-announces-closing-of-200-million-convertible-senior-notes-due-2023-and-full-exercise-of-initial-purchasersa-30.html", "country": "US", "domain_rank": 767, "title": "Coupa Announces Closing of $200 Million Convertible Senior Notes Due 2023 and Full Exercise of Initial Purchasers’ $30 Million Option to Purchase Additional Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-18T00:56:00.000+02:00", "replies_count": 0, "uuid": "ad8cc7e2ff2d36055d8ef2d57227eda69e900170"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-coupa-announces-closing-of-200-million-convertible-senior-notes-due-2023-and-full-exercise-of-initial-purchasersa-30.html", "ord_in_thread": 0, "title": "Coupa Announces Closing of $200 Million Convertible Senior Notes Due 2023 and Full Exercise of Initial Purchasers’ $30 Million Option to Purchase Additional Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "san mateo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "coupa", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN MATEO, Calif., Jan. 17, 2018 (GLOBE NEWSWIRE) -- Coupa Software (NASDAQ:COUP) today announced that it has closed its offering of convertible senior notes due 2023 (the “notes”) for gross proceeds of $230.0 million. The proceeds include the full exercise of the $30 million option to purchase additional notes granted by the Company to the initial purchasers. The notes were sold to qualified institutional buyers pursuant to Rule 144A under the Securities Act of 1933, as amended.\nThe notes are senior, unsecured obligations of Coupa, and interest is payable semi-annually in cash at a rate of 0.375% per annum on January 15 and July 15 of each year, beginning on July 15, 2018. The notes will mature on January 15, 2023 unless redeemed, repurchased or converted prior to such date. Prior to October 15, 2022, the notes are convertible at the option of holders during certain periods, upon satisfaction of certain conditions. Thereafter, the notes are convertible at any time until the close of business on the second scheduled trading day immediately preceding the maturity date. Upon conversion, the notes may be settled in shares of Coupa common stock, cash or a combination of cash and shares of Coupa common stock, at Coupa’s election.\nThe notes have an initial conversion rate of 22.4685 shares of common stock per $1,000 principal amount of notes (subject to customary adjustments in certain circumstances). This represents an initial effective conversion price of approximately $44.51 per share. The initial conversion price of the notes represents a premium of approximately 32.5% to the $33.59 per share closing price of Coupa common stock on January 11, 2018.\nCoupa estimates that the net proceeds from the offering, given the initial purchasers’ exercise in full their option to purchase additional notes, is approximately $223.0 million, after deducting the initial purchasers’ discount and estimated offering expenses payable by Coupa. Coupa used approximately $23.3 million of the net proceeds to pay the cost of the capped call transactions described below. Coupa intends to use the remainder of the net proceeds from this offering for general corporate purposes, potential acquisitions and strategic transactions. Coupa has no agreements or understandings with respect to any such acquisitions or strategic transactions at this time.\nCoupa may redeem all or any portion of the notes, at its option, on or after January 20, 2021, at a redemption price equal to 100% of the principal amount of the notes to be redeemed, plus accrued and unpaid interest thereon, if the last reported sale price of Coupa’s common stock has been at least 130% of the conversion price then in effect for at least 20 trading days (whether or not consecutive) during any 30 consecutive trading day period (including the last trading day of such period) ending on, and including, the trading day immediately preceding the date on which Coupa provides written notice of redemption.\nHolders of notes may require Coupa to repurchase their notes upon the occurrence of certain events that constitute a fundamental change under the indenture governing the notes at a purchase price equal to 100% of the principal amount thereof, plus accrued and unpaid interest to, but excluding, the date of repurchase. In connection with certain corporate events or if Coupa issues a notice of redemption, it will, under certain circumstances, increase the conversion rate for holders who elect to convert their notes in connection with such corporate event or during the relevant redemption period.\nIn connection with the pricing of the notes, Coupa has entered into privately negotiated capped call transactions with certain of the initial purchasers of the notes and/or their respective affiliates (the “capped call counterparties”). The capped call transactions initially cover, subject to customary anti-dilution adjustments, the number of shares of Coupa common stock that initially underlie the notes, including the notes purchased pursuant to the option to purchase additional notes. The cap price of the capped call transactions is initially $63.821 per share of Coupa’s common stock, representing a premium of 90% above the last reported sale price of $33.59 per share of Coupa’s common stock on January 11, 2018, and is subject to certain adjustments under the terms of the capped call transactions. The capped call transactions are expected generally to reduce or offset potential dilution to holders of Coupa’s common stock upon conversion of the notes and/or offset the potential cash payments that Coupa could be required to make in excess of the principal amount of any converted notes upon conversion thereof, with such reduction and/or offset subject to a cap based on the cap price.\nIn connection with establishing their initial hedge of the capped call transactions, the capped call counterparties have advised Coupa that they and/or their respective affiliates expect to enter into various derivative transactions with respect to Coupa common stock and/or purchase Coupa common stock concurrently with, or shortly after, the pricing of the notes. This activity could increase (or reduce the size of any decrease in) the market price of Coupa common stock or the notes concurrently with, or shortly after, the pricing of the notes.\nIn addition, the capped call counterparties and/or their respective affiliates may modify their hedge positions by entering into or unwinding various derivatives with respect to Coupa common stock and/or purchasing or selling Coupa common stock in secondary market transactions following the pricing of the notes and prior to the maturity of the notes. This activity could decrease (or avoid an increase) in the market price of Coupa common stock or the notes, which could affect noteholders’ ability to convert the notes and, to the extent the activity occurs during any observation period related to a conversion of notes, it could affect the amount and value of the consideration that noteholders will receive upon conversion of such notes.\nThis announcement is neither an offer to sell nor a solicitation of an offer to buy any of these securities (including the shares of Coupa common stock, if any, into which the notes are convertible) and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation or sale is unlawful.\nThe notes and any shares of common stock issuable upon conversion of the notes have not been registered under the Securities Act of 1933, as amended, or any state securities laws and may not be offered or sold in the United States absent registration or an applicable exemption from such registration requirements.\nForward-Looking Statements:\nThis press release contains forward-looking statements including, among other things, statements relating to the intended use of the net proceeds from the offering. These forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements involve risks and uncertainties that could cause actual results to differ materially, including, but not limited to, the anticipated use of the net proceeds of the offering, which could change as a result of market conditions or for other reasons, and the impact of general economic, industry or political conditions in the United States or internationally.\nCoupa assumes no obli", "external_links": ["https://www.globenewswire.com/Tracker?data=nTK5dGMbIpGkOo1rLYhLTg4nsA-yRtoAQ98TqEL6M6ZuGzeKXnCv99H4hKuyFc-O5KDzBt0FFz68_-LUzL7B2Q==", "https://www.globenewswire.com/Tracker?data=fRtPI8TFlecoNGpmRYQK6PW8RNTwjkU4XT1qi7ypRVVkSLhlkPr9Osbqj8UkHhaHVZ6kBpGXgePGPPzTgxY254WwaObgVVIvoISZU1NLsFE=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/887bf8a0-9975-4e12-860e-1a174531ff48"], "published": "2018-01-18T00:56:00.000+02:00", "crawled": "2018-01-18T03:35:04.005+02:00", "highlightTitle": ""}