{"organizations": [], "uuid": "44db65056ad1df7d4f7ace59208a7ceb3af0e6a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/australia-stocks-midday/australia-shares-pressured-by-banks-wall-st-nz-up-idUSL4N1PK15R", "country": "US", "domain_rank": 408, "title": "Australia shares pressured by banks, Wall St; NZ up", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T03:55:00.000+02:00", "replies_count": 0, "uuid": "44db65056ad1df7d4f7ace59208a7ceb3af0e6a0"}, "author": "", "url": "https://www.reuters.com/article/australia-stocks-midday/australia-shares-pressured-by-banks-wall-st-nz-up-idUSL4N1PK15R", "ord_in_thread": 0, "title": "Australia shares pressured by banks, Wall St; NZ up", "locations": [], "entities": {"persons": [{"name": "chris thomas  jan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "wilbur ross", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "nz", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "wall st", "sentiment": "negative"}, {"name": "u.s. commerce", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p/asx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Aussie shares down 0.1 pct; financials, industrials drag\n* Materials find support from strong oil, gold prices\n* NZ up 0.1 pct as dairy, energy stocks support\nBy Chris Thomas\nJan 25 (Reuters) - Australian shares edged lower on Thursday, hurt by pressure on U.S. markets amid fears of a trade spat with China, though strong oil and copper prices limited the downside in Sydney.\nWall Street struggled for traction overnight after U.S. Commerce Secretary Wilbur Ross hinted at action against China over alleged infringement of intellectual property.\nThose comments came on the heels of U.S. President Donald Trump’s decision to impose steep import tariffs on washing machines and solar panels earlier in the week, stoking worries of a trade war.\nThe S&P/ASX 200 index fell 0.1 percent or 7.7 points to 6,047 by 0147 GMT, having risen 0.3 percent on Wednesday.\nThe benchmark, however, is set to finish its four-day week higher. Australian financial markets will be closed on Friday for a national holiday.\nBanking stocks weighed the most on the index, with the financial index slipping as much as 0.7 percent.\nCommonwealth Bank of Australia fell 0.8 percent to its weakest in over seven weeks, Australia and New Zealand Banking Group and Westpac Banking Corp shed 1 percent each, and National Australia Bank Ltd lost 0.9 percent to touch its lowest in over a year.\nBig-cap telco Telstra Corp Ltd was among the biggest drags on the index, falling 1.1 percent to an over seven-week low.\nToll road developer Transurban Group slid 1.9 percent for its biggest loss in more than two weeks.\n“It appears that the combination of recent rises and a strong Australian dollar has made it an attractive proposition for international investors to sell today,” said Michael McCarthy, chief market strategist at CMC Markets.\nThe Aussie dollar rose to a four-month high on Wednesday, as its U.S. counterpart was knocked after U.S. Treasury secretary Steven Mnuchin said that he welcomed a weaker currency.\nGlobal miner BHP Billiton, which has a large exposure to oil, offset some of the losses on the index with a 1 percent jump.\nOil prices rallied on heavy volume on Wednesday, boosted by a record 10th straight weekly decline in U.S. crude inventories, while a weaker U.S. dollar drove up copper prices.\nGold prices also found cheer from a weak dollar, with Newcrest Mining Ltd rising 2.9 percent to its highest in over a week. The Aussie gold index jumped 2.6 percent in its best day in nearly two weeks.\nNew Zealand’s benchmark S&P/NZX 50 index rose 0.1 percent or 8.63 points to 8,332.72 at 0147 GMT.\nDairy firm a2 Milk Company Ltd led the gains with a 3.6 percent spike to record levels.\nRyman Healthcare Ltd and utility company Infratil Ltd capped the gains on the index, falling 2.6 percent and 2.8 percent, respectively.\nOn the data front, New Zealand’s consumer price index rose only 0.1 percent in the fourth quarter, well short of expectations and sparking a selloff in the local currency. (Reporting by Chris Thomas in Bengaluru; Editing by Shri Navaratnam)\n ", "external_links": [], "published": "2018-01-25T03:55:00.000+02:00", "crawled": "2018-01-25T04:26:14.017+02:00", "highlightTitle": ""}