{"organizations": [], "uuid": "65f9a282c482fe9924dbae1260c8c31919bca225", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/10/104577141-GettyImages-688402786.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/why-mark-zuckerberg-lets-facebook-workers-do-things-he-disagrees-with.html", "country": "US", "domain_rank": 767, "title": "Why Mark Zuckerberg lets Facebook workers do things he disagrees with", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-29T18:40:00.000+02:00", "replies_count": 0, "uuid": "65f9a282c482fe9924dbae1260c8c31919bca225"}, "author": "Zameena Mejia", "url": "https://www.cnbc.com/2018/01/29/why-mark-zuckerberg-lets-facebook-workers-do-things-he-disagrees-with.html", "ord_in_thread": 0, "title": "Why Mark Zuckerberg lets Facebook workers do things he disagrees with", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "negative"}, {"name": "mar", "sentiment": "negative"}, {"name": "zuckerberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "harvard", "sentiment": "none"}, {"name": "wnyc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:17 AM ET Fri, 17 Feb 2017 | 00:50 \nFor Facebook CEO Mark Zuckerberg, successfully running the social media giant comes down to two things: delegating and letting his employees do things he doesn't agree with all the time. \n\"A huge part of how Facebook works is giving a large amount of freedom to our engineers, the company and to people who use the product to make with it what they will,\" Zuckerberg said on a recent episode of WNYC \"Freakonomics Radio\" podcast . \nZuckerberg reveals he's constantly learning how to best lead the social media giant from its time as a 10-person tech startup based in a Harvard dorm room to the over 20,000 employees who work for the company today. \n\"I actually think the most important thing is what decisions and what processes on a day-to-day basis you choose to let people have the freedom to do and just not get involved with,\" he said. show chapters 12:59 PM ET Mon, 25 Sept 2017 | 01:49 \nAlthough being CEO grants Zuckerberg the ability to call all the shots, \"the real art\" to Facebook's success is allowing people to execute ideas he might not agree with. \nHaving \"someone who is a superstar, who is going to make great decisions\" is not as challenging as \"deciding to let people do things that you disagree with,\" Zuckerberg said, because, ultimately, this benefits the company. \n\"It's just going to free up more creativity and people will feel like there's more potential to try different things in the future that may be better if you let them go do those things, even if you disagree with them,\" Zuckerberg said. \nWhile the self-made billionaire probably no longer pulls all-nighters coding , Zuckerberg has also been transparent in the past about the challenges of transitioning from an engineer to CEO. \n\"This is a really interesting shift, from being an engineer to running an organization,\" Zuckerberg said an interview with LinkedIn founder Reid Hoffman for his podcast, Masters of Scale . \"One of the great things about being an engineer is that you can actually go build something yourself.\" \n\"It's one of the few professions where you can sit down and code something, \" he said, \"and then at the end, you have a product.\" \"Be entrepreneurial about it, and be a hacker and go do it.\" -Mark Zuckerberg, Facebook founder & CEO \nAs CEO, Zuckerberg said he has learned to find the best people for the job who can fulfill his vision for Facebook. \n\"When you switch to building an organization, what you learn is that you're doing a bunch of different things and that you can't do things yourself,\" Zuckerberg told Hoffman. ", "external_links": [], "published": "2018-01-29T18:40:00.000+02:00", "crawled": "2018-01-29T18:41:03.013+02:00", "highlightTitle": ""}