{"organizations": [], "uuid": "33756aa97f2b30fdf3845eb89dacf00dcf991e22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/24/104792081-GettyImages-863807990.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/apples-guidance-for-this-quarter-could-be-really-bad-btig-analyst-says.html", "country": "US", "domain_rank": 767, "title": "Apple's guidance for this quarter could be really bad, BTIG analyst says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.639, "site_type": "news", "published": "2018-01-26T16:25:00.000+02:00", "replies_count": 0, "uuid": "33756aa97f2b30fdf3845eb89dacf00dcf991e22"}, "author": "Thomas Franck", "url": "https://www.cnbc.com/2018/01/26/apples-guidance-for-this-quarter-could-be-really-bad-btig-analyst-says.html", "ord_in_thread": 0, "title": "Apple's guidance for this quarter could be really bad, BTIG analyst says", "locations": [], "entities": {"persons": [{"name": "piecyk", "sentiment": "none"}, {"name": "zhang peng", "sentiment": "none"}, {"name": "walter piecyk", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "venture capital apple", "sentiment": "negative"}, {"name": "factset", "sentiment": "none"}, {"name": "btig", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Venture Capital Apple's guidance for this quarter could be really bad, BTIG analyst says BTIG analyst Walter Piecyk estimates revenue guidance for the March quarter could be just $60 billion, 12 percent below Wall Street consensus of $68 billion. The analyst blames much of his revised outlook on predictions of softer-than-expected iPhone upgrade rates. Piecyk expects Apple to sell 53 million iPhones in the second quarter versus FactSet expectations of 61 million. Apple shares have struggled lately, down 4 percent this week. 5 Hours Ago | 00:47 \nApple will give a forecast for this current quarter that may be shockingly low, according to a BTIG analyst Walter Piecyk. \n\"Smartphone upgrade rates remain at record low levels and do not appear poised to rebound in the first calendar quarter,\" Piecyk said in a note Friday entitled \"How bad will Apple's guidance be?\" \nPiecyk estimates revenue guidance for the March quarter could be just $60 billion, 12 percent below a Wall Street consensus of $68 billion. \nThe analyst got to his lower forecast after looking at lower-than-expected smartphone upgrade rates from Verizon, as well as weak iPhone X sales. Currently, the Street is expecting Apple to sell 61 million iPhones in the second quarter, but Piecyk believes it will be closer to be 53 million. \n\"Concerns about iPhone X sales have been well documented. Apple's stock has shrugged off a slew of analyst and press reports that highlight these trends,\" Piecyk added. \"The incremental concern is whether Apple can hit or even come close to consensus revenue estimates in future quarters, due to its reliance on average sale price growth.\" \nApple is one of the market's best-performing large-cap stocks of the past year, rallying 40 percent over the past 12 months through Thursday versus the S&P 500's 24 percent gain. But it has struggled lately, down 4 percent this week. The price was flat Friday. \nPiecyk's comments echo those by other top tech analysts. Wells Fargo Securities reiterated its market perform rating on Tim Cook's company last month, saying the latest China export data hint that iPhone sales may disappoint in the December quarter as well. \nApple is set to report earnings on Thursday.", "external_links": [], "published": "2018-01-26T16:25:00.000+02:00", "crawled": "2018-01-26T16:28:30.014+02:00", "highlightTitle": ""}