{"organizations": [], "uuid": "0850a887abef542b5c0e3419e6c62a69ef17ecb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-electronic-arts-reports-q3-fy18-financial-results.html", "country": "US", "domain_rank": 767, "title": "Electronic Arts Reports Q3 FY18 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:01:00.000+02:00", "replies_count": 0, "uuid": "0850a887abef542b5c0e3419e6c62a69ef17ecb8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-electronic-arts-reports-q3-fy18-financial-results.html", "ord_in_thread": 0, "title": "Electronic Arts Reports Q3 FY18 Results", "locations": [], "entities": {"persons": [{"name": "andrew wilson", "sentiment": "none"}, {"name": "blake jorgensen", "sentiment": "none"}], "locations": [{"name": "redwood city", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "electronic arts inc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "REDWOOD CITY, Calif.--(BUSINESS WIRE)-- Electronic Arts Inc . (NASDAQ: EA) today announced preliminary financial results for its third fiscal quarter ended December 31, 2017.\n“Players enjoyed hundreds of millions of hours in our games across console, mobile and PC during the holiday quarter, and we’re thrilled to see our titles driving excitement for more fans around the world,” said Chief Executive Officer Andrew Wilson. “We’re expanding the reach of our top franchises across more geographies, our competitions are growing in participation and viewership, and we’re continuing to grow our network with more amazing games and content coming this quarter and beyond.”\n“Our diversity in portfolio, platforms, geographies, and business models is the foundation of a robust business that enables us to deliver dependable cash flow,” said Chief Financial Officer Blake Jorgensen. “Through the fourth quarter and fiscal 2019, we’ll be launching games across five different genres, on three different platforms, and to players around the world. We expect growth in full-game downloads, subscriptions, extra content, and in our mobile business.”\nNews and ongoing updates regarding EA and its games are available on EA’s blog at www.ea.com/news .\nSelected Operating Highlights and Metrics\nDigital net bookings* for the trailing twelve months was a record $3.375 billion, up 18% year-over-year, and represents 67% of total net bookings for the same period. The FIFA community grew to nearly 42 million players, on console alone, during the calendar year. FIFA Mobile added 26 million players to its total player base in the quarter. FIFA Ultimate Team™ player base grew 12% year-over-year, from launch to the end of the quarter. In Star Wars™ Battlefront™ II, nearly 70% of players engaged in the single-player campaign. Battlefield™ 1 now has more than 25 million unique players life to date. The Sims™ 4 player base grew more than 35% year-over-year and delivered the highest-performing expansion pack to date during the quarter. The Madden Challenge entertainment special on The CW Network was the #1 esports television broadcast in the U.S. for 2017.\n* Net bookings is defined as the net amount of products and services sold digitally or sold-in physically in the period. Net bookings is calculated by adding total net revenue to the change in deferred net revenue for online-enabled games.\nSelected Financial Highlights and Metrics\nAll financial measures are presented on a GAAP basis.\nNet cash provided by operating activities was $849 million. Net cash provided by operating activities for the trailing twelve months was $1.514 billion. During the quarter, EA repurchased 1.4 million shares for $150 million. For the trailing twelve months, EA repurchased 5.6 million shares for $578 million.\nQuarterly Financial Highlights\nThree Months Ended\nDecember 31,\n2017 2016 (in $ millions, except per share amounts) Digital net revenue 780 685 Packaged goods and other net revenue 380 464 Total net revenue 1,160 1,149 Net loss (186)* (1 ) Loss per share (0.60)* (0.00 ) Operating cash flow 849 1,137** Value of shares repurchased 150 127 Number of shares repurchased 1.4 1.5 *During the three months ended December 31, 2017, EA recognized $176 million of incremental income tax expense, or approximately $0.57 per share, due to the application of the Tax Cuts and Jobs Act, enacted on December 22, 2017. This amount is a reasonable estimate provided in accordance with Securities and Exchange Commission guidance. EA will provide additional information about these reasonable estimates in its forthcoming Form 10-Q for the fiscal quarter ending December 31, 2017. **At the beginning of fiscal 2018, EA adopted FASB ASU 2016-09, related to stock-based compensation. Operating cash flow for the three months ended December 31, 2016 has been recast to reflect the impact of this standard. While EA no longer reports certain non-GAAP financial measures, the following GAAP-based financial data and a long-term tax rate of 21% are used internally by company management to adjust its GAAP results in order to assess EA’s operating results:\nThree Months Ended December 31, 2017\nGAAP-Based Financial Data (in $ millions) Statement of\nOperations\nAcquisition-\nrelated expenses\nChange in\ndeferred net\nrevenue\n(online-enabled\ngames)\nStock-based\ncompensation\nTotal net revenue 1,160 - 811 - Cost of revenue 501 (1 ) - - Gross profit 659 1 811 - Total operating expenses 680 (1 ) - (63 ) Operating income (loss) (21 ) 2 811 63 Interest and other income, net 5 - - - Income (loss) before provision for (benefit from) income taxes (16 ) 2 811 63 Number of shares used in computation: Basic and diluted 308 EA's GAAP loss per share for the three months ended December 31, 2017 was calculated using the basic share count of 308 million. Had EA reported a profit, the diluted share count would have been 311 million shares.\nFor more information about the nature of the GAAP-based financial data, please refer to EA’s Form 10-Q for the fiscal quarter ended September 30, 2017.\nTTM Financial Highlights\nTTM Ended December 31, 2017 2016 (in $ millions) Digital net revenue 3,282 2,655 Packaged goods and other net revenue 1,813 1,971 Total net revenue 5,095 4,626 Net income 1,002* 1,300 Operating cash flow** 1,514 1,555 Value of shares repurchased 578 1,017 Number of shares repurchased 5.6 14.9 *During the trailing twelve months ended December 31, 2017, EA recognized $176 million of incremental income tax expense due to the application of the Tax Cuts and Jobs Act, enacted on December 22, 2017. This amount is a reasonable estimate provided in accordance with Securities and Exchange Commission guidance. EA will provide additional information about these reasonable estimates in its forthcoming Form 10-Q for the fiscal quarter ending December 31, 2017. **At the beginning of fiscal 2018, EA adopted FASB ASU 2016-09, related to stock-based compensation. Operating cash flow has been recast to reflect the impact of this standard. While EA no longer reports certain non-GAAP financial measures, the following GAAP-based financial data and a long-term tax rate of 21% are used internally by company management to adjust its GAAP results in order to assess EA’s operating results:\nTTM Ended December 31, 2017 GAAP-Based Financial Data (in $ millions) Statement of\nOperations\nAcquisition-\nrelated expenses\nChange in\ndeferred net\nrevenue\n(online-enabled\ngames)\nStock-based\ncompensation\nTotal net revenue 5,095 - (78 ) - Cost of revenue 1,246 (1 ) - (3 ) Gross profit 3,849 1 (78 ) 3 Total operating expenses 2,451 (5 ) - (222 ) Operating income 1,398 6 (78 ) 225 Interest and other income, net 13 - - - Income before provision for income taxes 1,411 6 (78 ) 225 For more information about the nature of the GAAP-based financial data, please refer to EA’s Form 10-Q for the fiscal quarter ended September 30, 2017.\nOperating Metric\nThe following is a calculation of our total net bookings for the periods presented:\nThree Months Ended TTM Ended December 31, December 31, 2017 2016 2017 2016 (in $ millions) Total net revenue 1,160 1,149 5,095 4,626 Change in deferred net revenue (online-enabled games) 811 921 (78 ) 148 Net bookings 1,971 2,070 5,017 4,774 Business Outlook as of January 30, 2018\nThe following reflect expectations as of January 30, 2018. Electronic Arts assumes no obligation to update these statements. Results may be materially different and are affected by many factors detailed in this release and in EA’s annual and quarterly SEC filings.\nFiscal Year 2018 Expectations – Ending March 31, 2018\nFinancial metrics:\nNet revenue is expected to be approximately $5.100 billion. Change in deferred net revenue (online-enabled games) is expected to be approximately $50 million. Net income is expected to be approximately $1.015 billion. Diluted earnings per share is expected to be approximately $3.25. Includes the net impact of approximately ($0.48) per share due to the application of the Tax Cuts and Jobs Act. Operating cash flow is expected to be approximately $1.600 billion. The Company estimates a share count of 312 million for purposes of calculating fiscal year 2018 diluted earnings per share.\nOperational metric:\nNet bookings is expected to be approximately $5.150 billion.\nIn addition, the following outlook for GAAP-based financial data and a long-term tax rate of 21% are used internally by EA to adjust our GAAP expectations to assess EA’s operating results and plan for future periods:\nTwelve Months Ending March 31, 2018 GAAP-Based Financial Data GAAP\nGuidance\nAcquisition-\nrelated expenses\nChange in\ndeferred net\nrevenue\n(online-enabled\ngames)\nStock-based\ncompensation\n(in $ millions) Digital net revenue 3,405 - 120 - Packaged goods & other net revenue 1,695 - (70 ) - Total net revenue 5,100 - 50 - Cost of revenue 1,278 (2 ) - (3 ) Operating expense 2,462 (7 ) - (245 ) Income before provision for income taxes 1,372 9 50 248 Net income 1,015 Number of shares used in computation: Diluted shares 312 Fourth Quarter Fiscal Year 2018 Expectations – Ending March 31, 2018\nFinancial metrics:\nNet revenue is expected to be approximately $1.532 billion. Change in deferred net revenue (online-enabled games) is expected to be approximately ($307) million. Net income is expected to be approximately $579 million. Diluted earnings per share is expected to be approximately $1.86. The Company estimates a share count of 311 million for purposes of calculating fourth quarter fiscal year 2018 diluted earnings per share.\nOperational metric:\nNet bookings is expected to be approximately $1.225 billion.\nIn addition, the following outlook for GAAP-based financial data and a long-term tax rate of 21% are used internally by EA to adjust our GAAP expectations to assess EA’s operating results and plan for future periods:\nThree Months Ending March 31, 2018 GAAP-Based Financial Data GAAP\nGuidance\nAcquisition-\nrelated expenses\nChange in\ndeferred net\nrevenue\n(online-enabled\ngames)\nStock-based\ncompensation\n(in $ millions) Total net revenue 1,532 - (307 ) - Cost of revenue 234 (1 ) - (1 ) Operating expense 619 (3 ) - (74 ) Income before provision for income taxes 677 4 (307 ) 75 Net income 579 Number of shares used in computation: Diluted shares 311 Conference Call and Supporting Documents\nElectronic Arts will host a conference call on January 30, 2018 at 2:00 pm PT (5:00 pm ET) to review its results for the third fiscal quarter ended December 31, 2017 and its outlook for the future. During the course of the call, Electronic Arts may disclose material developments affecting its business and/or financial performance. Listeners may access the conference call live through the following dial-in number 844-215-4106 (domestic) or 918-534-8313 (international), using the password “EA” or via webcast at EA’s IR Website at http://ir.ea.com .\nEA has posted a slide presentation and a financial model of EA’s historical results and guidance on EA’s IR Website. EA will also post the prepared remarks and a transcript from the conference call on EA’s IR Website.\nA dial-in replay of the conference call will be available until February 13, 2018 at 855-859-2056 (domestic) or 404-537-3406 (international) using pin code 6194018. An audio webcast replay of the conference call will be available for one year on EA’s IR Website.\nForward-Looking Statements\nSome statements set forth in this release, including the information relating to EA’s fiscal 2018 expectations under the heading “Business Outlook as of January 30, 2018,” and information regarding EA's fiscal 2019 expectations contain that are subject to change. Statements including words such as “anticipate,” “believe,” “estimate” or “expect” and statements in the future tense are . These are preliminary estimates and expectations based on current information and are subject to business and economic risks and uncertainties that could cause actual events or actual future results to differ materially from the expectations set forth in the .\nSome of the factors which could cause the Company’s results to differ materially from its expectations include the following: sales of the Company’s titles; the Company’s ability to develop and support digital products and services, including managing online security and privacy; the Company’s ability to manage expenses; the competition in the interactive entertainment industry; the effectiveness of the Company’s sales and marketing programs; timely development and release of Electronic Arts’ products; the Company’s ability to realize the anticipated benefits of acquisitions; the consumer demand for, and the availability of an adequate supply of console hardware units; the Company’s ability to predict consumer preferences among competing platforms; the Company’s ability to develop and implement new technology; foreign currency exchange rate fluctuations; general economic conditions; and other factors described in the Company’s Quarterly Report on Form 10-Q for the fiscal quarter ended September 30, 2017.\nThese are current as of January 30, 2018. Electronic Arts assumes no obligation and does not intend to update these . In addition, the preliminary financial results set forth in this release are estimates based on information currently available to Electronic Arts.\nWhile Electronic Arts believes these estimates are meaningful, they could differ from the actual amounts that Electronic Arts ultimately reports in its Quarterly Report on Form 10-Q for the fiscal quarter ended December 31, 2017. Electronic Arts assumes no obligation and does not intend to update these estimates prior to filing its Form 10-Q for the fiscal quarter ended December 31, 2017.\nAbout Electronic Arts\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers. EA has more than 300 million registered players around the world.\nIn fiscal year 2017, EA posted GAAP net revenue of $4.8 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as The Sims™, Madden NFL, EA SPORTS™ FIFA, Battlefield™, Need for Speed™, Dragon Age™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news .\nUltimate Team, EA SPORTS, Battlefield, The Sims, Need for Speed, Dragon Age, and Plants vs. Zombies are trademarks of Electronic Arts Inc. STAR WARS © & TM 2018 Lucasfilm Ltd. All rights reserved. John Madden, NFL and FIFA are the property of their respective owners and used with permission.\nELECTRONIC ARTS INC. AND SUBSIDIARIES\nUnaudited Condensed Consolidated Statement of Operations\n(in $ millions, except share per data) Three Months Ended\nDecember 31,\nNine Months Ended\nDecember 31,\n2017 2016 2017 2016 Net revenue Product 547 649 1,829 1,753 Service and other 613 500 1,739 1,565 Total net revenue 1,160 1,149 3,568 3,318 Cost of revenue Product 352 389 716 796 Service and other 149 127 328 300 Total cost of revenue 501 516 1,044 1,096 Gross profit 659 633 2,524 2,222 Operating expenses: Research and development 329 285 985 870 Marketing and sales 230 240 511 511 General and administrative 120 110 343 329 Amortization of intangibles 1 2 4 5 Total operating expenses 680 637 1,843 1,715 Operating income (loss) (21 ) (4 ) 681 507 Interest and other income (expense), net 5 (2 ) 14 (13 ) Income (loss) before provision for (benefit from) income taxes (16 ) (6 ) 695 494 Provision for (benefit from) income taxes 170 (5 ) 259 93 Net income (loss) (186 ) (1 ) 436 401 Earnings (loss) per share Basic (0.60 ) (0.00 ) 1.41 1.33 Diluted (0.60 ) (0.00 ) 1.40 1.28 Number of shares used in computation Basic 308 303 309 302 Diluted 308 303 312 314 Results (in $ millions, except per share data)\nThe following table reports the variance of the actuals versus our guidance for the three months ended December 31, 2017 plus a comparison to the actuals for the three months ended December 31, 2016.\nThree Months December 31, 2017\nGuidance Variance 2017\nActuals 2016\nActuals Net revenue Net revenue 1,135 25 1,160 1,149 GAAP-based financial data Change in deferred net revenue (online-enabled games) 865 (54 ) 811 921 Cost of revenue Cost of revenue 521 (20 ) 501 516 GAAP-based financial data Acquisition-related expenses — (1 ) (1 ) (18 ) Stock-based compensation (1 ) 1 — — Operating expenses Operating expenses 690 (10 ) 680 637 GAAP-based financial data Acquisition-related expenses (1 ) — (1 ) (2 ) Stock-based compensation (64 ) 1 (63 ) (48 ) Loss before tax Loss before tax (79 ) 63 (16 ) (6 ) GAAP-based financial data Acquisition-related expenses 1 1 2 20 Change in deferred net revenue (online-enabled games) 865 (54 ) 811 921 Stock-based compensation 65 (2 ) 63 48 Tax rate used for management reporting 21 % 21 % 21 % Loss per share Basic (0.21 ) (0.39 ) (0.60 ) (0.00 ) Diluted (0.21 ) (0.39 ) (0.60 ) (0.00 ) Number of shares Basic 309 (1 ) 308 303 Diluted 309 (1 ) 308 303 Anti-dilutive shares excluded for loss position 1 4 (1 ) 3 10 1 Diluted earnings per share reflects the potential dilution from common shares (calculated using the treasury stock method), issuable through stock-based compensation plans. When the company incurs a loss, shares issuable through stock-based compensation plans are excluded from the diluted loss per share calculation as inclusion would be anti-dilutive.\nELECTRONIC ARTS INC. AND SUBSIDIARIES Unaudited Condensed Consolidated Balance Sheets (in $ millions) December 31, 2017 March 31, 2017 2 ASSETS Current assets: Cash and cash equivalents 2,566 2,565 Short-term investments 2,318 1,967 Receivables, net of allowances of $231 and $145, respectively 886 359 Other current assets 196 308 Total current assets 5,966 5,199 Property and equipment, net 447 434 Goodwill 1,879 1,707 Acquisition-related intangibles, net 81 8 Deferred income taxes, net 159 286 Other assets 110 84 TOTAL ASSETS 8,642 7,718 LIABILITIES AND STOCKHOLDERS’ EQUITY Current liabilities: Accounts payable 91 87 Accrued and other current liabilities 1,070 789 Deferred net revenue (online-enabled games) 1,946 1,539 Total current liabilities 3,107 2,415 Senior notes, net 992 990 Income tax obligations 194 104 Deferred income taxes, net 2 1 Other liabilities 261 148 Total liabilities 4,556 3,658 Stockholders’ equity: Common stock 3 3 Additional paid-in capital 723 1,049 Retained earnings 3,455 3,027 Accumulated other comprehensive loss (95 ) (19 ) Total stockholders’ equity 4,086 4,060 TOTAL LIABILITIES AND STOCKHOLDERS’ EQUITY 8,642 7,718 2 Derived from audited consolidated financial statements.\nELECTRONIC ARTS INC. AND SUBSIDIARIES\nUnaudited Condensed Consolidated Statements of Cash Flows\n(in $ millions) Three Months Ended\nDecember 31, Nine Months Ended\nDecember 31, 2017 2016 3 2017 2016 3 OPERATING ACTIVITIES Net income (loss) (186 ) (1 ) 436 401 Adjustments to reconcile net income (loss) to net cash provided by operating activities: Depreciation, amortization and accretion 34 49 97 140 Stock-based compensation 63 48 173 144 Change in assets and liabilities Receivables, net (73 ) 126 (527 ) (367 ) Other assets 13 3 79 40 Accounts payable (88 ) (139 ) 16 (6 ) Accrued and other liabilities 165 167 265 276 Deferred income taxes, net 90 (20 ) 130 — Deferred net revenue (online-enabled games) 831 904 408 513 Net cash provided by operating activities 849 1,137 1,077 1,141 INVESTING ACTIVITIES Capital expenditures (24 ) (25 ) (87 ) (94 ) Proceeds from maturities and sales of short-term investments 606 324 1,656 968 Purchase of short-term investments (617 ) (548 ) (2,012 ) (1,372 ) Acquisition, net of cash acquired (150 ) — (150 ) — Net cash used in investing activities (185 ) (249 ) (593 ) (498 ) FINANCING ACTIVITIES Payment of convertible notes — — — (163 ) Proceeds from issuance of common stock — 2 57 33 Cash paid to taxing authorities for shares withheld from employees (7 ) (6 ) (112 ) (112 ) Repurchase and retirement of common stock (150 ) (127 ) (453 ) (383 ) Net cash used in financing activities (157 ) (131 ) (508 ) (625 ) Effect of foreign exchange on cash and cash equivalents (8 ) (20 ) 25 (28 ) Increase (decrease) in cash and cash equivalents 499 737 1 (10 ) Beginning cash and cash equivalents 2,067 1,746 2,565 2,493 Ending cash and cash equivalents 2,566 2,483 2,566 2,483 3 Operating and financing cash flow figures for the three and nine months ended December 31, 2016 have been recast to reflect the impact of ASU 2016-09 which EA adopted at the beginning of FY18.\nELECTRONIC ARTS INC. AND SUBSIDIARIES\nUnaudited Supplemental Financial Information and Business Metrics\n(in $ millions, except per share data) Q3\nFY17 Q4\nFY17 Q1\nFY18 Q2\nFY18 Q3\nFY18 YOY %\nChange Net revenue Net revenue 1,149 1,527 1,449 959 1,160 1 % GAAP-based financial data Change in deferred net revenue (online-enabled games) 4 921 (435 ) (674 ) 220 811 Gross profit Gross profit 633 1,325 1,295 570 659 4 % GAAP-based financial data Acquisition-related expenses 18 — — — 1 Change in deferred net revenue (online-enabled games) 4 921 (435 ) (674 ) 220 811 Stock-based compensation — 1 1 1 — Gross profit (as a % of net revenue) 55 % 87 % 89 % 59 % 57 % Operating income (loss) Operating income (loss) (4 ) 717 743 (41 ) (21 ) (425 %) GAAP-based financial data Acquisition-related expenses 20 1 1 2 2 Change in deferred net revenue (online-enabled games) 4 921 (435 ) (674 ) 220 811 Stock-based compensation 48 52 48 62 63 Operating income (loss) (as a % of net revenue) — 47 % 51 % (4 %) (2 %) Net income (loss) Net income (loss) (1 ) 566 644 (22 ) (186 ) (18,500 %) GAAP-based financial data Acquisition-related expenses 20 1 1 2 2 Change in deferred net revenue (online-enabled games) 4 921 (435 ) (674 ) 220 811 Stock-based compensation 48 52 48 62 63 Tax rate used for management reporting 21 % 21 % 21 % 21 % 21 % Net income (loss) (as a % of net revenue) — 37 % 44 % (2 %) (16 %) Diluted earnings (loss) per share (0.00 ) 1.81 2.06 (0.07 ) (0.60 ) - Number of diluted shares used in computation Basic 303 308 309 309 308 Diluted 303 312 313 309 308 Anti-dilutive shares excluded for loss position 1 10 — — 3 3 4 The difference between the balances of deferred net revenue (online-enabled games) in the unaudited condensed consolidated balance sheets does not necessarily equal the change in deferred net revenue (online-enabled games) in the unaudited condensed consolidated statements of cash flows due to the impact of unrecognized gains/losses on cash flow hedges.\n1 Diluted earnings per share reflects the potential dilution from common shares (calculated using the treasury stock method), issuable through stock-based compensation plans. When the company incurs a loss, shares issuable through stock-based compensation plans are excluded from the diluted loss per share calculation as inclusion would be anti-dilutive.\nELECTRONIC ARTS INC. AND SUBSIDIARIES\nUnaudited Supplemental Financial Information and Business Metrics\n(in $ millions) Q3\nFY17 Q4\nFY17 Q1\nFY18 Q2\nFY18 Q3\nFY18 YOY %\nChange QUARTERLY NET REVENUE PRESENTATIONS Net revenue by geography North America 561 644 611 427 452 (19 %) International 588 883 838 532 708 20 % Total net revenue 1,149 1,527 1,449 959 1,160 1 % North America 370 (198 ) (287 ) 59 313 International 551 (237 ) (387 ) 161 498 Change in deferred net revenue (online-enabled games) 4 921 (435 ) (674 ) 220 811 North America 49 % 42 % 42 % 45 % 39 % International 51 % 58 % 58 % 55 % 61 % Total net revenue % 100 % 100 % 100 % 100 % 100 % Net revenue by composition Full game downloads 169 259 209 123 143 (15 %) Live services 5 369 510 501 408 476 29 % Mobile 147 165 169 158 161 10 % Total digital 685 934 879 689 780 14 % Packaged goods and other 464 593 570 270 380 (18 %) Total net revenue 1,149 1,527 1,449 959 1,160 1 % Full game downloads 186 (67 ) (98 ) (4 ) 117 Live services 5 197 8 (81 ) (98 ) 311 Mobile 27 10 (19 ) (8 ) 22 Total digital 410 (49 ) (198 ) (110 ) 450 Packaged goods and other 511 (386 ) (476 ) 330 361 Change in deferred net revenue (online-enabled games) 4 921 (435 ) (674 ) 220 811 Full game downloads 15 % 17 % 14 % 13 % 12 % Live services 5 32 % 33 % 35 % 43 % 41 % Mobile 13 % 11 % 12 % 16 % 14 % Total digital 60 % 61 % 61 % 72 % 67 % Packaged goods and other 40 % 39 % 39 % 28 % 33 % Total net revenue % 100 % 100 % 100 % 100 % 100 % 4 The difference between the balances of deferred net revenue (online-enabled games) in the unaudited condensed consolidated balance sheets does not necessarily equal the change in deferred net revenue (online-enabled games) in the unaudited condensed consolidated statements of cash flows due to the impact of unrecognized gains/losses on cash flow hedges.\n5 Live services includes net revenue previously presented as “Extra Content” and “Subscriptions, Advertising and Other” through Q4 FY17.\nELECTRONIC ARTS INC. AND SUBSIDIARIES\nUnaudited Supplemental Financial Information and Business Metrics\n(in $ millions) Q3\nFY17 Q4\nFY17 Q1\nFY18 Q2\nFY18 Q3\nFY18 YOY %\nChange QUARTERLY NET REVENUE PRESENTATIONS Net revenue by platform Xbox One, PLAYSTATION 4, Switch 728 1,039 974 569 785 8 % Other consoles 65 70 60 26 25 (62 %) Total consoles 793 1,109 1,034 595 810 2 % PC / Browser 190 246 240 196 181 (5 %) Mobile 148 165 171 162 166 12 % Other 18 7 4 6 3 (83 %) Total net revenue 1,149 1,527 1,449 959 1,160 1 % Xbox One, PLAYSTATION 4, Switch 762 (375 ) (548 ) 244 705 Other consoles 3 (40 ) (42 ) 14 5 Total consoles 765 (415 ) (590 ) 258 710 PC / Browser 127 (30 ) (61 ) (30 ) 83 Mobile 27 9 (20 ) (7 ) 21 Other 2 1 (3 ) (1 ) (3 ) Change in deferred net revenue (online-enabled games) 4 921 (435 ) (674 ) 220 811 Xbox One, PLAYSTATION 4, Switch 63 % 68 % 67 % 59 % 68 % Other consoles 6 % 5 % 4 % 3 % 2 % Total consoles 69 % 73 % 71 % 62 % 70 % PC / Browser 17 % 16 % 17 % 20 % 16 % Mobile 13 % 11 % 12 % 17 % 14 % Other 1 % — — 1 % — Total net revenue % 100 % 100 % 100 % 100 % 100 % 4 The difference between the balances of deferred net revenue (online-enabled games) in the unaudited condensed consolidated balance sheets does not necessarily equal the change in deferred net revenue (online-enabled games) in the unaudited condensed consolidated statements of cash flows due to the impact of unrecognized gains/losses on cash flow hedges.\nELECTRONIC ARTS INC. AND SUBSIDIARIES\nUnaudited Supplemental Financial Information and Business Metrics\n(in $ millions) Q3\nFY17 Q4\nFY17 Q1\nFY18 Q2\nFY18 Q3\nFY18 YOY %\nChange CASH FLOW DATA Operating cash flow 6 1,137 437 176 52 849 (25 %) Operating cash flow 6 - TTM 1,555 1,578 1,872 1,802 1,514 (3 %) Capital expenditures 25 29 33 30 24 (4 %) Capital expenditures - TTM 124 123 116 117 116 (6 %) Repurchase and retirement of common stock 127 125 150 153 150 18 % DEPRECIATION Depreciation expense 29 29 29 30 30 3 % BALANCE SHEET DATA Cash and cash equivalents 2,483 2,565 2,248 2,067 2,566 Short-term investments 1,736 1,967 2,222 2,288 2,318 Cash and cash equivalents, and short-term investments 4,219 4,532 4,470 4,355 4,884 16 % Receivables, net 587 359 222 812 886 51 % STOCK-BASED COMPENSATION Cost of revenue — 1 1 1 — Research and development 27 28 28 36 38 Marketing and sales 8 8 7 9 8 General and administrative 13 15 12 16 17 Total stock-based compensation 48 52 48 62 63 6 Operating cash flow has been recast to reflect the impact of ASU 2016-09 which EA adopted at the beginning of FY18.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006321/en/\nElectronic Arts Inc.\nChris Evenden, 650-628-0255\nVice President, Investor Relations\ncevenden@ea.com\nor\nJohn Reseburg, 650-628-3601\nVice President, Corporate Communications\njreseburg@ea.com\nSource: Electronic Arts Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.ea.com&esheet=51750981&newsitemid=20180130006321&lan=en-US&anchor=EA%27s&index=4&md5=47987741a08b1de5069ec2b7aa910250", "http://www.businesswire.com/news/home/20180130006321/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.ea.com%2F&esheet=51750981&newsitemid=20180130006321&lan=en-US&anchor=Electronic+Arts+Inc&index=1&md5=79699b2f7853c229b686e825928b3710", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.ea.com&esheet=51750981&newsitemid=20180130006321&lan=en-US&anchor=http%3A%2F%2Fir.ea.com&index=3&md5=cbd0f17a02a3a710b7be9c3b17575537", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ea.com%2Fnews&esheet=51750981&newsitemid=20180130006321&lan=en-US&anchor=www.ea.com%2Fnews&index=2&md5=f188bd04c18155e65f5ae3c004764309", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.ea.com&esheet=51750981&newsitemid=20180130006321&lan=en-US&anchor=EA%27s&index=5&md5=73f028e2bafad804e2d01d8f89586c4b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ea.com%2Fnews&esheet=51750981&newsitemid=20180130006321&lan=en-US&anchor=www.ea.com%2Fnews&index=6&md5=f0384b7a94b8c3e65a7a6831be49ed2a"], "published": "2018-01-31T00:01:00.000+02:00", "crawled": "2018-01-31T03:05:50.017+02:00", "highlightTitle": ""}