{"organizations": [], "uuid": "85433ae598df2e78a39c83d55ed4b8fe1bbfdee6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-facility-management-leader-vixxo-strengthens-executive-team-with-key-appointments.html", "country": "US", "domain_rank": 767, "title": "Facility Management Leader, Vixxo, Strengthens Executive Team with Key Appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:00:00.000+02:00", "replies_count": 0, "uuid": "85433ae598df2e78a39c83d55ed4b8fe1bbfdee6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-facility-management-leader-vixxo-strengthens-executive-team-with-key-appointments.html", "ord_in_thread": 0, "title": "Facility Management Leader, Vixxo, Strengthens Executive Team with Key Appointments", "locations": [], "entities": {"persons": [{"name": "vixxo", "sentiment": "negative"}, {"name": "travis chester", "sentiment": "none"}, {"name": "travis", "sentiment": "none"}, {"name": "julie jones", "sentiment": "none"}], "locations": [{"name": "scottsdale", "sentiment": "none"}, {"name": "ariz.", "sentiment": "none"}], "organizations": [{"name": "general electric corporation", "sentiment": "none"}, {"name": "invitrogen corporation", "sentiment": "none"}, {"name": "honeywell international's aerospace", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SCOTTSDALE, Ariz., Jan. 9, 2018 /PRNewswire/ -- Leading facility management provider, Vixxo has named a new chief financial officer and a chief marketing and strategy officer to join its already seasoned executive team.\nTravis Chester will take on the role as chief financial officer and will serve as Vixxo's financial steward and provide strategic counsel that will help guide the organization as it accelerates its growth strategy. As part of his responsibilities, he will oversee Vixxo's finance teams as well as develop and implement the company's ambitious long-term financial plan heading into 2018.\nPrior to joining Vixxo, Travis served as vice president and chief financial officer of Honeywell International's Aerospace group, where he implemented the company's financial strategy. Previous senior leadership roles include Invitrogen Corporation and General Electric Corporation.\nIn addition, Vixxo also confirms the appointment of Julie Jones, in the newly created role of chief marketing and strategy officer. She joins the company with technology expertise spanning over 20 years and will be responsible for increasing Vixxo's brand identity and developing a robust brand and marketing strategy within the marketplace.\nJulie hails from Tech Data (formerly Avnet Technology Solutions) where she most recently served as vice president of supplier marketing for the Enterprise Solutions division. Prior to Tech Data, Julie drove the marketing and solutions strategy for global technology solutions provider Insight Enterprises.\nBoth roles will report directly to Jim Reavey, Vixxo's CEO.\nCommenting on the appointments, Jim Reavey said, \"Both Travis and Julie's wealth of industry knowledge and experience have already made them key additions to the Vixxo family. Both appointments are a clear sign of our commitment to be the leaders in our field as we continue to grow and lead our industry. I'm confident that Travis and Julie will play key roles in providing and implementing high quality solutions for our clients.\"\nTo learn more about Vixxo, please visit us at www.vixxo.com , or follow us on Twitter and LinkedIn .\nAbout Vixxo\nVixxo is a leading technology-enabled facility and asset management provider for many Fortune 500 clients in the restaurant, retail, convenience, and supermarket industries. Their solutions are designed to revolutionize and optimize clients' multi-site portfolios by improving service delivery, reducing costs and providing strategic insights – all aimed at lowering total cost of ownership. Based in Scottsdale, Arizona, Vixxo maintains a national network of 150,000 service provider technicians and serves more than 65,000+ client locations.\nView original content with multimedia: http://www.prnewswire.com/news-releases/facility-management-leader-vixxo-strengthens-executive-team-with-key-appointments-300579846.html\nSOURCE Vixxo", "external_links": ["https://www.linkedin.com/company/vixxo/", "https://twitter.com/wearevixxo?lang=en", "http://www.vixxo.com/", "http://www.prnewswire.com/news-releases/facility-management-leader-vixxo-strengthens-executive-team-with-key-appointments-300579846.html"], "published": "2018-01-09T19:00:00.000+02:00", "crawled": "2018-01-09T21:30:38.021+02:00", "highlightTitle": ""}