{"organizations": [], "uuid": "3f4f75316ea834c15fd93f7209017fbc215b93c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 11}, "facebook": {"likes": 18, "shares": 18, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104962118-StillTesting_Pad2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/29/pros-call-the-stock-markets-parabolic-up-move-this-year-a-melt-up.html", "country": "US", "domain_rank": 767, "title": "Pros call the stock market's parabolic up move this year a 'melt-up'", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T13:35:00.000+02:00", "replies_count": 0, "uuid": "3f4f75316ea834c15fd93f7209017fbc215b93c2"}, "author": "Michael Santoli", "url": "https://www.cnbc.com/2018/01/29/pros-call-the-stock-markets-parabolic-up-move-this-year-a-melt-up.html", "ord_in_thread": 0, "title": "Pros call the stock market's parabolic up move this year a 'melt-up'", "locations": [], "entities": {"persons": [{"name": "chris verron", "sentiment": "none"}], "locations": [], "organizations": [{"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "There is no set definition of a market \"melt-up.\" But it's fair to say that we're in one, or close.\nIf a melt-up is a sharp upward acceleration in stock prices from already-high levels with few pauses or pullbacks along the way and a rush of public enthusiasm, that roughly describes today's market.\nWhen some market watchers started talking about the chance of a melt-up to come a few months ago — cited in a column here back in October — some of the responses were, effectively, \"Hasn't 2017 been one big melt-up?\"\nNo, the steady rally for most of last year was too well-behaved along too gentle a slope. The action since then has been more of a melt.\nThe S&P 500 is up 7.5 percent over 18 trading sessions so far in 2018, up more than 18 percent in five months, 26 percent from a year ago, 38 percent since the November 2016 election and nearly 50 percent from two years ago.\nNaturally, Wall Street strategists are trying to define a melt-up using some statistical standard, because that's what they do, and because their fund manager clients keep asking, \"Is this the melt-up?\"\nChris Verrone of Strategas Research Partners suggests the threshold for a melt-up is a six-month rally that ranks in the top 5 percent of all such periods — right now that means a 21 percent surge. Not quite yet, but if the S&P adds about 3 percent in the next three weeks, it will qualify.\nJeff deGraaf at Renaissance Macro Research sets a slightly higher bar: Up 50 percent over 18 months. The market's not there yet, but another 9 percent rise by the end of April would check off that box.\nAnd Tom Lee of FundStrat says the market has already gone \"parabolic\" in January, accelerating to a 7 percent monthly rally pace from 2 percent per month the prior four months and 1.24-percent a month from January through August. Lee counts only six prior years when January went nearly vertical as this one has.\nSource: Fundstrat\nIt probably makes sense to note that describing a market move as a melt-up is not a put-down. Some bullish investors bristle at the term, feeling that it implies something artificial or fleeting or unmoored from reality,\nReally, melt-up just describes the pace and persistence of a rally at a time when the price appreciation seems to be feeding on itself. Think of it as the obverse of a market meltdown: There are almost always solid underlying fundamental reasons for a nasty market decline, but when the bad news and fear become saturating and the market's scary freefall itself begets more selling, that's the meltdown, or downside overshoot phase.\nThe thing is, meltdowns are more concentrated moments of panicky liquidation and tend not to last long; a melt-up can be a more prolonged phase of good economic news and swelling risk appetites feeding on themselves.\nStudies of what happens after a melt-up phase demand that investors try to achieve F. Scott Fitzgerald's definition of a first-rate intelligence: \"The ability to hold two opposed ideas in the mind at the same time, and still retain the ability to function.\"\nThe first idea is that the stock market is comically, almost grotesquely extended to the upside after this near-ceaseless ascent as speculative behavior is heating up and valuation support is waning. The laws of financial physics say this can't persist for much longer.\nThe second idea is that whenever the market has behaved like this in the past, it reflected abiding underlying strength and there was almost always substantial further upside ahead - often with tough downside shakeouts along the way though.\nMarket stat keepers tell us the S&P 500 has almost never been as \"overbought\" as it is today, in terms of the angle of its climb relative to a longer-term trend. This month, the S&P 500 has been compounding at a 125-percent annualized rate. Analysts' pace of increased-earnings revisions is nearly off the charts, usually a sign that improving fundamentals are getting fully priced in.\nSo what happens next? Ned Davis Research's crowd sentiment poll never showed more collective bullishness. The S&P is in its longest streak without a 3 percent pullback, near the longest run without even a 1 percent dip and has gone 99 days without as much as a 0.6 percent daily loss - by far a record.\nThe careful investor who's looking at all of these superlatives and rare extremes then asks what typically happens next? And the answer comes back, \"Usually more gains for a while, often with a choppier ride.\"\nThis is what the melt-up chroniclers such as Lee and Verrone and all the rest repeatedly find in the historical record: Even if we've seen the peaks in market momentum, investor optimism, investor fund flows and upside earnings revisions, the indexes themselves have rarely topped for good until some time and distance afterward.\nRetail stock-fund inflows are near a record level and online-brokerage volumes as a percentage of total market activity has gone vertical this year. This is the \"all-in, things-are-good-and everyone-knows-it\" period, the makings of a bull-market \"overshoot.\"\nBespoke Investment Group suggests any slight tremor from here could feel like a scary quake: \"The longer we go without experiencing any declines of significance, it's going to make the eventual decline feel exponentially worse when it finally happens. ... This means emotions will run extra high the next time a drop occurs, which could precipitate more selling than usual.\"\nAll global asset markets are at some relative or absolute extreme: The dollar at multi-year lows, oil and bond yields exceeding the top of long-standing ranges, credit spreads near all-time tight levels and the valuation of stock to bond valuations at a seven-year high.\nEven if the melt-up carries higher and the first reversal isn't likely to be the \"big one,\" these markets could get more interesting soon.", "external_links": [], "published": "2018-01-29T13:35:00.000+02:00", "crawled": "2018-01-29T14:05:46.000+02:00", "highlightTitle": ""}