{"organizations": [], "uuid": "940f65c25689a4593c9f83145126f4983472bc00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-arash-azarbarzin-appointed-president-of-sh-group.html", "country": "US", "domain_rank": 767, "title": "Arash Azarbarzin Appointed President of SH Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T19:30:00.000+02:00", "replies_count": 0, "uuid": "940f65c25689a4593c9f83145126f4983472bc00"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-arash-azarbarzin-appointed-president-of-sh-group.html", "ord_in_thread": 0, "title": "Arash Azarbarzin Appointed President of SH Group", "locations": [], "entities": {"persons": [{"name": "arash azarbarzin", "sentiment": "negative"}, {"name": "azarbarzin", "sentiment": "none"}, {"name": "barry sternlicht", "sentiment": "none"}, {"name": "arash", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "south beach", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "st. regis", "sentiment": "none"}], "organizations": [{"name": "sh group", "sentiment": "negative"}, {"name": "starwood hotels", "sentiment": "none"}, {"name": "w hotels & resorts", "sentiment": "none"}, {"name": "baccarat hotels & resorts", "sentiment": "none"}, {"name": "starwood capital group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 3, 2018 /PRNewswire/ -- SH Group, the hotel brand management company created and owned by Starwood Capital Group, today announced the appointment of Arash Azarbarzin as President, effective immediately. In his new role, Azarbarzin will oversee all operations and expansion for SH Group. SH Group currently operates the fast growing 1 Hotels, a nature-inspired luxury lifestyle brand with locations in Manhattan, Brooklyn and South Beach, as well as the five-star luxury Baccarat Hotel brand.\n\"Arash is a superb addition to our team who has the expertise and talent to guide the unparalleled 1 Hotels and Baccarat Hotels & Resorts to the next level as we rapidly expand our global footprint and continue to innovate,\" says Barry Sternlicht, Chairman and CEO of Starwood Capital Group. \"Arash and I worked together at Starwood Hotels. His impressive results and successes with W Hotels & Resorts, St. Regis and others as well as his terrific track record operating and developing the sbe Hotel brands make him an invaluable addition and welcome member to SH Group.\"\nAzarbarzin joins SH Group with more than 30 years of industry experience, including as a founding member of sbe Hotel Group, where he served as president for 12 years. He spent several years in leadership roles at W Hotels & Resorts, where he worked alongside Mr. Sternlicht, who created the W brand, as well as with St. Regis and Four Seasons.\n\"I have always wanted to reunite with Barry Sternlicht, one of my long-time mentors, and someone with the vision and resources to build a world-class hospitality organization. This is an opportunity of a lifetime and I am honored to join this industry-leading team,\" said Azarbarzin. \"As a mission-driven brand, 1 Hotels offers a unique experience that resonates with today's travelers and inspires them to reflect on living sustainably, while Baccarat provides guests an unparalleled level of luxury. Both 1 Hotels and Baccarat Hotels & Resorts are experiencing startling market success and are positioned for incredible growth and my goal is to fuel each brand's expansion while continuing to cement each hotel as leaders in their market.\"\nIn addition to day-to-day operations, Azarbarzin will spearhead scheduled 1 Hotel openings in Los Angeles, Cabo, Sunnyvale, Sanya (China) and Paris. Additionally, he will direct global initiatives geared toward the 1 Vision of leading hospitality forward and becoming a platform to spark conversation and action that transform the industry and our lives. He will also work on the soon to be announced pipeline openings for Baccarat Hotels & Resorts, bringing limitless luxury to new markets.\nFor more information about all SH Group's properties, please visit www.shgroup.com .\nAbout SH Group:\nSH Group, an affiliate of global private investment firm Starwood Capital Group, is a hotel brand management company that operates 1 Hotels, a nature-inspired lifestyle brand that launched in 2015 with properties in South Beach and Manhattan; and Baccarat Hotels & Resorts, a luxury brand that made its debut in March 2015 with the opening of its flagship property in New York, with projects under development in Abu Dhabi and Doha. Leveraging its marketing, design, operational and technological expertise, SH Group is the force behind some of the most groundbreaking and dynamic hotel brands in the world.\nAbout 1 Hotels:\nAs a luxury lifestyle hotel brand inspired by nature, 1 Hotels cultivates the best of sustainable design and architecture, together with extraordinary comfort and an unrivaled level of service. 1 Hotels, which launched in 2015 with the opening of exclusive properties in Miami's South beach and Manhattan's Central Park, followed by Brooklyn, located on Pier 1, in February 2017, is inspired by a simple idea: those that travel the world also care about it. 1 Hotels upholds this vision by channeling nature through design and culinary partnerships, while connecting with the local community and taking sustainable steps to make a big difference. 1 Hotel Central Park and 1 Hotel Brooklyn Bridge claimed Conde Nast Traveler's #2 and #13 spots respectively in the Top 50 Hotels in New York City and 1 Hotel South Beach was awarded #7 in the top 10 Hotels in the United States. For more information, visit www.1hotels.com .\nAbout Baccarat Hotel New York:\nBaccarat Hotel New York is the first hotel and global flagship for the 252-year-old Baccarat crystal brand. Directly across the street from the Museum of Modern Art and steps away from Fifth Avenue's legendary shopping, the 114 exquisitely appointed guest rooms & suites designed by Paris-based, luxury design team Gilles & Boissier delight the senses with lavish finishes and artisanal attention to detail. Generous amenities include stunning salon-style spaces where guests may enjoy breakfast, cocktails, afternoon tea and light fare; a beautiful barrel-vaulted bar featuring a kaleidoscope of Baccarat crystal stemware; a soothing Spa de La Mer, the first of its kind in the world, and a 55-foot sunken marble swimming pool complete with day beds reminiscent of La Côte d'Azur. It was named #4 on Condé Nast Traveler's list of Top 50 Hotels in New York City as well as mentions on the magazine's Gold and Hot Lists, one of the 20 Best New Hotels of the Year by USA Today, Best Urban Hotels in Wallpaper* and featured on Travel & Leisure's It List. For more information, visit www.baccarathotels.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/arash-azarbarzin-appointed-president-of-sh-group-300576941.html\nSOURCE SH Group", "external_links": ["http://www.prnewswire.com/news-releases/arash-azarbarzin-appointed-president-of-sh-group-300576941.html", "http://www.baccarathotels.com/", "http://www.shgroup.com/", "http://www.1hotels.com/"], "published": "2018-01-03T19:30:00.000+02:00", "crawled": "2018-01-03T20:57:59.008+02:00", "highlightTitle": ""}