{"organizations": [], "uuid": "45aa7ce88214cb048f3c77bbd1211682d1b7797a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/morocco-currency/morocco-looks-for-smooth-transition-to-more-flexible-exchange-rate-system-idUSL8N1P90D0", "country": "US", "domain_rank": 408, "title": "Morocco looks for smooth transition to more flexible exchange-rate system", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T18:59:00.000+02:00", "replies_count": 0, "uuid": "45aa7ce88214cb048f3c77bbd1211682d1b7797a"}, "author": "", "url": "https://www.reuters.com/article/morocco-currency/morocco-looks-for-smooth-transition-to-more-flexible-exchange-rate-system-idUSL8N1P90D0", "ord_in_thread": 0, "title": "Morocco looks for smooth transition to more flexible exchange-rate system", "locations": [], "entities": {"persons": [{"name": "aziz el yaakoubi", "sentiment": "none"}], "locations": [{"name": "morocco", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "internationa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Trading bands will be widened to 2.5 pct\n* Bankers say market well prepared\n* Inflation could prompt dirham depreciation\nBy Aziz El Yaakoubi\nDUBAI, Jan 14 (Reuters) - Morocco’s introduction of a more flexible exchange-rate system from Monday could result in only a slight depreciation in the short term, analysts and bankers said, but the dirham could become more vulnerable if commodity prices rise.\nThe move is aimed at giving the economy greater protection from external shocks, with central bank officials saying it will preserve competitiveness and that it has sufficient foreign exchange reserves -- covering 5 months and 24 days of imports -- to allow a smooth transition.\nIt is also expected to help Moroccan exports and boost tourism revenue and remittances from Moroccans living abroad, on which the cash-strapped country relies for sources of hard currency.\nMorocco has been working for years with a technical mission from the International Monetary Fund (IMF) to liberalise its currency, with both saying the move would be gradual and a total float would take years depending on how the market reacts.\nOn Monday the fluctuation band in which the dirham is traded against hard currencies will be widened from 0.3 percent either side of the previous day’s close to 2.5 percent either side, giving a 5 percent range in total.\nThe Moroccan dirham is pegged most closely to the euro, but as a step towards greater flexibility, the central bank, last year reduced the euro weighting of the exchange rate to 60 percent from 80 percent and raised the U.S. dollar weighting to 40 percent from 20 percent.\nIt was the first change to Morocco’s currency basket in a decade and followed an increase in trade with the United States, China and the rest of Africa but a fall in trade with the euro zone.\nThe central bank, known as Bank al-Maghrib, will also intervene through regular auctions for the dollar, and other currencies when it sees the need, according to a circular published over the weekend.\nThe banks will also be allowed to trade hard currencies in the interbank market and be given new hedging tools to manage interest rate and foreign exchange risks.\n“We may see the dirham fall against the euro and that will result in a moderate depreciation,” one senior banker said.\nAnother banker said: “We are prepared for a little correction, but globally the market and banks are well prepared and eventually everything will go smoothly.”\nMoroccan central bank officials could not be reached for comment on Sunday but they have repeatedly said -- along with the IMF -- that the dirham has been at a balanced level and will not plummet once the system becomes more flexible.\nINFLATION RISK Unlike some other countries in the region, Morocco has managed to avoid a big drop in foreign investments since the global financial crisis and the Arab Spring uprisings of 2011, partly by marketing itself as an export base for Europe, the Middle East and Africa.\nMoroccan exports have been growing since the country attracted heavyweights in the automotive and aeronautic industries, which helped to offset big post-2011 deficits.\nA stronger euro will also help the tourism sector and remittances from the 4.5 million Moroccans living abroad, mostly in the euro zone.\nHowever, rising commodity prices could raise inflation in a country that is one of the region’s biggest energy importers. That would put the government in a delicate position as it is already faces strong protests over economic hardship in remote areas.\nBank al-Maghrib will, therefore, simultaneously target inflation alongside the liberlisation process.\nThe IMF has said inflation is expected to stabilise around 2 percent over the medium term.\n“It will depend on the capacity of the central bank to keep its commitments and support the dirham by using the foreign reserves,” said Rabat-based economist Mehdi Lahlou.\n“Otherwise, inflation will go up in the medium term and the dirham will plummet.” (Reporting by Aziz El Yaakoubi; Editing by David Goodman)\n ", "external_links": [], "published": "2018-01-14T18:59:00.000+02:00", "crawled": "2018-01-14T19:40:14.010+02:00", "highlightTitle": ""}