{"organizations": [], "uuid": "45bb09d77ec531253d2387e862684736297511c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/jack-ma.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/15/artificial-intelligence-ai-china-alibaba-reading-comprehension-stanford/", "country": "US", "domain_rank": 1196, "title": "AI From China's Alibaba Can Now Read Better Than You Do | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.71, "site_type": "news", "published": "2018-01-15T09:14:00.000+02:00", "replies_count": 0, "uuid": "45bb09d77ec531253d2387e862684736297511c2"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/15/artificial-intelligence-ai-china-alibaba-reading-comprehension-stanford/", "ord_in_thread": 0, "title": "AI From China's Alibaba Can Now Read Better Than You Do | Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "baidu", "sentiment": "none"}], "organizations": [{"name": "alibaba", "sentiment": "negative"}, {"name": "bloomberg 7:14 am est  alibaba", "sentiment": "neutral"}, {"name": "stanford university", "sentiment": "none"}, {"name": "tencent holdings", "sentiment": "none"}, {"name": "alibaba group holding", "sentiment": "none"}, {"name": "institute of data science of technologies", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "artificial intelligence can break free", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 7:14 AM EST \nAlibaba has developed an artificial intelligence model that scored better than humans in a Stanford University reading and comprehension test. \nAlibaba Group Holding (baba) put its deep neural network model through its paces last week, asking the AI to provide exact answers to more than 100,000 questions comprising a quiz that’s considered one of the world’s most authoritative machine-reading gauges. The model developed by Alibaba’s Institute of Data Science of Technologies scored 82.44, edging past the 82.304 that rival humans achieved. \nAlibaba said it’s the first time a machine has out-done a real person in such a contest. Microsoft achieved a similar feat, scoring 82.650 on the same test, but those results were finalized a day after Alibaba’s, the company said. \nRead: Alphabet’s DeepMind Is Using Games to Discover If Artificial Intelligence Can Break Free and Kill Us All \nThe Chinese e-commerce titan has joined the likes of Tencent Holdings (tctzf) and Baidu (bidu) in a race to develop AI that can enrich social media feeds, target ads and services or even aid in autonomous driving. Beijing has endorsed the technology in a national-level plan that calls for the country to become the industry leader 2030. \nSo-called natural language processing mimics human comprehension of words and sentences. Based on more than 500 Wikipedia articles, Stanford’s set of questions are designed to tease out whether machine-learning models can process large amounts of information before supplying precise answers to queries. \nRead: Elon Musk Says Tesla Is Developing Artificial Intelligence: ‘Will Be the Best in the World’ \n“That means objective questions such as ‘what causes rain’ can now be answered with high accuracy by machines,” Luo Si, chief scientist for natural language processing at the Alibaba institute, said in a statement. “The technology underneath can be gradually applied to numerous applications such as customer service, museum tutorials and online responses to medical inquiries from patients, decreasing the need for human input in an unprecedented way.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-15T09:14:00.000+02:00", "crawled": "2018-01-15T16:08:10.000+02:00", "highlightTitle": ""}