{"organizations": [], "uuid": "5ed6edcb78d8c3ea20a859d5e523782d2929ea46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224515303&w=1200&r=LYNXMPEE0M1B1", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-safrica-politics/south-african-graft-inquiry-stalled-as-it-awaits-terms-from-zuma-justice-idUSKBN1FC24C", "country": "US", "domain_rank": 408, "title": "South African graft inquiry stalled as it awaits terms from Zuma: justice", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-23T23:53:00.000+02:00", "replies_count": 0, "uuid": "5ed6edcb78d8c3ea20a859d5e523782d2929ea46"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-safrica-politics/south-african-graft-inquiry-stalled-as-it-awaits-terms-from-zuma-justice-idUSKBN1FC24C", "ord_in_thread": 0, "title": "South African graft inquiry stalled as it awaits terms from Zuma: justice", "locations": [], "entities": {"persons": [{"name": "zuma", "sentiment": "negative"}, {"name": "raymond zondo", "sentiment": "none"}, {"name": "jacob zuma", "sentiment": "none"}, {"name": "zondo", "sentiment": "none"}], "locations": [{"name": "johannesburg", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "democratic alliance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG (Reuters) - South Africa’s judiciary is unable to start an inquiry into alleged corruption because President Jacob Zuma is yet to provide terms of reference, the enquiry’s head said on Tuesday.\nThe two-week delay is fresh evidence that Zuma wants to stall the investigation, said the opposition Democratic Alliance, which has previously accused Zuma of corruption.\nZuma established the inquiry into charges by the opposition, civil society and members of the ruling party that individuals including business associates of Zuma unduly influenced state tenders and cabinet appointments. Deputy Chief Justice Raymond Zondo was chosen on Jan. 9 to lead it.\n“The commission is still waiting for the terms of reference to be finalised. The presidency is working on them,” Zondo told reporters. “I have no doubt that that is being attended to with the urgency that it requires.”\nZuma tried to block the inquiry but a high court last month ordered him to establish one.\nThe presidency did not respond to a request for comment.\nZuma’s supporters say any investigation should cover the undue influence all private business has over government, with a focus on firms owned by white South Africans who have dominated the economy for decades.\nThe ruling African National Congress (ANC) said on Monday it is in the process of deciding whether to cut short Zuma’s tenure as head of state. Zuma took power in 2009 but is due to step down after elections next year.\nZuma’s power has waned since Deputy President Cyril Ramaphosa succeeded him as ANC leader last month, putting him in pole position to become national leader at elections next year and shifting attention to the succession.\nRamaphosa has made it a priority to fight government corruption, accusations of which have marked Zuma’s tenure.\nIn 2016, the public protector, a constitutionally-mandated anti-graft body, recommended a judicial inquiry be established to further probe her findings about the undue influence the Gupta family wielded over Zuma and his government.\nThere is a fierce debate among politicians and the South African public over what the long-awaited inquiry should cover.\nZuma’s opponents say it must focus on the role of his friends, the Gupta brothers, who own several companies that have large contracts with state-owned companies.\nThe opposition says Ajay, Atul and Rajesh Gupta secured senior cabinet positions for politicians in Zuma’s government and paid kickbacks to win contracts worth hundreds of millions of dollars.\n“Zuma announced the establishment of a commission of inquiry at a time when he was under pressure but ... he has little intention of following through,” Democratic Alliance Federal Council Chairperson James Selfe said in a statement\n“His (Zondo) press conference was little more than a cry for help, letting South Africa know that the Judiciary’s hands are tied,” Selfe said.\nZuma and the Guptas deny wrongdoing and say they are victims of a witch hunt.\nEditing by Joe Brock and Matthew Mpoke Bigg\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T23:53:00.000+02:00", "crawled": "2018-01-23T20:40:50.056+02:00", "highlightTitle": ""}