{"organizations": [], "uuid": "1057c91837bba40b256413e8f4b89a58dde5516f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225525012&w=1200&r=LYNXMPEE0P10F", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-banks-accounting/growing-credit-card-conundrum-fuels-british-bank-concerns-idUKKBN1FF23Z", "country": "US", "domain_rank": 408, "title": "Growing credit card conundrum fuels British bank concerns", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:54:00.000+02:00", "replies_count": 0, "uuid": "1057c91837bba40b256413e8f4b89a58dde5516f"}, "author": "", "url": "https://uk.reuters.com/article/uk-banks-accounting/growing-credit-card-conundrum-fuels-british-bank-concerns-idUKKBN1FF23Z", "ord_in_thread": 0, "title": "Growing credit card conundrum fuels British bank concerns", "locations": [], "entities": {"persons": [{"name": "emma rumney", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "prudential regulation authority", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 3:55 PM / Updated 4 hours ago Growing credit card conundrum fuels British bank concerns Emma Rumney 5 Min Read \nLONDON (Reuters) - Britain’s banks are booking future credit card income long before it materialises, prompting concerns about the accounting practice among regulators, investors and analysts. \nRiskier products such as credit cards have become more popular among banks in search of higher returns in recent years. In the first nine months of 2017, cards brought in 1.5 billion pounds ($2.1 billion) in income for Barclays alone. \nBut how banks account for interest earned on zero percent balance cards, which attract consumers with sometimes long initial interest-free periods, is worrying some. Britain’s Prudential Regulation Authority warned that if banks are wrong about how customers will behave it could hit their capital. \nFor as competition has increased, so too has the length of interest-free periods on offer, with the longest available now 38 months, compared to 15 months ten years ago, data from price comparison website Moneyfacts showed. \nBanks start booking interest income immediately after issuing the card, even though some customers may not pay any for years and could switch banks at the end of the interest-free period, before rates which can be as high as 20 percent kick in. \nBarclays, Lloyds Banking Group and Virgin Money have all offered such deals, while Royal Bank of Scotland, one of Britain’s major lenders, does not. \n“The issue with this is it’s really, really subjective, because ultimately there are so many assumptions,” a fund manager at a top ten investor in some of Britain’s biggest banks told Reuters. \n“It’s a challenge for us in terms of evaluating who is prudent and who is not,” the fund manager added. \nUnder international accounting rules, banks predict how much income the card will earn in total, and then spread this out equally over the years they expect it to be active. \nForecasts are based on assumptions the banks set themselves, including how many customers they think will continue to use the cards after the interest-free period ends and for how long. \nInterest income can also include upfront fees and interest charged on additional purchases. UNCERTAIN ASSUMPTIONS \nCredit card debt, which stood at 70 billion pounds as of November, has played a big part in rapid consumer debt growth of around 10 percent per year in Britain. \nSome analysts and investors started questioning the banks with the most exposure to zero balance transfer cards last year. \nVirgin Money books the interest income for its cards at a rate of 6.8 percent per year, assuming that more than 40 percent of its customers will move to higher interest rates and use the card for a maximum of seven years in total. \nThis compares to less than or about 5 percent per year at Barclays and Lloyds respectively. \nJohn Cronin, head of UK banks research at stockbrokers Goodbody, said Virgin Money’s net interest margin - a key measure of profitability - could be hit if it turns out its assumptions are wrong. \nAt Lloyds and Barclays, the effects would be smaller. \nVirgin Money says people use its cards for spending more often, which is why it books more interest income. \n“It’s a very significant portion of our book - high double digit percentages - using their card every day,” its Chief Executive Jayne-Anne Gadhia told Reuters. VIRGIN THE MOST EXPOSED \nWhile interest-free periods offered by banks have dropped back from a 43 month high in 2017, the fee charged for transferring debts onto a new card has now fallen to its lowest since 2006, Moneyfacts data shows. \nThis means it is cheap and easy for creditworthy consumers to move their debts around to take advantage of the best deals, something the Financial Conduct Authority found to be common as long ago as 2014, when one in five people who acquired a new card had also made a balance transfer between 2012 and 2013. \nBarclays and Lloyds do not reveal the percentage of consumers they predict will switch. But in October last year Barclays, which declined comment, said it had booked 40 million pounds in unearned income. \nLloyds has recognised around 50 million pounds. \nOne source familiar with the matter said this was prudent, because the figure is small compared to its balance sheet and revenues. \nVirgin Money has around 124 million pounds in unearned income on its smaller balance sheet. But just 60 percent of credit card income booked in the first half of 2017 was actually earned. \nGadhia said Virgin Money bases its assumptions about customer behaviour on 15 years of data and pointed to FCA research showing that borrowing on zero balance transfer cards is largely by people with high credit scores. \nBut Cronin said these people are also those most likely to switch quickly before high rates kick in. \n($1 = 0.7015 pounds)", "external_links": [], "published": "2018-01-26T17:54:00.000+02:00", "crawled": "2018-01-26T18:21:17.011+02:00", "highlightTitle": ""}