{"organizations": [], "uuid": "4a65453924feab329d6e9fd89cf2fe5acd70cffd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-driven-inc-acquires-staffing-provider-update-legal.html", "country": "US", "domain_rank": 767, "title": "Driven Inc. Acquires Staffing Provider Update Legal", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T19:52:00.000+02:00", "replies_count": 0, "uuid": "4a65453924feab329d6e9fd89cf2fe5acd70cffd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-driven-inc-acquires-staffing-provider-update-legal.html", "ord_in_thread": 0, "title": "Driven Inc. Acquires Staffing Provider Update Legal", "locations": [], "entities": {"persons": [{"name": "ozzy jimenez", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}], "organizations": [{"name": "inc.", "sentiment": "negative"}, {"name": "driven inc", "sentiment": "neutral"}, {"name": "driven inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FALLS CHURCH, Va., Jan. 29, 2018 /PRNewswire/ -- Driven, Inc., an end-to-end eDiscovery and data management solutions provider, is proud to announce the acquisition of Update Legal, a legal staffing company founded in 1970. The combined company will now be able to offer law ﬁrms and corporate counsel one provider for software, services, consulting and staffing across the data lifecycle. This includes dynamic technology and staffing solutions for information governance, eDiscovery, managed services, and managed document review.\n\"The integration of Update Legal into our suite of services allows us to offer an even more complete eDiscovery solution,\" says Ozzy Jimenez, CEO of Driven Inc. \"Update Legal has been a market leader in legal staffing for nearly half a century, and the experience and talent they bring to the Driven family will be invaluable to our current and prospective client base.\"\n\"We are extremely excited about joining the Driven portfolio of companies,\" says April Pish, CEO of Update Legal. \"The ability to offer Driven's expansive suite of eDiscovery solutions to our existing client base gives us the opportunity to better serve the needs of our customers. In addition, joining Driven gives us a strong parent company that extends our business expertise and industry knowledge to help Update continue to evolve.\"\nAbout Driven, Inc.:\nFounded in 2001, Driven is a leader in eDiscovery and data management due to its ability to overcome the complexities of working with large and complex data sources.\nAs a technology company, Driven is able to engineer creative solutions to challenges not addressed by existing software products. With a focus on maximizing efficiency, ﬂexibility, scalability, and automation in eDiscovery, Driven leverages best-of-breed technology to reduce the cost and risk associated with large data volumes. This enables law ﬁrms and corporations to interface with one provider for data management through discovery.\nAbout Update Legal:\nUpdate, Inc. ﬁrst opened its doors to the staffing world in 1970, building its reputation on delivering the best temporary staffing talent while providing unparalleled service. Since establishing Update Legal in 1991, we've serviced AM Law 100 ﬁrms and Fortune 500 companies across the country with the ﬁnest paralegals and attorneys, as well as delivered high-quality and efficient managed reviews to our customers. We pride ourselves on our history and the vast experience it has provided us, as well as having human capital dedicated to constantly exercising responsiveness and forethought to ensure our customers' success on every project.\nView original content with multimedia: http://www.prnewswire.com/news-releases/driven-inc-acquires-staffing-provider-update-legal-300589573.html\nSOURCE Driven Inc.", "external_links": ["http://www.prnewswire.com/news-releases/driven-inc-acquires-staffing-provider-update-legal-300589573.html"], "published": "2018-01-29T19:52:00.000+02:00", "crawled": "2018-01-29T20:56:22.001+02:00", "highlightTitle": ""}