{"organizations": [], "uuid": "e5ccb2d8dc68501e9cd2db13ba002da1ea61a44e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943165-GettyImages-896516460.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/12/south-africa-rand-rally-hit-by-jacob-zuma.html", "country": "US", "domain_rank": 767, "title": "South Africa rand rally hit by Jacob Zuma", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T17:06:00.000+02:00", "replies_count": 0, "uuid": "e5ccb2d8dc68501e9cd2db13ba002da1ea61a44e"}, "author": "Justina Crabtree", "url": "https://www.cnbc.com/2018/01/12/south-africa-rand-rally-hit-by-jacob-zuma.html", "ord_in_thread": 0, "title": "South Africa rand rally hit by Jacob Zuma", "locations": [], "entities": {"persons": [{"name": "cyril ramaphosa", "sentiment": "positive"}, {"name": "jacob zuma", "sentiment": "positive"}, {"name": "ramaphosa", "sentiment": "none"}, {"name": "zuma", "sentiment": "none"}, {"name": "james lockhart smith", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "anc", "sentiment": "none"}, {"name": "african national congress", "sentiment": "none"}, {"name": "cnbc africa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The South African rand has rallied since businessman-turned-politician Cyril Ramaphosa won the leadership of the ruling African National Congress (ANC), but investors' hopes that this signified the end of corruption associated with embattled President Jacob Zuma may be dashed.\nThe dollar has fallen 7 percent against the South African rand since Ramaphosa won the ANC leadership contest on December 18.\nBut, \"the positive market reaction to Ramaphosa's win – which still leaves the rand way below where it was a few years ago – has gone as far as it is likely to,\" James Lockhart Smith, head of financial sector risk at consultancy Verisk Maplecroft, told CNBC via e-mail Wednesday.\nRumors concerning Zuma's future are rife.\nCNBC Africa, citing unnamed sources, reported on Friday that the ANC leadership is trying to negotiate an exit deal for the president, aiming for a \"pleasant walk away\" despite hundreds of corruption charges against him. This is to pacify his supporters within the party.\nshow chapters ANC leadership trying to work an exit deal for Zuma: Sources 8 Hours Ago | 02:36 But, the ANC's National Executive Committee met for the first time Wednesday since the party's leadership election, at which it emerged that Zuma's position was not discussed . Contrary to mounting speculation, \"the matter was not for any discussion or debate,\" ANC Secretary-General Ace Magashule told reporters, according to Reuters.\nReflective of the rand's political sensitivity, the currency rallied one percent Tuesday following unconfirmed reports that Zuma had been ousted.\nPiotr Matys, emerging market strategist at Rabobank, warned that ousting Zuma could also cause trouble for the South African currency, saying that: \"The governing ANC could be engulfed in political bickering between Zuma's camp and members of the party who voted for Ramaphosa.\"\n\"If such negative scenario unfolds, optimism among investors may fade leaving the rand vulnerable to a round of profit taking,\" he told CNBC via e-mail Friday.\nshow chapters South Africa is in crisis, but that opens up financial opportunity in some sectors: Expert 8 Hours Ago | 02:57 \"South Africa is poorly positioned relatively to many other emerging markets vis-a-vis the gradually tightening external environment, which will inevitably exert downward pressure as well,\" Lockhart Smith added.\nThe ANC is currently meeting in East London ahead of its 106th birthday on January 13.\n\"Jacob Zuma's removal as president is an increasingly urgent priority for the new ANC leader Cyril Ramaphosa,\" Ben Payton, head of Africa at Verisk Maplecroft, wrote in a note Tuesday. But, he added that \"the details of the power transfer, however, are likely to prevent Ramaphosa from implementing much of his own agenda, at least until after 2019.\"\nSouth Africa opportunities South Africa is in \"crisis,\" but \"ironically that opens up opportunities in certain sectors,\" Anna Rosenberg, director for sub-Saharan Africa at Frontier Strategy Group, told CNBC Friday.\nMasi Losi | The Times | Gallo Images | Getty Images South African President Jacob Zuma, Nkosazana Dlamini-Zuma, Deputy President Cyril Ramaphosa and Zweli Mkhize during the African National Congress' policy conference on July 5, 2017, in Johannesburg, South Africa. The country, which faces \"several huge infrastructure challenges\" including a lack of electricity and water in some areas, means that \"mining companies and the coal sector are doing quite well because there is a lot of money going into electricity generation,\" she explained.\nReflective of short-term optimism on Ramaphosa's potential as a reformer, South Africa's business confidence index rose for the second month in a row in December, it was announced Wednesday.\nBut regardless of the hope he may instill in voters and investors, South Africa's problems will \"take several years to address,\" Rosenburg added, citing high unemployment and a \"huge skills deficit\" due to an ill-adapted education system.\nNonetheless, South Africa is \"such a large market\" meaning that it is \"too important to ignore,\" she argued.", "external_links": [], "published": "2018-01-12T17:06:00.000+02:00", "crawled": "2018-01-12T17:29:17.002+02:00", "highlightTitle": ""}