{"organizations": [], "uuid": "cafd4c05e88a0530238a5150a786b000874dbc75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-brazil-china-investment/china-investment-in-brazil-hit-seven-year-high-in-2017-idUSKBN1F7387", "country": "US", "domain_rank": 408, "title": "China investment in Brazil hit seven-year high in 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-19T06:29:00.000+02:00", "replies_count": 0, "uuid": "cafd4c05e88a0530238a5150a786b000874dbc75"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-brazil-china-investment/china-investment-in-brazil-hit-seven-year-high-in-2017-idUSKBN1F7387", "ord_in_thread": 0, "title": "China investment in Brazil hit seven-year high in 2017", "locations": [], "entities": {"persons": [{"name": "didi chuxing", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "brasilia", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "são simão", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "state power investment corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRASILIA (Reuters) - China invested $20.9 billion in Brazil in 2017, the most since 2010 as a recession helped push down asset prices and attracted investors, according to Brazil’s planning ministry.\nThe energy, logistics and agriculture sectors drew the most Chinese capital, including investments in Brazil’s rich pre-salt oil fields and China’s State Power Investment Corp $2.25 billion deal to operate the São Simão hydropower plant.\nThe 2017 investment figure considers confirmed and announced investments, but does not include marquee deals like Chinese ride-hailing heavyweight Didi Chuxing’s purchase of a controlling stake in Brazilian competitor 99, as the private companies did not disclose the size of the deal.\nChinese investment has poured into Brazil in recent years as the world’s most populous country looks to secure food for its citizens and other natural resources.\nThe Brazilian government expects Chinese investment to continue increasing this year as asset prices remain low after the recession that ended last year but economic growth picks up.\n“Brazil has much less investment than we need ... we need foreign investors,” Jorge Arbache, vice planning minister for international affairs, said in an interview.\nThis year’s most wide open elections in decades are unlikely to slow Chinese investment, he said.\n“When we talk to the Chinese about it being an election year, a year with a strong political component, the Chinese show each time that they have a longer-term vision for Brazil,” Arbache said. “It’s unlikely they’ll reduce their presence.”\nA bilateral fund launched in 2017 to direct $20 billion in financing from state-owned Chinese and Brazilian banks will consider backing for the first batch of project applications at the end of January, an initiative aimed at pushing up Chinese investment in Brazil.\nThe fund focuses on railways and infrastructure to help bring grains to port as China is the dominant buyer of Brazilian soy, but also considers manufacturing, technology and agricultural pitches.\nThe first batch of four pitches will be considered at a meeting at the end of January, with the fund having already received 29 proposals, said Arbache, who is executive secretary of the fund. Those approved will be fast-tracked for evaluation by the banks.\n”If at the end of 2018, five projects have been approved, I think it will be very good for the first year,“ Arbache said. ”With the learning process, it’s possible that next year there will be even more approvals.\n($1 = 3.2136 reais)\nReporting by Jake Spring\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T06:29:00.000+02:00", "crawled": "2018-01-19T00:41:47.037+02:00", "highlightTitle": ""}