{"organizations": [], "uuid": "c6ef501e3e6d0191d6cbffe20344e1c17dd88573", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104960706-GettyImages-528555486.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/23/asean-need-to-increase-cybersecurity-spending-says-new-report.html", "country": "US", "domain_rank": 767, "title": "ASEAN need to increase cybersecurity spending, says new report", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T04:19:00.000+02:00", "replies_count": 0, "uuid": "c6ef501e3e6d0191d6cbffe20344e1c17dd88573"}, "author": "Saheli Roy Choudhury", "url": "https://www.cnbc.com/2018/01/23/asean-need-to-increase-cybersecurity-spending-says-new-report.html", "ord_in_thread": 0, "title": "ASEAN need to increase cybersecurity spending, says new report", "locations": [], "entities": {"persons": [{"name": "menon", "sentiment": "none"}, {"name": "naveen menon", "sentiment": "none"}], "locations": [{"name": "southeast asia", "sentiment": "none"}], "organizations": [{"name": "association of southeast asian nations", "sentiment": "negative"}, {"name": "asean", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "a.t. kearney", "sentiment": "none"}, {"name": "cisco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8:45 PM ET Mon, 22 Jan 2018 | 03:49 \nMember countries of the Association of Southeast Asian Nations need to significantly step up their spending on cybersecurity to tackle digital threats, according to a new report. \nNot doing so can potentially cost the top 1,000 companies in the region about $750 billion in market capitalization, and derail digital innovation. Those were some of the findings presented in a report from global consulting firm A.T. Kearney on Tuesday. \nCyber-attacks tend to be very expensive for companies — not only do they have to spend money to fix the problem, but the fallout from such an event is usually long lasting and in many cases can involve lawsuits and regulatory fines . \n\"When you have a data breach, there's a significant loss of trust,\" Naveen Menon, president for Southeast Asia at Cisco, told CNBC's \" Squawk Box \" on Tuesday. \"This loss of trust results in a direct implication on market capitalization.\" Menon explained that, on average, companies lose between 10 and 35 percent of their market cap. \nIn recent years, Southeast Asia has become a hotbed for digital growth and innovation, largely due to better internet connectivity and smartphone adoption. Last year, a study predicted the region's internet economy would reach $200 billion by 2025. \nAs more people connect to the internet, cybersecurity threats are also on the rise, according to various industry players. Those threats are becoming more complex in nature, requiring greater efforts from various stakeholders to tackle them. \n\"All of a sudden, you're starting to see economies going online and not enough spending being put in order to protect (them),\" Menon said. \"ASEAN, particularly, is under-spending relative to other countries worldwide.\" \nIn tandem with that user growth, the report said countries like Malaysia, Indonesia and Vietnam have become\"global hotspots\" for suspicious web activities. That, the reported suggested, meant hackers were using vulnerable, unsecure infrastructure in those countries to launch cyberattacks. \nThe report said that in 2017, countries on average were estimated to have spent 0.13 percent of their GDP on cybersecurity. On the other hand, ASEAN as a bloc only spent 0.06 percent, or $1.9 billion, collectively. The report noted that Singapore was the only country in the region that spent more than the global average. \nTo remedy the situation, the report recommended that ASEAN needed to increase spending on cybersecurity between 0.35 percent and 0.61 percent of its collective GDP — or about $171 billion — between 2017 and 2025. \n\"At a minimum, ASEAN should come close to the global average,\" Nikolai Dobberstein, head of communications, media and technology for Asia Pacific at A.T. Kearney, told CNBC. \nThat said, awareness of the cybersecurity challenges in the region is high, according to Yuh Woei Tan, a senior director at cybersecurity company FireEye . Tan explained that the absence of strong data breach notification laws in many ASEAN countries could explain why they tend to under-invest in cybersecurity. \n\"Elsewhere, this has spurred many firms to take action, generated greater awareness about the threats in the public's mind, and this is taking hold in ASEAN as well,\" Tan told CNBC. \nAt the same time, it's more important to observe where ASEAN governments are investing in cybersecurity, according to Dhanya Thakkar, managing director and vice president for Asia Pacific at cybersecurity company Trend Micro. \n\"Are they solving the right problems? Are they investing in the right technology? Are they forming the right partnerships? Thakkar told CNBC. \"These are the more important questions to ask.\" \nThe A.T. Kearney report recommended that ASEAN member states work together more closely to establish a regional framework around cybersecurity, share threat intelligence and address the talent shortage in the industry. Member states also need to fund more research and development into cybersecurity, the report said. \nThere are already initiatives underway to foster greater collaboration in the region. In 2016, Singapore launched a program aimed to provide more cybersecurity resources to other member states. Last November, ASEAN also said it would work together to combat cybercrime.", "external_links": [], "published": "2018-01-24T04:19:00.000+02:00", "crawled": "2018-01-24T04:29:26.010+02:00", "highlightTitle": ""}