{"organizations": [], "uuid": "836d46d338363202f698b0f1ee3e5e26002f6fc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/shutterstock_editorial_9305485a_huge.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/03/bomb-cyclone-grayson-may-bring-record-snow-to-these-southern-states/", "country": "US", "domain_rank": 1196, "title": "Bomb Cyclone Grayson May Bring Record Snow to Florida, Georgia | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.394, "site_type": "news", "published": "2018-01-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "836d46d338363202f698b0f1ee3e5e26002f6fc5"}, "author": "Sarah Gray", "url": "http://fortune.com/2018/01/03/bomb-cyclone-grayson-may-bring-record-snow-to-these-southern-states/", "ord_in_thread": 0, "title": "Bomb Cyclone Grayson May Bring Record Snow to Florida, Georgia | Fortune", "locations": [], "entities": {"persons": [{"name": "sarah gray", "sentiment": "negative"}, {"name": "grayson", "sentiment": "negative"}], "locations": [{"name": "georgia", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "charleston", "sentiment": "none"}, {"name": "savannah", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "monticello", "sentiment": "none"}, {"name": "southeast", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}, {"name": "tallahassee", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "northeast", "sentiment": "none"}], "organizations": [{"name": "national weather service", "sentiment": "none"}, {"name": "weather.com", "sentiment": "none"}, {"name": "emergency operations center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Sarah Gray January 3, 2018 \n“Bomb cyclone” Grayson is delivering freezing temperatures, sleet, ice, and snow from Maine to Florida . And while the Northeast is expected to receive the brunt of the “winter hurricane” , potentially record-breaking weather is also hitting Southeast states. \nOn Wednesday morning, Grayson delivered 0.1 inch of snow and sleet to Florida’s capital, Tallahassee, according to the National Weather Service. It was the first measurable snow there in 28 years, according to Weather.com , and led to closing parts of Interstate 10 on Wednesday morning. You can watch a video of snow in Monticello, Fla. here . \nOther southern states, including North Carolina, Virginia, Georgia and South Carolina, are also preparing for snowfall. “This could be one of the heaviest one-day snowfalls on record in both Savannah, Georgia, and Charleston, South Carolina,” Weather.com reported. Share your #TLHWinterStorm pictures with us by tagging @COTNews . Here’s what it looks like at the Emergency Operations Center. ☃️❄️☃️ pic.twitter.com/cNUYnZzpMI \n— City of Tallahassee (@COTNews) January 3, 2018 \nThe National Weather Service in Charleston tweeted that the storm had “unofficially” dropped three inches of snow, and that more is predicted. Update…had heavy snow, changed to sleet for a bit, now pouring snow. Unofficially 3” storm total at the office, huge flakes falling. 👀❄️☃️ #scwx #gawx pic.twitter.com/UfcDoJgjsA \n— NWS Charleston, SC (@NWSCharlestonSC) January 3, 2018 A band of heavy snow will push across the Charleston Tri-County area. An addition 1-2 inches may quickly accumulate by 430 PM. Visibility will fall to 1/4 mile at times. #snow #chswx #sxwx pic.twitter.com/GUXSjrEG1A \n— NWS Charleston, SC (@NWSCharlestonSC) January 3, 2018 \nFortune’s Chris Morris sent in photos of Charleston blanketed in snow. Snow falls in Charleston, South Carolina. Chris Morris \nThe Savannah/Hilton Head International Airport closed earlier on Wednesday, after one inch of snow. Some areas of Savannah and the Georgia coast received up to three inches of snow. \n“It’s been about 30 years since Savannah has had at least an inch of snow, and estimated totals are between 2 and 3 inches west of downtown Savannah,” according to Channel 2 meteorologist Brian Monahan via AJC.com. \nThe record is 3.6 inches, set in February of 1968, according to Monahan. \nAhead of the storm on Tuesday, Georgia Gov. Nathan Deal (R) declared a state of emergency in 28 counties. . @GovernorDeal has declared a State of Emergency for the counties listed below. Due to severe winter weather, please stay off the roads in these areas and continue to heed warnings from local officials. pic.twitter.com/aPGFkJ147A \n— Georgia EM&HS (@GeorgiaEMA) January 3, 2018 \nNorth Carolina Gov. Roy Cooper (D) urged state residents to stay safe considering the cold weather isn’t expected to pass until Thursday and could possibly cause power outages. He plans to declare a state of emergency for affected counties, according to the New York Times , \nMeanwhile, “blizzard-like conditions” are expected along the portions of coastal Virginia. Virginia Gov. Terry McAuliffe (D) has declared a state of emergency there. \n“The bitter cold that continues to plague the Commonwealth will be joined by a potentially significant winter storm which will blast Hampton Roads, the Northern Neck, Eastern Shore and other areas of Eastern Virginia with snowfall and blizzard-like conditions in some communities,” Gov. McAuliffe said in a statement. “With this forecast in mind, all Virginians should take the necessary precautions now to ensure they are prepared for the travel disruptions, power outages and other threats to health and safety that could arise during this significant weather event.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T02:00:00.000+02:00", "crawled": "2018-01-04T02:45:37.023+02:00", "highlightTitle": ""}