{"organizations": [], "uuid": "e4d9f620345a4a19879c29f06756dd6c73773671", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/britain-press-business/press-digest-british-business-jan-8-idUSL4N1P30UJ", "country": "US", "domain_rank": 408, "title": "PRESS DIGEST- British Business - Jan 8", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T03:11:00.000+02:00", "replies_count": 0, "uuid": "e4d9f620345a4a19879c29f06756dd6c73773671"}, "author": "", "url": "https://www.reuters.com/article/britain-press-business/press-digest-british-business-jan-8-idUSL4N1P30UJ", "ord_in_thread": 0, "title": "PRESS DIGEST- British Business - Jan 8", "locations": [], "entities": {"persons": [{"name": "carrie gracie", "sentiment": "none"}], "locations": [{"name": "sherwood forest", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "accenture plc", "sentiment": "none"}, {"name": "ineos", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 8 (Reuters) - The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.\nThe Times\nOne of the BBC's most prominent female journalists has resigned over pay inequality, accusing the broadcaster of pursuing illegal and discriminatory policies. Carrie Gracie, the corporation's China editor, becomes the first high-profile woman to leave her post in protest at what she described as its botched handling of the scandal. ( bit.ly/2CPCou7 )\nThe 49 billion pound ($66.50 billion) BT pension scheme is set to pull its administration back in-house after terminating a contract with Accenture Plc three years into an eight-year deal. ( bit.ly/2CQBrSr )\nThe Guardian\nOne of Britain's top fracking firms has been accused of misleading the public over its intent to explore for shale gas in a protected area of ancient woodland in Sherwood Forest. Ineos, a UK-based petrochemicals firm, has said publicly it would exclude sensitive areas of the legendary home of Robin Hood from its seismic surveys. ( bit.ly/2CT19G0 )\nBritain's manufacturers are more upbeat about the state of the global economy than at any time since 2014 and believe demand from overseas will sustain their businesses through another year of Brexit uncertainty, a survey has shown. ( bit.ly/2CPuh0P )\nThe Telegraph\nAccounting giant KPMG is no longer advising on the Grenfell Tower inquiry after campaigners said the government's decision to appoint the firm was a conflict of interest. ( bit.ly/2CRkHL1 )\nUBM has taken its final step from magazine publisher to events company after striking a deal to sell its last major publication, the construction industry bible Building. ( bit.ly/2CPDkP9 )\nSky News\nCarillion Plc, the troubled construction services group which is embedded in the HS2 high-speed rail link and other critical government infrastructure projects, is racing to secure new funding within weeks to avoid collapse. ( bit.ly/2CQCull )\nThe flagship global motor racing series for electric vehicles, Formula E, will this week unveil the biggest sponsorship deal in its history through a tie-up with ABB Ltd , the Swiss industrial technology giant. ( bit.ly/2CRQewj )\nThe Independent\nDecember rounded off the worst year for consumer spending across the UK since 2012, data by Visa has revealed. The payment technology company on Monday said that household spending declined by 1 per cent on an annual basis in December, following a 0.9 per cent slide in November. ( ind.pn/2CPUNHf )\n$1 = 0.7369 pounds Compiled by Bengaluru newsroom; Editing by Sandra Maler\n ", "external_links": [], "published": "2018-01-08T03:11:00.000+02:00", "crawled": "2018-01-08T03:32:09.004+02:00", "highlightTitle": ""}