{"organizations": [], "uuid": "53d54ab7ad3bbeee05d4bf432990d5861c02f3c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/vmware-best-workplaces-tech-2018.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/best-companies-tech-workplace-cultures/", "country": "US", "domain_rank": 1196, "title": "Another Reason the Tech Industry Must Become More Inclusive | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.56, "site_type": "news", "published": "2018-01-17T09:00:00.000+02:00", "replies_count": 0, "uuid": "53d54ab7ad3bbeee05d4bf432990d5861c02f3c7"}, "author": "Kim Peters", "url": "http://fortune.com/2018/01/17/best-companies-tech-workplace-cultures/", "ord_in_thread": 0, "title": "Another Reason the Tech Industry Must Become More Inclusive | Fortune", "locations": [], "entities": {"persons": [{"name": "damion i. hamilton", "sentiment": "negative"}, {"name": "kim pe", "sentiment": "negative"}, {"name": "tabitha russell wilhelmsen", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Kim Peters and Tabitha Russell Wilhelmsen 7:00 AM EST \nDespite industry efforts to create cultures where great ideas trump personal status, tech companies still suffer from workplaces with persistent outsider cultures that undercut productivity and innovation. \nIn Great Place to Work’s study of more than 79,000 tech workers surveyed to determine the 2018 Best Workplaces in Technology , we found that up to 30% of the workforce is unable to be themselves or participate as full members of their teams. This is true even at leading tech companies known for their positive workplace cultures. \nMany of the groups wrestling with being themselves at tech companies are the very groups that the industry struggles to recruit and retain. However, it’s not only women and minorities who feel like the “other” in tech. Both personal and professional characteristics—such as being disabled, outside the gender binary, or even a long-tenured hourly or part-time worker—lead to a significant portion of the workforce not bringing their whole selves to work. \nThis may seem like an inconsequential problem—but our study finds concrete cost implications to an industry whose competitiveness depends on its ability to recruit the best talent, maximize their productivity, and, above all else, constantly innovate and execute. \nWhen employees feel able to be themselves, they are: 6 times more likely to innovate 6 times more likely to recruit on behalf of their company from their peer network 5 times more likely to commit to a long-term future at their organization Twice as likely to work on highly productive teams \nThese kinds of talent and productivity returns have caught the attention of top employers. \n“The best employers in the tech space have evolved beyond improving the average experience of their workforce,” says Michael C. Bush, CEO of Great Place Work. “Instead, they are laser-focused on targeting the ‘leaks’ in their culture—eliminating experience variability across specific metrics to move the dial for the demographic groups they employ.” Leading the Way Out of Otherness \nHow do leaders help employees bring their full selves to work? \nFirst, despite the results of this study, be skeptical of initiatives that start with a cosmetic goal to “help employees be themselves.” Such efforts are unlikely to succeed. While employees who have consistently caring, friendly or fun work environments are 4 to 6 times more likely to feel they can be themselves at work, realizing full cultural belonging—and each person’s full human potential—comes from a more systemic understanding of the workplace. \nTech companies that are progressing towards workplaces that work for all use many of the following strategies: \nStart with managers. “The single most effective thing a CEO can do to accelerate the performance of their business and the strength of their workplace for all is to ensure managers at every level of the organization build the skills they need to earn people’s trust regardless of who they are,” says Bush. “Trust fuels business performance.” In a study of over 10,000 managers, Great Place to Work found 353% higher productivity, 325% greater readiness to innovate, 300% greater agility and 128% greater desire to stay from employees reporting to these trustworthy leaders. \nPay attention to fairness. Our research shows that a drop in employees’ perception of fairness often precedes a larger decline in overall workplace culture. Quickly growing tech companies are particularly at risk, as fairness experiences drop first and fastest with each doubling of company size. \nClose key experience gaps. Our research finds common areas where employers risk leaving employees out of what might otherwise be a world-class culture, depending upon who people are or what they do in the organization. For example, women are still less likely to have access to leaders and the information they need to perform their jobs, even in workplaces where communication programs are experienced positively by their male colleagues. African-Americans in the tech industry are twice as likely as their Caucasian colleagues to have had no opportunities to contribute to their organization’s innovation efforts in the last year. Middle managers frequently have a very different experience of communication and decision-making in organizations—a gap which creates significant problems for the flow of information up and down the organization. It is important to know what the specific experience anomalies exist in your organization, so you can extend the best practices you may otherwise have to all affected groups and avoid “culture leak.” \nDemonstrate humanity and humility from the top. Ultimately, employees want to know that they are seen and appreciated as people, and not just workers. Heather Brunner, CEO & Chair of WP Engine (one of the Best Workplaces in Technology) decided to remove a college degree from the company’s application requirements and to train all employees on how to read the company’s financials. This stemmed from her conviction that the company would be made stronger with a wide variety of perspectives at the table—and by leveraging the full strength of all their employees’ human potential. “One of the things I tell our team is that we’re a company of equals,” says Brunner. “The only reason that I’m CEO is just time, and different experiences I’ve had. I’m no smarter, I have no more potential. You have all those things.” \nThe rewards of such an approach are rich, for both those of us who spend our weeks at work and for the businesses who employ us: Companies that create great workplaces for all earn 3 times higher year-over-year revenue growth. \nSee the full 2018 Best Workplaces in Technology list. . \nKim Peters and Tabitha Russell Wilhelmsen are executive vice president and certification program manager, respectively, at Great Place to Work , the longtime research partner for FORTUNE’s annual list of the 100 Best Companies to Work For and other Best Workplaces lists, including the Best Workplaces in Technology . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T09:00:00.000+02:00", "crawled": "2018-01-17T14:12:46.002+02:00", "highlightTitle": ""}