{"organizations": [], "uuid": "747d967009b762ba2d28ba7136b6eec0044acf6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223056832&w=1200&r=LYNXMPEE0H18I", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-california-captives-homeschool/california-abuse-case-sparks-calls-for-home-schooling-oversight-idUSKBN1F721R", "country": "US", "domain_rank": 408, "title": "California abuse case sparks calls for home-schooling oversight", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:07:00.000+02:00", "replies_count": 0, "uuid": "747d967009b762ba2d28ba7136b6eec0044acf6f"}, "author": "", "url": "https://www.reuters.com/article/us-california-captives-homeschool/california-abuse-case-sparks-calls-for-home-schooling-oversight-idUSKBN1F721R", "ord_in_thread": 0, "title": "California abuse case sparks calls for home-schooling oversight", "locations": [], "entities": {"persons": [{"name": "chris kenning", "sentiment": "none"}, {"name": "rachel coleman", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "national center for education statistics", "sentiment": "none"}, {"name": "coalition for responsible home education", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 3:13 PM / Updated an hour ago California abuse case sparks calls for home-schooling oversight Chris Kenning 4 Min Read \n(Reuters) - Lawmakers and advocacy groups are calling for more oversight of home-schooling after a California couple using this method of education was charged with torturing their 13 children. \nThe number of U.S. children educated at home has doubled to about 1.7 million, or 3 percent of the nation’s school-age population, from 1999, according to the National Center for Education Statistics. \nEven so, most states do not require inspections or in-person testing that could help uncover abusive situations, said the Massachusetts-based Coalition for Responsible Home Education. \nMore than 380 cases of severe or fatal child neglect have occurred since 2000 in families involved in home-schooling, according to the group. \n“We would not say abuse is more common among home-schoolers, but when it does occur, there are fewer safeguards, less to stop it from spinning out of control,” said Executive Director Rachel Coleman. \nThe organization has called for requiring annual contacts by outside officials and background checks for parents who run home schools. Some home-schooling groups oppose these measures. \nDavid Turpin, a 57-year-old engineer, and his wife, Louise, will go before a judge on Thursday. They are charged with nine counts of torture and 10 counts of child endangerment in connection to their children, aged 2 to 29. \nPolice said they found the children in filthy conditions, some shackled to their beds, when a 17-year-old girl escaped and called 911. \nIn this case, the father had registered his house as the private Sandcastle Day School and listed himself as the principal. His children were the only students. \nTurpin’s parents told ABC News that the children would memorize long passages of the Bible. Neighbors said they were rarely seen outside the home. \nThe California Department of Education said it was “sickened” by the incident but, by law, it was not authorized to monitor, oversee or inspect such schools. Parents running private home schools only have to register with the state. A combination photo of David Allen Turpin (L) and Louise Ann Turpin as they appear in booking photos provided by the Riverside County Sheriff's Department in Riverside County, California, U.S., January 15, 2018. Riverside County Sheriff's Department/Handout via REUTERS \n“My first thought was: How did this many kids get lost in the system?” said Sherryll Kraizer, founder of the Coalition for Children, an advocacy group. “One of the things that was interesting was he set up his own home school so the kids were accounted for and not really seen by anybody.” \n‘LACK OF OVERSIGHT’ \nThe Virginia-based Home School Legal Defense Association said states do not mandate welfare or safety visits at home schools. \nColeman said most home-school regulations focus on educational testing, with only a few states, including New York, requiring in-person contact with educators or others. \n“I am extremely concerned about the lack of oversight the State of California currently has in monitoring private and home schools,” said Assemblyman Jose Medina, who represents Perris, the town where the Turpins live. \nThe state politician said in a statement on Wednesday that he was looking into introducing legislation for oversight but did not provide further details. \nMandatory contacts with outside health or education workers could help, Coleman said. She also said more states could adopt laws such as those in Pennsylvania, which does not allow home-schooling by those convicted of violent crimes, and Arkansas, which bars it when a registered sex offender resides in the home. \nBut Home School Legal Defense Association President Mike Smith said his association opposes new regulations. \n“Should all the innocent home-school families, who do a great job, should they be intruded upon because of this family?” he said. “I think the answer is no.” \nPast efforts to regulate home schools have faced fierce resistance from groups that in recent decades have also rolled back rules, said Chris Lubienski, an Indiana University education professor. \nMore accountability can be balanced with parental rights, Lubienski said. “I think people would agree we all have a responsibility for the kids like (the Turpins).” Reporting by Chris Kenning in Chicago; Additional reporting by Jonathan Allen in New York; Editing by Ben Klayman and Lisa Von Ahn", "external_links": [], "published": "2018-01-18T17:07:00.000+02:00", "crawled": "2018-01-18T18:06:07.000+02:00", "highlightTitle": ""}