{"organizations": [], "uuid": "4ec73de8c62ef664fc9a5a0117641eae374716fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC121_3gQdI_TOP_20180119211356.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/cmo-today-celebrities-buy-fake-followers-amazons-advertising-progress-facebook-earnings-preview-1517231318", "country": "US", "domain_rank": 387, "title": "CMO Today: Celebrities Buy Fake Followers; Amazon’s Advertising Progress; Facebook Earnings Preview", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-29T16:08:00.000+02:00", "replies_count": 0, "uuid": "4ec73de8c62ef664fc9a5a0117641eae374716fc"}, "author": "Lara O’Reilly", "url": "https://www.wsj.com/articles/cmo-today-celebrities-buy-fake-followers-amazons-advertising-progress-facebook-earnings-preview-1517231318", "ord_in_thread": 0, "title": "CMO Today: Celebrities Buy Fake Followers; Amazon’s Advertising Progress; Facebook Earnings Preview", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "facebook earnings preview", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "grammys", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Good morning. It was a huge night for R&B and hip-hop at the 60th Grammy Awards on Sunday, but what about the ads? Broadcaster CBS was reportedly seeking around $1 million for a 30-second spot . Apple aired two ads showing off its 3D “Animojis,” featuring music from nominated artists Childish Gambino and Migos. Old Spice ran a 60-second ad that was entirely in French to parody marketing from fancy fragrance houses. And off-air, Sonos closed its flagship store in New York to draw attention to its support for net neutrality, part of a wider campaign it said was timed to coincide with the Grammys.\nFake Love Most esteemed marketers would probably say social media follower counts are really just vanity metrics that don’t necessarily reflect the popularity and reach of their brands. But for celebrities and influencers, it pays to be popular. This fascinating visual feature from the New York Times details how many are paying to be popular, by purchasing fake followers to reach those important fan milestones . The feature is made all the more juicy thanks to a smattering of celebrities, politicians, sportspeople and marketing consultants who appear to have paid to amp up their online followings. Big, fake follower counts can unfairly skew things for marketers, who look at gaudy follower numbers to recruit influencers: Data collected by influencer marketing company Captiv8 suggests an influencer with 100,000 followers might earn around $2,000 for a promotional tweet, but that price can expand to around $20,000 for an account with a million followers. On Saturday, the New York attorney general opened an investigation into one of the companies allegedly peddling fake followers.\nThe Amazon Tribe Amazon’s advertising business has been quietly ticking away in the background for years. But many ad honchos see a gathering threat for Google and Facebook. At the World Economic Forum in Davos, WPP Chief Executive Martin Sorrell told CNBC that while Amazon’s $2 billion-ish ad revenue is a “paltry pimple” compared to the duopoly , it’s “growing quickly” and his firm is planning to up its spend on Amazon this year 50% to $300 million. He pointed to Amazon’s rising power in product searches, and unique ad platform. This week’s column from WSJ’s Christopher Mims takes a closer look at Amazon’s advertising offer through the lens of Jijamas , a high-end women’s pajamas brand that pays for a “sponsored” listing to be in the top of search results. The math is a no-brainer for Amazon: On top of the 15% of an item’s selling price Jijamas pays to list an item on Amazon’s marketplace and the 5-6% it pays Amazon to ship its products, a further 12% can go to advertising costs. Amazon reports its earnings on Thursday.\n—See More—\nDigiday takes a granular look at Amazon Marketing Services , the retail giant’s search marketing platform. Media-buyers say AMS has been investing more resources in educating agencies and advertisers on how to optimize their ads and results are improving. Meanwhile, Business Insider reports that analysts at Morgan Stanley predict Amazon could generate $8 billion in advertising revenue next year, but that this growth is coming from trade promotion budgets —such as in-store promotions and coupons—rather than eating into spend earmarked for Google and Facebook.\nCh-ch-ch-ch-Changes Analysts from Deutsche Bank released a hefty research note on Sunday, analyzing what Facebook’s “serious year of self-improvement” will mean for its business. Advertisers tell Deutsche that they’re “embracing” the news feed changes Facebook announced earlier this month. The rose-tinted hypothesis from the ad community is that brands might see greater engagement from consumers enjoying a more meaningful experience on the platform. “Users could see brands and advertisements even more more closely aligned with their needs and desires at a given time...potentially making for greater ad performance and thus justification for higher prices for Facebook ads,” the note reads. Deutsche estimates Facebook will report a 41.2% lift in ad revenue (not including the impact of foreign-exchange rates) to $12.4 billion in its fourth quarter, slightly ahead of the general Wall Street consensus, thanks to strong demand for its improving ad product and marketers seeing a strong return on their ad spend. Nevertheless, expect lots of soul searching and statements from executives about Facebook’s role in society on the company’s earnings call on Wednesday.\nWild Horses Wouldn’t Drag Me Away An ad agency exec and a Budweiser marketer are sitting at the bar. The ad agency exec asks: Why not the long face? I’m so sorry. Bear with me. As Super Bowl ads began landing left, right and center over the past week, we learned that some familiar mascots won’t be making an appearance on game day. As CMO Today reported, Budweiser is benching its famous Clydesdale horses for the first time since 2001. Instead, this year’s spot will focus on Budweiser’s philanthropic efforts, showing employees producing cans of emergency drinking water for victims of natural disasters in Texas, Florida, Puerto Rico and California. Coincidentally, Stella Artois is also switching beer for charitable water initiatives in a Super Bowl ad starring Matt Damon that promotes its partnership with the Water.org organization.\nBest of the rest Outcome Health says CEO Rishi Shah has resigned and the company has agreed to settle a lawsuit brought by investors, which had alleged the advertising firm defrauded them months after they had invested nearly $500 million. [ WSJ ]\nNBC said it expects to collect “close to $500 million” in Super Bowl-related ad spend and more than $900 million in ad revenue for the Winter Games. [ Adweek ]\nAnalysts at Bank of America Merrill Lynch predict there will be more years of muted growth for advertising holding companies. “Marketing spending are secularly shifting from storytelling and creativity towards technology, customer experience, data-driven and business transformation,” BAML analysts wrote in a note to clients. [ Reuters ]\nJim Kirk is to replace Lewis D’Vorkin as editor in chief of the Los Angeles Times amid tumult at the newspaper. Mr. D’Vorkin will move to the role of chief content officer at parent company Tronc. Mr. Kirk joined Tronc in August. [ New York Times ]\nAn interview with recently-retired GroupM Chief Digital Officer Rob Norman. Mr. Norman remains a consultant to the WPP media buying company. [ New York Times ]\nTwitter now lets advertisers sponsor publishers’ Moments—collections of tweets around a certain topic. [ TechCrunch ]\nYouTube recently displayed ads that secretly used visitors’ CPU and electricity to mine cryptocurrency. A Google representative said the ads were blocked in less than two hours and the malicious actors were removed from its platforms. [ Ars Technica ]\nAbout Us Follow us on Twitter: @wsjCMO , @larakiara , @VranicaWSJ , @alexbruell , @BenMullin , @srabil , @asharma\nSubscribe to our morning newsletter, delivered straight to your inbox, at http://on.wsj.com/CMOTodaySignup .\nWrite to Lara O’Reilly at lara.o'reilly@wsj.com", "external_links": ["https://twitter.com/VranicaWSJ", "https://www.nytimes.com/2018/01/27/technology/schneiderman-social-media-bots.html", "https://twitter.com/larakiara", "https://www.nytimes.com/interactive/2018/01/27/technology/social-media-bots.html", "https://twitter.com/srabil", "https://www.cnbc.com/2018/01/23/amazon-is-threatening-googles-ad-space-monopoly-wpp-ceo-martin-sorrell-says.html", "https://www.nytimes.com/2018/01/28/business/media/rob-norman-advertising.html", "https://twitter.com/BenMullin", "https://twitter.com/wsjCMO", "https://arstechnica.com/information-technology/2018/01/now-even-youtube-serves-ads-with-cpu-draining-cryptocurrency-miners", "http://www.businessinsider.com/amazons-ad-business-is-red-hot-but-no-threat-to-facebook-and-google-morgan-stanley-2018-1", "https://www.nytimes.com/2018/01/28/business/media/los-angeles-times-editor.html", "http://adage.com/article/special-report-super-bowl/2018-super-bowl-ads-released/312114/", "https://digiday.com/marketing/amazon-targeting-google-search-budgets/", "http://www.adweek.com/tv-video/how-to-make-1-4-billion-in-22-days", "http://www.adweek.com/creativity/old-spice-ran-a-baffling-ad-entirely-in-french-on-the-grammys-this-subtitled-version-explains-all/", "http://adage.com/article/special-report-super-bowl/stella-artois-super-bowl-ad-starring-matt-damon/311945/", "https://techcrunch.com/2018/01/26/twitter-now-lets-advertisers-sponsor-publishers-moments/", "https://www.theverge.com/2018/1/28/16943430/grammys-apple-animoji-karaoke-redbone-childish-gambino-migos-stir-fry", "http://www.adweek.com/brand-marketing/sonos-closes-its-flagship-store-in-new-york-to-support-net-neutrality/", "https://twitter.com/alexbruell", "https://www.reuters.com/article/us-advertising-research/baml-expects-muted-growth-at-ad-agencies-idUSKBN1FF1F6", "https://twitter.com/asharma"], "published": "2018-01-29T16:08:00.000+02:00", "crawled": "2018-01-30T01:30:34.003+02:00", "highlightTitle": ""}