{"organizations": [], "uuid": "a97021d845ee461200e693db4835d665606e50db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-annaly-capital-management-inc-announces-pricing-of-public-offering-of-series-g-fixed-to-floating-rate-cumulative-redeemable.html", "country": "US", "domain_rank": 767, "title": "Annaly Capital Management, Inc. Announces Pricing of Public Offering of Series G Fixed-to-Floating Rate Cumulative Redeemable Preferred Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-09T00:17:00.000+02:00", "replies_count": 0, "uuid": "a97021d845ee461200e693db4835d665606e50db"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-annaly-capital-management-inc-announces-pricing-of-public-offering-of-series-g-fixed-to-floating-rate-cumulative-redeemable.html", "ord_in_thread": 0, "title": "Annaly Capital Management, Inc. Announces Pricing of Public Offering of Series G Fixed-to-Floating Rate Cumulative Redeemable Preferred Stock", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Annaly Capital Management, Inc. (NYSE:NLY), a Maryland corporation, (“Annaly” or the “Company”) today announced that it has priced a public offering of an original issuance of 17,000,000 shares of its 6.50% Series G Fixed-to-Floating Rate Cumulative Redeemable Preferred Stock (the “Series G Preferred Stock”), liquidation preference $25.00 per share, for gross proceeds of approximately $425 million before deducting the underwriting discount and other estimated offering expenses. The offering is subject to customary closing conditions and is expected to close on or about January 12, 2018. The Company intends to apply to list the Series G Preferred Stock on the New York Stock Exchange under the symbol “NLYPrG.”\nIn connection with the offering, Annaly has granted the underwriters a thirty-day option to purchase up to an additional 2,550,000 shares of Series G Preferred Stock solely to cover over-allotments.\nAnnaly intends to use the net proceeds of this offering to redeem all of its outstanding 7.625% Series E Cumulative Redeemable Preferred Stock with an aggregate liquidation preference of approximately $287.5 million, plus accrued but unpaid dividends payable therewith, and partially redeem its outstanding 7.625% Series C Cumulative Redeemable Preferred Stock. Annaly intends to use the remaining net proceeds of this offering, if any, for general corporate purposes, including, without limitation, to pay down obligations and other working capital items. Annaly may also use the net proceeds to acquire targeted assets under the Company’s capital allocation policy, which may include further diversification of its investments in Agency MBS assets as well as residential, commercial and corporate credit assets. These investments include, without limitation, residential credit assets (including residential mortgage loans), middle market corporate debt, Agency MBS pools, to-be-announced forward contracts, adjustable rate mortgages, commercial real estate loans and securities and mortgage servicing rights.\nMerrill Lynch, Pierce, Fenner & Smith Incorporated, J.P. Morgan Securities LLC, Morgan Stanley & Co. LLC, RBC Capital Markets, LLC, UBS Securities LLC, Wells Fargo Securities, LLC, Citigroup Global Markets Inc. and Keefe, Bruyette & Woods, Inc. are acting as joint book-running managers for the offering.\nAnnaly has filed a shelf registration statement and prospectus with the Securities and Exchange Commission (SEC), and has filed a prospectus supplement for the offering to which this communication relates. Before you invest in the offering, you should read the prospectus supplement and the accompanying prospectus and other documents Annaly has filed with the SEC for more complete information about Annaly and the offering. You may obtain these documents for free by visiting EDGAR on the SEC website at http://www.sec.gov . Alternatively, Annaly, the underwriters or any dealer participating in the offering will arrange to send you the prospectus supplement and accompanying prospectus if you request them by contacting:\nMerrill Lynch, Pierce, Fenner & Smith Incorporated NC1-004-03-43 200 North College Street, 3rd Floor Charlotte, NC 28255-0001 Attn: Prospectus Department Email: dg.prospectus_requests@baml.com\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy shares of Series G Preferred Stock, nor shall there be any sale of these securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction.\nAbout Annaly\nAnnaly is a leading diversified capital manager that invests in and finances residential and commercial assets. Annaly’s principal business objective is to generate net income for distribution to its stockholders through capital preservation, prudent selection of investments, and continuous management of its portfolio. Annaly has elected to be taxed as a real estate investment trust, or REIT, for federal income tax purposes. Annaly is externally managed by Annaly Management Company LLC.\nForward-Looking Statements\nThis news release and our public documents to which we refer contain or incorporate by reference certain forward-looking statements which are based on various assumptions (some of which are beyond our control) and may be identified by reference to a future period or periods or by the use of forward-looking terminology, such as \"may,\" \"will,\" \"believe,\" \"expect,\" \"anticipate,\" \"continue,\" or similar terms or variations on those terms or the negative of those terms. Actual results could differ materially from those set forth in forward-looking statements due to a variety of factors, including, but not limited to, changes in interest rates; changes in the yield curve; changes in prepayment rates; the availability of mortgage-backed securities and other securities for purchase; the availability of financing and, if available, the terms of any financing; changes in the market value of our assets; changes in business conditions and the general economy; our ability to grow our commercial real estate business; our ability to grow our residential mortgage credit business; our ability to grow our middle market lending business; credit risks related to our investments in credit risk transfer securities, residential mortgage-backed securities and related residential mortgage credit assets, commercial real estate assets and corporate debt; risks related to investments in mortgage servicing rights; our ability to consummate any contemplated investment opportunities; changes in government regulations and policy affecting our business; our ability to maintain our qualification as a REIT for U.S. federal income tax purposes; and our ability to maintain our exemption from registration under the Investment Company Act of 1940, as amended. For a discussion of the risks and uncertainties which could cause actual results to differ from those contained in the forward-looking statements, see \"Risk Factors\" in our most recent Annual Report on Form 10-K and any subsequent Quarterly Reports on Form 10-Q. We do not undertake, and specifically disclaim any obligation, to publicly release the result of any revisions which may be made to any forward-looking statements to reflect the occurrence of anticipated or unanticipated events or circumstances after the date of such statements, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006838/en/\nAnnaly Capital Management, Inc.\nInvestor Relations\n1-888-8Annaly\ninvestor@annaly.com\nSource: Annaly Capital Management, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51739936&newsitemid=20180108006838&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=1&md5=d95023b4c38c1758014bad31a0d33035", "http://www.businesswire.com/news/home/20180108006838/en/"], "published": "2018-01-09T00:17:00.000+02:00", "crawled": "2018-01-09T09:40:10.215+02:00", "highlightTitle": ""}