{"organizations": [], "uuid": "530236f3ecf92659628a53661e8752b8a568f672", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-near-record-highs-after-wall-st-surge-dollar-edges-back-idUSL3N1PD01N", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Asia stocks near record highs after Wall St surge, dollar edges back", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T02:29:00.000+02:00", "replies_count": 0, "uuid": "530236f3ecf92659628a53661e8752b8a568f672"}, "author": "", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-near-record-highs-after-wall-st-surge-dollar-edges-back-idUSL3N1PD01N", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asia stocks near record highs after Wall St surge, dollar edges back", "locations": [], "entities": {"persons": [{"name": "shinichi saoshiro", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kospi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* MSCI Asia-Pacific index hits record high, Nikkei at 26-yr peak\n* Dollar index edges back from 3-year lows as euro rally sputters\n* Crude oil extends gains, gold pulls back from 4-month peak\nBy Shinichi Saoshiro\nTOKYO, Jan 18 (Reuters) - Asian stocks were near record highs on Thursday, with a rally by Wall Street supporting bullish investor sentiment, while the dollar pulled back from three-year lows as the euro’s recent rally lost steam.\nMSCI’s broadest index of Asia-Pacific shares outside Japan was 0.16 percent higher at 595.53, near the previous day’s record high of 595.80.\nAustralian stocks rose 0.2 percent, South Korea’s KOSPI added 0.6 percent and Japan’s Nikkei climbed 0.9 percent to reach its highest level since late 1991.\nU.S. stocks jumped on Wednesday and the Dow closed above 26,000 for the first time as investors’ expectations for higher earnings lifted stocks across sectors.\nOptimism over prospects for sustained strong global growth and improved corporate earning shave helped share markets rally at the start of 2018.\n“Events related to North Korea pose potential risks, but there are very few factors holding equities back at the moment,” said Junichi Ishikawa, senior FX strategist at IG Securities in Tokyo.\n“And bullish U.S. stocks, higher Treasury yields and signs of the euro’s recent surge running its course are all dollar-supportive factors,” Ishikawa said.\nThe dollar index against a basket of six major currencies was at 90.803 after pulling back overnight from a three-year low of 90.279 set earlier in the week.\nThe euro was little changed at $1.2188, slipping from a three-year peak above $1.2300 after some European Central Bank officials voiced worries about the currency’s strength. The common currency had advanced this month on expectations that the ECB would take steps towards winding back on stimulus measures to normalise monetary policy.\nThe dollar was steady at 111.320 yen after surging 0.75 percent overnight, when it bounced from a four-month low of 110.190.\nThe Australian dollar traded at $0.7973 after being nudged off a four-month high of $0.8023 the previous day.\nThe two-year Treasury yield hovered near a nine-year high of 2.051 percent reached on Wednesday on expectations the Federal Reserve will continue to tighten monetary policy this year.\nIn commodities, crude oil prices extended gains after rising the previous day ahead of the release of U.S. government data that was expected to show a ninth straight weekly drawdown in crude inventories.\nU.S. crude futures was 0.4 percent higher at $64.23 per barrel.\nSpot gold was at $1,328.10 an ounce, having pulled back from a four-month high of $1,344.43 set on Monday when the dollar was weaker.\nEditing by Simon Cameron-Moore\n ", "external_links": [], "published": "2018-01-18T02:29:00.000+02:00", "crawled": "2018-01-18T02:46:02.000+02:00", "highlightTitle": ""}