{"organizations": [], "uuid": "4b6b49d909e9bd795cc98ff3fd3102b9687a67d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224788536&w=1200&r=LYNXMPEE0N10Y", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-vietnam-dissident-flag/vietnam-jails-four-for-flying-flag-of-saigon-regime-idUKKBN1FD1HY", "country": "US", "domain_rank": 408, "title": "Vietnam jails four for flying flag of 'Saigon regime'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T13:52:00.000+02:00", "replies_count": 0, "uuid": "4b6b49d909e9bd795cc98ff3fd3102b9687a67d9"}, "author": "", "url": "https://uk.reuters.com/article/uk-vietnam-dissident-flag/vietnam-jails-four-for-flying-flag-of-saigon-regime-idUKKBN1FD1HY", "ord_in_thread": 0, "title": "Vietnam jails four for flying flag of 'Saigon regime'", "locations": [], "entities": {"persons": [{"name": "vuong thanh thuan", "sentiment": "none"}, {"name": "james pearson", "sentiment": "none"}, {"name": "nguyen nhat truong", "sentiment": "none"}, {"name": "nguyen van thuong", "sentiment": "none"}, {"name": "vuong van tha", "sentiment": "none"}], "locations": [{"name": "saigon", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "u.s.-backed republic of vietnam", "sentiment": "none"}], "organizations": [{"name": "min read  hanoi", "sentiment": "none"}, {"name": "vietnam news", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "communist party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 11:55 AM / Updated 4 minutes ago Vietnam jails four for flying flag of 'Saigon regime' James Pearson 3 Min Read \nHANOI (Reuters) - Vietnam has jailed four men for flying the flag of the U.S.-backed Republic of Vietnam, the former state that spanned the southern half of the country until it was reunified at the end of the Vietnam War in 1975, state media said on Wednesday. \nVuong Van Tha, 49, and his 28-year-old son, Vuong Thanh Thuan, were jailed for 12 and seven years each for “conducting propaganda against the state”, state-run Vietnam News said. \nTwin brothers Nguyen Nhat Truong and Nguyen Van Thuong, both 33, received six-year sentences. The four were arrested in May last year but tried on Tuesday, state media said, and will serve a further three years under house arrest upon release. \nDespite sweeping economic reform in Vietnam, and increasing openness towards social change, including gay, lesbian and transgender rights, the ruling Communist Party retains tight media censorship and does not tolerate criticism. \nVietnam News said the incident took place on April 30 last year, the anniversary of the fall of Saigon, now celebrated as “Reunification Day”. \n“Thuong and Truong came to Tha’s house, where they were instructed, together with Tha’s wife and daughter, to make the flag of the former Saigon regime,” it added. \nState media said Tha was a follower of the Hoa Hao Buddhist sect and “regularly held gatherings to illegally evangelise”. \nHe posted a record of his “anti-state activities” on Facebook, they added, using loudspeakers to “slander the authorities and the Communist Party of Vietnam”. \nThe flag, a bright yellow rectangle with three thin horizontal stripes, is used by political activists in Vietnam who oppose the Communist-controlled government in Hanoi. \nTha flew the flag from the roof of his home and the four men resisted authorities’ attempts to take it down, state media said. \nIn 2017, Vietnam arrested at least 21 bloggers and rights activists, New York-based Human Rights Watch said last week. \nAs many as 97 activists are serving prison sentences in Vietnam and 36 more are held in pre-trial detention, according to a database of the 88 Project website, which documents and advocates for Vietnamese dissidents. \nLast week, the foreign ministry released a report on human rights it said had been entrenched in a constitution adopted in 2014 that reflected the “institutionalisation of human rights in Vietnam”. \n“In recent years, Vietnam has witnessed extremely important achievements in the protection and promotion of human rights,” it said. Reporting by James Pearson", "external_links": [], "published": "2018-01-24T13:52:00.000+02:00", "crawled": "2018-01-24T14:02:09.030+02:00", "highlightTitle": ""}