{"organizations": [], "uuid": "061f2f0759db89563a1cda6d7845e7954807acb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://rdcnewscdn.realtor.com/wp-content/uploads/2018/01/new-home-construction-jan-18-1024x576.jpg", "site_section": "", "section_title": "", "url": "http://www.wsj.com/articles/u-s-housing-starts-dropped-sharply-at-the-end-of-2017-1516282327", "country": "US", "domain_rank": 387, "title": "New Home Building Dropped Sharply at End of 2017 | realtor.com®", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.994, "site_type": "news", "published": "2018-01-18T20:16:00.000+02:00", "replies_count": 0, "uuid": "061f2f0759db89563a1cda6d7845e7954807acb1"}, "author": "Sharon Nunn", "url": "http://www.wsj.com/articles/u-s-housing-starts-dropped-sharply-at-the-end-of-2017-1516282327", "ord_in_thread": 0, "title": "New Home Building Dropped Sharply at End of 2017 | realtor.com®", "locations": [], "entities": {"persons": [{"name": "ian shepherdson", "sentiment": "none"}], "locations": [{"name": "south and east", "sentiment": "none"}], "organizations": [{"name": "pantheon macroeconomics", "sentiment": "none"}, {"name": "northeast", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Wall Street Journal \nDecember also saw inclement winter weather in the South and East that likely significantly impacted home construction. The South saw housing starts drop 14.2% and the Northeast dropped 4.3% to the lowest level since May 2017. \n“Starts were always likely to correct after overshooting… But the severe weather in late December likely did extra damage, and the first half of January likely will be depressed too,” Ian Shepherdson, chief economist at Pantheon Macroeconomics, said in a note to clients. \nHousing-starts data can be volatile from month to month and can be subject to large revisions. Looking past monthly volatility, starts were up 2.4% in 2017 when compared to 2016, and permits increased 4.7% in the same period, signaling solid construction in 2017 that coincided with rising demand that has pushed up prices amid a chronic homes shortage. \nThe median sales price for existing homes hit $248,000 in November, up 5.8% from a year earlier, which is a more rapid rise than both inflation and wage growth. \nBut construction of new single-family homes appears to be ramping up at a solid pace. Permits and starts both increased by about 9% in 2017 from the previous year. \n“Should more construction come about, the much needed additional inventory will help calm home price appreciation. That would be a good trend for housing affordability,” National Association of Realtors chief economist Lawrence Yun said in a press release. \nNew residential construction hit a postrecession high in October 2016 but has trended lower since as multifamily construction has declined. It remains far below the levels reached during the years leading up to the 2008 financial crisis. \nLabor shortages, rising land costs and increasingly restrictive land-use regulations have helped create a shortage of inventory that is driving up home prices much more quickly than wages and inflation. \nStill, home builders are feeling upbeat about the housing market. The National Association of Home Builders’ Housing Market Index, which gauges home builder sentiment about the market for single-family homes, fell in January, but remained near an 18-year high. Popular Homes Based on your last search Editors' Picks ", "external_links": [], "published": "2018-01-18T20:16:00.000+02:00", "crawled": "2018-01-19T20:01:19.001+02:00", "highlightTitle": ""}