{"organizations": [], "uuid": "3bbfc98cf4d5c5d8ed166621094c54f62daf9388", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/16/104774807-Huawei_Mate_10_shadowy.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/us-lawmakers-urge-att-to-cut-commercial-ties-with-huawei-sources-say.html", "country": "US", "domain_rank": 767, "title": "US lawmakers urge AT&T to cut commercial ties with Huawei, sources say", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-16T08:07:00.000+02:00", "replies_count": 0, "uuid": "3bbfc98cf4d5c5d8ed166621094c54f62daf9388"}, "author": "Arjun Kharpal", "url": "https://www.cnbc.com/2018/01/16/us-lawmakers-urge-att-to-cut-commercial-ties-with-huawei-sources-say.html", "ord_in_thread": 0, "title": "US lawmakers urge AT&T to cut commercial ties with Huawei, sources say", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "arjun kharpal", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "u.k.  u.s.", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "huawei", "sentiment": "negative"}, {"name": "at&t", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "huawei technologies", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "china mobile", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. lawmakers are urging AT&T , the No. 2 wireless carrier, to cut all commercial ties to Chinese phone maker Huawei Technologies and oppose plans by telecom operator China Mobile to enter the U.S. market because of national security concerns, said two congressional aides.\nThe warning comes after the administration of President Donald Trump took a harder line on policies initiated by his predecessor Barack Obama on issues ranging from Beijing's role in restraining North Korea to Chinese efforts to acquire U.S. strategic industries.\nEarlier this month, AT&T was forced to scrap a plan to offer its customers Huawei handsets after some members of Congress lobbied against the idea with federal regulators, sources told\nReuters.\nThe U.S. government has also blocked a string of Chinese acquisitions over national security concerns, including Ant Financial's proposed purchase of U.S. money transfer company MoneyGram International Inc.\nThe lawmakers are also advising U.S. companies that if they have ties to Huawei or China Mobile, it could hamper their ability to do business with the U.S. government, one aide said, requesting anonymity because they were not authorized to speak publicly.\nOne of the commercial ties senators and House members want AT&T to cut is its collaboration with Huawei over standards for the high-speed next generation 5G network, the aides said.\nAnother is the use of Huawei handsets by AT&T's discount subsidiary Cricket, the aides said.\nChina Mobile, the world's biggest mobile phone operator, did not respond to requests for comment.\nAT&T declined to comment but said that it had made no decisions on 5G suppliers. U.S. lawmakers who have in the past expressed concerns about the prospect of the deal between AT&T and Huawei either declined to comment or were not immediately available.\nHuawei declined to comment but earlier this week told Reuters that it sells its equipment through more than 45 of the world's top 50 carriers and puts the privacy and security of its customers as its top priority.\nNational security experts fear that any data from a Huawei device, for example about the location of the phone's user, would be available to Chinese government intelligence services.\nIn 2012, Huawei and ZTE were the subject of a U.S. investigation into whether their equipment provided an opportunity for foreign espionage and threatened critical U.S. infrastructure — a link that Huawei has consistently denied.\n\"The next wave of wireless communication has enormous economic and national security implications. China's participation in setting the standards and selling the equipment raises many national security issues that demand strict and prompt attention,\" said Michael Wessel, a member of the U.S.-China Economic and Security Review Commission, which was set up by Congress.\nU.S. lawmakers do not want China Mobile to be given a license to do business in the United States, the congressional aides said. China Mobile applied for the license in 2011, and the application is pending before the Federal Communications Commission.\nHuawei and Chinese telecom firms have long struggled to gain a toehold in the U.S. market, partly because of U.S. government pressure on potential U.S. partners.\nTwo Republican lawmakers, Representatives Michael Conaway and Liz Cheney, introduced a bill this week that bars the U.S. government from using or contracting with Huawei or ZTE, a Chinese telecommunications and equipment and systems company.", "external_links": [], "published": "2018-01-16T08:07:00.000+02:00", "crawled": "2018-01-16T08:07:40.000+02:00", "highlightTitle": ""}