{"organizations": [], "uuid": "faad0444c1f1df486ab85bf615cba8eb21edf809", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-germany-economy-pmi/germanys-booming-private-sector-grew-strongly-in-january-pmi-idUSKBN1FD1FN", "country": "US", "domain_rank": 408, "title": "Germany's booming private sector grew strongly in January: PMI", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T19:40:00.000+02:00", "replies_count": 0, "uuid": "faad0444c1f1df486ab85bf615cba8eb21edf809"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-economy-pmi/germanys-booming-private-sector-grew-strongly-in-january-pmi-idUSKBN1FD1FN", "ord_in_thread": 0, "title": "Germany's booming private sector grew strongly in January: PMI", "locations": [], "entities": {"persons": [{"name": "phil smith", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ihs markit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - Germany’s private sector continued to grow robustly in January, propelled by both factories and services activity, a survey showed on Wednesday, suggesting a strong start to 2018 for Europe’s biggest economy.\nMarkit’s flash composite Purchasing Managers’ Index (PMI), which tracks the manufacturing and services sectors that\ntogether account for more than two-thirds of the economy, edged down to 58.8.\nThis was slightly below December’s reading of 58.9, which was the highest in more than 6-1/2 years, but it beat the consensus forecast of 58.6. The reading was above the 50 mark that separates growth from contraction for the 57th month.\n“The highlight of the latest results came from the service sector, where growth of business activity was the strongest seen for nearly seven years,” IHS Markit economist Phil Smith said.\nThe flash PMI for services jumped to 57.0 in January from 55.8 in the previous month, with business expectations reaching a level last seen in early 2011.\nThe flash reading for the manufacturing sector fell to 61.2 from December’s record 63.3 but still indicated one of the best growth performances in Germany’s goods-producing sector in more than two decades.\nThe figures showed rising inflationary pressures, with the biggest jump in nearly seven years in average prices charged for both goods and services, suggesting that businesses were able to pass on some of their growing costs to customers.\nSmith said purchasing managers were undeterred by continued political uncertainty in Germany, where a government has yet to be formed following elections in September, and rising cost pressures, showing strong optimism about the outlook for 2018.\nIHS Markit economist Chris Williamson said the survey data suggested the German economy would grow by more than 1 percent on the quarter in the first three months of 2018.\nThe survey chimed with figures released earlier this month that showed gross domestic product (GDP) grew by a calendar-adjusted 2.5 percent last year, the strongest since 2011.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T19:40:00.000+02:00", "crawled": "2018-01-25T13:15:23.016+02:00", "highlightTitle": ""}