{"organizations": [], "uuid": "4116a9bd945db8f7a9ea76357132906ebe97ac39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-leading-fi-products-and-services-provider-american-guardian-announced-2018-growth-plans-and-several-key-executive-promotions.html", "country": "US", "domain_rank": 767, "title": "Leading F&I Products And Services Provider, American Guardian, Announced 2018 Growth Plans And Several Key Executive Promotions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.35, "site_type": "news", "published": "2018-01-30T19:00:00.000+02:00", "replies_count": 0, "uuid": "4116a9bd945db8f7a9ea76357132906ebe97ac39"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-leading-fi-products-and-services-provider-american-guardian-announced-2018-growth-plans-and-several-key-executive-promotions.html", "ord_in_thread": 0, "title": "Leading F&I Products And Services Provider, American Guardian, Announced 2018 Growth Plans And Several Key Executive Promotions", "locations": [], "entities": {"persons": [], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "warrenville", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "american guardian", "sentiment": "negative"}, {"name": "american guardian warranty services, inc.", "sentiment": "neutral"}, {"name": "american guardian's compass auto vsc", "sentiment": "none"}, {"name": "american guardian group of companies", "sentiment": "none"}, {"name": "compass auto vsc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WARRENVILLE, Ill., Jan. 30, 2018 /PRNewswire/ -- American Guardian Warranty Services, Inc. (AGWS), part of the American Guardian Group of Companies, is one of the most trusted, service-focused vehicle service contract providers in the automotive, RV, powersports, marine, and commercial trucking markets across the United States. American Guardian has announced the promotion of several key executives and 2018 company growth plans including: growing its marketer base, revenue, service team, and improved Compass Auto VSC program.\nWith a 30% revenue increase in the last five years, American Guardian plans to expand in 2018 by increasing its marketer base with a 25% addition to its agency base, as well as continuing the double-digit growth in revenues that it has had for the last seven years. The company also continues to enhance and expand its service team at the corporate office, the East Coast sales office, and in the field.\nAs an already successful and attractive product, American Guardian's Compass Auto VSC program will undergo a significant rebrand for the company in 2018 with improved eligibility, coverage, and value. The product will grow in its appeal to dealers looking for a long-term partner that can provide value and support to their businesses.\n\"Since our company was founded 20 years ago, American Guardian has been proud to offer a full suite of F&I products that provide excellent coverage and value, while allowing for higher profitability for dealerships,\" said Jon A. Anderson, President & COO of American Guardian. \"Extended service contracts, appearance protection, warranty protection, and tire and wheel coverage are just some of the products that American Guardian offers. We also provide reinsurance services, capital advance, and e-rating for products to help dealers become more profitable and productive.\"\nIn 2018, American Guardian has announced the following executives with significant promotions to further its mission for outstanding growth and expansion. In addition to expanding its service offerings and revenue, the company grew its staff by 36% since 2016, and hired 32 new employees in 2017.\nJon Anderson has been named President and Chief Operating Officer of American Guardian Warranty Services, Inc. Anderson started as the first sales person for the company in 1998. Since 2011, Anderson has overseen the national sales and marketing teams as Senior Vice President of Sales and Marketing, with record growth, expansion of the sales team, and updated processes. Anderson takes on this new challenge with great enthusiasm for growth and innovation in the industry. Ric Simmons has been appointed to Executive Vice President and Chief Financial Officer of American Guardian Warranty Services, Inc. Simmons joined the American Guardian Group of Companies in 2004 as Chief Financial Officer with an extensive background in public accounting. Simmons was promoted in 2011 to Senior Vice President and Chief Financial Officer. Dan Lievrouw has been named Executive Vice President and Chief Information Officer, as well as President of American Guardian Systems, Inc. Lievrouw has overseen the IT operations since joining American Guardian in 2008. His role was expanded in 2011 with a promotion to Vice President of IT and Operations. This new promotion will allow Lievrouw to continue to develop opportunities and technology tools that have been instrumental in American Guardian's growth. The ongoing evolution in dealerships' technology has increased opportunities for American Guardian's continued expansion of services that the company provides. Matt Weil has been the legal counsel for American Guardian Group of Companies since 2006. In 2011, he became Vice President and General Counsel managing all corporate litigation, contracts, compliance and state filings, and other legal matters affecting the company. As the company has grown, his role has expanded as well. In 2018, Matt will be promoted to Senior Vice President, General Counsel, and Corporate Secretary. John Wendt has been appointed to Senior Vice President of Claims and Underwriting for American Guardian. Wendt has overseen the call center of American Guardian since its inception in 1998. In 2011, Wendt's role was expanded to include underwriting with his promotion to Vice President of Claims and Underwriting. Since then, his role has evolved as the company's services and support teams have increased in size over the last couple of years. With over 35 years in the industry, Wendt has continually provided expertise and steady guidance to the increasingly demanding call center. This new promotion will continue to oversee the busy claims area, while allowing Wendt to assist the company in other areas. One of the new hires in 2017 was Jim Fisher, Assistant Vice President of Dealer Programs. Fisher's role is to find, analyze, and recommend programs that American Guardian's agents can market to their dealership customers, to help their automotive, RV, powersports, marine, and commercial trucking dealerships sell more vehicles. Fisher was a nine-time winner of the Chrysler Award of Excellence and won the coveted President's Award for Ford Motor Company. Fisher has trained over 7,000 automotive salespeople over the course of his career, having over forty years of experience in the automotive industry, and over twenty years as a dealer principal.\n\"We offer great products and services at American Guardian,\" said Jon A. Anderson, President & COO of American Guardian. \"I believe that American Guardian will lead the industry by offering unparalleled service, focusing on continuous improvement, and not only meeting, but exceeding the expectations of our partners and customers.\"\nAbout American Guardian Warranty Services, Inc.\nHeadquartered just outside of Chicago, Illinois, AGWS is an innovative provider of administration services for dealers and marketers offering vehicle service contracts, limited warranties, and a variety of environmental and aftermarket products across the United States. Since its inception in 1998, the goals of AGWS are to offer superior claim processing, exceptional customer service, and unmatched profitability options. AGWS is part of the American Guardian Group of Companies and enjoys an A+ rating with the Better Business Bureau. Products are insured by A-Rated (Excellent) carriers. For more information, visit www.agwsinc.com or the AGWS University at www.agwsu.com .\nMedia Contact:\nNorth 6 th Agency, Inc. (For American Guardian)\n416-270-6034 ext. 2001, agws@n6a.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/leading-fi-products-and-services-provider-american-guardian-announced-2018-growth-plans-and-several-key-executive-promotions-300590345.html\nSOURCE American Guardian Warranty Services, Inc.", "external_links": ["http://www.agwsinc.com/", "http://www.agwsu.com/", "http://www.prnewswire.com/news-releases/leading-fi-products-and-services-provider-american-guardian-announced-2018-growth-plans-and-several-key-executive-promotions-300590345.html"], "published": "2018-01-30T19:00:00.000+02:00", "crawled": "2018-01-30T20:49:17.029+02:00", "highlightTitle": ""}