{"organizations": [], "uuid": "44e4b4b4f57292cf9fab07b661bf0c00f0034164", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-global-x-promotes-luis-berruga-to-president-and-expands-senior-management-team.html", "country": "US", "domain_rank": 767, "title": "Global X Promotes Luis Berruga to President and Expands Senior Management Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.153, "site_type": "news", "published": "2018-01-25T19:40:00.000+02:00", "replies_count": 0, "uuid": "44e4b4b4f57292cf9fab07b661bf0c00f0034164"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-global-x-promotes-luis-berruga-to-president-and-expands-senior-management-team.html", "ord_in_thread": 0, "title": "Global X Promotes Luis Berruga to President and Expands Senior Management Team", "locations": [], "entities": {"persons": [{"name": "luis berruga", "sentiment": "negative"}, {"name": "bruno del ama", "sentiment": "none"}, {"name": "chang kim", "sentiment": "none"}, {"name": "berruga", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "global x management company llc", "sentiment": "negative"}, {"name": "head of portfolio management & portfolio administration", "sentiment": "none"}, {"name": "global x", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 25, 2018 /PRNewswire/ -- Global X Management Company LLC (Global X), the New York-based provider of exchange-traded funds (ETFs), today announced the promotions of Luis Berruga to President and Chang Kim to Senior Vice President, Head of Portfolio Management & Portfolio Administration. Mr. Berruga's new official title will be President & COO.\nMr. Berruga joined Global X in 2014 as Chief Operating Officer, and in 2015 he took on the additional role of Chief Financial Officer. In his previous role, Mr. Berruga led all operational and financial aspects of the business, and was directly involved in planning and executing firm strategy. As President & COO, Mr. Berruga's role will expand to include the day-to-day management of all aspects of the business by taking on the oversight of Sales, Marketing, Product, Legal and Compliance. He will continue to report to Bruno del Ama, who will take the role of Chairman in addition to his current role as CEO of Global X.\nMr. Kim, one of Global X's first employees, has led the implementation of all operational aspects of Global X's portfolio management and administration infrastructure. In his new role, Mr. Kim will join the executive team in directing the firm's strategy. He will continue to report to Global X's new President & COO, Luis Berruga.\n\"I am thrilled to announce these promotions during a period of tremendous growth for our organization,\" said Bruno del Ama, Chairman & CEO. \"Luis and Chang have been instrumental in helping build Global X to this point, and I look forward to their leadership in their expanded roles.\"\nABOUT GLOBAL X\nSeeking to provide access to high-quality and cost-efficient investment solutions, Global X is a New York-based sponsor of exchange-traded funds (ETFs). Founded in 2008, Global X is distinguished by its Thematic Growth, Income and International ETFs. Global X is recognized as a leader in providing intelligent investment solutions for its shareholders.\nDISCLOSURE\nInvesting involves risk, including the possible loss of principal.\nCarefully consider the Funds' investment objectives, risk factors, charges, and expenses before investing. This and additional information can be found in the Funds' summary or full prospectus, which may be obtained by calling 1-888-GX-FUND-1 (1.888.493.8631), or by visiting www.globalxfunds.com . Please read the prospectus carefully before investing.\nGlobal X Management Company, LLC serves as an advisor to the Global X Funds. The Funds are distributed by SEI Investments Distribution Co. (SIDCO, 1 Freedom Valley Drive, Oaks, PA, 19456), which is not affiliated with Global X Management Company, LLC.\nView original content with multimedia: http://www.prnewswire.com/news-releases/global-x-promotes-luis-berruga-to-president-and-expands-senior-management-team-300588336.html\nSOURCE Global X Funds", "external_links": ["http://www.prnewswire.com/news-releases/global-x-promotes-luis-berruga-to-president-and-expands-senior-management-team-300588336.html", "http://www.globalxfunds.com/"], "published": "2018-01-25T19:40:00.000+02:00", "crawled": "2018-01-25T20:35:53.064+02:00", "highlightTitle": ""}