{"organizations": [], "uuid": "2de5773acb60120468078940e7d6577ffa442b34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/pwc-india-sebi/update-1-pwc-to-fight-indian-audit-ban-to-limit-franchise-impact-idUSL4N1P62L4", "country": "US", "domain_rank": 408, "title": "UPDATE 1-PwC to fight Indian audit ban to limit franchise impact", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:16:00.000+02:00", "replies_count": 0, "uuid": "2de5773acb60120468078940e7d6577ffa442b34"}, "author": "", "url": "https://www.reuters.com/article/pwc-india-sebi/update-1-pwc-to-fight-indian-audit-ban-to-limit-franchise-impact-idUSL4N1P62L4", "ord_in_thread": 0, "title": "UPDATE 1-PwC to fight Indian audit ban to limit franchise impact", "locations": [], "entities": {"persons": [{"name": "abhirup roy", "sentiment": "none"}, {"name": "ramalinga raju", "sentiment": "none"}, {"name": "devidutta tripathy", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "satyam", "sentiment": "none"}, {"name": "satyam computer services", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "securities and exchange board of india", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sebi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Corrects spelling of repercussions in cross head)\n* SEBI bars PwC arm from auditing listed firms for 2 years\n* SEBI order part of probe into Satyam accounting fraud\n* Clients may switch to rivals even if order halted -analyst\nBy Abhirup Roy and Devidutta Tripathy\nMUMBAI, Jan 11 (Reuters) - Price Waterhouse will contest a two-year auditing ban by India’s market regulator over a fraud nearly a decade ago at a company it audited, but even if it succeeds in preventing the move Indian business experts expect damage to the auditor’s business.\nThe firm, which audited software services exporter Satyam Computer Services during the period in which the $1 billion fraud took place, said it was disappointed by Wednesday’s Securities and Exchange Board of India 108-page order.\nSatyam founder and former chairman Ramalinga Raju stunned Indian markets and investors in 2009 when he admitted that it had overstated earnings and assets for several years, in a fraud sometimes referred to as “India’s Enron”.\nThere was no “intentional wrongdoing by PW firms in the unprecedented management perpetrated fraud”, Price Waterhouse said in a statement after the SEBI order, adding that it had “learnt the lessons of Satyam” and invested heavily to build a high-quality audit practice.\nExperts, however, said even if Price Waterhouse manages to get a court to issue a stay order on the SEBI ban, it faces the risk of losing clients. In India, court processes often take years and there could be multiple courts involved.\n“Listed companies who are being audited may think of moving to other auditors due to the uncertainty, even if Price Waterhouse manages to get a stay order,” said Shriram Subramaniam, who is founder of proxy advisory InGovern.\nHe said he expected the SEBI order to potentially impact 20-30 percent of PwC’s Indian revenues and benefit its rivals.\nPrice Waterhouse’s India network is made up of 11 chartered accountant firms with about 3,000 employees, and has around 75 listed companies as clients, a PW spokesman said.\nThese include Tata Steel and Piramal Enterprises , which did not immediately respond to requests for comment on the SEBI action.\nGLOBAL REPERCUSSIONS? In India, all audit functions within the group are conducted under the Price Waterhouse (PW) brand, with a network of local firms operating under the banner. The broader PwC entity handles consulting, tax advisory and other businesses.\nThere could also be a knock-on effect on PwC’s businesses in other parts of the world, said Pratibha Jain, a partner at law firm Nishith Desai Associates.\n“They might lose a lot of business on the other sides, not just audit, and they have to report it in other jurisdictions. It’s a global conglomerate and this may have global repercussions for them,” she said.\nIn its order, SEBI said while PwC’s “loose-knit network arrangement” enabled partner firms to derive the advantage of its global brand value but did not lay down any supervisory mechanisms to check the quality of the performance of the firms.\nThe United States Securities and Exchange Commission (SEC) and the Public Company Accounting Oversight Board (PCAOB) had also pointed at failure of quality control in PW India, it said.\nSEBI also ordered ‘Price Waterhouse, Bangalore’ and two of its former partners to jointly forfeit “wrongful gains” of about 131 million rupees ($2.1 million) plus interest within 45 days.\nSatyam, which was bought by Indian IT firm Tech Mahindra in an auction in 2010, and PricewaterhouseCoopers agreed in 2011 to pay a combined $17.5 million to settle U.S. probes into the fraud. (Reporting by Abhirup Roy and Devidutta Tripathy; Additional reporting by Zeba Siddiqui, Promit Mukherjee and Swati Bhat; Editing by Alexander Smith)\n ", "external_links": [], "published": "2018-01-11T16:16:00.000+02:00", "crawled": "2018-01-11T16:34:44.025+02:00", "highlightTitle": ""}