{"organizations": [], "uuid": "8d1afb6a0c9ad48909c6da31b95648c677b8c3d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-value-line-inc-announces-a-quarterly-cash-dividend-of-0-point-18-per-common-share-a-special-dividend-of-0-point-20-per.html", "country": "US", "domain_rank": 767, "title": "Value Line, Inc. Announces a Quarterly Cash Dividend of $0.18 Per Common Share, a Special Dividend of $0.20 Per Share and Reaffirms Share Buyback Program", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T01:37:00.000+02:00", "replies_count": 0, "uuid": "8d1afb6a0c9ad48909c6da31b95648c677b8c3d9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-value-line-inc-announces-a-quarterly-cash-dividend-of-0-point-18-per-common-share-a-special-dividend-of-0-point-20-per.html", "ord_in_thread": 0, "title": "Value Line, Inc. Announces a Quarterly Cash Dividend of $0.18 Per Common Share, a Special Dividend of $0.20 Per Share and Reaffirms Share Buyback Program", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "value line, inc", "sentiment": "neutral"}, {"name": "sec", "sentiment": "none"}, {"name": "stock repurchase program", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "value line, inc.", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New York, Jan. 19, 2018 (GLOBE NEWSWIRE) -- Value Line, Inc., (NASDAQ: VALU ) announced that its Board of Directors declared on January 19, 2018 a quarterly cash dividend of $0.18 per common share, payable on February 9, 2018, to stockholders of record on January 29, 2018. The Company has 9,700,515 shares of common stock outstanding as of January 19, 2018.\nThe Board of Directors also declared a special dividend of $0.20 per common share, payable on March 9, 2018, to stockholders of record on February 23, 2018\nThe Board of Directors also reaffirmed the Stock Repurchase Program of up to an aggregate of $3 million of Value Line, Inc.’s common stock adopted on September 19, 2012, with $417,000 remaining under the program.\nThe Company’s quarterly report on Form 10-Q has been filed with the SEC and is available on the Company’s website at www.valueline.com/About/corporate_filings.aspx . Shareholders may receive a printed copy, free of charge upon request.\nValue Line, Inc. is a leading New York based provider of investment research. The Value Line Investment Survey is one of the most widely used sources of independent equity investment research. Value Line also publishes a range of proprietary investment research in both print and digital formats including research in the areas of Mutual Funds, Options and Convertible securities. Value Line’s acclaimed research also enables the Company to provide specialized products such as Value Line Select, Value Line Special Situations, Value Line Select: Dividend Income & Growth, Value Line Select: ETFs and copyright data , distributed under copyright agreements for fees, including certain proprietary ranking system information and other proprietary information used in third party products. Investment Management services are provided through its substantial non-controlling and non-voting interests in EULAV Asset Management, the investment advisor to The Value Line Family of Mutual Funds. Value Line’s products are available to individual investors by mail, at www.valueline.com or through 1-800-VALUELINE or 1-800-535-9648, while institutional-level services for professional investors, advisers, corporate, academic, municipal and legal libraries are offered at www.ValueLinePro.com , www.ValueLineLibrary.com and at 1-800-531-1425.\nCautionary Statement Regarding Forward-Looking Information\nThis report contains statements that are predictive in nature, depend upon or refer to future events or conditions (including certain projections and business trends) accompanied by such phrases as “believe”, “estimate”, “expect”, “anticipate”, “will”, “intend” and other similar or negative expressions, that are “forward-looking statements” as defined in the Private Securities Litigation Reform Act of 1995, as amended. Actual results for Value Line, Inc. (“Value Line” or “the Company”) may differ materially from those projected as a result of certain risks and uncertainties, including but not limited to the following:\nmaintaining revenue from subscriptions for the Company’s digital and print published products; changes in market and economic conditions, including global financial issues; protection of intellectual property rights; dependence on non-voting revenues and non-voting profits interests in EULAV Asset Management, a Delaware statutory trust (“EAM” or “EAM Trust”), which serves as the investment advisor to the Value Line Funds and engages in related distribution, marketing and administrative services; fluctuations in EAM’s assets under management due to broadly based changes in the values of equity and debt securities, redemptions by investors and other factors, and the effect these changes may have on the valuation of EAM’s intangible assets; dependence on key personnel; competition in the fields of publishing, copyright data and investment management; the impact of government regulation on the Company’s and EAM’s businesses; availability of free or low cost investment data through discount brokers or generally over the internet; terrorist attacks, cyber attacks and natural disasters; other risks and uncertainties, including but not limited to the risks described in Item 1A, “Risk Factors” of the Company’s Annual Report on Form 10-K for the year ended April 30, 2017 and in Part II, Item 1A of this Quarterly Report on Form 10-Q for the period ended October 31, 2017; and other risks and uncertainties arising from time to time.\nThese factors are not necessarily all of the important factors that could cause actual results to differ materially from those expressed in any of our forward-looking statements. Other unknown or unpredictable factors which may involve external factors over which we may have no control or changes in our plans, strategies, objectives, expectations or intentions, which may happen at any time at our discretion, could also have material adverse effects on future results. Except as otherwise required to be disclosed in periodic reports required to be filed by public companies with the SEC pursuant to the SEC's rules, we have no duty to update these statements, and we undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. In light of these risks and uncertainties, current plans, anticipated actions, and future financial conditions and results may differ from those expressed in any forward-looking information contained herein.\nContact: Howard A. Brecher Value Line, Inc. (212) 907-1500 www.valueline.com www.ValueLinePro.com , www.ValueLineLibrary.com Facebook | Google+ | LinkedIn | Twitter Complimentary Value Line® Reports on Dow 30 Stocks\nSource:Value Line, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=WGeSmWJzgjsk6OfINh6zd9YbIuqJHq0iW1HHhci-KpYQlRG4x9--DFgkBafDWAUE-g4TFtBKR2sdnerjUAU5uJTD4-wCp2nH8qHjuvCwKSI7HqiI2t43dIA7I9daZkVdLn3ckkuY96mfjw8MlpfPQwI-W-pDJLLcevBWPx_3fv_XZz10hqMwerqpb4-UgZRMqZDNnHHTlgSM87ttI8u-N8rpHeXPogEI9CVVnAvS4I8=", "http://www.valueline.com/About/corporate_filings.aspx", "https://www.globenewswire.com/Tracker?data=WZRuyS-0E-2ALlaFfuzcMKbns9t2Uyg-iWM0Jc2X3Um9pn57FXUkjHeNpTzaVGuSTvl-hepArFrv3oKm2XzOhhj6TkneEhBxkNiOA_P4XOw=", "https://www.globenewswire.com/Tracker?data=WZRuyS-0E-2ALlaFfuzcMDlqkrMRIazqcqeLALsqAiF6HddD_hf1iv3IT87vKCFGJwXU16LfmdETrUGyEmtZrr2kySsqFooDL-AKAmXs5e8=", "https://www.globenewswire.com/Tracker?data=oqtHPuPSq3cshL4qBUOtma-7yB-E7IdLPYZQEFYiQw6JctJA3wfwAuOJEKPA776nMDhan4-Ylsa_5UUbRUH9BA=="], "published": "2018-01-20T01:37:00.000+02:00", "crawled": "2018-01-20T02:58:57.004+02:00", "highlightTitle": ""}