{"organizations": [], "uuid": "a50babb998bef13da8a2601195b28fdf2e2c0cb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-assa-properties-sells-mixed-use-midtown-building-at-19-west-55th-street-following-major-revitalization-program.html", "country": "US", "domain_rank": 767, "title": "Assa Properties Sells Mixed-Use Midtown Building at 19 West 55th Street Following Major Revitalization Program", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-05T21:29:00.000+02:00", "replies_count": 0, "uuid": "a50babb998bef13da8a2601195b28fdf2e2c0cb5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-assa-properties-sells-mixed-use-midtown-building-at-19-west-55th-street-following-major-revitalization-program.html", "ord_in_thread": 0, "title": "Assa Properties Sells Mixed-Use Midtown Building at 19 West 55th Street Following Major Revitalization Program", "locations": [], "entities": {"persons": [{"name": "abraham leifer", "sentiment": "none"}, {"name": "solly assa", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "fifth avenue", "sentiment": "none"}], "organizations": [{"name": "aview equities", "sentiment": "none"}, {"name": "assa properties", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "-- The firm retains its adjacent property at 15 West 55 th Street --\nNEW YORK--(BUSINESS WIRE)-- Assa Properties announced today that the firm has completed the sale of 19 West 55 th Street (19W55), a mixed-use retail and residential building in the heart of Midtown, for $50 million to Abraham Leifer of Aview Equities.\nThe property was formerly part of a two-building portfolio including the adjacent 15 West 55 th Street (15W55), which Assa Properties will retain. Assa acquired the portfolio for $60 million in 2013 and has since implemented a major revitalization program.\nThat revitalization – in tandem with the building’s unique blend of location and top-end attributes – was reflected in the eye-catchingly strong $1,500-per-square-foot price the property sold for.\n“Since we purchased this portfolio, Assa Properties has made the investment to bring the properties to their current first-class state, matching the premium location in the center of Fifth Avenue’s luxury retail corridor,” said Solly Assa, founder of Assa Properties. “We’re thrilled to offer this prime opportunity with 19 West 55 th Street.”\nAssa Properties completed an $18 million renovation of the portfolio which included the repositioning of the retail space into multi-level retail suites, including a 14,900-square-foot lease to Domenico Vacca at 15 West 55th Street; a complete renovation of the residential units with high-end luxury finishes and amenities; and upgrade of the common spaces and building systems.\nIn 2013, the portfolio was only 25% occupied and, upon Assa Properties’ ownership and capital improvements, it is now at near-full occupancy.\nEach unit in the properties boasts large floorplans, 10-foot ceiling heights, marble fireplaces, hardwood floors, new stainless steel appliances and caesarstone quartz countertops with elegantly blended pre-war details with modern finishes and amenities.\nThe nine-story property at 19W55 features 7,600 square feet of premium, multi-level retail space – just 200 feet from Fifth Avenue – and 23 luxury units.\n15W55 – which Assa Properties retained – is a 10-story, 31-unit mixed-use property featuring Domenico Vacca – a luxury men’s and women’s lifestyle brand – as its anchor retail tenant. The building is substantially leased and offers studio through four-bedroom luxury units.\nLocated on the north side of West 55 th Street between Fifth and Sixth Avenues, the properties are in the center of one of Manhattan’s most vibrant and dynamic submarkets, with renowned cultural, entertainment, shopping and dining destinations. The buildings are walking distance to Central Park and situated among The Museum of Modern Art, Carnegie Hall, Saks Fifth Avenue, Radio City Music Hall, and Rockefeller Center. The area is conveniently in close proximity to several transit options including the B, D, F, M, E, N, Q, R, 1, 2, 3, 4, 5, and 6 subway lines and multiple bus stops.\nAdditionally, the portfolio sits among some of the newest, ultra-high-end luxury developments, further establishing the neighborhood as one of the most desirable in the City.\nAssa Properties was represented by Black Bear Asset Management (“BBAM”) in this transaction.\nAbout Assa Properties\nFounded by Solly and Isaac Assa, Assa Properties has been developing and investing in major residential, retail and commercial properties since 2000. The firm has acquired over three million square-feet of premier assets located throughout the United States and Mexico. Starting in 2002, Assa Properties began acquiring buildings within the New York City Area, namely 743 Fifth Avenue, 2 Herald Square and 6 Times Square -- originally the Knickerbocker Hotel built by John Jacob Astor -- with an eye towards building luxury retail and hotel experiences in some of the New York City's most distinctive neighborhoods. They have since evolved their original vision with two developments: Cassa Hotel and Residences in Midtown Manhattan and Cassa Times Square Hotel and Residences, just south of Midtown West. Each project represents full-service luxury hotels and condominiums offering premium hotel services to their full-time residents.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005712/en/\nFor Assa Properties:\nMegan Romano, 857-362-8897\nmromano@marinopr.com\nSource: Assa Properties", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fassaproperties.com%2F&esheet=51738843&newsitemid=20180105005712&lan=en-US&anchor=Assa+Properties&index=1&md5=e743c03df052b06d349a2229e2620dce", "http://www.businesswire.com/news/home/20180105005712/en/"], "published": "2018-01-05T21:29:00.000+02:00", "crawled": "2018-01-05T23:24:36.009+02:00", "highlightTitle": ""}