{"organizations": [], "uuid": "2aebeb79c0b08c673b08aa8e5172eedea98249ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226439224&w=1200&r=LYNXMPEE0T006", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-austria-hungary/hungarys-orban-visits-austrias-right-wing-government-seeking-allies-idUKKBN1FJ00K", "country": "US", "domain_rank": 408, "title": "Hungary's Orban visits Austria's right-wing government, seeking allies", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T02:06:00.000+02:00", "replies_count": 0, "uuid": "2aebeb79c0b08c673b08aa8e5172eedea98249ab"}, "author": "", "url": "https://uk.reuters.com/article/uk-austria-hungary/hungarys-orban-visits-austrias-right-wing-government-seeking-allies-idUKKBN1FJ00K", "ord_in_thread": 0, "title": "Hungary's Orban visits Austria's right-wing government, seeking allies", "locations": [], "entities": {"persons": [{"name": "orban", "sentiment": "negative"}, {"name": "kurz", "sentiment": "none"}, {"name": "sebastian kurz", "sentiment": "none"}, {"name": "viktor orban", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "freedom party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 12:09 AM / Updated 21 minutes ago Hungary's Orban visits Austria's right-wing government, seeking allies Reuters Staff 3 Min Read \nVIENNA (Reuters) - Hungarian Prime Minister Viktor Orban on Tuesday will meet the leaders of Austria’s new ruling coalition of conservatives and the far right, who share his hard-line views on immigration and are open to forging closer ties with him in a divided European Union. \nChancellor Sebastian Kurz led his conservative party to victory in Austria’s October parliamentary election, then struck a coalition deal with the anti-immigration Freedom Party last month, making Austria the only western European country to have a far-right party in government. \nKurz made a hard line on immigration the core of his campaign after Austria took in one of the biggest contingents of asylum seekers in Europe’s migration crisis in 2015, relative to its population. Many of those people streamed in from Hungary until Orban fenced off much of its border with Serbia. \n“Tomorrow we will have talks with the chancellor and also the vice chancellor,” Orban said in a video recorded on the train that took him to Vienna on Monday and posted on his Facebook account. \n“I would like to sign agreements with them ... which should be about migration, about protecting Austria and Hungary and about helping each other. I hope I will succeed.” \nHaving taken similarly tough stances on immigration, Kurz and Freedom Party leader Heinz-Christian Strache argued during the campaign over who had better relations with Orban - a nationalist popular at home but frequently criticised by Western leaders and rights groups. \n“You wouldn’t even get an appointment (with Orban), Mr Strache,” Kurz said during a debate in October. “I can help you get an appointment if you like,” added Kurz, who was foreign minister at the time. \n“Believe me, I have met him several times ... I don’t need you for that,” Strache replied. \nStrache, who is now vice chancellor, has said Austria should move away from its usual western European allies like Germany by joining the Visegrad group of eastern European states, which includes Hungary and Poland. They frequently defy Brussels on issues such as immigration and fundamental rights. \nKurz has spent much of his time in office seeking to reassure allies that his government will be pro-European, even though he and Strache favour a smaller EU that focuses on fewer tasks, like securing its external borders. \nHe has sided with Visegrad in saying the EU should stop pushing countries to take in quotas of relocated asylum seekers. But he supported the bloc’s punitive steps against Poland for threatening the rule of law and democratic principles. \n“I think we can be a good bridge-builder within the European Union,” Kurz told a joint news conference with German Chancellor Angela Merkel in Berlin this month, referring to the West and Visegrad. Reporting by Francois Murphy,; additional reporting by Krisztina Than in Budapest, editing by Larry King", "external_links": [], "published": "2018-01-30T02:06:00.000+02:00", "crawled": "2018-01-30T02:37:24.001+02:00", "highlightTitle": ""}