{"organizations": [], "uuid": "3aefe9814b66bc2d988c03b7995c54915ed4dc7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222096011&w=1200&r=LYNXMPEE0E0G4", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-wilander/lukewarm-reception-would-not-faze-sharapova-wilander-idUKKBN1F40WM", "country": "US", "domain_rank": 408, "title": "Lukewarm reception would not faze Sharapova - Wilander", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T10:59:00.000+02:00", "replies_count": 0, "uuid": "3aefe9814b66bc2d988c03b7995c54915ed4dc7a"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-wilander/lukewarm-reception-would-not-faze-sharapova-wilander-idUKKBN1F40WM", "ord_in_thread": 0, "title": "Lukewarm reception would not faze Sharapova - Wilander", "locations": [], "entities": {"persons": [{"name": "sharapova - wi", "sentiment": "negative"}, {"name": "sharapova", "sentiment": "negative"}, {"name": "martyn herman", "sentiment": "none"}, {"name": "serena williams", "sentiment": "none"}, {"name": "maria sharapova", "sentiment": "none"}, {"name": "mats wilander", "sentiment": "none"}, {"name": "tatjana maria", "sentiment": "none"}, {"name": "reuters/toru hanai", "sentiment": "none"}], "locations": [{"name": "margaret court arena", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "wada", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 9:00 AM / Updated an hour ago Lukewarm reception would not faze Sharapova - Wilander Martyn Herman 3 Min Read \nMELBOURNE (Reuters) - Former champion Maria Sharapova will not care less what reception she receives when she plays her first Australian Open match since completing a doping ban on Tuesday, according to three-times Melbourne winner Mats Wilander. Tennis - Australian Open - Melbourne, Australia, January 14, 2018. Maria Sharapova of Russia hits a shot during a practice session before the Australian Open tennis tournament. REUTERS/Toru Hanai \nThe 30-year-old Russian will be second match on Margaret Court Arena against Germany’s Tatjana Maria in the first round, in what will be her first match in Melbourne for two years. \nHer last appearance came when she lost a 2016 quarter-final clash with Serena Williams, after which she provided a urine sample that revealed traces of the banned heart drug meldonium. \nSharapova claimed she had not realised the drug had been added to the WADA list of banned substances but served a 15-month ban, returning last year to a mixed reception from her peers and tennis fans, although she was handed a wildcard into the U.S. Open having been snubbed at Roland Garros. \nAustralian Open organisers were criticised for their choice of 2008 champion Sharapova for Thursday’s draw ceremony and it would be no surprise if the world number 48 faced a backlash on her return to action in Melbourne. \n“She will have earbuds in,” Wilander, host of the “Game, Set and Mats” show for Eurosport at the Australian Open, told Reuters on Monday as he looked ahead to Tuesday’s schedule. \n”I really think she doesn’t care what the crowd will do or say. I don’t think she’s ever cared about what people think, which is what has made her a great champion. \n“She is out there to win tennis matches and I think she said it all at the U.S. Open, you can put her on any court and all she wants to do is win.” \nWith reigning champion Williams yet to return from maternity leave, her sister Venus eliminated in round one and twice champion Victoria Azarenka also absent, Sharapova will be eyeing a strong run and Wilander thinks she should be welcomed back. \n“She has paid her dues,” he said. “She was suspended for a while, now she’s back and I‘m sure people will be in their seats to watch her come back.” \nHowever, the former world number one faces a tough path if she is to claim a sixth grand slam title against the odds. \nShe could meet 14th seed Anastasija Sevastova in the second round, with 2016 champion Angelique Kerber a possible last 32 opponent and Wimbledon champion Garbine Muguruza a potential fourth round rival should she get that far. Reporting by Martyn Herman; Editing by John O'Brien", "external_links": [], "published": "2018-01-15T10:59:00.000+02:00", "crawled": "2018-01-15T11:25:46.197+02:00", "highlightTitle": ""}