{"organizations": [], "uuid": "8f7a7d42e46f7351578977c56a76b615852b5005", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/10", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-avery-dennison-announces-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Avery Dennison Announces Fourth and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:45:00.000+02:00", "replies_count": 0, "uuid": "8f7a7d42e46f7351578977c56a76b615852b5005"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-avery-dennison-announces-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Avery Dennison Announces Fourth and Full Year 2017 Results", "locations": [], "entities": {"persons": [{"name": "avery dennison", "sentiment": "negative"}, {"name": "mitch butier", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "glendale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "gaap", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "avery dennison corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4Q17 Reported EPS of ($0.66), incl. impact of the U.S. tax legislation change Adjusted EPS (non-GAAP) of $1.33 4Q17 Net sales increased 11.9% to $1.74 billion Sales change ex. currency (non-GAAP) of 9.1% Organic sales change (non-GAAP) of 4.7% FY17 Reported EPS of $3.13 Adjusted EPS of $5.00 FY17 Net sales increased 8.7% to $6.61 billion Sales change ex. currency of 8.2% Organic sales change of 4.2% Expect FY18 Reported EPS of $5.50 to $5.75 Adjusted EPS of $5.70 to $5.95\nGLENDALE, Calif.--(BUSINESS WIRE)-- Avery Dennison Corporation (NYSE:AVY) today announced preliminary, unaudited results for its fourth quarter and year ended December 30, 2017. All non-GAAP financial measures referenced in this document are reconciled to GAAP in the attached tables. Unless otherwise indicated, comparisons are to the same period in the prior year.\n“2017 marked the company’s sixth consecutive year of strong top-line growth, margin expansion, and double-digit adjusted EPS growth,” said Mitch Butier, President and CEO. “Strong top-line performance in 2017 reflected a balance of contributions from acquisitions and organic growth, driven by our focus on faster-growing high value categories and large presence in emerging markets.\n“Label and Graphic Materials delivered another year of strong growth and continued margin expansion. Retail Branding and Information Solutions’ operating income rose significantly, reflecting outstanding performance in terms of both top-line growth and margin expansion. And we expanded the platform for Industrial and Healthcare Materials, through both acquisitions and a return to solid organic growth in the back half of the year.\n“In 2018, we expect to once again deliver a strong top-line and double-digit EPS growth, while further increasing our level of investment for the future,” said Butier. “I would like to thank our employees for their dedication to creating superior value for our customers, investors, and the communities in which we operate. We remain confident that the consistent execution of our strategies will enable us to continue this momentum for years to come.”\nFor more details on the company’s results, see the summary table accompanying this news release, as well as the supplemental presentation materials, “Fourth Quarter and Full Year 2017 Financial Review and Analysis,” posted on the company’s website at www.investors.averydennison.com , and furnished to the SEC on Form 8-K.\nFourth Quarter 2017 Results by Segment\nSales change ex. currency refers to the increase or decrease in sales excluding the estimated impact of currency translation. The estimated impact of currency translation is calculated on a constant currency basis, with prior period results translated at current period average exchange rates to exclude the effect of currency fluctuations. Organic sales change refers to the increase or decrease in sales excluding the estimated impact of currency translation, product line exits, and acquisitions and divestitures. Adjusted operating margin refers to income before interest expense and taxes, excluding restructuring charges and other items, as a percentage of sales.\nLabel and Graphic Materials\nReported sales increased 9.2 percent. Sales ex. currency increased 5.6 percent; on an organic basis, sales grew 4.6 percent. Sales increased mid-single digits on an organic basis in Label and Packaging Materials, as well as in the combined Graphics and Reflective Solutions businesses. Reported operating margin increased 60 basis points to 11.9 percent as the benefits of increased volume and productivity more than offset higher employee-related costs and the net impact of pricing and raw material costs. Adjusted operating margin increased 70 basis points to 12.2 percent.\nRetail Branding and Information Solutions\nReported sales increased 5.2 percent; on an organic basis, sales grew 4.7 percent driven by strength in both RFID and the base business. Reported operating margin increased 150 basis points to 10.8 percent as the benefits from productivity, increased volume, and reduced amortization expense were partially offset by higher employee-related costs and the net impact of pricing and raw material costs. Adjusted operating margin increased 190 basis points to 11.9 percent.\nIndustrial and Healthcare Materials\nReported sales increased 60.3 percent. Sales ex. currency increased 56.9 percent; on an organic basis, sales grew 5.7 percent. Sales on an organic basis increased high-single digits in industrial categories and increased low-single digits in healthcare categories. Reported operating margin declined 160 basis points to 7.2 percent, with roughly half of the decline due to acquisitions, and the balance reflecting near-term operational challenges and investments. Adjusted operating margin declined 210 basis points to 7.6 percent.\nOther\nShare Repurchases / Equity Dilution from Long-Term Incentives\nIn 2017, the company repurchased 1.5 million shares at an aggregate cost of $130 million ($108 million net of proceeds from stock option exercises). Net of dilution, the company’s share count increased by 0.1 million.\nIncome Taxes\nThe enactment of the Tax Cuts and Jobs Act (“TCJA”) in December 2017 resulted in a charge of $172 million in the fourth quarter. This charge includes a tax on deemed repatriation of accumulated untaxed foreign earnings and the revaluation of deferred tax assets and liabilities, reflecting the company’s provisional estimate of the new legislation’s impact under recent SEC guidance. As new information becomes available, including issuance of interpretations by regulatory bodies, the company may update this estimate.\nThe company’s effective tax rate, including the impact of the TCJA, was 138 percent for the fourth quarter, and 52 percent for the full year. The company’s adjusted (non-GAAP) tax rate was 28 percent for both the fourth quarter and full year; this rate excludes the charge associated with the TCJA and incorporates $29 million of estimated charges related to repatriation actions previously planned for the fourth quarter that were not implemented as a result of U.S. tax reform.\nThe company’s 2018 tax rate is expected to be in the mid-twenty percent range, which reflects the company’s current estimated impact of the TCJA.\nCost Reduction Actions\nIn 2017, the company realized approximately $59 million in pre-tax savings from restructuring, net of transition costs, and incurred pre-tax restructuring charges of approximately $33 million, the majority of which represents cash charges.\nOutlook\nIn its supplemental presentation materials, “Fourth Quarter and Full Year 2017 Financial Review and Analysis,” the company provides a list of factors that it believes will contribute to its 2018 financial results. Based on the factors listed and other assumptions, the company expects 2018 reported earnings per share of $5.50 to $5.75.\nExcluding an estimated $0.20 per share for restructuring charges and other items, the company expects adjusted earnings per share of $5.70 to $5.95.\nNote: Throughout this release and the supplemental presentation materials, amounts on a per share basis reflect fully diluted shares outstanding.\nAbout Avery Dennison\nAvery Dennison (NYSE:AVY) is a global materials science company specializing in the design and manufacture of a wide variety of labeling and functional materials. The company’s products, which are used in nearly every major industry, include pressure-sensitive materials for labels and graphic applications; tapes and other bonding solutions for industrial, medical, and retail applications; tags, labels, and embellishments for apparel; and radio frequency identification (RFID) solutions serving retail apparel and other markets. Headquartered in Glendale, California, the company employs approximately 30,000 employees in more than 50 countries. Reported sales in 2017 were $6.6 billion. Learn more at www.averydennison.com .\n“Safe Harbor” Statement under the Private Securities Litigation Reform Act of 1995\nCertain statements contained in this document are \"forward-looking statements\" intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements, and financial or other business targets, are subject to certain risks and uncertainties. Actual results and trends may differ materially from historical or anticipated results depending on a variety of factors, including but are not limited to, risks and uncertainties relating to the following: fluctuations in demand affecting sales to customers; worldwide and local economic conditions; changes in political conditions; changes in governmental laws and regulations; fluctuations in currency exchange rates and other risks associated with foreign operations, including in emerging markets; the financial condition and inventory strategies of customers; changes in customer preferences; fluctuations in cost and availability of raw materials; our ability to generate sustained productivity improvement; our ability to achieve and sustain targeted cost reductions; the impact of competitive products and pricing; loss of significant contracts or customers; collection of receivables from customers; selling prices; business mix shift; execution and integration of acquisitions and completion of potential dispositions; timely development and market acceptance of new products, including sustainable or sustainably-sourced products; investment in development activities and new production facilities; amounts of future dividends and share repurchases; customer and supplier concentrations; successful implementation of new manufacturing technologies and installation of manufacturing equipment; disruptions in information technology systems, including cyber-attacks or other intrusions to network security; successful installation of new or upgraded information technology systems; data security breaches; volatility of financial markets; impairment of capitalized assets, including goodwill and other intangibles; credit risks; our ability to obtain adequate financing arrangements and maintain access to capital; fluctuations in interest and tax rates; changes in tax laws and regulations, and uncertainties associated with interpretations of such laws and regulations; outcome of tax audits; fluctuations in pension, insurance, and employee benefit costs; the impact of legal and regulatory proceedings, including with respect to environmental, health and safety; protection and infringement of intellectual property; the impact of epidemiological events on the economy and our customers and suppliers; acts of war, terrorism, and natural disasters; and other factors.\nWe believe that the most significant risk factors that could affect our financial performance in the near-term include: (1) the impacts of global economic conditions and political uncertainty on underlying demand for our products and foreign currency fluctuations; (2) the degree to which higher costs can be offset with productivity measures and/or passed on to customers through selling price increases, without a significant loss of volume; (3) competitors’ actions, including pricing, expansion in key markets, and product offerings; and (4) the execution and integration of acquisitions.\nFor a more detailed discussion of these and other factors, see “Risk Factors” and “Management’s Discussion and Analysis of Results of Operations and Financial Condition” in our 2016 Form 10-K, filed on February 23, 2017 with the Securities and Exchange Commission, and subsequent quarterly reports on Form 10-Q. The forward-looking statements included in this document are made only as of the date of this document, and we undertake no obligation to update these statements to reflect subsequent events or circumstances, other than as may be required by law.\nFor more information and to listen to a live broadcast or an audio replay of the quarterly conference call with analysts, visit the Avery Dennison website at www.investors.averydennison.com .\nFourth Quarter Financial Summary - Preliminary, unaudited (In millions, except % and per share amounts) % Change vs. P/Y 4Q 4Q Ex. 2017 2016 Reported Currency (a) Organic (b) Net sales, by segment: Label and Graphic Materials $ 1,161.7 $ 1,063.8 9.2 % 5.6 % 4.6 % Retail Branding and Information Solutions 395.5 375.9 5.2 % 4.7 % 4.7 % Industrial and Healthcare Materials 178.1 111.1 60.3 % 56.9 % 5.7 % Total net sales $ 1,735.3 $ 1,550.8 11.9 % 9.1 % 4.7 % As Reported (GAAP) Adjusted Non-GAAP (c) 4Q 4Q % % of Sales 4Q 4Q % % of Sales 2017 2016 Change 2017 2016 2017 2016 Change 2017 2016 Operating income (loss) / operating margins before interest and taxes, by segment:\nLabel and Graphic Materials $ 138.0 $ 120.6 11.9 % 11.3 % $ 142.1 $ 122.6 12.2 % 11.5 % Retail Branding and Information Solutions 42.8 34.8 10.8 % 9.3 % 46.9 37.5 11.9 % 10.0 % Industrial and Healthcare Materials 12.9 9.8 7.2 % 8.8 % 13.5 10.8 7.6 % 9.7 % Corporate expense (23.1 ) (24.4 ) (22.9 ) (25.3 ) Total operating income before interest and taxes / operating margins\n$ 170.6 $ 140.8 21 % 9.8 % 9.1 % $ 179.6 $ 145.6 23 % 10.3 % 9.4 % Interest expense $ 13.3 $ 14.5 $ 13.3 $ 14.5 Income before taxes $ 157.3 $ 126.3 25 % 9.1 % 8.1 % $ 166.3 $ 131.1 27 % 9.6 % 8.5 % Provision for income taxes (d) $ 216.9 $ 64.3 $ 46.6 $ 42.1 Net (loss) income ($59.6 ) $ 62.0 (196 %) (3.4 %) 4.0 % $ 119.7 $ 89.0 34 % 6.9 % 5.7 % Net (loss) income per common share, assuming dilution ($0.66 ) $ 0.69 (196 %) $ 1.33 $ 0.99 34 % 2017 2016 4Q Free Cash Flow (d)(e) $ 165.7 $ 139.4 See accompanying schedules A-4 to A-8 for reconciliations from GAAP to non-GAAP financial measures. (a) Percentage change in sales excluding the estimated impact of currency translation. (b) Percentage change in sales excluding the estimated impact of currency translation, product line exits, acquisitions and divestitures, and, where applicable, the extra week in our fiscal year. (c) Excludes the impact of the Tax Cuts and Jobs Act (\"TCJA\"), restructuring charges, other items, and includes the impact of previously planned repatriation of foreign earnings for Q4 2017. (d) \"Provision for income taxes\" for the fourth quarter of 2017 includes the estimated impact of TCJA enacted in the U.S. on December 22, 2017. The TCJA significantly revises U.S. corporate income tax law by, among other changes, lowering corporate income tax rates, implementing a territorial tax regime, and imposing a one-time transition tax through a deemed repatriation of accumulated untaxed earnings of foreign subsidiaries. This provision includes a reasonable estimate (\"provisional amount\") of the impact of the TCJA on our tax provision following the guidance of SEC Staff Accounting Bulletin No. 118 (SAB 118). In the first quarter of 2017, we adopted Accounting Standards Update (ASU) 2016-09, Improvements to Employee Share-Based Payment Accounting. This ASU requires that all tax effects related to share-based payments at settlement or expiration be recognized through the provision for income taxes, a change from the previous requirement that certain tax effects be recognized in shareholders' equity. As required by this ASU, this change was applied prospectively after the date of adoption. This ASU also requires that all tax-related cash flows resulting from share-based payments be reported as operating activities on the statements of cash flows, a change from the previous requirement that windfall tax benefits be presented as an inflow from financing activities and an outflow from operating activities. As permitted by this ASU, prior periods were not retrospectively adjusted for this change. (e) Free cash flow refers to cash flow from operations, less payments for property, plant and equipment, software and other deferred charges, plus proceeds from sales of property, plant and equipment, plus (minus) net proceeds from sales (purchases) of investments. Full Year Financial Summary - Preliminary, unaudited (in millions, except % and per share amounts) % Change vs. P/Y FY FY Ex. 2017 2016 Reported Currency (a) Organic (b) Net sales, by segment: Label and Graphic Materials $ 4,511.7 $ 4,187.3 7.7 % 6.9 % 4.2 % Retail Branding and Information Solutions 1,511.2 1,445.4 4.6 % 5.0 % 5.0 % Industrial and Healthcare Materials 590.9 453.8 30.2 % 29.9 % 2.0 % Total net sales $ 6,613.8 $ 6,086.5 8.7 % 8.2 % 4.2 % As Reported (GAAP) Adjusted Non-GAAP (c) FY FY % % of Sales FY FY % % of Sales 2017 2016 Change 2017 2016 2017 2016 Change 2017 2016 Operating income (loss) / operating margins before interest and taxes, by segment:\nLabel and Graphic Materials $ 567.3 $ 516.2 12.6 % 12.3 % $ 581.8 $ 529.2 12.9 % 12.6 % Retail Branding and Information Solutions 122.9 102.6 8.1 % 7.1 % 141.0 112.4 9.3 % 7.8 % Industrial and Healthcare Materials 50.5 54.6 8.5 % 12.0 % 54.2 56.5 9.2 % 12.5 % Corporate expense (88.2 ) (136.4 ) (88.0 ) (95.9 ) Total operating income before interest and taxes / operating margins\n$ 652.5 $ 537.0 22 % 9.9 % 8.8 % $ 689.0 $ 602.2 14 % 10.4 % 9.9 % Interest expense $ 63.0 $ 59.9 $ 63.0 $ 59.9 Income before taxes $ 589.5 $ 477.1 24 % 8.9 % 7.8 % $ 626.0 $ 542.3 15 % 9.5 % 8.9 % Provision for income taxes (d) $ 307.7 $ 156.4 $ 175.3 $ 177.8 Net income $ 281.8 $ 320.7 (12 %) 4.3 % 5.3 % $ 450.7 $ 364.5 24 % 6.8 % 6.0 % Net income per common share, assuming dilution $ 3.13 $ 3.54 (12 %) $ 5.00 $ 4.02 24 % 2017 2016 Free Cash Flow (d)(e) $ 421.7 $ 387.1 See accompanying schedules A-4 to A-8 for reconciliations from GAAP to non-GAAP financial measures. (a) Percentage change in sales excluding the estimated impact of currency translation. (b) Percentage change in sales excluding the estimated impact of currency translation, product line exits, acquisitions and divestitures, and, where applicable, the extra week in our fiscal year. (c) Excludes the impact of TCJA, restructuring charges, other items, and includes the impact of previously planned repatriation of foreign earnings for Q4 2017. (d) \"Provision for income taxes\" for the fourth quarter of 2017 includes the estimated impact of the TCJA. The TCJA significantly revises U.S. corporate income tax law by, among other changes, lowering corporate income tax rates, implementing a territorial tax regime, and imposing a one-time transition tax through a deemed repatriation of accumulated untaxed earnings of foreign subsidiaries. This provision includes a reasonable estimate (\"provisional amount\") of the impact of the TCJA on our tax provision following the guidance of SEC Staff Accounting Bulletin No. 118 (SAB 118). In the first quarter of 2017, we adopted Accounting Standards Update (ASU) 2016-09, Improvements to Employee Share-Based Payment Accounting. This ASU requires that all tax effects related to share-based payments at settlement or expiration be recognized through the provision for income taxes, a change from the previous requirement that certain tax effects be recognized in shareholders' equity. As required by this ASU, this change was applied prospectively after the date of adoption. This ASU also requires that all tax-related cash flows resulting from share-based payments be reported as operating activities on the statements of cash flows, a change from the previous requirement that windfall tax benefits be presented as an inflow from financing activities and an outflow from operating activities. As permitted by this ASU, prior periods were not retrospectively adjusted for this change. (e) Free cash flow refers to cash flow from operations, less payments for property, plant and equipment, software and other deferred charges, plus proceeds from sales of property, plant and equipment, plus (minus) net proceeds from sales (purchases) of investments. A-1\nAVERY DENNISON CORPORATION PRELIMINARY CONDENSED CONSOLIDATED STATEMENTS OF INCOME (In millions, except per share amounts) (UNAUDITED) Three Months Ended Twelve Months Ended Dec. 30, 2017 Dec. 31, 2016 Dec. 30, 2017 Dec. 31, 2016 Net sales $ 1,735.3 $ 1,550.8 $ 6,613.8 $ 6,086.5 Cost of products sold 1,269.7 1,125.4 4,801.6 4,386.8 Gross profit 465.6 425.4 1,812.2 1,699.7 Marketing, general and administrative expense 286.0 279.8 1,123.2 1,097.5 Other expense, net (1) 9.0 4.8 36.5 65.2 Interest expense 13.3 14.5 63.0 59.9 Income before taxes 157.3 126.3 589.5 477.1 Provision for income taxes (2) 216.9 64.3 307.7 156.4 Net (loss) income $ (59.6 ) $ 62.0 $ 281.8 $ 320.7 Per share amounts: Net (loss) income per common share, assuming dilution $ (0.66 ) $ 0.69 $ 3.13 $ 3.54 Weighted average number of common shares outstanding, assuming dilution\n89.9\n90.1\n90.1\n90.7\n(1) \"Other expense, net\" for the fourth quarter of 2017 includes severance and related costs of $9.5, lease cancellation charges of $.1, and transaction costs of $1.5, partially offset by net gain on sales of assets of $2.1. \"Other expense, net\" for the fourth quarter of 2016 includes severance and related costs of $4, asset impairment and lease cancellation charges of $1.3, and transaction costs of $.9, partially offset by gain on sale of assets of $1.4. \"Other expense, net\" for fiscal year 2017 includes severance and related costs of $31.2, asset impairment and lease cancellation charges of $2.2, and transaction costs of $5.2, partially offset by net gain on sales of assets of $2.1. \"Other expense, net\" for fiscal year 2016 includes severance and related costs of $14.7, asset impairment and lease cancellation charges of $5.2, loss from settlement of pension obligations of $41.4, and transaction costs of $5, partially offset by net gain on sales of assets of $1.1. (2) \"Provision for income taxes\" for fiscal year 2017 includes the estimated impact of the Tax Cuts and Jobs Act (\"TCJA\") enacted in the U.S. on December 22, 2017. The TCJA significantly revises U.S. corporate income tax law by, among other changes, lowering corporate income tax rates, implementing a territorial tax regime, and imposing a one-time transition tax through a deemed repatriation of accumulated untaxed earnings of foreign subsidiaries. This provision includes a reasonable estimate (\"provisional amount\") of the impact of the TCJA on our tax provision following the guidance of SEC Staff Accounting Bulletin No. 118 (SAB 118). In the first quarter of 2017, we adopted Accounting Standards Update (ASU) 2016-09, Improvements to Employee Share-Based Payment Accounting. This ASU requires that all tax effects related to share-based payments at settlement or expiration be recognized through the provision for income taxes, a change from the previous requirement that certain tax effects be recognized in shareholders' equity. As required by this ASU, this change was applied prospectively after the date of adoption. A-2\nAVERY DENNISON CORPORATION PRELIMINARY CONDENSED CONSOLIDATED BALANCE SHEETS (In millions) (UNAUDITED) ASSETS Dec. 30, 2017 Dec. 31, 2016 Current assets: Cash and cash equivalents $ 224.4 $ 195.1 Trade accounts receivable, net 1,180.3 1,001.0 Inventories, net 609.6 519.1 Assets held for sale 6.3 6.8 Other current assets 217.3 182.8 Total current assets 2,237.9 1,904.8 Property, plant and equipment, net 1,097.9 915.2 Goodwill and other intangibles resulting from business acquisitions, net 1,151.4 860.3 Non-current deferred income taxes 196.3 313.2 Other assets 453.4 402.9 $ 5,136.9 $ 4,396.4 LIABILITIES AND SHAREHOLDERS' EQUITY Current liabilities: Short-term borrowings and current portion of long-term debt and capital leases $ 265.4 $ 579.1 Accounts payable 1,007.2 841.9 Other current liabilities 699.2 583.3 Total current liabilities 1,971.8 2,004.3 Long-term debt and capital leases 1,316.3 713.4 Other long-term liabilities 802.6 753.2 Shareholders' equity: Common stock 124.1 124.1 Capital in excess of par value 862.6 852.0 Retained earnings 2,596.7 2,473.3 Treasury stock at cost (1,856.7 ) (1,772.0 ) Accumulated other comprehensive loss (680.5 ) (751.9 ) Total shareholders' equity 1,046.2 925.5 $ 5,136.9 $ 4,396.4 A-3\nAVERY DENNISON CORPORATION PRELIMINARY CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (In millions) (UNAUDITED) Twelve Months Ended\nDec. 30, 2017\nDec. 31, 2016 Operating Activities: Net income $ 281.8 $ 320.7 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation 126.6 117.5 Amortization 52.1 62.6 Provision for doubtful accounts and sales returns 37.6 54.4 Net losses from asset impairments and sales/disposals of assets 1.4 1.5 Stock-based compensation 30.2 27.2 Loss from settlement of pension obligations --- 41.4 Other non-cash expense and loss 53.9 46.2 Changes in assets and liabilities and other adjustments 66.5 (86.2 ) Net cash provided by operating activities 650.1 585.3 Investing Activities: Purchases of property, plant and equipment (190.5 ) (176.9 ) Purchases of software and other deferred charges (35.6 ) (29.7 ) Proceeds from sales of property, plant and equipment 6.0 8.5 Purchases of investments, net (8.3 ) (0.1 ) Payments for acquisitions, net of cash acquired, and investments in businesses (319.3 ) (237.2 ) Net cash used in investing activities (547.7 ) (435.4 ) Financing Activities: Net (decrease) increase in borrowings (maturities of three months or less) (89.2 ) 234.9 Additional long-term borrowings 542.9 --- Repayments of long-term debt (253.8 ) (2.7 ) Dividends paid (155.5 ) (142.5 ) Share repurchases (129.7 ) (262.4 ) Proceeds from exercises of stock options, net 22.0 71.0 Tax withholding for and excess tax benefit from stock-based compensation, net (20.6 ) (4.5 ) Net cash used in financing activities (83.9 ) (106.2 ) Effect of foreign currency translation on cash balances 10.8 (7.4 ) Increase in cash and cash equivalents 29.3 36.3 Cash and cash equivalents, beginning of year 195.1 158.8 Cash and cash equivalents, end of year $ 224.4 $ 195.1 In the first quarter of 2017, we adopted the provisions of Accounting Standards Update (ASU) 2016-09, Improvements to Employee Share-Based Payment Accounting. This ASU requires that all tax-related cash flows resulting from share-based payments be reported as operating activities on the statements of cash flows, a change from the previous requirement that windfall tax benefits be presented as an inflow from financing activities and an outflow from operating activities. As permitted by this ASU, prior periods were not retrospectively adjusted. A-4\nReconciliation of Non-GAAP Financial Measures in Accordance with SEC Regulations G and S-K We report our financial results in conformity with accounting principles generally accepted in the United States of America, or GAAP, and also communicate with investors using certain non-GAAP financial measures. These non-GAAP financial measures are not in accordance with, nor are they a substitute for or superior to, the comparable GAAP financial measures. These non-GAAP financial measures are intended to supplement presentation of our financial results that are prepared in accordance with GAAP. Based upon feedback from investors and financial analysts, we believe that the supplemental non-GAAP financial measures we provide are useful to their assessment of our performance and operating trends, as well as liquidity. Our non-GAAP financial measures exclude the impact of certain events, activities, or strategic decisions. The accounting effects of these events, activities or decisions, which are included in the GAAP financial measures, may make it difficult to assess our underlying performance in a single period. By excluding the accounting effects, positive or negative, of certain items (e.g., restructuring charges, legal settlements, certain effects of strategic transactions and related costs, losses from debt extinguishments, losses from curtailment and settlement of pension obligations, gains or losses on sales of certain assets, and other items), we believe that we are providing meaningful supplemental information that facilitates an understanding of our core operating results and liquidity measures. These non-GAAP financial measures are used internally to evaluate trends in our underlying performance, as well as to facilitate comparison to the results of competitors for a single period. While some of the items we exclude from GAAP financial measures recur, they tend to be disparate in amount, frequency, or timing. We use the following non-GAAP financial measures in the accompanying news release and presentation: Sales change ex. currency refers to the increase or decrease in sales excluding the estimated impact of currency translation. The estimated impact of currency translation is calculated on a constant currency basis, with prior period results translated at current period average exchange rates to exclude the effect of currency fluctuations. Organic sales change refers to the increase or decrease in sales excluding the estimated impact of currency translation, product line exits, acquisitions and divestitures, and, where applicable, the extra week in our fiscal year. We believe that sales change ex. currency and organic sales change assist investors in evaluating the sales growth from the ongoing activities of our businesses and provide greater ability to evaluate our results from period to period. Adjusted operating margin refers to income before interest expense and taxes, excluding restructuring charges and other items, as a percentage of sales. Adjusted tax rate refers to the full-year GAAP tax rate, adjusted to include the impact of previously planned repatriation of foreign earnings for Q4 2017 and exclude the reasonable estimate (\"provisional amount\") of the impact of the TCJA. Adjusted net income refers to income before taxes, tax-effected at the adjusted tax rate, and adjusted for tax-effected restructuring charges and other items. Adjusted net income per common share, assuming dilution (adjusted EPS) refers to adjusted net income divided by weighted average number of common shares outstanding, assuming dilution. We believe that adjusted operating margin, adjusted net income, and adjusted EPS assist investors in understanding our core operating trends and comparing our results with those of our competitors. Free cash flow refers to cash flow from operations, less payments for property, plant and equipment, software and other deferred charges, plus proceeds from sales of property, plant and equipment, plus (minus) net proceeds from sales (purchases) of investments. We believe that free cash flow assists investors by showing the amount of cash we have available for debt reductions, dividends, share repurchases, and acquisitions. The following reconciliations are provided in accordance with Regulations G and S-K and reconcile our non-GAAP financial measures with the most directly comparable GAAP financial measures. A-5\nAVERY DENNISON CORPORATION PRELIMINARY RECONCILIATION FROM GAAP TO NON-GAAP FINANCIAL MEASURES (In millions, except % and per share amounts) (UNAUDITED) Three Months Ended Twelve Months Ended Dec. 30, 2017 Dec. 31, 2016 Dec. 30, 2017 Dec. 31, 2016 Reconciliation from GAAP to Non-GAAP Operating Margins: Net sales $ 1,735.3 $ 1,550.8 $ 6,613.8 $ 6,086.5 Income before taxes $ 157.3 $ 126.3 $ 589.5 $ 477.1 Income before taxes as a percentage of sales 9.1 % 8.1 % 8.9 % 7.8 % Adjustment: Interest expense $ 13.3 $ 14.5 $ 63.0 $ 59.9 Operating income before interest expense and taxes $ 170.6 $ 140.8 $ 652.5 $ 537.0 Operating Margins 9.8 % 9.1 % 9.9 % 8.8 % Income before taxes $ 157.3 $ 126.3 $ 589.5 $ 477.1 Adjustments: Restructuring charges: Severance and related costs 9.5 4.0 31.2 14.7 Asset impairment and lease cancellation charges 0.1 1.3 2.2 5.2 Transaction costs 1.5 0.9 5.2 5.0 Loss from settlement of pension obligations --- --- --- 41.4 Net gain on sales of assets (2.1 ) (1.4 ) (2.1 ) (1.1 ) Interest expense 13.3 14.5 63.0 59.9 Adjusted operating income before interest expense and taxes (non-GAAP) $ 179.6 $ 145.6 $ 689.0 $ 602.2 Adjusted Operating Margins (non-GAAP) 10.3 % 9.4 % 10.4 % 9.9 % Reconciliation from GAAP to Non-GAAP Net (loss) income: As reported net (loss) income $ (59.6 ) $ 62.0 $ 281.8 $ 320.7 Adjustments: Restructuring charges 9.6 5.3 33.4 19.9 Transaction costs 1.5 0.9 5.2 5.0 Loss from settlement of pension obligations --- --- --- 41.4 Net gain on sales of assets (2.1 ) (1.4 ) (2.1 ) (1.1 ) Tax effect on pre-tax adjustments and impact of adjusted tax rate (1) 27.7 22.2 (10.2 ) (21.4 ) Estimated tax provision impact resulting from the TCJA 172.0 --- 172.0 --- Impact of previously planned repatriation of foreign earnings for Q4 2017 (29.4 ) --- (29.4 ) --- Adjusted Net income (non-GAAP) $ 119.7 $ 89.0 $ 450.7 $ 364.5 A-5\n(continued)\nAVERY DENNISON CORPORATION PRELIMINARY RECONCILIATION FROM GAAP TO NON-GAAP FINANCIAL MEASURES (In millions, except % and per share amounts) (UNAUDITED) Three Months Ended Twelve Months Ended Dec. 30, 2017 Dec. 31, 2016 Dec. 30, 2017 Dec. 31, 2016 Reconciliation from GAAP to Non-GAAP Net (loss) income per Common Share: As reported net (loss) income per common share, assuming dilution $ (0.66 ) $ 0.69 $ 3.13 $ 3.54 Adjustments per common share, net of tax: Restructuring charges, transaction costs, loss from settlement of pension obligations, and net gain on sales of assets (1)\n0.41 0.30 0.29 0.48 Estimated tax provision impact resulting from the TCJA 1.91 --- 1.91 --- Impact of previously planned repatriation of foreign earnings for Q4 2017 (0.33 ) --- (0.33 ) --- Adjusted net income per common share, assuming dilution (non-GAAP) $ 1.33 $ 0.99 $ 5.00 $ 4.02 Weighted average number of common shares outstanding, assuming dilution 89.9 90.1 90.1 90.7 (1) The adjusted tax rate was 28% for the three and twelve months ended December 30, 2017, and 32.1% and 32.8% for the three and twelve months ended December 31, 2016, respectively. (UNAUDITED) Three Months Ended Twelve Months Ended Dec. 30, 2017 Dec. 31, 2016 Dec. 30, 2017 Dec. 31, 2016 Reconciliation of Free Cash Flow: Net cash provided by operating activities $ 257.5 $ 219.6 $ 650.1 $ 585.3 Purchases of property, plant and equipment (79.1 ) (72.0 ) (190.5 ) (176.9 ) Purchases of software and other deferred charges (12.1 ) (13.1 ) (35.6 ) (29.7 ) Proceeds from sales of property, plant and equipment 3.0 4.2 6.0 8.5 (Purchases) sales of investments, net (3.6 ) 0.7 (8.3 ) (0.1 ) Free Cash Flow (non-GAAP) $ 165.7 $ 139.4 $ 421.7 $ 387.1 A-6\nAVERY DENNISON CORPORATION PRELIMINARY SUPPLEMENTARY INFORMATION (In millions, except %) (UNAUDITED) Fourth Quarter Ended NET SALES OPERATING INCOME OPERATING MARGINS 2017 2016 2017 (1)\n2016 (2)\n2017 2016 Label and Graphic Materials $ 1,161.7 $ 1,063.8 $ 138.0 $ 120.6 11.9 % 11.3 % Retail Branding and Information Solutions 395.5 375.9 42.8 34.8 10.8 % 9.3 % Industrial and Healthcare Materials 178.1 111.1 12.9 9.8 7.2 % 8.8 % Corporate Expense N/A N/A (23.1 ) (24.4 ) N/A N/A TOTAL FROM OPERATIONS $ 1,735.3 $ 1,550.8 $ 170.6 $ 140.8 9.8 % 9.1 % (1)\nOperating income for the fourth quarter of 2017 includes severance and related costs of $9.5, lease cancellation charges of $.1, and transaction costs of $1.5, partially offset by net gain on sales of assets of $2.1. Of the total $9, the Label and Graphic Materials segment recorded $4.1, the Retail Branding and Information Solutions segment recorded $4.1, the Industrial and Healthcare Materials segment recorded $.6, and Corporate recorded $.2.\n(2)\nOperating income for the fourth quarter of 2016 includes severance and related costs of $4, asset impairment and lease cancellation charges of $1.3, and transaction costs of $.9, partially offset by gain on sale of assets of $1.4. Of the total $4.8, the Label and Graphic Materials segment recorded $2, the Retail Branding and Information Solutions segment recorded $2.7, the Industrial and Healthcare Materials segment recorded $1, and Corporate recorded ($.9).\nRECONCILIATION FROM GAAP TO NON-GAAP SUPPLEMENTARY INFORMATION Fourth Quarter Ended OPERATING INCOME OPERATING MARGINS 2017 2016 2017 2016 Label and Graphic Materials\nOperating income and margins, as reported $ 138.0 $ 120.6 11.9 % 11.3 % Adjustments: Restructuring charges: Severance and related costs 4.9 1.0 0.4 % 0.1 % Asset impairment charges --- 0.2 --- --- Transaction costs --- 0.8 --- 0.1 % Gain on sale of assets (0.8 ) --- (0.1 %) --- Adjusted operating income and margins (non-GAAP) $ 142.1 $ 122.6 12.2 % 11.5 % Retail Branding and Information Solutions\nOperating income and margins, as reported $ 42.8 $ 34.8 10.8 % 9.3 % Adjustments: Restructuring charges: Severance and related costs 4.6 3.0 1.2 % 0.8 % Asset impairment and lease cancellation charges 0.1 1.1 --- 0.3 % Transaction costs related to sale of product line 0.9 --- 0.3 % --- Gain on sales of assets (1.5 ) (1.4 ) (0.4 %) (0.4 %) Adjusted operating income and margins (non-GAAP) $ 46.9 $ 37.5 11.9 % 10.0 % Industrial and Healthcare Materials\nOperating income and margins, as reported $ 12.9 $ 9.8 7.2 % 8.8 % Adjustments: Transaction costs 0.6 1.0 0.4 % 0.9 % Adjusted operating income and margins (non-GAAP) $ 13.5 $ 10.8 7.6 % 9.7 % A-7\nAVERY DENNISON CORPORATION PRELIMINARY SUPPLEMENTARY INFORMATION (In millions, except %) (UNAUDITED) Twelve Months Year-to-Date NET SALES OPERATING INCOME OPERATING MARGINS 2017 2016 2017 (1)\n2016 (2)\n2017 2016 Label and Graphic Materials $ 4,511.7 $ 4,187.3 $ 567.3 $ 516.2 12.6 % 12.3 % Retail Branding and Information Solutions 1,511.2 1,445.4 122.9 102.6 8.1 % 7.1 % Industrial and Healthcare Materials 590.9 453.8 50.5 54.6 8.5 % 12.0 % Corporate Expense N/A N/A (88.2 ) (136.4 ) N/A N/A TOTAL FROM OPERATIONS $ 6,613.8 $ 6,086.5 $ 652.5 $ 537.0 9.9 % 8.8 % (1)\nOperating income for fiscal year 2017 includes severance and related costs of $31.2, asset impairment and lease cancellation charges of $2.2, and transaction costs of $5.2, partially offset by net gain on sales of assets of $2.1. Of the total $36.5, the Label and Graphic Materials segment recorded $14.5, the Retail Branding and Information Solutions segment recorded $18.1, the Industrial and Healthcare Materials segment recorded $3.7, and Corporate recorded $.2.\n(2)\nOperating income for fiscal year 2016 includes severance and related costs of $14.7, asset impairment and lease cancellation charges of $5.2, loss from settlement of pension obligations of $41.4, and transaction costs of $5, partially offset by net gain on sales of assets of $1.1. Of the total $65.2, the Label and Graphic Materials segment recorded $13, the Retail Branding and Information Solutions segment recorded $9.8, the Industrial and Healthcare Materials segment recorded $1.9, and Corporate recorded $40.5.\nRECONCILIATION FROM GAAP TO NON-GAAP SUPPLEMENTARY INFORMATION Twelve Months Year-to-Date OPERATING INCOME OPERATING MARGINS 2017 2016 2017 2016 Label and Graphic Materials\nOperating income and margins, as reported $ 567.3 $ 516.2 12.6 % 12.3 % Adjustments: Restructuring charges: Severance and related costs 14.5 5.8 0.3 % 0.1 % Asset impairment and lease cancellation charges 0.3 2.7 --- 0.1 % Transaction costs 0.5 4.5 --- 0.1 % Gain on sale of assets (0.8 ) --- --- --- Adjusted operating income and margins (non-GAAP) $ 581.8 $ 529.2 12.9 % 12.6 % Retail Branding and Information Solutions\nOperating income and margins, as reported $ 122.9 $ 102.6 8.1 % 7.1 % Adjustments: Restructuring charges: Severance and related costs 16.5 8.4 1.1 % 0.6 % Asset impairment and lease cancellation charges 1.9 2.1 0.1 % 0.2 % Net gain on sales of assets (1.5 ) (1.1 ) (0.1 %) (0.1 %) Transaction costs related to sale of product line 1.2 0.4 0.1 % --- Adjusted operating income and margins (non-GAAP) $ 141.0 $ 112.4 9.3 % 7.8 % Industrial and Healthcare Materials\nOperating income and margins, as reported $ 50.5 $ 54.6 8.5 % 12.0 % Adjustments: Restructuring charges: Severance and related costs 0.2 0.5 0.1 % 0.1 % Asset impairment charges --- 0.4 --- 0.1 % Transaction costs 3.5 1.0 0.6 % 0.3 % Adjusted operating income and margins (non-GAAP) $ 54.2 $ 56.5 9.2 % 12.5 % A-8\nAVERY DENNISON CORPORATION PRELIMINARY SUPPLEMENTARY INFORMATION (UNAUDITED) Fourth Quarter 2017 Total\nCompany\nLabel and\nGraphic\nMaterials\nRetail Branding\nand Information\nSolutions\nIndustrial and\nHealthcare\nMaterials\nReconciliation of GAAP to Non-GAAP sales change Reported sales change 11.9 % 9.2 % 5.2 % 60.3 % Foreign currency translation (2.8 %) (3.6 %) (0.5 %) (3.4 %) Sales change ex. currency (non-GAAP) 9.1 % 5.6 % 4.7 % 56.9 % Acquisitions (4.4 %) (1.1 %) --- (51.2 %) Organic sales change (non-GAAP) (1) 4.7 % 4.6 % 4.7 % 5.7 % Full Year 2017 Total\nCompany\nLabel and\nGraphic\nMaterials\nRetail Branding\nand Information\nSolutions\nIndustrial and\nHealthcare\nMaterials\nReconciliation of GAAP to Non-GAAP sales change Reported sales change 8.7 % 7.7 % 4.6 % 30.2 % Foreign currency translation (0.5 %) (0.8 %) 0.4 % (0.4 %) Sales change ex. currency (non-GAAP) (1) 8.2 % 6.9 % 5.0 % 29.9 % Acquisitions (3.9 %) (2.7 %) --- (27.9 %) Organic sales change (non-GAAP) (1) 4.2 % 4.2 % 5.0 % 2.0 % (1)\nTotals may not sum due to rounding.\nView source version on businesswire.com: http://www.businesswire.com/news/home/20180131005488/en/\nAvery Dennison Corporation\nMedia Relations:\nRob Six, (626) 304-2361\nrob.six@averydennison.com\nor\nInvestor Relations:\nCynthia S. Guenther, (626) 304-2204\ninvestorcom@averydennison.com\nSource: Avery Dennison Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.investors.averydennison.com&esheet=51751310&newsitemid=20180131005488&lan=en-US&anchor=www.investors.averydennison.com&index=3&md5=9c818ab86905970d3c9d84185c4068a6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.investors.averydennison.com&esheet=51751310&newsitemid=20180131005488&lan=en-US&anchor=www.investors.averydennison.com&index=1&md5=71e4858e9f6f41d119c49d75539b375c", "http://www.businesswire.com/news/home/20180131005488/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.averydennison.com&esheet=51751310&newsitemid=20180131005488&lan=en-US&anchor=www.averydennison.com&index=2&md5=f63620f04ea8abe476b622ba600f2485"], "published": "2018-01-31T14:45:00.000+02:00", "crawled": "2018-01-31T17:47:57.016+02:00", "highlightTitle": ""}