{"organizations": [], "uuid": "759945ed29621176b3864857c64b3e7c58a5e621", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-897614860.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/apple-iphone-speed-battery-update/", "country": "US", "domain_rank": 1196, "title": "Apple's Tool That Slowed Down Old iPhones to Be Addressed in Update | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.148, "site_type": "news", "published": "2018-01-24T02:00:00.000+02:00", "replies_count": 0, "uuid": "759945ed29621176b3864857c64b3e7c58a5e621"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/24/apple-iphone-speed-battery-update/", "ord_in_thread": 0, "title": "Apple's Tool That Slowed Down Old iPhones to Be Addressed in Update | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "apple inc.", "sentiment": "negative"}, {"name": "apple", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg January 24, 2018 \nApple Inc. plans to release a software update that will let users disable a function that slowed down older iPhones to preserve battery life, the company said Wednesday. \nThe change will come as part of an iOS 11.3 software update, which will be released in the spring for consumers and was released Wednesday as a test for developers. The software update will also let iPhone users access their hospital health records, adds new animated emojis for the iPhone X, and new video features for the Apple Music service and the news-reading app. \nOnce the update arrives, users will be able to measure the health of their iPhone battery and turn off an unpopular function that slows down the handsets. In December, Apple was criticized when it was discovered the company intentionally slows some older iPhones. The throttling was installed to lengthen iPhone batteries’ lifespan. When a user replaced an aging battery, the mechanism would be disabled. \nApple apologized and lowered the price of battery replacements by $50 in 2018. The software update will also tell users when they should get their battery replaced. Apple warns that disabling the feature to slow down iPhones could result in devices unexpectedly rebooting. \nA long-anticipated addition to the iPhone’s Health app, the health records feature will enable users to pull up their medical history, such as past procedures and lab results. Apple has partnered with 12 hospitals on the feature, including Johns Hopkins Medicine and UC San Diego Health, the company said in a statement Wednesday. \nThe iOS 11.3 update also improves the company’s ARKit augmented reality platform for iOS devices and will let users project virtual objects onto walls and doors. Apple is working on a multiperson mode for ARKit that would improve gaming apps, expected later this year, Bloomberg News has reported. The software update will also improve security for HomeKit devices, upgrade music video playback in the Apple Music service, add a new video section to Apple News and send location information to emergency services during a call. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-24T02:00:00.000+02:00", "crawled": "2018-01-25T08:48:20.007+02:00", "highlightTitle": ""}