{"organizations": [], "uuid": "5e23b3c87496f14d739522f7d38c228c4f6a4481", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222049605&w=1200&r=LYNXMPEE0E06K", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/global-precious/gold-hits-four-month-high-as-dollar-index-slumps-to-three-year-lows-idINKBN1F40C4", "country": "US", "domain_rank": 408, "title": "Gold hits four-month high as dollar index slumps to three year-lows", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T06:26:00.000+02:00", "replies_count": 0, "uuid": "5e23b3c87496f14d739522f7d38c228c4f6a4481"}, "author": "", "url": "https://in.reuters.com/article/global-precious/gold-hits-four-month-high-as-dollar-index-slumps-to-three-year-lows-idINKBN1F40C4", "ord_in_thread": 0, "title": "Gold hits four-month high as dollar index slumps to three year-lows", "locations": [], "entities": {"persons": [{"name": "stephen innes", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "oanda", "sentiment": "none"}, {"name": "apac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 4:31 AM / Updated 3 hours ago Gold hits 4-month high as dollar index falls to 3-year low Zandi Shabalala 3 Min Read \nLONDON (Reuters) - Gold prices hit a four-month peak on Monday as the U.S. dollar index slumped to its lowest in three years but analysts said the greenback’s slide could be short-lived as it was not driven by fundamentals. Gold jewels are seen in a jewellery shop in downtown Rome, Italy, December 11, 2017. REUTERS/Max Rossi/Files \nSpot gold was up 0.2 percent at $1,341.92 an ounce by 1238 GMT after touching its strongest since Sept. 8 at $1,344.44. The precious metal rose for a fifth straight week last week, gaining 1.4 percent. \nU.S. gold futures were up 0.6 percent at $1,343.20 an ounce. \n“The weakness in the dollar is not justified by fundamentals. It’s a little bit weird considering the divergence in monetary policy should play in favour of a stronger dollar,” Capital Economics analyst Simona Gambarini said. \nShe said the U.S. Federal Reserve was widely expected to raise interest rates, which would favour a stronger dollar, while the European Central Bank should keep rates on hold. \nThe dollar index was down 0.5 percent at 90.516, having reached its weakest since January 2015 at 90.421. \nA weaker U.S. currency makes dollar-denominated assets such as gold cheaper for holders of other currencies, while higher rates could dent demand for non-interest-paying gold. \n“The main reason for the tight relationship between the dollar and gold is a lack of physical demand on the gold side in terms of ETFs (exchange-traded funds) and Indian and Chinese jewellery,” said Carsten Menke, a Julius Baer commodity analyst. \nAdding a touch of bullishness to gold was data from the U.S. Commodity Futures Trading Commission on Friday, which showed hedge funds and money managers raised their net long positions in COMEX gold and silver in the week to Jan. 9. \nIran’s president said on Sunday the United States had failed to undermine a nuclear deal between Tehran and major powers, and hailed the accord as a “long-lasting victory” for Iran, state television reported. \nU.S. President Donald Trump on Friday delivered an ultimatum to European signatories of the deal to fix the “terrible flaws” in the agreement with Iran, or the United States would pull out. \nPalladium rose 0.5 percent to $1,128.50 on Monday, after hitting a record high of $1,138. \nThe metal has seen a sustained rally from high demand in the auto industry amid a supply deficit, analysts said. \nSpot silver rose 0.3 percent to $17.31 an ounce, after touching a near three-month high at $17.42. \nPlatinum was up 0.4 percent at $997.20, after touching its highest since Sept. 11 at $1,001.40. Additional reporting by Nallur Sethuraman in Bengaluru; Editing by Dale Hudson and Edmund Blair", "external_links": [], "published": "2018-01-15T06:26:00.000+02:00", "crawled": "2018-01-15T06:43:54.020+02:00", "highlightTitle": ""}