{"organizations": [], "uuid": "dd30a4ebd26e5b9b28b10e25aca7a57055521018", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/trump-mlk-day.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/15/martin-luther-king-jr-day-federal-holiday-donald-trump/", "country": "US", "domain_rank": 1196, "title": "Commentary: Martin Luther King Tried to Warn Us About Trump | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.196, "site_type": "news", "published": "2018-01-15T11:00:00.000+02:00", "replies_count": 0, "uuid": "dd30a4ebd26e5b9b28b10e25aca7a57055521018"}, "author": "James Braxton Peterson", "url": "http://fortune.com/2018/01/15/martin-luther-king-jr-day-federal-holiday-donald-trump/", "ord_in_thread": 0, "title": "Commentary: Martin Luther King Tried to Warn Us About Trump | Fortune", "locations": [], "entities": {"persons": [{"name": "martin luther king", "sentiment": "negative"}, {"name": "james braxton peterson", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "king", "sentiment": "none"}, {"name": "martin luther king jr.", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}], "organizations": [{"name": "king", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By James Braxton Peterson 9:00 AM EST \nAs America turns once again to our perennial celebration of the life of Dr. Martin Luther King Jr., a full year of Donald Trump on full Technicolor display has cast its inimitable shadow over the legacy of one of the greatest American citizens in this nation’s history. King’s radical call for America to live up to its constitutional principles—that it fulfill its promise of freedom and equality for its own citizens—exposes the central slogan of Trumpism, “Make America Great Again,” as the antithesis of our democratic experiment. \nPresident Donald Trump and his supporters want to return our nation to the times when King fought vehemently for America to realize the promise of its own constitutional principles. How have we allowed Trumpism to utterly displace King’s utopian dreams? \nPerhaps we are missing the essence of some of King’s most dire messages. First, he was disturbed by income inequality. In his 1967 book, Where Do We Go From Here: Chaos or Community? , King argues for the “total, direct and immediate abolition of poverty,” concluding that the “ curse of poverty has no justification in our age .” Sadly, income inequality has been on a tear in this nation for decades now. And no warnings about the dangers of neoliberalism have been half as effective as King’s sincere prophetic vision about the perils of poverty in a hyper-capitalist nation. \nKing would have been disgusted by the recently passed Trump-GOP tax bill, known as the Tax Cuts and Jobs Act. It is designed almost exclusively to benefit corporations and millionaires (and billionaires). King would have viewed this legislation as one of the decrepit consequences of unchecked late capitalism: a wealthy, charlatan president who leverages anti-black racism and fear in order to exploit the power of the presidency for personal gain. \nKing warned us, “Our only hope today lies in our ability to recapture the revolutionary spirit and go out into a sometimes hostile world declaring eternal hostility to poverty, racism, and militarism .” Yet today we are losing the war on poverty. Nearly one in five children in our nation are growing up below the poverty level . \nBlack and Latino children are woefully overrepresented in this data, so we aren’t winning on the front against racism either. Revisit King’s rhetorical mastery in his “Letter From a Birmingham Jail,” if only to understand the travesty of the white evangelical embrace of Trumpism, even as this president continues to push for the building of a border wall and the banning of Muslims from entering the U.S. \nOn war, this president has surrounded himself with generals and seems to take unseemly pleasure in dropping big bombs. Trump’s characteristic bellicosity in interacting with foreign governments seems to regularly threaten a breakdown in international relationships. And all of this, of course, is to say nothing of his easy flirtation with nuclear disaster; today we seem closer to war with North Korea than ever before. \nWhether it concerns poverty, racism, or war, Trump represents everything that King built a legacy to resist and reject. In this sense, Trump is precisely who King was so earnestly warning us about half a century ago. \nJames Braxton Peterson is a media contributor, the host of The Remix podcast on WHYY, and the author of several books, including Prison Industrial Complex for Beginners . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-15T11:00:00.000+02:00", "crawled": "2018-01-15T17:23:15.012+02:00", "highlightTitle": ""}