{"organizations": [], "uuid": "3493e0e24725ac0de8a5ebb2107b18b8628a3d71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-premier-commercial-bancorp-reports-full-year-and-fourth-quarter-2017-results.html", "country": "US", "domain_rank": 767, "title": "Premier Commercial Bancorp Reports Full Year and Fourth Quarter 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-25T01:40:00.000+02:00", "replies_count": 0, "uuid": "3493e0e24725ac0de8a5ebb2107b18b8628a3d71"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-premier-commercial-bancorp-reports-full-year-and-fourth-quarter-2017-results.html", "ord_in_thread": 0, "title": "Premier Commercial Bancorp Reports Full Year and Fourth Quarter 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "hillsboro", "sentiment": "none"}, {"name": "ore.", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "hillsboro", "sentiment": "none"}], "organizations": [{"name": "premier commercial bancorp", "sentiment": "negative"}, {"name": "premier community bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HILLSBORO, Ore., Jan. 24, 2018 (GLOBE NEWSWIRE) -- Premier Commercial Bancorp (OTC:PRCB), a single bank holding company for Premier Community Bank based in Hillsboro, Oregon, today reported net income of $3.4 million, or $0.58 per diluted share, for the twelve months ended December 31, 2017, which included a $1.0 million, or $0.17 per diluted share, one-time tax expense related to recently enacted tax reform. Income for 2017 before the one-time tax expense was $4.4 million, or $0.75 per diluted share, a 24.7% increase over the net income of $3.5 million, or $0.60 per diluted share, for the same twelve month period during 2016. Reported fourth quarter 2017 net loss was $26,000, or $0.00 per diluted share and included the one-time tax expense of $1.0 million, or $0.17 per diluted share, compared to net income of $1.1 million, or $0.18 per diluted share, for third quarter 2017, and $1.4 million, or $0.24 per diluted share, for second quarter 2017, and $939,000, or $0.16 per diluted share, for first quarter 2017.\nHighlights for the period included:\nYear over year net income before the impact of tax reform increased 24.7% to $4.4 million for 2017. Net interest margin of 4.43% for full-year 2017 grew 13 basis points compared to 4.30% for 2016 and net interest margin for fourth quarter 2017 was 4.53%. Net interest income increased by $1.5 million or 10.7% to $16.2 million in 2017, compared to $14.7 million in 2016. Non-performing assets were reduced by $4.6 million, or 60.5%, over the year to $3.0 million at year-end 2017 and consisted solely of OREO. Strong loan metrics with no loans on non-accrual status or past due greater than 30 days at end of quarter. Strong organic loan growth of $26.0 million, or 8.2%, during 2017. Local non-interest bearing deposit growth of $15.3 million, or 12.5% during 2017. Efficiency ratio of 61.2% during 2017 compared to 64.9% during 2016. Return on equity and return on assets excluding the impact of tax reform increased in 2017 to 11.32% and 1.12%, respectively; compared to 2016 returns of 10.11% and 0.97%.\n“Despite the anomaly in fourth quarter earnings due to the tax reform impact, 2017 was an outstanding year with organic balance sheet growth and changes in its composition that led to strong results. We continue to be encouraged by the economic environment in Portland and future opportunities for growth, including opening our first eastside location in the Lloyd district of Portland which is expected to open during the first quarter of 2018,” stated Rick A. Roby, the Company’s President and CEO.\nEarnings\nNet income for the full year 2017 was $3.4 million, which included a one-time tax expense of $1.0 million from the devaluation of the Bank’s net deferred tax asset as a result of the reduction in the federal corporate tax rate under the recently enacted Tax Cuts and Jobs Act. Full-year 2017 income before the one-time tax expense was $4.4 million, a 24.7% increase from 2016 net income of $3.5 million. Net income for 2017 was also impacted by three other significant events during the year. The first was a $1.1 million recovery related to a non-performing loan’s full payoff which allowed the Company to negative provision $1.3 million (the full amount of the recovery plus an additional $200,000 of reserves specifically associated with the loan). The second item related to other real estate owned (“OREO”) where the Company wrote down the carrying amount of various properties by $809,000 during the year to more aggressively market these remaining non-performing assets. The third and last non-recurring event was losses taken on the sale of investments totaling $164,000 during the fourth quarter. To take advantage of the existing higher corporate tax rates in effect in 2017, the Company sold investments that were in a loss position and repurchased higher yielding investments which will benefit future income.\nNet interest income for 2017 was $16.2 million, up $1.5 million or 10.7%, from the $14.7 million in 2016. The change in net interest income was driven by the increase in earnings on assets, which at $18.3 million for 2017, was a $1.6 million, or 9.8% increase from $16.7 million in 2016. Interest expense of $2.1 million, increased marginally during 2017 by $66,000, from $2.0 million in 2016. “In 2017 the Company’s net interest margin grew considerably by 13 basis points to 4.43% from 4.30% in 2016. Rising market interest rates and improved asset mix caused interest income to grow, while growth of local low-cost deposits allowed the reduction of more expensive non-local deposits and debt, which in turn kept interest expense flat. These changes to asset and liability mixes position the Company well to benefit from future increases in market interest rates,” said Jason Wessling, the Company’s Chief Financial Officer.\nNon-interest income for 2017 of $833,000, increased $92,000 or 12.4%, from 2016 non-interest income of $741,000. Non-interest expense for 2017 of $10.4 million increased, $459,000 or 4.6%, from the 2016 amount of $10.0 million. The increase in non-interest expense for 2017 was driven by increased employee and lease expenses, which was related significantly to the growth into the eastside location. The Company’s efficiency ratio, which ignores the non-recurring items previously discussed, improved to 61.2% in 2017 from 64.9% in 2016.\nReported return on equity at 8.63% and return on assets of 0.85% for the full year of 2017 includes the $1.0 million one-time additional tax expense. Return on equity excluding the one-time tax expense, was 11.32%, and return on assets was 1.12%, which were increases of 1.21% and 0.15%, respectively, when compared to return on equity at 10.11% and return on assets at 0.97% for 2016.\nAssets\nThe Company’s total assets were $400.5 million at December 31, 2017 and grew $10.1 million or 2.6% during 2017, from $390.4 million at December 31, 2016. While overall asset growth slowed due to the reduction of cash and non-performing assets (both problem loans and OREO properties), loans continued to grow. As of December 31, 2017 loans totaled $343.6 million and grew $26.0 million during 2017 or 8.2%, compared to the $317.6 million as of December 31, 2016. During 2017 non-performing assets decreased $4.5 million, or 60.5%, due to the full-payoff of a non-accrual loan and the reduction of OREO through a variety of write-downs and sales.\nLoan growth for 2017 was driven by an increase in commercial real estate loans by $17.3 million or 10.8% year-over-year and were $177.2 million or 51.6% of the loan portfolio at year-end 2017, compared to $159.9 million or 50.4% at year-end 2016. Commercial and industrial loans (C&I Loans) grew $1.7 million or 2.0% year-over-year and were $89.2 million or 26.0% of the total loan portfolio at year-end 2017, compared to $87.5 million or 27.5% at year-end 2016. Construction loans grew $5.7 million or 13.0% year-over-year and were $49.0 million or 14.3% of the total loan portfolio at year-end 2017, compared to $43.4 million or 13.7% at year-end 2016. About loan growth Fred Johnson, the Company’s Chief Credit Officer stated, “We continue to grow our loan portfolio through the addition of quality customer relationships in our local markets. Our experienced group of lenders continues to focus on relationship opportunities that often include considerable deposits rather than merely one-time loan transactions. The recent consolidation of banks in our market and our expansion to the eastside of Portland will continue to drive opportunities into 2018 and beyond as we are getting our name out as Portland’s 'Premier' community bank.”\nThe allowance for loan loss at $4.3 million as of year-end 2017, decreased $150,000 from the year-end 2016 amount of $4.4 million due to the payoff of a large non-performing loan during second quarter 2017 which resulted in a $1.1 million recovery and also released $200,000 of specific allowance, and therefore resulted in a $1.3 negative loan loss provision during that quarter. There was no loan loss provision expense for 2017 as the credit metrics of the loan portfolio remained strong, including no past due loans as of December 31, 2017, which supported the reduced allowance for loan loss to total loans to 1.24% at year-end 2017 compared to 1.27% at year-end 2016. Non-performing assets at year-end 2017 were comprised entirely of $3.0 million in OREO, which consisted of four properties ranging in carrying amounts from $41,000 to $1.8 million.\nDeposits\nDeposits totaled $330.6 million as of December 31, 2017, which increased year-over-year by $12.9 million or 4.1%, compared to the $317.7 million at December 31, 2016. During 2017, local organic deposits actually grew $15.9 million, or 5.4%, while higher cost non-local deposits, including bulletin-board time deposits and brokered deposits were reduced $3.0 million, or 13.8%, during 2017.\nAs of December 31, 2017, non-interest bearing and NOW accounts totaled $138.3 million, or 41.8% of total deposits, and these accounts increased $15.3 million, or 12.5% during the year. Money market and savings accounts totaled $126.9 million or 38.4% of total deposits, while time deposits were $65.4 million, or 19.8% of total deposits, as of December 31, 2017.\nBorrowings, Equity and Capital\nBob Ekblad, the Company’s Chief Operating Officer stated, “The Bank is really proud of its continued successes at core deposit acquisition and how it has allowed for the reduction of other more expensive liabilities.” Federal Home Loan Bank (FHLB) borrowings at December 31, 2017 totaled $16.0 million which was a $5.6 million or 25.8% reduction over the year when compared to the year-end 2016 amount of $21.6 million. FHLB borrowings have a weighted average cost of 1.84% as of December 31, 2017, with rates from 1.08% to 2.25% and maturities ranging from February 2018 to November 2022. In December 2017 $16.0 million in FHLB debt matured at a blended rate of 3.17% and was either refinanced at lower rates or paid off with excess cash. The Company’s junior subordinated debentures, utilized as capital at the Bank, remain unchanged at $8.2 million as of December 31, 2017. The Company has two separate junior subordinated debentures, both with variable rates tied to the three-month LIBOR; one for $3.1 million with a spread of 3.15% and a current rate of 4.82%, while the other debenture for $5.1 million has a spread of 1.90% and a current rate of 3.49%. Repurchase account balances as of December 31, 2017 totaled $548,000, down significantly from year-end 2016 when they totaled $1.7 million, as the Bank has worked with these account holders to transition into traditional deposit accounts.\nEquity grew $3.4 million, or 9.4%, from retained earnings during 2017 to $39.9 million when compared to the $36.5 million at year-end 2016. The one-time tax expense of $1.0 million due to tax reform reduced equity growth, but the Bank’s capital continues to grow and outpaced asset growth as its tier 1 leverage ratio increased to 11.85% at year-end 2017 compared to 11.48% at year-end 2016. The one-time tax expense combined with an increase in risk-weighted assets, through the reduction of cash and increase of loans, caused the Bank’s total risk-based capital ratio to decrease slightly to 13.0% at year-end 2017 compared to year-end 2016 of 13.2%; however this and the Bank’s other capital ratios continued to be well above amounts required to be considered “well-capitalized” according to traditional regulatory capital standards.\nAbout Premier Commercial Bancorp:\nInformation about the Company’s stock may be obtained through the over-the-counter marketplace at www.otcmarkets.com . Premier Commercial Bancorp’s stock symbol is “PRCB.”\nPremier Commercial Bancorp was formed in 2002 as a holding company for Premier Community Bank which was opened in 1999 by local business people to deliver loan and deposit product solutions through experienced and professional bankers to businesses, nonprofits, professionals, and individuals. The Bank serves the greater Portland Metropolitan area with four offices in Washington County and also serves Yamhill County with an office in Newberg.\nFor more information about Premier Commercial Bancorp, or its subsidiary Premier Community Bank, call (503) 693-7500 or visit our website at www.pcboregon.com . Information contained in or linked to our website is not incorporated as a part of this release.\nCertain statements in this release may constitute forward-looking statements within the definition of the “safe-harbor” provisions of Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are subject to significant uncertainties, which could cause actual results to differ materially from those set forth in such statements. Forward-looking statements are those that incorporate management’s current expectations and plans based on information currently known to them. These statements can sometimes be identified by words such as “believe,” “estimate,” “anticipate,” “expect,” “intend,” “will,” “may,” “should,” or other similar phrases or words. Readers are cautioned not to place undue reliance on forward-looking statements. In particular, they should not be construed as assurances of a given level of performance or as promises of a given set of management’s actions. Some of the factors that could cause management to deviate from its current plans, or could cause the Company’s results to differ from current expectations, include the effect of localized or regional economic shifts that may affect the collectability of loans or the value of the collateral underlying those loans; the effects of laws, regulations, policies and government actions upon the Company’s assets and operations; sensitivity to the Northwestern Oregon geographic markets and events affecting those markets; and the impacts of new government initiatives upon us and our borrowers. The Company does not intend to publicly release any revisions to these forward-looking statements to reflect events or circumstances after the date of this release or to reflect the occurrence of unanticipated events.\nConsolidated Balance Sheets\nUnaudited\n(amounts in 000s, except per share data and ratios) December 31, % Change September 30, % Change 2017 2016 2017 vs. 2016 2017 Quarter ASSETS Cash & due from banks $ 16,602 $ 29,346 -43.4 % $ 13,790 20.4 % Investment securities - available for sale 20,597 23,589 -12.7 % 21,842 -5.7 % Investments - other 4,634 2,815 64.6 % 4,879 -5.0 % Gross loans 343,605 317,604 8.2 % 333,940 2.9 % Allowance for loan losses (4,264 ) (4,414 ) -3.4 % (4,254 ) 0.2 % Net loans 339,341 313,190 8.3 % 329,686 2.9 % Other real estate owned 2,968 4,042 -26.6 % 3,907 -24.0 % Other assets 16,400 17,430 -5.9 % 17,228 -4.8 % Total Assets $ 400,542 $ 390,412 2.6 % $ 391,332 2.4 % LIABILITIES Deposits $ 330,623 $ 317,701 4.1 % $ 316,227 4.6 % Repurchase agreements 548 1,688 -67.5 % 10 5380.0 % FHLB borrowings 16,000 21,550 -25.8 % 21,550 -25.8 % Junior subordinated debentures 8,248 8,248 0.0 % 8,248 0.0 % Other liabilities 5,173 4,713 9.8 % 5,288 -2.2 % Total Liabilities 360,592 353,900 1.9 % 351,323 2.6 % STOCKHOLDERS' EQUITY 39,950 36,512 9.4 % 40,009 -0.1 % Total Liabilities and Stockholders' Equity $ 400,542 $ 390,412 2.6 % $ 391,332 2.4 % Shares outstanding at end-of-period 5,849,966 5,840,609 5,851,487 Book value per share $ 6.83 $ 6.25 $ 6.84 Allowance for loan losses to total loans 1.24 % 1.39 % 1.27 % Non-performing assets (non-accrual loans & OREO) $ 2,968 $ 7,523 $ 3,907 Bank Tier 1 leverage ratio 11.85 % 11.48 % 12.07 % Bank Tier 1 risk-based capital ratio 11.87 % 11.95 % 12.13 % Bank Total risk-based capital ratio 13.00 % 13.20 % 13.27 % Consolidated Statements of Net Income\nUnaudited\n(amounts in 000s, except per share data and ratios) Twelve Months Ended\nThree Months Ended 12/31/2017 12/31/2016 % Change 12/31/2017 9/30/2017 % Change INTEREST INCOME Loans $ 17,601 $ 16,149 9.0 % $ 4,613 $ 4,454 3.6 % Investments - available for sale 445 367 21.3 % 101 109 -7.3 % Federal funds sold and other 265 154 72.1 % 77 77 0.0 % Total interest income 18,311 16,670 9.8 % 4,791 4,640 3.3 % INTEREST EXPENSE Deposits 1,212 1,159 4.6 % 313 303 3.3 % Repurchase agreements and federal funds purchased 3 9 -66.7 % - - N/A FHLB borrowings 564 586 -3.8 % 127 147 -13.6 % Junior subordinated debentures 296 255 16.1 % 77 77 0.0 % Total interest expense 2,075 2,009 3.3 % 517 527 -1.9 % NET INTEREST INCOME BEFORE LOAN LOSS PROVISION 16,236 14,661 10.7 % 4,274 4,113 3.9 % PROVISION FOR LOAN LOSSES (1,300 ) - N/A - - N/A NET INTEREST INCOME AFTER LOAN LOSS PROVISION 17,536 14,661 19.6 % 4,274 4,113 3.9 % NON-INTEREST INCOME 833 741 12.4 % 208 204 2.0 % NON-INTEREST EXPENSE 10,448 9,989 4.6 % 2,776 2,528 9.8 % INVESTMENTS- REALIZED GAINS / (LOSSES) (164 ) - N/A (164 ) - N/A OREO VALUATION ADJ. & GAINS/(LOSSES) ON SALES - NET (809 ) 139 -682.0 % 54 (100 ) -154.0 % INCOME BEFORE PROVISION FOR INCOME TAXES 6,948 5,552 25.1 % 1,596 1,689 -5.5 % PROVISION FOR INCOME TAXES 2,535 2,013 25.9 % 576 617 -6.6 % INCOME BEFORE IMPACT OF TAX REFROM $ 4,413 $ 3,539 24.7 % $ 1,020 $ 1,072 -4.9 % IMPACT OF TAX REFORM 1,046 - N/A 1,046 - N/A NET INCOME $ 3,367 $ 3,539 -4.9 % $ (26 ) $ 1,072 -102.4 % Earnings per share - Basic $ 0.58 $ 0.60 $ 0.00 $ 0.18 Earnings per share - Diluted $ 0.58 $ 0.60 $ 0.00 $ 0.18 Return on average equity 8.63 % 10.11 % -0.25 % 10.70 % Return on average assets 0.85 % 0.97 % -0.03 % 1.08 % Net interest margin 4.43 % 4.30 % 4.53 % 4.43 % Efficiency ratio 61.2 % 64.9 % 61.9 % 58.6 % NON- GAAP RATIOS - EXCLUDE IMPACT OF TAX REFORM Earnings per share - Basic $ 0.76 $ 0.60 $ 0.18 $ 0.18 Earnings per share - Diluted $ 0.75 $ 0.60 $ 0.17 $ 0.18 Return on average equity 11.32 % 10.11 % 9.94 % 10.70 % Return on average assets 1.12 % 0.97 % 1.01 % 1.08 % CONTACT: Rick A. Roby, President and Chief Executive Officer\n503-693-7500 or rick.roby@pcboregon.com\nSource:Premier Community Bank", "external_links": ["https://www.globenewswire.com/Tracker?data=xh93Q44JoM5x8IVit1Y4WHUCVDthJqmZbsGad1hYFJ_tFl4v8N5At6KLpGsrUTnzFPFel4rSEhVV51xBYO2htw==", "https://www.globenewswire.com/Tracker?data=3a4s3Db3VEn8Usy_3eTiWsdG2T0hG3Qss8Wv4HfZ_y4UW7Yyz1ClAiWPYkB9PrnI3zHjHvdCCoQsOZ-wyz_yp166UYLvWpncTat0c7cyejk=", "https://www.globenewswire.com/Tracker?data=tlEd8R0DpYpzQpjtAiA1XjtDUY4-a34ZeYDJrc-bF2KUH_-1TybMbHtdX1Hl_RsaoAAk9WomrieimBoPLI4spmrQkrJk7fRvfpqsISgXgXA=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f8784269-e682-4a9f-9b61-014ed9174e58"], "published": "2018-01-25T01:40:00.000+02:00", "crawled": "2018-01-25T01:39:05.000+02:00", "highlightTitle": ""}