{"organizations": [], "uuid": "13d716fbeb4ef01e1268c0d458615e829f0262a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/indices", "section_title": "Market Indices | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-holds-near-4-mth-peak-buoyed-by-weaker-dollar-idUSL3N1PB1BE", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold holds near 4-mth peak, buoyed by weaker dollar", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.897, "site_type": "news", "published": "2018-01-16T11:46:00.000+02:00", "replies_count": 0, "uuid": "13d716fbeb4ef01e1268c0d458615e829f0262a0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-holds-near-4-mth-peak-buoyed-by-weaker-dollar-idUSL3N1PB1BE", "ord_in_thread": 0, "title": "PRECIOUS-Gold holds near 4-mth peak, buoyed by weaker dollar", "locations": [], "entities": {"persons": [{"name": "sethuraman n r jan", "sentiment": "none"}, {"name": "edward meir", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "intl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Spot gold may test $1,357.54/oz - technicals * Palladium slips below Monday's record high * Silver off 3-mth top, platinum off 4-mth high (Adds comment, updates prices) By Sethuraman N R Jan 16 (Reuters) - Gold prices edged higher on Tuesday to hold just below a four-month high touched in the previous session, supported by a weaker U.S. dollar languishing near three-year lows. Spot gold was up 0.1 percent at $1,340.98 an ounce by 0650 GMT, after touching its strongest since Sept. 8 at $1,344.44 on Monday. U.S. gold futures rose 0.4 percent to $1,340.80 an ounce. \"Gold seems to be moving higher on account of rising inflationary expectations and a steep drop in the dollar,\" said INTL FCStone analyst Edward Meir. \"We are not sure if gold could withstand the higher yield environment going into 2018, especially if the dollar eventually reverses course. In addition, we don't see the recent spike in U.S. inflation lasting.\" The dollar index , which measures the greenback against a basket of currencies, fell on Monday to its lowest since December, 2014 at 90.279. It was last down 0.6 percent at 90.417. The euro stood near a 3-year peak on rising expectations that the European Central Bank could pare its monetary stimulus. ECB rate-setter Ardo Hansson on Monday said the central bank could end its bond purchase scheme in one go after September if the economy and inflation develop as expected. The dollar has weakened as markets grow increasingly confident that a global recovery would outpace U.S. growth and prompt other major central banks, led by the ECB, to unwind their easy money strategy faster than has been expected. \"We are likely to see further short squeezes over the near-term as the metal (gold) edges toward $1,350 and above this the September 2017 high around $1,357 will be the ultimate target for bulls,\" MKS PAMP Group trader Sam Laughlin said. \"Supportive interest around $1,330 should restrict any further declines. However, should we see a period of weakness, support broadly around $1,305 - $1,310 will act as a pivot point for the metal and will need to hold to continue the recent upward momentum.\" Spot gold may revisit its Sept. 8, 2017 high of $1,357.54 per ounce, as suggested by a retracement analysis, Reuters technical analyst Wang Tao said. Palladium , which marked a record high of $1,138 an ounce on Monday, was last down 0.3 percent at $1,123.10 on Tuesday. The metal has seen a sustained rally from high demand in the auto industry amid a supply deficit, analysts said. Spot silver was down 0.6 percent to $17.24 an ounce. It hit a three-month high of $17.42 on Monday. Platinum dropped 0.3 percent to $993.20, after touching its strongest since Sept. 11 at $1,001.40 on Monday. (Reporting by Nallur Sethuraman in Bengaluru; Editing by Richard Pullin and Sunil Nair)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T11:46:00.000+02:00", "crawled": "2018-01-16T10:18:43.098+02:00", "highlightTitle": ""}