{"organizations": [], "uuid": "0a07a19ed04a502c57485dd4a8ffa805b3eb9042", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/04/15/100643169-gold-bars-pyramid-ap.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/16/gold-edges-up-as-dollar-index-slumps-to-3-year-lows.html", "country": "US", "domain_rank": 767, "title": "Gold edges up as dollar index slumps to 3-year lows", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T04:54:00.000+02:00", "replies_count": 0, "uuid": "0a07a19ed04a502c57485dd4a8ffa805b3eb9042"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/gold-edges-up-as-dollar-index-slumps-to-3-year-lows.html", "ord_in_thread": 0, "title": "Gold edges up as dollar index slumps to 3-year lows", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gold prices edged up on Wednesday, as the U.S. dollar slumped to three-year lows against a basket of currencies.\nSpot gold was up 0.1 percent at $1,341 an ounce by 0250 GMT. It touched its strongest since Sept. 8 at $1,344.44 on Monday.\nU.S. gold futures were up 0.2 percent at $1,340 an ounce.\nThe dollar index was down 0.1 percent at 90.373, after dropping to its lowest since December, 2014 to 90.113.\n\"Most of the move in gold has been dollar denominated ... We have seen very little change in ETF holdings. There is very little change in perception of gold in terms of safe haven demand,\" said Mark Keenan, global commodities strategist and head of research - Asia-Pacific at Societe Generale.\n\"The outlook for gold in our view is down due to the lack of physical demand in Asia and the outlook for rate hikes this year is a headwind for gold.\"\nThe U.S. Federal Reserve is widely expected to raise interest rates multiple times this year, although at a gradual pace.\nGold is highly sensitive to rising U.S. interest rates, as these increase the opportunity cost of holding non-yielding bullion, while boosting the dollar, in which it is priced.\nAsian stocks stepped back from a record high on Wednesday as the region's resources shares were dented by falling oil and commodity prices, while digital currencies tumbled on worries about tighter regulation.\n\"While the U.S. dollar remains the most prominent driver of momentum, we cannot overlook the meltdown in Bitcoin on the back of regulatory oversight adding to the gold risk premium,\" said Stephen Innes, APAC head of trading at OANDA.\nDigital currencies tumbled, with bitcoin falling to a six-week low of $10,162 after reports said South Korea and China could ban trading, which intensified fears of a wider regulatory crackdown.\nSpot gold targets its Sept. 8, 2017 high of $1,357.54 per ounce, as suggested by its wave pattern and a retracement analysis, according to Reuters technical analyst Wang Tao.\nAmong other precious metals, spot palladium was up 0.8 percent at $1,102 per ounce. The metal, which hit a record high of $1,138 an ounce on Monday, fell nearly 3 percent on Tuesday.\nPalladium has had a sustained rally as high demand in the auto industry fueled supply concerns, sending Nymex palladium futures net long positions to record highs.\nSpot silver was mostly unchanged at $17.20 per ounce.\nSpot platinum rose 0.3 percent to $1,002, after touching its highest since Sept.8 at $1,006.60", "external_links": [], "published": "2018-01-17T04:54:00.000+02:00", "crawled": "2018-01-17T05:11:14.061+02:00", "highlightTitle": ""}