{"organizations": [], "uuid": "e3dfc0b0fac119155c41220d367914ff6935d3e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224104994&w=1200&r=LYNXMPEE0L0ON", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-czech-election-president-poll/czech-presidential-challenger-drahos-ahead-of-incumbent-zeman-in-poll-idUSKBN1FB10P", "country": "US", "domain_rank": 408, "title": "Czech presidential challenger Drahos ahead of incumbent Zeman in poll", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T11:38:00.000+02:00", "replies_count": 0, "uuid": "e3dfc0b0fac119155c41220d367914ff6935d3e9"}, "author": "", "url": "https://www.reuters.com/article/us-czech-election-president-poll/czech-presidential-challenger-drahos-ahead-of-incumbent-zeman-in-poll-idUSKBN1FB10P", "ord_in_thread": 0, "title": "Czech presidential challenger Drahos ahead of incumbent Zeman in poll", "locations": [], "entities": {"persons": [{"name": "drahos", "sentiment": "negative"}, {"name": "zeman", "sentiment": "negative"}, {"name": "milos zeman", "sentiment": "none"}, {"name": "jiri drahos", "sentiment": "none"}], "locations": [{"name": "czech republic", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "mlada", "sentiment": "none"}, {"name": "kantar tns", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRAGUE (Reuters) - Independent challenger Jiri Drahos holds a narrow lead over Milos Zeman, the incumbent president of the Czech Republic, before this weekend’s election, but undecided voters could tilt the balance, an opinion poll showed on Monday.\nDrahos, a soft-spoken academic, is hoping to unite liberal, pro-western Czech voters alienated by Zeman’s blunt and occasionally vulgar style and preference for Russia and China.\nThe incumbent’s anti-immigration, anti-elitist message retains strong appeal. His long experience in politics as former leader of the center-left Social Democrats and prime minister in 1998-2002 are also advantages.\nA poll of 1,078 people by STEM/MARK for the newspaper Mlada fronta Dnes showed 47 percent of voters backed Drahos while 43 percent supported Zeman. The remaining 10 percent of undecided respondents who want to vote will be the decisive force.\nA previous poll by Kantar TNS released on Sunday, Zeman edged Drahos by 45.5 to 45 percent, although Drahos had more convinced voters.\nThe Jan. 26-27 second round echoes the divisions in presidential elections in neighbors Austria and Slovakia, as well as U.S. President Donald Trump’s battle with former Secretary of State Hillary Clinton for the White House in 2016.\nCzech presidential candidate Jiri Drahos greets his supporters during his campaign ahead of an election run-off, in Prague, Czech Republic January 22, 2018. REUTERS/David W Cerny The 73-year-old Zeman has courted the far right and the Communist Party in rejecting migrants from Muslim countries while pursuing warmer relations with Russia and China and sniping at the press. He won the first election round with 38.6 percent of the vote.\nDrahos, 68, finished second on 26.6 percent with support from liberal voters attracted by his policies favoring European Union integration.\nSlideshow (2 Images) The vote is seen as a referendum on Zeman, who has been in office since 2013. Most candidates who lost in the first round of voting have endorsed Drahos.\nCzech presidents have limited executive power, but they do appoint prime ministers and central bankers, represent the country abroad and can have a big influence in public opinion.\nThis election might also affect the leadership of the next government. Prime Minister Andrej Babis is rushing to form a new cabinet before a new presidential term starts on March 8.\nThe billionaire businessman Babis, whose ANO party was a runaway winner in a parliamentary election last October, has struggled to get governing partners while he battles police allegations of EU subsidy fraud, which he denies.\nZeman has backed Babis, who in turn has endorsed Zeman in the election. Drahos has advised Babis to step aside to help a new administration form and has said it would be unacceptable to have a prime minister who faces police charges.\nReporting by Jan Lopatka, editing by Larry King\n ", "external_links": [], "published": "2018-01-22T11:38:00.000+02:00", "crawled": "2018-01-22T11:51:05.009+02:00", "highlightTitle": ""}