{"organizations": [], "uuid": "a934ac91eff5ebf0f12ec646c858d3be1ab640a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/politicsNews/", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-court-lgbt/u-s-top-court-turns-away-challenge-to-mississippi-lgbt-law-idUSKBN1EX1H4", "country": "US", "domain_rank": 408, "title": "U.S. top court turns away challenge to Mississippi LGBT law", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:44:00.000+02:00", "replies_count": 0, "uuid": "a934ac91eff5ebf0f12ec646c858d3be1ab640a9"}, "author": "", "url": "https://www.reuters.com/article/us-usa-court-lgbt/u-s-top-court-turns-away-challenge-to-mississippi-lgbt-law-idUSKBN1EX1H4", "ord_in_thread": 0, "title": "U.S. top court turns away challenge to Mississippi LGBT law", "locations": [], "entities": {"persons": [{"name": "lawrence hurley", "sentiment": "none"}, {"name": "alistair bell", "sentiment": "none"}], "locations": [{"name": "mississippi", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mississipp", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "u.s. supreme court", "sentiment": "none"}, {"name": "naacp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "new orleans-based 5th u.s. circuit court of appeals", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 2:44 PM / Updated 6 hours ago U.S. top court turns away challenge to Mississippi LGBT law Lawrence Hurley 4   The U.S. Supreme Court on Monday ended the first legal challenge to a Republican-backed Mississippi law that permits businesses and government employees to refuse to serve lesbian, gay, bisexual and transgender people because of their religious beliefs. \nThe justices left in place a June ruling by the New Orleans-based 5th U.S. Circuit Court of Appeals that the plaintiffs - same-sex couples, civil rights advocates including the head of the state NAACP chapter, a church and others - did not have legal standing to bring the lawsuit. \nThe law, passed by the Republican-controlled state legislature and signed by Republican Governor Phillip Bryant with the backing of conservative Christian activists, has not yet been implemented and more legal challenges are expected, according to gay rights lawyers. \n“We will keep fighting in Mississippi until we overturn this harmful law, and in any state where antigay legislators pass laws to roll back LGBT civil rights,” said Beth Littrell, a lawyer with gay rights group Lambda Legal. \nPeople who are refused service once the law is in place may be more likely to be judged to have legal standing to sue. \nThe 2016 law was passed in the aftermath of the U.S. Supreme Court’s landmark 2015 ruling legalizing same-sex marriage nationwide. \nSupporters call it a religious liberty law that protects the sincerely held religious beliefs and moral convictions of individuals and businesses. Opponents said it authorizes discrimination against LGBT people in violation of the U.S. Constitution’s guarantees of equal protection under the law and the separation of church and state. \nConservative Christian legal group Alliance Defending Freedom is helping the state defend the law. \n”Good laws like Mississippi’s protect freedom and harm no one,” said Kevin Theriot, one of the group’s lawyers. \nMississippi’s law was one of a series of measures proposed in socially conservative, Republican-dominated states that gay rights advocates viewed as an attempt to undermine the high court’s gay marriage ruling. \nThe law, called the Protecting Freedom of Conscience from Government Discrimination Act, protects the beliefs that marriage is the union of one man and one woman, sex outside such a marriage is improper and gender is determined by anatomy and genetics at birth and cannot change. \nAmong other things, the measure lets businesses refuse to provide marriage-related services to same-sex couples and allows judges, magistrates and justices of the peace to refuse to perform same-sex weddings. \nThe measure was blocked in 2016 by a Mississippi-based federal judge who said it unconstitutionally allowed “arbitrary discrimination” against LGBT people and unmarried people. The 5th Circuit overturned that ruling. \nOn a related issue, the Supreme Court is due to rule by the end of June whether a Colorado baker was within his constitutional rights to refuse to make a wedding cake for a gay couple on the basis of his conservative Christian beliefs. Reporting by Lawrence Hurley; Editing by Alistair Bell and Grant McCool", "external_links": [], "published": "2018-01-08T16:44:00.000+02:00", "crawled": "2018-01-08T17:04:24.000+02:00", "highlightTitle": ""}