{"organizations": [], "uuid": "e2336fc840f399c9a2165c7c3d92af734dde35a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-republic-first-bancorp-inc-reports-80-percent-increase-in-net-income-and-deposit-growth-of-23-percent.html", "country": "US", "domain_rank": 767, "title": "Republic First Bancorp, Inc. Reports 80% Increase in Net Income and Deposit Growth of 23%", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-23T00:37:00.000+02:00", "replies_count": 0, "uuid": "e2336fc840f399c9a2165c7c3d92af734dde35a6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-republic-first-bancorp-inc-reports-80-percent-increase-in-net-income-and-deposit-growth-of-23-percent.html", "ord_in_thread": 0, "title": "Republic First Bancorp, Inc. Reports 80% Increase in Net Income and Deposit Growth of 23%", "locations": [], "entities": {"persons": [{"name": "harry d. madonna", "sentiment": "none"}, {"name": "vernon w. hill", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "republic first bancorp", "sentiment": "neutral"}, {"name": "republic first bancorp, inc", "sentiment": "neutral"}, {"name": "republic bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Jan. 22, 2018 (GLOBE NEWSWIRE) -- Republic First Bancorp, Inc. (NASDAQ:FRBK), the holding company for Republic Bank, today announced its financial results for the period ended December 31, 2017.\nTwelve Months Ended ($ in millions, except per share data) 12/31/17 12/31/16 % Change Assets $ 2,322.3 $ 1,923.9 21 % Loans 1,162.3 965.0 20 % Deposits 2,063.3 1,677.7 23 % Total Revenue $ 90.9 $ 69.5 31 % Net Income 8.9 4.9 80 % Net Income per Diluted Share $ 0.15 $ 0.12 25 % Vernon W. Hill, II, Chairman of Republic First Bancorp said:\n“2017 was another tremendous year for ‘The Power of Red is Back’ growth campaign. Deposits and loans continued to grow at exceptional rates. Our store network expanded to twenty-three convenient locations and we solidified our position as one of the top residential mortgage lenders in our market through the successful integration of the Oak Mortgage team. I am excited over the opportunities we see in 2018 and beyond to build on the success achieved to this point. We are clearly giving customers a reason to Love Their Bank Again.”\nHarry D. Madonna, President and Chief Executive Officer of Republic First Bancorp added:\n“The momentum of our expansion strategy continues to build as we attract new FANS throughout our footprint. We believe we’ve put ourselves in perfect position to capitalize on opportunities that arise as our competition continues to alienate customers with declining levels of service, higher fees and fewer locations. In addition, the reduction in the corporate tax rate included in Tax Cuts and Jobs Act of 2017 will result in a significant benefit for us in the years to come. We intend on utilizing the savings generated by this Act to invest in our growth and expansion which will result in the creation of new jobs, improvements in technology and the ability to further contribute to the communities which we serve.”\nHighlights for the Period Ended December 31, 2017\nNet income increased by 80% to $8.9 million, or $0.15 per share, for the twelve months ended December 31, 2017 compared to $4.9 million, or $0.12 per share, for the twelve months ended December 31, 2016. The Company continues to open new stores and increase net income despite the additional costs associated with the expansion strategy.\nNet Income was $2.7 million, or $0.05 per share, in the fourth quarter of 2017 compared to $2.3 million, or $0.04 per share, in the third quarter of 2017 and $1.5 million, or $0.03 per share, in the fourth quarter of 2016. Earnings in the fourth quarter of 2017 were impacted by two significant and infrequent events, as described below.\nThe Company reversed its deferred tax asset valuation allowance during the fourth quarter of 2017 resulting in an increase in net income of $2.9 million, or $0.05 per share, during the period. This entry factors in the impact of the new corporate tax rate under the Tax Cuts and Jobs Act signed into law on December 22, 2017.\nEarnings in the fourth quarter of 2017 were also impacted by a $2.2 million write-down related to the Company’s largest non-performing asset included in OREO. Management’s decision to aggressively pursue a resolution for this asset resulted in the execution of an agreement of sale a required reduction in the carrying value.\nTotal deposits increased by $386 million, or 23%, to $2.1 billion as of December 31, 2017 compared to $1.7 billion as of December 31, 2016.\nThe fastest growing segment of the Company’s deposit base is non-interest bearing demand deposits. These balances grew by 35% to $439 million during 2017.\nNew stores opened since the beginning of the “Power of Red is Back” expansion campaign are currently growing deposits at an average rate of $27 million per year. The average deposit growth for all stores over the last twelve months was approximately $20 million per store.\nA new store was recently opened in Fairless Hills, PA launching our expansion into Bucks County. Four new stores have been opened over the last twelve months, increasing the total store count to twenty-three locations. Six additional store openings are planned for 2018.\nTotal assets increased by $398 million, or 21%, to $2.3 billion as of December 31, 2017 compared to $1.9 billion as of December 31, 2016.\nTotal loans grew $197 million, or 20%, to $1.2 billion as of December 31, 2017 compared to $965 million at December 31, 2016.\nAsset quality continues to improve. The ratio of non-performing assets to total assets declined to 0.94% as of December 31, 2017 compared to 1.51% as of December 31, 2016.\nThe Company’s residential mortgage division, Oak Mortgage, is serving the home financing needs of customers throughout its footprint. Oak originated over $378 million in loans during 2017.\nMeeting the needs of small business customers continued to be an important part of the Company’s lending strategy. More than $51 million in new SBA loans were originated during 2017.\nThe Company’s Total Risk-Based Capital ratio was 16.70% and Tier I Leverage Ratio was 10.64% at December 31, 2017.\nBook value per common share increased to $3.97 as of December 31, 2017 compared to $3.79 as of December 31, 2016.\nIncome Statement\nThe major components of the income statement are as follows (dollars in thousands, except per share data):\nThree Months Ended Twelve Months Ended 12/31/17 12/31/16 %\nChange 12/31/17 12/31/16 %\nChange Total Revenue $ 24,421 $ 19,363 26 % $ 90,946 $ 69,539 31 % Provision for Loan Losses 400 - 100 % 900 1,557 (42 %) Non-interest Expense 21,622 15,970 35 % 75,276 56,293 34 % Income (Loss) Before Taxes (143 ) 1,447 (110 %) 5,986 4,826 24 % Provision (Benefit) for Taxes (2,881 ) (50 ) n/m (2,919 ) (119 ) n/m Net Income 2,738 1,497 83 % 8,905 4,945 80 % Net Income per Diluted Share $ 0.05 $ 0.03 67 % $ 0.15 $ 0.12 25 % The Company reported net income of $2.7 million, or $0.05 per diluted share, for the three month period ended December 31, 2017, compared to net income of $1.5 million, or $0.03 per diluted share, for the three month period ended December 31, 2016. Net income for the twelve month period ended December 31, 2017 was $8.9 million, or $0.15 per diluted share, compared to net income of $4.9 million, or $0.12 per diluted share, for the twelve months ended December 31, 2016. Net income in the fourth quarter of 2017 was impacted by two significant and infrequent events described in the following paragraphs.\nOn December 22, 2017, the Tax Cuts and Jobs Act was signed into law which included a reduction in the corporate tax rate from 35% to 21%. As a result of the change in the tax rate, the value of the Company’s existing deferred tax assets will permanently decrease by $7.7 million. A charge for this impairment was recorded during the fourth quarter. However, the Company has carried a valuation allowance against its deferred tax assets for the last several years. During the fourth quarter, management determined that the valuation allowance was no longer required and recorded an entry to reverse the $10.6 million valuation allowance. The combination of these two entries resulted in the recognition of a net tax benefit and increase in earnings in the amount of $2.9 million during the fourth quarter.\nEarnings in the fourth quarter were also impacted by a writedown of $2.2 million against the Company’s largest non-performing asset. Management’s decision to aggressively pursue a resolution for a property held in the other real estate owned portfolio resulted in the execution of an agreement of sale and a required reduction in the carrying value. Closing on the sale is expected to occur during the first quarter of 2018.\nTotal revenue increased by $5.1 million, or 26%, to $24.4 million for the three month period ended December 31, 2017, compared to $19.4 million for the three month period ended December 31, 2016. This increase is primarily attributable to higher interest income as a result of the strong growth in interest-earning assets over the last twelve months driven by the Company’s “Power of Red is Back” expansion program.\nNon-interest income increased to $5.0 million for the three month period ended December 31, 2017 compared to $4.7 million for the three month period ended December 31, 2016.\nNon-interest expenses increased by $5.7 million, or 35%, to $21.6 million during the three month period ended December 31, 2017 compared to $16.0 million during the three months ended December 31, 2016. This increase was primarily driven by the addition of expenses related to the “Power of Red is Back” growth and expansion strategy. Salary and employee benefit costs were higher at the Bank as a result of annual merit increases along with increased staffing levels related to our growth strategy. Three new stores were opened during 2017. The Company now has twenty-three store locations. Occupancy and equipment expenses associated with the growth strategy also contributed to the increase in non-interest expenses. In addition, the writedown of $2.2 million related to an OREO property described earlier also contributed to the increase in non-interest expenses.\nBalance Sheet\nThe major components of the balance sheet are as follows (dollars in thousands):\nDescription\n12/31/17\n12/31/16 %\nChange\n09/30/17 %\nChange Total assets $ 2,322,347 $ 1,923,931 21 % $ 2,141,563 8 % Total loans (net) 1,153,679 955,817 21 % 1,087,147 6 % Total deposits 2,063,295 1,677,670 23 % 1,885,405 9 % Total core deposits 2,043,816 1,677,403 22 % 1,876,840 9 % Total assets increased by $398 million, or 21%, as of December 31, 2017 when compared to December 31, 2016. Deposits grew by $386 million to $2.1 billion as of December 31, 2017 compared to $1.7 billion as of December 31, 2016. Non-interest bearing demand deposit balances increased by 35% during 2017. The number of deposit accounts has also grown by 35% during the past twelve months. The strong growth in assets, loans and deposits has been driven by the addition of new stores and the successful execution of the Company’s aggressive growth strategy referred to as “The Power of Red is Back.”\nCore Deposits\nCore deposits by type of account are as follows (dollars in thousands):\nDescription\n12/31/17\n12/31/16\n%\nChange\n09/30/17\n%\nChange 4th Qtr\n2017\nCost of\nFunds Demand noninterest-bearing $ 438,500 $ 324,912 35 % $ 398,794 10 % 0.00 % Demand interest-bearing 807,736 605,950 33 % 745,878 8 % 0.48 % Money market and savings 700,321 635,644 10 % 619,265 13 % 0.54 % Certificates of deposit 97,259 110,897 (12 %) 112,903 (14 %) 1.04 % Total core deposits $ 2,043,816 $ 1,677,403 22 % $ 1,876,840 9 % 0.43 % Core deposits increased by 22% to $2.0 billion at December 31, 2017 compared to $1.7 billion at December 31, 2016 as the Company moves forward with its growth strategy to increase the number of stores and expand its banking model which focuses on high levels of customer service and convenience and drives the gathering of low-cost, core deposits. On a percentage basis, the Company recognized strongest growth in non-interest bearing demand deposit balances year over year as a result of the successful execution of its strategy .\nLending\nLoan balances by type are as follows (dollars in thousands):\nDescription\n12/31/17 % of\nTotal\n12/31/16 % of\nTotal\n09/30/17 % of\nTotal Commercial real estate $ 433,304 37 % $ 378,519 40 % $ 415,532 38 % Construction and land development 104,617 9 % 61,453 5 % 93,657 8 % Commercial and industrial 173,343 15 % 174,744 20 % 163,085 15 % Owner occupied real estate 309,838 27 % 276,986 28 % 297,880 27 % Consumer and other 76,412 7 % 63,588 6 % 71,867 7 % Residential mortgage 64,764 5 % 9,682 1 % 53,384 5 % Gross loans $ 1,162,278 100 % $ 964,972 100 % $ 1,095,405 100 % Gross loans increased by $197 million, or 20%, to $1.2 billion at December 31, 2017 compared to $965 million at December 31, 2016 as a result of the steady growth in quality loan demand over the last twelve months and continued success with the relationship banking model. The Company experienced strongest growth in commercial real estate, residential mortgages and the owner occupied categories.\nAsset Quality\nThe Company’s non-performing asset balances and asset quality ratios are highlighted below:\nThree Months Ended 12/31/17 09/30/17 12/31/16 Non-performing assets / capital and reserves 9 % 10 % 13 % Non-performing assets / total assets 0.94 % 1.07 % 1.51 % Quarterly net loan charge-offs / average loans 0.02 % 0.43 % 0.12 % Allowance for loan losses / gross loans 0.74 % 0.75 % 0.95 % Allowance for loan losses / non-performing loans 58 % 60 % 48 % The percentage of non-performing assets to total assets decreased to 0.94% at December 31, 2017, compared to 1.51% at December 31, 2016. One of the Company’s largest non-performing loan relationships has been restructured and returned to performing status during 2017. In addition, the Company’s largest asset held in other real estate owned was written down during the fourth quarter of 2017 as a result of the Company’s decision to aggressively pursue the sale of this asset. The ratio of non-performing assets to capital and reserves decreased to 9% at December 31, 2017 compared to 13% at December 31, 2016.\nCapital\nThe Company’s capital ratios at December 31, 2017 were as follows:\nActual\n12/31/17 Regulatory Guidelines\n“Well Capitalized” Leverage Ratio 10.64% 5.00% Common Equity Ratio 14.75% 6.50% Tier 1 Risk Based Capital 16.13% 8.00% Total Risk Based Capital 16.70% 10.00% Tangible Common Equity 9.56% n/a Total shareholders’ equity increased to $226 million at December 31, 2017 compared to $215 million at December 31, 2016. Book value per common share increased to $3.97 at December 31, 2017 compared to $3.79 per share at December 31, 2016. The Company completed a common stock offering in the amount of $100 million during the fourth quarter of 2016.\nAbout Republic Bank\nRepublic Bank, a subsidiary of Republic First Bancorp, Inc., is a full-service, state-chartered commercial bank, whose deposits are insured up to the applicable limits by the Federal Deposit Insurance Corporation (FDIC). The Bank provides diversified financial products through its twenty-three store locations in the Greater Philadelphia and Southern New Jersey market place. Republic Bank stores are open 7 days a week, 361 days a year, with extended lobby and drive-thru hours providing customers with the most convenient hours compared to any bank in its market. The Bank offers free checking, free coin counting, ATM/Debit cards issued on the spot and access to more than 55,000 surcharge free ATMs worldwide via the Allpoint Network. The Bank also offers a wide range of residential mortgage products through its wholly owned subsidiary, Oak Mortgage Company. For more information about Republic Bank, visit www.myrepublicbank.com .\nForward Looking Statements\nThe Company may from time to time make written or oral “forward-looking statements”, including statements contained in this release and in the Company's filings with the Securities and Exchange Commission. The forward-looking statements contained herein, are subject to certain risks and uncertainties that could cause actual results to differ materially from those projected in the forward-looking statements. For example, risks and uncertainties can arise with changes in: general economic conditions, including turmoil in the financial markets and related efforts of government agencies to stabilize the financial system; the adequacy of our allowance for loan losses and our methodology for determining such allowance; adverse changes in our loan portfolio and credit risk-related losses and expenses; concentrations within our loan portfolio, including our exposure to commercial real estate loans, and to our primary service area; changes in interest rates; business conditions in the financial services industry, including competitive pressure among financial services companies, new service and product offerings by competitors, price pressures and similar items; deposit flows; loan demand; the regulatory environment, including evolving banking industry standards, changes in legislation or regulation; impact of the Dodd-Frank Wall Street Reform and Consumer Protection Act; our securities portfolio and the valuation of our securities; accounting principles, policies and guidelines as well as estimates and assumptions used in the preparation of our financial statements; rapidly changing technology; litigation liabilities, including costs, expenses, settlements and judgments; and other economic, competitive, governmental, regulatory and technological factors affecting our operations, pricing, products and services. You should carefully review the risk factors described in the Form 10-K for the year ended December 31, 2016 and other documents the Company files from time to time with the Securities and Exchange Commission. The words “would be,” “could be,” “should be,” “probability,” “risk,” “target,” “objective,” “may,” “will,” “estimate,” “project,” “believe,” “intend,” “anticipate,” “plan,” “seek,” “expect” and similar expressions or variations on such expressions are intended to identify forward-looking statements. All such statements are made in good faith by the Company pursuant to the “safe harbor” provisions of the U.S. Private Securities Litigation Reform Act of 1995. The Company does not undertake to update any forward-looking statement, whether written or oral, that may be made from time to time by or on behalf of the Company, except as may be required by applicable law or regulations.\nSource: Republic First Bancorp, Inc. Contact: Frank A. Cavallaro, CFO (215) 735-4422\nRepublic First Bancorp, Inc. Consolidated Balance Sheets (Unaudited) December 31, September 30, December 31, (dollars in thousands, except per share amounts) 2017 2017 2016 ASSETS Cash and due from banks $ 36,073 $ 27,181 $ 19,830 Interest-bearing deposits and federal funds sold 25,869 71,601 14,724 Total cash and cash equivalents 61,942 98,782 34,554 Securities - Available for sale 464,430 377,757 369,739 Securities - Held to maturity 472,213 416,987 432,499 Restricted stock 1,918 1,678 1,366 Total investment securities 938,561 796,422 803,604 Loans held for sale 45,700 41,711 28,065 Loans receivable 1,162,278 1,095,405 964,972 Allowance for loan losses (8,599 ) (8,258 ) (9,155 ) Net loans 1,153,679 1,087,147 955,817 Premises and equipment 74,947 71,715 57,040 Other real estate owned 6,966 9,169 10,174 Other assets 40,552 36,617 34,677 Total Assets $ 2,322,347 $ 2,141,563 $ 1,923,931 LIABILITIES Non-interest bearing deposits $ 438,500 $ 398,794 $ 324,912 Interest bearing deposits 1,624,795 1,486,611 1,352,758 Total deposits 2,063,295 1,885,405 1,677,670 Subordinated debt 21,681 21,663 21,881 Other liabilities 10,911 9,293 9,327 Total Liabilities 2,095,887 1,916,361 1,708,878 SHAREHOLDERS' EQUITY Common stock - $0.01 par value 575 575 573 Additional paid-in capital 256,285 255,752 253,570 Accumulated deficit (18,983 ) (21,721 ) (27,888 ) Treasury stock at cost (3,725 ) (3,725 ) (3,725 ) Stock held by deferred compensation plan (183 ) (183 ) (183 ) Accumulated other comprehensive loss (7,509 ) (5,496 ) (7,294 ) Total Shareholders' Equity 226,460 225,202 215,053 Total Liabilities and Shareholders' Equity $ 2,322,347 $ 2,141,563 $ 1,923,931\nRepublic First Bancorp, Inc. Consolidated Statements of Operations (Unaudited) Three Months Ended Twelve Months Ended December 31, September 30, December 31, December 31, December 31, (in thousands, except per share amounts) 2017 2017 2016 2017 2016 INTEREST INCOME Interest and fees on loans $ 13,576 $ 12,989 $ 10,826 $ 50,094 $ 41,787 Interest and dividends on investment securities 5,568 4,752 3,636 20,178 11,967 Interest on other interest earning assets 265 181 174 577 473 Total interest income 19,409 17,922 14,636 70,849 54,227 INTEREST EXPENSE Interest on deposits 2,222 1,872 1,650 7,418 5,669 Interest on borrowed funds 320 338 296 1,366 1,194 Total interest expense 2,542 2,210 1,946 8,784 6,863 Net interest income 16,867 15,712 12,690 62,065 47,364 Provision for loan losses 400 - - 900 1,557 Net interest income after provision for loan losses 16,467 15,712 12,690 61,165 45,807 NON-INTEREST INCOME Service fees on deposit accounts 1,084 1,067 748 3,904 2,658 Mortgage banking income 2,619 3,159 2,657 11,170 5,062 Gain on sale of SBA loans 1,063 831 769 3,378 4,981 Gain (loss) on sale of investment securities (85 ) - - (146 ) 656 Other non-interest income 331 721 553 1,791 1,955 Total non-interest income 5,012 5,778 4,727 20,097 15,312 NON-INTEREST EXPENSE Salaries and employee benefits 10,159 9,829 8,268 37,959 28,602 Occupancy and equipment 2,947 3,064 2,424 11,774 9,627 Legal and professional fees 953 610 560 2,877 2,039 Foreclosed real estate 2,388 746 572 4,092 2,182 Regulatory assessments and related fees 359 355 402 1,367 1,413 Other operating expenses 4,816 4,561 3,744 17,207 12,430 Total non-interest expense 21,622 19,165 15,970 75,276 56,293 Income (loss) before benefit for income taxes (143 ) 2,325 1,447 5,986 4,826 Provision (benefit) for income taxes (2,881 ) 4 (50 ) (2,919 ) (119 ) Net income $ 2,738 $ 2,321 $ 1,497 $ 8,905 $ 4,945 Net Income per Common Share Basic $ 0.05 $ 0.04 $ 0.03 $ 0.16 $ 0.13 Diluted $ 0.05 $ 0.04 $ 0.03 $ 0.15 $ 0.12 Average Common Shares Outstanding Basic 56,988 56,974 43,456 56,933 39,281 Diluted 58,360 58,314 44,317 58,250 39,865\nRepublic First Bancorp, Inc. Average Balances and Net Interest Income (unaudited) For the three months ended For the three months ended For the three months ended (dollars in thousands) December 31, 2017 September 30, 2017 December 31, 2016 Interest Interest Interest Average Income/ Yield/ Average Income/ Yield/ Average Income/ Yield/ Balance Expense Rate Balance Expense Rate Balance Expense Rate Interest-earning assets: Federal funds sold and other interest-earning assets $ 82,918 $ 265 1.27 % $ 56,316 $ 181 1.28 % $ 135,214 $ 174 0.51 % Securities 888,862 5,616 2.53 % 765,678 4,805 2.51 % 649,649 3,731 2.30 % Loans receivable 1,171,771 13,743 4.65 % 1,115,920 13,136 4.67 % 970,391 10,965 4.50 % Total interest-earning assets 2,143,551 19,624 3.63 % 1,937,914 18,122 3.71 % 1,755,254 14,870 3.37 % Other assets 126,904 122,513 104,225 Total assets $ 2,270,455 $ 2,060,427 $ 1,859,479 Interest-bearing liabilities: Demand non interest-bearing $ 421,841 $ 381,380 $ 325,495 Demand interest-bearing 776,203 945 0.48 % 692,423 772 0.44 % 613,828 617 0.40 % Money market & savings 693,684 942 0.54 % 613,506 788 0.51 % 629,646 716 0.45 % Time deposits 120,067 335 1.11 % 109,878 312 1.13 % 110,488 317 1.14 % Total deposits 2,011,795 2,222 0.44 % 1,797,187 1,872 0.41 % 1,679,457 1,650 0.39 % Total interest-bearing deposits 1,589,954 2,222 0.55 % 1,415,807 1,872 0.52 % 1,353,962 1,650 0.48 % Other borrowings 23,621 320 5.37 % 30,220 338 4.44 % 21,913 296 5.37 % Total interest-bearing liabilities 1,613,575 2,542 0.63 % 1,446,027 2,210 0.61 % 1,375,875 1,946 0.56 % Total deposits and other borrowings 2,035,416 2,542 0.50 % 1,827,407 2,210 0.48 % 1,701,370 1,946 0.46 % Non interest-bearing liabilities 9,560 9,179 10,965 Shareholders' equity 225,479 223,841 147,144 Total liabilities and shareholders' equity $ 2,270,455 $ 2,060,427 $ 1,859,479 Net interest income $ 17,082 $ 15,912 $ 12,924 Net interest spread 3.00 % 3.10 % 2.81 % Net interest margin 3.16 % 3.26 % 2.93 % Note: The above tables are presented on a tax equivalent basis.\nRepublic First Bancorp, Inc. Average Balances and Net Interest Income (unaudited) For the twelve months ended For the twelve months ended (dollars in thousands) December 31, 2017 December 31, 2016 Interest Interest Average Income/ Yield/ Average Income/ Yield/ Balance Expense Rate Balance Expense Rate Interest-earning assets: Federal funds sold and other interest-earning assets $ 48,148 $ 577 1.20 % $ 92,452 $ 473 0.51 % Securities 811,269 20,466 2.52 % 506,545 12,346 2.44 % Loans receivable 1,090,851 50,687 4.65 % 936,492 42,304 4.52 % Total interest-earning assets 1,950,268 71,730 3.68 % 1,535,489 55,123 3.59 % Other assets 115,770 96,902 Total assets $ 2,066,038 $ 1,632,391 Interest-bearing liabilities: Demand non interest-bearing $ 372,171 $ 284,326 Demand interest-bearing 687,586 3,020 0.44 % 510,745 2,088 0.41 % Money market & savings 629,464 3,160 0.50 % 586,750 2,639 0.45 % Time deposits 110,952 1,238 1.12 % 89,713 942 1.05 % Total deposits 1,800,173 7,418 0.41 % 1,471,534 5,669 0.39 % Total interest-bearing deposits 1,428,002 7,418 0.52 % 1,187,208 5,669 0.48 % Other borrowings 35,429 1,366 3.86 % 27,471 1,194 4.35 % Total interest-bearing liabilities 1,463,431 8,784 0.60 % 1,214,679 6,863 0.57 % Total deposits and other borrowings 1,835,602 8,784 0.48 % 1,499,005 6,863 0.46 % Non interest-bearing liabilities 8,942 8,867 Shareholders' equity 221,494 124,519 Total liabilities and shareholders' equity $ 2,066,038 $ 1,632,391 Net interest income $ 62,946 $ 48,260 Net interest spread 3.08 % 3.02 % Net interest margin 3.23 % 3.14 % Note: The above tables are presented on a tax equivalent basis.\nRepublic First Bancorp, Inc. Summary of Allowance for Loan Losses and Other Related Data (unaudited) Three months ended Twelve months ended\nDecember 31, September 30, December 31, December 31, December 31, (dollars in thousands) 2017 2017 2016 2017 2016 Balance at beginning of period $ 8,258 $ 9,454 $ 9,453 $ 9,155 $ 8,703 Provision charged to operating expense 400 - - 900 1,557 8,658 9,454 9,453 10,055 10,260 Recoveries on loans charged-off: Commercial 1 52 1 119 169 Consumer - - 2 1 2 Total recoveries 1 52 3 120 171 Loans charged-off: Commercial (19 ) (1,243 ) (290 ) (1,523 ) (1,265 ) Consumer (41 ) (5 ) (11 ) (53 ) (11 ) Total charged-off (60 ) (1,248 ) (301 ) (1,576 ) (1,276 ) Net charge-offs (59 ) (1,196 ) (298 ) (1,456 ) (1,105 ) Balance at end of period $ 8,599 $ 8,258 $ 9,155 $ 8,599 $ 9,155 Net charge-offs as a percentage of average loans outstanding 0.02 % 0.43 % 0.12 % 0.13 % 0.12 % Allowance for loan losses as a percentage of period-end loans 0.74 % 0.75 % 0.95 % 0.74 % 0.95 %\nRepublic First Bancorp, Inc. Summary of Non-Performing Loans and Assets (unaudited) December 31, September 30, June 30, March 31, December 31, (dollars in thousands) 2017 2017 2017 2017 2016 Non-accrual loans: Commercial real estate $ 13,973 $ 10,140 $ 17,703 $ 17,695 $ 17,758 Consumer and other 872 880 817 834 836 Total non-accrual loans 14,845 11,020 18,520 18,529 18,594 Loans past due 90 days or more and still accruing - 2,730 293 - 302 Total non-performing loans 14,845 13,750 18,813 18,529 18,896 Other real estate owned 6,966 9,169 9,909 9,944 10,174 Total non-performing assets $ 21,811 $ 22,919 $ 28,722 $ 28,473 $ 29,070 Non-performing loans to total loans 1.28 % 1.26 % 1.76 % 1.81 % 1.96 % Non-performing assets to total assets 0.94 % 1.07 % 1.41 % 1.45 % 1.51 % Non-performing loan coverage 57.93 % 60.06 % 50.25 % 49.55 % 48.45 % Allowance for loan losses as a percentage of total period-end loans 0.74 % 0.75 % 0.89 % 0.89 % 0.95 % Non-performing assets / capital plus allowance for loan losses 9.28 % 9.82 % 12.39 % 12.52 % 12.97 %\nSource:Republic First Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/e6df9600-adbe-40fb-92c4-f66f62ca6f50", "https://www.globenewswire.com/Tracker?data=oO_by5FUVET0XgSXK-dEb1ugWwPOQu18GAUn2IuoS7HVVAyj2DmCFsHB9wx1ZDAJRmjYmLZMUoBDd7YIPzm1bu5k7xZkL6KXWcKkzJwkwpk="], "published": "2018-01-23T00:37:00.000+02:00", "crawled": "2018-01-23T02:15:58.054+02:00", "highlightTitle": ""}