{"organizations": [], "uuid": "ae5b1bfb8f23845b941184671699b49c73864f02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220179183&w=1200&r=LYNXMPEE0709D", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/southkorea-bitcoin/south-korea-inspects-6-banks-over-clients-virtual-currency-accounts-idINKBN1EX0BD", "country": "US", "domain_rank": 408, "title": "South Korea inspects six banks over clients' virtual currency accounts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T08:28:00.000+02:00", "replies_count": 0, "uuid": "ae5b1bfb8f23845b941184671699b49c73864f02"}, "author": "", "url": "https://in.reuters.com/article/southkorea-bitcoin/south-korea-inspects-6-banks-over-clients-virtual-currency-accounts-idINKBN1EX0BD", "ord_in_thread": 0, "title": "South Korea inspects six banks over clients' virtual currency accounts", "locations": [], "entities": {"persons": [{"name": "choi jong-ku", "sentiment": "none"}, {"name": "dahee kim", "sentiment": "none"}, {"name": "christine kim", "sentiment": "none"}, {"name": "eoh kyung-hoon", "sentiment": "none"}, {"name": "choi", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "fsc", "sentiment": "none"}, {"name": "financial services commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 5:40 AM / in 8 hours South Korea inspects six banks over virtual currency services to clients Christine Kim , Dahee Kim 4 Min Read \nSEOUL (Reuters) - South Korean financial authorities on Monday said they are inspecting six local banks that offer virtual currency accounts to institutions, amid concerns the increasing use of such assets could lead to a surge in crime. Eoh Kyung-hoon, leader of a club studying cryptocurrencies, checks a chart after a meeting at a university in Seoul, South Korea, December 20, 2017. Picture taken December 20, 2017. REUTERS/Kim Hong-Ji/Files \nThe joint inspection by the Financial Services Commission (FSC) and Financial Supervisory Service (FSS) will check if banks are adhering to anti-money laundering rules and using real names for accounts, FSC Chairman Choi Jong-ku told a press conference. \nThe six banks named by the regulator have all provided virtual currency accounts to clients that handle cryptocurrencies, according to the FSC. The banks are NH Bank, Industrial Bank of Korea, Shinhan Bank, Kookmin Bank, Woori Bank and Korea Development Bank. \nChoi said the inspections are intended to provide guidance to banks and are not the result of any suspected wrongdoing. \n“Virtual currency is currently unable to function as a means of payment and it is being used for illegal purposes like money laundering, scams and fraudulent investor operations,” said Choi. \n“The side effects have been severe, leading to hacking problems at the institutions that handle cryptocurrency and an unreasonable spike in speculation.” \nA Woori Bank spokesperson told Reuters the bank was filling out a checklist for the inspection. The spokesperson said Woori had stopped providing virtual account services last month as the costs of using a real-name transaction system were too prohibitive. \nNH Bank and Shinhan Bank representatives declined to comment, while the other three banks could not immediately be reached for comment. \nChoi said authorities are also looking at ways to reduce risks associated with cryptocurrency trading in the country, which could include shutting down institutions that use such currencies. \nLast month, the government said it would impose additional measures to regulate speculation in cryptocurrency trading within the country, including a ban on anonymous cryptocurrency accounts and new legislation to allows regulators to close virtual coin exchanges if needed. \nBitcoin and other virtual coins have been extremely popular in South Korea, drawing wide investments from housewives and students. Government officials have expressed concern over frenzied speculation, with South Korea’s central bank chief warning of “irrational exuberance” in trading of virtual currency last month. \nA South Korean cryptocurrency exchange, Youbit, shut down and filed for bankruptcy in December after it was hacked twice last year, highlighting security and regulatory concerns. \nSouth Korea’s virtual currency exchanges have been more vulnerable to hackers as bitcoin trades at higher rates on local exchanges than they do elsewhere. As of 0710 GMT, bitcoin’s global price average was trading at $16,294 while in South Korean markets, it stood at 25 million won, or $23,467.35, according to Coinhills.com. \nSouth Korea’s bitcoin prices are higher because of the extreme popularity of the virtual currency in the country, with buyers greatly outnumbering those willing to sell, said Park Nok-sun, a cryptocurrency analyst at NH Investment & Securities. \nThe fact that some of the most active virtual currency exchanges in the world are in South Korea also makes the country an attractive target for hackers, he added. \nChoi warned on Monday authorities would crack down on virtual currency crime and dole out heavy punishments on those who partake in market price manipulation, pyramid schemes and money laundering. \n“No one knows what is going on at these places that handle cryptocurrency because there is no direct regulation system in place regarding these institutions,” Choi said. \n($1 = 1,065.3100 won)", "external_links": [], "published": "2018-01-08T08:28:00.000+02:00", "crawled": "2018-01-08T08:43:23.021+02:00", "highlightTitle": ""}