{"organizations": [], "uuid": "d41fe300507732bc8623fa6666b711eea5ce94ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-pg-announces-second-quarter-earnings.html", "country": "US", "domain_rank": 767, "title": "P&G Announces Second Quarter Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-23T15:00:00.000+02:00", "replies_count": 0, "uuid": "d41fe300507732bc8623fa6666b711eea5ce94ee"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-pg-announces-second-quarter-earnings.html", "ord_in_thread": 0, "title": "P&G Announces Second Quarter Earnings", "locations": [], "entities": {"persons": [{"name": "david taylor", "sentiment": "none"}], "locations": [{"name": "cincinnati", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "p&g", "sentiment": "negative"}, {"name": "beauty brands", "sentiment": "none"}, {"name": "procter & gamble company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Net Sales +3%; Organic Sales +2%; Diluted Net EPS $0.93, -68%; Core EPS $1.19, +10%\nCINCINNATI--(BUSINESS WIRE)-- The Procter & Gamble Company (NYSE:PG) reported second quarter fiscal year 2018 net sales of $17.4 billion, an increase of three percent versus the prior year. Organic sales increased two percent. Diluted net earnings per share were $0.93, a decline of 68% versus the prior year due to the Beauty Brands divestiture gain in the base period and a current period net income tax charge related to the recently enacted U.S. Tax Cuts and Jobs Act (the “Tax Act”). Core earnings per share increased 10% to $1.19, including a $0.05 per share benefit from the Tax Act.\nOperating cash flow was $3.7 billion for the quarter. Adjusted free cash flow productivity was 91%. The Company returned $3.6 billion of cash to shareholders via $1.8 billion of dividend payments and $1.8 billion of common stock repurchase.\n“We accelerated organic sales growth and delivered strong productivity cost savings and cash flow,\" said David Taylor, Chairman, President and Chief Executive Officer. “We remain on track to achieve our fiscal year objectives.”\nOctober - December Quarter Discussion\nNet sales in the second quarter of fiscal year 2018 were $17.4 billion, an increase of three percent versus the prior year including a one percent positive impact from foreign exchange. Organic sales and volume both increased two percent. A one percent positive mix impact from the disproportionate growth of higher priced categories, Skin & Personal Care and Personal Health Care, was offset by a negative pricing impact of one percent.\nOctober - December 2017\nForeign\nOrganic\nOrganic\nNet Sales Drivers (1)\nVolume\nExchange\nPrice\nMix\nOther (2)\nNet Sales\nVolume\nSales\nBeauty 2% 1% —% 7% —% 10% 2% 9% Grooming 1% 2% (4)% —% —% (1)% 1% (3)% Health Care 4% 3% (1)% 1% —% 7% 4% 4% Fabric & Home Care 3% 1% (1)% —% —% 3% 4% 3% Baby, Feminine & Family Care (1)% 1% (1)% —% —% (1)% (1)% (1)% Total P&G 2% 1% (1)% 1% —% 3% 2% 2% (1)\nNet sales percentage changes are approximations based on quantitative formulas that are consistently applied. (2) Other includes the sales mix impact from acquisitions/divestitures, the impact from India Goods and Services Tax implementation and rounding impacts necessary to reconcile volume to net sales. Beauty segment organic sales increased nine percent. Skin & Personal Care organic sales grew double digits driven by Olay brand innovation and continued strong growth of the super-premium SK-II brand. Hair Care organic sales increased low single digits driven by growth of all major brands - Pantene, Head & Shoulders, Herbal Essences and Rejoice. Grooming segment organic sales decreased three percent. Shave Care organic sales decreased mid-single digits primarily due to pricing reductions in the U.S. which were partially offset by volume increases due to reduced pricing and innovation. Appliances organic sales increased double digits driven by innovation on the Braun brand. Health Care segment increased organic sales four percent. Oral Care organic sales increased low single digits driven by premium Oral-B power toothbrush innovation. Personal Health Care organic sales increased high single digits with increased consumption in the U.S. driven by an early and intense Cough/Cold season and strong international shipments from the PGT joint venture. Fabric and Home Care segment organic sales increased three percent. Fabric Care organic sales increased low single digits driven by unit dose detergent and scent bead innovations and marketing and merchandising investments. Organic sales in Home Care also increased low single digits driven by marketing and merchandising investments. Baby, Feminine and Family Care segment organic sales decreased one percent. Baby Care organic sales declined mid-single digits due to competitive activity and trade inventory reductions. Feminine Care organic sales grew mid-single digits driven by innovation on the Always brand and positive mix from premium tier growth. Family Care organic sales grew low single digits driven by recent Charmin innovation and strong consumption of Puffs.\nDiluted net earnings per share were $0.93, a decrease of 68% versus the prior year due to the gain from the Beauty Brands divestiture in the base period and a current period income tax charge from the transitional impact of the recently enacted U.S. tax legislation. Diluted net earnings per share from continuing operations were also $0.93, unchanged versus the base period. Core earnings per share, which excludes non-core restructuring charges and U.S. Tax Act transitional impacts, were $1.19, an increase of 10 percent versus the prior year, driven primarily by increased net sales and a lower core effective tax rate. Impacts from the Tax Act and foreign exchange each contributed approximately four percentage points to core earnings per share growth, and higher commodity costs reduced core earnings per share growth by approximately four percentage points.\nReported gross margin decreased 60 basis points, including approximately 20 basis points favorable impact from lower non-core restructuring charges versus the prior year. Core gross margin decreased 80 basis points, including 10 basis points of negative foreign exchange impacts. On a currency-neutral basis, core gross margin decreased 70 basis points. Productivity savings of 150 basis points and 30 basis points of sales growth leverage and other helps were more than offset by 90 basis points of commodity cost increases, 70 basis points of unfavorable geographic and product mix, 50 basis points of unfavorable pricing impacts and 40 basis points of innovation reinvestments.\nSelling, general and administrative expense (SG&A) as a percent of sales decreased 60 basis points on a reported basis versus the prior year, including 10 basis point unfavorable impact from higher non-core restructuring charges versus the previous year. Core SG&A as a percentage of sales decreased 80 basis points versus the previous year including a benefit of approximately 40 basis points from foreign exchange. On a currency-neutral basis, Core SG&A as a percentage of sales decreased 40 basis points, as 40 basis points of savings in overhead, agency fees and advertising production costs and 40 basis points of sales growth leverage were partially offset by reinvestments in research & development and information technology. Media spending was in-line with prior year levels.\nReported operating profit margin was unchanged versus the base period. Core operating profit margin decreased 10 basis points including approximately 20 basis points of favorable foreign exchange. On a currency-neutral basis, core operating profit margin decreased 30 basis points. Productivity cost savings contributed 190 basis points of margin benefit for the quarter.\nU.S. Tax Reform\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cuts and Jobs Act (the “Tax Act”). The Tax Act reduces the federal tax rate on U.S. earnings to 21% and moves from a global taxation regime to a modified territorial regime. As we have a June 30 fiscal year-end, the lower tax rate will be phased in, resulting in a U. S. statutory federal rate of approximately 28% for P&G’s fiscal year ending June 30, 2018. However, there are offsets to the lower tax rate, the most significant being the inherent disallowance under the Act of previously available U.S. tax credits and the loss of the domestic manufacturing deduction. For the quarter ended December 31, 2017 and fiscal 2018, these impacts are resulting in a net benefit of approximately $135 million. The benefit will increase in future years as the 21% rate is fully phased in.\nAs part of the Tax Act, U.S. companies are required to pay a tax on historical earnings generated offshore that have not been repatriated to the U.S. There are several items which partially offset this charge, the most significant of which is a revaluation of a large net deferred tax liability position at the lower federal base rate of 21 percent. These transitional impacts resulted in a provisional net charge of $628 million for the quarter ended December 31, 2017, comprised of an estimated repatriation tax charge of $3.8 billion (comprised of the U.S. repatriation taxes and foreign withholding taxes) and a net deferred tax benefit of approximately $3.2 billion.\nFiscal Year 2018 Guidance\nP&G said it is maintaining its guidance for organic sales growth in the range of two to three percent for fiscal 2018. The Company estimates all-in sales growth of about three percent for fiscal 2018, which includes a neutral to half-a-percentage-point benefit to sales growth from the combined impacts of acquisitions and divestitures and foreign exchange.\nP&G said it is raising its core earnings per share growth outlook from five to seven percent to five to eight percent versus fiscal 2017 Core EPS of $3.92. It is raising the upper-end of the guidance range to reflect the potential benefit from the Tax Act. GAAP earnings per share are expected to decrease 30% to 32% versus fiscal year 2017 GAAP EPS of $5.59, which included the significant benefit from the Beauty Brands transaction that was completed in October 2016. The fiscal 2018 GAAP EPS estimate includes approximately $0.10 per share of non-core restructuring costs and $0.24 per share of non-core charges related to the Tax Act.\nForward-Looking Statements\nCertain statements in this release or presentation, other than purely historical information, including estimates, projections, statements relating to our business plans, objectives, and expected operating results, and the assumptions upon which those statements are based, are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These forward-looking statements generally are identified by the words “believe,” “project,” “expect,” “anticipate,” “estimate,” “intend,” “strategy,” “future,” “opportunity,” “plan,” “may,” “should,” “will,” “would,” “will be,” “will continue,” “will likely result,” and similar expressions. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause results to differ materially from those expressed or implied in the forward-looking statements. We undertake no obligation to update or revise publicly any forward-looking statements, whether because of new information, future events or otherwise.\nRisks and uncertainties to which our forward-looking statements are subject include, without limitation: (1) the ability to successfully manage global financial risks, including foreign currency fluctuations, currency exchange or pricing controls and localized volatility; (2) the ability to successfully manage local, regional or global economic volatility, including reduced market growth rates, and to generate sufficient income and cash flow to allow the Company to affect the expected share repurchases and dividend payments; (3) the ability to manage disruptions in credit markets or changes to our credit rating; (4) the ability to maintain key manufacturing and supply arrangements (including execution of supply chain optimizations and sole supplier and sole manufacturing plant arrangements) and to manage disruption of business due to factors outside of our control, such as natural disasters and acts of war or terrorism; (5) the ability to successfully manage cost fluctuations and pressures, including prices of commodities and raw materials, and costs of labor, transportation, energy, pension and health care; (6) the ability to stay on the leading edge of innovation, obtain necessary intellectual property protections and successfully respond to changing consumer habits and technological advances attained by, and patents granted to, competitors; (7) the ability to compete with our local and global competitors in new and existing sales channels, including by successfully responding to competitive factors such as prices, promotional incentives and trade terms for products; (8) the ability to manage and maintain key customer relationships; (9) the ability to protect our reputation and brand equity by successfully managing real or perceived issues, including concerns about safety, quality, ingredients, efficacy or similar matters that may arise; (10) the ability to successfully manage the financial, legal, reputational and operational risk associated with third party relationships, such as our suppliers, distributors, contractors and external business partners; (11) the ability to rely on and maintain key company and third party information technology systems, networks and services, and maintain the security and functionality of such systems, networks and services and the data contained therein; (12) the ability to successfully manage uncertainties related to changing political conditions (including the United Kingdom’s decision to leave the European Union) and potential implications such as exchange rate fluctuations and market contraction; (13) the ability to successfully manage regulatory and legal requirements and matters (including, without limitation, those laws and regulations involving product liability, intellectual property, antitrust, data protection, tax, environmental and accounting and financial reporting) and to resolve pending matters within current estimates; (14) the ability to manage changes in applicable tax laws and regulations, including maintaining our intended tax treatment of divestiture transactions; (15) the ability to successfully manage our ongoing acquisition, divestiture and joint venture activities, in each case to achieve the Company’s overall business strategy and financial objectives, without impacting the delivery of base business objectives; and (16) the ability to successfully achieve productivity improvements and cost savings and manage ongoing organizational changes, while successfully identifying, developing and retaining key employees, including in key growth markets where the availability of skilled or experienced employees may be limited. For additional information concerning factors that could cause actual results and events to differ materially from those projected herein, please refer to our most recent 10-K, 10-Q and 8-K reports.\nAbout Procter & Gamble\nP&G serves consumers around the world with one of the strongest portfolios of trusted, quality, leadership brands, including Always®, Ambi Pur®, Ariel®, Bounty®, Charmin®, Crest®, Dawn®, Downy®, Fairy®, Febreze®, Gain®, Gillette®, Head & Shoulders®, Lenor®, Olay®, Oral-B®, Pampers®, Pantene®, SK-II®, Tide®, Vicks®, and Whisper®. The P&G community includes operations in approximately 70 countries worldwide. Please visit http://www.pg.com for the latest news and information about P&G and its brands.\nTHE PROCTER & GAMBLE COMPANY AND SUBSIDIARIES (Amounts in Millions Except Per Share Amounts) Consolidated Earnings Information Three Months Ended December 31 Six Months Ended December 31 2017 2016 % Chg 2017 2016 % Chg NET SALES $ 17,395 $ 16,856 3 % $ 34,048 $ 33,374 2 % Cost of products sold 8,667 8,298 4 % 16,896 16,400 3 % GROSS PROFIT 8,728 8,558 2 % 17,152 16,974 1 % Selling, general and administrative expense 4,725 4,683 1 % 9,414 9,328 1 % OPERATING INCOME 4,003 3,875 3 % 7,738 7,646 1 % Interest expense 122 122 — % 237 253 (6 )% Interest income 66 42 57 % 115 77 49 % Other non-operating income/(expense), net 86 (539 ) (116 )% 168 (476 ) (135 )% EARNINGS FROM CONTINUING OPERATIONS BEFORE INCOME TAXES 4,033 3,256 24 % 7,784 6,994 11 % Income taxes on continuing operations 1,472 695 112 % 2,353 1,558 51 % NET EARNINGS FROM CONTINUING OPERATIONS 2,561 2,561 — % 5,431 5,436 — % NET EARNINGS FROM DISCONTINUED OPERATIONS — 5,335 N/A — 5,217 N/A NET EARNINGS 2,561 7,896 (68 )% 5,431 10,653 (49 )% Less: Net earnings attributable to noncontrolling interests 66 21 214 % 83 64 30 % NET EARNINGS ATTRIBUTABLE TO PROCTER & GAMBLE $ 2,495 $ 7,875 (68 )% $ 5,348 $ 10,589 (49 )% EFFECTIVE TAX RATE 36.5 % 21.3 % 30.2 % 22.3 % BASIC NET EARNINGS PER COMMON SHARE (1)\nEarnings from continuing operations $ 0.96 $ 0.96 — % $ 2.05 $ 1.99 3 % Earnings from discontinued operations $ — $ 2.05 N/A $ — $ 1.98 N/A BASIC NET EARNINGS PER COMMON SHARE $ 0.96 $ 3.01 (68 )% $ 2.05 $ 3.97 (48 )% DILUTED NET EARNINGS PER COMMON SHARE (1) Earnings from continuing operations $ 0.93 $ 0.93 — % $ 2.00 $ 1.93 4 % Earnings from discontinued operations $ — $ 1.95 N/A $ — $ 1.88 N/A DILUTED NET EARNINGS PER COMMON SHARE $ 0.93 $ 2.88 (68 )% $ 2.00 $ 3.81 (48 )% DIVIDENDS PER COMMON SHARE $ 0.6896 $ 0.6695 $ 1.3790 $ 1.3390 Diluted Weighted Average Common Shares Outstanding 2,669.6 2,737.6 2,680.1 2,780.2 Basis Pt Basis Pt COMPARISONS AS A % OF NET SALES Chg Chg Gross Margin 50.2% 50.8% (60) 50.4% 50.9% (50) Selling, general and administrative expense 27.2% 27.8% (60) 27.6% 27.9% (30) Operating Margin 23.0% 23.0% — 22.7% 22.9% (20) Earnings from continuing operations before income taxes 23.2% 19.3% 390 22.9% 21.0% 190 Net earnings from continuing operations 14.7% 15.2% (50) 16.0% 16.3% (30) Net earnings attributable to Procter & Gamble 14.3% 46.7% (3,240) 15.7% 31.7% (1,600) (1) Basic net earnings per share and Diluted net earnings per share are calculated on Net earnings attributable to Procter & Gamble. THE PROCTER & GAMBLE COMPANY AND SUBSIDIARIES (Amounts in Millions)\nConsolidated Earnings Information Three Months Ended December 31, 2017 % Change Earnings/(Loss) from % Change Net Earnings/(Loss) % Change Versus Year Continuing Operations Versus Year from Continuing Versus Year Net Sales Ago Before Income Taxes Ago Operations Ago Beauty $ 3,233 10 % $ 853 19 % $ 655 21 % Grooming 1,776 (1 )% 531 (14 )% 423 (10 )% Health Care 2,212 7 % 668 10 % 455 8 % Fabric & Home Care 5,434 3 % 1,101 (2 )% 714 (2 )% Baby, Feminine & Family Care 4,613 (1 )% 933 (10 )% 597 (12 )% Corporate 127 (8 )% (53 ) N/A (283 ) N/A Total Company $ 17,395 3 % $ 4,033 24 % $ 2,561 — % Three Months Ended December 31, 2017 (Percent Change vs. Year Ago) (1)\nVolume with Volume Excluding Acquisitions & Acquisitions & Foreign Net Sales Divestitures Divestitures Exchange Price Mix Other (2)\nGrowth Beauty 2% 2% 1% —% 7% —% 10% Grooming 1% 1% 2% (4)% —% —% (1)% Health Care 4% 4% 3% (1)% 1% —% 7% Fabric & Home Care 3% 4% 1% (1)% —% —% 3% Baby, Feminine & Family Care (1)% (1)% 1% (1)% —% —% (1)% Total Company 2% 2% 1% (1)% 1% —% 3% THE PROCTER & GAMBLE COMPANY AND SUBSIDIARIES (Amounts in Millions)\nConsolidated Earnings Information Six Months Ended December 31, 2017 % Change Earnings/(Loss) from % Change Net Earnings/(Loss)\n% Change Versus Year Continuing Operations Versus Year from Continuing Versus Year Net Sales Ago Before Income Taxes\nAgo Operations Ago Beauty $ 6,371 7 % $ 1,689 13 % $ 1,287 14 % Grooming 3,353 (3 )% 945 (17 )% 752 (15 )% Health Care 4,114 5 % 1,123 2 % 760 2 % Fabric & Home Care 10,817 2 % 2,280 1 % 1,483 2 % Baby, Feminine & Family Care 9,158 (1 )% 1,897 (9 )% 1,227 (11 )% Corporate 235 (4 )% (150 ) N/A\n(78 ) N/A Total Company $ 34,048 2 % $ 7,784 11 % $ 5,431 — % Six Months Ended December 31, 2017 (Percent Change vs. Year Ago) (1) Volume with Volume Excluding Acquisitions & Acquisitions & Foreign Net Sales Divestitures Divestitures Exchange Price Mix Other (2)\nGrowth Beauty 1% 1% —% 1% 5% —% 7% Grooming —% —% 2% (4)% (1)% —% (3)% Health Care 2% 2% 2% —% 1% —% 5% Fabric & Home Care 3% 3% —% —% (1)% —% 2% Baby, Feminine & Family Care (1)% —% 1% (1)% —% —% (1)% Total Company 1% 2% 1% (1)% 1% —% 2% (1) Net sales percentage changes are approximations based on quantitative formulas that are consistently applied. (2) Other includes the sales mix impact from acquisitions/divestitures, the impact from India Goods and Services Tax implementation and rounding impacts necessary to reconcile volume to net sales. THE PROCTER & GAMBLE COMPANY AND SUBSIDIARIES (Amounts in Millions Except Per Share Amounts)\nConsolidated Statements of Cash Flows Six Months Ended December 31 Amounts in millions\n2017 2016 CASH AND CASH EQUIVALENTS, BEGINNING OF PERIOD $ 5,569 $ 7,102 OPERATING ACTIVITIES Net earnings 5,431 10,653 Depreciation and amortization 1,368 1,435 Loss on early extinguishment of debt — 543 Share-based compensation expense 157 104 Deferred income taxes (2,008 ) (448 ) Gain on sale of assets (158 ) (5,343 ) Changes in: Accounts receivable (547 ) (595 ) Inventories (457 ) (247 ) Accounts payable, accrued and other liabilities 857 (296 ) Other operating assets and liabilities 2,524 152 Other 148 67 TOTAL OPERATING ACTIVITIES 7,315 6,025 INVESTING ACTIVITIES Capital expenditures (1,900 ) (1,429 ) Proceeds from asset sales 201 280 Acquisitions, net of cash acquired (101 ) (16 ) Purchases of short-term investments (3,598 ) (1,739 ) Proceeds from sales and maturities of short-term investments 1,643 354 Pre-divestiture addition of restricted cash related to the Beauty Brands divestiture — (874 ) Cash transferred at closing related to the Beauty Brands divestiture — (475 ) Release of restricted cash upon closing of the Beauty Brands divestiture — 1,870 Change in other investments 50 8 TOTAL INVESTING ACTIVITIES (3,705 ) (2,021 ) FINANCING ACTIVITIES Dividends to shareholders (3,636 ) (3,637 ) Change in short-term debt 1,524 2,715 Additions to long-term debt 5,072 2,641 Reductions of long-term debt (1,281 ) (5,029 ) (1) Treasury stock purchases (4,253 ) (2,503 ) Impact of stock options and other 698 1,074 TOTAL FINANCING ACTIVITIES (1,876 ) (4,739 ) EFFECT OF EXCHANGE RATE CHANGES ON CASH AND CASH EQUIVALENTS 129 (316 ) CHANGE IN CASH AND CASH EQUIVALENTS 1,863 (1,051 ) CASH AND CASH EQUIVALENTS, END OF PERIOD $ 7,432 $ 6,051 (1) Includes $543 of costs related to early extinguishment of debt. THE PROCTER & GAMBLE COMPANY AND SUBSIDIARIES (Amounts in Millions Except Per Share Amounts)\nCondensed Consolidated Balance Sheets December 31, 2017 June 30, 2017 Cash and cash equivalents $ 7,432 $ 5,569 Available-for-sale investment securities 11,326 9,568 Accounts receivable 5,182 4,594 Inventories 5,131 4,624 Prepaid expenses and other current assets 2,143 2,139 TOTAL CURRENT ASSETS 31,214 26,494 Property, plant and equipment, net 20,420 19,893 Goodwill 45,624 44,699 Trademarks and other intangible assets, net 24,224 24,187 Other noncurrent assets 5,162 5,133 TOTAL ASSETS $ 126,644 $ 120,406 Accounts payable $ 9,740 $ 9,632 Accrued and other liabilities 7,820 7,024 Debt due within one year 15,547 13,554 TOTAL CURRENT LIABILITIES 33,107 30,210 Long-term debt 22,186 18,038 Deferred income taxes 6,145 8,126 Other noncurrent liabilities 10,485 8,254 TOTAL LIABILITIES 71,923 64,628 TOTAL SHAREHOLDERS' EQUITY 54,721 55,778 TOTAL LIABILITIES AND SHAREHOLDERS' EQUITY $ 126,644 $ 120,406 The Procter & Gamble Company\nExhibit 1: Non-GAAP Measures\nIn accordance with the SEC's Regulation G, the following provides definitions of the non-GAAP measures used in Procter & Gamble's January 23, 2018 earnings release and the reconciliation to the most closely related GAAP measure. We believe that these measures provide useful perspective on underlying business trends (i.e., trends excluding non-recurring or unusual items) and results and provide a supplemental measure of year-on-year results. The non-GAAP measures described below are used by management in making operating decisions, allocating financial resources and for business strategy purposes. These measures may be useful to investors as they provide supplemental information about business performance and provide investors a view of our business results through the eyes of management. These measures are also used to evaluate senior management and are a factor in determining their at-risk compensation. These non-GAAP measures are not intended to be considered by the user in place of the related GAAP measure, but rather as supplemental information to our business results. These non-GAAP measures may not be the same as similar measures used by other companies due to possible differences in method and in the items or events being adjusted.\nThe Core earnings measures included in the following reconciliation tables refer to the equivalent GAAP measures adjusted as applicable for the following items:\nIncremental Restructuring: The Company has had and continues to have an ongoing level of restructuring activities. Such activities have resulted in ongoing annual restructuring related charges of approximately $250 - $500 million before tax. In 2012, Procter & Gamble began a $10 billion strategic productivity and cost savings initiative that includes incremental restructuring activities. In 2016, the Company communicated additional multi-year productivity and cost savings targets. This results in incremental restructuring charges to accelerate productivity efforts and cost savings. The adjustment to Core earnings includes only the restructuring costs above what we believe are the normal recurring level of restructuring costs.\nTransitional Impact of U.S. Tax Reform: As discussed in Note 2 to the Consolidated Financial Statements, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cuts and Jobs Act (the “Tax Act”) in December 2017. This resulted in a net charge of $628 million for the quarter ended December 31, 2017, comprised of an estimated repatriation tax charge of $3.8 billion and a net deferred tax benefit of $3.2 billion. The adjustment to core earnings only includes this transitional impact. It does not include the ongoing impacts of the lower U.S. statutory rate on current year earnings.\nEarly debt extinguishment charges: During the three months ended December 31, 2016, the Company recorded a charge of $345 million after tax due to the early extinguishment of certain long-term debt. This charge represents the difference between the reacquisition price and the par value of the debt extinguished. Management does not view this charge as indicative of the Company’s operating performance or underlying business results.\nWe do not view these items to be part of our sustainable results and their exclusion from Core earnings measures provides a more comparable measure of year-on-year results. These items are also excluded when evaluating senior management in determining their at-risk compensation.\nOrganic sales growth: Organic sales growth is a non-GAAP measure of sales growth excluding the impacts of acquisitions, divestitures, the impact from India Goods and Services Tax changes (which were effective on July 1, 2017) and foreign exchange from year-over-year comparisons. Management believes this measure provides investors with a supplemental understanding of underlying sales trends by providing sales growth on a consistent basis.\nCore operating profit margin: Core operating profit margin is a measure of the Company's operating margin adjusted for items as indicated. Management believes this non-GAAP measure provides a supplemental perspective to the Company’s operating efficiency over time.\nCore gross margin: Core gross margin is a measure of the Company's gross margin adjusted for items as indicated. Management believes this non-GAAP measure provides a supplemental perspective to the Company’s operating efficiency over time.\nCore EPS and currency-neutral Core EPS: Core earnings per share, or Core EPS, is a measure of the Company's diluted net earnings per share from continuing operations adjusted as indicated. Currency-neutral Core EPS is a measure of the Company's Core EPS excluding the incremental current year impact of foreign exchange. Management views these non-GAAP measures as a useful supplemental measure of Company performance over time.\nFree cash flow: Free cash flow is defined as operating cash flow less capital spending. Free cash flow represents the cash that the Company is able to generate after taking into account planned maintenance and asset expansion. Management views free cash flow as an important measure because it is one factor used in determining the amount of cash available for dividends and discretionary investment.\nAdjusted free cash flow productivity: Adjusted free cash flow productivity is defined as the ratio of free cash flow to net earnings excluding the transitional impact of U.S. Tax Reform, which is non-recurring and not considered indicative of underlying earnings or cash flow performance. Management views adjusted free cash flow productivity as a useful measure to help investors understand P&G’s ability to generate cash. Adjusted free cash flow productivity is used by management in making operating decisions, allocating financial resources and for budget planning purposes. The Company's long-term target is to generate annual adjusted free cash flow productivity at or above 90 percent.\nTHE PROCTER & GAMBLE COMPANY AND SUBSIDIARIES (Amounts in Millions Except Per Share Amounts) Reconciliation of Non-GAAP Measures Three Months Ended December 31, 2017 TRANSITIONAL AS REPORTED INCREMENTAL IMPACTS OF U.S. NON-GAAP (GAAP) RESTRUCTURING TAX REFORM ROUNDING (CORE) COST OF PRODUCTS SOLD 8,667 (86 ) — 1 8,582 GROSS PROFIT 8,728 86 — (1 ) 8,813 GROSS MARGIN 50.2 % 0.5 % — % — % 50.7 % SELLING, GENERAL AND ADMINISTRATIVE EXPENSE 4,725 14 — (1 ) 4,738 SELLING, GENERAL AND ADMINISTRATIVE EXPENSE AS A % OF NET SALES 27.2 % 0.1 % — % (0.1 )% 27.2 % OPERATING INCOME 4,003 72 — — 4,075 OPERATING PROFIT MARGIN 23.0 % 0.4 % — % — % 23.4 % INCOME TAX ON CONTINUING OPERATIONS 1,472 21 (628 ) — 865 NET EARNINGS ATTRIBUTABLE TO P&G 2,495 51 628 — 3,174 EFFECTIVE TAX RATE 36.5 % (0.1 )% (15.3 )% — % 21.1 % Core EPS\nDILUTED NET EARNINGS PER COMMON SHARE (1) 0.93 0.02 0.24 — 1.19 CURRENCY IMPACT TO CORE EARNINGS (0.04 ) CURRENCY-NEUTRAL CORE EPS 1.15 DILUTED WEIGHTED AVERAGE COMMON SHARES OUTSTANDING 2,669.6 COMMON SHARES OUTSTANDING - DECEMBER 31, 2017 2,521.0 (1) Diluted net earnings per share are calculated on Net earnings attributable to Procter & Gamble. CHANGE VERSUS YEAR AGO CORE GROSS MARGIN (80 ) BPS CORE SELLING GENERAL & ADMINISTRATIVE EXPENSE AS A % OF NET SALES (80 ) BPS CORE OPERATING PROFIT MARGIN (10 ) BPS CORE EFFECTIVE TAX RATE (240 ) BPS CORE EPS 10 % CURRENCY-NEUTRAL CORE EPS 6 % THE PROCTER & GAMBLE COMPANY AND SUBSIDIARIES (Amounts in Millions Except Per Share Amounts) Reconciliation of Non-GAAP Measures Three Months Ended December 31, 2016 AS REPORTED DISCONTINUED INCREMENTAL EARLY DEBT (GAAP) OPERATIONS RESTRUCTURING EXTINGUISHMENT ROUNDING NON-GAAP (CORE) COST OF PRODUCTS SOLD 8,298 — (128 ) — — 8,170 GROSS PROFIT 8,558 — 128 — — 8,686 GROSS MARGIN 50.8 % — % 0.8 % — % (0.1 )% 51.5 % SELLING, GENERAL AND ADMINISTRATIVE EXPENSE 4,683 — 36 — 1 4,720 SELLING, GENERAL AND ADMINISTRATIVE EXPENSE AS A % OF NET SALES 27.8 % — % 0.2 % — % — % 28.0 % OPERATING INCOME 3,875 — 92 — (1 ) 3,966 OPERATING PROFIT MARGIN 23.0 % — % 0.5 % — % — % 23.5 % INCOME TAX ON CONTINUING OPERATIONS 695 — 21 198 (1 ) 913 NET EARNINGS ATTRIBUTABLE TO P&G 7,875 (5,335 ) 71 345 — 2,956 EFFECTIVE TAX RATE 21.3 % — % — % 2.2 % — % 23.5 % Core EPS:\nDILUTED NET EARNINGS PER COMMON SHARE (1) 2.88 (1.95 ) 0.03 0.13 (0.01 ) 1.08 DILUTED WEIGHTED AVERAGE COMMON SHARES OUTSTANDING 2,737.6 (1) Diluted net earnings per share are calculated on Net earnings attributable to Procter & Gamble. THE PROCTER & GAMBLE COMPANY AND SUBSIDIARIES (Amounts in Millions Except Per Share Amounts) Reconciliation of Non-GAAP Measures Six Months Ended December 31, 2017 TRANSITIONAL AS REPORTED INCREMENTAL IMPACTS OF U.S. NON-GAAP (GAAP) RESTRUCTURING TAX REFORM ROUNDING (CORE) COST OF PRODUCTS SOLD 16,896 (186 ) — 1 16,711 GROSS PROFIT 17,152 186 — (1 ) 17,337 GROSS MARGIN 50.4 % 0.5 % — % — % 50.9 % SELLING, GENERAL AND ADMINISTRATIVE EXPENSE 9,414 19 — (1 ) 9,432 SELLING, GENERAL AND ADMINISTRATIVE EXPENSE AS A % OF NET SALES 27.6 % 0.1 % — % — % 27.7 % OPERATING INCOME 7,738 167 — — 7,905 OPERATING PROFIT MARGIN 22.7 % 0.5 % — % — % 23.2 % INCOME TAX ON CONTINUING OPERATIONS 2,353 41 (628 ) — 1,766 NET EARNINGS ATTRIBUTABLE TO P&G 5,348 126 628 — 6,102 EFFECTIVE TAX RATE 30.2 % (0.1 )% (7.9 )% — % 22.2 % Core EPS\nDILUTED NET EARNINGS PER COMMON SHARE (1) 2.00 0.05 0.23 — 2.28 CURRENCY IMPACT TO CORE EARNINGS (0.04 ) CURRENCY-NEUTRAL CORE EPS 2.24 DILUTED WEIGHTED AVERAGE COMMON SHARES OUTSTANDING 2,680.1 (1) Diluted net earnings per share are calculated on Net earnings attributable to Procter & Gamble. CHANGE VERSUS YEAR AGO CORE GROSS MARGIN (70 ) BPS CORE SELLING GENERAL & ADMINISTRATIVE EXPENSE AS A % OF NET SALES (40 ) BPS CORE OPERATING PROFIT MARGIN (20 ) BPS CORE EFFECTIVE TAX RATE (100 ) BPS CORE EPS 8 % CURRENCY-NEUTRAL CORE EPS 6 % THE PROCTER & GAMBLE COMPANY AND SUBSIDIARIES (Amounts in Millions Except Per Share Amounts) Reconciliation of Non-GAAP Measures Six Months Ended December 31, 2016 AS REPORTED DISCONTINUED INCREMENTAL EARLY DEBT (GAAP) OPERATIONS RESTRUCTURING EXTINGUISHMENT ROUNDING NON-GAAP (CORE) COST OF PRODUCTS SOLD 16,400 — (239 ) — — 16,161 GROSS PROFIT 16,974 — 239 — — 17,213 GROSS MARGIN 50.9 % — % 0.7 % — % — % 51.6 % SELLING, GENERAL AND ADMINISTRATIVE EXPENSE 9,328 — 59 — — 9,387 SELLING, GENERAL AND ADMINISTRATIVE EXPENSE AS A % OF NET SALES 27.9 % — % 0.2 % — % — % 28.1 % OPERATING INCOME 7,646 — 180 — — 7,826 OPERATING PROFIT MARGIN 22.9 % — % 0.5 % — % — % 23.4 % INCOME TAX ON CONTINUING OPERATIONS 1,558 — 36 198 — 1,792 NET EARNINGS ATTRIBUTABLE TO P&G 10,589 (5,217 ) 144 345 — 5,861 EFFECTIVE TAX RATE 22.3 % — % (0.1 )% 1.0 % 0.1 % 23.2 % Core EPS:\nDILUTED NET EARNINGS PER COMMON SHARE (1) 3.81 (1.88 ) 0.05 0.12 0.01 2.11 DILUTED WEIGHTED AVERAGE COMMON SHARES OUTSTANDING 2,780.2 (1) Diluted net earnings per share are calculated on Net earnings attributable to Procter & Gamble. Organic sales growth:\nForeign Exchange\nAcquisition/Divestiture\nOrganic Sales\nOctober - December 2017\nNet Sales Growth\nImpact\nImpact (1)\nGrowth\nBeauty 10% (1)% —% 9% Grooming (1)% (2)% —% (3)% Health Care 7% (3)% —% 4% Fabric & Home Care 3% (1)% 1% 3% Baby, Feminine & Family Care (1)% (1)% 1% (1)% Total P&G 3% (1)% —% 2% (1) Acquisition/Divestiture Impact includes both the volume and mix impact of acquisitions and divestitures and also includes the impact of India Goods and Services Tax changes and rounding impacts necessary to reconcile net sales to organic sales. Combined Foreign Exchange &\nOrganic Sales\nTotal P&G\nNet Sales Growth\nAcquisition/Divestiture Impact\nGrowth\nFY 2018\n(Estimate)\nAbout 3% (0.5)% to 0% +2% to +3% Core EPS :\nDiluted EPS\nTotal P&G\nGrowth\nImpact of Incremental Non-Core Items (1)\nCore EPS Growth\nFY 2018\n(Estimate)\n(30)% to (32)% +37% to +38% +5% to +8% (1) Includes impact of U.S. Tax Act in 2018, discontinued operations and loss on early extinguishment of debt in 2017 and year-over-year change in incremental non-core restructuring charges. Free cash flow (dollar amounts in millions):\nThree Months Ended December 31, 2017 Operating Cash Flow\nCapital Spending\nFree Cash Flow\n$3,684 $(768) $2,916 Adjusted free cash flow productivity (dollar amounts in millions) :\nThree Months Ended December 31, 2017 Net U.S. Tax Reform\nAdjusted Free Cash\nFree Cash Flow\nNet Earnings\nCharge\nAdjusted Net Earnings\nFlow Productivity\n$2,916 $2,561 $628 $3,189 91%\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005799/en/\nP&G Media Contacts :\nDamon Jones, 513-983-0190\nJennifer Corso, 513-983-2570\nor\nP&G Investor Relations Contact :\nJohn Chevalier, 513-983-9974\nSource: Procter & Gamble", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pg.com&esheet=51747150&newsitemid=20180123005799&lan=en-US&anchor=http%3A%2F%2Fwww.pg.com&index=1&md5=d7c1344a03c8c703be329fc3cead1c11", "http://www.businesswire.com/news/home/20180123005799/en/"], "published": "2018-01-23T15:00:00.000+02:00", "crawled": "2018-01-23T18:42:23.015+02:00", "highlightTitle": ""}