{"organizations": [], "uuid": "6121f31fb5453404a3866ebd18c595559be2d215", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-chung-coach/tennis-bogeyman-chung-set-to-give-rivals-nightmares-coach-idUKL4N1PJ3FC", "country": "US", "domain_rank": 408, "title": "Tennis-Bogeyman Chung set to give rivals nightmares - coach", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T13:10:00.000+02:00", "replies_count": 0, "uuid": "6121f31fb5453404a3866ebd18c595559be2d215"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-chung-coach/tennis-bogeyman-chung-set-to-give-rivals-nightmares-coach-idUKL4N1PJ3FC", "ord_in_thread": 0, "title": "Tennis-Bogeyman Chung set to give rivals nightmares - coach", "locations": [], "entities": {"persons": [{"name": "tennis-bogeyman chung", "sentiment": "negative"}, {"name": "ian rans", "sentiment": "negative"}, {"name": "godwin", "sentiment": "none"}, {"name": "neville godwin", "sentiment": "none"}, {"name": "tennys sandgren", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "chung hyeon", "sentiment": "none"}, {"name": "chung", "sentiment": "none"}, {"name": "sandgren", "sentiment": "none"}, {"name": "alexander zverev", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "rod laver arena", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 11:10 AM / Updated 17 minutes ago Tennis-Bogeyman Chung set to give rivals nightmares - coach Ian Ransom 4 Min Read \nMELBOURNE, Jan 24 (Reuters) - Nightmares loom for players dreaming of grand slam success if they have the misfortune of running into bespectacled bogeyman Chung Hyeon in coming years, according to his coach Neville Godwin. \nSouth Korea’s new sensation became his country’s first grand slam semi-finalist on Wednesday with a 6-4 7-6(5) 6-3 defeat of Tennys Sandgren, proving a waking bad dream for the 97th-ranked American at the Rod Laver Arena. \nLike victims Alexander Zverev and Novak Djokovic before him, Sandgren hammered away desperately at Chung, only for the unseeded Korean to keep returning with a zombie-like resolve. \nUnspoken of before the tournament among the lists of contenders, let alone the top young guns, Chung will battle defending champion and 19-times grand slam winner Roger Federer in one of the more unlikely semi-final match-ups. \n“Obviously, he moves around the court incredibly well, and he’s incredibly flexible,” Godwin, who began working with the 58th-ranked Chung last year, told reporters at Melbourne Park. \n“Everyone has their strengths, but for Hyeon, I think it would be a nightmare to play against him because he basically out-Djokovic-ed Djokovic (on Monday) which is something that not that many people have been able to do.” \nChung’s blazing run through the Melbourne Park draw has appeared like a bolt from the blue on the surface, but the 21-year-old has shown flickerings of promise for a number of years. \nThe parts have all clicked in a devastating way in Melbourne over the past fortnight but the best is very much yet to come as he matures and enjoys more structure to his scheduling. \n“We have changed some technical things on his serve, which he’s a lot more comfortable with now,” said South African Godwin, who ended his partnership with big-serving compatriot Kevin Anderson last year. \n”He has the option now of serving a high percentage or getting a free point or going for an ace... and he’s feeling a lot better about that. \n”It’s not quite the finished product yet, it’s still quite a work in progress but that’s definitely improved. \n“I’d also like to see him use his phenomenal speed to get up the court a little bit more and use it more in offence rather than only on defence.” THINKING OF HISTORY \nAlthough nicknamed “professor” for his scholarly look, Chung has shown humour on the court, working the crowd with a hand-flapping celebration like many a show-boating NBA player. \nHe also showed himself endearingly human as he blew a 40-0 lead while serving for the match against Sandgren, joining the long list of athletes blinded by visions of the trophy when closing in on victory. \nFive match points came and went before he sealed the win with a thumping forehand to the corner that proved too hot for Sandgren to handle. \n“If I win one more point, I make history in Korea,” Chung said of his wobble. \n“I (was) thinking about the ceremony.” \nChung’s qualification for the semi-finals is certain to trigger a new round of front page headlines in South Korea’s newspapers on Thursday, a country which has hitherto had a very limited tennis history. \nSimilar to Asia’s first grand slam singles champion Li Na, who was overwhelmed by the attention the Chinese woman’s 2011 French Open triumph garnered back home, Chung would need to brace for big change on the domestic front, said Godwin. \n“I don’t think that anyone is ever ready for that kind of thing,” he said. \n”It hits you much bigger than you can imagine. \n“He maybe doesn’t feel the outside effects of it. He will feel it when he gets (home). It will be interesting to see but I think he’ll handle it fine.” (Editing by John O‘Brien)", "external_links": [], "published": "2018-01-24T13:10:00.000+02:00", "crawled": "2018-01-24T13:34:06.003+02:00", "highlightTitle": ""}