{"organizations": [], "uuid": "b193bdeeb6089c5f6b7d280f21f6890d4179cbde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-oak-valley-community-bank-announces-senior-vice-president-promotions.html", "country": "US", "domain_rank": 767, "title": "Oak Valley Community Bank Announces Senior Vice President Promotions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T03:05:00.000+02:00", "replies_count": 0, "uuid": "b193bdeeb6089c5f6b7d280f21f6890d4179cbde"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-oak-valley-community-bank-announces-senior-vice-president-promotions.html", "ord_in_thread": 0, "title": "Oak Valley Community Bank Announces Senior Vice President Promotions", "locations": [], "entities": {"persons": [{"name": "linda spinelli", "sentiment": "none"}, {"name": "spinelli", "sentiment": "none"}, {"name": "julie", "sentiment": "none"}, {"name": "dehart", "sentiment": "none"}, {"name": "julie dehart", "sentiment": "none"}], "locations": [{"name": "oakdale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "oak valley", "sentiment": "none"}, {"name": "oakdale", "sentiment": "none"}], "organizations": [{"name": "oak valley community bank", "sentiment": "negative"}, {"name": "customer service", "sentiment": "none"}, {"name": "vp/retail banking group", "sentiment": "none"}, {"name": "retail banking group", "sentiment": "none"}, {"name": "oak valley bancorp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OAKDALE, Calif., Jan. 02, 2018 (GLOBE NEWSWIRE) -- Oak Valley Community Bank, a wholly owned subsidiary of Oak Valley Bancorp (NASDAQ:OVLY), announced the promotions of Julie DeHart to Senior Vice President, Retail Banking Group Manager and Linda Spinelli to Senior Vice President, Central Operations Manager.\nDeHart and Spinelli have been with the bank since 2005, each having at least 20 years of total banking experience. DeHart originally joined Oak Valley at a time when the bank was gearing up for expansion. She quickly established herself as an invaluable resource for peers and management alike, which led to numerous promotions over the years. Prior to this promotion she had served the bank as Customer Service Manager (Oakdale), Branch Manager (Escalon), VP/Training & Development Manager, and VP/Retail Banking Group – Operations Manager.\n“Julie is a consummate performer. Time-and-time again, when asked to take on new challenges and additional responsibility, she has risen to the occasion. Through her career path and performance, she has established a solid foundation in branch operations while having the ability to shape the service culture and customer experience within our branches,” stated Rick McCarty, Senior Executive Vice President and COO.\nSpinelli has managed the Central Operations Department since joining the bank. During that time she transformed a three-person electronic banking and branch support team into a full-service Customer Service Center supporting customer and branch needs across the bank’s network.\n“Linda has developed a strong team tasked with supporting customers, branches, and other departments across a variety of systems and service delivery channels. To ensure the highest level of customer service, she continues to evaluate and manage our deposit-side transactional workflow; which is ever-increasing in terms of both volume and complexity,” McCarty concluded.\n“Julie and Linda have contributed to the bank’s success by demonstrating strong leadership skills within the management team. They have each played vital roles in the continuous expansion and success of Oak Valley Community Bank,” added Chris Courtney, President and CEO.\nOak Valley Bancorp operates Oak Valley Community Bank & Eastern Sierra Community Bank, through which it offers a variety of loan and deposit products to individuals and small businesses. They currently operate through 16 conveniently located branches: Oakdale, Turlock, Stockton, Patterson, Ripon, Escalon, Manteca, Tracy, two branches in Sonora, three branches in Modesto, and three branches in their Eastern Sierra Division, including Bridgeport, Mammoth Lakes and Bishop. In December, Oak Valley also announced plans to open a loan production office in Downtown Sacramento.\nFor more information, call 1-866-844-7500 or visit www.ovcb.com .\nContact:\nChris Courtney/Rick McCarty\n(209) 848-2265\nwww.ovcb.com\nSource:Oak Valley Community Bank", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8d1f2c51-d6d7-4db7-b5c0-4cd580e61938"], "published": "2018-01-03T03:05:00.000+02:00", "crawled": "2018-01-03T04:10:45.000+02:00", "highlightTitle": ""}