{"organizations": [], "uuid": "7d1e47cdb7667e01cd853bd25a90a21be2e79b4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221886816&w=1200&r=LYNXMPEE0D07G", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews/", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind/wasteful-india-let-proteas-off-the-hook-in-second-test-idUKKBN1F30CV", "country": "US", "domain_rank": 408, "title": "Cricket-Wasteful India let Proteas off the hook in second test", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T12:22:00.000+02:00", "replies_count": 0, "uuid": "7d1e47cdb7667e01cd853bd25a90a21be2e79b4e"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind/wasteful-india-let-proteas-off-the-hook-in-second-test-idUKKBN1F30CV", "ord_in_thread": 0, "title": "Cricket-Wasteful India let Proteas off the hook in second test", "locations": [], "entities": {"persons": [{"name": "hashim amla", "sentiment": "none"}, {"name": "faf du plessis", "sentiment": "none"}, {"name": "lokesh rahul", "sentiment": "none"}, {"name": "murali vijay", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "wasteful india", "sentiment": "none"}, {"name": "centurion stadium", "sentiment": "none"}, {"name": "pretoria", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "pretoria", "sentiment": "none"}], "organizations": [{"name": "wasteful india", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 10:43 AM / Updated an hour ago Ngidi takes first test wicket but Kohli holds firm for India Reuters Staff 3 Min Read \nPRETORIA (Reuters) - Young South African seamer Lungi Ngidi took his first test wicket but India captain Virat Kohli led the resistance for the tourists as they reached 183 for five at the close of day two of the second test in Pretoria on Sunday. Cricket - India v South Africa - Second Test match - Centurion Stadium, Pretoria, South Africa - January 13, 2018. South Africa's Hashim Amla is run out during the second Test match against India. REUTERS/James Oatway \nIndia trail South Africa by 152 runs having bowled their hosts out for 335 just before lunch on a slow wicket that has bounce, but little lateral movement. \nKohli will resume his innings on 85 not out along with all-rounder Hardik Pandya (11 not out) as the pair seek to eke out a first innings lead in the knowledge that batting last on a wicket already showing variable bounce will be a challenge. \nIndia have tried to be positive with the bat, but have lost wickets at regular intervals, with the top seven so far failing to provide support for Kohli. \nThe openers took the score to 28 before losing their first wicket when Lokesh Rahul (10) was caught and bowled by Morne Morkel, misjudging a delivery that held up on the surface. \nThey lost another wicket on the next ball when new batsman Cheteshwar Pujara took on the arm of Ngidi at mid-on and lost, run out by a direct hit. \nMurali Vijay (46) added 79 for the third wicket with his captain before he edged spinner Keshav Maharaj (1-53) to wicketkeeper Quinton de Kock. \nRohit Sharma (10) was trapped leg before wicket by the world’s leading test bowler Kagiso Rabada (1-33), before Ngidi (1-26) delighted the home crowd with his first test wicket – Parthiv Patel (19) edging to De Kock. \nKohli has played a superb innings in trying to hold the India effort together, scoring at a brisk pace as well with his 85 coming off 130 deliveries. \nIndia had earlier taken the final four South African wickets in their innings for 66 runs in the morning session. \nHome captain Faf du Plessis struck a well-compiled 63 before he was bowled by Ishant Sharma (3-46), but the pick of the tourists’ attack was spinner Ravichandran Ashwin, who claimed 4-113 and also had three catches dropped off his bowling. \nMohammed Shami became the seventh Indian fast bowler to 100 test wickets when he had Maharaj caught by Patel, the third quickest to reach that mark in his 29th test after Kapil Dev (25 tests) and Irfan Pathan (28). \nSouth Africa lead the three-test series 1-0 after a 72-run victory in Cape Town in the opening fixture. Reporting By Nick Said; Editing by John O'Brien and Toby Davis", "external_links": [], "published": "2018-01-14T12:22:00.000+02:00", "crawled": "2018-01-14T12:49:07.011+02:00", "highlightTitle": ""}