{"organizations": [], "uuid": "70371b4ffab9e3260b4aa175b26dfdf321db9247", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/nestle-ma-ferrero-strategy/rpt-dealmaking-ferrero-tycoon-breaks-decades-of-family-tradition-idUSL8N1PC626", "country": "US", "domain_rank": 408, "title": "RPT-Dealmaking Ferrero tycoon breaks decades of family tradition", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T09:00:00.000+02:00", "replies_count": 0, "uuid": "70371b4ffab9e3260b4aa175b26dfdf321db9247"}, "author": "", "url": "https://www.reuters.com/article/nestle-ma-ferrero-strategy/rpt-dealmaking-ferrero-tycoon-breaks-decades-of-family-tradition-idUSL8N1PC626", "ord_in_thread": 0, "title": "RPT-Dealmaking Ferrero tycoon breaks decades of family tradition", "locations": [], "entities": {"persons": [{"name": "ferrero", "sentiment": "negative"}, {"name": "giancarlo navach", "sentiment": "none"}, {"name": "giovanni ferrero", "sentiment": "none"}, {"name": "francesca landini", "sentiment": "none"}, {"name": "stephen jewkes", "sentiment": "none"}], "locations": [{"name": "milan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nestle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats story published late on Wednesday)\nBy Francesca Landini, Stephen Jewkes and Giancarlo Navach\nMILAN, Jan 17 (Reuters) - For almost 70 years, family-owned chocolate group Ferrero shunned acquisitions, relying completely on its ability to grow on its own and dream up new products. Those days are gone.\nWith Giovanni Ferrero at the helm of the Nutella maker, the traditionally Europe-focused business has swallowed up six companies in the last three years - half of them in the United States.\nThe latest acquisition, of Nestle’s U.S. confectionery business, was announced on Tuesday. It was by far his biggest bet, sinking $2.8 billion into a tough market where Nestle was losing ground, and swimming against the tide as many rivals move towards healthier products.\nSuch was the risk, that the 53-year-old decided to conduct part of the acquisition in his own name, via his own investment company, to shield the rest of the business, according to three sources close to the matter. They did not disclose the size of his investment.\nThe sources said his willingness to use his own company and financing also flagged his commitment to a strategy that broke with decades of business history for Italy’s richest family.\nMore acquisitions could come outside Europe in the next few years, said one of the sources, with the United States and China among countries being considered by the group, founded by Pietro Ferrero in the Italian town of Alba in 1946.\nThe company was not available for comment.\nIn another major departure, many of Giovanni Ferrero’s acquisitions have propelled the company into candy - or sweets - and away from its traditional chocolate roots, notably the purchase last year of Illinois-based candy company Ferrara, whose brands include Jujyfruits and Lemonhead.\n“The Ferrara deal was sugar confectionery. Giovanni’s father would never have approved of this,” said a person with knowledge of the family’s thinking, referring to family patriarch and company boss Michele Ferrero who died in 2015.\nAnother source said Ferrero would merge the chocolate assets from Nestle’s confectionery business with the group’s traditional business while the candy assets would be rolled into Ferrara, to create a candy hub in North America.\nThis would keep non-chocolate operations separate from the traditional business to diversify risk and avoid spillover in case of difficulty, the source said, adding the strategy had been approved by the wider family.\nCRIME NOVELS Giovanni Ferrero, who writes crime and romance novels in his spare time, took the helm in tragic circumstances. His older brother Pietro died from a suspected heart attack aged 47 while cycling, leaving him to take over the leadership of the company when their father Michele passed away in 2015.\nAlmost immediately he set about overhauling a business that was still trading largely on its signature product created by his father in the 1960s, Nutella chocolate-hazelnut spread.\nMichele Ferrero had always shied away from making acquisitions, preferring to rely on Ferrero’s own ability to innovate. He also spurned takeover offers for Ferrero, including a bid by Nestle, according to a separate financial source.\n“Michele was totally convinced his products were superior to rivals. That’s why tie-ups ... fell through. He simply wasn’t interested,” the source said.\nGiovanni Ferrero first bought Britain’s Thorntons chocolate retail chain, in 2015, sending out a sign that his company was not for sale. Since then he has snapped up five more companies and expanded the business beyond chocolate into other confectionery, such as biscuits, gums and candies.\nThe Ferrero boss, who lives in Brussels with his wife and two children, has also brought in foreign managers and last year hired the company’s first non-family CEO. (Additional reporting by Martinne Geller; Editing by Pravin Char)\n ", "external_links": [], "published": "2018-01-18T09:00:00.000+02:00", "crawled": "2018-01-18T09:26:00.002+02:00", "highlightTitle": ""}