{"organizations": [], "uuid": "ea9143d2dfa6dd56fd39bf3d0ddf00777fb4ac79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/10/12/103070260-GettyImages-452171982.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/22/general-electric-is-falling-again-after-bank-of-america-downgrade-nears-16-a-share.html", "country": "US", "domain_rank": 767, "title": "General Electric is falling again after Bank of America downgrade, nears $16 a share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:37:00.000+02:00", "replies_count": 0, "uuid": "ea9143d2dfa6dd56fd39bf3d0ddf00777fb4ac79"}, "author": "Thomas Franck", "url": "https://www.cnbc.com/2018/01/22/general-electric-is-falling-again-after-bank-of-america-downgrade-nears-16-a-share.html", "ord_in_thread": 0, "title": "General Electric is falling again after Bank of America downgrade, nears $16 a share", "locations": [], "entities": {"persons": [{"name": "obln", "sentiment": "none"}, {"name": "andrew obln", "sentiment": "none"}], "locations": [], "organizations": [{"name": "general electric", "sentiment": "negative"}, {"name": "bank of america merrill lynch", "sentiment": "negative"}, {"name": "bank of america", "sentiment": "negative"}, {"name": "ge digital", "sentiment": "none"}, {"name": "ge", "sentiment": "none"}, {"name": "ge capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 00:43 \nGeneral Electric shares continued to plumb new depths after Bank of America Merrill Lynch downgraded the troubled bellwether on Monday. \nThe shares fell 0.55 percent Monday to close at $16.17 and touched an intraday low of $15.80, their lowest in six years. The stock fell last week below $17 a share after GE said earlier in the week that it would take a $6.2 billion after-tax charge because of its GE Capital insurance portfolio and that it expects to contribute $14 billion over the next seven years to shore up the company's reserves. \nAnalyst Andrew Obin told investors that the industrial conglomerate is likely to slash its 2018 outlook when it reports fourth-quarter results on Wednesday. \nOur outlook \"reflects lower earnings estimates, zero equity value assigned to GE Capital, and lower value assigned to GE Digital initiatives, as we don't see the market paying up for this optionality,\" wrote Obin in a note to clients. \"The relative size of the charge vs. expectations and limited disclosure related to potential off-balance sheet liabilities once again raise a question about the credibility of the current guidance and capital structure framework.\" show chapters 2 Hours Ago | 02:37 \nThe analyst has a 12-month price target of $17 and downgraded the stock to neutral from buy. The shares are down 47 percent over the past 12 months. \nObin's view echoes the concern of the market's last week, that not even a breakup can stop the recent slide. The company may move to split itself as early as this spring , sources told CNBC's David Faber last Tuesday. \n\"Our view is that General Electric's key challenge is in North America and it relates to the lack of robust demand for new gas-fired power capacity coupled with an installed fleet that is coming off Long Term Service Agreements that were put in place as far back as 2000,\" Obin explained.\"Because of a relatively benign demand environment, operators in many cases choose lower cost third party service and parts providers as they are looking for 'good enough' v. top tier, higher cost service options that optimize performance provided by General Electric.\" \nGeneral Electric has hemorrhaged value over the past year as new CEO John Flannery attempts to turn the conglomerate around. The company recently cut its dividend to raise funds, but alienated many longtime investors in the process. \n— CNBC's Michael Bloom contributed to this report.", "external_links": [], "published": "2018-01-22T16:37:00.000+02:00", "crawled": "2018-01-22T15:57:47.000+02:00", "highlightTitle": ""}