{"organizations": [], "uuid": "91ba1f3b5ecd213300ac9b976a9f0db96fd51d80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-respirerx-pharmaceuticals-inc-to-present-at-10th-annual-biotech-showcasea-2018.html", "country": "US", "domain_rank": 767, "title": "RespireRx Pharmaceuticals Inc. to Present at 10th Annual Biotech Showcase™ 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:45:00.000+02:00", "replies_count": 0, "uuid": "91ba1f3b5ecd213300ac9b976a9f0db96fd51d80"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-respirerx-pharmaceuticals-inc-to-present-at-10th-annual-biotech-showcasea-2018.html", "ord_in_thread": 0, "title": "RespireRx Pharmaceuticals Inc. to Present at 10th Annual Biotech Showcase™ 2018", "locations": [], "entities": {"persons": [{"name": "manuso", "sentiment": "none"}, {"name": "james s. manuso", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "hilton san francisco hotel", "sentiment": "none"}, {"name": "glen rock", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "iib", "sentiment": "negative"}, {"name": "respirerx pharmaceuticals inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "ebd group", "sentiment": "none"}, {"name": "pacific standard time", "sentiment": "none"}, {"name": "demy-colton life sciences advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CEO to Review completed Phase IIB dronabinol trial for the treatment of Obstructive Sleep Apnea (OSA) and Provide Pipeline update\nGlen Rock, N.J., Jan. 08, 2018 (GLOBE NEWSWIRE) -- RespireRx Pharmaceuticals Inc. (OTC QB: RSPI) (“RespireRx” or the “Company”), a leader in the development of medicines for the treatment of respiratory disorders for which there are no approved pharmaceuticals, particularly sleep apneas and drug-induced respiratory depression, announces that the Company’s President, Chief Executive Officer and Vice Chairman of the Board of Directors, James S. Manuso, Ph.D., will present at The Biotech Showcase™ on Tuesday, January 9, 2018 at 3:30 PM Pacific Standard Time ( www.biotechshowcase.com or www.ebdgroup.com/bts/index.php ). The Conference is co-sponsored by the EBD Group and Demy-Colton Life Sciences Advisors. Presentations will be held at the Hilton San Francisco Hotel in San Francisco, California from January 9 – 11, 2017.\nDr. Manuso will discuss the successfully completed Phase IIB PACE trial in which dronabinol was tested for the treatment of OSA, along with the successful results of Phase IIA trials testing CX-1739 for drug-induced respiratory depression and central sleep apnea. He will also provide background information and descriptions of other product pipeline candidates.\nDr. Manuso’s presentation will be available by live webcast streaming online. To access the live audio webcast, go to:\nhttps://pgi.webcasts.com/viewer/event.jsp?ei=1176868&tp_key=90197ad027\nThis link will enable access to the archived webcast. This press release with the live link will also be available on the company’s website at www.respirerx.com , by going to the Investors tab. A copy of the slide presentation to be presented at the conference will be submitted to the Securities and Exchange Commission in a Current Report on Form 8-K prior to the presentation and will also be available in the investors section of RespireRx’s website.\nAbout RespireRx Pharmaceuticals Inc.\nRespireRx Pharmaceuticals Inc. is a leader in the development of medicines for respiratory disorders, with a focus on sleep apneas and drug-induced respiratory depression. During 2018, the Company plans to meet with FDA to discuss its Phase III clinical trial program to test the safety and efficacy of dronabinol for the treatment of OSA. The Company owns patents and patent applications, and holds exclusive licenses, for certain families of chemical compounds that claim the chemical structures and their use in the treatment of these and other disorders.\nRespireRx’s pharmaceutical candidates in development are derived from two platforms, as described below.\nThe first platform is the class of compounds known as cannabinoids, in particular, dronabinol. Under a license agreement with the University of Illinois, the Company has rights to patents claiming the use of cannabinoids for the treatment of sleep-related breathing disorders. In a double-blind, placebo-controlled, dose-ascending Phase 2A clinical study conducted by the Company, dronabinol produced a statistically significant reduction in the Apnea-Hypopnea Index (AHI), the primary therapeutic end-point, and was observed to be safe and well-tolerated in a group of patients with OSA. Investigators at the University of Illinois and Northwestern University have completed their investigation of dronabinol in a potentially pivotal, six week, double-blind, placebo-controlled Phase 2B clinical trial in 56 patients with OSA. This study was fully funded by the National Heart, Lung and Blood Institute of the National Institutes of Health. The Company did not manage or fund this clinical trial.\nThe second platform of medicines being developed by RespireRx is a class of proprietary compounds known as ampakines that act to enhance the actions of the excitatory neurotransmitter glutamate at AMPA glutamate receptor sites in the brain. Several ampakines in both oral and injectable form are being developed by the Company for the treatment of a variety of breathing disorders. In a Phase IIA clinical trial testing CX-1739 for drug-induced respiratory depression, this medicine was shown to control respiratory depression produced by remifentanil, a potent opioid, without altering its analgesic effects. In another Phase IIA clinical trial, CX-1739 demonstrated preliminary efficacy in controlling central sleep apnea. Various ampakines have demonstrated improved breathing function in animal models of orphan disorders such as Pompé Disease, spinal cord damage and perinatal respiratory distress. The Company’s compounds belong to a new class of ampakines that do not display undesirable side effects previously reported by earlier generations of ampakines.\nAdditional information about the Company and the matters discussed herein can be obtained on the Company’s web-site at www.RespireRx.com or in the Company’s filings with the U.S. Securities and Exchange Commission on EDGAR at www.sec.gov.\nClinical Trial Plans for 2018 - Phase III Clinical Trial Plans for Development of Dronabinol\nAs reported previously, RespireRx announced positive results for the PACE (Pharmacotherapy of Apnea by Cannabimimetic Enhancement) trial conducted by Dr. David Carley, Dr. Phyllis Zee and their colleagues at the University of Illinois at Chicago and Northwestern University, respectively. The PACE trial, a Phase 2B study of dronabinol for the treatment of OSA, clearly demonstrated that dronabinol significantly improved the primary outcome measures of AHI, daytime sleepiness as measured by the Epworth Sleepiness Scale (“ESS”) and overall patient satisfaction as measured by the Treatment Satisfaction Questionnaire for Medications (“TSQM”). Based on these results, RespireRx will engage with FDA to agree upon the next steps in connection with the initiation of a pivotal Phase III clinical trial program testing the safety and efficacy of dronabinol in the treatment of obstructive sleep apnea.\nClinical Trial Plans for 2018 - Phase II Trial of CX1739 in Central Sleep Apnea\nPending additional financing and/or strategic relationships, the Company plans to conduct a Phase II, multiple dose clinical trial investigating the ability of CX1739 to improve breathing in patients with central sleep apnea. Of particular interest will be to look at patients undergoing chronic opioid treatment. In these patients, central sleep apnea is a major risk factor for opioid over-dose.\nOther Potential Clinical Indications for Ampakines\nWhile developing potential applications for respiratory disorders, RespireRx has retained and expanded its ampakine intellectual property and data with respect to neurological and psychiatric disorders and is considering developing certain indications, pending additional financing and/or strategic relationships. As an example, based on positive results from a Phase II clinical trial of CX717 in patients with Attention Deficit Hyperactivity Syndrome (ADHD), RespireRx has filed patent applications claiming the use of ampakines for the treatment of ADHD and is seeking support for further clinical development in this area. In addition, animal studies conducted in collaboration with Dr. David Fuller and his colleagues at the University of Florida have demonstrated the ability of our lead ampakines to significantly improve breathing in animals with spinal cord injury. The Company believes that these results reflect a more general process whereby the ampakines might improve th", "external_links": ["https://pgi.webcasts.com/viewer/event.jsp?ei=1176868&tp_key=90197ad027", "http://www.ebdgroup.com/bts/index.php", "https://www.globenewswire.com/NewsRoom/AttachmentNg/b2b81167-180d-4461-86d6-a3701d7c62ad", "https://www.globenewswire.com/Tracker?data=XuKkPtfQ_FTuZ0DEkBNOtKyqDMVtD_6u5fOKJca-tDl-hwajPCsf3cctaT8NepfpHZLTMXc0ZzYYpn16pUECI2M6UanrucswXoOxKaIpEsc=", "https://www.globenewswire.com/Tracker?data=hc3epbSnbVK1MbW6564ktJOrw93legNMgmVMF0qa0gRQfA0WqxJCrFDguOrYrZuWgO9Ex7ocmyiG7OmqgeYYOQ==", "https://www.globenewswire.com/Tracker?data=Q7bygfDmIcruz_oHseQ2mt8zcjzpPWfARL634kl6JcpNPT2fHCNZqShAlhfv5yXkXKzmHQ6JMQEQSD_CN7WYtA==", "https://www.globenewswire.com/Tracker?data=m8sDmvYVt31KLYPN29ViIwJ9QN5DxtwVlmD_4VqQFF34hfc-t09pvp7b4llyBiDt-vO4d0VEy7dORHNznGNvgw98s8hNNUsem39zD7LSwI3QxMKSD4GzFDRM3Fxep601INCdAvM6_BJpcVpLa77EESv6to9qAKvzofrsAw5EVtFVujErXrWj2t5IvslKXksLPQJJdo7KoHtwkG0FPpF2Cpgg_GtDt66jdsvc1nBVByU="], "published": "2018-01-08T16:45:00.000+02:00", "crawled": "2018-01-08T18:50:17.000+02:00", "highlightTitle": ""}