{"organizations": [], "uuid": "43e8d2d9f99e94bbffd1197c943df5ff7e2b988b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-rgs-energy-prices-1-point-8-million-common-stock-and-warrant-financing.html", "country": "US", "domain_rank": 767, "title": "RGS Energy Prices $1.8 Million Common Stock and Warrant Financing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:15:00.000+02:00", "replies_count": 0, "uuid": "43e8d2d9f99e94bbffd1197c943df5ff7e2b988b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-rgs-energy-prices-1-point-8-million-common-stock-and-warrant-financing.html", "ord_in_thread": 0, "title": "RGS Energy Prices $1.8 Million Common Stock and Warrant Financing", "locations": [], "entities": {"persons": [], "locations": [{"name": "denver", "sentiment": "none"}], "organizations": [{"name": "rgs energy", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, Jan. 02, 2018 (GLOBE NEWSWIRE) -- RGS Energy (NASDAQ:RGSE) today announced that it has entered into a securities purchase agreement with one institutional investor providing for the purchase and sale of (i) 800,000 shares of Class A common stock, (ii) Prepaid Series P Warrants to purchase an aggregate of 800,000 shares of Class A common stock, and (iii) Series O Warrants to purchase an aggregate of 1,600,000 shares of Class A common stock. The investor will pay $1.15 per share of Class A common stock and $1.14 per share of Class A common stock underlying Series P Warrants, for expected aggregate gross proceeds of approximately $1.8 million.\nThe Series O Warrants will be exercisable six months following issuance at an exercise price of $1.47 per share and for a period of five years thereafter. The Series P Warrants will be exercisable immediately after issuance and for a period of five years thereafter at an exercise price of $1.15 per share, of which $1.14 per share will be paid at the closing with $0.01 per share payable upon exercise of the Series P Warrants. The warrants will not be separately listed for trading.\nWestPark Capital, Inc. acted as the exclusive placement agent in the offering.\nThe offering is expected to close on or about January 4, 2018, subject to customary closing conditions. After RGS Energy pays the placement agent fees and estimated offering expenses, RGS Energy expects to receive net proceeds of approximately $1.5 million.\nThe shares of Class A common stock and the Series P Warrants were, and the shares of Class A common stock issuable upon exercise of the Series P Warrants will be, offered pursuant to a prospectus supplement and an accompanying prospectus filed as part of an effective shelf registration statement filed with the U.S. Securities and Exchange Commission (“SEC”). The Series O Warrants were, and the shares of Class A common stock issuable upon exercise of the Series O Warrants will be, offered in a concurrent private placement and have not been registered under the Securities Act of 1933, as amended.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any offer or sale of any securities, in any state or jurisdiction in which the offer, solicitation, or sale of securities would be unlawful. Any offers, solicitations of offers to buy, or sales of securities will only be made pursuant to the registration statement filed with the SEC, including the related prospectus and prospectus supplement. Copies of the prospectus supplement and the accompanying prospectus relating to the offering are or will be available free of charge on the SEC’s website at www.sec.gov .\nCautionary Statement Regarding Forward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995 that involve risks and uncertainties. Such forward-looking statements include, but are not limited to, statements regarding the size and timing of the offering discussed herein and the anticipated use of proceeds of the offering. Forward-looking statements are neither historical facts nor assurances of future performance. Instead, they provide RGS Energy’s current beliefs, expectations, assumptions, forecasts, and hypothetical constructs about future events, and include statements regarding our future results of operations and financial position, business strategy, budgets, projected costs, plans and objectives of management for future operations. The words “expect,” “may,” “will” and similar expressions as they relate to RGS Energy are intended to identify such forward-looking statements.\nForward-looking statements should not be read as a guarantee of future performance or results, and will not necessarily be accurate indications of the times at, or by, which such performance or results will be achieved, if at all. Forward looking statements are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in or suggested by the forward looking statements. Therefore, RGS Energy cautions you against relying on any of these forward-looking statements.\nKey risks and uncertainties that may cause a change in any forward-looking statement include: the size and timing of completion of the offering discussed herein. You should read the section entitled “Risk Factors” in our 2016 Annual Report on Form 10-K, as amended, and in our Quarterly Reports on Form 10-Q for the fiscal quarters ending September 30, 2017, and in the prospectus supplement, each of which has been filed with the SEC, and which identify certain of these and additional risks and uncertainties. Any forward-looking statements made by RGS Energy in this press release speak only as of the date of this press release. Factors or events that could cause RGS Energy’s actual results to differ may emerge from time to time, and it is not possible to predict all of them. RGS Energy does not undertake any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise, except as may be required by law.\nMedia and Investor Relations Contact for RGS Energy:\nRon Both, Managing Partner\nCapital Market Access, LLC (CMA)\nTel 1-949-432-7566\nRGSE@cma.team\nSource: RGS Energy", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/2b57334a-a92f-4b98-8311-5a1b03fc4de4"], "published": "2018-01-02T17:15:00.000+02:00", "crawled": "2018-01-02T19:19:20.000+02:00", "highlightTitle": ""}