{"organizations": [], "uuid": "bac0053df7ba1a93475267d6a56281334d35d8c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222443093&w=1200&r=LYNXMPEE0F0YW", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/uk-metals-stocks/as-stockpiles-fall-which-metals-are-really-in-tight-supply-idUKKBN1F51PF", "country": "US", "domain_rank": 408, "title": "As stockpiles fall, which metals are really in tight supply?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:31:00.000+02:00", "replies_count": 0, "uuid": "bac0053df7ba1a93475267d6a56281334d35d8c6"}, "author": "", "url": "https://uk.reuters.com/article/uk-metals-stocks/as-stockpiles-fall-which-metals-are-really-in-tight-supply-idUKKBN1F51PF", "ord_in_thread": 0, "title": "As stockpiles fall, which metals are really in tight supply?", "locations": [], "entities": {"persons": [{"name": "peter hobson", "sentiment": "none"}, {"name": "robin bhar", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "london metal exchange", "sentiment": "none"}, {"name": "shanghai futures exchange", "sentiment": "none"}, {"name": "cme group", "sentiment": "none"}, {"name": "lme", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 2:13 PM / Updated 18 minutes ago As stockpiles fall, which metals are really in tight supply? Peter Hobson 4 Min Read \nLONDON (Reuters) - Stocks of industrial metals in London Metal Exchange (LME) warehouses fell more than 40 percent last year and further declines are expected in 2018, which should in theory signal tighter supplies and fuel a blistering price rally. Men walk past the London Metal Exchange (LME) in London, July 22, 2011. REUTERS/Paul Hackett/File Photo \nBut rising inventories of metals at smaller rival exchanges suggest the real supply picture is more mixed. \nStocks of metal in warehouses monitored by the Shanghai Futures Exchange (ShFE) more than doubled last year with aluminium stockpiles surging 649 percent to a record high of 754,133 tonnes as output in China jumped. \nCopper stocks in CME Group ( CME.O ) warehouses in the United States meanwhile leapt 139 percent to a record 232,777 tonnes. \n“The LME in theory is a barometer of supply and demand and looking at LME stocks you’d be pretty bullish on metals prices,” said Robin Bhar, head of metals research at Societe Generale. \n“But if you look at the global picture and include ShFE and Comex you probably want to be a bit more neutral.” \nConcerns over tight supplies together with a surge of speculative buying drove prices of metals including copper, aluminium and zinc up around 30 percent last year to multi-year highs. \nBut 2017 saw real tightness of supply only for lead and zinc, said Bhar. Total lead inventories in all exchange warehouses fell 18 percent last year to 184,233 tonnes while zinc stocks plunged 57 percent to 249,605 tonnes. \n(Graphic for 2017 metals inventory changes, click reut.rs/2D6DzBD ) \nThe picture of more plentiful supply is borne out in the spreads between longer and shorter dated contracts. \nThe premium for 3-month LME zinc over the 15-month contract increased throughout 2017 and was around $120 on Monday, showing rising demand for metal in the short term. \nBut copper, aluminium and nickel showed the opposite trend, signalling comfortable availability of near-term supply. \n(Graphic for 3-15 month spreads, click reut.rs/2DbzqMP ) \nInventories are likely to fall further this year as healthy global economic growth drives demand for metals, said ING analyst Warren Patterson. \nParticularly at risk are copper and zinc, analysts said. \nA copper market surplus for 2018 of 48,000 tonnes forecast by BMO Capital Markets could be wiped out if wage negotiations at mines in top producers Chile and Peru lead to strikes that disrupt supplies. \nA deal on labour conditions at Escondida in Chile, the world’s largest copper mine, expires in June. \nChina, the world’s largest consumer, could also suck in massive amounts of refined copper if authorities there aggressively enforce restrictions on imports of scrap. \nChina imported 3.3 million tonnes of scrap in the first 11 months of 2017 but as of early January had issued import quotas of 140,485 tonnes, down more than 90 percent from the same time last year, according to Citi analyst Max Layton. \nIn zinc, Chinese curbs on use of polluting induction furnaces which recycle galvanised steel scrap containing zinc caused a surge in Chinese imports that has drawn down stocks held in exchange warehouses as well as storage outside the exchange system. \n“Stocks are nearing critically low levels - about 2-3 weeks of consumption - as we get into the seasonally strong demand period between February and June,” said Layton. \nCiti forecasts a zinc market deficit of 550,000 tonnes in 2017 and 350,000 tonnes this year. It expects new supply to come to market in late 2018 and 2019. \n(Graphic for Chinese zinc imports vs ShFE zinc stocks, click reut.rs/2DDyHVB ) Reporting by Peter Hobson; Editing by Adrian Croft", "external_links": [], "published": "2018-01-16T16:31:00.000+02:00", "crawled": "2018-01-16T17:00:45.008+02:00", "highlightTitle": ""}