{"organizations": [], "uuid": "c1b47f96262bf2b17768706c7c0d45726f84482f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-owi-welcomes-second-former-white-house-cybersecurity-advisor.html", "country": "US", "domain_rank": 767, "title": "OWI Welcomes Second Former White House Cybersecurity Advisor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-11T17:07:00.000+02:00", "replies_count": 0, "uuid": "c1b47f96262bf2b17768706c7c0d45726f84482f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-owi-welcomes-second-former-white-house-cybersecurity-advisor.html", "ord_in_thread": 0, "title": "OWI Welcomes Second Former White House Cybersecurity Advisor", "locations": [], "entities": {"persons": [{"name": "joe stuntz", "sentiment": "none"}, {"name": "ross nodurft", "sentiment": "none"}, {"name": "nodurft", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "owi", "sentiment": "none"}, {"name": "national security", "sentiment": "none"}, {"name": "omb", "sentiment": "none"}, {"name": "white house office of management and budget", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 11, 2018 /PRNewswire/ -- Today, One World Identity (OWI), an independent strategy and research company focused on identity, is announcing Ross Nodurft as Vice President of Risk Management. Nodurft most recently served as Chief of the Cyber and National Security team in the White House Office of Management and Budget (OMB) where he oversaw the development and implementation of cybersecurity, identity, and incident response policy for federal civilian agencies.\nIn his new role, Nodurft will work closely with the Vice President of Cybersecurity, Joe Stuntz, who recently joined OWI from the White House. Together, they will build risk management and cybersecurity solutions using models created for the public sector optimized through the deep private sector experience of the OWI team. Nodurft will be leading the government solutions line of business and spearheading several roundtables focused on risk management and incident response. The roundtables will bring together key policy leaders and industry stakeholders to discuss the impact of future policy decisions around risk management, incident response, identity, and secure access to cloud technologies.\n\"The opportunity to partner with Joe Stuntz and the OWI team to build and create solutions that will shape the identity and cybersecurity conversation was one I could not pass up,\" said Ross Nodurft, Vice President of Risk Management at OWI. \"I was recruited to the White House just after the OPM breach to help bridge the policy gap and drive strong cybersecurity hygiene across the federal civilian agencies. With nearly a decade of experience in this space, I'm confident my deep expertise in risk management and cybersecurity policy will prove to be valuable in my new role within OWI.\"\n\"Bringing Ross onboard to work alongside Joe allows OWI to strategically create a unique layer of expertise grounded in their past experience in different branches of government,\" said Travis Jarae, CEO of OWI. \"Each served in the last two administrations, building most of the current processes that underpin how the government delivers identity and cybersecurity services. Ross and Joe have worked with the most senior decision makers in government and will be using that experience and knowledge to help companies improve systems and better understand federal, state, and local agency needs.\"\nDuring his time at the White House, Nodurft led the OMB team working closely with the Office of American Innovation (OAI) through the American Technology Council (ATC) to develop key security policies and initiatives including those that facilitate agency cloud adoption. He developed strategic cybersecurity policy direction and managed a team that oversaw programs including General Services Administration's FedRAMP, Department of Homeland Security's Continuous Diagnostics and Mitigation (CDM), and the High Value Asset (HVA) program. Nodurft helped develop White House cybersecurity initiatives like reports for Executive Order 13800 – delivering the IT Modernization Report and Government-wide Risk Assessment, the Cybersecurity National Action Plan (CNAP) and the Cybersecurity Strategy and Implementation Plan (CSIP).\nBefore his time at the White House, Nodurft spent seven years working on Capitol Hill focused on various aspects of cybersecurity, technology, and national security policy as the Senior Policy Advisor for the Office of the U.S. Senator, Mary Landrieu. His responsibilities included acting as the principal advisor for the Chairwoman of the Homeland Security Appropriations Subcommittee on Homeland Security, disaster recovery, technology, telecom and cybersecurity and negotiating the inclusion of language in the DHS Cyber Hiring Bill with the Senate Homeland Security and Governmental Affairs Committee (HSGAC) leadership.\nNodurft graduated from The Catholic University of America with Bachelor of Science in Business Administration. He went on to earn his master's degree in International Political Economy and Development at Fordham University and later completed the Air Force Command and Staff College. Nodurft is based in Washington D.C.\nAbout OWI\nOWI is an independent identity research and strategy company focused on cybersecurity, digital commerce, and risk management. We help businesses, investors, and governments stay ahead of market trends so they can build sustainable, forward-looking identity-enabled products and strategies. We accomplish this by building community and facilitating dialogue through our events, the KNOW Identity Conference, as well as servicing the community with our educational content, news, media, independent research, and consulting.\nVisit OWI at www.oneworldidentity.com for the latest in identity news, events, opinion and research.\nMedia Contact:\nGabriella Velez\n914-414-5274\ngvelez@n6a.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/owi-welcomes-second-former-white-house-cybersecurity-advisor-300581138.html\nSOURCE OWI", "external_links": ["https://oneworldidentity.com/", "http://www.oneworldidentity.com/", "http://www.prnewswire.com/news-releases/owi-welcomes-second-former-white-house-cybersecurity-advisor-300581138.html"], "published": "2018-01-11T17:07:00.000+02:00", "crawled": "2018-01-11T19:05:19.027+02:00", "highlightTitle": ""}