{"organizations": [], "uuid": "510ae8c7aec929f720f7068b36c0c256ac0c9347", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/31/reuters-america-us-stocks-futures-rise-after-two-straight-day-of-steep-losses.html", "country": "US", "domain_rank": 767, "title": "US STOCKS-Futures rise after two straight day of steep losses", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:46:00.000+02:00", "replies_count": 0, "uuid": "510ae8c7aec929f720f7068b36c0c256ac0c9347"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/31/reuters-america-us-stocks-futures-rise-after-two-straight-day-of-steep-losses.html", "ord_in_thread": 0, "title": "US STOCKS-Futures rise after two straight day of steep losses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Futures up: Dow 90 pts, S&P 9 pts, Nasdaq 20.75 pts\nJan 31 (Reuters) - U.S. stock index futures rose on Wednesday, after two days of steep losses, boosted by a controversy-free State of Union speech by President Donald Trump, with investors turning their focus back to quarterly earnings and monetary policy.\nThe blue-chip Dow Jones Industrial Average suffered its biggest two-day drop since September 2016 over Monday and Tuesday as U.S. Treasury yields surged to near four-year highs on expectations of global central banks lowering stimulus.\nThe pace of the increase in yields, rather than the rise itself, has hurt stock markets. A rise in yields raises borrowing costs and give traders an alternative investment option.\nThe Federal Reserve's two-day meeting ends on Wednesday and its statement at 2 p.m. ET (1900 GMT) could shed light on the central bank's economic and interest rate hike outlook. Currently, three rate hikes for the year are priced in.\nWhile analysts do not expect a rate hike, they expect the Fed to strike a more hawkish tone at the meeting, Fed Chair Janet Yellen's last.\nAt 7:04 a.m. ET, Dow e-minis were up 90 points, or 0.35 percent, with 41,952 contracts changing hands.\nS&P 500 e-minis were up 9 points, or 0.32 percent, with 174,673 contracts traded.\nNasdaq 100 e-minis were up 20.75 points, or 0.3 percent, on volume of 42,024 contracts.\nU.S. stock index futures drifted higher late on Tuesday as Trump gave his State of the Union address.\nAmong other comments, Trump said he wanted legislation to generate at least $1.5 trillion for infrastructure spending and revisited a campaign promise to lower drug prices.\nAmong stocks, shares of Boeing rose 3.6 percent premarket after it reported a higher core profit and said it expects to deliver more planes this year.\nAdvanced Micro Devices was up 2.1 percent a day after the chipmaker's fourth-quarter results handily topped forecasts.\nElectronic Arts jumped 7.8 percent after the videogame maker forecast fourth-quarter revenue above analysts' estimates.\nEarnings so far have been stronger than expected. S&P 500 earnings growth is now forecast at 13.2 percent, up from 12 percent a month ago. Among companies that have reported so far, 80 percent are exceeding analysts' expectations, according to Thomson Reuters data.\nMicrosoft and Facebook are due to report results after the closing bell.\nThe ADP's national employment report at 8:15 a.m. ET is expected to show private payrolls increased by a smaller 185,000 in for January, compared with 250,000 jobs in December. The data comes ahead of the more comprehensive non-farm payrolls data on Friday. (Reporting by Tanya Agrawal in Benagaluru; Editing by Savio D'Souza)", "external_links": [], "published": "2018-01-31T14:46:00.000+02:00", "crawled": "2018-01-31T21:05:08.017+02:00", "highlightTitle": ""}