{"organizations": [], "uuid": "29869db593bb25b409699786119b4056f9ec1c71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-wanda-hotel-london-property/wanda-hotel-sees-55-million-gain-from-sale-of-stake-in-london-property-unit-idUKKBN1F60A6", "country": "US", "domain_rank": 408, "title": "Wanda Hotel sees $55 million gain from sale of stake in London property unit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T04:53:00.000+02:00", "replies_count": 0, "uuid": "29869db593bb25b409699786119b4056f9ec1c71"}, "author": "", "url": "https://uk.reuters.com/article/uk-wanda-hotel-london-property/wanda-hotel-sees-55-million-gain-from-sale-of-stake-in-london-property-unit-idUKKBN1F60A6", "ord_in_thread": 0, "title": "Wanda Hotel sees $55 million gain from sale of stake in London property unit", "locations": [], "entities": {"persons": [{"name": "clare jim", "sentiment": "none"}, {"name": "donny kwok", "sentiment": "none"}, {"name": "edwina gib", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "hk", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "wanda hotel", "sentiment": "negative"}, {"name": "hong kong) co ltd", "sentiment": "none"}, {"name": "wanda commercial properties", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "dalian wanda group", "sentiment": "none"}, {"name": "wanda international real estate", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "wanda hotel development co ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 2:53 AM / Updated 11 minutes ago China's Wanda sells interests in high-profile London property project Clare Jim , Donny Kwok 3 Min Read \nHONG KONG (Reuters) - Dalian Wanda Group has agreed to sell its interests in the high-profile London luxury development project, One Nine Elms, for 59 million pounds, the latest in a string of asset sales that underscore financial strains hitting the Chinese conglomerate. \nThe conglomerate, which has businesses that range from real estate to football and cinemas, had initially said it wanted to transfer ownership of some its overseas assets to its holding company as part of a restructuring, keeping them within the group. \nBut the sale has instead gone to a unidentified third party. Bloomberg news, citing people with knowledge of the matter, said the buyer was Guangzhou R&F Properties ( 2777.HK ), a firm that has also stepped up to purchase other Wanda property assets. \nWanda Hotel Development Co Ltd ( 0169.HK ) said in a statement it is selling its 60 percent stake in a company that owns the high-profile One Nine Elms project in London for 35.61 million pounds ($49 million). The buyer has also agreed to repay 159.5 million pounds in debt. \nA separate Wanda firm, Wanda Commercial Properties (Hong Kong) Co Ltd, is also selling the remaining 40 percent stake in the property project in southwest London at the same terms. \nR&F declined to comment on whether it was the buyer. \nLast year, Chinese regulators told banks to stop providing funding for several of Wanda’s overseas acquisitions as Beijing looks to curb what it sees as irrational spending by some major domestic conglomerates, sources have said. \nShortly after, Wanda sold a portfolio of domestic hotels and tourism assets, including 13 theme parks, for $9 billion to R&F and Sunac China ( 1918.HK ). \nWanda is also considering a Hong Kong listing for its sports assets as part of efforts to rationalise its portfolio that could also include other sales, according to people familiar with the situation. \nOther flagship overseas developments - in Chicago, Los Angeles, Sydney and Australia’s Gold Coast - are also available for sale, according to one source. \nResponding to a local online media report that questioned the group’s financial health, Wanda last month said its 2017 revenues had surpassed 200 billion yuan ($30 billion) and it had 200 billion yuan in cash. \nWanda bought the property in Nine Elms Lane on the south bank of London’s River Thames in 2013 to redevelop it into a hotel, residential, office and retail complex. \nLast year it dropped plans to purchase a neighbouring property, Nine Elms Square which was bought instead by R&F and CC Land Holdings Ltd ( 1224.HK ). \nShares of Wanda Hotel surged on Wednesday, trading 5 percent higher in afternoon trade. It said it would use the sales proceeds to repay loans and interest, and to finance other existing projects. Reporting by Donny Kwok and Clare Jim; Additional reporting by Miyoung Kim; Editing by Edwina Gibbs", "external_links": [], "published": "2018-01-17T04:53:00.000+02:00", "crawled": "2018-01-17T05:14:47.001+02:00", "highlightTitle": ""}