{"organizations": [], "uuid": "350aabaafb5633a64099447e75123c921ad96aea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-energy-fuels-announces-appointment-of-mark-s-chalmers-as-president-and-ceo-retirement-of-stephen-p-antony.html", "country": "US", "domain_rank": 767, "title": "Energy Fuels Announces Appointment of Mark S. Chalmers as President and CEO; Retirement of Stephen P. Antony", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T02:47:00.000+02:00", "replies_count": 0, "uuid": "350aabaafb5633a64099447e75123c921ad96aea"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-energy-fuels-announces-appointment-of-mark-s-chalmers-as-president-and-ceo-retirement-of-stephen-p-antony.html", "ord_in_thread": 0, "title": "Energy Fuels Announces Appointment of Mark S. Chalmers as President and CEO; Retirement of Stephen P. Antony", "locations": [], "entities": {"persons": [{"name": "mark s. chalmers", "sentiment": "negative"}, {"name": "stephen p. antony", "sentiment": "negative"}, {"name": "chalmers", "sentiment": "none"}, {"name": "langer heinrich", "sentiment": "none"}], "locations": [{"name": "lakewood", "sentiment": "none"}, {"name": "co", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "kayelekera mines", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "energy fuels inc.", "sentiment": "negative"}, {"name": "tsx", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "beverley mine", "sentiment": "none"}, {"name": "paladin energy ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAKEWOOD, CO, Jan. 23, 2018 /PRNewswire/ - Energy Fuels Inc. (NYSE American: UUUU; TSX: EFR) (\"Energy Fuels\" or the \"Company\") is pleased to announce that, in accordance with the Company's long-term succession planning, the Board of Directors (the \"Board\") has appointed Mark S. Chalmers, the current President and Chief Operating Officer of Energy Fuels, as President and Chief Executive Officer (\"CEO\") and a Director of the Company, effective February 1, 2018. On January 31, 2018, Stephen P. Antony, the current CEO of the Company, will retire as CEO and as a Director of the Company.\nMr. Chalmers brings decades of global uranium mining experience to Energy Fuels. Prior to joining Energy Fuels in July of 2016, Mr. Chalmers served as Executive General Manager of Production for Paladin Energy Ltd., where he oversaw operations of the Langer Heinrich and Kayelekera Mines in Africa. He also possesses extensive experience in in situ recovery (\"ISR\") uranium production, including management of the Beverley Mine in Australia and the Highland Mine in the United States. Mr. Chalmers has also consulted to several of the largest players in the uranium supply sector, including BHP Billiton, Rio Tinto, and Marubeni. Since joining Energy Fuels, Mr. Chalmers has overseen Energy Fuels' conventional and ISR operations, focusing on production optimization, resource growth, and obtaining new sources of revenue for the Company including alternate feed materials and land clean-up work.\nMr. Antony has served Energy Fuels since 2005, when he joined the Company as Chief Operating Officer. He was later appointed President and CEO in 2009. During his tenure as President and CEO, Energy Fuels has grown from a small uranium project developer into the largest uranium producer in the U.S. in 2017. Under Mr. Antony's leadership, Energy Fuels consolidated a large proportion of the U.S. uranium industry through six (6) major acquisitions including Magnum Uranium Corp. (2009), Titan Uranium Inc. (2012), the US mining division of Denison Mines Corp. (2012), Strathmore Minerals Corp. (2013), Uranerz Energy Corp. (2015), and Mesteña Uranium, LLC (2016). Through these acquisitions, Energy Fuels now holds three uranium production facilities, a number of permitted and developed conventional and ISR mines, and the largest National Instrument 43-101 uranium resource portfolio in the United States among producers and near-producers.\nJ. Birks Bovaird, Chairman of the Board for Energy Fuels states: \"The Board of Directors of Energy Fuels is pleased that Mark Chalmers has agreed to serve as the Company's President and CEO. Mark brings the suite of skills that we believe Energy Fuels needs to continue our growth and development into the future. We believe the next few years could be very interesting for the Company. Major uranium production cuts have been announced by world producers. Energy Fuels is taking proactive actions to potentially increase the value of U.S. uranium production through our recent submittal of a 232 Petition to the U.S. Department of Commerce. And, we are seeking new sources of revenue through alternate feed materials and land clean-up work. Despite continuing challenges in uranium markets, Energy Fuels has several unique and exciting opportunities that no other uranium miner in the U.S. enjoys. Last but certainly not least, the Board thanks Steve Antony for his service to the Company over the past 13 years. He has been 'the right man at the right time' to guide Energy Fuels, always leading the Company with intelligence, tenacity, and most importantly, integrity. His crowning achievement will always be the -consolidation of the U.S. uranium space. Through Mr. Antony's guidance, Energy Fuels is now the premier U.S. uranium mining company, and we are well positioned to capitalize on increasing uranium prices and other opportunities in the future. We wish Mr. Antony the very best in the future and a happy and fulfilling retirement.\"\nAbout Energy Fuels: Energy Fuels is a leading integrated US-based uranium mining company, supplying U 3 O 8 to major nuclear utilities. Energy Fuels holds three of America's key uranium production centers, the White Mesa Mill in Utah, the Nichols Ranch Processing Facility in Wyoming, and the Alta Mesa Project in Texas. The White Mesa Mill is the only conventional uranium mill operating in the U.S. today and has a licensed capacity of over 8 million pounds of U 3 O 8 per year. The Nichols Ranch Processing Facility is an ISR production center with a licensed capacity of 2 million pounds of U 3 O 8 per year. Alta Mesa is an ISR production center currently on care and maintenance. Energy Fuels also has the largest National Instrument 43-101 compliant uranium resource portfolio in the U.S. among producers, and uranium mining projects located in a number of Western U.S. states, including one producing ISR project, mines on standby, and mineral properties in various stages of permitting and development. The Company also produces vanadium as a co-product of its uranium production from certain of its mines on the Colorado Plateau, as market conditions warrant. The Company's common shares are listed on the NYSE MKT under the trading symbol \"UUUU\", and on the Toronto Stock Exchange under the trading symbol \"EFR\".\nCautionary Note Regarding Forward-Looking Statements: This news release contains certain \"Forward Looking Information\" and \"Forward Looking Statements\" within the meaning of applicable securities legislation, which may include, but is not limited to, statements with respect to: the Company being a leading producer of uranium in the U.S; proactive actions taken by the Company to potentially increase the value of U.S. uranium production through the submittal of a 232 Petition to the U.S. Department of Commerce; any expectations regarding new sources of revenue through alternate feed materials and land clean-up work; any unique opportunities the Company may have relative to other uranium miners; and any other statements regarding Energy Fuels' future expectations, beliefs, goals or prospects; constitute forward-looking information within the meaning of applicable securities legislation (collectively, \" \"). All statements in this news release that are not statements of historical fact (including statements containing the words \"expects\", \"does not expect\", \"plans\", \"anticipates\", \"does not anticipate\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\", \"scheduled\", \"forecast\", \"budget\" and similar expressions) should be considered . All such are subject to important risk factors and uncertainties, many of which are beyond Energy Fuels' ability to control or predict. A number of important factors could cause actual results or events to differ materially from those indicated or implied by such , including without limitation factors relating to: the Company being a leading producer of uranium in the U.S; proactive actions taken by the Company to potentially increase the value of U.S. uranium production through the submittal of a 232 Petition to the U.S. Department of Commerce; any expectations regarding new sources of revenue through alternate feed materials and land clean-up work; any unique opportunities the Company may have relative to other uranium miners;and other risk factors as described in Energy Fuels' most recent annual report on Form 10-K and quarterly financial reports. Energy Fuels assumes no obligation to update the information in this communication, except as otherwise required by law. Additional information identifying risks and uncertainties is contained in Energy Fuels' filings with the various securities commissions which are available online at www.sec.gov and www.sedar.com . Forward-looking statements are provided for the purpose of providing information about the current expectations, beliefs and plans of the management of Energy Fuels relating to the future. Readers are cautioned that such statements may not be appropriate for other purposes. Readers are also cautioned not to place undue reliance on these , that speak only as of the date hereof.\nSOURCE Energy Fuels Inc.", "external_links": [], "published": "2018-01-24T02:47:00.000+02:00", "crawled": "2018-01-24T03:28:05.000+02:00", "highlightTitle": ""}