{"organizations": [], "uuid": "805f36524777d4211ac9fc28908d17568e598edd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221805865&w=1200&r=LYNXMPEE0D00Z", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-australia-cannabis-analysis/for-now-australias-plans-for-cannabis-market-dominance-are-more-smoke-than-fire-idUKKBN1F300X", "country": "US", "domain_rank": 408, "title": "For now, Australia's plans for cannabis market dominance are more smoke than fire", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T08:19:00.000+02:00", "replies_count": 0, "uuid": "805f36524777d4211ac9fc28908d17568e598edd"}, "author": "", "url": "https://uk.reuters.com/article/us-australia-cannabis-analysis/for-now-australias-plans-for-cannabis-market-dominance-are-more-smoke-than-fire-idUKKBN1F300X", "ord_in_thread": 0, "title": "For now, Australia's plans for cannabis market dominance are more smoke than fire", "locations": [], "entities": {"persons": [{"name": "colin packham", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "harborside", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "oakland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 1:12 AM / Updated 7 hours ago For now, Australia's plans for cannabis market dominance are more smoke than fire Colin Packham 6 Min Read \nSYDNEY (Reuters) - When Australia said this month it would allow exports of medicinal cannabis in a bid to dominate a global market set to be worth $55 billion by 2025, investors scrambled to buy shares in marijuana companies - pushing several of them, and the sector as a whole, to record highs. FILE PHOTO: Marijuana is seen for sale at Harborside, one of California's largest and oldest dispensaries of medical marijuana, on the first day of legalized recreational marijuana sales in Oakland, California, U.S., January 1, 2018. REUTERS/Elijah Nouvelage/File Photo \nBut convoluted and restrictive licensing demands, substantial finance requirements and a guarded medical profession means even Australia’s largest marijuana companies are at least a year away from a commercial crop. And doubts linger about the prospects for smaller entities, belying the government’s ambitious plans to be the world’s leading exporter. \n“There will be more cannabis used in Australia and overseas over the next 10, 20 and 50 years but it is not clear that any of the local market can capture that, let alone make money from it,” said Scott Phillips, director of research at investment company Motley Fool. “Look at the gold rush: sure, some made money, but the biggest winners were the sellers of the shovels.” \nAustralia’s medicinal cannabis sector, with 12 listed companies, produces a range of products that include chronic pain management and acne creams with extracts of marijuana to aid acne. The businesses acknowledge some barriers to growth but say they are primed to profit from a maturing market. \nAustralia already produces 50 percent of the world’s legal poppies, which are processed into pharmaceutical opiates such as morphine and codeine. Last year, it expanded its legal drug market by legalizing medicinal marijuana use, a move that spurred a wave of IPOs and backdoor listings on the Australian Stock Exchange (ASX). \nContradicting the hype, however, only several hundred patients in Australia have so far been prescribed medical cannabis, data from the country’s Ministry for Health show, as local doctors remain wary of the benefits of marijuana. \nThe reluctance of doctors has curtailed the growth of Australia’s cannabis market. Australian law requires the seven companies licensed to grow medicinal cannabis to produce only enough to meet domestic demand. \nBut when the Australian government said it planned to allow medicinal cannabis exports - perhaps within months - the three largest companies, AusCann Group ( AC8.AX ), Cann Group ( CAN.AX ) and Hydroponics Company ( THC.AX ) immediately looked for ways to expand production. \nCann Group’s chief executive, Peter Crock, said the company hopes to complete a new 16,000- to 20,000-square-metre medicinal cannabis facility this year, while Hydroponics Company’s chief executive, David Radford, said a new production site to produce enough marijuana for 16,000 patients was “95 percent” complete. \nEven once the facilities are built, however, both companies might not be allowed to grow an exportable crop right away. Australia said it will only allow exports of processed or manufactured cannabis products such as oil extracts, which require a separate manufacturing license. \n“Obtaining a license is an exhaustive and complicated process,” Crock said. Cann Group hopes to have full regulatory approval by the time its new facility is ready at the end of 2018. \nOnly AusCann Group has all required licenses. But the company has not yet finalised its production plans, managing director Elaine Darby told Reuters. GROWING MARKET \nDespite licensing issues, Australia’s largest medicinal companies say they have secured sufficient capital for expansion. \nAnalysts warn that capital restraints could hamstring the smaller players as a wave of IPOs, which fueled the growth of Australia’s medicinal cannabis industry in the past year, may be threatened by U.S. regulatory uncertainty. \nThe administration of U.S. President Donald Trump has moved to allow federal prosecutors to more aggressively enforce marijuana laws. That throws uncertainty into what is expected to be the world’s most lucrative market. \nThe ASX in December said it would require would-be public marijuana companies to provide evidence that their business could be lawfully carried out in the United States, under both federal and state law. Lawyers said that could deter potential listings. \nThe newfound U.S. government resistance to cannabis bucks a global trend, as a growing number of countries not only legalize its use but also take aim at the export market. \nCanada dominates global production and exports, worth C$6.2 billion in 2015, according to the country’s statistics office. But recent moves to legalize recreational cannabis could create opportunities for other countries to capitalize. \nAustralia will join Uruguay, Israel and the Netherlands in looking to fill the potential shortfall in supply. \nWith demand skewed toward North America and Europe, Australia’s export supplies will face a freight disadvantage. But like the country’s agriculture sector, it is positioning itself as a producer of a premium product. \n“The Australian cannabis market is akin to the wine industry: you’ll have your premium, Grange hermitage wines, and then you will have goon bags. We will at the premium end,” said Radford, referring to the difference in price between one of the of the world’s top vintages and cheap, boxed wine. Reporting by Colin Packham; Editing by Gerry Doyle", "external_links": [], "published": "2018-01-14T08:19:00.000+02:00", "crawled": "2018-01-14T08:52:37.018+02:00", "highlightTitle": ""}