{"organizations": [], "uuid": "08f41ba5ee1ab1e7d0fc3eec991e7b74cc28f884", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-ppr--point-0220-december-dividend.html", "country": "US", "domain_rank": 767, "title": "PPR - $.0220 December Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T22:16:00.000+02:00", "replies_count": 0, "uuid": "08f41ba5ee1ab1e7d0fc3eec991e7b74cc28f884"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-ppr--point-0220-december-dividend.html", "ord_in_thread": 0, "title": "PPR - $.0220 December Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "scottsdale", "sentiment": "none"}, {"name": "ariz.", "sentiment": "none"}], "organizations": [{"name": "ppr", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SCOTTSDALE, Ariz.--(BUSINESS WIRE)-- Voya Prime Rate Trust (NYSE: PPR), a diversified closed-end management investment company listed on the New York Stock Exchange, declared 2.20 cents per share monthly dividend on December 20, 2017 for the 31 days of December, payable on January 11, 2018 to shareholders of record on December 29, 2017. This represents the 356th consecutive monthly dividend since the Trust’s inception in May 1988.\nThe following are annualized distribution rate calculations based on the declared dividend for the month, Net Asset Value (“NAV”) at month-end and the month-end NYSE composite closing price (“Market”).\nAnnualized Period-end Distribution Rates\nDIVIDEND NAV MARKET December 31, 2017 $ .0220 4.60% 5.11% November 30, 2017 $ .0215 4.62% 5.15% October 31, 2017 $ .0220 4.57% 5.05% September 30, 2017 $ .0225 4.84% 5.23% August 31, 2017 $ .0240 4.98% 5.45% July 31, 2017 $ .0250 5.15% 5.51% June 30, 2017 $ .0250 5.34% 5.65% May 31, 2017 $ .0260 5.33% 5.66% April 30, 2017 $ .0260 5.50% 5.78% March 31, 2017 $ .0270 5.51% 5.88% February 28, 2017 $ .0260 5.84% 6.06% January 31, 2017 $ .0270 5.49% 5.70% December 31, 2016 $ .0270 5.50% 5.74% Voya Prime Rate Trust was the first Fund to invest in a portfolio of floating rate senior bank loans. The Trust seeks to provide as high a level of current income as is consistent with the preservation of capital.\nThe Trust is managed by Voya Investments, LLC and sub-advised by Voya Investment Management Co. LLC, and its shares are distributed by Voya Investments Distributor, LLC. The adviser, the sub-adviser and the distributor are indirect, wholly-owned subsidiaries of Voya Financial, Inc. (NYSE: VOYA). The Trust’s operations are based in Scottsdale, Arizona.\nDistribution Rates are calculated by annualizing dividends declared during the period (i.e., divide the monthly dividend amount by the number of days in the related month and multiply by the number of days in the fiscal year) and then dividing the resulting annualized dividend by the month-ending NAV (in the case of NAV) or the month-end closing price on the NYSE composite (in the case of Market). The distribution rate is based solely on actual dividends and distributions, which are made at the discretion of management. The distribution rate may or may not include all investment income, and ordinarily will not include capital gains.\nPast performance is no assurance of future results. Investment return and principal value of an investment in the Trust will fluctuate. Shares, when sold, may be worth more or less than their original cost.\nPrincipal Risk Factor(s) : The Trust invests primarily in below investment grade, floating rate senior loans that carry a higher than normal risk that borrowers may default in the timely payment of principal and interest on their loans, which would likely cause the value of the Trust’s Common Shares to decrease. Changes in short-term market interest rates will directly affect the yield on the Trust’s Common Shares. If such rates fall, the Trust’s yield will also fall. If interest rate spreads on Trust’s loans decline in general, the yield on the Trust’s loans will fall and the value of the Trust’s loans may decrease. When short-term market interest rates rise, because of the lag between changes in such short term rates and the resetting of the floating rates on loans in the Trust’s portfolio, the impact of rising rates will be delayed to the extent of such lag. Because of the limited secondary market for floating rate senior bank loans, the Trust’s ability to sell its loans in a timely fashion and/or at a favorable price may be limited. An increase in the demand for loans may adversely affect the rate of interest payable on new loans acquired by the Trust, and it may also increase the price of loans purchased by the Trust in the secondary market. A decrease in the demand for loans may adversely affect the price of loans in the Trust’s portfolio, which would cause the Trust’s NAV to decrease. The Trust’s use of leverage through borrowings or issuance of preferred shares can adversely affect the yield on the Trust’s Common Shares. The Trust may invest up to 20% of its assets in loans to borrowers in countries outside of the U.S. and Canada. Investment in foreign borrowers involves special risks, including potentially less rigorous accounting requirements, differing legal systems and potential political, social and economic adversity. The Trust may invest up to 15% of its assets in loans that are denominated in certain foreign currencies, however, the Trust will engage in currency exchange transactions to seek to hedge, as closely as practicable, 100% of the economic impact to the Trust arising from foreign currency fluctuations. Other risks include but are not limited to: Borrowings; Preferred Shares; Diversification Risks; and Concentration Risks. Investors should consult the Trust’s prospectus and Statement of Additional Information for a more detailed discussion of the Trust’s risks.\nFor more complete information, or to obtain a prospectus on Voya Prime Rate Trust, please contact your investment professional or Voya Investments Distributor, LLC at (800) 992-0180 or www.investments.voya.com . The prospectus should be read carefully before investing. Consider the investment objectives, risks, and charges and expenses carefully before investing. The prospectus contains this information and other information about the fund.\nIf you would like to receive this press release via email, please contact Bonnie Dacier at Bonnie.Dacier@voya.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005691/en/\nVoya Prime Rate Trust\nDan Norman, 480-477-2112\nSource: Voya Prime Rate Trust", "external_links": ["http://www.businesswire.com/news/home/20180102005691/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.investments.voya.com&esheet=51736629&newsitemid=20180102005691&lan=en-US&anchor=www.investments.voya.com&index=1&md5=146de728515994554d2c0ecb44a76d16"], "published": "2018-01-02T22:16:00.000+02:00", "crawled": "2018-01-02T23:41:19.000+02:00", "highlightTitle": ""}