{"organizations": [], "uuid": "aa1b015bf391c828b4d4470575045a7b865dcc7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-ipsoft-appoints-digital-management-visionary-anurag-harsh-as-chief-marketing-officer.html", "country": "US", "domain_rank": 767, "title": "IPsoft Appoints Digital Management Visionary, Anurag Harsh, as Chief Marketing Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T18:50:00.000+02:00", "replies_count": 0, "uuid": "aa1b015bf391c828b4d4470575045a7b865dcc7e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-ipsoft-appoints-digital-management-visionary-anurag-harsh-as-chief-marketing-officer.html", "ord_in_thread": 0, "title": "IPsoft Appoints Digital Management Visionary, Anurag Harsh, as Chief Marketing Officer", "locations": [], "entities": {"persons": [{"name": "anurag harsh", "sentiment": "negative"}, {"name": "anurag", "sentiment": "none"}, {"name": "amelia", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "ipsoft appoints digital management visionary", "sentiment": "negative"}, {"name": "cmo", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 04, 2018 (GLOBE NEWSWIRE) -- IPsoft, the leader in artificial intelligence, cognitive and autonomic solutions, today announced the appointment of Anurag Harsh, a well-known business leader in the technology industry, as Chief Marketing Officer (CMO).\nIPsoft Appoints Digital Management Visionary, Anurag Harsh, as Chief Marketing Officer\nAs CMO, Harsh will lead the company’s global marketing efforts across 16 countries, taking a primary role in accelerating the growth of the company’s groundbreaking AI technology including Amelia, the world’s most human AI. This includes global brand and market strategy, thought leadership, media and analyst relations, digital and linear programs, as well as market engagement activities to elevate the understanding of artificial intelligence and IPsoft’s pioneering role in it.\n“Anurag is a distinguished leader in the field of digital disruption. When it came to selecting a CMO who could authoritatively differentiate solutions in AI, we could not find another that has published seven books on the topic, three of which were Amazon bestsellers. His track record at Ziff Davis shows that he can leverage his digital insight to cement IPsoft’s market-leading position as the premier provider of Enterprise AI solutions,” said Chetan Dube, CEO of IPsoft.\nHarsh, voted one of LinkedIn’s Top Voices (#1 in Tech) most recently played a leading role at Ziff Davis, one of the world’s largest digital media companies, with brands that include PCMag, Mashable, IGN and Everyday Health, where, as founding executive he led the strategic development of the publisher from a privately held company into a multi-billion-dollar, public company, reaching over 150 million worldwide in 114 countries. Harsh has also led senior management roles with IDG, CBS and CNN. An alum of the Wharton School and Massachusetts Institute of Technology where he was a Sloan Fellow, Harsh is a published author of seven books, a contributing columnist to leading US publications with over 400 published articles, and a musician that has performed two solo concerts at the Carnegie Hall.\n“Artificial Intelligence is the general-purpose technology of our era along the lines of the steam engine, electricity, and the internal combustion engine. I’m therefore delighted to be joining IPsoft, the world leader in truly cognitive and autonomic solutions for Enterprises, trusted by 1 in 5 of the Fortune 100,” Harsh said. “IPsoft’s exceptional products have transformed, elevated and inspired companies throughout the world. I’m looking forward to working with the IPsoft team to showcase the truly unique capabilities of Amelia, the most human AI in the world.”\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/5e3cc9d1-7edb-4ea5-8928-e1af506d4968\nAbout IPsoft\nIPsoft, the leader in Enterprise AI, automates business and IT processes for Enterprises across a wide range of industries through the use of digital labor. Through its portfolio of world-leading autonomic and cognitive solutions, it provides a platform that allows its clients to gain unprecedented efficiencies and cost savings. Headquartered in New York City, IPsoft has offices in 16 countries across the world and serves more than 500 of the world’s leading brands directly, as well as more than half of the world’s largest IT services providers.\nContact\nDaniela Zuin, Tel: +1 212 708 5521\nMarketing Director, IPsoft\ndaniela.zuin@ipsoft.com\nSource: IPsoft", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/5e3cc9d1-7edb-4ea5-8928-e1af506d4968/en", "http://www.globenewswire.com/NewsRoom/AttachmentNg/5e3cc9d1-7edb-4ea5-8928-e1af506d4968", "https://www.globenewswire.com/NewsRoom/AttachmentNg/101690bc-53cf-4993-8716-b36bf6ec9153", "https://www.globenewswire.com/Tracker?data=xSvOxEDTn-BuOywYBqgZAArlihYopehqV_xooflV1Sr4hhA8K4-aUj3GspnR52ux3ifh8rtflW6hQVYHb9vUC-hZyHsI3SSnQaw-oaBBrPM=", "https://www.globenewswire.com/Tracker?data=57u-e6htrGKZBYJ0RPUOCVxUjsm3mYmyDubMMrC3jXiwUsR3iVr8mjsTC-O-N2BP-GZpbCIM7zmECTVrjS0XhHsN2MMoVMnkgJLq-Yl-ltS0ntXOHQHMwtAxzzY6v-jiWut0oSqG_xCpkd_Kx_mGQVF2BHqzTqNxWTVqF8SkOChgBMypT3k5w24zeFDNyQHCqeHlH-Ah_E1byvdR8-ov9NgXAZO6FiymN0QLsDsny66In8xxve5UfORciV8q-y9jvflp2o8z6wB9iXEr2NWzZg=="], "published": "2018-01-04T18:50:00.000+02:00", "crawled": "2018-01-04T19:22:23.000+02:00", "highlightTitle": ""}