{"organizations": [], "uuid": "ad971a99866cae548e4a9ccea3515f2f7f52bf9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224071705&w=1200&r=LYNXMPEE0L0G0", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-federer/federer-eases-past-fucsovics-into-melbourne-quarter-finals-idUSKBN1FB0ME", "country": "US", "domain_rank": 408, "title": "Federer eases past Fucsovics into Melbourne quarter-finals", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T09:02:00.000+02:00", "replies_count": 0, "uuid": "ad971a99866cae548e4a9ccea3515f2f7f52bf9a"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-federer/federer-eases-past-fucsovics-into-melbourne-quarter-finals-idUSKBN1FB0ME", "ord_in_thread": 0, "title": "Federer eases past Fucsovics into Melbourne quarter-finals", "locations": [], "entities": {"persons": [{"name": "federer", "sentiment": "negative"}, {"name": "marton fucsovics", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "fucsovics", "sentiment": "none"}, {"name": "tomas berdych", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 7:05 AM / Updated 4 hours ago Federer makes light of day shift to ease into last eight Martyn Herman 3 Min Read \nMELBOURNE (Reuters) - Roger Federer was a strictly nocturnal beast throughout the first week of the Australian Open but proved just as effective with the sun on his back as he sauntered into the quarter-finals for the 14th time on Monday. \nThe defending champion did not require his dazzling best against 80th-ranked Hungarian Marton Fucsovics in his first match scheduled during the day session but still emerged a comfortable 6-4 7-6(3) 6-2 winner. \nAfter his earlier-than-usual finish, the 36-year-old world number two said he might even be able to make the most of a night off and take his wife Mirka out for dinner. \n“I was considering sunglasses and a towel for the beach but, no, the only thing is the racket strings are a bit tighter but it’s not crazy hot today,” Federer told former champion Jim Courier in a knockabout post-match chat on court. \n“It’s a different rhythm playing in the day and not going to bed at 3 a.m. We might go out for dinner tonight but Mirka has left already -- she must have other plans!” \nFederer’s light mood matched the sunny conditions and he was even reduced to giggles during one point late in the second set when he miss-hit a forehand high into the air, then defended three consecutive Fucsovics smashes to win a bizarre rally. \n“This one was the biggest joke of a point maybe I have ever played,” he said later. “Thankfully it didn’t decide the outcome of that second set. That would have been too much of a joke, to be honest.” \nFederer is yet to drop a set and did not even face a break point against the 25-year-old Fucsovics, who arrived in Melbourne without a grand slam main draw victory to his name. Tennis - Australian Open - Rod Laver Arena, Melbourne, Australia, January 22, 2018. Roger Federer of Switzerland hits a shot against Marton Fucsovics of Hungary. REUTERS/Thomas Peter \nYet his unheralded opponent, bidding to become only the third Hungarian man to reach a grand slam quarter-final in the professional era, offered an all-round display that belied his record, even if it did not surprise Federer. \n“I practiced with him for a few days in a row in Switzerland. That helped, you know, knowing his strength and weaknesses a little bit,” he said. Slideshow (4 Images) \n”He was not completely the unknown opponent that maybe people thought he was. \n“He hung with me for a long time. So it was a good match.” \nFederer was in cruise control in the first set but struck decisively when Fucsovics served at 4-5, squeezing the throttle enough to earn a set point converted with a smash. Related Coverage Sandgren topples Thiem to keep Melbourne dream alive \nFucsovics kept Federer honest in the second set and played his part in some entertaining rallies to extend the 19-times grand slam champion to a tiebreak. \nFederer rifled a running forehand pass to earn three set points and again finished the set at the net, with a smash. \nThe third set was all over in 31 minutes as Federer raced into the 52nd grand slam quarter-final of his career, booking a last eight encounter against 19th seeded Czech Tomas Berdych. Reporting by Martyn Herman; Editing by Peter Rutherford/John O'Brien", "external_links": [], "published": "2018-01-22T09:02:00.000+02:00", "crawled": "2018-01-22T09:13:32.004+02:00", "highlightTitle": ""}