{"organizations": [], "uuid": "4ff0766cf4a219a228f3cef26f487ff5a2714100", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226251178&w=1200&r=LYNXMPEE0S0LQ", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-bankia-results/cost-of-bmn-integration-pushes-spains-bankia-into-the-red-idUKKBN1FI0WX", "country": "US", "domain_rank": 408, "title": "Cost of BMN integration pushes Spain's Bankia into the red", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T11:41:00.000+02:00", "replies_count": 0, "uuid": "4ff0766cf4a219a228f3cef26f487ff5a2714100"}, "author": "", "url": "https://uk.reuters.com/article/uk-bankia-results/cost-of-bmn-integration-pushes-spains-bankia-into-the-red-idUKKBN1FI0WX", "ord_in_thread": 0, "title": "Cost of BMN integration pushes Spain's Bankia into the red", "locations": [], "entities": {"persons": [{"name": "jesús aguado", "sentiment": "none"}, {"name": "bankia", "sentiment": "none"}], "locations": [{"name": "spain", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "bankia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 9:42 AM / Updated 23 minutes ago Cost of BMN integration pushes Spain's Bankia into the red Jesús Aguado 3 Min Read \nMADRID (Reuters) - Spanish state-owned lender Bankia ( BKIA.MC ) said it swung into the red in the fourth quarter, for the first time in three years, blaming one-off restructuring costs after its acquisition of smaller peer BMN. \nSeeking to boost its earnings following a quick recovery from its 22.4 billion euro ($28 bln) bailout in 2012, Bankia agreed in June to acquire BMN to create Spain’s fourth-biggest bank. \nWhen it originally announced the tie-up, Bankia said it expected restructuring costs of around 300 million euros, mainly due to layoffs and branch closures. On Monday it reported restructuring costs of 312 million euros, resulting in the bank making a 235 million euro loss for the fourth quarter. \nShares in Bankia were down 2.7 percent by 0845 GMT, reversing a 1 percent gain on Friday after the bank announced it would pay back 207 million euros in state aid via a gross dividend from 2017 earnings of 0.11 euros per share. \nBankia and BMN were given a 24 billion euro bailout in 2012 after losses on property loans at the height of Spain’s financial crisis. \nExcluding restructuring costs, Bankia’s net profit rose 5.5 percent in October-December to 77 million euros, beating a 72 million euros forecast in a Reuters poll. \nLike its domestic competitors, the bank is struggling to lift earnings from loans in Spain as interest rates hover at historic lows and as increasing competition erodes margins. \nIncluding one month of BMN into Bankia’s earnings, net interest income, a measure of earnings on loans minus deposit costs, was 501 million euros in the quarter, down 3.1 percent from a year ago due to pressure from ultra-low interest rates. \nHowever, lending income was up around 6 percent against the previous quarter due to lower funding costs. \nOn Thursday, Spain’s largest union, CCOO, said Bankia had proposed 2,291 job cuts following BMN’s integration. That was down from an original layoff plan of 2,510 people announced in December. \nBMN’s integration contributed to an increase of 1.9 billion euros in bad loans from the previous quarter on Bankia’s balance sheet at the end of 2017. However, the bank’s non-performing loan (NPL) ratio edged up to 8.9 percent from 8.8 percent three months earlier. \nAfter completing its takeover of BMN in December, Bankia said it finished the year with a core Tier-1 fully loaded capital, the strictest measure of solvency, of 12.33 percent, above the 12 percent target it had envisaged with the acquisition. \nThe European Central Bank is currently working on a draft of new measures targeting soured loans sitting on banks’ balance sheets, although the publication of new rules may be postponed after fierce criticism from lawmakers and bankers. \nSpanish banks managed to bring their average NPL ratio down to 8.1 percent by November, according to data from the Bank of Spain. \n($1 = 0.8050 euros)", "external_links": [], "published": "2018-01-29T11:41:00.000+02:00", "crawled": "2018-01-29T12:12:04.019+02:00", "highlightTitle": ""}