{"organizations": [], "uuid": "758d86a3e3fd52c4221039a505314f038d8be17c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/bundesbank-reserves-yuan-belgium/update-1-europes-central-banks-pile-into-yuan-idUSL8N1PB3Y5", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Europe's central banks confirm yuan holdings", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-16T21:52:00.000+02:00", "replies_count": 0, "uuid": "758d86a3e3fd52c4221039a505314f038d8be17c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/bundesbank-reserves-yuan-belgium/update-1-europes-central-banks-pile-into-yuan-idUSL8N1PB3Y5", "ord_in_thread": 0, "title": "UPDATE 2-Europe's central banks confirm yuan holdings", "locations": [], "entities": {"persons": [], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "slovakia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}, {"name": "national bank of belgium", "sentiment": "none"}, {"name": "bank of spain", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details)\nBRUSSELS/MADRID, Jan 16 (Reuters) - More central banks in Europe revealed plans on Tuesday to hold yuan as part of their foreign currency reserves, highlighting the Chinese currency’s rise into an elite league of the world’s major reserve currencies.\nResponding to Reuters inquiries placed with central banks across the region, Bank of Spain said it was considering an investment in the yuan, the National Bank of Belgium said has already bought around 200 million euros ($244.5 million) worth of the Chinese currency and Slovakia said it also bought an undisclosed amount of yuan.\nThe moves come after the European Central Bank converted 500 million euros worth of its U.S. dollar reserves into the Chinese currency last year, signalling confidence in the yuan and likely encouraging others to make a similar move.\nThe role of the yuan has increased steadily since the International Monetary Fund included the currency in its Special Drawing Right basket from October 2016, placing it into an elite group that includes the euro, the dollar, the Japanese yen and the British pound.\nWhile the Swiss National Bank and the Bank of England already manage yuan assets and the Bundesbank said it plans such an investment, not all central banks are convinced yet.\nSweden’s Riksbank and the National Bank of Slovenia both said they hold no yuan and plan no investment in the Chinese currency.\nSince the yuan currency entered the IMF’s Special Drawing Rights basket, foreign exchange reserves held by global central banks has shown a relatively rapid increase in allocation towards the Chinese currency.\nIn the latest report for the period to the end of September 2017, global central banks allocated the equivalent of $107 billion towards the Chinese currency in their reserves, a 19 percent rise from the start of the year.\nStill, holdings of yuan were relatively small, with the $107 billion figure trailing holdings in units such as the Australian and Canadian dollars, IMF data showed. ($1 = 0.8179 euros) (Reporting by Robert-Jan Bartunek, Paul Day, Andy Bruce, Marja Novak, Tatiana Jancarikova, Jan Lopatka; Writing by Balazs Koranyi; Editing by Alison Williams)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T21:52:00.000+02:00", "crawled": "2018-01-16T23:11:28.000+02:00", "highlightTitle": ""}