{"organizations": [], "uuid": "ac3571fea1a70839920923407513b2ebd448181a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224504617&w=1200&r=LYNXMPEE0M18R", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews\r", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/apple-homepod/apple-launches-homepod-voice-speaker-taking-on-google-amazon-idINKBN1FC21F", "country": "US", "domain_rank": 408, "title": "Apple launches HomePod voice speaker, taking on Google, Amazon", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:13:00.000+02:00", "replies_count": 0, "uuid": "ac3571fea1a70839920923407513b2ebd448181a"}, "author": "", "url": "https://in.reuters.com/article/apple-homepod/apple-launches-homepod-voice-speaker-taking-on-google-amazon-idINKBN1FC21F", "ord_in_thread": 0, "title": "Apple launches HomePod voice speaker, taking on Google, Amazon", "locations": [], "entities": {"persons": [{"name": "amazon stephen nellis", "sentiment": "none"}, {"name": "siri", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "alphabet inc", "sentiment": "none"}, {"name": "national public radio", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 3:15 PM / Updated 32 minutes ago Apple launches HomePod voice speaker, takes on Google, Amazon Stephen Nellis 3 Min Read \n(Reuters) - After missing the critical holiday shopping season, Apple Inc ( AAPL.O ) has jumped into the voice speaker wars with the HomePod smart speaker, a device that will use its Siri voice assistant and compete against offerings from Amazon.com Inc ( AMZN.O ) and Alphabet Inc’s ( GOOGL.O ) Google. \nApple said on Tuesday it will start taking online orders for its HomePod smart speaker on Friday in the United States, United Kingdom and Australia, just over a month later than initially planned. \nThe $349 voice-controlled speaker, introduced in June and originally scheduled for a December release, can make music suggestions and adjust home temperatures. The speaker also will be able to send messages and play news updates from National Public Radio and CNN, Apple said in a release. \nAnalysts have debated the impact of the shipping delay on the HomePod’s eventual success. Apple has forecast between $84 billion and $87 billion in revenue for the holiday - mostly driven by sales of its $999 iPhone X - so it is unlikely that missing a few weeks of sales of the HomePod will affect its financial results, Bob O‘Donnell, founder of Technalysis Research, told Reuters in November. Slideshow (2 Images) \nThe bigger danger for Apple, analysts said, is that consumers bought a rival speaker over the holiday season and have no immediate need for Apple’s new product. Amazon and Google cut prices on their entry-level speakers over the holiday season in an aggressive push for market share, analysts said. \nApple is working to keep its Siri voice assistant relevant in the face of competition from Amazon’s Alexa and Alphabet’s Google Assistant, both of which are featured on smart speakers from those companies. \nApple also is counting on HomePod to boost subscriptions to Apple Music and block the rise of rival Spotify. The smart speakers from Google and Amazon let users give voice commands to play Spotify but Apple Music does not work on the rival devices. \nTrip Miller, managing partner at Gullane Capital and an Apple investor, said he’s concerned that Apple has focussed the HomePod too narrowly on playing music with high quality sound. Rivals speakers like the Amazon Echo can be used for a wider variety of tasks, like ordering a pizza or summoning a car from ride-hailing services. \n“I wonder if they’re pigeonholing themselves a bit with this product, when a much broader offering has been proven by competitors to be pretty darn attractive,” Miller said. Reporting by Supantha Mukherjee in Bengaluru and Stephen Nellis in San Francisco; editing by Bill Trott and Phil Berlowitz", "external_links": [], "published": "2018-01-23T17:13:00.000+02:00", "crawled": "2018-01-23T17:39:04.035+02:00", "highlightTitle": ""}