{"organizations": [], "uuid": "1aec338cfda7dad0b80f9c28476632df5c18a544", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/21/104723179-GettyImages-114918637.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/05/amd-is-big-winner-from-chip-flaw-fiasco.html", "country": "US", "domain_rank": 767, "title": "AMD is big winner from chip flaw fiasco", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T14:52:00.000+02:00", "replies_count": 0, "uuid": "1aec338cfda7dad0b80f9c28476632df5c18a544"}, "author": "Tae Kim", "url": "https://www.cnbc.com/2018/01/05/amd-is-big-winner-from-chip-flaw-fiasco.html", "ord_in_thread": 0, "title": "AMD is big winner from chip flaw fiasco", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "amd", "sentiment": "negative"}, {"name": "intel", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES show chapters 5 Hours Ago | 00:43 \nInvestors are piling into AMD shares and selling Intel stock after major chip security vulnerabilities were revealed earlier this week, and it totally makes sense. \nEnterprises will likely diversify their chip security architecture risk for mission-critical applications by buying more AMD server chips. The company's \"architecture differences\" have proven immune to the more problematic one of the two disclosed vulnerabilities. \nBritish tech website The Register reported Tuesday that some Intel processors have a \"fundamental design flaw\" and security issue, which spurred the company to confirm the problem later in the day. \nAMD shares are up 10.4 percent in the two days through Thursday following the report, while Intel's stock declined 5.2 percent in the period, wiping out $11.3 billion of shareholder value. \nOne of the two vulnerabilities, called Meltdown, affects Intel processors. The other, named Spectre, could affect chips from Intel, AMD and Arm. \nIntel said Wednesday that performance degradation after security updates for Meltdown \"should not be significant\" for the average user. But on a call with investors, the company admitted a decrease in performance of up to 30 percent was possible after fixes under some \"synthetic workloads.\" \nBank of America Merrill Lynch told clients the big Intel performance hits were \"likely for enterprise and server workloads.\" \nOn the flip side, AMD said any performance hits will be \"negligible\" after Spectre-related security software updates and there is \"near zero risk of exploitation.\" The company also confirmed it is not affected by Meltdown due to processor \"architecture differences.\" \nResearchers and Apple said Spectre is more difficult to exploit. \nMultiple Wall Street analysts predicted AMD will take advantage of the Intel's security issues. \nAMD could use it as \"a marketing edge given differing architectures and no vulnerability yet,\" Mizuho Securities analyst Vijay Rakesh wrote in a note to clients Wednesday. \nIntel's high-profit data-center business, which sells server chips to cloud computing providers and enterprises, is the chipmaker's crown jewel. \nRakesh noted that Intel had 99 percent market share of the data-center market, representing a huge opportunity for AMD. \nAnalysts estimate that Intel's data-center group will generate $18.5 billion in sales and $7.4 billion in operating profit in 2017, according to FactSet. \n\"Longer-term customers could be more motivated to find alternatives at AMD and possibly ARM ( CAVM benefits) to diversify the architectural risks,\" Bank of America Merrill Lynch analyst Vivek Arya wrote Thursday. \"AMD appears poised to be the most direct beneficiary.\" \nAn AMD gain of significant market share in the server market is not unprecedented. The company hit 25 percent share in 2006. If AMD is able to reach 10 percent or 15 percent market share of the data-center business, it could add billions in revenue to the company's financial results. \nAny increase will be a boon for AMD because the Wall Street consensus for the company's 2017 estimated sales is just $5.25 billion. \nOne leading tech industry analyst says the chipmaker will do just that. \n\"The news of Intel's processor security issue and the potential performance degradation to correct it comes at an inopportune time as Intel currently faces heavy competitive pressure from its long-time nemesis, AMD,\" Fred Hickey, editor of High Tech Strategist, wrote in an email Thursday. \"AMD's new line of chips is a significant challenger for the first time in many years (since AMD's Opteron chip days).\" \nAMD launched new line Epyc data-center processors to much fanfare last June with design wins at cloud computing providers Microsoft Azure and Baidu.\"For Intel, it likely means loss of market share (lower revenues) as well as loss of pricing power (lower gross margins) as the advantage shifts to the buyers and away from Intel, which has totally dominated the PC/computer server processor market in recent years,\" Hickey said. \"AMD's new processor chips already had momentum and that momentum will likely be propelled further by the recent security issue disclosures.\"", "external_links": [], "published": "2018-01-05T14:52:00.000+02:00", "crawled": "2018-01-05T15:13:51.006+02:00", "highlightTitle": ""}