{"organizations": [], "uuid": "d7eee8d5b552767a35604304cf660fd96b2423fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-skat-korea/olympics-south-korea-skating-chief-apologises-for-incidents-idUKKBN1FG04H", "country": "US", "domain_rank": 408, "title": "Olympics - South Korea skating chief apologises for incidents", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T05:49:00.000+02:00", "replies_count": 0, "uuid": "d7eee8d5b552767a35604304cf660fd96b2423fa"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-skat-korea/olympics-south-korea-skating-chief-apologises-for-incidents-idUKKBN1FG04H", "ord_in_thread": 0, "title": "Olympics - South Korea skating chief apologises for incidents", "locations": [], "entities": {"persons": [{"name": "kim sang-hang", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "korea skating union", "sentiment": "none"}, {"name": "blue house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ksu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 3:49 AM / Updated 14 minutes ago Olympics - South Korea skating chief apologises for incidents Reuters Staff 3 Min Read \nSEOUL (Reuters) - Korea’s skating union has apologised for souring the mood ahead of February’s Winter Games after a coach was banned for life for striking a short track athlete and a speed skater almost lost her spot at the Olympics due to an administrative error. \nKim Sang-hang, president of the Korea Skating Union (KSU), said in a statement that it would take steps to avoid further problems as South Korea prepares to host next month’s Olympics in Pyeongchang. \nThe incidents sparked a huge backlash in Korea, with almost 200 online petitions calling for the KSU to be reformed or disbanded were lodged with the presidential Blue House. \nThe KSU has seen more than its fair share of controversy over the years, with allegations of favouritism and athlete mistreatment prompting the government to order a review of the governing body after the Sochi Olympics in 2014. \n“I sincerely apologise for the issues regarding the national skating team ahead of the Winter Olympics,” Kim said in a statement. \n“We promise there will be no repeat of these problems and will come up with reform measures and implement them as soon as possible.” \nThe KSU handed out a lifetime ban to the coach of Shim Suk-hee on Thursday after he admitted to physically assaulting the 20-year-old, who won gold, silver and bronze medals in Sochi. \nPublic anger with the KSU grew when it emerged speed skater Noh Seon-yeong was told only last week that she would be unable to compete in the team pursuit in Pyeongchang because she had not been able to earn a spot in an individual event. \nThe KSU was criticized for failing to give Noh the chance to qualify but it blamed the oversight on miscommunication with the International Skating Union. \nNoh, who had been hoping to win gold to honour her late brother, former short track world champion Jing-kyu, who died of bone cancer in 2016, was surprisingly reinstated on Friday after two Russians who had qualified were dropped from the final list. \nHowever, Noh’s participation at the Feb. 9-25 Games remains in doubt after she lashed out in local media, accusing the KSU of favouritism and saying she no longer wanted to be part of the national team. \n“I apologise to Noh Seon-yeong for our failure to ensure she knew the relevant regulations, which caused the athlete so much pain and affected her preparations for the Olympics,” said Kim. \n“Fortunately she gained an Olympic berth from the ISU ... and we will do our best to support her in the buildup to the Games.” Writing by Peter Rutherford; Reporting by Yuna Park; Editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-27T05:49:00.000+02:00", "crawled": "2018-01-27T06:07:00.010+02:00", "highlightTitle": ""}