{"organizations": [], "uuid": "9e50eea0b093bba628cb0e69f2daa9a0a8d2878c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-tunisia-protests/hundreds-attend-anti-austerity-protests-in-tunis-amid-heavy-police-presence-idUKKBN1F30KV", "country": "US", "domain_rank": 408, "title": "Hundreds attend anti-austerity protests in Tunis amid heavy police presence", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T15:11:00.000+02:00", "replies_count": 0, "uuid": "9e50eea0b093bba628cb0e69f2daa9a0a8d2878c"}, "author": "", "url": "https://uk.reuters.com/article/uk-tunisia-protests/hundreds-attend-anti-austerity-protests-in-tunis-amid-heavy-police-presence-idUKKBN1F30KV", "ord_in_thread": 0, "title": "Hundreds attend anti-austerity protests in Tunis amid heavy police presence", "locations": [], "entities": {"persons": [{"name": "tarek amara", "sentiment": "none"}, {"name": "zine el abidine ben ali", "sentiment": "none"}], "locations": [{"name": "tunis", "sentiment": "none"}, {"name": "tunis", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}], "organizations": [{"name": "labour union", "sentiment": "none"}, {"name": "interior ministry", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 1:13 PM / Updated 41 minutes ago Hundreds protest against austerity in Tunis, tear gas fired Tarek Amara 3 Min Read \nTUNIS (Reuters) - Hundreds of Tunisians held anti-austerity demonstrations in the capital on Sunday and in one district police fired tear gas to disperse dozens of stone-throwing youths on the seventh anniversary of the ousting of former President Zine El Abidine Ben Ali. \nAfter nearly a week of at times violent protests, police used tear gas against dozens of young protesters in the Ettadamen district of Tunis in renewed demonstrations over a tax hike after a relatively calm two days. \nA Reuters witness saw youths around 20 years old throwing stones at police cars and setting fire to tyres before security forces drove them back with tear gas. \nProtests erupted last Monday in several towns and cities across Tunisia, triggered by tax and price hikes imposed on Jan. 1 by a government seeking to reduce a budget deficit to meet an agreement with its international donors. \nAlmost 800 people have been arrested for vandalism and acts of violence, including throwing petrol bombs at police stations, according to the interior ministry. \nThe government late on Saturday pledged extra aid for poor families and those in need in response to the demonstrations but protesters still took to the streets, holding banners with slogans against rising prices and new taxes. A woman shout slogans during demonstrations on the seventh anniversary of the toppling of president Zine El-Abidine Ben Ali, in Tunis, Tunisia January 14, 2018. REUTERS/Youssef Boudlal \nOne rally took place in front of the Labor Union (UGTT) headquarters and several other protests were held along the central Habib Bourguiba Avenue, to which hundreds of riot police had been deployed. \n“This is what the government has done to us,” said one a protester named Fouad. “Pockets are empty by unfair decisions of the government ... I am a professor and my wife is a teacher, but we are suffering today to meet what we need.” Slideshow (3 Images) \n“We have only won the freedom of expression after 2011 revolution ... but we will remain in the streets until we win our economic rights just as we have our freedom,” he added. \nPolice seeking to separate supporters of the opposition Popular Front party and the Islamist Ennahda party, which is part of the ruling coalition. The government and Ennahda accuse the PF of being behind some of the violence last week. \nPrices have increased for fuel and some consumer goods, while taxes on cars, phone calls, the internet, hotel accommodation and other items have also gone up. \nTunisia has been hailed as the only democratic success of the Arab Spring: the one Arab country to topple a long-serving leader in that year’s uprisings without triggering widespread violence or civil war. \nBut Tunisia has had nine governments since Ben Ali’s overthrow, none of which have been able to resolve deep-rooted economic problems. The economy worsened since a vital tourism sector was nearly wiped out by a wave of deadly militant attacks in 2015, and has yet to recover despite improved security. Editing by Ulf Laessing, Raissa Kasolowsky and David Evans", "external_links": [], "published": "2018-01-14T15:11:00.000+02:00", "crawled": "2018-01-14T15:33:17.013+02:00", "highlightTitle": ""}