{"organizations": [], "uuid": "242d8697396dbcbcf65ec55b6eb76709a0b704fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220484380&w=1200&r=LYNXMPEE080GQ", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-cricket-sri-lanka-captaincy/cricket-sri-lanka-bring-back-mathews-as-limited-overs-captain-idUKKBN1EY0RN", "country": "US", "domain_rank": 408, "title": "Cricket: Sri Lanka bring back Mathews as limited-overs captain", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T10:44:00.000+02:00", "replies_count": 0, "uuid": "242d8697396dbcbcf65ec55b6eb76709a0b704fe"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-sri-lanka-captaincy/cricket-sri-lanka-bring-back-mathews-as-limited-overs-captain-idUKKBN1EY0RN", "ord_in_thread": 0, "title": "Cricket: Sri Lanka bring back Mathews as limited-overs captain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 8:46 AM / Updated 9 hours ago Cricket: Sri Lanka bring back Mathews as limited-overs captain Reuters Staff 2 Min Read \nCOLOMBO (Reuters) - All-rounder Angelo Mathews has been appointed Sri Lanka’s limited-overs skipper six months after relinquishing the captaincy across all three formats. Cricket - Sri Lanka v India - Fourth One Day International Match - Colombo, Sri Lanka - August 31, 2017 - Angelo Mathews of Sri Lanka celebrates his half century. REUTERS/Dinuka Liyanawatte \nThe 30-year-old stepped down as captain last year after Sri Lanka’s shock home defeat to Zimbabwe, which he described as “one of the lowest points” of his career. Dinesh Chandimal was named the new test captain, while Upul Tharanga was put in charge of the limited overs side. \nTharanga was then striped of the captaincy after a string of defeats and replaced by Thisara Perera, who oversaw the team’s 2-1 loss in India last month, on a temporary basis. \n“When I stepped down I never thought of taking over the captaincy again,” Mathews, who is expected to lead the side into the 2019 World Cup in England and Wales, told reporters on Tuesday. \n“I took a few a few days to think about it, and because of a few reasons I decided to accept it.” \nSri Lanka Cricket (SLC) said Mathews was given the job “on a long term basis” after he agreed to board president Thilanga Sumathipala’s request to shoulder the responsibility. \n“We need stability running into the World Cup,” said Mathews, who will begin the new phase of his captaincy in a tri-series in Bangladesh that also involves Zimbabwe later this month. \n“We’ve had a few captains over the last few months because of injuries. The other captains did a good job, though we didn’t get the results. But going into the World Cup we need that stability.” Reporting by Amlan Chakraborty in New Delhi; editing by Peter Rutherford", "external_links": [], "published": "2018-01-09T10:44:00.000+02:00", "crawled": "2018-01-09T11:03:05.014+02:00", "highlightTitle": ""}