{"organizations": [], "uuid": "32e8a4a25abbb43061a3ef83138c537219eaa6a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220515305&w=1200&r=LYNXMPEE080PD", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-politics-young/how-to-lose-friends-author-quits-watchdog-job-embarrasses-pm-may-idUKKBN1EY15P", "country": "US", "domain_rank": 408, "title": "\"How to Lose Friends\" author quits watchdog job, embarrasses PM May", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T13:19:00.000+02:00", "replies_count": 0, "uuid": "32e8a4a25abbb43061a3ef83138c537219eaa6a3"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-politics-young/how-to-lose-friends-author-quits-watchdog-job-embarrasses-pm-may-idUKKBN1EY15P", "ord_in_thread": 0, "title": "\"How to Lose Friends\" author quits watchdog job, embarrasses PM May", "locations": [], "entities": {"persons": [{"name": "jeff overs/bbc/handout", "sentiment": "none"}, {"name": "may", "sentiment": "none"}, {"name": "toby young", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}, {"name": "andrew macaskill", "sentiment": "none"}], "locations": [{"name": "maidenhead", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "office for students", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 11:20 AM / Updated 6 hours ago 'How to Lose Friends' author quits watchdog job, embarrasses PM May Andrew MacAskill 3 Min Read \nLONDON (Reuters) - The author of the satirical memoir “How to Lose Friends and Alienate People” became the latest figure to embarrass British Prime Minister Theresa May on Tuesday, resigning from a watchdog for British universities over a history of misogynist tweets. Britain's Prime Minister Theresa May speaks on the BBC's Andrew Marr Show, in this photograph received via the BBC, in her Maidenhead constituency in Britain January 6, 2018. Picture taken on January 6, 2018. Jeff Overs/BBC/Handout via REUTERS \nToby Young quit his post on the board of the Office for Students, which is meant to help uphold standards in higher education, less than two days after May said he could keep it. \nHis resignation came amid a cabinet reshuffle meant to stamp May’s authority on the government but derided in newspapers as a shambles, after one senior minister quit rather than take a new job and another talked May out of changing his role. \nYoung, whose memoir of a failed stint as a showbiz reporter was made into a 2008 movie, had reinvented himself as an education reform advocate, helping found a school in London run by parents under a programme introduced by May’s Conservatives. \nBut his appointment to the universities body was met by a barrage of criticism because of a history of sexist and inappropriate remarks in articles and on social media. A petition calling for his dismissal gathered more than 220,000 signatures. \nIn 2012, he criticised the “ghastly” need for schools to meet accessibility requirements for the disabled. He has also said women who “display a lot of cleavage shouldn’t then complain when men notice them”, described himself as a self-confessed pornography addict, and joked about being sexually aroused by images of hungry African children. \nHe has apologised for such comments, which he said dated to a career as a “journalistic provocateur” and did not reflect his commitment to education. \n“My appointment has become a distraction from (the Office for Students’) vital work of broadening access to higher education and defending academic freedom,” Young said in a statement on the website of the Spectator magazine. \nRobert Halfon, the Conservative chairman of parliament’s education committee, told BBC radio on Tuesday that Young’s appointment had been a mistake. His appointment “hadn’t possibly been considered with due diligence and I thought it was the wrong decision”, Halfon said. \nOn Sunday, May said Young should be allowed to continue serving even though she condemned offensive comments he had made in the past. But the issue had damaged her attempts to rebrand her Conservative party as more inclusive during the ministerial reshuffle, which began on Monday and is aimed at promoting more women, black and younger lawmakers. \nThe reshuffle was triggered by the resignation of May’s top ally in the cabinet, Damian Green, who was forced to quit after giving misleading statements about pornography on his laptop. \nMay, who lost her majority in parliament last year after calling a snap election that she expected to win in a landslide, has struggled to restore her authority over a party divided between supporters and opponents of a hard break with the EU. Reporting By Andrew MacAskill; Editing by Peter Graff", "external_links": [], "published": "2018-01-09T13:19:00.000+02:00", "crawled": "2018-01-09T13:38:19.188+02:00", "highlightTitle": ""}