{"organizations": [], "uuid": "11545f9cf95686bbfac0af067e1a0c73fd7f986c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/15/104946067-Carillion.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19794221/device/rss/rss.html", "section_title": "Europe News", "url": "https://www.cnbc.com/2018/01/16/european-markets-euro-close-to-three-year-high.html", "country": "US", "domain_rank": 767, "title": "European markets; euro close to three-year high", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T09:45:00.000+02:00", "replies_count": 0, "uuid": "11545f9cf95686bbfac0af067e1a0c73fd7f986c"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/16/european-markets-euro-close-to-three-year-high.html", "ord_in_thread": 0, "title": "European markets; euro close to three-year high", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "rio tinto", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "premier foods", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "European stocks eked out gains by Tuesday's close, however a downturn in commodities weighed on sentiment, despite positive trading from markets overseas.\nSymbol Name Price Change %Change Volume FTSE --- DAX --- CAC --- IBEX 35 --- The pan-European STOXX 600 ended trade slightly higher, up 0.13 percent provisionally, off its session highs. The majority of sectors closed in the black.\nThe U.K.'s FTSE 100 fell 0.17 percent, while the French CAC 40 managed to hold onto its gains, closing up 0.08 percent. Germany's DAX rose 0.35 percent.\nOverseas, the Dow Jones industrial average broke above 26,000 for the first time at the start of the U.S. trading day, with the session continuing to post strong gains at Europe's close.\nEarnings dominate, yet miners slip 1.4% When it comes to European industries, commodities were under the greatest pressure Tuesday. Oil stocks fell 0.92 percent as a sector, on the back of weakness seen in crude prices. Despite Brent crude falling over 1 percent, prices continued to hover around $69.35 at Europe's close, a level not seen since 2014. U.S. crude traded just below the $64 per barrel mark.\nMeanwhile, London-listed miners BHP Billiton , Anglo American and Antofagasta all tumbled 1.5 percent or more, amid a slump in metals prices — particularly copper and nickel.\nRio Tinto slipped 3 percent after HSBC downgraded its stock recommendation to a \"hold\" from a \"buy\". In the previous session, the mining giant said it would look to lift 2018 iron ore shipments by 10 million tons after it reported a 1 percent rise in 2017 shipments. The drop in U.K. miners dragged the FTSE lower.\nGermany's DAX, however, received a boost in trade on the back of strong performance in the autos sector. BMW rose over 3 percent after news emerged that parking solutions provider Parkmobile had announced a recapitalization of its business and investment by BMW Group.\nCzech automobile manufacturer Skoda saw its global deliveries tick up 6.6 percent to a record 1.2 million vehicles in 2017. Its parent company Volkswagen jumped 2.28 percent.\nshow chapters Expect an increase in market volatility in 2018, strategist says 10 Hours Ago | 01:47 Looking at individual stocks, Hugo Boss was a top performer, rising 3.73 percent amid stronger-than-anticipated corporate earnings. The German fashion house returned to profit in the final three months of 2017 after a series of profit warnings.\nDanish jewelry manufacturer Pandora announced that it aims to double its new product launches by 2022, to regain recent weak growth and lack of innovation, Reuters reported. Shares popped 4.72 percent by the close.\nOn the opposite end of Europe's benchmarks, Capita tumbled over 6 percent after M&G Prudential announced that it would be moving the administration of its life and pensions contracts to a different supplier.\nChocolatier Lindt & Spruengli saw its group sales rise to 4.09 billion Swiss francs in 2017, although the company did see weaker results in the U.S. Shares fell almost 2.5 percent.\nBitcoin falls below $12,000 The euro has posted strong gains as of late, but has pared back against the dollar on Tuesday. The single currency had reached three-year highs amid heightened expectation that the European Central Bank (ECB) could soon pare its monetary stimulus.\nCryptocurrencies are also in focus, after bitcoin sank to a six-week low, trading below $12,000 at one point, as comments out of South Korea renewed worries about a crackdown in one of the largest markets for digital currency trading.\nOn the data front, U.K. inflation eased off its post-Brexit vote high in December, prompting a slight fall in sterling against the dollar. The figures, published Tuesday, showed consumer prices rose 3 percent year-on-year in the final month of 2017, in line with analyst expectations.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.", "external_links": [], "published": "2018-01-16T09:45:00.000+02:00", "crawled": "2018-01-16T09:12:32.006+02:00", "highlightTitle": ""}