{"organizations": [], "uuid": "11c57364f0733a543f80f6b4c7bf10a9bcf70ec3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226480359&w=1200&r=LYNXMPEE0T05K", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-southkorea-northkorea/south-korea-says-still-pushing-forward-on-other-projects-with-north-korea-idUSKBN1FJ0CN", "country": "US", "domain_rank": 408, "title": "South Korea says still pushing forward on other projects with North Korea", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T05:42:00.000+02:00", "replies_count": 0, "uuid": "11c57364f0733a543f80f6b4c7bf10a9bcf70ec3"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-southkorea-northkorea/south-korea-says-still-pushing-forward-on-other-projects-with-north-korea-idUSKBN1FJ0CN", "ord_in_thread": 0, "title": "South Korea says still pushing forward on other projects with North Korea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 3:42 AM / Updated 9 hours ago South Korea says still pushing forward on other projects with North Korea Christine Kim 4 Min Read \nSEOUL (Reuters) - South Korea will go ahead with other Winter Olympics projects with North Korea despite Pyongyang calling off a joint cultural performance that was less than a week away, a South Korean government official said on Tuesday. \nNorth Korea called off the joint cultural performance, which had been scheduled for Feb. 4, late on Monday, blaming South Korean media for encouraging “insulting” public sentiment. \nSouth Korean officials, who see the games as an opening to broader political reconciliation and even international talks over Pyongyang’s nuclear weapons and ballistic missile program, still hope other planned events pan out. \nThe North and South are continuing negotiations over plans for South Korean athletes to train at North Korea’s Masikryong ski resort, an official at the Ministry of Unification in Seoul told Reuters. \nThere seemed to be no problems regarding plans for the joint training program, said the official, who asked not to be identified because of the sensitivity of the matter. \nHowever, given the North’s decision on Monday, the official said it was unlikely any joint performance would be held before the Winter Olympics begin in Pyeongchang on Feb. 9. \nThe Unification Ministry sent a statement to the North in response, saying all events agreed upon for the success of the Pyeongchang Olympics should be held without fail. \n“In this situation, where North and South Korea have taken their first step toward improving relations, agreements should be upheld out of mutual respect and understanding,” the ministry said. Workers install Olympic Rings at the Alpensia Ski Jumping Centre in Pyeongchang, South Korea, January 25, 2018. REUTERS/Pawel Kopczynski \nNorth and South Korea launched rare talks early in January to bring North Koreans to the Pyeongchang Games after the North’s leader, Kim Jong Un, said in a New Year’s address he was willing to open discussions with Seoul. \nPresident Moon Jae-in is under pressure from both sides, with domestic support dropping over his administration’s response to North Korea’s participation in the Winter Olympics, especially after it decided to form a combined women’s ice hockey team with athletes from both sides. \nMany South Koreans have complained the unified women’s hockey team - the only such joint team - was unfair to South Korean players. More than a hundred petitions against the unified team have gone to the presidential Blue House’s website. \nGovernment and opposition parties criticized Pyongyang’s decision to call off the performance on Tuesday, with Moon’s Democratic Party saying in a statement “frequent promise-breaking leads to fatigue”. \n“It’s North Korea’s responsibility to show its sincerity. It’s no help flipping on agreements like one would flip their hand,” the party said. \nJeong Yeung-tae, head of the Institute of North Korea Studies in Seoul, said he was not surprised by the cancellation, as it was too much to expect relations with Pyongyang to change overnight. \n“Everything was rushed…North Korea’s participation in the Pyeongchang Olympics was decided late, and from then on the situation was dragged hurriedly to this point in time,” Jeong said. \nNot having the joint cultural event may avert some logistical and political risks for both sides, but the last-minute move by North Korea still signals “a bit of a threat,” said Ahn Chan-il, who defected from North Korea in 1979 and now heads the World Institute for North Korea Studies. \n“North Korea decided to cancel the performance to rein us in a bit, put a muzzle on South Korean media and make sure they have the upper hand during the Pyeongchang Olympics,” he added. Reporting by Christine Kim; Editing by Paul Tait and Clarence Fernandez", "external_links": [], "published": "2018-01-30T05:42:00.000+02:00", "crawled": "2018-01-30T05:54:06.041+02:00", "highlightTitle": ""}