{"organizations": [], "uuid": "e9a0f6c3a74e663f7bb4a82dff4392ba38d3bc21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 95}, "facebook": {"likes": 16, "shares": 16, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/16/103476014-Jim_Whitehurst_1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/red-hat-buys-coreos-for-250-mililon.html", "country": "US", "domain_rank": 767, "title": "Red Hat buys CoreOS for $250 mililon", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.17, "site_type": "news", "published": "2018-01-31T00:06:00.000+02:00", "replies_count": 0, "uuid": "e9a0f6c3a74e663f7bb4a82dff4392ba38d3bc21"}, "author": "Matt Rosoff", "url": "https://www.cnbc.com/2018/01/30/red-hat-buys-coreos-for-250-mililon.html", "ord_in_thread": 0, "title": "Red Hat buys CoreOS for $250 mililon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Red Hat has acquired CoreOS for $250 million, in a deal that brings further momentum to a Google -created technology used by companies to manage software running in data centers and in the cloud.\nThe move gives Red Hat a prominent name to keep commercializing hot open-source software as part of its arsenal. Red Hat's core business is taking open-source products, such as the Linux operating system, which are collectively created by a large public community rather than by any one company, and selling services around them such as support and customization.\nCoreOS is often mentioned in the same breath as Docker. Both San Francisco start-ups offer technologies for \"containerization,\" which became popular around 2014 as a way of helping corporate software run more efficiently in \"hybrid\" cloud scenarios, where the software runs both on local data centers and in clouds such as those provided by Google, Amazon and Microsoft . CoreOS, the company, was built to commercialize an open-source product by the same name. Container technology is a key part of a Google-developed open-source technology called Kubernetes. Docker was later to adopt support for Kubernetes.\n\"By combining CoreOS's complementary capabilities with Red Hat's already broad Kubernetes and container-based portfolio, including Red Hat OpenShift, Red Hat aims to further accelerate adoption and development of the industry's leading hybrid cloud platform for modern application workloads,\" the company said in a statement .\nCoreOS has 130 employees, who are joining Red Hat, and has raised $50 million, according to CrunchBase, the bulk of it from Alphabet's venture arm GV, formerly known as Google Ventures.\nDocker, meanwhile, has raised more than $240 million from a variety of well-known venture firms, including Greylock and Sequoia.", "external_links": [], "published": "2018-01-31T00:06:00.000+02:00", "crawled": "2018-01-31T00:11:07.002+02:00", "highlightTitle": ""}