{"organizations": [], "uuid": "33279c4612bf6b4da6d9a62702d96f94e5a7fcee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220208893&w=1200&r=LYNXMPEE070G3", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/uk-europe-view-monday/daily-briefing-may-reshuffles-merkel-still-seeking-partner-idUKKBN1EX0ME", "country": "US", "domain_rank": 408, "title": "Daily Briefing: May reshuffles; Merkel still seeking partner", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T10:27:00.000+02:00", "replies_count": 0, "uuid": "33279c4612bf6b4da6d9a62702d96f94e5a7fcee"}, "author": "", "url": "https://uk.reuters.com/article/uk-europe-view-monday/daily-briefing-may-reshuffles-merkel-still-seeking-partner-idUKKBN1EX0ME", "ord_in_thread": 0, "title": "Daily Briefing: May reshuffles; Merkel still seeking partner", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "rudd", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "mediterranean", "sentiment": "none"}, {"name": "cyprus", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "raf akrotiri", "sentiment": "none"}, {"name": "daily telegraph", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 8:28 AM / Updated 8 hours ago Daily Briefing: May reshuffles; Merkel still seeking partner Reuters Staff 7 Min Read \nLONDON (Reuters) - Possibly the most significant thing about the cabinet reshuffle Theresa May is due to announce today is the fact that she is still in post to do it at all - such was the speculation throughout 2017 about how long she would last as premier. Britain's Prime Minister Theresa May speaks to the troops at RAF Akrotiri, one of two military bases Britain maintains on the east Mediterranean island of Cyprus, December 22, 2017. REUTERS/Petros Karadjias/Pool \nThat said, she is unlikely to test the limits of her still-fragile authority by swapping out some of the big beasts of her cabinet (Johnson, Davis, Hammond, Rudd...) and will focus instead on some more cosmetic ministerial role changes. One material development, if a Daily Telegraph report is correct, would be the creation of a new post tasked to provide updates to the cabinet on preparations for leaving the EU without a trade deal - an outcome the government says it wants to avoid, but is nevertheless drawing up contingency plans for. “We won’t draw any red lines - rather we want to push through as much red politics as possible” Martin Schulz, leader of Germany's SPD \nAngela Merkel and her CDU/CSU union will continue talks on a \"grand coalition\" with the centre-left SPD leadership team until end of the week. Then SPD party head Martin Schulz will have to give a recommendation whether this could lead into concrete coalition talks and any agreement would finally need backing from sceptical SPD members. After first meetings yesterday Merkel was typically optimistic about the chances of striking a deal; but even in a best-case scenario, Germany most probably won’t have a new government in place before March/April. \nThe European Commission begins a two-day conference on the EU's next long-term budget after Brexit, with one of the most pressing questions being how to compensate for the loss of Britain's net contribution to the EU. The other thorny issue that may come up is linking eligibility for EU cash with commitments to observe the rule of law and democracy - now seen at risk in Poland and perhaps in Romania and Hungary. Leader of the Christian Democratic Union and the acting German Chancellor Angela Merkel delivers a speech before exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 7, 2018. REUTERS/Hannibal Hanschke \nMARKETS \nThe world markets mood stays buoyant into the second week of the year, with Friday’s U.S. payrolls encouraging for those hoping the brisk growth and low and inflation mix can be sustained through 2018. \nAfter new records on Wall St and Friday and a Vix volatility gauge close of just 9.2 percent, the afterglow continued through Asia trading on Monday. MSCI’s Asia exJapan index came within a whisker of all-time highs, while MSCI’s all-country index set a new record. Shanghai, HK and Seoul all advanced smartly, with Tokyo leading the way higher – thanks in part to dollar/yen’s modest advance toward $113.30. \nEuropean exchanges are expected to follow suit with gains of about 0.25 percent, although there was an eye-catching economic surprise in data showing German industrial orders unexpectedly fell 0.4 percent in November. This helped push euro/dollar back below $1.20 and has kept the dollar bid more generally, with traders also wary of U.S. futures data showing the largest net long position in euros in the single currency’s history in the week to Jan 2. Eyes will also be trained on German industrial works pay dispute, where walkouts are expected on Monday and the IG Metall metalworkers union is demanding increases of 6 percent and a shorter working week. \nTen-year U.S. Treasury yields were firm about 2.4850 percent, with the 2-10 year yield curve back above 50 basis points. The big focus of the week will be the start of the U.S. Q4 earnings season, where aggregate annual S&P500 profit growth is expected to come in about 11 percent. The big data points will be U.S. CPI inflation on Friday as well as December trade and inflation readings from China through the week too. Canada’s dollar on Monday retained much of Friday’s surge after the latest jobs reports encouraged speculation about a rise in the Bank of Canada’s interest rates as soon as next week. \nSterling was steady to touch firmer as UK PM May is expected to announce a reshuffle of her cabinet ministers later on Monday. As capital outflow fears recede, China’s foreign exchange reserves rose for 11 months in a row to their highest level in more than a year in December, blowing past economists’ estimates. The yuan gave up early gains after a central bank adviser suggested it should gravitate back to 6.6 per dollar. Editing by Robin Pomeroy", "external_links": [], "published": "2018-01-08T10:27:00.000+02:00", "crawled": "2018-01-08T10:53:16.034+02:00", "highlightTitle": ""}