{"organizations": [], "uuid": "671e10e4f7a823352ddeb65d2e1438dc1b9cfb95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/08/gettyimages-621183276.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/google-coursera-it-jobs/", "country": "US", "domain_rank": 1196, "title": "Google, Coursera Launch New IT Certificate Program | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.701, "site_type": "news", "published": "2018-01-16T13:36:00.000+02:00", "replies_count": 0, "uuid": "671e10e4f7a823352ddeb65d2e1438dc1b9cfb95"}, "author": "Jeff John Roberts", "url": "http://fortune.com/2018/01/16/google-coursera-it-jobs/", "ord_in_thread": 0, "title": "Google, Coursera Launch New IT Certificate Program | Fortune", "locations": [], "entities": {"persons": [{"name": "jeff john roberts", "sentiment": "negative"}, {"name": "natalie van cleef conley", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "bank of america", "sentiment": "none"}, {"name": "wal-mart", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeff John Roberts 11:36 AM EST \nGoogle and online learning giant Coursera on Tuesday unveiled a new certificate program to train Americans, including those without college degrees, for entry-level IT jobs . \nThe program , which consists of six courses that can be part-time completed in eight to 12 months, also connects participants with large employers like Bank of America and Wal-Mart who are looking for workers proficient in basic IT skills. \nThe online learning initiative—known as the Google IT Support Professional Certificate—costs $49 per month through Coursera but, for a limited period, Google (googl) says it will pay those costs for 10,000 participants. \nThe IT initiative is one part of a larger $1 billion effort by Google, focused on skills and education, to help workers find their footing in a U.S. economy disrupted by technology. The move also comes at a time when Google and other tech giants are trying to deflect mounting criticism about their effect on society and the workforce. \nGet Data Sheet , Fortune’s technology newsletter. \nAccording to Natalie Van Cleef Conley, a Google executive leading the initiative, the new courses grew out of the company’s own experience trying to find people for unfilled IT positions. In an interview with Fortune , she says the lessons were created by Google’s own employees and are aimed in particular at veterans, refugees and lower income communities. \nShe adds that the IT program would avoid of other job-training initiatives, which often do little to place people in the workforce, in part because Google and Coursera are working directly with employers looking for the skills provided by the program. \n“Once people complete the certificate, they can opt in to share their information directly with top employers, including Bank of America, Walmart, Sprint, GE Digital, PNC Bank, Infosys, TEKSystems, UPMC, and of course, Google, all who are looking to hire IT support talent,” said Google in a blog post . \nMeanwhile, Coursera CEO Jeff Maggioncalda tells Fortune that online learning has improved dramatically in recent years, and that it’s misconception to think Internet-based course are somehow inferior to campus-based lessons. \nHe adds that Coursera and Google, which have collaborated in the past , are taking care to ensure their curriculum doesn’t become stale or obsolete, and that the programs help the participants land good jobs. \n“It’s a gateway into the tech labor force from which you can develop all sorts of careers,” he says. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-16T13:36:00.000+02:00", "crawled": "2018-01-16T19:43:28.010+02:00", "highlightTitle": ""}