{"organizations": [], "uuid": "18cb3e373c2e7378d7a2a8050b579148f541db55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-gnc-holdings-inc-provides-fourth-quarter-2017-update.html", "country": "US", "domain_rank": 767, "title": "GNC Holdings, Inc. Provides Fourth Quarter 2017 Update", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:03:00.000+02:00", "replies_count": 0, "uuid": "18cb3e373c2e7378d7a2a8050b579148f541db55"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-gnc-holdings-inc-provides-fourth-quarter-2017-update.html", "ord_in_thread": 0, "title": "GNC Holdings, Inc. Provides Fourth Quarter 2017 Update", "locations": [], "entities": {"persons": [{"name": "ken martindale", "sentiment": "none"}], "locations": [{"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "gnc", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "gnc holdings, inc", "sentiment": "neutral"}, {"name": "gnc holdings, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH, Jan. 18, 2018 /PRNewswire/ -- GNC Holdings, Inc. (NYSE: GNC) (the \"Company\") reported an increase in fourth quarter same store sales for domestic company-owned stores (including GNC.com sales) of 5.7%. Adjusted diluted earnings per share (\"EPS\") is expected to be in the range of $0.24 - $0.25 compared to adjusted diluted EPS of $0.07 in the prior year quarter.\n\"In the fourth quarter of 2017, our efforts to reposition the business continued to gain momentum,\" said Ken Martindale, chief executive officer. \"As we head into 2018, we will continue to focus on our key initiatives including capital structure improvement, international business growth, exclusive and innovative products and services, a more engaging e-commerce and digital platform and further customer experience improvements.\"\nAs of December 31, 2017, the Company's cash and cash equivalents were $64.0 million and long-term debt was $1.3 billion. The Company paid down the Revolving Credit Facility in the fourth quarter and there were no borrowings outstanding as of December 31, 2017. The Company is reiterating its free cash flow estimate of $190 - $210 million for the full year 2017.\nThe current quarter adjusted diluted EPS excludes the impact of potential non cash long-lived asset impairments, the convertible debt exchange and related debt financing costs, CEO executive placement costs related to make-whole stock-based compensation awards, a legal-related charge, tax reform and the Company's evaluation of the realizability of its deferred tax assets, which the Company is in the process of finalizing.\nThe Company recently announced the hiring of Goldman Sachs and Co. as its strategic advisor in order to optimize the Company's capital structure and enhance shareholder value. As part of this process the Company provided preliminary fourth quarter financial results. The Company does not plan to provide preliminary financial information in the future other than in unique circumstances, or in the event of a material event that requires disclosure.\nAbout Us\nGNC Holdings, Inc. (NYSE: GNC) - Headquartered in Pittsburgh, PA - is a leading global specialty health, wellness and performance retailer.\nGNC connects customers to their best selves by offering a premium assortment of heath, wellness and performance products, including protein, performance supplements, weight management supplements, vitamins, herbs and greens, wellness supplements, health and beauty, food and drink and other general merchandise. This assortment features proprietary GNC and nationally recognized third-party brands.\nGNC's diversified, multi-channel business model generates revenue from product sales through company-owned retail stores, domestic and international franchise activities, third-party contract manufacturing, e-commerce and corporate partnerships. As of December 31, 2017, GNC had approximately 9,000 locations, of which approximately 6,700 retail locations are in the United States (including approximately 2,400 Rite Aid franchise store-within-a-store locations) and franchise operations in approximately 50 countries.\nForward-Looking Statements Involving Known and Unknown Risks and Uncertainties\nThis release contains certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 with respect to the Company's financial condition, results of operations and business that is not historical information. Forward-looking statements can be identified by the use of terminology such as \"subject to,\" \"believes,\" \"anticipates,\" \"plans,\" \"expects,\" \"intends,\" \"estimates,\" \"projects,\" \"may,\" \"will,\" \"should,\" \"can,\" the negatives thereof, variations thereon and similar expressions, or by discussions regarding dividend, share repurchase plan, strategy and outlook. While GNC believes there is a reasonable basis for its expectations and beliefs, they are inherently uncertain. The Company may not realize its expectations and its beliefs may not prove correct. Many factors could affect future performance and cause actual results to differ materially from those matters expressed in or implied by forward-looking statements, including but not limited to unfavorable publicity or consumer perception of the Company's products; costs of compliance and any failure on management's part to comply with new and existing governmental regulations governing our products; limitations of or disruptions in the manufacturing system or losses of manufacturing certifications; disruptions in the distribution network; or failure to successfully execute the Company's growth strategy, including any inability to expand franchise operations or attract new franchisees, any inability to expand company-owned retail operations, any inability to grow the international footprint, any inability to expand the e-commerce businesses, or any inability to successfully integrate businesses that are acquired. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. Actual results could differ materially from those described or implied by such forward-looking statements. For a listing of factors that may materially affect such forward-looking statements, please refer to the Company's Annual Report on Form 10-K for the year ended December 31, 2016.\nSame store sales for company-owned stores include point-of-sale retail sales from all domestic stores which have been operating for twelve full months following the opening period. The Company is an omnichannel retailer with capabilities that allow a customer to use more than one channel when making a purchase, including in-store and through e-commerce channels which include its wholly-owned website GNC.com and third party websites (the sales from which are included in the GNC.com business unit) where product assortment and price are controlled by the Company, in which purchases are fulfilled by direct shipment to the customer from one of the Company's distribution facilities as well as third party e-commerce vendors. In-store sales are reduced by sales originally consummated online or through mobile devices and subsequently returned in-store. Sales of membership programs, including the new PRO Access loyalty program and former Gold Card program, which is no longer offered in the U.S., as well as the net change in the deferred points liability associated with the myGNC Rewards program, are excluded from same store sales.\nSame store sales are calculated on a daily basis for each store and exclude the net sales of a store for any period if the store was not open during the same period of the prior year. When a store's square footage has been changed as a result of reconfiguration or relocation in the same mall or shopping center, the store continues to be treated as a same store. If, during the period presented, a store was closed, relocated to a different mall or shopping center, or converted to a franchise store or a company-owned store, sales from that store up to and including the closing day or the day immediately preceding the relocation or c", "external_links": ["http://www.prnewswire.com/news-releases/gnc-holdings-inc-provides-fourth-quarter-2017-update-300584167.html", "http://www.gnc.com/"], "published": "2018-01-18T15:03:00.000+02:00", "crawled": "2018-01-18T16:20:19.016+02:00", "highlightTitle": ""}