{"organizations": [], "uuid": "947d22969d376267df4c5037e13ff4bb6471fd7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/30/104619944-GettyImages-628533470.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/heres-the-best-way-to-get-started-investing.html", "country": "US", "domain_rank": 767, "title": "Here's the best way to get started investing", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.174, "site_type": "news", "published": "2018-01-05T19:44:00.000+02:00", "replies_count": 0, "uuid": "947d22969d376267df4c5037e13ff4bb6471fd7e"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/05/heres-the-best-way-to-get-started-investing.html", "ord_in_thread": 0, "title": "Here's the best way to get started investing", "locations": [], "entities": {"persons": [{"name": "bryan r. smith", "sentiment": "negative"}, {"name": "steven greenhouse", "sentiment": "none"}, {"name": "paul gambles", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "new york times", "sentiment": "none"}, {"name": "mbmg group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Bryan R. Smith | AFP | Getty Images The Wall Street Bull sculpture is seen in the Financial District on December 8, 2016 in New York. SHARES \nThe markets are hot right now. On Thursday, the Dow broke above 25,000 for the first time , following the release of stronger-than-expected jobs data. \nBut not everyone is benefiting. \nAs Steven Greenhouse, former labor reporter for the New York Times, points out on Twitter: \"Remember, the richest 10% own 84% of stocks. Meanwhile, wages for the average worker have risen 2.5% the past 12 months, while the consumer price index is up 2.2%. Just a 0.3% gain. tweet \nAlso, even an investment in a bull market isn't perfectly safe. Past performance can't predict future results. And Paul Gambles, managing partner at MBMG Group, points out that concerted worldwide growth was seen during previous financial crises, meaning the current risk to investors is \" exponential .\" \nThe good news is, there's a less risky, affordable alternative to investing in stocks, one that lets you participate in gains while minimizing your chances of loss: Investing in index funds. It's a particularly good option for young people, who tend to be wary of entering the stock market after growing up during the financial crisis, because it offers a low-stress way to put your money to work. \nBerkshire Hathaway chairman and CEO Warren Buffett is a fan . \"Consistently buy an S&P 500 low-cost index fund,\" the legendary investor told CNBC's On The Money . \"I think it's the thing that makes the most sense practically all of the time.\" show chapters 12:43 PM ET Tue, 13 Dec 2016 | 00:56 \nIndex funds hold every stock in an index such as the S&P 500, including big-name companies such as Apple, Microsoft and Google. Because this type of fund is highly diversified, it stays relatively constant and avoids the risk that comes with picking individual stocks. \nPlus, the fees tend to be low as well. \nThe largest S&P 500 fund, Vanguard's 500 Index Fund, has an expense ratio of less than a percentage point , and as Buffett points out, \"Costs really matter in investments. If returns are going to be seven or eight percent and you're paying one percent for fees that makes an enormous difference in how much money you're going to have in retirement.\" \nIn short, when it comes to investing your money, don't be a stock picker. Go with low cost index funds. \"The trick is not to pick the right company,\" Buffett says. \"The trick is to essentially buy all the big companies through the S&P 500 and to do it consistently.\"", "external_links": [], "published": "2018-01-05T19:44:00.000+02:00", "crawled": "2018-01-05T20:00:59.013+02:00", "highlightTitle": ""}