{"organizations": [], "uuid": "ada92e7a1888cd05a40a0a3ee6586286b8aad714", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222769021&w=1200&r=LYNXMPEE0G18T", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-ecb-president/two-year-race-for-top-ecb-jobs-start-next-week-idUSKBN1F623H", "country": "US", "domain_rank": 408, "title": "Two-year race for top ECB jobs start next week", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-01-18T00:10:00.000+02:00", "replies_count": 0, "uuid": "ada92e7a1888cd05a40a0a3ee6586286b8aad714"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-ecb-president/two-year-race-for-top-ecb-jobs-start-next-week-idUSKBN1F623H", "ord_in_thread": 0, "title": "Two-year race for top ECB jobs start next week", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "none"}, {"name": "draghi", "sentiment": "none"}, {"name": "jens weidmann", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "bundesbank", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT/BRUSSELS (Reuters) - Euro zone officials could pick a new European Central Bank vice president within weeks, kicking off two years of flux at the top of one of Europe’s most vital institutions and previewing a tussle to replace ECB chief Mario Draghi in 2019.\nGermany is seen as eager to claim the presidency at last, two decades after the ECB’s creation, but the hawkish views of its obvious candidate, Bundesbank chief Jens Weidmann, will count against him in some member states, euro zone sources say.\nAlso, women seem unlikely to claim either of the two top jobs in a male-dominated institution, and whatever the outcome, the reshuffle must be conducted alongside the delicate task of raising interest rates and unwinding a 2.55 trillion euro money-printing program without provoking an upheaval on markets.\nHaving played a leading role in fighting off the euro zone’s debt crisis, the ECB has been a pillar of the bloc’s five-year economic recovery and changes in its executive and supervisory boards could test its role as an anchor of trust in European Union institutions.\nDraghi relied on the ECB’s - and his own - credibility in 2012 when he promised to do ‘whatever it takes’ to preserve the euro. Then three years later he presided over the launch of the scheme to stimulate growth by flooding the financial system with cash via bond purchases.\nIn doing this, he was arguably the key figure in holding the 19-member currency bloc together in its darkest hour. When the Italian completes his non-renewable, eight-year term in November 2019, his successor will be in the spotlight from day one.\nFirst to go at the bank will be Vice President Vitor Constancio of Portugal in May, followed next year by bank supervisor Daniele Nouy, chief economist Peter Praet, Draghi himself, and executive board member Benoit Coeure.\nFinance ministers will launch the process to choose a new vice president on Monday and may make a decision in February. This could offer clues about political positions in the contest to replace Draghi, euro zone officials told Reuters.\nSpanish Economy Minister Luis de Guindos, so far the only publicly known candidate, is favorite for the number two job. With EU spoils shared around the regions, selecting a southern European would signal that Draghi’s job will go to northern Europe, possibly Germany, the officials, who asked not to be named, said.\nOne source noted that the chair of the euro zone finance ministers’ group has just passed to a Portuguese.\n“Southern Europe got the Eurogroup presidency so if they also get Constancio’s job, then Draghi’s position would have to go north to keep the regional balance,” the source said. “Then, it’s likely to be France and Germany fighting it out.”\nGERMANS Picking the Bundesbank chief for the ECB presidency may be tricky, even though Germany is Europe’s biggest economy and Weidmann is considered a top-notch central banker.\nHe has alienated some officials with his opposition to the ECB’s ultra easy monetary policy, which is credited with reviving economic growth. Some regarded this as disloyalty in a time of crisis.\nFILE PHOTO: Spain's acting Economy Minister Luis de Guindos arrives at the Spanish parliament in Madrid, Spain April 19, 2016. REUTERS/Andrea Comas/File Photo The ECB has to follow the U.S. Federal Reserve in unwinding that policy and raising rates from record lows without major dislocation.\nWeidmann has also ruffled some political feathers, engaging in public exchanges with former Italian prime minister Matteo Renzi by criticizing Rome’s performance in cutting its debt.\nAfter joining the losing side in the ECB’s biggest decisions to stimulate the economy, Weidmann could also struggle to unite the Governing Council, which rarely takes votes and strives for the broadest possible consensus.\n“De Guindos is a done deal (for the vice presidency),” another source said. “But while Germany might have a claim on the Draghi job, Weidmann is considered too hawkish. So some people say a German ‘yes’, but Weidmann ‘no’,” a further euro zone official said.\nFILE PHOTO: European Central Bank (ECB) President Mario Draghi addresses the European Parliament's Economic and Monetary Affairs Committee in Brussels, Belgium November 20, 2017. REUTERS/Yves Herman/File Photo That would leave Berlin with three options: fight for Weidmann, select another German or give up the ECB and seek top jobs at the European Commission. The positions of the president, foreign policy chief and economic and monetary affairs chief all come up next year.\nOther Germans touted by analysts and euro zone sources as potential candidates include European Stability Mechanism managing director Klaus Regling, university professor Volker Wieland and Marcel Fratzscher, the head of economic research institute DIW Berlin.\nWeidmann has often said that a discussion about succession was premature and nationality should not affect the decision. No candidate has publicly expressed interest in Draghi’s job.\nFRANCE? French central bank chief Francois Villeroy de Galhau, a German speaker with extensive ties to Germany, is also a potential candidate to replace Draghi. Villeroy is seen as acceptable to German Chancellor Angela Merkel but France has already occupied the ECB presidency, meaning he would face an uphill battle.\nIn a possible compromise, Dutchman Jeroen Dijsselbloem, the outgoing Eurogroup head, could also be considered, some of the sources said.\nAnother factor is the dearth of high ranking female policymakers. Only two women serve on the 25-member rate-setting Governing Council and one of them, Sabine Lautenschlaeger, would have to quit if a fellow German replaced Draghi. This would be to avoid having two people from the same country sitting on the executive board.\nLautenschlaeger, a specialist in bank regulation, could not take the top job either as under ECB rules, the president must come from outside the board on which she already sits.\nPossible women that may be considered for board seats include Irish central bank Deputy Governor Sharon Donnery, Italian economist Lucrezia Reichlin or France’s Sylvie Goulard.\nThe ECB also needs a new chief economist next year with Irish central bank chief Philip Lane and Estonia’s Ardo Hansson mentioned as potential candidates. In a nod to smaller member states, Finland’s Olli Rehn - widely seen as a successor to central bank chief Erkki Liikanen - could be considered for a board position, the sources said.\nAdditional reporting by Noah Barkin, Francesco Canepa and Frank Siebelt; editing by David Stamp\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T00:10:00.000+02:00", "crawled": "2018-01-18T16:07:15.024+02:00", "highlightTitle": ""}