{"organizations": [], "uuid": "5ac9bef3a360be99b8c71bad50a29f4ab5c63a89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226592347&w=1200&r=LYNXMPEE0T0SB", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-britain-brexit-breakingviews/breakingviews-brexit-leak-nudges-uk-towards-softer-withdrawal-idUSKBN1FJ1NQ", "country": "US", "domain_rank": 408, "title": "Breakingviews - Brexit leak nudges UK towards softer withdrawal", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T20:34:00.000+02:00", "replies_count": 0, "uuid": "5ac9bef3a360be99b8c71bad50a29f4ab5c63a89"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-brexit-breakingviews/breakingviews-brexit-leak-nudges-uk-towards-softer-withdrawal-idUSKBN1FJ1NQ", "ord_in_thread": 0, "title": "Breakingviews - Brexit leak nudges UK towards softer withdrawal", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "buzzfeed", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters breakingviews", "sentiment": "neutral"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters Breakingviews) - The UK government’s latest leak will nudge the country towards a softer Brexit. State papers reportedly show the country will lose in every scenario after it leaves the European Union. Sadly for anti-Brexiteers, the upshot looks like a less abrupt schism than a wholesale U-turn.\nThe paper, reported by Buzzfeed but not yet released, will sharpen the debate over how the UK leaves the European Union. It chronicles three scenarios: a soft Brexit whereby the UK stays in the single market and preserves existing supply chains and market access; a hard one featuring only a trade deal on goods; and no deal at all. The three scenarios would mean lower growth of 2 percent, 5 percent and 8 percent respectively over 15 years relative to current forecasts.\nThose scenarios exclude the “deep and special” relationship that Theresa May’s government hopes to strike, which assumes a deal on both goods and services. Yet the implication remains grim: even if she can get such a deal, UK growth would still suffer a hit of anywhere between 2 and 5 percent.\nThe papers will fuel tensions within the Conservative Party and government. The party is split between ardent Brexiteers who advocate merely a trade deal with Europe, and those arguing for closer regulatory alignment, or even membership of the single market. Brexiteers will see it as an attempt to stop withdrawal by a Europhile civil service.\nThat still looks unlikely. Public opinion is not easily swayed by technical reports. And the conclusions of the government paper are not radically different to other negative reports done by third parties. The OECD predicted declines of between 2.7 percent and 7.5 percent relative to forecasts by 2030.\nYet the report may help shape the kind of Brexit that happens. Theresa May will increasingly struggle to make an optimistic case in Parliament for leaving the single market and customs union if her own analysis rubbishes it. It may meanwhile make it easier for the Labour Party to advocate staying closer to Europe.\nThe report also makes May vulnerable. She chose to advocate leaving the single market and customs union. Since then her popularity has fallen after a disastrous election. If she falls, her vision of Brexit – if it can be called that – may also die.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-30T20:34:00.000+02:00", "crawled": "2018-01-30T16:31:20.021+02:00", "highlightTitle": ""}