{"organizations": [], "uuid": "515de3644cb28f7c3f8d5fbf2a74ede1c12a74f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104974578-GettyImages-911834608r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/state-of-the-union-still-choice-between-trump-economy-and-character.html", "country": "US", "domain_rank": 767, "title": "State of the Union: Still choice between Trump economy and character", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.155, "site_type": "news", "published": "2018-01-30T17:18:00.000+02:00", "replies_count": 0, "uuid": "515de3644cb28f7c3f8d5fbf2a74ede1c12a74f7"}, "author": "Ravin Gandhi", "url": "https://www.cnbc.com/2018/01/30/state-of-the-union-still-choice-between-trump-economy-and-character.html", "ord_in_thread": 0, "title": "State of the Union: Still choice between Trump economy and character", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "donald j. trump", "sentiment": "none"}, {"name": "david brooks", "sentiment": "none"}], "locations": [], "organizations": [{"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "On Tuesday evening President Donald Trump will deliver his first official State of the Union address. Given how polarizing our president has become, personal reaction to this speech will likely depend on where you fall on the continuum between judging Trump on his personal character and his economic policies.\nThough this is a very complex, \"lightning rod\" issue, I believe there are four broad categories of people that help explain how we all, including my CEO peers, think about the president's first year.\nCategory 1: Trump is a racist and thus disqualified The first category of people comprises those who believe (to Quote: the New York Times' conservative columnist David Brooks) that racially tinged conflict has been the defining feature of the Trump era, and that our president has intentionally and unforgivably picked at the nation's wounds. There are many business leaders in this category, like myself, who have spoken out because we feel that Trump's character is miles beneath the dignity of the Oval Office.\nPeople in this first group may actually agree with a few of Trump's economic policies, but we still believe that America will be far better off once he's gone, because racial equality (or just not undoing the progress we have made) is too important given our nation's history. Category 1 people know their opinion is not widely shared in the business community and understand that there are many who disagree with us for any number of reasons, which brings us to the second group.\nCategory 2: Trump is a racist, but the economy absolves him A good number of my Republican friends think Trump is a boorish blowhard. Some acknowledge he's obviously racist and find his behavior appalling. But instead of focusing on this negative, many of these people instead cite current economic data — record stock market levels, lowered tax rates, low unemployment, strong GDP growth, higher bonuses, job growth and massive deregulation — as evidence that Trump is great for the economy.\nWhile this is highly debatable, especially for the middle and lower economic class, that's not the point. The point is that conversations about Trump's sympathy to white supremacists are transformed into celebrations of growing bank accounts, and a tacit acknowledgment that a booming economy absolves Trump's sins, even those that touch (in my opinion) third-rail issues of American character.\nshow chapters Here's what to expect from Trump's big State of the Union speech 2:40 PM ET Mon, 29 Jan 2018 | 04:30 What's fascinating to me is some of these people are my best friends — wonderful humans with not a racist bone in their bodies. Yet they choose to ignore Trump's retrograde rhetoric because it doesn't impact them personally — most of them have never experienced discrimination first-hand and believe that if you get the economy right, social ills magically \"work themselves out.\"\nWhen I try and guilt my friends in this group with Martin Luther King's famous Quote: , \"The greatest tragedy was not the strident clamor of the bad people, but the appalling silence of the good people,\" they reject progressive economic policies because they are self-avowed fiscal conservatives. When I ask about profligate spending of both George W. Bush and Trump, we order cocktails and agree to disagree.\nCategory 3: Trump is not a racist I also have friends and many acquaintances I respect that don't believe that Trump is a bigot, period.\nWhen they read that Trump has been besieged with race discrimination allegations throughout his career, they cite media bias and don't believe \"fake news.\" When confronted with the fact that Trump rose to political prominence touting the insidious birther rumor about President Obama, they say politics is a full contact sport — If you can't take the heat, get out of the kitchen.\nCalling all Mexicans rapists and drug dealers? That's just how Trump talks — you know he really didn't mean that. Sympathizing with neo-Nazis in Charlottesville? He has a Jewish son-in-law and grandkids, for God's sake, so how could he be antisemitic? Plus, he's been very pro-Israel since taking office. And the evangelicals love him, and Lord knows they'd never support a racist.\nWhat I notice about Category 3 people is (besides consuming copious quantities of right wing punditry), they instantly turn any discussion about race into a debate between conservative vs. liberal economic policies, which while intellectually stimulating, changes the subject to something far less awkward. And even though I am an entrepreneur who has started and sold companies for the last 20 years and who is known as an extreme capitalist in my professional life, surreally I get accused of being a \"socialist\" because I can live with certain progressive economic policies.\nCategory 4: Trump is a racist, but I (secretly) like it These people fill my social media feed, and from them I've learned Trump wins because snowflakes and limousine liberals like me are out of touch with what \"real\" Americans think. To Quote: them: Does it bother me that he calls all African countries \"shitholes\"? Hell, no — have you been to these places? And I love that Trump supports Confederate monuments — they are a reminder of our heritage, and they remind minorities to appreciate America, a country founded by brilliant white men (let me guess, now it's racist to cite facts, right?). I drive through the ghetto, I see all these black guys sitting around on the corner. Why can't they stay out of jail? I love that Trump is tough on these criminals who are milking our system dry. And don't lecture me about Trump's sex crimes when we know what President Clinton did in the Oval Office (physically and financially).\nAlso, rampant immigration is killing America. If I have to hear another language spoken on the bus, I am going to vomit. By the way, have you seen what's happening in Western Europe? I know Trump's economic policies only benefit the rich, but the rich are the ones creating all the jobs. In America, if you're willing to work hard, you can make it, and I am sick of hearing minorities and lazy people complain about how the system is rigged against them.\nI am proud of Trump for picking fights with every African-American pro athlete who doesn't stand for the National Anthem. In school I learned that slavery ended in 1865, and we just had an African-American president, so racism is dead. So go to hell because Sean Hannity and Rush Limbaugh tell me identity politics are divisive and for losers? In fact, you're the real racist.\n— By Ravin Gandhi, founder and CEO of GMM Nonstick Coatings , one of the world's largest suppliers of nonstick coatings to the $9 billion housewares industry. As a VC investor, Gandhi has stakes in KeyMe , Ampsy , Tred , Lettrs , Amber Agriculture and Hester Biosciences .", "external_links": [], "published": "2018-01-30T17:18:00.000+02:00", "crawled": "2018-01-30T17:17:41.002+02:00", "highlightTitle": ""}