{"organizations": [], "uuid": "ceee3f525937cb25d39967659e5d13a9c63d0846", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221139407&w=1200&r=LYNXMPEE0A10U", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-shell-gaza-gas/too-hot-to-handle-shells-gaza-gas-field-sale-hits-problems-idUSKBN1F01Q1", "country": "US", "domain_rank": 408, "title": "Too hot to handle? Shell's Gaza gas field sale hits problems", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T21:38:00.000+02:00", "replies_count": 0, "uuid": "ceee3f525937cb25d39967659e5d13a9c63d0846"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-shell-gaza-gas/too-hot-to-handle-shells-gaza-gas-field-sale-hits-problems-idUSKBN1F01Q1", "ord_in_thread": 0, "title": "Too hot to handle? Shell's Gaza gas field sale hits problems", "locations": [], "entities": {"persons": [], "locations": [{"name": "gaza", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "mediterranean", "sentiment": "none"}, {"name": "gaza strip", "sentiment": "none"}, {"name": "gaza marine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "shell", "sentiment": "negative"}, {"name": "royal dutch shell", "sentiment": "negative"}, {"name": "bg group", "sentiment": "none"}, {"name": "palestinian authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - It may prove to be Royal Dutch Shell’s hardest sell. The Anglo-Dutch group is struggling to find a buyer for its gas field off the Gaza Strip, even among energy companies long used to dealing with projects fraught with political and security risks.\nAt least one European company has shown interest in the undeveloped Gaza Marine field following a reconciliation deal in October between the two rival Palestinian factions, a source involved in the talks said.\nBut the firm’s discussions over the field, located about 30 km (20 miles) off the Gaza coast, have ground to a halt since tensions in the wider region have taken a fresh turn for the worse, the source told Reuters.\n“Until the political situation is resolved I really can’t see anything happening here,” he said.\nGaza Marine has long been seen as a golden opportunity for the cash-strapped Palestinian Authority to join the Mediterranean gas bonanza, providing a major source of income to reduce its reliance on foreign aid.\nShell became the field’s main shareholder and operator when it acquired BG Group in 2016 for $54 billion. Since announcing the BG purchase the previous year, Shell has sold around $25 billion in assets to reduce its debt, and hopes to reach $30 billion by the year-end.\nAccording to two industry sources, Shell is currently in talks with the Palestinian Investment Fund (PIF) to find a buyer for the energy giant’s 55 percent stake in Gaza Marine.\nBoth Shell and PIF, which is running the sale process and itself holds a minority stake, declined to comment.\nPlans to develop the field - estimated to hold over 1 trillion cubic feet (tcf) of natural gas, the equivalent of Spain’s consumption in 2016 - were put off several times over the past decade. The delays were due to internal Palestinian rivalry and conflict with Israel, as well as economic reasons, industry sources and former BG employees told Reuters.\nThen the mainstream Fatah party of Palestinian President Mahmoud Abbas signed the reconciliation deal with Hamas, an Islamist movement which seized control in Gaza a decade earlier.\nThis allowed the internationally-recognized Palestinian government to take office in Gaza, and PIF chairman Mohammad Mustafa said after the deal that efforts were underway to revive the Gaza Marine project as soon as possible.\nTRUMP However, a flaring of violence on the occupied West Bank since U.S. President Donald Trump recognized Jerusalem as Israel’s capital last month has highlighted the risks involving the project, the source involved in the talks said.\nGaza Marine, discovered at the end of the last century, lies between two rapidly expanding gas hubs in Egypt and Israel, both of which have attracted huge investments in recent years.\nThe development of Gaza Marine, though relatively small compared with the giant Eni-operated Zohr field in Egypt or Noble Energy’s Leviathan field in Israel, is estimated to cost around $1 billion.\nGas from the field would run power stations in Gaza and the West Bank town of Jenin, and could even be delivered to neighboring Jordan. “It is a field with a lot of potential if we could unlock its value,” one source said.\nAttempts to develop the field were put on hold repeatedly after Hamas, which Western countries and Israel have designated as a terrorist group, took control over the Gaza Strip in 2007.\nIsrael then put an economic blockade on Gaza, raising questions about the financing of the project and the sharing of future profits among the Palestinians. This made any progress with the development impossible, according to a former senior BG employee.\nIsrael has, however, said in the past it supports the field’s development.\n“Gaza Marine has not only an economic dimension, it also has a strategic dimension and diplomatic considerations,” Major-General Yoav Mordechai, the top Israeli army liaison officer with the Palestinians, told Reuters.\n“But its operation is a question of the geopolitical situation. Certainly not with Hamas there. Certainly not in the absence of diplomatic arrangements. Because it is a dramatic energy source,” Mordechai said.\nShell is unlikely to go ahead with the development of the field in the foreseeable future, according to several sources. The company is also weighing the future of its large gas facilities in neighboring Egypt, which it likewise acquired from BG.\nAdditional reporting by Nidal Al Mughrabi in Gaza City, Ari Rabinovitch in Jerusalem; editing by David Stamp\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T21:38:00.000+02:00", "crawled": "2018-01-11T16:57:16.018+02:00", "highlightTitle": ""}