{"organizations": [], "uuid": "b719ae7c1a6df88d035c74d338ba6e3c15c5f810", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221475843&w=1200&r=LYNXMPEE0B14O", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-trump-immigration-reaction/africa-calls-trump-racist-after-shithole-remark-idINKBN1F11V9", "country": "US", "domain_rank": 408, "title": "Africa calls Trump racist after \"shithole\" remark", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T17:13:00.000+02:00", "replies_count": 0, "uuid": "b719ae7c1a6df88d035c74d338ba6e3c15c5f810"}, "author": "", "url": "https://in.reuters.com/article/usa-trump-immigration-reaction/africa-calls-trump-racist-after-shithole-remark-idINKBN1F11V9", "ord_in_thread": 0, "title": "Africa calls Trump racist after \"shithole\" remark", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "chris mfula", "sentiment": "none"}, {"name": "erna solberg", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ed stoddard", "sentiment": "none"}, {"name": "jessie duarte", "sentiment": "none"}], "locations": [{"name": "africa", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "east room of the", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "ernst  sources", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 3:17 PM / in 6 minutes Africa calls Trump racist after 'shithole' remark Reuters Staff \n(Note language that may offend some readers) \nBy Ed Stoddard and Chris Mfula \nJOHANNESBURG/LUSAKA (Reuters) - African politicians and diplomats labelled   Trump a racist on Friday after he was reported to have described some immigrants from Africa and Haiti as coming from “shithole” countries. \nTrump reportedly made the remarks at a White House meeting on immigration on Thursday and a U.S. senator who attended the gathering said on Friday that the president used “vile, vulgar” language, including repeatedly using the word “shithole.” \nTrump denied on Friday using such derogatory language, but he was widely condemned in many African countries and in Haiti and El Salvador, and by international rights organisations. \n“Ours is not a shithole country and neither is Haiti or any other country in distress,” Jessie Duarte, the deputy secretary general of South Africa’s ruling African National Congress told reporters at a news conference in East London. \n“We would not deign to make comments as derogatory as that about any country that has any kind of socio-economic or other difficulties,” Duarte said, adding that much like their African counterparts, millions of U.S. citizens were affected by problems such as unemployment. \nBotswana’s foreign ministry summoned the U.S. ambassador in protest and called the comments “highly irresponsible, reprehensible and racist.” \nIn a statement it said it had asked the U.S. government, through its ambassador, to “clarify” if the derogatory remark also applied to Botswana given that there were Botswana nationals living in the United States and others who wished to go there. \nSenegal’s foreign ministry also called in the U.S. ambassador in Dakar to demonstrate its displeasure, a U.S. State Department official said. \nThe African Union (AU), an organisation which promotes cooperation on the continent, said it was alarmed by Trump’s “very racist” comments. \n“Given the historical reality of how African Americans arrived in the United States as slaves, and the United States being the biggest example of how a nation has been built by migration - for a statement like that to come is particularly upsetting,” AU spokeswoman Ebba Kalondo said. \nThe AU’s mission in Washington expressed its “infuriation, disappointment and outrage” at the comment and demanded a retraction as well as an apology. \nIn Haiti, on the eighth anniversary of a devastating earthquake that killed about 220,000 people, the government also summoned the top U.S. diplomat for an explanation, while the Haitian ambassador to Washington called for an apology.   Trump holds a joint news conference with Norwegian Prime Minister Erna Solberg in the East Room of the White House in Washington, U.S., January 10, 2018. REUTERS/Jonathan Ernst \n“Haitians don’t deserve such treatment,” said Ambassador Paul Altidor. “Haitians should not be seen as a bunch of immigrants who come to the United States to exploit U.S. resources.” \nSpecial status given to about 59,000 Haitian immigrants, that has protected them from deportation following the 2010 earthquake, will end next year following a Trump administration ruling last month. \nEl Salvador, also facing an end to protected status for its 200,000 citizens living in the United States, sent a formal letter of protest to the U.S. government over the comments. \nEl Salvador’s foreign ministry said the U.S. president had “implicitly” accepted the use of “harsh terms detrimental to the dignity of El Salvador and other countries.” \n‘HARSH AND OFFENSIVE’ \nSince taking office a year ago, Trump has pursued controversial policies aimed at curbing immigration into the United States as part of a hard-line “America First” agenda. \nTrump said on Twitter on Friday he merely used “tough” language when discussing a new immigration bill with a group of U.S. senators. \nHe said the bill was a step backwards because it would force the United States “to take large numbers of people from high crime countries which are doing badly”. \nThe Trump administration has spoken little about how it wants to engage with African countries, focusing its foreign policy instead on issues like North Korea and Islamic State. \nOn the streets of Lusaka, capital of the southern African country of Zambia, Trump’s reported remark reinforced long-held views about the U.S. leader. \n“Trump has always been a racist, only a racist can use such foul language,” said Nancy Mulenga, a student at the University of Zambia. \nRetired Ethiopian long-distance runner Haile Gebrselasse, who won his first 10,000 Olympic gold medal in the U.S. city of Atlanta in 1996, told Reuters Trump’s comments did not reflect the views of all Americans. \nThe United Nations human rights office said it had no doubt Trump’s remarks were “racist,” while the Vatican newspaper branded them as “particularly harsh and offensive.” \n“You cannot dismiss entire countries and continents as ‘shitholes’, whose entire populations, who are not white, are therefore not welcome,” said U.N. human rights spokesman Rupert Colville. Reporting by Ed Stoddard in East London, Chris Mfula in Lusaka and Aaron Maasho in Addis Ababa, Eric Beech, Arshad Mohammed and Warren Strobel in Washington; Writing by Alexander Winning in Johannesburg and Mary Milliken in Washington; Editing by Peter Graff and James Dalgleish", "external_links": [], "published": "2018-01-12T17:13:00.000+02:00", "crawled": "2018-01-12T17:45:01.001+02:00", "highlightTitle": ""}