{"organizations": [], "uuid": "bfa00a333cc81a88a6fff4009213d642ac4e35f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/football-nfl-phi-min-recap/underdog-eagles-overpower-vikings-to-win-nfc-crown-idUSMTZEE1MXS604G", "country": "US", "domain_rank": 408, "title": "Underdog Eagles overpower Vikings to win NFC crown", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T11:07:00.000+02:00", "replies_count": 0, "uuid": "bfa00a333cc81a88a6fff4009213d642ac4e35f4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/football-nfl-phi-min-recap/underdog-eagles-overpower-vikings-to-win-nfc-crown-idUSMTZEE1MXS604G", "ord_in_thread": 0, "title": "Underdog Eagles overpower Vikings to win NFC crown", "locations": [], "entities": {"persons": [{"name": "vikings", "sentiment": "negative"}, {"name": "jason kelce", "sentiment": "none"}, {"name": "legarrette blount", "sentiment": "none"}, {"name": "carson wentz", "sentiment": "none"}, {"name": "nick foles", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}, {"name": "lincoln financial field", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "underdog eagles", "sentiment": "negative"}, {"name": "philadelphia eagles", "sentiment": "negative"}, {"name": "nfc", "sentiment": "negative"}, {"name": "patriots", "sentiment": "none"}, {"name": "vikings", "sentiment": "none"}, {"name": "atlanta falcons", "sentiment": "none"}, {"name": "minnesota vikings", "sentiment": "none"}, {"name": "eagles", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA -- Embracing their underdog standing, the Philadelphia Eagles will get to play the role once more, in the Super Bowl.\nNick Foles tossed three touchdown passes, and the Eagles scored 38 unanswered points en route to a 38-7 win over the Minnesota Vikings in the NFC Championship Game on Sunday at Lincoln Financial Field.\nLeGarrette Blount rushed for a touchdown, the Philadelphia defense forced two turnovers, and the Eagles advanced to the Super Bowl for the first time since the 2004 season, when they lost the title to the New England Patriots.\nThe Eagles will face the Patriots once again with a chance at a Super Bowl championship, this time on Feb. 4 in Minneapolis.\nDespite being the No. 1 seed in the NFC playoffs, the Eagles were home underdogs both last week against the Atlanta Falcons and Sunday against the Vikings.\n“I don’t think many people had us in the Super Bowl before the season started,” Eagles center Jason Kelce said. “When the injuries started piling up, people didn’t have us there. When (quarterback) Carson Wentz got injured? Doubt anyone had us penciled in. We made it. We’re a team in every way. It feels so great, man.”\nThe Eagles will aim for the first Super Bowl title in franchise history. Before falling to the Patriots in Super Bowl XXXIX, they lost to the Oakland Raiders in Super Bowl XV following the 1980 season.\nThe Vikings, meanwhile, dropped their sixth consecutive NFC Championship Game appearance.\nMinnesota had been in search of its first trip to the Super Bowl since the 1976 season.\n“I‘m going to take this feeling, bottle it up and make sure it doesn’t happen again,” Vikings quarterback Case Keenum said.\nFoles connected on a 41-yard touchdown with Torrey Smith on a flea flicker on the first drive of the third quarter as the Eagles extended their lead to 31-7.\nAlshon Jeffery caught made his second touchdown catch of the game, a 5-yarder from Foles, with 14:10 left in the fourth for a 38-7 lead. The Eagles moved 92 yards in 12 plays, and the outcome was sealed.\n“I‘m excited to be going for a Super Bowl with this group of guys,” Blount said. “I love this team. My teammates are the greatest. We stick together through everything and rally around each other. We have one more to go.”\nThe game didn’t start perfectly for the Eagles. Minnesota moved effectively on its opening drive, going 75 yards on nine plays, culminating with a 25-yard touchdown pass from Keenum to Kyle Rudolph with 10:14 left in the first quarter.\n“You have to give those guys credit,” Keenum said of the Eagles’ defense. “This was the best front we’ve faced this year.”\nThe Eagles tied the game at 7 when defensive end Chris Long hit Keenum leading to a Patrick Robinson interception. Robinson returned the pick 50 yards for a score with 6:26 remaining in the first.\nWhen Blount rumbled through the middle for an 11-yard touchdown run with 13:37 remaining in the second, the Eagles went ahead 14-7. The drive covered 75 yards in 12 plays.\nThe Vikings looked to tie the game -- or at least kick a field goal -- late in the first half, but Keenum was sacked by Derek Barnett on third-and-5 from the Philadelphia 16. Long recovered the fumble.\nFoles proved his mettle on the ensuing possession as he tossed a spectacular 53-yard touchdown pass to Jeffery on third-and-10, giving the Eagles a 21-7 lead with 1:09 remaining in the half. Foles was able to move around long enough to be able to deliver the deep pass.\nAfter the defense did its job, the Eagles didn’t run out the clock. They quickly moved down the field and Jake Elliott booted a 38-yard field as time expired for a 24-7 lead at halftime.\nFoles wound up 26 of 33 for 352 yards. Tight end Zach Ertz led the Eagles with eight receptions for 93 yards, while Jeffery had five catches for 85 yards. Jay Ajayi paced the Philadelphia ground game with 73 yards on 18 carries.\nKeenum finished 28 of 48 for 271 yards with one touchdown pass and two interceptions. Running back Jerick McKinnon had 11 receptions for 86 yards and added 10 carries for 40 yards.\n--Field Level Media\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T11:07:00.000+02:00", "crawled": "2018-01-23T18:14:40.000+02:00", "highlightTitle": ""}