{"organizations": [], "uuid": "c3b873492060d8e1791287f78ed9b96f6ef8aa36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-oriana-resources-corporation-and-hut-8-mining-corp-provide-update-on-proposed-qualifying-transaction.html", "country": "US", "domain_rank": 767, "title": "Oriana Resources Corporation and Hut 8 Mining Corp. Provide Update on Proposed Qualifying Transaction", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:00:00.000+02:00", "replies_count": 0, "uuid": "c3b873492060d8e1791287f78ed9b96f6ef8aa36"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-oriana-resources-corporation-and-hut-8-mining-corp-provide-update-on-proposed-qualifying-transaction.html", "ord_in_thread": 0, "title": "Oriana Resources Corporation and Hut 8 Mining Corp. Provide Update on Proposed Qualifying Transaction", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "columbia", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "north america vancouver", "sentiment": "none"}], "organizations": [{"name": "oriana resources corporation", "sentiment": "negative"}, {"name": "mining corp", "sentiment": "negative"}, {"name": "united states oriana resources corporation", "sentiment": "none"}, {"name": "hut 8 mining corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hut 8 Closes First Private Placement for Gross Proceeds of $38.0 Million and Announces Second Private Placement in Preparation for Public Listing\nExclusive Contract between Hut 8 and Bitfury to Create One of the Largest Cryptocurrency Mines in North America\nVANCOUVER, British Columbia--(BUSINESS WIRE)-- Oriana Resources Corporation (TSXV-NEX: OUP.H) (“ Oriana ” or the “ Company ”):\nNOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES\nOriana Resources Corporation (TSXV-NEX: OUP.H) (“ Oriana ” or the “ Company ”), a capital pool company, and Hut 8 Mining Corp. (“ Hut 8 ”), a private corporation incorporated under the Business Corporations Act (British Columbia) (the “ BCBCA ”), are pleased to provide an update with respect to their previously announced business combination and reverse takeover transaction (the “ Proposed Qualifying Transaction ”) and related financing activities, including the closing by Hut 8 on December 20, 2017 of a private placement offering of common shares at a price of $2.50 per common share for gross proceeds of $38.0 million (the “ First Offering ”) and the impending launch by Hut 8, on or about January 15, 2018, of a private placement offering of subscription receipts of Hut 8 (the “ Subscription Receipts ”) at a price of $5.00 per Subscription Receipt for projected gross proceeds of approximately $70.0 million (the “ Second Offering ”).\nIt is anticipated that, prior to the closing of the Proposed Qualifying Transaction (the “ Closing ”), and using the proceeds raised from the First Offering and the Second Offering, Hut 8 will have acquired, or will have executed purchase orders (the “ Purchase Orders ”) in respect of the right to acquire, an aggregate of 57 proprietary BlockBox AC – Air Cooled Mobile Data Centers (the “ BlockBox Data Centers ”) from Bitfury Holding BV (“ Bitfury ”), a corporation incorporated under the laws of the Netherlands, for the purpose of running diverse cryptographic hash functions in connection with the mining of cryptocurrency, such BlockBox Data Centers to be stationed on land leased by Hut 8 in Drumheller, Alberta. The purchase of the BlockBox Data Centers by Hut 8 is made pursuant to a master data center purchase agreement between Hut 8 and Bitfury dated November 29, 2017 (the “ Master Purchase Agreement ”), which agreement establishes an exclusive contractual relationship between the parties for the supply from Bitfury of BlockBox Data Centers within North America. A master services agreement between Hut 8 and Bitfury dated November 29, 2017 provides for a fully-managed service by Bitfury to configure, operate and maintain the BlockBox Data Centers on a 24/7 basis.\nCommenting on the Proposed Qualifying Transaction and the success of the First Offering, Sean Clark, Interim Chief Executive Officer of Hut 8, said: “The figures from our First Offering reflect the market’s excitement for Hut 8. The Proposed Qualifying Transaction is the kind of deal that, until now, has been largely inaccessible to investors. Through our public listing, and our exclusive relationship with Bitfury, we will soon deliver one of the largest cryptocurrency mining operations in North America, backed by the experience of a board of directors that includes seasoned investors like Michael Novogratz and Bill Tai.”\nThe Proposed Qualifying Transaction\nAs previously announced in the news release of Oriana dated December 21, 2017, the Proposed Qualifying Transaction is to be implemented in accordance with the terms and conditions of a letter of intent between Oriana and Hut 8 dated December 21, 2017 (the “ Letter of Intent ”) and the terms of the Definitive Agreement (as defined below). Subject to TSX Venture Exchange (“ TSXV ”) approval, the Proposed Qualifying Transaction will constitute Oriana’s “Qualifying Transaction”, as defined by Policy 2.4 – Capital Pool Companies (“ Policy 2.4 ”) of the TSXV.\nThe parties continue to work towards a definitive agreement for the Proposed Qualifying Transaction (the “ Definitive Agreement ”), which agreement is expected to be signed on or before the closing of the Second Offering, and have made significant progress with respect to due diligence, completion of audited and pro forma financial statements of Hut 8 and the drafting of a filing statement (the “ Filing Statement ”) in accordance with the policies of the TSXV.\nThe Proposed Qualifying Transaction will be structured as a “three-cornered amalgamation” involving Oriana, a wholly-owned subsidiary of Oriana (“ Oriana Subco ”) and Hut 8. On Closing of the Proposed Qualifying Transaction, it is expected that:\nOriana will consolidate all of the then issued and outstanding common shares of Oriana (the “ Oriana Common Shares ”) on the basis of approximately 43 to one (the “ Consolidation ”); Hut 8 and Oriana Subco will be amalgamated under the BCBCA (the “ Amalgamation ”) and continue as one corporation (“ Amalco ”), and Amalco will become a wholly-owned subsidiary of Oriana; Oriana will change its name to “Hut 8 Mining Corp.” (on a post-Closing basis, the “ Resulting Issuer ”); and Each Hut 8 common share (the “ Hut 8 Common Shares ”) will be cancelled, and the former holders of Hut 8 Common Shares will receive one Oriana Common Share for each Hut 8 Common Share held by them.\nThe Resulting Issuer’s business objective will be to carry on the business of Hut 8 by building a leading listed Blockchain company through the development and ownership of cryptocurrency mining infrastructure and other related Blockchain businesses.\nThe final structure for the Proposed Qualifying Transaction is subject to satisfactory tax, corporate and securities law advice on the part of both Oriana and Hut 8, and approval by the TSXV.\nAssuming completion of the Second Offering and the Proposed Qualifying Transaction, the Resulting Issuer will have 83,980,000 common shares outstanding, with the largest shareholder being Bitfury with approximately 43.1%. Oriana shareholders would hold an aggregate of 220,000 common shares of the Resulting Issuer, being approximately 0.3%, and former Hut 8 shareholders would hold an aggregate of 33,600,000 common shares, being approximately 40.0% of such common shares.\nConditional upon completion of the Proposed Qualifying Transaction, the Resulting Issuer will enter into an investor rights agreement with its largest shareholder, Bitfury, pursuant to which, among other things, Bitfury will be entitled to certain customary director nomination and pre-emptive rights. Pre-emptive rights in favour of Bitfury will include the right to subscribe, on a proposed distribution or issuance by the Resulting Issuer, for common shares of the Resulting Issuer (or other securities convertible or exchangeable into common shares of the Resulting Issuer) in order that Bitfury may continue to maintain its pro rata equity ownership interest in the Resulting Issuer. Such pre-emptive rights will terminate in the event that Bitfury’s ownership interest in the Resulting Issuer falls below 10%.\nConditions to Completion of Proposed Qualifying Transaction & Regulatory Matters\nCompletion of the Proposed Qualif", "external_links": ["http://www.businesswire.com/news/home/20180111005243/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sedar.com&esheet=51741610&newsitemid=20180111005243&lan=en-US&anchor=www.sedar.com&index=1&md5=9ef5a957f597d5f74a4a33221a4959de"], "published": "2018-01-11T17:00:00.000+02:00", "crawled": "2018-01-11T19:01:42.040+02:00", "highlightTitle": ""}