{"organizations": [], "uuid": "9fefa216c2a4ec4e4214ea2ea55f79279f2afe4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224128498&w=1200&r=LYNXMPEE0L0Y8", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-sno-mcmorris/mcmorris-just-happy-to-be-back-after-horrific-injuries-idUSKBN1FB1BV", "country": "US", "domain_rank": 408, "title": "McMorris just happy to be back after horrific injuries", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T13:24:00.000+02:00", "replies_count": 0, "uuid": "9fefa216c2a4ec4e4214ea2ea55f79279f2afe4c"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-sno-mcmorris/mcmorris-just-happy-to-be-back-after-horrific-injuries-idUSKBN1FB1BV", "ord_in_thread": 0, "title": "McMorris just happy to be back after horrific injuries", "locations": [], "entities": {"persons": [{"name": "mcmorris", "sentiment": "negative"}, {"name": "craig", "sentiment": "none"}, {"name": "mark mcmorris", "sentiment": "none"}], "locations": [{"name": "whistler", "sentiment": "none"}], "organizations": [{"name": "tarrant", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 11:25 AM / in 13 minutes McMorris just happy to be back after horrific injuries Jack Tarrant 3   list of injuries suffered by Canadian snowboarder Mark McMorris in a freak accident at the end of last season would be enough to put some people off the sport for life. \nRiding in the back country with his brother Craig in March, the then-23-year-old caught an edge as he took off for a jump and spiraled into a tree. \nMcMorris broke his jaw and left arm, ruptured his spleen, suffered a pelvic fracture, rib fractures and a collapsed lung. \nThe injuries were so severe that McMorris feared he might lose his life. \n”I thought it was going to be the end for a long time but luckily all the injuries I was able to come back from. I am very, very blessed to have another chance to go snowboarding,” McMorris told Reuters from Whistler. \nSpeaking about the injuries do bring back a lot of difficult memories for McMorris but they have also given him a different outlook on life. \n“It makes me thankful to be here and to experience everything again and whatever outcome happens it is better than what it could have been,” he said. \n“I have always been thankful to snowboard for a living but now more than ever.” \nMcMorris, who will compete in the slopestyle and big air events at the Olympics in Pyeongchang, admits his sport is dangerous and the injuries he has suffered do make him more worried about going into jumps. \n“I try and keep it out of my mind but definitely it makes me more insecure than I was in the past but over time that goes away, which is chill,” McMorris said. \n“This sport is pretty scary at times, especially when you are pushing for the optimum.” \nMcMorris was speaking to Reuters from Whistler, where he is preparing for the upcoming Winter X Games in Aspen. The event, which runs from Jan. 25-28, will give McMorris the chance to add to his impressive X Games medal haul. \nAt the edge of 24, McMorris has amassed 15 X Games medals, including seven golds. \nThe X Games will see many of the world’s top extreme sports athletes competing for the final time before they head to Pyeongchang for the Olympics. \nFour years ago in Sochi, McMorris battled back from yet another injury – a broken rib – to claim an Olympic bronze medal. \nNow he is focused on gold. \n“It is very surreal to imagine this is my life. It is a pretty dreamy life that I never thought I would get to live,” he said. \n“My dream was just to make it to a pro snowboarding level and then all this other stuff is a bonus.” Reporting by Jack Tarrant, editing by Ed Osmond", "external_links": [], "published": "2018-01-22T13:24:00.000+02:00", "crawled": "2018-01-22T13:45:01.020+02:00", "highlightTitle": ""}