{"organizations": [], "uuid": "f133544eaa3b80e671fc78f5a43c4222f4fbf818", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 190, "shares": 190, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221990937&w=1200&r=LYNXMPEE0D0NV", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-britain-eu-france-exclusive/exclusive-france-expects-uk-to-pay-up-take-more-refugees-to-keep-border-official-idUSKBN1F30YX", "country": "US", "domain_rank": 408, "title": "Exclusive: France expects UK to pay up, take more refugees to keep border - official", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T00:28:00.000+02:00", "replies_count": 0, "uuid": "f133544eaa3b80e671fc78f5a43c4222f4fbf818"}, "author": "", "url": "https://www.reuters.com/article/us-britain-eu-france-exclusive/exclusive-france-expects-uk-to-pay-up-take-more-refugees-to-keep-border-official-idUSKBN1F30YX", "ord_in_thread": 0, "title": "Exclusive: France expects UK to pay up, take more refugees to keep border - official", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "gerard collomb", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "matthias blamont", "sentiment": "none"}, {"name": "min read  paris", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "le parisen", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - France expects Britain to agree to take more asylum seekers and pay more for border security in order to maintain a frontier on the French side of the Channel, a French government official said.\nBritain’s border was extended into France under a 2003 bilateral treaty known as the Le Touquet accord. But a migration crisis and the Brexit vote to leave the European Union have made the arrangement an increasing source of friction.\nThe deal will be on the table on Thursday when President Emmanuel Macron holds talks with British Prime Minister Theresa May at a Anglo-French summit in southern England.\nAsked if concrete announcements are expected at the talks, the source said: “Yes. But is it all finalised? Absolutely not.”\nFrance’s Interior Minister Gerard Collomb, who has taken the lead on talks, was Quote: d by the Le Parisien newspaper on Sunday saying he hoped an “additional protocol” to supplement the Le Touquet accord could be agreed upon.\nHis comments indicated Macron has dropped a campaign promise to renegotiate the Le Touquet accord in full.\n“We’re still negotiating. There is back and forth. Nothing is locked in yet. The British have shaken on nothing but there’s a lot of pressure on them,” said the official familiar with Collomb’s thinking.\nIf no deal can be struck, France could tear up the Le Touquet accord and the two countries would have to reinstate borders on each side of the English Channel, the source said, adding that this was not in the interest of either side.\n“Our understanding is that they will pay more. The question is how much and for what,” said the source, adding that the two sides are in daily contact ahead of the summit.\n“We have let them know of our needs and a figure, we’re talking tens of millions of euros.”\nSome pro-Brexit lawmakers from Britain’s ruling Conservative Party have branded suggestions London pay more as “absurd”.\nMigrant walks past the fence which secures the approach to the city from migrants trying to reach Britain, in Calais, France, September 21, 2016. REUTERS/Pascal Rossignol Britain’s interior ministry said the government was working “closely with the French authorities at all levels to reduce migrant pressures and target criminal gangs involved in people trafficking, both in northern France and further afield.”\nA spokesman for Prime Minister Theresa May told reporters he would not speculate on what discussions would be had on Thursday, but added that Britain had previously provided additional security help to France at the border.\n“This is an agreement which has served both sides well since its inception. I would point out the fact that we have provided help already such as through the provision of extra security fencing.”\nDETENTION CENTER, REPATRIATIONS Macron will travel to Britain two days after visiting the northern port city of Calais, the final stopping point for migrants trying to cross the English Channel.\nCalais has borne the brunt of the migration crisis in France and at its peak up to 10,000 migrants squatted in a sprawling camp dubbed “The Jungle”, before former president Francois Hollande sent in bulldozers.\nParis has complained that it shoulders too much of the financial burden and handles more than its share of asylum cases, while Macron said in 2016 before becoming president that there would be no migrants in Calais if the accord unraveled.\nBritain had paid 140 million euros ($171 million) in the past three years toward border and security infrastructure, but this needed to be increased in the future, the official, who declined to be named, told Reuters.\nOther options included Britain co-financing a detention center for illegal migrants, organizing repatriation flights and assisting with expulsions, the source said.\nFrance is also asking for legal provisions to ensure Britain accepts more refugees, the official said, adding that it could take more unaccompanied minors under the terms of EU rules.\nMacron has come under fire over legislation his government is drafting to speed up the processing of asylum demands and help it expel illegal migrants who do not have a legitimate cause for refugee status.\nReporting by Matthias Blamont, with additional reporting by Elizabeth Piper in London and Richard Lough in Paris; writing by Richard Lough; editing by Ralph Boulton\n ", "external_links": [], "published": "2018-01-15T00:28:00.000+02:00", "crawled": "2018-01-15T00:41:54.021+02:00", "highlightTitle": ""}