{"organizations": [], "uuid": "2fd78d0e3e1d9b96b1804ac29790fc6fb2790cb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-hyundai-motor-america-pr-manager-lori-scholz-named-one-of-pr-news-top-women-in-pr.html", "country": "US", "domain_rank": 767, "title": "Hyundai Motor America PR Manager Lori Scholz Named One of PR News' Top Women in PR", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-24T01:21:00.000+02:00", "replies_count": 0, "uuid": "2fd78d0e3e1d9b96b1804ac29790fc6fb2790cb2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-hyundai-motor-america-pr-manager-lori-scholz-named-one-of-pr-news-top-women-in-pr.html", "ord_in_thread": 0, "title": "Hyundai Motor America PR Manager Lori Scholz Named One of PR News' Top Women in PR", "locations": [], "entities": {"persons": [{"name": "lori scholz", "sentiment": "negative"}, {"name": "lori", "sentiment": "none"}], "locations": [{"name": "pr fountain valley", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "grand hyatt", "sentiment": "none"}], "organizations": [{"name": "hyundai motor america", "sentiment": "negative"}, {"name": "public relations", "sentiment": "none"}, {"name": "hyundai", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FOUNTAIN VALLEY, Calif., Jan. 23, 2018 /PRNewswire/ -- Hyundai Motor America public relations manager, Lori Scholz, has been named to PR News' list of the Top Women in PR . The prestigious, annual award recognizes female executives who have made bold advances in managing crisis, developing brand messages, protecting and building brand reputation and creating content for digital platforms. The PR News' Top Women in PR were celebrated during a luncheon on January 23, 2018 at the Grand Hyatt in New York City.\n\"I'm honored to be recognized among accomplished women that are making strides in the PR industry,\" stated Lori Scholz, manager, Public Relations, Hyundai Motor America. \"It's an exciting time for us at Hyundai and for the public relations industry. I'm thankful for all the support from my colleagues, our agency and press fleet partners and most importantly the media that tell our stories. I look forward to future contributions that can help shape our industry.\"\nThrough Lori's leadership, Hyundai executes media programs throughout the country as part of new product launches, while also ensuring press fleet loans to target media in all U.S. Hyundai regions. These programs and initiatives provide the foundation for earned media placements for Hyundai's broad product line up. Lori began her career with Hyundai over two decades ago working for the executive team, and later Consumer Affairs, and also the Fleet and Remarketing departments. She later found her home in the Public Relations department where she has served for 15 years.\nPR News' Top Women in PR honorees were judged by a blue-chip panel of corporate, agency, nonprofit, and academic executives and evaluated on creativity, innovation, and proven success that aligns with end goals. This year counted one of the highest submissions to date.\nPR News\nThe PR News Group at Access Intelligence, LLC is a go-to source that serves the communications and marketing community at corporations, agencies and nonprofits. With the launch of its weekly newsletter over 70 years ago, PR News has remained dedicated to supporting the growth of communicators all while keeping them abreast of the latest news affecting the industry. For more information, please visit www.prnewsonline.com .\nHyundai Motor America\nHyundai Motor America is focused on delivering an outstanding customer experience grounded in design leadership, engineering excellence and exceptional value in every vehicle we sell. Hyundai's technology-rich product lineup of cars, SUVs and alternative-powered electric and fuel cell vehicles is backed by Hyundai Assurance—our promise to deliver peace of mind to our customers. Hyundai vehicles are sold and serviced through more than 830 dealerships nationwide and the majority sold in the U.S. are built at U.S. manufacturing facilities, including Hyundai Motor Manufacturing Alabama. Hyundai Motor America is headquartered in Fountain Valley, California, and is a subsidiary of Hyundai Motor Company of Korea.\nPlease visit our media website at www.HyundaiNews.com\nHyundai Motor America on Twitter | YouTube | Facebook | Instagram\nView original content with multimedia: http://www.prnewswire.com/news-releases/hyundai-motor-america-pr-manager-lori-scholz-named-one-of-pr-news-top-women-in-pr-300587068.html\nSOURCE Hyundai Motor America", "external_links": ["http://www.youtube.com/hyundai", "http://www.prnewswire.com/news-releases/hyundai-motor-america-pr-manager-lori-scholz-named-one-of-pr-news-top-women-in-pr-300587068.html", "http://www.instagram.com/hyundaiusa", "http://www.prnewsonline.com/go/pr-news-top-women-in-pr-luncheon-2018/#this-years-top-women-in-pr", "http://www.facebook.com/Hyundai", "http://www.prnewsonline.com/", "http://www.hyundainews.com/", "http://twitter.com/hyundai"], "published": "2018-01-24T01:21:00.000+02:00", "crawled": "2018-01-24T01:23:04.004+02:00", "highlightTitle": ""}