{"organizations": [], "uuid": "4ea5adb98cf79e98910ca5d90e75ae98c42ebfab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://allsorce.com/wp-content/uploads/2018/01/16735/gettyimages-843084800.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/sears-holiday-season/", "country": "US", "domain_rank": 1196, "title": "Sears Lines Up $100 Million In New Financing After Holiday Season Bloodbath - Allsorce.com", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.425, "site_type": "news", "published": "2018-01-10T17:32:00.000+02:00", "replies_count": 0, "uuid": "4ea5adb98cf79e98910ca5d90e75ae98c42ebfab"}, "author": "", "url": "http://fortune.com/2018/01/10/sears-holiday-season/", "ord_in_thread": 0, "title": "Sears Lines Up $100 Million In New Financing After Holiday Season Bloodbath - Allsorce.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Phil Wahba 10:05 AM EST \nDespite one of the most favorable environments in years for shoppers, Sears Holdings (shld) has reported disastrous holiday season results. \nThe retailer, which operates the Sears and Kmart chains, said on Wednesday it estimated comparable sales, a metric that excludes the dozens of weak stores it has closed in the last year, fell about 16% to 17% in November and December, continuing a streak of large sales declines. Last week, Sears Holdings announced another 103 closings in yet another round of shutterings in the last few years. \nIts numbers compare to a 4.9% jump in overall retail sales in the United States between Nov. 1 and Dec. 24 according to Mastercard Spending Pulse. And rivals like Macy’s (m) and J.C. Penney (jcp) , which face problems of their own, managed to post sales growth, while Target (tgt) and Kohl’s (kss) managed to blow away the competition. \nOn the bright side, Sears expects a smaller loss for the fourth quarter, which includes the holiday season and January, compared to last year. The company expects a loss of between $200 million and $320 million, excluding charges from closing stores, severance and tax-related matters, an improvement from a loss of $607 million for the same period. \nSears reported its performance at the same time it announced yet another round of financial maneuvers aimed at staving off a cash crunch, the moves this time including $100 million in new financing already committed and another $200 million it is trying to line up. \nThe moves sent shares up 9% in premarket trading but the Sears stock remain about 76% off their 52-week high. \nSuch loans would be supported by ground leases on its real estate and other “select intellectual property,” Sears said. In recent years, Sears has had often to take big steps such as sell off key assets like some of its best stores as well as brands like Kenmore, and borrow money from CEO Eddie Lampert to ward off a financial crunch. \nLampert recognized ongoing worries about Sears among investors and vendors in a blog post. \n“While these actions have so far helped our Company survive the so-called ‘Retail Apocalypse’, many observers are not persuaded that Sears Holdings can be a viable competitor in the long term. It is obvious that to overcome such skepticism and obtain the support of outside lenders and our vendor community – which is crucial to the success of any retailer – we need to undertake further measures.” \nEven fellow CEO’s have been less shy these days about voicing thoughts on Sears’ decline. The CEO of Penney, Marvin Ellison, said last week he was going after Sears’ appliance business , while Lands’ End (le) boss, Jerome Griffith, said on Monday he expects his business at Sears to “go away” eventually . \nSears said it was still working to return to profitability in 2018 and said it had found $200 million of cost savings unrelated to store closures. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-10T17:32:00.000+02:00", "crawled": "2018-01-10T19:09:06.010+02:00", "highlightTitle": ""}