{"organizations": [], "uuid": "17fdb44735b200adef967d2a958c74c05434d544", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-inmobi-acquires-los-angeles-based-aerserv-for-90-million-to-create-worlds-largest-programmatic-video-platform-for-mobile.html", "country": "US", "domain_rank": 767, "title": "InMobi Acquires Los Angeles Based AerServ for $90 Million to Create World's Largest Programmatic Video Platform for Mobile Publishers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.998, "site_type": "news", "published": "2018-01-10T17:00:00.000+02:00", "replies_count": 0, "uuid": "17fdb44735b200adef967d2a958c74c05434d544"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-inmobi-acquires-los-angeles-based-aerserv-for-90-million-to-create-worlds-largest-programmatic-video-platform-for-mobile.html", "ord_in_thread": 0, "title": "InMobi Acquires Los Angeles Based AerServ for $90 Million to Create World's Largest Programmatic Video Platform for Mobile Publishers", "locations": [], "entities": {"persons": [{"name": "inmobi", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "inmobi acquires los", "sentiment": "negative"}, {"name": "inmobi exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 10, 2018 /PRNewswire/ -- InMobi , the world's largest independent mobile advertising platform, today announced the acquisition of AerServ for $90 million in cash and stock to create the industry's first mediation platform with a unified programmatic auction for mobile in-app publishers. This acquisition will enhance monetization for publishers globally and further enhance the InMobi Exchange, a premium mobile programmatic platform.\nGlobally, mobile premium publishers seek greater control over advertising revenue and deeper transparency into both the buyer landscape and pricing than what supply-side platforms offer today. These publishers are looking to further scale their advertising revenue using a best-in-class programmatic exchange, which will bring header bidding into mobile in-app for the first time. Together, InMobi and AerServ's technology will deliver a next-generation platform that goes beyond traditional ad mediation and provides high-quality brand demand, marking the industry's first platform to deliver this combination to publishers worldwide.\nOn the demand side, brand advertisers are in need of transparent programmatic platforms of high-quality ad inventory that can be independently verified. It is expected that two-thirds of the world's digital display advertising will be traded programmatically by 2019 and advertising sold programmatically will increase from US $57.5 billion to US $84.9 billion over the next two years, growing at an average rate of 21 percent a year. Together, InMobi and AerServ boast over 90 percent viewability and over 70 percent video completion rate, more than double the industry benchmark for mobile - helping better meet the demands of today's brand advertisers when it comes to programmatic spend. AerServ has integrations with over 75 DSP's, exchanges and agencies around the world, enhancing InMobi's global footprint and together cover a large majority of the Fortune 500 brand buyers.\nWith this investment, InMobi's video and programmatic business will account for 35 percent of the overall company revenue and will solidify InMobi's leadership position in the mobile video advertising industry in the U.S. InMobi Exchange scale will increase as AerServ runs more than 90 billion ad opportunities each month and provides access to brand programmatic demand to over 2,000 mobile apps.\n\"This acquisition fits in perfectly with our global strategy to bring best-in-class technology for premium publishers and driving mobile programmatic video revenues to them. Our combined entities will double our headcount in the U.S. while establishing a product and tech hub for InMobi in Los Angeles, a hotspot of innovation for media and video content,\" said Abhay Singhal, co-founder and Chief Revenue Officer at InMobi. \"We are two profitable companies combining forces in North America and this will further cement our leadership position in video advertising, enabling us to continue investing heavily.\"\n\"We're excited to join forces with InMobi and grow the mobile advertising and programmatic industry together,\" said Josh Speyer, Chief Executive Officer at AerServ. \"Our decision to embark on this new adventure was made easy by the great partner we have in InMobi, their expertise in the industry and global scale. This will allow us to scale our platforms together across the globe and build a strong business in previously untapped markets such as China and broader APAC.\"\nAbout InMobi\nInMobi is a global mobile advertising platform that specializes in delivering the best ROI for mobile marketers. A mobile-first and mobile-only platform, InMobi has been pioneering the next generation of ad experiences, including video advertising, on the back of deep learning based optimization engines.\nInMobi's platform help brands, performance marketers and app publishers engage mobile users across different stages of their lifecycle, converting each mobile moment into an opportunity to drive engagement and revenue. Recognized by Fast Company as one of The Most Innovative Companies in 2016, InMobi reaches over 1.5 billion unique mobile devices worldwide and is redefining business models for the mobile ecosystem. For more information, visit www.inmobi.com\nAbout AerServ\nAerServ is the leading inventory and audience monetization technology for mobile publishers. AerServ helps thousands of mobile publishers increase revenue through AerServ's ad mediation platform, and increase yield by delivering brand-based ads from the aerMarket ad exchange. AerServ's mediation layer is powered by OpenAuction technology, the industry's first true, comprehensive unified and simultaneous auction. AerServ's entire platform and infrastructure is built with a publisher-first objective and provides best in class support from account managers and software engineers. The company was founded in 2013 and has offices in Irvine, California. Visit AerServ at www.aerserv.com or follow us on Twitter at @AerServ\nMedia Contact:\npr@inmobi.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/inmobi-acquires-los-angeles-based-aerserv-for-90-million-to-create-worlds-largest-programmatic-video-platform-for-mobile-publishers-300580224.html\nSOURCE InMobi", "external_links": ["http://www.aerserv.com/", "http://inmobi.com/", "https://www.zenithmedia.com/programmatic-marketing-forecasts/", "http://www.prnewswire.com/news-releases/inmobi-acquires-los-angeles-based-aerserv-for-90-million-to-create-worlds-largest-programmatic-video-platform-for-mobile-publishers-300580224.html", "http://www.inmobi.com/", "https://www.aerserv.com/", "https://twitter.com/AerServ"], "published": "2018-01-10T17:00:00.000+02:00", "crawled": "2018-01-10T18:49:28.080+02:00", "highlightTitle": ""}