{"organizations": [], "uuid": "7502b4c3ebd4790dee57911708bb0a19a46a26ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-gambia-hiv-justice/ageing-gambians-race-for-justice-over-ex-leaders-fake-aids-cure-idUSKBN1FE043", "country": "US", "domain_rank": 408, "title": "Ageing Gambians race for justice over ex-leader's fake AIDS cure", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-25T09:26:00.000+02:00", "replies_count": 0, "uuid": "7502b4c3ebd4790dee57911708bb0a19a46a26ab"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-gambia-hiv-justice/ageing-gambians-race-for-justice-over-ex-leaders-fake-aids-cure-idUSKBN1FE043", "ord_in_thread": 0, "title": "Ageing Gambians race for justice over ex-leader's fake AIDS cure", "locations": [], "entities": {"persons": [{"name": "ousman sowe", "sentiment": "none"}, {"name": "yahya jammeh", "sentiment": "none"}, {"name": "jammeh", "sentiment": "none"}, {"name": "sowe", "sentiment": "none"}, {"name": "jamme", "sentiment": "none"}], "locations": [{"name": "banjul", "sentiment": "none"}, {"name": "gambia", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BANJUL (Thomson Reuters Foundation) - The president had found a cure for AIDS. That was the news that reached Ousman Sowe, the head of a Gambian AIDS support network, one day in 2007. He was overjoyed.\n“We all went with the hope that we were going to take a drop of some wonderful medication and be cured,” Sowe, 64, a tall man with greying hair, told the Thomson Reuters Foundation in an office outside Gambia’s rundown seaside capital.\nBut he was not allowed to go home after showing up at the state house that day. Gambia’s ex-president Yahya Jammeh forced him to drink herbal concoctions morning and night for seven months until he was declared cured - but in reality, near death.\nJammeh, whose 22-year rule over the tiny West African country was marked by accusations of human rights abuses, fled into exile last year after losing an election.\nNow survivors of Jammeh’s bogus AIDS treatment are doing what once seemed impossible - speaking out about their suffering and pursuing justice against the man who endangered their lives.\nAn estimated 9,000 Gambians, most with HIV, passed through Jammeh’s treatment programs and were forced to give up conventional medicine in favor of his homemade cures, said AIDS-Free World, a U.S.-based charity working with survivors.\nThe fake AIDS treatment not only had grave health consequences for the patients, some of whom died, but hindered real HIV/AIDS prevention efforts in the country, UNAIDS said.\n“There was sort of a blackout of information on HIV, because everything was related to the president’s treatment,” said the U.N. agency’s country director Sirra Ndow.\n“There was the perception that if there was a cure, you didn’t need support.”\nAlthough HIV death rates are falling and treatment rates rising globally, Gambia is trailing.\nIts infection rate - of about two percent - is much lower than many African countries. But only 30 percent of Gambians with HIV were on antiretroviral drugs (ARVs) in 2016, while the target is 90 percent by 2020, according to UNAIDS.\nTHE GLASS HOUSE Sowe and two other outspoken survivors, Fatou Jatta and Lamin Ceesay, are working with lawyers and activists to gather evidence against Jammeh.\nBut all three are in their 50s or 60s and struggling with poor health, discrimination and poverty.\n“We believe they should be compensated, but time is really against us,” said Agasha Tabaro, a legal fellow with AIDS-Free World. “This is a health issue, and it’s urgent.”\nThe patients never knew what Jammeh was feeding them.\nSometimes it came in a bottle, sometimes powdered, sometimes mixed with canned milk or honey. If they sipped the concoctions, he would yell, forcing them to drink it all at once, they said.\n“I would vomit every time,” said Jatta, 51, a social worker who spent nine months in the program after publicly disclosing that she had HIV, the virus that causes AIDS.\nEvery day, Jammeh’s patients were taken to a glass building in the state house complex where the president administered the treatment, they said. They were not allowed to contact their families, or allowed to opt out.\nSometimes the president would rub ointments on their bodies. The sessions were filmed and broadcast on state television.\n“The psychological effect on me was such that after the program I felt it very difficult to integrate again into society,” said Sowe.\nSeverely weakened by Jammeh’s treatment, Sowe and Ceesay went back on ARVs after Jammeh discharged them, and Jatta started taking them. Ceesay’s wife, also in the program, died.\nAfter Jammeh’s treatment program, survivors lost their jobs and struggled to feed their families, they said. They could not escape the fact that their faces had been broadcast on TV.\n“I think their dignity needs to be restored,” said Ndow.\nCeesay, who was the first man in Gambia to openly declare his status, said he has been forced to move houses frequently because landlords evict him when they find out he has HIV.\n“I want my own home for my family,” he said. “That’s what I‘m struggling with now.”\nFIGHT FOR JUSTICE The survivors know that bringing Jammeh to justice may be a far-flung hope. He fled to Equatorial Guinea and it is unclear whether President Teodoro Obiang would extradite him.\nA truth and reconciliation commission is expected to start work in Gambia later this year.\n“It’s not going to be easy to get Jammeh to trial, but it can certainly be done,” said Reed Brody, a U.S. lawyer steering the campaign for victims of alleged rights abuses under Jammeh.\n“As the victims tell their stories and more and more information comes out, the demand for justice could become overwhelming,” he said.\nBrody, nicknamed the “dictator hunter”, helped victims of Chad’s Hissene Habre jail their former president for life last year for war crimes and crimes against humanity.\nBut it was a 17-year battle.\n“Even if the compensation comes when we are not here, it will be for our children,” Jatta said.\nReporting by Nellie Peyton, Editing by Kieran Guilbert and Katy Migiro. Please credit Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T09:26:00.000+02:00", "crawled": "2018-01-25T10:06:34.000+02:00", "highlightTitle": ""}