{"organizations": [], "uuid": "7eaee5f98e4522fe0f4db52b75bcf2889f263357", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/persimmon-outlook/update-1-uk-builder-persimmon-hopes-for-modest-sales-growth-in-2018-idUSL8N1P415D", "country": "US", "domain_rank": 408, "title": "UPDATE 1-UK builder Persimmon hopes for modest sales growth in 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T10:47:00.000+02:00", "replies_count": 0, "uuid": "7eaee5f98e4522fe0f4db52b75bcf2889f263357"}, "author": "", "url": "https://www.reuters.com/article/persimmon-outlook/update-1-uk-builder-persimmon-hopes-for-modest-sales-growth-in-2018-idUSL8N1P415D", "ord_in_thread": 0, "title": "UPDATE 1-UK builder Persimmon hopes for modest sales growth in 2018", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " 47 AM / in 19 minutes UPDATE 1-UK builder Persimmon hopes for modest sales growth in 2018 Reuters Staff \n(Adds details, CEO quotes) \nBy Costas Pitas \nLONDON, Jan 9 (Reuters) - Britain’s second-biggest housebuilder Persimmon hopes to achieve a modest increase in sales this year after saying it expected to beat market expectations on 2017 profits as it sold more homes. \nCEO Jeff Fairburn also defended an incentive plan which could see top management make a profit of more than 200 million pounds ($268 million) on share options, including around 110 million pounds for himself. \nPersimmon is one of several builders in Britain to benefit from years of rising house prices and government incentive schemes, which the sector has been criticised for not building enough affordable housing. \nOn Tuesday, Persimmon reported a 9 percent rise in revenue to 3.42 billion pounds ($4.63 billion) and said its pre-tax profit would be “modestly ahead” of market expectations, which stand at 957 million pounds, according to a Thomson Reuters poll. \nIt said forward sales were up 10 percent at the end of 2017 to 1.35 billion pounds and it hoped for expand further in demand this year. \n“It really largely depends on the number of selling outlets that we can bring through the process and bring onto site as soon as possible so I think broadly similar but aiming for a modest increase,” said Fairburn. \nIn December, Persimmon said its chairman and the head of its pay committee would quit after they failed to curb an incentive plan introduced in 2012 which will allow Fairburn, the firm’s finance director and managing director to jointly gain around 240 million pounds before tax. \nThey are able to sell 40 percent of their share options from the beginning of this year and the remainder can be sold when the next performance target is met, which could be later in 2018. \nFairburn defended the plan on Tuesday but said he had yet to decide whether to exercise his share options at the moment. \n“This was a scheme that was launched at a time where the business was looking to move forward, there were stretching targets,” he told Reuters. \n“Nobody has yet exercised any of those share options. From my own perspective, I have not made a decision and I’ll continue to review that,” he said. $1 = 0.7382 pounds Editing by Kate Holton and Jason Neely", "external_links": [], "published": "2018-01-09T10:47:00.000+02:00", "crawled": "2018-01-09T11:08:34.000+02:00", "highlightTitle": ""}