{"organizations": [], "uuid": "483405c2e810e0d5669627520dd55386716c82a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226985503&w=1200&r=LYNXMPEE0U15U", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-trade-nafta-canada/foreign-ministers-from-nafta-nations-to-meet-in-mexico-friday-idUSKBN1FK28E", "country": "US", "domain_rank": 408, "title": "Foreign ministers from NAFTA nations to meet in Mexico Friday", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-31T23:36:00.000+02:00", "replies_count": 0, "uuid": "483405c2e810e0d5669627520dd55386716c82a6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-trade-nafta-canada/foreign-ministers-from-nafta-nations-to-meet-in-mexico-friday-idUSKBN1FK28E", "ord_in_thread": 0, "title": "Foreign ministers from NAFTA nations to meet in Mexico Friday", "locations": [], "entities": {"persons": [{"name": "david ljunggrenediting", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "luis videgaray", "sentiment": "none"}, {"name": "chizu nomiyama", "sentiment": "none"}, {"name": "chrystia freeland", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}, {"name": "state", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OTTAWA (Reuters) - Canadian Prime Minister Justin Trudeau said in an interview he does not think U.S. President Donald Trump will pull out of NAFTA, despite differences over how to update the trade pact, the Canadian Broadcasting Corp said on Wednesday.\nTrudeau’s comments were among the most positive made by any Canadian official since talks started last year to revamp a $1.2 trillion treaty that Trump calls a disaster.\n“It obviously would be bad if we canceled it, so I don’t think the president is going to be cancelling it,” Trudeau told the CBC in an interview recorded on Tuesday. The CBC released excerpts on Wednesday.\nTrudeau also told the CBC that Canada has multiple contingency plans in the event Washington does announce it plans to withdraw. The Trump administration is demanding big changes to the pact, and this has caused tensions with Canada and Mexico.\nTrump’s trade chief, speaking in Montreal on Monday after the sixth of eight rounds of talks, rejected proposals for unblocking the negotiations but promised to seek quick breakthroughs.\nForeign ministers from the United States, Canada and Mexico will meet in Mexico City on Friday to discuss the talks and other issues, the Canadian government said on Wednesday.\nU.S. President Donald Trump and Vice President Mike Pence (C) are seen behind the reflection of a House chamber railing as Trump delivers his State of the Union address to a joint session of the U.S. Congress on Capitol Hill in Washington, U.S. January 30, 2018. REUTERS/Carlos Barria The talks on renegotiating the 1994 three-party North American Free Trade Agreement began soon after Trump took office a year ago, saying that if it could not be overhauled to better favor U.S. interests and American workers, Washington would pull out of the pact.\nIn his State of the Union speech on Tuesday, Trump said “America has also finally turned the page on decades of unfair trade deals,” but did not mention NAFTA by name.\nSlideshow (2 Images) As recently as Jan. 10, Canadian government sources told Reuters that Ottawa was increasingly convinced the United States would give notice of withdrawal. The news hit stock markets and the Canadian and Mexican currencies.\nAsked about contingency plans, Trudeau said “not only do we have a Plan B, we have a Plan C and D and E and F”. He declined to give details.\n“I think one of the dangers is falling into hypotheticals and chasing rabbits down holes,” he told the CBC.\n“Just know that we have looked at a broad range of scenarios and have an approach that is going to continue to stand up for Canadian jobs while we diversify our markets.”\nCanadian Trade Minister Francois-Philippe Champagne has repeatedly said his “Plan B” is to find more overseas markets. Canada currently sends around 75 percent of all goods exports to the United States.\nReporting by David Ljunggren; Editing by Chizu Nomiyama and Frances Kerry\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T23:36:00.000+02:00", "crawled": "2018-01-31T17:41:30.004+02:00", "highlightTitle": ""}