{"organizations": [], "uuid": "ed41ce81258b3574c60880db95bf73906dfd5eb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/safrica-finmin/update-2-south-african-economy-may-grow-2-percent-in-2018-finance-minister-says-idUSL8N1P62R5", "country": "US", "domain_rank": 408, "title": "UPDATE 2-South African economy may grow 2 percent in 2018, finance minister says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:34:00.000+02:00", "replies_count": 0, "uuid": "ed41ce81258b3574c60880db95bf73906dfd5eb9"}, "author": "", "url": "https://www.reuters.com/article/safrica-finmin/update-2-south-african-economy-may-grow-2-percent-in-2018-finance-minister-says-idUSL8N1P62R5", "ord_in_thread": 0, "title": "UPDATE 2-South African economy may grow 2 percent in 2018, finance minister says", "locations": [], "entities": {"persons": [{"name": "ed stoddard", "sentiment": "none"}, {"name": "mfuneko toyana", "sentiment": "none"}, {"name": "gigaba", "sentiment": "none"}, {"name": "malusi gigaba", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "gigaba", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 2:35 PM / in 23 minutes UPDATE 2-South African economy may grow 2 percent in 2018, finance minister says Reuters Staff \n* Gigaba under pressure to spark recovery, avoid downgrades \n* Economy emerged from recession but sill underperforming \n* Consumer, business confidence key to revival (Adds manufacturing figures, background) \nBy Ed Stoddard and Mfuneko Toyana \nEAST LONDON/JOHNANNESBURG, Jan 11 (Reuters) - South Africa’s economy may grow 2 percent this year if the government takes needed policy decisions, Finance Minister Malusi Gigaba said on Thursday. \nHe did not elaborate on what the decisions were, but dealing with state-owned companies and fiscal consolidations have been highligthed to the government by international credit ratings firms. \nLess than 12 months since his appointment under controversial circumstances, Gigaba is faced with unemployment at record levels, a dire growth outlook and potential credit downgrades deeper into junk territory. \nBut Gigaba said the economy had the means to do far better. \n”The capacity of the South African economy’s growth levels far exceeds the targets that we have set ourselves,“ Gigaba told a business gathering in East London. ”We can even grow at more than 2 percent. \n“There are certain decisions we need to take, and if we take them, the economy can exceed our expectations this year.” \nThe economy slipped into recession in the first quarter of 2017, then recovered in the next two quarters, although it is expected to lag global growth mainly because of policy and political uncertainty. \nGigaba was appointed the country’s third finance minister in two years in March after President Jacob Zuma unexpectedly axed Pravin Gordhan, triggering credit downgrades by all three major agencies and protests by opposition and civil society. \nThen in November S&P Global Ratings cut South Africa’s local currency debt to “junk” status , citing a deterioration in the the economic outlook and public finances. \nMoody’s placed South Africa on review for a downgrade and is due to make a decision by March. \nECONOMIC RECOVERY The lastest moves by the agencies followed Gigaba’s maiden budget speech in October, where he announced a gap much larger than expected in revenues and cut the 2018 growth forecast to 1.1 percent. \n“We need to ensure that Moody’s does not downgrade us in February this year. We will outline a programme to stabilise the debt at the same time as we outline a programme to grow the economy and create jobs,” Gigaba said on Thursday. \nGigaba and many African National Congress leaders who also serve in cabinet are in East London attending a meeting of the party’s top decision-making structure, where it was expected that an early exit for Zuma before his terms ends in 2019 would be discussed. \nData in the past few months suggests the economic recovery is under way, while businessman Cyril Ramaphosa’s election as ANC president has been cheered by investors who believe he will push-through business-friendly policies. \nOn Thursday data showed manufacturing, the fourth largest sector of the economy, expanded for the second month in a row. That follows 11 months of trade surpluses and a strong rebound in agriculture following severe drought. \nEconomists said the combination of higher commodity prices on stronger global demand and rebounds in local agriculture, mining and manufacturing would support improved growth in 2018. \n“For growth to be stronger than the 1 percent we are forecasting for 2018, you have to have the consumer joining the party and a recovery in fixed investment. And these two things are driven by domestic realities and domestic politics,” said senior economist at Nedbank Nicky Weimar. \n“Gigaba will have to deliver on the fiscal side. He’ll need a solid budget that provides a workable solution to all the spending demands. He should now have the political space to do that,” said Weimar. ($1 = 12.4388 rand) Reporting by Mfuneko Toyana and Ed Stoddard; Editing by Joe Brock/Jeremy Gaunt", "external_links": [], "published": "2018-01-11T16:34:00.000+02:00", "crawled": "2018-01-11T16:44:35.005+02:00", "highlightTitle": ""}