{"organizations": [], "uuid": "947856c7db7a4c8b6d4282dee5eaee53117fc2f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-clearlake-capital-acquires-perforce-software.html", "country": "US", "domain_rank": 767, "title": "Clearlake Capital Acquires Perforce Software", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.368, "site_type": "news", "published": "2018-01-10T15:00:00.000+02:00", "replies_count": 0, "uuid": "947856c7db7a4c8b6d4282dee5eaee53117fc2f8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-clearlake-capital-acquires-perforce-software.html", "ord_in_thread": 0, "title": "Clearlake Capital Acquires Perforce Software", "locations": [], "entities": {"persons": [{"name": "clearlake", "sentiment": "none"}, {"name": "janet dryer", "sentiment": "none"}, {"name": "mark ties", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "santa monica", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "clearlake capital", "sentiment": "negative"}, {"name": "clearlake capital group", "sentiment": "none"}, {"name": "summit partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New buy and build platform investment in leading software solution for enterprise scale DevOps teams\nSANTA MONICA, Calif. & MINNEAPOLIS--(BUSINESS WIRE)-- Clearlake Capital Group, L.P. (together with its affiliates, “Clearlake”) today announced that it has acquired Perforce Software (“Perforce” or the “Company”), developer of the industry’s most flexible, scalable and secure version control and collaboration platform, from growth equity investor Summit Partners. The Company will continue to be led by Janet Dryer, CEO, and Mark Ties, COO, who will both join the Board of Directors alongside Clearlake. Financial terms were not disclosed.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180110005235/en/\nPerforce is a leading provider of enterprise scale software solutions to technology developers and development operations (“DevOps”) teams requiring productivity, visibility and scale during all phases of the development lifecycle. Enterprises across the globe rely on its agile project management, developer collaboration, version control and repository management solutions as the foundation for successful DevOps. Perforce is trusted by the world's most innovative brands, including NVIDIA, Pixar, Scania, Ubisoft, and VMware. Headquartered in Minneapolis, MN, with over 225 employees, the Company serves more than 3,000 customers worldwide.\n“Today’s announcement represents another major milestone in our transformation of Perforce,” said Dryer. “Two years ago, we began this journey, and since then we have completed three acquisitions, returned the company to growth, and created a robust portfolio of DevOps-focused solutions adopted by the largest and most demanding enterprise development teams in the world. We thank Summit Partners for this outstanding partnership, and we look forward to working with the Clearlake team as we accelerate into our next phase of growth.”\n“The Perforce team should be proud that all their hard work helped attract this new investment, and we are excited to partner with Clearlake,” said Ties. “We expect Clearlake’s deep software experience and their proven ability to help companies grow will provide invaluable support as we continue to broaden our DevOps solutions, expand internationally, and pursue our acquisition strategy.”\n“We are impressed by the momentum at Perforce under Janet and Mark’s leadership, and we share their excitement that Perforce will serve as an excellent platform for growth, both organically and through acquisition,” said Behdad Eghbali, Co-Founder and Managing Partner, and Prashant Mehrotra, Partner, of Clearlake. “We look forward to leveraging our O.P.S.® approach to support the management team and its many talented employees in continuing to provide best-in-class DevOps solutions to its global customer base.”\n“High performance, enterprise scale software development teams are faced with stringent security and compliance requirements in addition to increasing complexity, with today’s continuous delivery environments,” added Paul Huber of Clearlake. “We believe Perforce’s technology and its proven security, performance, and scale uniquely position the Company to address these market trends and accelerate its growth trajectory.”\nHarris Williams served as financial advisors to Clearlake. Shea & Company served as financial advisor to Perforce and Summit Partners. Antares Capital, AllianceBernstein Private Credit and Vista Credit provided a fully underwritten facility to help finance the transaction.\nAbout Clearlake Capital Group, L.P.\nClearlake Capital Group, L.P. is a leading private investment firm founded in 2006. With a sector-focused approach, the firm seeks to partner with world-class management teams by providing patient, long-term capital to dynamic businesses that can benefit from Clearlake’s operational improvement approach, O.P.S.® The firm’s core target sectors are software and technology-enabled services; industrials and energy; and consumer. Clearlake has managed approximately $6 billion of institutional capital since inception and its senior investment principals have led or co-led over 100 investments. More information is available at www.clearlake.com .\nAbout Perforce\nEnterprises across the globe rely on Perforce to build and deliver digital products faster and with higher quality. Perforce offers complete developer collaboration and agile project management tools to accelerate delivery cycles — from agile planning tools to requirements, issues and test management, which then link to all source code, binary assets and artifacts for full build and release tracking and visibility. The company's version control solutions are well known for securely managing change across all digital content — source code, art files, video files, images, libraries — while supporting the developer and build tools your teams need to be productive, such as Git, Visual Studio, Jenkins, Adobe, Maya and many others. Perforce is trusted by the world's most innovative brands, including NVIDIA, Pixar, Scania, Ubisoft, and VMware. The company has offices in Minneapolis, MN, Alameda, CA, Mason, OH, the United Kingdom, Finland, Sweden, Germany, and Australia, and sales partners around the globe. For more information, please visit www.perforce.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110005235/en/\nMedia:\nOwen Blicksilver Public Relations, Inc.\nKristin Celauro, 732-433-5200\nkristin@blicksilverpr.com\nor\nJennifer Hurson, 845-507-0571\njennifer@blicksilverpr.com\nSource: Clearlake Capital Group, L.P.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.perforce.com&esheet=51740704&newsitemid=20180110005235&lan=en-US&anchor=www.perforce.com&index=2&md5=05695dab098e23d84985c7a885c8fb81", "http://www.businesswire.com/news/home/20180110005235/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.clearlake.com&esheet=51740704&newsitemid=20180110005235&lan=en-US&anchor=www.clearlake.com&index=1&md5=bb2eaa7cf3e853ac07885ed8abc26cce"], "published": "2018-01-10T15:00:00.000+02:00", "crawled": "2018-01-10T16:19:07.000+02:00", "highlightTitle": ""}