{"organizations": [], "uuid": "ff8623c4a7ce45c787a85c2bf6b33d1b4b520933", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/media", "section_title": "Media | Reuters.com", "url": "https://www.reuters.com/article/cyber-microchips/wrapup-apple-researchers-eye-patches-to-solve-intel-chip-flaws-idUSL8N1P01R9", "country": "US", "domain_rank": 408, "title": "WRAPUP-Apple, researchers eye patches to solve Intel chip flaws", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T19:38:00.000+02:00", "replies_count": 0, "uuid": "ff8623c4a7ce45c787a85c2bf6b33d1b4b520933"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/cyber-microchips/wrapup-apple-researchers-eye-patches-to-solve-intel-chip-flaws-idUSL8N1P01R9", "ord_in_thread": 0, "title": "WRAPUP-Apple, researchers eye patches to solve Intel chip flaws", "locations": [], "entities": {"persons": [{"name": "kanishka singh", "sentiment": "none"}, {"name": "douglas busvine frankfurt/bengaluru", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "intel", "sentiment": "negative"}, {"name": "intel corp", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Tech companies say security patches not slowing processors\n* CERT researchers back down on need for mass chip replacement\n* Intel shares sank on Tues/Wed on fears of exposure\nBy Kanishka Singh and Douglas Busvine\nFRANKFURT/BENGALURU, Jan 5 (Reuters) - Security issues with Intel Corp microchips are only slowing computers slightly, technology companies said, as researchers played down the need for mass hardware replacements to protect millions of devices from hackers.\nGoogle and other security researchers this week disclosed two major chip flaws - one called Meltdown affecting only Intel Corp chips and one called Spectre affecting nearly all computer chips made in the last decade.\nThat raised the prospect of Intel being on the hook for lawsuits claiming that software patches to fix the issue would slow computers and effectively force consumers to buy new hardware, driving the company’s shares down.\nBut Intel said in a statement after U.S. stock markets closed on Thursday that the performance impact of the recent security updates should not be significant and would be mitigated over time.\nIt said Apple Inc, Amazon.com Inc, Google and Microsoft Corp had all reported little to no performance impact from security patches. intel.ly/2CHQ89E\n“Intel continues to believe that the performance impact of these updates is highly workload-dependent and, for the average computer user, should not be significant,” it said.\nThe company confirmed that the flaws reported by the researchers could allow hackers to steal information from computers, phones and other devices, but insisted that the issue was not a design flaw.\nThe chipmaker said it would require users to download a patch and update their operating system to fix the issue.\nMicrosoft and Google have said they expect few performance problems for most of their cloud computing customers.\nApple said in a separate statement late on Thursday that its tests showed patches would not significantly affect processing speeds.\n“Our testing with public benchmarks has shown that the changes in the December 2017 updates resulted in no measurable reduction in the performance of macOS and iOS ... or in common Web browsing benchmarks,” the California-based firm said.\nWHAT EXPERTS SAY CERT, the cyber security project at Carnegie Mellon University sponsored by the U.S. government, on Friday withdrew its recommendation for the replacement of the central processing units (CPUs) of affected systems.\nIn the updated guidance, CERT said “operating system and some application updates mitigate these attacks”.\nDaniel Gruss, the 31-year-old information security researcher and post-doctoral fellow at Austria’s Graz Technical University who discovered the Meltdown flaw, welcomed Intel’s white paper on the issue.\n“This looks much more professional now,” Gruss said in comments emailed to Reuters.\nOn the change in recommendation from CERT, Gruss said, however, that there were no replacements yet that could address the flaws in processors that he and other researchers have found.\n“All CPUs are affected, also very recent ones,” Gruss said. “Furthermore, software updates can fix most of the problems, leaving only a small remaining attack surface.”\nBrowser makers Google, Microsoft Corp and Mozilla Corp’s Firefox confirmed to Reuters on Thursday that the patches they currently have in place do not protect iOS users.\nWith Safari and virtually all other popular browsers not patched, hundreds of millions of iPhone and iPad users may not have secure means of web browsing until Apple issues its patch.\nApple said it would release a patch for the Safari web browser on its devices within days. It said that there were no known instances of hackers taking advantage of the flaw to date. (Writing by Abinaya Vijayaraghavan; Editing by Amrutha Gayathri and Patrick Graham)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://intel.ly/2CHQ89E"], "published": "2018-01-05T19:38:00.000+02:00", "crawled": "2018-01-05T22:39:09.001+02:00", "highlightTitle": ""}