{"organizations": [], "uuid": "b88bbb2ad9c5443fbc046d49610c86c24aee4c33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/mv5bnzi2nda3mta4of5bml5banbnxkftztgwmja5mzkzmdi-_v1_sy1000_sx1500_al_.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/03/black-mirror-and-why-tech-should-be-feared/", "country": "US", "domain_rank": 1196, "title": "'Black Mirror' and Why Tech Should Be Feared | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.941, "site_type": "news", "published": "2018-01-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "b88bbb2ad9c5443fbc046d49610c86c24aee4c33"}, "author": "Andrew Nusca", "url": "http://fortune.com/2018/01/03/black-mirror-and-why-tech-should-be-feared/", "ord_in_thread": 0, "title": "'Black Mirror' and Why Tech Should Be Feared | Fortune", "locations": [], "entities": {"persons": [{"name": "andrew nusca january", "sentiment": "negative"}, {"name": "adam", "sentiment": "none"}, {"name": "jodie foster", "sentiment": "none"}, {"name": "arkangel", "sentiment": "none"}, {"name": "andrew nusca", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "fortune", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Andrew Nusca January 3, 2018 \nThis article first appeared in Data Sheet, Fortune’s daily newsletter on the top tech news. Sign up here . \nGood morning from Fortune’s Los Angeles bureau. Andrew Nusca here, in for Adam. \nHave you seen Black Mirror ? I am utterly captivated by season four of the dystopian Netflix (nflx) series, which for the unfamiliar is a high-tech spin on The Twilight Zone . I’m still making my way through the binge, but one unsettling episode directed by Jodie Foster, “Arkangel,” stuck with me. In it, a mother nearly loses her young daughter after she wanders off at the park. Terrified of a repeat incident, she signs up for Arkangel, a new service that, through use of an implant, allows the parent to use a mobile device to track the child’s location, monitor her vitals, and even see what the child is seeing. A parental mode pixelates in real time any visual that elevates stress. It’s heady stuff. \nYou can quickly see where this goes wrong. Even in our earliest years, negative experiences help us learn how to live in the world. (That pan burned my hand; I should be wary of touching things on the stove.) And what seems like an honest tool for parenting in a child’s earliest years quickly becomes highly invasive when that child grows into a teenager. (Real time visuals? No thanks.) If you saw last year’s film The Circle , based on the Dave Eggers novel , you’ll know this dichotomy well. Or the film Ex Machina two years before it. Or the documentary you’re living every day you scroll through Facebook (fb) , sync your Fitbit, or ask Alexa a question. \nWhy the spate of paranoid techno-thrillers? Because we’re still grappling with the implications of capabilities we’ve never had before. We know that fully autonomous vehicles can solve a lot of society’s problems, but we don’t know where they can fail us in other ways besides the obvious. We know that personalized medicine is the way forward, but we haven’t yet seen what happens when that power is abused. And so forth. \nTechno-optimism will be on fantastic display next week at CES, the annual consumer electronics show in Las Vegas. After six (mostly) terrifying episodes of Black Mirror , it might be just what the robo-doctor ordered. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T02:00:00.000+02:00", "crawled": "2018-01-04T05:30:31.000+02:00", "highlightTitle": ""}