{"organizations": [], "uuid": "e1de69ddf93a893af0fedf17ac584eb59912b070", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221465582&w=1200&r=LYNXMPEE0B11T", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-russia-rdif-sistema-assets-exclusive/exclusive-russias-rdif-in-talks-over-control-of-sistemas-retail-power-assets-sources-idUSKBN1F11R9", "country": "US", "domain_rank": 408, "title": "Exclusive: Russia's RDIF in talks over control of Sistema's retail, power assets - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T16:27:00.000+02:00", "replies_count": 0, "uuid": "e1de69ddf93a893af0fedf17ac584eb59912b070"}, "author": "", "url": "https://www.reuters.com/article/us-russia-rdif-sistema-assets-exclusive/exclusive-russias-rdif-in-talks-over-control-of-sistemas-retail-power-assets-sources-idUSKBN1F11R9", "ord_in_thread": 0, "title": "Exclusive: Russia's RDIF in talks over control of Sistema's retail, power assets - sources", "locations": [], "entities": {"persons": [{"name": "vladimir soldatkin", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "tatiana voronova", "sentiment": "none"}, {"name": "igor sechin", "sentiment": "none"}, {"name": "vladimir yevtushenkov", "sentiment": "none"}, {"name": "sistema", "sentiment": "none"}], "locations": [{"name": "sistema", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "min read  moscow", "sentiment": "none"}, {"name": "rdif", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "rosneft", "sentiment": "none"}, {"name": "bashneft", "sentiment": "none"}, {"name": "sistema", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - Russian conglomerate Sistema, which has to make a big payment to energy giant Rosneft ( ROSN.MM ) to settle a business dispute, is in talks with one of the country’s sovereign wealth funds about transferring two of its companies, sources said on Friday.\nThe negotiations concern the possibility of the state-owned Russian Direct Investment Fund (RDIF) taking over control of two retail and power businesses from Sistema, a banking source and a source close to the conglomerate told Reuters.\nAsked by Reuters for comment, RDIF said it had no plans to take over the assets, and Sistema said it was not planning to transfer the assets to the fund.\nThe dispute centred on mid-sized oil company Bashneft ( BANE.MM ), pitting Rosneft’s chief executive Igor Sechin, a close ally of President Vladimir Putin, against Sistema owner Vladimir Yevtushenkov, a billionaire who some Russian media reports suggest is close to Prime Minister Dmitry Medvedev.\nUnder the settlement announced last month, Sistema has to pay Rosneft 100 billion roubles ($1.8 billion) by March 30 and RDIF has agreed to lend Sistema 40 billion roubles. Russia’s largest lender Sberbank ( SBER.MM ) will also help Sistema to raise funds before the deadline.\nSistema put up two of its assets, toy retailer Detsky Mir ( DSKY.MM ) and the Bashkirian Power Grid Company, as collateral against the RDIF loan. The talks centre on the possible transfer of these firms to the fund.\n“The parties have been in discussion over the terms and the deal structure,” a banking source said.\nAnother source, close to Sistema, confirmed that such talks have been under way and that the terms of the deal have not yet been agreed. It was not clear whether they would include any cash payments to Sistema or it would be non-cash transaction.\nRDIF said in the emailed comments that the fund did not plan to acquire or in any way “gain control” over the assets. “RDIF acts as the arranger of the 40 billion-rouble-financing secured by these assets, as it was set in the amicable agreement,” the fund said.\nSistema’s spokesman said that the company was not considering transferring control over Detsky Mir and Bashkirian Power Grid Company to RDIF.\nThe RDIF’s possible acquisition of the assets would mark a boost for the fund, which is headed by ex-banker Kirill Dmitriev. RDIF, which manages capital of $10 billion, was launched in 2011 with the aim of attracting foreign investments to Russia.\n($1 = 56.5008 roubles)\nReporting by Tatiana Voronova and Vladimir Soldatkin; editing by Katya Golubkova and David Stamp\n ", "external_links": [], "published": "2018-01-12T16:27:00.000+02:00", "crawled": "2018-01-12T16:36:12.004+02:00", "highlightTitle": ""}