{"organizations": [], "uuid": "82c6e244593f78edc605857417335b500c645cdc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 25, "shares": 25, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-cyber-microchips-amd/microsoft-halts-some-amd-chip-meltdown-patches-after-pcs-freeze-idUSKBN1EY17X", "country": "US", "domain_rank": 408, "title": "Microsoft halts some AMD chip Meltdown patches after PCs freeze", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T13:43:00.000+02:00", "replies_count": 0, "uuid": "82c6e244593f78edc605857417335b500c645cdc"}, "author": "", "url": "https://www.reuters.com/article/us-cyber-microchips-amd/microsoft-halts-some-amd-chip-meltdown-patches-after-pcs-freeze-idUSKBN1EY17X", "ord_in_thread": 0, "title": "Microsoft halts some AMD chip Meltdown patches after PCs freeze", "locations": [], "entities": {"persons": [{"name": "eric auchard", "sentiment": "none"}, {"name": "georgina prodhan", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "amd", "sentiment": "negative"}, {"name": "microsoft", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "microsoft corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Microsoft Corp ( MSFT.O ) said on Tuesday the patches released to guard against Meltdown and Spectre security threats slowed down some personal computers and servers, with systems running on older Intel Corp ( INTC.O ) processors seeing a noticeable decrease in performance.\nThe security updates also froze some computers running AMD ( AMD.O ) chipsets, Microsoft said in a blog post, citing customer complaints.\nShares in Intel, which reiterated on Tuesday that it saw no sign of significant slowdown in computers, fell 1.4 percent, while those of AMD fell nearly 4 percent.\nAMD shares have gained nearly 20 percent in the last week as investors speculated that the chipmaker could wrest market share from Intel, whose chips were most exposed to the security flaws.\n\"We (and others in the industry) had learned of this vulnerability under nondisclosure agreement several months ago and immediately began developing engineering mitigations and updating our cloud infrastructure,\" Microsoft executive Terry Myerson wrote in a blog post. ( bit.ly/2mj6f3Q )\nSecurity researchers disclosed the flaws on Jan. 3 that affected nearly every modern computing device containing chips from Intel, AMD and ARM Holdings.\nFILE PHOTO: The Microsoft logo is shown on an electric car at the Auto Show in Los Angeles, California, U.S., November 28, 2017. REUTERS/Mike Blake Meltdown and Spectre are two memory corruption flaws that could allow hackers to bypass operating systems and other security software to steal passwords or encryption keys on most types of computers, phones and cloud-based servers.\nIntel said a typical home and business PC user should not see significant slowdowns in common tasks such as reading email, writing a document or accessing digital photos. ( intel.ly/2FiL0Hk )\nThe chipmaker said last week that fixes for security issues in its microchips would not slow down computers, rebuffing concerns that the flaws would significantly reduce performance.\nRival AMD had also played down the threat, saying its products were at “zero risk” from the Meltdown flaw, but that one variant of the Spectre bug could be resolved by software updates from vendors such as Microsoft.\nBut on Tuesday AMD said it was aware of an issue with some older-generation processors following the installation of a Microsoft security update that was published over the weekend.\nMicrosoft said it was working with AMD to resolve the issues.\nApple Inc ( AAPL.O ) also released an updated version of its operating system software on Monday to fix the security flaw.\nReporting by Eric Auchard in Frankfurt and Supantha Mukherjee in Bengaluru; Editing by Saumyadeb Chakrabarty and Shounak Dasgupta\n ", "external_links": [], "published": "2018-01-09T13:43:00.000+02:00", "crawled": "2018-01-09T13:49:41.008+02:00", "highlightTitle": ""}