{"organizations": [], "uuid": "eeaf3deaaaeb496449fe70004984f76da8275693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/03/reuters-america-rpt-column-opecs-focus-on-stocks-risks-prices-overshooting-kemp.html", "country": "US", "domain_rank": 767, "title": "RPT-COLUMN-OPEC's focus on stocks risks overshooting: Kemp", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T03:00:00.000+02:00", "replies_count": 0, "uuid": "eeaf3deaaaeb496449fe70004984f76da8275693"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/03/reuters-america-rpt-column-opecs-focus-on-stocks-risks-prices-overshooting-kemp.html", "ord_in_thread": 0, "title": "RPT-COLUMN-OPEC's focus on stocks risks overshooting: Kemp", "locations": [], "entities": {"persons": [{"name": "kemp", "sentiment": "neutral"}, {"name": "john kemp", "sentiment": "neutral"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "rpt-column-opec", "sentiment": "neutral"}, {"name": "reuters", "sentiment": "neutral"}, {"name": "oecd", "sentiment": "none"}, {"name": "iea", "sentiment": "none"}, {"name": "international energy agency", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "petroleum exporting countries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats Jan 3 column. John Kemp is a Reuters market analyst. The views expressed are his own.)\n* Chartbook: http://tmsnrt.rs/2CgLBYl\nLONDON, Jan 3 (Reuters) - The Organization of the Petroleum Exporting Countries (OPEC) is sticking doggedly to its plan to cut commercial oil inventories down to the five-year average to rebalance the oil market.\nBut in doing so, the organisation risks tightening the market too much, sending prices sharply higher and encouraging a faster-than-expected acceleration in production from U.S. shale producers.\nSaudi Arabias oil minister, who is the organisations de facto leader, has reiterated that stocks are still around 150 million barrels too high and it would be premature to discuss an exit strategy or change of course.\nAlmost the single metric we look at is global inventories and of course the most transparent and trustworthy is the OECD, he said in an interview before Christmas (Saudi energy minister Q&A with Reuters, Dec. 20).\nOPEC, the International Energy Agency (IEA) and the   all have slightly different figures for OECD commercial crude and products stocks, but they show a similar trend.\nOPEC estimates that total stocks were around 137 million barrels higher than the five-year average in October, down by around half since May (Monthly Oil Market Report, OPEC, December 2017).\nIEA puts commercial stocks about 111 million barrels above the prior five-year average at the end of October (Oil Market Report, IEA, December 2017).\nEIA data shows commercial stocks 167 million barrels above the five-year seasonal average at the end of October, down from a surplus of 380 million barrels in July 2016 (http://tmsnrt.rs/2CgLBYl).\nWhile the specific numbers differ, mostly for definitional and methodological reasons, the data from each of the agencies shows the stock overhang compared with the five-year average has narrowed significantly.\nMost of the remaining overhang is concentrated in crude oil rather than refined products such as gasoline and heating oil.\nProduct inventories are already tight in some cases, notably for middle distillates such as gasoil, diesel fuel and heating oil.\nBRENT SPREADS\nOPEC seems determined to drive total stocks down to the five-year average, or very close to it, before starting to increase its own output.\nBut that would almost certainly leave stockpiles uncomfortably low, send benchmark Brent prices well above $70 per barrel and push the market into a big backwardation.\nGlobal oil consumption has increased by more 6   over the last five years, according to the EIA.\nOther things equal, the oil industry will want to carry significantly higher stocks in 2018 than in 2013 to cover the increase in consumption.\nBrent futures prices for the next six months are already trading in a backwardation of around $2 per barrel, which is consistent with a market that is already tight and undersupplied.\nThe six-month Brent calendar spread is trading around the 78th percentile of its historical range, up from the 22nd percentile at the same point last year.\nThe calendar spread is watched by many physical traders as the most reliable indicator of the balance between production, consumption and inventories.\nBackwardation is normally associated with a market that is undersupplied and a low and declining level of inventories, while contango is normally associated with oversupply and high/rising stocks.\nThe Brent market has cycled regularly between backwardation and contango over the last 25 years as it moves between periods of under- and oversupply.\nThe sustained shift from contango in 2015/16 to backwardation in late 2017 and at the start of 2018 strongly suggests the market has switched from oversupply to undersupply.\nCalendar spreads for all months in 2018 have tightened significantly over the last six months suggesting traders see the market moving towards a sustained period of undersupply.\nSEASONAL VARIANCE\nMost forecasters, including the IEA and OPEC, predict the oil market will be in a small surplus during the first half of 2018, followed by a deficit in the second.\nThe expected rise in stocks during the first half is one reason why OPEC and its allies think market rebalancing will not be completed until later in the year and agreed to keep their output unchanged.\nBut a seasonal increase in stocks is normal during the first six months, which includes the principal maintenance period for many refineries.\nLater in the year, the summer driving season in the United States and winter heating season in the northern hemisphere typically boost consumption in the second half.\nIncreasing crude stocks during the first half of 2018 would only signify a weakening market if stocks rise faster than normal.\nTIGHTEN TOO MUCH\nHistory suggests that OPEC will gamble on tightening the market too much, with prices overshooting on the upside, rather than risk not tightening it enough and prices fall back.\nAfter the past two oil market slumps, in 1997/98 and 2008/09, prices subsequently overshot the organisations formal and informal targets of $28 and $75 per barrel respectively.\nFront-month Brent futures prices reached almost $35 per barrel in late 2000 and more than $125 per barrel in early 2011.\nThe six-month calendar spread hit about $4.50 per barrel backwardation in both cases before starting to ease lower.\nOPEC has not declared a price target for 2018, though some senior officials from member countries have briefed they want to see a Brent price floor of $60, which implies an annual average well above this.\nIn the past, OPEC members have tended to revise their price targets upwards as market prices rise, in a ratchet effect.\nRe-running history, informal price targets, as implied in statements made by officials from OPEC members, have already risen significantly since the start of 2017.\nMost OPEC members, including Saudi Arabia, want to see higher oil prices to boost revenues and close their budget and current account deficits.\nSaudi Arabia also needs higher prices to finance its ambitious social and economic transformation programme and create positive sentiment around the planned sale of shares in its national oil company.\nIn practice, if OPEC comes anywhere near achieving its objective of draining stocks down to the five-year average level, prices will likely end up well above $70, which will probably be welcomed by most OPEC members.\nBut the more prices increase, especially with Brent prices near $70, and WTI prices above $60, the more likely U.S. shale drilling and production rates will accelerate, which will tend to frustrate the objective of lowering stocks.\nRelated columns:\nHedge funds gamble OPEC will tighten oil market too much, Reuters, Jan. 2\nSaudi Arabia and Russia reach compromise on oil pact, Reuters, Dec. 1\nOPEC must think about exit strategy, Reuters, Oct. 25 (Editing by Adrian Croft)", "external_links": [], "published": "2018-01-04T03:00:00.000+02:00", "crawled": "2018-01-04T04:10:09.001+02:00", "highlightTitle": ""}