{"organizations": [], "uuid": "e6e623eace04d1394c661ddd4d8aa73070317bf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-fed-bostic/feds-bostic-says-three-rate-hikes-in-2018-may-be-too-much-idUSW1N1MT00Y", "country": "US", "domain_rank": 408, "title": "Fed's Bostic says three rate hikes in 2018 may be too much", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-09T01:40:00.000+02:00", "replies_count": 0, "uuid": "e6e623eace04d1394c661ddd4d8aa73070317bf0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-fed-bostic/feds-bostic-says-three-rate-hikes-in-2018-may-be-too-much-idUSW1N1MT00Y", "ord_in_thread": 0, "title": "Fed's Bostic says three rate hikes in 2018 may be too much", "locations": [], "entities": {"persons": [{"name": "bostic", "sentiment": "negative"}, {"name": "raphael bostic", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fed", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "negative"}, {"name": "atlanta fed", "sentiment": "none"}, {"name": "rotary club of atlanta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan 8 (Reuters) - The Federal Reserve may only need to raise interest rates two or fewer times in 2018 given weak price pressures and possible loss of public confidence in its ability to hit a 2 percent inflation target, Atlanta Fed President Raphael Bostic said on Monday.\nBostic said he was still on board with the U.S. central bank’s “slow removal” of monetary policy accommodation in the face of domestic economic growth he feels may hit 2.5 percent this year as well as continued low unemployment.\n“However, I would caution that that doesn’t necessarily mean as many as three of four moves per year,” Bostic said in prepared remarks for a speech to the Rotary Club of Atlanta, separating himself from Fed policymakers’ median expectation of three rate increases this year.\nThe central bank raised rates three times in 2017.\nWeak wage growth and inflation are two reasons to be guarded with future rate increases, he said.\nIn addition, he said he is concerned the public may be losing confidence in the Fed’s commitment or ability to reach its inflation target, “anchoring” public expectations below that level. Public and market expectations are considered an important component in inflation outcomes, and Bostic said recent survey evidence “indicates that individuals may not be completely convinced.”\n“This possibility is one factor that might argue for being somewhat more patient in raising rates,” he said.\nBostic added that the estimated “neutral” rate of interest that would keep inflation at target and economic growth at trend may have slipped to “close to” 2 percent. If true, it means the Fed could only raise rates two or three more times, from the current range of between 1.25 percent to 1.50 percent, before monetary policy is no longer “loose” and encouraging economic activity.\nEven as it raises rates the Fed wants to remain “accommodative,” with a federal funds target below neutral.\nWith the Fed also tightening policy by shrinking its balance sheet each month, the central bank “is approaching a more neutral stance,” and needs to keep that in mind in setting rates, Bostic said.\nBostic said his outlook incorporates a “modest” increase in economic activity from the Trump administration’s tax cuts.\nBut he said that among businesses surveyed after the House of Representatives’ version of the tax overhaul had been approved, two-thirds or more of larger firms said the changes would not prompt them to expand investment or hiring. (Reporting by Howard Schneider; Editing by Paul Simao)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T01:40:00.000+02:00", "crawled": "2018-01-09T17:08:02.010+02:00", "highlightTitle": ""}