{"organizations": [], "uuid": "563ff7fe62ebaf5180ac7250bbc98a1c973122ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219491248&w=1200&r=LYNXMPEE0404Z", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/china-economy/china-revises-2016-gdp-slightly-lower-keeps-6-7-percent-growth-unchanged-idINKBN1EU0A0", "country": "US", "domain_rank": 408, "title": "China revises 2016 GDP slightly lower, keeps 6.7 percent growth unchanged", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T05:30:00.000+02:00", "replies_count": 0, "uuid": "563ff7fe62ebaf5180ac7250bbc98a1c973122ef"}, "author": "", "url": "https://in.reuters.com/article/china-economy/china-revises-2016-gdp-slightly-lower-keeps-6-7-percent-growth-unchanged-idINKBN1EU0A0", "ord_in_thread": 0, "title": "China revises 2016 GDP slightly lower, keeps 6.7 percent growth unchanged", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "hebei province", "sentiment": "none"}, {"name": "wu'an", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "national bureau of statistics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China slightly trimmed its final 2016 gross domestic product figure after scaling back an initial estimate of the services sector, but kept the annual GDP growth rate unchanged at 6.7 percent, the statistics bureau said on Friday.\nChinese national flags flutter near a steel factory in Wu'an, Hebei province, China, February 23, 2017. REUTERS/Thomas Peter/Files The National Bureau of Statistics revised the final 2016 GDP to 74.36 trillion yuan ($11.47 trillion), down 54.2 billion yuan from the preliminary number.\nThe 2016 growth rate of the world’s second-biggest economy remains unchanged at 6.7 percent, the statistics bureau said in a statement.\nFinal data from the bureau shows the services sector grew 7.7 percent in 2016 to 38.3 trillion yuan. The sector, which accounts for half of China’s GDP, expanded 7.8 percent in the bureau’s initial estimate to 38.4 trillion yuan.\nThe revisions were mainly due to small cuts in the bureau’s estimates for the size of the financial and tech sectors, which grew 4.5 percent and 18.1 percent in the final numbers, respectively, down from 5.7 percent and 22.2 percent in the earlier data release.\nA worker stands on a construction site as part of the West Kowloon Terminus project for the Guangzhou-Shenzhen-Hong Kong Express Rail Link in Hong Kong, China July 21, 2017. REUTERS/Bobby Yip/Files Growth estimates for manufacturing, agriculture, construction and real estate remain unchanged.\nChina’s 2016 GDP grew at its slowest pace in more than a quarter of a century as the government pushed through painful structural reforms in the economy.\nGDP is expected to have expanded 6.8 percent in 2017, exceeding the government’s target of around 6.5 percent. But growth will likely slow to 6.4 percent this year, economists say.\nProperty investment and construction are expected to lose steam as more cities try to curb surging housing prices, while a government campaign against riskier lending pushes up borrowing costs and a crackdown on pollution hurts some factories.\nThe government will keep its GDP growth target at “around 6.5 percent” in this year, policy sources told Reuters.\n($1 = 6.4855 Chinese yuan)\nReporting by Ryan Woo; Editing by Sam Holmes\n ", "external_links": [], "published": "2018-01-05T05:30:00.000+02:00", "crawled": "2018-01-05T05:51:52.006+02:00", "highlightTitle": ""}