{"organizations": [], "uuid": "c43d9caecb3bfc1bab703cd99e945a3e8fd08629", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218566804&w=1200&r=LYNXMPEE000P1", "site_section": "http://feeds.reuters.com/reuters/INformulaOne\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/pakistan-militants/exclusive-pakistan-plans-takeover-of-charities-run-by-islamist-figure-u-s-has-targeted-idINKBN1EQ0T4", "country": "US", "domain_rank": 408, "title": "Exclusive: Pakistan plans takeover of charities run by Islamist figure U.S. has targeted", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T11:08:00.000+02:00", "replies_count": 0, "uuid": "c43d9caecb3bfc1bab703cd99e945a3e8fd08629"}, "author": "", "url": "https://in.reuters.com/article/pakistan-militants/exclusive-pakistan-plans-takeover-of-charities-run-by-islamist-figure-u-s-has-targeted-idINKBN1EQ0T4", "ord_in_thread": 0, "title": "Exclusive: Pakistan plans takeover of charities run by Islamist figure U.S. has targeted", "locations": [], "entities": {"persons": [{"name": "hafiz muhammad saeed", "sentiment": "none"}, {"name": "asif shahzad", "sentiment": "none"}, {"name": "saeed", "sentiment": "none"}, {"name": "hafiz saeed", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "rawalpindi", "sentiment": "none"}, {"name": "jamaat-ud-dawa", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "isl", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 9:08 AM / in 2 hours Exclusive - Pakistan plans takeover of charities run by Islamist figure U.S. has targeted Asif Shahzad 7 Min Read \nISLAMABAD (Reuters) - Pakistan’s government plans to seize control of charities and financial assets linked to Islamist leader Hafiz Saeed, who Washington has designated a terrorist, according to officials and documents reviewed by Reuters. Hafiz Muhammad Saeed (C), chief of the Islamic charity organisation Jamaat-ud-Dawa (JuD), speaks to supporters during a gathering to protest against Trump's decision to recognise Jerusalem as the capital of Israel, in Rawalpindi, Pakistan December 29, 2017. REUTERS/Faisal Mahmood \nPakistan’s civilian government detailed its plans in a secret order to various provincial and federal government departments on Dec. 19, three officials who attended one of several high-level meeting discussing the crackdown told Reuters. \nMarked “secret”, a Dec. 19 document from the finance ministry directed law enforcement and governments in Pakistan’s five provinces to submit an action plan by Dec. 28 for a “takeover” of Saeed’s two charities, Jamaat-ud-Dawa (JuD) and the Falah-e-Insaniat Foundation. \nThe United States has labelled JuD and FIF “terrorist fronts” for Lashkar-e-Taiba (“Army of the Pure” or LeT), a group Saeed founded in 1987 and which Washington and India blame for the 2008 attacks in Mumbai that killed 166 people. \nSaeed has repeatedly denied involvement in the Mumbai attacks and a Pakistani court saw insufficient evidence to convict him. The LeT could not be reached for comment. \nThe Dec. 19 document, which refers to “Financial Action Task Force (FATF) issues”, names only Saeed’s two charities and “actions to be taken” against them. \nThe FATF, an international body that combats money laundering and terrorist financing, has warned Pakistan it faces inclusion on a watch list for failing to crack down on financing terrorism. \nAsked about a crackdown on JuD and FIF, Interior Minister Ahsan Iqbal, who co-chaired one of the meetings on the plan, responded only generally, saying he has ordered authorities “to choke the fundraising of all proscribed outfits in Pakistan”. \nIn a written reply to Reuters, he also said Pakistan wasn’t taking action under U.S. pressure. “We’re not pleasing anyone. We’re working as a responsible nation to fulfil our obligations to our people and international community.” \nIn response to the Reuters article, JuD spokesman Yahya Mujahid said the organisation will go to court if the government decides to take over JuD and FIF. \n“We will not keep silent. We will fight a legal battle,” Mujahid said in statement, terming the government move illegal. \nSaeed could not be reached for comment. He has frequently denied having ties to militants and says the charitable organisations he founded and controls have no terrorism ties. He says he promotes an Islamic-oriented government through doing good works. \nOn Monday, some of the first directives from the proposed crackdown were put in place. \nThe country’s financial regulator, Securities and Exchange Commission of Pakistan (SECP), issued an order that “prohibits” all companies from donating money to Saeed, LeT, JuD, FiF and other groups and individuals who are named on the U.N. Security Council sanctions lists. \nIn the capital Islamabad, the district magistrate banned proscribed organisations from “fund-raising in any kind and social, political, welfare and religious activities by these groups”, according to an order reviewed by Reuters. Hafiz Muhammad Saeed, chief of the Islamic charity organisation Jamaat-ud-Dawa (JuD), speaks to supporters during a gathering to protest against Trump's decision to recognise Jerusalem as the capital of Israel, in Rawalpindi, Pakistan December 29, 2017. REUTERS/Faisal Mahmood \nThe two-month ban, which can be extended, was put into place “to curb the terrorist acts and assistance activites carried out by the proscribed organisations and their subsidiary welfare wings,” the document said. FIRST MAJOR MOVE \nIf the government follows through with the plan, it would mark the first time Pakistan has made a major move against Saeed’s network, which includes 300 seminaries and schools, hospitals, a publishing house and ambulance services. The JuD and FIF alone have about 50,000 volunteers and hundreds of other paid workers, according to two counter-terrorism officials. \nParticipants at the meeting raised the possibility that the government’s failure to act against the charities could lead to U.N. sanctions, one of the three officials said. A U.N. Security Council team is due to visit Pakistan in late January to review progress against U.N.-designated “terrorist” groups. Hafiz Saeed is showered with flower petals as he walks to court before a Pakistani court ordered his release from house arrest in Lahore, Pakistan November 22, 2017. REUTERS/Mohsin Raza \n“Any adverse comments or action suggested by the team can have far-reaching implications for Pakistan,” the official said. \nThe Dec. 19 document gave few details about how the state would take over Saeed’s charities, pending the plans submitted from the provincial governments. It did say it would involve government entities taking over ambulance services and accounting for other vehicles used by the charities. \nIt says law enforcement agencies will coordinate with Pakistan’s intelligence agencies to identify the assets of the two charities and examine how they raise money. \nThe document also directs that the name of JuD’s 200-acre headquarters, Markaz-e-Taiba, near the eastern city of Lahore be changed to something else ”to make it known that the Government of “Punjab (province) solely manages and operates the Markaz(headquarters)”. \nThe move to seize the charities could spark some concern from the powerful military, which has proposed plans to steer Saeed and the JuD into mainstream politics. The military did not respond to a request for comment. \nIn August, JuD officials formed a new political party, the Milli Muslim League, and backed candidates who fared relatively strongly in two key parliamentary by-elections. \nThe JuD publicly disavows armed militancy inside Pakistan, but offers vocal support for the cause of rebel fighters in Indian-administered Kashmir and has called for Pakistan to retake Kashmir. Nuclear-armed India and Pakistan have fought two wars over the disputed region. \nWashington, which has offered a $10 million reward for information leading to Saeed’s conviction over the Mumbai attacks, warned Islamabad of repercussions after a Pakistani court in late November released him from house arrest. \nPunjab’s provincial government had put Saeed under house arrest for 10 months this year for violating anti-terrorism laws. \nWriting on Twitter on Monday, U.S. President Donald Trump said the United States has “foolishly” handed Pakistan more than $33 billion in aid over the last 15 years while getting nothing in return and pledged to put a stop to it. Additional reporting by Drazen Jorgic; Editing by Bill Tarrant and Adrian Croft", "external_links": [], "published": "2018-01-01T11:08:00.000+02:00", "crawled": "2018-01-01T11:33:15.004+02:00", "highlightTitle": ""}