{"organizations": [], "uuid": "65fb79a79f86c8b2ee7884174d32c41ffccd45a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/31/reuters-america-update-3-oil-drops-for-a-third-day-set-for-strongest-january-since-2013.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Oil drops for a third day; set for strongest January since 2013", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T12:35:00.000+02:00", "replies_count": 0, "uuid": "65fb79a79f86c8b2ee7884174d32c41ffccd45a7"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/31/reuters-america-update-3-oil-drops-for-a-third-day-set-for-strongest-january-since-2013.html", "ord_in_thread": 0, "title": "UPDATE 3-Oil drops for a third day; set for strongest January since 2013", "locations": [], "entities": {"persons": [{"name": "tamas varga", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "pvm oil associates", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Brent, WTI prices down as much as 1 percent\n* Industry report shows 3.2-mln-barrel rise in U.S. stocks\n* Government inventory figures due on Wednesday (Updates throughout with comment, refreshes prices; changes dateline from TOKYO)\nLONDON, Jan 31 (Reuters) - Oil fell for a third day on Wednesday, but remained on track for its biggest gain in January in five years, in spite of data that showed U.S. crude stocks rose more than expected last week and a broader selloff in other commodities, stocks and bonds.\nBrent crude, the global benchmark, was down 49 cents at $68.43 a barrel by 1015 GMT, after touching a two-week low earlier in the day. U.S. West Texas Intermediate (WTI) futures were down 39 cents at $64.11.\nOn Tuesday, U.S. crude fell 1.6 percent to close at $64.50 a barrel, far outpacing a 0.6 percent drop in the price of Brent.\n\"The extent of the latest pullback in oil prices has taken many by surprise. Whether this weakness will be short-lived or are we witnessing the precursor to a violent downside correction remains to be seen,\" PVM Oil Associates strategist Tamas Varga said.\n\"Still, what is apparent is that positives are increasingly in short supply for skittish buyers and the early-year optimism is hanging by a thread.\"\nPrices of WTI and Brent are still on track for a fifth month of gains and Brent is set for its largest percentage increase in the month of January since 2013, with a rise of 2.7 percent.\nBut as prices have risen, U.S. producers have increased their rig count. Energy companies added 12 oil rigs last week, the biggest weekly increase since March.\n\"The rig count will only continue to rise and the U.S. system will only become more efficient,\" said Matt Stanley, a fuel broker at Freight Services International in Dubai.\n\"I see a correction on the horizon down towards $60 before the inevitable OPEC minister comes out and talks about new cuts,\" he added.\nThe Organization of the Petroleum Exporting Countries, along with other producers including Russia, has been waging a battle against U.S. shale producers, agreeing to take 1.8 million barrels a day off the market through the end of 2018.\nA report from the American Petroleum Institute late on Tuesday showing U.S. crude stocks rose by 3.2 million barrels last week cast a further bearish pall over the market.\nU.S. Energy Department data on Wednesday is expected to show an increase in inventories for the first time in 11 weeks. Analysts polled by Reuters forecast an average 100,000-barrel build in crude stocks.\nCrude stocks tend to rise in January, but this year they have fallen by more than 12 million barrels, making this the largest drop in the first month of the year in 30 years.\n(Additional reporting by Henning Gloystein in SINGAPORE and Aaron Sheldrick in TOKYO; Editing by Dale Hudson)", "external_links": [], "published": "2018-01-31T12:35:00.000+02:00", "crawled": "2018-01-31T15:26:33.012+02:00", "highlightTitle": ""}