{"organizations": [], "uuid": "3b8332ca328955b13dcfd750ba67ba7059265a9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/11/17/102191915-RTR4DMAY.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/11/oil-dips-away-from-levels-last-seen-in-late-2014-but-analysts-say-market-supported.html", "country": "US", "domain_rank": 767, "title": "Oil dips away from levels last seen in late 2014, but analysts say market supported", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.643, "site_type": "news", "published": "2018-01-12T04:36:00.000+02:00", "replies_count": 0, "uuid": "3b8332ca328955b13dcfd750ba67ba7059265a9b"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/11/oil-dips-away-from-levels-last-seen-in-late-2014-but-analysts-say-market-supported.html", "ord_in_thread": 0, "title": "Oil dips away from levels last seen in late 2014, but analysts say market supported", "locations": [], "entities": {"persons": [{"name": "sanjeev bahl", "sentiment": "none"}, {"name": "bahl", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "edison investment research", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices rose for a sixth day on Friday after Russia's oil minister said that global crude supplies were \"not balanced yet,\" alleviating market concerns about a wind-down of the OPEC-led deal to reduce production.\nRussian Energy Minister Alexander Novak said ministers from leading OPEC and non-OPEC producers will discuss the possibility of exiting the deal at a coming committee meeting, but said that \"we see that the market surplus is decreasing, but the market is not completely balanced yet.\"\nHis comments boosted prices, which rebounded from earlier decline, though the market has not hit the heights it touched on Thursday, when Brent crude topped $70 a barrel for the first time since December 2014.\nBrent crude futures rose 54 cents to $69.80 a barrel. U.S. West Texas Intermediate futures settled at $64.30 per barrel, notching a four week winning streak. WTI hit its strongest since late 2014 at $64.77 on Thursday.\nU.S. oil rigs rose by 10 to 752 this week, the biggest increase since June and the first time drillers added rigs in five weeks, according to Baker Hughes. The total rig count rose to 752 in the week through Jan. 12, the most since September.\nshow chapters US oil drillers add rigs for first time in five weeks 2 Hours Ago | 00:32 The agreement between the Organization of the Petroleum Exporting Countries and Russia reached in late 2016 to cut 1.8 million barrels of crude daily is due to last until the end of 2018.\nNovak said the current oil price was short-term, and he would discuss the situation at a ministerial monitoring committee meeting in Oman, scheduled for Jan. 21.\nRussia's Lukoil Chief Executive Vagit Alekperov said Russia - part of the global agreement with the Organization of the Petroleum Exporting Countries to reduce supply - should start to exit the pact if crude prices remain at $70 a barrel for more than six months.\nMajor oil producing-countries have grown concerned that as prices remain near these levels, it will spur additional production from U.S. shale patches in Texas and North Dakota, risking overwhelming the market with additional supply, and hurting OPEC's market share.\nFatih Birol, head of the Paris-based International Energy Agency, said oil prices at $65 to $70 risked encouraging more oversupply from U.S. shale drillers.\n\"If you look at any kind of momentum indicator this is telling you this is way overbought,\" said Robert Yawger, director of energy futures at Mizuho in New York. \"However, there are definitely issues supporting the market.\"\nU.S. crude production fell in the most recent week by nearly 300,000 barrels per day to about 9.5 million bpd, which analysts attributed to the deep freeze across most of the country.\nThe U.S. Energy Department expects production will blow through 10 million bpd in the next few months, en route to 11 million bpd by next year, rivaling Russia and Saudi Arabia.\nFutures contracts show an expectation for prices to pull back by year end, with the December U.S. crude futures contract currently trading just above $60 a barrel.\nLater-dated futures trading lower than the spot price is known as backwardation, and is expected to inhibit production because it implies a lower price for future barrels sold.", "external_links": [], "published": "2018-01-12T04:36:00.000+02:00", "crawled": "2018-01-12T03:54:59.017+02:00", "highlightTitle": ""}