{"organizations": [], "uuid": "53db4f707ca598a9677d79d4d1abd08086dc0ec9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-wipro-limited-announces-results-for-the-quarter-ended-december-31-2017-under-ifrs.html", "country": "US", "domain_rank": 767, "title": "Wipro Limited Announces Results for the Quarter Ended December 31, 2017 under IFRS", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.104, "site_type": "news", "published": "2018-01-19T17:09:00.000+02:00", "replies_count": 0, "uuid": "53db4f707ca598a9677d79d4d1abd08086dc0ec9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-wipro-limited-announces-results-for-the-quarter-ended-december-31-2017-under-ifrs.html", "ord_in_thread": 0, "title": "Wipro Limited Announces Results for the Quarter Ended December 31, 2017 under IFRS", "locations": [], "entities": {"persons": [], "locations": [{"name": "bangalore", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "n.j.", "sentiment": "none"}, {"name": "ast brunswick", "sentiment": "none"}], "organizations": [{"name": "digital", "sentiment": "negative"}, {"name": "wipro limited announces results", "sentiment": "negative"}, {"name": "ifrs it services revenue", "sentiment": "negative"}, {"name": "wipro", "sentiment": "none"}, {"name": "wipro limited", "sentiment": "none"}, {"name": "wipro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IT Services Revenue in line with Guidance, Digital surpasses 25% of our Revenue\nBANGALORE, India & EAST BRUNSWICK, N.J.--(BUSINESS WIRE)-- Wipro Limited (NYSE: WIT, BSE: 507685, NSE: WIPRO) today announced financial results under International Financial Reporting Standards (IFRS) for its quarter ended December 31, 2017.\nHighlights of the Results\nGross Revenue of Wipro Limited was Rs 136.7 billion ($2.1 billion 1 ). IT Services Segment Revenue in Non-GAAP constant currency increased by 0.9% sequentially, in line with our Guidance. IT Services Segment Revenue in dollar terms was $2,013.0 million, remaining flat sequentially and increasing by 5.8% YoY. IT Services Margin for the quarter was 14.8%, impacted by a provision of Rs 3,175 million ($49.7 million 1 ) made with respect to insolvency of a customer post the balance sheet date. Adjusted for this event, IT Services Margin for the quarter was 17.2%. Net Income 3 for the quarter was Rs 19.4 billion ($303 million 1 ), a decrease of 8.2% YoY. Adjusted for the customer insolvency event, Net Income 3 for the quarter increased by 4.0% YoY. Wipro declared an interim dividend of Rs 1 ($0.02 1 ) per share/ADS.\nPerformance for the quarter ended December 31, 2017\nAbidali Z. Neemuchwala, CEO and Member of the Board said - “We continued to improve our growth trajectory driven by strong momentum in BFSI and uptick in Healthcare. This is also reflected in our outlook for the next quarter. Our leadership in Digital continues to strengthen with over 25% of our revenues now coming from Digital.”\nJatin Dalal, Chief Financial Officer said - “We have made strong progress in our client mining with number of clients contributing revenues over $50 million increasing from 33 to 41 in the last 1 year. In the first 9 months of the current fiscal year, we generated robust Operating Cash Flows of Rs 77 billion, 14.2% more than the same period last year. We also completed the Share Buyback in December and saw strong participation from our investors.”\nOutlook for the Quarter ending March 31, 2018\nWe expect Revenues from our IT Services business to be in the range of $2,033 million to $2,073 million*.\nShare Buyback Update\nIn the quarter ended December 31, 2017, the Company has concluded the buyback of 343.75 million equity shares as approved by the Board of Directors on July 20, 2017. This has resulted in a total cash outflow of Rs 110,000 million.\nIT Services\nWipro continued its momentum in winning large deals globally as described below:\nA leading global financial services company has chosen Wipro as a strategic partner to support its compliance and operational risk applications. The engagement will help the client achieve increased productivity and enhanced end-customer engagement.\nA leading North American specialty retailer has expanded a business process services contract with Wipro. As part of the engagement, Wipro will help the retailer improve its Net Promoter Score (NPS) by driving a superior customer care experience for its end-customers.\nA leading global manufacturer of cleaning and hygiene products has awarded an end-to-end IT infrastructure contract to Wipro. The intelligent analytics capabilities of Wipro HOLMES TM will be used to improve the operational efficiency and end user experience.\nA North American telecom major has awarded a quality assurance contract to Wipro, wherein Wipro will manage the testing of Business Support Systems applications for the client.\nWipro has also won a multi-year engagement with a leading airport in North America for developing a resilient, agile and scalable IT system. This program will enhance core business-critical airport systems such as passenger processing, baggage processing and the Airport Operational Database (AODB) and will lay the foundation for next-gen digital transformation initiatives.\nOriental Bank of Commerce, a leading public-sector bank in India has awarded Wipro a contract to implement an Enterprise-wide Data Warehousing (EDW) solution. The deployment will help the bank respond nimbly to regulatory reporting requirements. It will also enable the bank to develop a single view of its customer base and enhance its focus on customer centricity.\nWipro will enable analytics, digital and Smart Campus initiatives for a leading university in the APAC region.\nDigital highlights\nWe saw increasing traction in digital oriented deals as illustrated below:\nA global automotive company has selected Wipro to redesign its retail strategy, ranging from physical spaces to digital experiences.\nA major international payments provider has awarded Wipro Digital a pilot project focused on payments and wearables. The project will leverage Designit’s expertise in technology, product and service design.\nWipro has won a workspace services deal encompassing service desk operations and end-user services with a leading Brazilian retail chain. The engagement will leverage the Wipro HOLMES TM chatbot to enhance the end-user experience at the retail chain’s stores.\nA public transport authority in the Middle East has awarded a project to Wipro to design and develop a big data information platform. Wipro will develop a state-of-the-art data lake to process and analyze data across the customer’s landscape to help them derive actionable insights.\nWipro also won a number of deals in the Cloud applications space leveraging Appirio Cloud Services:\nA Fortune 500 medical devices organization has selected Wipro for a multi-year global front-office transformation project. A global provider of banking and financial services has awarded Wipro a contract to upgrade its user experience and simplify their sales and service process. An American chain of luxury departmental stores has selected Wipro to reimagine its employee experience and modernize their HR processes. Wipro has won a customer experience transformation contract from an international charitable organization.\nDelivery Excellence\nMagne Solberg, CIO, Co-op said - “We selected Wipro as a strategic partner because of their retail domain expertise, investment in digital technologies, and strong SAP and infrastructure capabilities. We are planning to leverage Wipro’s expertise in our own digital journey. We have experienced Wipro’s investment in Artificial Intelligence, cognitive and digital solutions such as on-shelf availability, AR promotions and VR home shopper. This engagement has benefited our supply chain, and logistics operations, back office and in-store availability with increased efficiency, reach and availability. Wipro also helped us in successfully integrating one of our recent acquisitions ICA by migrating ICA’s SAP platform to Azure cloud. We strongly recommend Wipro as we strengthen our position in the Norwegian retail market. I think Wipro’s new branding and logo are signs that Wipro is truly looking to transform the way they reset the future digital journeys for their customers.”\nAnalyst Accolades and Awards\nWipro was positioned as a Leader in Everest Group FAO PEAK Matrix™ 2017\nWipro was positioned as a Leader in Everest Group PEAK - Service Provider Landscape with PEAK Matrix™ Assessment for 2017 for Risk & Regulatory Compliance Application Services in BFS\nWipro was positioned as a Leader in Everest Group Healthcare Payer BPO PEAK Matrix™ 201", "external_links": ["http://www.businesswire.com/news/home/20180119005377/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wipro.com&esheet=51745817&newsitemid=20180119005377&lan=en-US&anchor=www.wipro.com&index=3&md5=b29aa5fccb6a546d3704cb4bcc33a3f4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51745817&newsitemid=20180119005377&lan=en-US&anchor=www.sec.gov&index=4&md5=5954022c699c55848b42aa15de1e65aa", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wipro.com&esheet=51745817&newsitemid=20180119005377&lan=en-US&anchor=www.wipro.com&index=1&md5=a514607e470746025f0d6bb5159f62d5", "http://services.choruscall.eu/links/wipro180119.html", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fclicktime.symantec.com%2Fa%2F1%2FgDnDfgUwXoiTMc7VbanRKwPbuH7BYagkPnbE-w2oHxA%3D%3Fd%3DqwEeGiWqwXsIy6XRHBUdIWhl0ZwABNvfOQOfbNPI8_OqI6GP3ngO82pPqJzCJlvDesCX3_ES0_b3Z--zOPGXjrtmQ82DBmJ8gc2Ctes5xvUNB0gsaC3-eAlAI-shxKNLcHsivA-HHZeojmmJn7qGH_kYsLSrokkQUTb5_72EHOb9vng1LVYPeBKgC0OML5ApYfza68vLy7F_o9sL_2WRTa4RpIz4C8TrN7A8l6ZyHG2JRX0Tdb1Q-XqddbA5CjBM5wNmDuw4d9qjVgHYetJj38wk64eTRcxINFvJ3uQYZtippOKMvNUJS4jFUEGSymheSH8kgBhxr48f2OvRdDYHRt3ZQV2gm01Nr469P6mOlU0myUFgzanUP"], "published": "2018-01-19T17:09:00.000+02:00", "crawled": "2018-01-19T21:05:29.006+02:00", "highlightTitle": ""}