{"organizations": [], "uuid": "bdfb2a61be4e3258da5a15ae840085eb7ddf517b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223292688&w=1200&r=LYNXMPEE0I0GT", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-china-trade-analysis/china-looks-to-call-bluff-on-trump-trade-action-idUSKBN1F80WP", "country": "US", "domain_rank": 408, "title": "China looks to call bluff on Trump trade action", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:33:00.000+02:00", "replies_count": 0, "uuid": "bdfb2a61be4e3258da5a15ae840085eb7ddf517b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-china-trade-analysis/china-looks-to-call-bluff-on-trump-trade-action-idUSKBN1F80WP", "ord_in_thread": 0, "title": "China looks to call bluff on Trump trade action", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "he weiwen", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "center for china and globalization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 9:33 AM / in 5 hours China looks to call bluff on Trump trade action Michael Martina , Kevin Yao 6 Min Read \nBEIJING (Reuters) - As influential voices within the U.S. business community warn China that U.S. President Donald Trump is serious about tough action over Beijing’s trade practices, there is little sense of a crisis in the Chinese capital, where officials think he is bluffing. \nIn Beijing, many experts think Washington is unwilling to pay the heavy economic price needed to upset prevailing trade dynamics between the world’s two largest economies. \nHanging over trade relations are several inquiries into whether steel and aluminum imports - including those from China - are harming U.S. national security, possible tariffs on imported solar panels, as well as an investigation into potential Chinese abuse of intellectual property. \n“I think this might be a threat to ask for deals from China,” said He Weiwen, a senior fellow at the Center for China and Globalization, a government-affiliated research organization in Beijing. \nResults in most, if not all, of the investigations are seen as imminent. Trump warned in an interview with Reuters on Wednesday of potentially “big damages” against China as a result of the intellectual property inquiry under Section 301 of the Trade Act of 1974. \nPeople in the U.S. business community say this growing gulf in expectations between Washington and Beijing is fueled in part by the dwindling frequency of talks on commercial issues. The resulting vacuum could set the two governments on a collision course over trade. \n“Dialogue is a shadow, a shell, a trickle of what it was, particularly on the economic and commercial issues,” said one U.S. industry source who accompanied a business delegation to Beijing last week to warn senior Chinese officials that time was running out. \nThe bipartisan group of mostly former senior U.S. officials, including George W. Bush administration veterans Stephen Hadley and Carlos Gutierrez, met with Wang Yang, a member of China’s ruling seven-man Politburo Standing Committee, and Liu He, an economist and ally of President Xi Jinping, among other senior Chinese leaders, the person said. \nThey delivered a message that trade frictions “are not under control” and that there was a high likelihood of “significant actions” coming soon, according the person who was present at the meetings. \n“We hear everything from: both sides will lose, to you’ll lose more,” the person said, characterizing the reception the delegation received from Chinese leaders. RESILIENT TO A TRADE WAR \nU.S. businesses operating in China have long chafed at government policies they see as intended to assimilate and supplant foreign technology. \nAt stake is who controls intellectual property, and how you protect it, said Tim Adams, former U.S. Treasury undersecretary for international affairs in the Bush administration. \n“The question is, how do you use a scalpel to respond to it, and does the scalpel actually change behavior because it’s a scalpel and not a sledgehammer,” said Adams, who now leads the Washington-based Institute of International Finance. FILE PHOTO: U.S. President Donald Trump and first lady Melania arrive for the state dinner with China's President Xi Jinping and China's first lady Peng Liyuan at the Great Hall of the People in Beijing, China, November 9, 2017. REUTERS/Jonathan Ernst/File Photo \nHe said China would probably retaliate by weighing whether the actions were in line with World Trade Organization rules before slowly ratcheting up pressure on U.S. businesses, for example by buying from a European company such as Airbus instead of Boeing. \nMeanwhile, China’s 2017 trade surplus with the United States reached an all-time high of $275.81 billion, Chinese Customs data showed last week. \nThe growing likelihood of U.S. trade remedies against China comes amid a bipartisan push in Washington to tighten national security reviews of Chinese companies’ efforts to scoop up U.S. technology firms, often in industries closed to U.S. companies in China. \nBut many in China see such efforts as sure to backfire. \n“Politically, the administration of President Donald Trump can’t afford to see China-U.S. economic and trade ties become strained. China is more resilient to a trade war,” China’s state-run Global Times said on Sunday. \nChina’s Ministry of Commerce did not comment on the U.S. business delegation or the risk of major trade friction. But it said last week that China would take all necessary measures to defend itself. \n“KIBBLES AND BITS” \nBeijing suspects that even if Trump implements “targeted tariffs,” as some in the U.S. tech sector expect, they would likely amount to just a few percentage points of the more than $600 billion annual goods and services trade, Chinese experts have said. \nFor local governments in export-dependent areas, the threat is more worrying. One official in the export powerhouse of Zhejiang province expressed concern to Reuters about Trump’s possible actions, but declined to speak on the record. \nThe government in Beijing, however, remains stoic. \n“Are Chinese officials getting nervous now amid a coming U.S.-China trade war? I don’t think so,” said Wang Jiangyu, a trade expert at the National University of Singapore. \nThe country has negotiated its way out of previous Section 301 investigations, including in 1992 and 1995. \nAnd a person close to China’s Commerce Ministry, who asked not to be named because of the sensitivity of the matter, said tariffs from the Section 301 case would be self-defeating, and urged negotiation instead. \n“We should sit down and discuss this. If their demands are reasonable, we don’t want to go to the WTO,” the person said. \nThat inclination to fall back on talks and the WTO to resolve frictions may be China’s miscalculation this time, people in the U.S. business community say. \nWhat the Chinese government doesn’t understand is that the Trump administration is “deadly serious,” the member of the U.S. business delegation said. “They aren’t going to settle for kibbles and bits.” Reporting by Michael Martina and Kevin Yao; Additional reporting by Lesley Wroughton in Washington; Editing by Gerry Doyle", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T17:33:00.000+02:00", "crawled": "2018-01-19T12:05:16.004+02:00", "highlightTitle": ""}