{"organizations": [], "uuid": "cb3a0648a91a01f839ddbecf4baa6314f565c8d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/crypto-conference/rpt-virtual-currency-meets-finance-in-glitzy-swiss-resort-idUSL8N1PE0RC", "country": "US", "domain_rank": 408, "title": "RPT-Virtual currency meets finance in glitzy Swiss resort", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.893, "site_type": "news", "published": "2018-01-19T15:00:00.000+02:00", "replies_count": 0, "uuid": "cb3a0648a91a01f839ddbecf4baa6314f565c8d0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/crypto-conference/rpt-virtual-currency-meets-finance-in-glitzy-swiss-resort-idUSL8N1PE0RC", "ord_in_thread": 0, "title": "RPT-Virtual currency meets finance in glitzy Swiss resort", "locations": [], "entities": {"persons": [{"name": "brenna hughes neghaiwi", "sentiment": "negative"}, {"name": "switzerlan", "sentiment": "negative"}, {"name": "shafqat hussain", "sentiment": "none"}], "locations": [{"name": "st. moritz", "sentiment": "none"}, {"name": "st. moritz", "sentiment": "none"}, {"name": "luxembourg bitstamp", "sentiment": "none"}], "organizations": [{"name": "crypto finance conference", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats story from Jan 18 with no changes to text)\nBy Brenna Hughes Neghaiwi\nST. MORITZ, Switzerland, Jan 18 (Reuters) - More than a dozen billionaires flocked to the Swiss ski resort of St. Moritz this week to meet up with blockchain entrepreneurs, fund managers and government officials to discuss investing into the burgeoning cryptocurrency scene.\nThe meeting came amid one of the most volatile weeks for flagship virtual currency bitcoin, which at one stage had halved in value from its record high of $20,000 set on the Luxembourg Bitstamp exchange a month ago, amid investor fears of a regulatory crackdown to curb speculators.\nBut that didn’t appear to deter some investors at the exclusive three-day Crypto Finance Conference, which was stamped with a 3,700 euro (or one bitcoin) ticket price.\n“I see more people going into cryptocurrency and blockchain. I reckon it’s the next big thing,” said Shafqat Hussain, representing a private Monaco-based family fund at the event.\nBlockchain is the transaction-logging technology underpinning bitcoin and has attracted huge interest from a range of industries.\n“In all other disruptive industries I’ve been a part of, it always took ten to twenty years to go mainstream and get mainstream money,” venture capitalist Daniel Gutenberg said, citing early internet expansion into Europe, social media and autonomous cars as his earlier investment focuses.\n“And the blockchain revolution has done that in three years,” he said. “So now there’s plenty of money, and plenty of super-intelligent people working on it .... I think it will advance at a speed that surprises us all.”\nGutenberg said his investments were limited to groups managing cryptocurrency holdings - as opposed to new blockchain projects - thus far.\n“I need to see more mature companies, that actually have a product that is being used, and are out of the beta stage,” he said. “But this is happening as we speak, in the next few weeks and months.”\nAt the event overlooking the Swiss Alps, more than a dozen funds and twice as many blockchain projects seeking to raise money by selling virtual currencies presented to high net worth individuals and members of the Forbes billionaires list.\n“What’s special about this conference is it’s the first that brings together people with money and people with this new technology,” Olga Feldmeier, chief executive of blockchain private banking startup Smart Valor, said.\nFeldmeier said it had become difficult for wealthy individuals without strong technical expertise to jump into leading cryptocurrency bitcoin after its valuation skyrocketed in 2017. Funds were now flocking into the space providing investors access to cryptocurrencies and public digital currency fundraisers, known as initial coin offerings (ICOs).\nVenture capitalists said so much money was now flowing into ICOs that many entrepreneurs in the space were now bypassing early VC funding.\n“Whereas a venture capitalist will contribute maybe $2-3 million over two years, an ICO will raise $15 million in two weeks,” said Michael Sidler, a partner at Zurich-based venture investor Redalpine, adding venture capital would likely take on a new role in the changing investor environment. (Reporting by Brenna Hughes Neghaiwi; Editing by Mark Potter)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T15:00:00.000+02:00", "crawled": "2018-01-20T17:43:33.000+02:00", "highlightTitle": ""}