{"organizations": [], "uuid": "4f0b55da7fcbd3c2aa360b4c9e66e6c6fb26966b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-world-stock-rally-rolls-on-with-best-start-in-eight-years-idUSL8N1P30V7", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-World stock rally rolls on with best start in eight years", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-08T17:55:00.000+02:00", "replies_count": 0, "uuid": "4f0b55da7fcbd3c2aa360b4c9e66e6c6fb26966b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-world-stock-rally-rolls-on-with-best-start-in-eight-years-idUSL8N1P30V7", "ord_in_thread": 0, "title": "GLOBAL MARKETS-World stock rally rolls on with best start in eight years", "locations": [], "entities": {"persons": [{"name": "tommy wilkes", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "wall street", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* World stocks enjoy best start to year since 2010\n* European stocks hit highest since 2015\n* Dollar strengthens against euro after recent weakness\n* Oil prices pause after recent rally\nBy Tommy Wilkes\nLONDON, Jan 8 (Reuters) - World stock markets hovered close to all-time highs on Monday as the best start to a year in eight years showed little sign of running out of steam, with the combination of strong global growth and low inflation powering the appetite for risk.\nEuropean stocks opened higher, hitting their highest levels since August 2015, while Asian markets inched towards all-time peaks.\nWall Street last week posted its best start to a year in more than a decade; Friday’s U.S. jobs report, while weaker than expected, encouraged hopes that brisk growth and low inflation can be sustained this year.\nThe world index was flat, just below record highs. . It has gained 2.5 percent in the first five trading sessions of the year, its best start since 2010, according to Thomson Reuters data.\nThe U.S. dollar recovered after a weak start to the year, strengthening past the key level of $1.20 against the euro, although with bearish positions against the greenback high, many traders are betting on a stronger single currency.\nPositive euro zone economic data - with economic growth in the euro zone is on its best run in a decade - has helped the euro, and investors globally wanting exposure to the economic recovery in the region have piled into European assets.\nThe synchronised global recovery has prompted central banks across the world to follow the Federal Reserve’s lead and start moving towards tighter monetary policy in recent months, supporting their currencies against the dollar.\n“The overall trend is minutely supportive for the U.S. dollar as we are seeing a global recovery led by China and Europe and there is a lot of cash sitting on the sidelines, waiting to buy European assets,” said Peter Chatwell, head of European rates strategy at Mizuho International in London.\nEuro zone blue chip stocks were up 0.23 percent, with France’s CAC 40 ahead by 0.3 percent and Germany’s DAX ahead by 0.31 percent.\nWall Street has already enjoyed its best start to a year in more than a decade, with the Dow up 2.3 percent last week and the S&P 500 2.6 percent. The tech-heavy Nasdaq led the charge with a rise of 3.4 percent.\nAttention in the U.S. will turn to the quarterly earnings season, which kicks off this week with the Street expecting solid growth of around 10 percent.\nAnalysts at Bank of America Merrill Lynch said that the global economy had entered 2018 “firing on all cylinders”.\n“This growth is keeping our quant models bullish and driving earnings revisions to new highs,” they added. “We stay long outside the U.S., with Asia ex-Japan and Nikkei our growth plays, Europe still for yield.”\nIn commodity markets, many commodities paused after the recent run-up in prices, supported by a broadly weak U.S. dollar and the rise in global growth expectations.\nOil prices held just below the near-three-year highs hit last week. A slight decline in the number of U.S. rigs drilling for new production kept oil prices in check.\nGold prices dipped after the dollar gained, with spot prices down 0.1 percent. The precious metal has posted four consecutive weeks of gains.\nFor Reuters Live Markets blog on European and UK stock markets open a news window on Reuters Eikon by pressing F9 and type in ‘Live Markets’ in the search bar.\nReporting by Tommy Wilkes; Additional reporting by Saikat Chatterjee and Wayne Cole; Editing by Kevin Liffey\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T17:55:00.000+02:00", "crawled": "2018-01-09T16:55:03.001+02:00", "highlightTitle": ""}