{"organizations": [], "uuid": "eeecc1cd55ddef92b03f363a1367e639ccea4ede", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/us-health-abortion-hardship/denial-of-abortion-leads-to-economic-hardship-for-low-income-women-idINKBN1F731Z", "country": "US", "domain_rank": 408, "title": "Denial of abortion leads to economic hardship for low-income women", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:13:00.000+02:00", "replies_count": 0, "uuid": "eeecc1cd55ddef92b03f363a1367e639ccea4ede"}, "author": "", "url": "https://in.reuters.com/article/us-health-abortion-hardship/denial-of-abortion-leads-to-economic-hardship-for-low-income-women-idINKBN1F731Z", "ord_in_thread": 0, "title": "Denial of abortion leads to economic hardship for low-income women", "locations": [], "entities": {"persons": [{"name": "wade", "sentiment": "none"}, {"name": "diana greene foster", "sentiment": "none"}, {"name": "roe", "sentiment": "none"}, {"name": "onnie cohen", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "american journal of public health", "sentiment": "none"}, {"name": "advancing new standards in reproductive health", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 17 PM / Updated 20 minutes ago Denial of abortion leads to economic hardship for low-income women Ronnie Cohen   Women who want an abortion but are denied one are more likely to spend years living in poverty than women who have abortions, a new study suggests. \nCarrying an unwanted pregnancy to term quadrupled the odds that a new mother and her child would live below the federal poverty line, researchers reported in the American Journal of Public Health on Thursday, a few days before the 45th anniversary of the U.S. Supreme Court’s landmark Roe v. Wade ruling legalizing abortion. \n“It’s very powerful to see that women’s decision-making is exactly right on,” said lead author Diana Greene Foster, a professor at Advancing New Standards in Reproductive Health, a research group   California, San Francisco. \n“The things they worry about coming through are exactly the things they experience when they’re denied an abortion and carry the pregnancy to term,” she said in a phone interview. “They tell us they can’t afford a baby, and we find they become poorer.” \nThe single most common reason women cite for wanting an abortion is because they cannot afford to raise a child, Foster said. \nFor women denied abortions, public-assistance programs failed to make up for the cost of a new baby and to pull households out of poverty, the study found. \nEvery six months over five years, Foster and her team interviewed 813 women at 30 clinics in 21 states. The women either received an abortion or were denied it because they were past the clinic’s time limit. On average, the women who were unable to obtain an abortion were nearly five and a half months into their pregnancies. \nWomen who were refused abortions were nearly four times as likely to live below the federal poverty line four years later as women who had abortions, the researchers found. \nFor five years after seeking an abortion, women refused one were more likely than those who had an abortion to report not having enough money to cover basic living expenses. \nOf the women who sought abortions, three-quarters reported not having enough money to cover the costs of housing, transportation and food. Nearly two-thirds - 63 percent - already had at least one child. \nIn a separate report published in 2013, a 42-year-old woman told researchers her decision to seek an abortion was “all financial, me not having a job, living off death benefits, dealing with my 14-year-old son.” She said: “I didn't have money to buy a baby spoon.” ( bit.ly/2mSvUkr ) \n“Women anticipate economic consequences, and when they’re denied an abortion, they experience negative economic consequences – poverty,” Foster said. \n“When they receive an abortion, they slowly gain employment, and their income goes up,” she said. “But when they’re denied an abortion, they’re set back economically, and it takes them years to get where they would have been if they had received an abortion.” \nThe study’s findings don’t surprise Rachel K. Jones, a sociologist and researcher at the Guttmacher Institute in New York. \nMost women who seek abortions are poor or low-income and already have children, she said in an email. “Adding another member to the family requires women to stretch limited resources even further, resulting in higher levels of poverty and reliance on social welfare benefits,” she wrote. \n“Making abortion more accessible and affordable - for example, by requiring Medicaid and all government and private insurance plans to cover abortion - could help women better take care of the children they already have and have children when they are ready to do so,” said Jones, who was not involved with the study. \nSince 2011, hundreds of state-level restrictions on abortion have been implemented in the U.S., leaving women unable to get the abortions they seek, the study authors write. An estimated 4,000 women were denied abortions because of gestational limits in 2010, previous research showed, Foster said. \n“Women seeking abortion are the best judges of their own circumstances,” she said. “Perhaps the availability of hard data and a small shift to considering unwanted pregnancy from women’s perspectives will lead to an expansion of services and an opening of our hearts, minds and wallets.” \nSOURCE: bit.ly/2mSf4SK American Journal of Public Health, online January 18, 2018.", "external_links": [], "published": "2018-01-18T23:13:00.000+02:00", "crawled": "2018-01-18T23:41:54.001+02:00", "highlightTitle": ""}