{"organizations": [], "uuid": "68219946a3b0c825bfdc39f297d8313f33059f31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/02/the-associated-press-us-coal-mining-deaths-surge-in-2017-after-hitting-record-low.html", "country": "US", "domain_rank": 767, "title": "US coal mining deaths surge in 2017 after hitting record low", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T22:33:00.000+02:00", "replies_count": 0, "uuid": "68219946a3b0c825bfdc39f297d8313f33059f31"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/the-associated-press-us-coal-mining-deaths-surge-in-2017-after-hitting-record-low.html", "ord_in_thread": 0, "title": "US coal mining deaths surge in 2017 after hitting record low", "locations": [], "entities": {"persons": [{"name": "zatezalo", "sentiment": "none"}, {"name": "david zatezalo", "sentiment": "none"}, {"name": "joe manchin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "charleston", "sentiment": "none"}, {"name": "w.va", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "west virginia", "sentiment": "none"}, {"name": "montana", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}, {"name": "wyoming", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "upper big branch", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "neutral"}, {"name": "senate", "sentiment": "none"}, {"name": "mine safety and health administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLESTON, W.Va. (AP) — Coal mining deaths surged in the U.S. in 2017, one year after they hit a record low.\nThe nation's coal mines recorded 15 deaths last year, including eight in West Virginia. Kentucky had two deaths, and there were one each in Alabama, Colorado, Montana, Pennsylvania and Wyoming. In 2016 there were eight U.S. coal mine deaths.\nWest Virginia has led the nation in coal mining deaths in six of the past eight years. That includes 2010, when 29 miners were killed in an explosion at the Upper Big Branch mine in southern West Virginia.\nIn September,   appointed retired coal company executive David Zatezalo as the new chief of the Mine Safety and Health Administration. Most of the deaths this year occurred before his appointment. The Wheeling resident retired in 2014 as chairman of Rhino Resources.\nZatezalo was narrowly approved by the Senate in November. His appointment was opposed by Sen. Joe Manchin, D-W.Va., who said he was not convinced Zatezalo was suited to oversee the federal agency that implements and enforces mine safety laws and standards.\nTrump repeatedly voiced support for the coal industry during his presidential campaign. The increasing reliance on natural gas and other less expensive sources of energy has prompted coal use to diminish.\nLast month   brought up for review standards implemented by Barack Obama's administration that lowered the allowable limits for miners' exposure to coal dust. MSHA indicated it is reconsidering rules meant to protect underground miners from breathing coal and rock dust — the cause of black lung — and diesel exhaust, which can cause cancer.\nEight coal mining deaths this year involved hauling vehicles and two others involved machinery. None were attributed to an explosion of gas or dust, which was to blame for the Upper Big Branch disaster.\nAccording to MSHA data, seven of the eight U.S. coal mining fatalities in the first half of 2017 involved miners with one year or less experience at the mine, and six involved miners with one year or less experience on the job. In June, MSHA announced an initiative focusing on less experienced miners, including improved mine operators' training programs.\nThe number of coal mining fatalities was under 20 for the fourth straight year after reaching exactly 20 in 2011, 2012 and 2013. By comparison, in 1966, the mining industry counted 233 deaths. A century ago there were 2,226.\nMSHA has attributed low numbers in previous years to far fewer coal mining jobs and tougher enforcement of mining safety rules. Zatezalo has said his first priority was preventing people from getting hurt.\n\"President Trump is strongly committed to the health and safety of America's miners,\" Zatezalo said in a statement Tuesday. \"At MSHA, our focus is on ensuring that every miner is able to return safely to their loved ones at the end of every shift. To ensure the health and safety of miners, MSHA will continue to vigorously emphasize safety enforcement, technology, education and training, and compliance and technical assistance.\"\nThere have been a record-low 13 fatalities in 2017 in non-coal mines that produce gravel, sand, limestone and mineable metals. There also were 17 such deaths in 2015 and 30 in 2014.\nAppalachia has been especially hit hard by the closing of dozens of mines in recent years, but there was a turnaround in production in 2017.\nAccording to the Energy Information Administration's weekly estimates, U.S. coal production increased 8.9 percent in the 52 weeks ending Dec. 23, the latest available. Production in West Virginia increased 16 percent, including 25 percent in coal-rich southern West Virginia. Wyoming, the top coal-producing state, saw a 10.7 percent increase.\nThere were about 92,000 working miners in the United States in 2011, compared with about 52,000 in 2016, the lowest figure since the Energy Information Administration began collecting data in 1978. The 2017 numbers are not yet available.", "external_links": [], "published": "2018-01-02T22:33:00.000+02:00", "crawled": "2018-01-03T10:35:18.002+02:00", "highlightTitle": ""}