{"organizations": [], "uuid": "c85b2dfea35c8c8e92a001ec55772ebb7d08eba7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222582051&w=1200&r=LYNXMPEE0G01Y", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-alphabet-youtube/youtube-again-revises-rules-to-protect-advertisers-from-offensive-content-idINKBN1F6048", "country": "US", "domain_rank": 408, "title": "YouTube again revises rules to protect advertisers from offensive content", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T03:01:00.000+02:00", "replies_count": 0, "uuid": "c85b2dfea35c8c8e92a001ec55772ebb7d08eba7"}, "author": "", "url": "https://in.reuters.com/article/us-alphabet-youtube/youtube-again-revises-rules-to-protect-advertisers-from-offensive-content-idINKBN1F6048", "ord_in_thread": 0, "title": "YouTube again revises rules to protect advertisers from offensive content", "locations": [], "entities": {"persons": [{"name": "paresh dave", "sentiment": "none"}], "locations": [], "organizations": [{"name": "youtube", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "alphabet inc", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 1:10 AM / Updated 20 hours ago YouTube again revises rules to protect advertisers from offensive content Paresh Dave 3 Min Read \nSAN FRANCISCO (Reuters) - Alphabet Inc’s Google is making its second attempt in less than a year to protect advertisers on its YouTube user channels from being associated with videos featuring violence, gore or bad language. \nUnder the new standards, Google will remove advertising from a “significant” number of YouTube channels, 99 percent of which generated less than $100 from ads in the last year, the company announced Tuesday in response to advertisers that felt they have been underwriting inappropriate material. \nGoogle is vowing to have people review every second of the most popular videos eligible for advertising by the end of March worldwide, and it is modifying the prerequisites for having a commercial channel. \n“While we took several steps last year to protect advertisers from inappropriate content, we know we need to do more to ensure that their ads run alongside content that reflects their values,” Paul Muret, Google vice president of display, video and analytics, wrote in a blog post Tuesday. \nThe previous round of policy-tightening came after more than 250 advertisers cut back on YouTube ad-buying last spring following news reports that found their ads displayed alongside extremist propaganda. \nMany brands returned within weeks or months, only to again suspend dealings with YouTube in the autumn because of headlines that linked them to videos in which children appeared endangered or popular cartoons that had been disturbingly altered. Mondelez International Inc, whose brands include Oreo cookies and Ritz crackers, and computer and printer maker HP Inc were among dropouts. \nThe issues have not affected YouTube’s revenue, which represents a crucial growth area for Google, according to financial analysts. \nStarting Feb. 20, videomakers will need to attract users watching a total of at least 4,000 hours of their clips within the preceding 12 months and notch 1,000 followers before being able to host ads and share in revenue from them. The requirement introduced last April had been 10,000 followers with no viewing time standard. \nBooting small channels from advertising eligibility will not fully address concerns raised by advertisers about videomakers going too far, YouTube acknowledged in the blog post. \nCelebrity video blogger Logan Paul has 15 million followers, but YouTube last week pared back its commercial relationship with him after he drew public outrage for showing a suicide victim in a clip. \nYouTube executives said they would “schedule conversations with our creators in the months ahead” to see “what more we can do to tackle that challenge.” Reporting by Paresh Dave; Editing by Leslie Adler", "external_links": [], "published": "2018-01-17T03:01:00.000+02:00", "crawled": "2018-01-17T03:20:59.006+02:00", "highlightTitle": ""}