{"organizations": [], "uuid": "28e70ea623efca05fa1fcce00304130617587951", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-906956090.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/united-states-russian-gas/", "country": "US", "domain_rank": 1196, "title": "This Is How the U.S. Almost Bought Russian Natural Gas | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.782, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "28e70ea623efca05fa1fcce00304130617587951"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/19/united-states-russian-gas/", "ord_in_thread": 0, "title": "This Is How the U.S. Almost Bought Russian Natural Gas | Fortune", "locations": [], "entities": {"persons": [{"name": "samuel corum", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "engie sa", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil This Is How the U.S. Almost Bought Russian Natural Gas Smoke rises from a natural gas power plant into the sky outside of Dallas, Texas, United States on January 04, 2018. Samuel Corum—Anadolu Agency/Getty Images By Bloomberg January 19, 2018 \nFor a lesson in how liquefied natural gas is radically reshaping the global energy market, consider the twisted tale of a ship heading to Boston that made a U-turn on Friday. The huge Gaselys tanker had been closely tracked by energy traders, since its arrival would mark the first imports that included some gas from a project in Russia subject to U.S. sanctions. The journey, though interrupted, is raising questions about where America gets its fuel from. 1. Why is the U.S. buying gas from Europe? \nWell, it was cold. French energy giant Engie SA bought the cargo to meet high gas demand during freezing weather in the northeast U.S. Although not completely unheard of (Norway has previously sent LNG to the U.S.), this would have been the first time that the country imported a cargo from northwest European storage tanks, some of which undoubtedly came from the $27 billion Yamal LNG plant Russia started a month ago. However, the Gaselys tanker changed course a day before its scheduled arrival in Boston, so the cargo never hit U.S. shores. 2. Why did the tanker make a U-turn? \nThe answer is almost certainly prices. Since the ship set off from London three weeks ago, natural gas prices in the northeast U.S. have fallen from record levels, which may make it more profitable to send the cargo to Asia or another higher-price market, even considering shipping costs. There is a possibility that Gaselys is diverting to delay arrival into Everett, as has been seen with other shipments into the terminal, according to cargo-tracking company Kpler SAS. Engie declined to comment on the tanker movement. 3. Was it actually Russian gas? \nYes and no. The actual molecules were a mix of gas of varied provenance, coming as they did from a storage tank in the U.K. that also contained fuel from Algeria, Trinidad and Tobago and Qatar, among others. What we do know is that Engie bought the cargo from Petroliam Nasional Bhd and that the Malaysian company in turn bought it from Yamal LNG operator Novatek PJSC. It was the first cargo from the Siberian plant. 4. So why didn’t it come straight from Siberia? \nBecause Yamal LNG is the most northerly plant producing the fuel in the world, with no sun for two months of the year and temperatures that can drop to minus 50 Celsius (minus 58 Fahrenheit), it had to build the world’s first ice-breaking LNG tankers able to sail through more than 2 meters (6.5 feet) of ice. The fuel is transshipped onto cheaper conventional vessels in northwest Europe at terminals with the facilities to do so, including the U.K.’s Isle of Grain. The ice-class tanker Christophe de Margerie picked up the first cargo for delivery to storage tanks at a U.K. terminal. The first vessel of its kind is named after the colorful former Total SA chief executive officer who died in 2014 when his plane crashed into a snowplow at Moscow airport. 5. Why couldn’t Boston get U.S. gas? \nWhile the U.S. is the world’s biggest natural gas producer and is now also a net exporter of the fuel thanks to its shale gas boom and the start of exports from the Gulf Coast in February 2016, New England is still dependent on LNG brought in on ships for almost 10 percent of its needs, mainly in winter for use in heating, according to the State Department. LNG, which is gas cooled to minus 260 degrees Fahrenheit (minus 162 degrees Celsius) so it takes up 1/600th of the volume, can’t be shipped in from new export terminals on the Gulf of Mexico. That’s because none of the world’s fleet of almost 500 tankers meets the requirements of the 1920 Jones Act, which mandates that vessels moving between U.S. ports be built and registered in the country, and crewed by Americans. 6. Is Russian LNG likely to come to the U.S. in the future? \nPossibly, but it will depend on prices. As long as they are high enough in Asia to offset increased shipping costs in the winter, cargoes from Yamal will likely go there. Novatek has a contract with Engie for supplies from the project, which are for the Montoir terminal in western France but are not restricted by destination, meaning the French company may send them elsewhere, including its Everett terminal near Boston. 7. Weren’t there U.S. sanctions on Russian energy? \nThe U.S. in 2014 imposed financial sanctions on a number of Russian energy projects, including the Yamal LNG project, due to the nation’s role in the Ukrainian crisis. The restrictions forced Novatek to re-think funding options for the project and the company banned deputy chief executive officer Mark Gyetvay from working on the financing deal as he is a U.S. citizen. The project succeeded despite the sanctions. As far as the cargo on the Gaselys is concerned, Engie said the fuel was compliant with all U.S. trade laws. 8. Does it really matter? \nThe average family in New England trying to keep out Jack Frost probably doesn’t care much about where their natural gas comes from. While there might be concern that the U.S. is importing Russian fuel despite the sanctions, there is no question of any dependency. If anything, it shows that thanks to a boom in LNG production, natural gas is on the verge of becoming a truly global commodity unbound by the physical constraints of pipelines. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T17:20:25.005+02:00", "highlightTitle": ""}