{"organizations": [], "uuid": "d4673084250a1db5b1f630ecec15f37621774ac3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/energy-transf-natgas-rover-ohio/etp-says-frustrated-by-order-to-stop-rover-pipeline-drilling-in-ohio-idUSL2N1PO1F4", "country": "US", "domain_rank": 408, "title": "ETP says frustrated by order to stop Rover pipeline drilling in Ohio", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T22:58:00.000+02:00", "replies_count": 0, "uuid": "d4673084250a1db5b1f630ecec15f37621774ac3"}, "author": "", "url": "https://www.reuters.com/article/energy-transf-natgas-rover-ohio/etp-says-frustrated-by-order-to-stop-rover-pipeline-drilling-in-ohio-idUSL2N1PO1F4", "ord_in_thread": 0, "title": "ETP says frustrated by order to stop Rover pipeline drilling in Ohio", "locations": [], "entities": {"persons": [{"name": "rover pipeli", "sentiment": "negative"}, {"name": "marcellus", "sentiment": "none"}], "locations": [{"name": "ohio", "sentiment": "none"}, {"name": "west virginia", "sentiment": "none"}, {"name": "u.s. midwest", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "tuscarawas river", "sentiment": "none"}, {"name": "utica", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "etp", "sentiment": "negative"}, {"name": "energy transfer partners", "sentiment": "none"}, {"name": "federal energy regulatory commission", "sentiment": "none"}, {"name": "ferc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 9:02 PM / Updated 9 minutes ago ETP says frustrated by order to stop Rover pipeline drilling in Ohio Reuters Staff 3 Min Read \nJan 29 (Reuters) - Energy Transfer Partners said it was “frustrated” by an order by U.S. federal energy regulators to stop drilling under the Tuscarawas River in Ohio as the company works to complete the Rover natural gas pipeline by the end of the first quarter: \n* “Rover is frustrated by the inaccurate central premise underlying the letter received from the Federal Energy Regulatory Commission (FERC) ... directing operations to cease at the Tuscarawas River,” ETP said in a filing made available on Monday \n* ETP wants FERC to allow the company to continue drilling the second hole under the river as per the pre-approved plan \n* “Rover and the capacity it represents are badly needed,” ETP said about its $4.2 billion project designed to carry up to 3.25 billion cubic feet per day of gas from the Marcellus and Utica shale fields in Pennsylvania, Ohio and West Virginia to the U.S. Midwest and Ontario in Canada \n* After ETP lost a reported 200,000 gallons of drilling fluid - a clay and water mix - down the hole it was drilling under the Tuscarawas, FERC told the company last week to consider alternatives to get a second Rover pipe across river \n* Those alternatives included: completing the current drill, finding another location to cross under the river or go with just one pipe across the river \n* “Both the Commission and Rover fully expected the loss of drilling fluids during the (horizontal drill) on Rover,” ETP said, noting that “no fluid has reached the surface, and no impacts on sensitive resources have been documented” \n* ETP already has one pipe under the Tuscarawas that is in service with over 1 bcfd flowing through it. One bcfd of gas is enough for about five million U.S. homes. \n* While drilling the first pipe under the Tuscarawas, the company in April spilled about two million gallons of drilling fluid into a wetland. That spill led FERC in May to temporarily ban Rover from horizontal drilling \n* Officials at Rover were not immediately available for comment. Last week, ETP said it still expected to complete the project by the end of the first quarter \n* Analysts, however, said completion of the project will likely be delayed into the second quarter, at least \n* Major producers signed up to use Rover include units of privately-held Ascent Resources, Antero Resources, Range Resources, Southwestern Energy, Eclipse Resources and EQT Corp. Reporting by Scott DiSavino Editing by Marguerita Choy", "external_links": [], "published": "2018-01-29T22:58:00.000+02:00", "crawled": "2018-01-29T23:16:13.036+02:00", "highlightTitle": ""}