{"organizations": [], "uuid": "eebf99a902eb373ea45d3c8ab3f1ff219a48fb08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221241332&w=1200&r=LYNXMPEE0A1T9", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-eu-bulgaria/bulgaria-savors-eu-embrace-despite-critics-idUSKBN1F02V8", "country": "US", "domain_rank": 408, "title": "Bulgaria savors EU embrace despite critics", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T22:57:00.000+02:00", "replies_count": 0, "uuid": "eebf99a902eb373ea45d3c8ab3f1ff219a48fb08"}, "author": "", "url": "https://www.reuters.com/article/us-eu-bulgaria/bulgaria-savors-eu-embrace-despite-critics-idUSKBN1F02V8", "ord_in_thread": 0, "title": "Bulgaria savors EU embrace despite critics", "locations": [], "entities": {"persons": [{"name": "alastair macdon", "sentiment": "negative"}, {"name": "tsvetelia tsolova", "sentiment": "none"}, {"name": "boyko borissov", "sentiment": "none"}, {"name": "borissov", "sentiment": "none"}], "locations": [{"name": "bulgaria", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "sofia", "sentiment": "none"}, {"name": "schengen", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "min read  sofia", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 8:59 PM / in 7 minutes Bulgaria savors EU embrace despite critics Alastair Macdonald , Tsvetelia Tsolova 4 Min Read \nSOFIA (Reuters) - Bulgaria’s government won endorsement from the EU executive on Thursday for its demands to be let in to Europe’s more exclusive clubs despite critics at home and abroad who question Sofia’s record on tackling corruption. \nEleven years after joining the European Union, the bloc’s poorest nation grasped its first taste of holding the rotating presidency of EU ministerial councils to stage a show of loyalty for visiting Brussels dignitaries and ram home its demands to join the euro currency area and Schengen free-travel zone. \nPrime Minister Boyko Borissov, a former bodyguard to the Soviet-era Communist dictator, welcomed fellow conservatives who run the three main Brussels political institutions to Sofia, pledging to help ease tensions between east and west inside the EU and between the Union and its Russian and Turkish neighbors. \nThough the presidency of the EU offers little direct power, it offers Borissov a platform which he used to renew Bulgarian demands to be allowed to join Schengen and the euro’s “waiting room”, the ERM-2 exchange rate mechanism. Worries over organized crime and Bulgaria’s relative poverty have stood in its way. \nThe premier played down problems with crime - despite the assassination of a wealthy businessman in broad daylight in Sofia this week - and insisted historic ties with Russia were an asset to the EU that in no way detracted from his country’s loyalty to the Western alliance. \nIt was not “fair”, therefore, that Bulgaria was denied entry to Schengen, despite defending the EU’s external border with Turkey, and to the euro zone, despite meeting all the economic criteria and having fixed its currency to the euro for 20 years. European Council President Donald Tusk speaks next to Bulgaria's Prime Minister Boyko Borissov, European Commission President Jean-Claude Juncker and Bulgarian President Rumen Radev (R-L) during an event marking the start of Bulgaria's six-month presidency of EU ministerial councils in Sofia, Bulgaria, January 11, 2018. Krum Stoev/EU2018BG/Handout via REUTERS \nEuropean Commission President Jean-Claude Juncker, the EU chief executive, has thrown his weight behind those demands and repeated that position in Sofia on Thursday evening: \n“Your place is in Europe and your place is in Schengen and your place is in the euro,” Juncker told him. “We will work for that. The Commission will be by Bulgaria’s side.” Slideshow (3 Images) PROTESTS \nThat will not in itself overcome resistance from wary member states. Borissov’s finance minister said frustration had grown to such an extent that he was ready to call their bluff and apply for the next step toward the euro zone in order to force them to publicly explain their objections. \nDonald Tusk, the former Polish premier who chairs summits of EU leaders, spoke favorably of Bulgaria’s ambitions and, in a speech in fluent Bulgarian that delighted his audience, welcomed Sofia’s push to use the coming six months to re-engage the EU with would-be members in the troubled western Balkans. \nWarm words from the visitors from Brussels did not drown out opposition at home to the government. Borissov dismissed out of hand accusations of shrinking media freedom and his minister in charge of the EU presidency denounced a website run by critical journalists covering the issue as “hate speech” and “fake news”. \nHundreds of people waving banners including “Citizens against the mafia” demonstrated in central Sofia to protest at government approval of new ski facilities in the mountains which they argue shows the authorities favoring commercial interests over environmental protection laws. Reporting by Alastair Macdonald and Tsvetelia Tsolova Editing by Jeremy Gaunt", "external_links": [], "published": "2018-01-11T22:57:00.000+02:00", "crawled": "2018-01-11T23:16:42.003+02:00", "highlightTitle": ""}