{"organizations": [], "uuid": "7075c8fb8c3f0067223e0abdf21eb4db76b48d29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/27/104918289-RTX3Z4EI.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/bomb-cyclone-to-hit-east-coast-amid-low-fuel-supply.html", "country": "US", "domain_rank": 767, "title": "Bomb cyclone to hit east coast amid low fuel supply", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-04T13:56:00.000+02:00", "replies_count": 0, "uuid": "7075c8fb8c3f0067223e0abdf21eb4db76b48d29"}, "author": "David Reid", "url": "https://www.cnbc.com/2018/01/04/bomb-cyclone-to-hit-east-coast-amid-low-fuel-supply.html", "ord_in_thread": 0, "title": "Bomb cyclone to hit east coast amid low fuel supply", "locations": [], "entities": {"persons": [{"name": "jeff strum", "sentiment": "negative"}, {"name": "robert frank", "sentiment": "negative"}, {"name": "schork", "sentiment": "none"}, {"name": "stephen schork", "sentiment": "none"}], "locations": [{"name": "boston harbor", "sentiment": "none"}, {"name": "new york harbor", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "erie", "sentiment": "none"}, {"name": "u.s. east coast", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fuel oil is set to lead the energy market higher as a current supply shortage coincides with the big freeze hitting the U.S. east coast, according to an analyst.\nMore than 40 million people up and down the eastern seaboard were subject to a winter warning Thursday with more than 20,000 without power. So far, more than 3,000 flights scheduled for Thursday and Friday have been canceled.\nBoston is expecting up to a foot of snow while strong winds are expected in New England. Power use from consumers is expected to rise as a cold front whips up behind the storm.\nStephen Schork, founder and editor of The Schork Report, told CNBC Thursday that the main effect of the cold snap on energy markets will be seen in the distillate fuel oil contracts.\nSchork said he was seeing strong physical market trading in Boston Harbor and New York Harbor while supply levels of fuel oil were down by as much as 35 percent on a year-on-year basis.\n\"Certainly, we have seen very strong action with distillate leading the market higher. The spreads are indicating that if this weather holds you can expect to see further strength in the market,\" he said.\nProducts known as No. 1, No. 2 and No. 4 fuel oils are used primarily for space heating and electric power generation.\nNatural gas markets have also received a bump from the wave of icy weather, with prices rallying for the last two weeks before falling back slightly Wednesday.Schork said the current price of around $3 per thousand cubic feet for natural gas futures was still very low and equated to an oil barrel price of about $19.\nThe energy analyst also said that the recent 20 percent rally in natural gas is probably complete with traders noting the high levels of natural gas sitting in storage and improved weather to come.\n\"We don't see prolonged demand in the market if the cold snap doesn't last beyond the two-week forecast,\" he said.\nshow chapters Why oil has not been supporting related currencies      11 Hours Ago | 04:11 Schork added that the price of West Texas Intermediate (WTI) oil will not be affected as it makes and takes delivery in Oklahoma, away from the effects of the weather.\nOn the overall effect for the consumer, the analyst said that the weather event would be short-term in nature and the current era of rising commodity prices was better viewed as a sign of an improving U.S. economy.", "external_links": [], "published": "2018-01-04T13:56:00.000+02:00", "crawled": "2018-01-04T13:56:59.010+02:00", "highlightTitle": ""}