{"organizations": [], "uuid": "63e3bffcdc68c95a67184bc66b1ec18380e2e939", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-john-onoda-joins-gagen-macdonald-as-senior-corporate-counsel.html", "country": "US", "domain_rank": 767, "title": "John Onoda Joins Gagen MacDonald as Senior Corporate Counsel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-03T23:00:00.000+02:00", "replies_count": 0, "uuid": "63e3bffcdc68c95a67184bc66b1ec18380e2e939"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-john-onoda-joins-gagen-macdonald-as-senior-corporate-counsel.html", "ord_in_thread": 0, "title": "John Onoda Joins Gagen MacDonald as Senior Corporate Counsel", "locations": [], "entities": {"persons": [{"name": "john onoda joins gagen macdonald", "sentiment": "negative"}, {"name": "gagen macdonald", "sentiment": "negative"}, {"name": "charles schwab", "sentiment": "none"}, {"name": "maril macdonald", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "ohn onoda", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "visa usa", "sentiment": "none"}], "organizations": [{"name": "levi strauss & co.", "sentiment": "none"}, {"name": "onoda", "sentiment": "none"}, {"name": "general motors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 3, 2018 /PRNewswire/ -- Strategy execution firm Gagen MacDonald announced today that John Onoda, former corporate and consulting executive, has joined the firm as a senior corporate counselor. Based in San Francisco, Onoda will help counsel the firm's clients on corporate character, culture and business transformation, drawing on his three decades of experience, including Chief Communications roles at Charles Schwab, Visa USA, General Motors and Levi Strauss & Co.\n\"John is one of our industry's top counselors, and I'm delighted to welcome him to our team. Not only has he helped transform some of the world's leading brands as both an in-house executive and outside advisor, but he carries a reputation for passion, integrity, and joyfulness that deeply aligns with our firm's values,\" said Gagen MacDonald founder and CEO Maril MacDonald.\nOnoda brings a great understanding of the complexity of large, global organizations and the cross-functional work required to harmonize a company's strategy, structure, culture, and brand in order to yield positive results. For the past 15 years, he has served as a Senior Consultant at FleishmanHillard, where in addition to advising and coaching clients on how to operationalize their company strategies, he served on the agency's International Advisory Board. Onoda began his career in public relations with roles at McDonald's, Holiday Inn, and Mitchell Energy & Development, and has been a highly influential member of top industry organizations, including serving on the boards of the Arthur W. Page Society, Business for Social Responsibility, and Public Relations Society of America (PRSA).\nOnoda comes to Gagen MacDonald highly decorated for his achievements and contributions to communications, including receiving the Milestones in Mentoring award from the Betsy Plank Center for Leadership in Public Relations, the Distinguished Service Award from the Arthur W. Page Society, and induction into PRWeek's Hall of Fame.\nHe holds a bachelor's degree in communications from the University of Michigan, a juris doctorate from Indiana University, and a master's in journalism from Northwestern University.\nFounded in 1998, Gagen MacDonald is a woman-owned consulting firm focused on employee engagement, culture change, and leadership for many of the world's largest brands. Throughout its 19-year history, the company has undergone several quantum leaps to remain on the cutting edge of accelerating organizational transformation and change.\n\"In today's stormy communications environment where in-house professionals are buffeted daily by change and new demands, it's easy to lose sight of strategic goals, said Onoda. \"I'm happy to be joining a firm intent on helping its clients reach their most critical objectives.\"\nAbout Gagen MacDonald\nGagen MacDonald is a strategy execution firm specializing in employee engagement, culture change, and leadership. Working collaboratively from the corporate office to the front line, Gagen uses an organization's brand, culture, vision, and history to motivate and align employees to transform companies, accomplish business objectives and drive reputation from the inside out. As a pioneer in organizational change, Gagen has helped some of the world's biggest brands, including Coca-Cola, DowDuPont, GE, Johnson & Johnson, and Walgreens Boots Alliance. To learn more, please visit www.gagenmacdonald.com .\nMedia Contact:\nBrad Messinger\nb.messinger@gagenmac.com\n312-619-6134\nwww.gagenmacdonald.com\nView original content: http://www.prnewswire.com/news-releases/john-onoda-joins-gagen-macdonald-as-senior-corporate-counsel-300577099.html\nSOURCE Gagen MacDonald", "external_links": ["http://www.gagenmacdonald.com/", "http://www.prnewswire.com/news-releases/john-onoda-joins-gagen-macdonald-as-senior-corporate-counsel-300577099.html"], "published": "2018-01-03T23:00:00.000+02:00", "crawled": "2018-01-04T00:20:57.000+02:00", "highlightTitle": ""}