{"organizations": [], "uuid": "5b833759e3f82296e4b7005f190265db13726496", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-rockwell-automation-reports-first-quarter-2018-results.html", "country": "US", "domain_rank": 767, "title": "Rockwell Automation Reports First Quarter 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-24T15:00:00.000+02:00", "replies_count": 0, "uuid": "5b833759e3f82296e4b7005f190265db13726496"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-rockwell-automation-reports-first-quarter-2018-results.html", "ord_in_thread": 0, "title": "Rockwell Automation Reports First Quarter 2018 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "milwaukee", "sentiment": "none"}, {"name": "rok", "sentiment": "none"}], "organizations": [{"name": "rockwell automation reports first", "sentiment": "negative"}, {"name": "nyse", "sentiment": "none"}, {"name": "rockwell automation, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reported sales up 6.5 percent year over year; organic sales up 5.3 percent Diluted loss per share of $(1.84); Adjusted EPS of $1.96 Diluted loss per share includes $(3.68) of provisional charges related to the Tax Cuts and Jobs Act of 2017 (the \"Tax Act\") Updating fiscal 2018 Diluted EPS guidance: $3.67 - $3.97 Increasing fiscal 2018 Adjusted EPS guidance: $7.60 - $7.90\nMILWAUKEE--(BUSINESS WIRE)-- Rockwell Automation, Inc. (NYSE: ROK) today reported fiscal 2018 first quarter sales of $1,586.6 million, up 6.5 percent from $1,490.3 million in the first quarter of fiscal 2017. Organic sales grew 5.3 percent. Currency translation increased sales by 2.5 percentage points, and the prior year divestiture reduced sales by 1.3 percentage points.\nFiscal 2018 first quarter net loss was $(236.4) million or $(1.84) per share, compared to net income of $214.7 million or $1.65 per share in the first quarter of fiscal 2017. The decrease in EPS was due to charges associated with the Tax Act, totaling $(479.7) million or $(3.68) per share. Fiscal 2018 first quarter Adjusted EPS was $1.96, up 12 percent compared to $1.75 in the first quarter of fiscal 2017. The increase in Adjusted EPS was primarily due to higher sales, partially offset by higher investment spending.\nPre-tax margin was 18.8 percent in the first quarter of fiscal 2018 compared to 17.3 percent in the same period last year. Total segment operating margin was 22.4 percent compared to 21.2 percent a year ago. The increases in pre-tax margin and total segment operating margin were primarily due to higher sales, partially offset by higher investment spending. Total segment operating earnings were $355.5 million in the first quarter of fiscal 2018, up 12 percent from $316.6 million in the same period of fiscal 2017.\nCommenting on the results, Blake D. Moret, chairman and chief executive officer, said, “We had a good start to the fiscal year, with more than five percent organic sales growth in the first quarter. Growth continued to be broad-based across geographies. Heavy industry verticals performed well, supported by recovery in oil and gas. I am very pleased with our twelve percent Adjusted EPS growth in the quarter.\"\nOutlook\nThe following table provides updated guidance as it relates to sales growth and earnings per share for fiscal 2018:\nSales Growth Guidance EPS Guidance Reported sales growth 4.5% to 7.5% Diluted EPS $3.67 - $3.97 Organic sales growth 3.5% to 6.5% Adjusted EPS $7.60 - $7.90 Currency translation ~ 2% Divestiture ~ (1)% Commenting on the outlook, Moret added, \"Global macroeconomic conditions continue to provide a solid backdrop for customer demand. Given our unique offering and deep customer relationships, we are well-positioned to execute on our Connected Enterprise strategy and take advantage of the attractive opportunities in the industrial automation and information market. While we are optimistic that the impact of U.S. tax reform on our customers’ investment decisions could provide an additional tailwind to our future performance, it is too early to quantify the benefits.\"\nMoret continued, \"As a result of our strong first quarter and a lower tax rate for the year, we are increasing our full year Adjusted EPS guidance. We are also increasing investments in fiscal 2018 in order to accelerate profitable growth and other long-term objectives. These include accelerated software development, investments to help our employees be more engaged and productive, and importantly, spending to enable customer innovation and complement our existing workforce development initiatives. We are also actively engaged in the evaluation of inorganic opportunities to accelerate our Connected Enterprise strategy.\n“I would like to thank our employees, partners, and suppliers for their contributions to another successful quarter.”\nFollowing is a discussion of fiscal 2018 first quarter results for both segments.\nArchitecture & Software\nArchitecture & Software quarterly sales were $746.9 million, an increase of 7.3 percent compared to $696.4 million in the same period last year. Organic sales increased 4.6 percent, and currency translation increased sales by 2.7 percentage points. Segment operating earnings were $224.6 million compared to $208.6 million in the same period last year. Segment operating margin increased to 30.1 percent from 30.0 percent a year ago, primarily due to higher sales, partially offset by higher investment spending.\nControl Products & Solutions\nControl Products & Solutions quarterly sales were $839.7 million, an increase of 5.8 percent compared to $793.9 million in the same period last year. Organic sales increased 5.9 percent, currency translation increased sales by 2.3 percentage points, and the prior year divestiture reduced sales by 2.4 percentage points. Segment operating earnings were $130.9 million compared to $108.0 million in the same period last year. Segment operating margin increased to 15.6 percent from 13.6 percent a year ago, primarily due to higher sales.\nOther Information\nIn the first quarter of fiscal 2018, cash flow provided by operating activities was $212.7 million and free cash flow was $178.6 million. Return on invested capital was 40.8 percent.\nFiscal 2018 first quarter general corporate-net expense was $16.2 million compared to $14.9 million in the first quarter of fiscal 2017.\nOn a GAAP basis, the effective tax rate in the first quarter of fiscal 2018 was 179.4 percent compared to 16.7 percent in the first quarter of fiscal 2017. The higher effective tax rate was due to provisional charges related to the tax effect of deemed repatriation of foreign earnings ($385.5 million or 129.5 percentage points) and the revaluation of net deferred tax assets ($94.2 million or 31.6 percentage points) associated with the Tax Act. The Adjusted Effective Tax Rate for the first quarter of fiscal 2018 was 18.9 percent compared to 18.1 percent a year ago. The increase in the Adjusted Effective Tax Rate was primarily due to lower favorable discrete tax items in the current quarter compared to the prior year, partially offset by the lower tax rate under the Tax Act. For fiscal 2018, the Company now expects an effective tax rate of approximately 59 percent and an Adjusted Effective Tax Rate of approximately 21 percent.\nDuring the first quarter of fiscal 2018, the Company repurchased 1.1 million shares of its common stock at a cost of $208.6 million. At December 31, 2017, $399.8 million remained available under the April 6, 2016 share repurchase authorization. On January 15, 2018, the Board of Directors authorized the Company to expend up to an additional $1.0 billion to repurchase shares of its common stock.\nOrganic sales, total segment operating earnings, total segment operating margin, Adjusted Income, Adjusted EPS, Adjusted Effective Tax Rate, free cash flow, and return on invested capital are non-GAAP measures that are reconciled to GAAP measures in the attachments to this release.\nConference Call\nA conference call to discuss our financial results will take place at 8:30 a.m. Eastern Time on Wednesday, January 24, 2018. The call and related financial charts will be webcast and accessible via the Rockwell Automation website ( http://www.rockwellautomation.com/investors/ ).\nThis news release contains statements (including certain projections and business trends) that are “forward-looking statements” as defined in the Private Securities Litigation Reform Act of 1995. Words such as “believe”, “estimate”, “project”, “plan”, “expect”, “anticipate”, “will”, “intend” and other similar expressions may identify forward-looking statements. Actual results may differ materially from those projected as a result of certain risks and uncertainties, many of which are beyond our control, including but not limited to:\nmacroeconomic factors, including global and regional business conditions, the availability and cost of capital, commodity prices, the cyclical nature of our customers’ capital spending, sovereign debt concerns and currency exchange rates; laws, regulations and governmental policies affecting our activities in the countries where we do business; the successful development of advanced technologies and demand for and market acceptance of new and existing products; the availability, effectiveness and security of our information technology systems; competitive products, solutions and services and pricing pressures, and our ability to provide high quality products, solutions and services; a disruption of our business due to natural disasters, pandemics, acts of war, strikes, terrorism, social unrest or other causes; our ability to manage and mitigate the risk related to security vulnerabilities and breaches of our products, solutions and services; intellectual property infringement claims by others and the ability to protect our intellectual property; the uncertainty of claims by taxing authorities in the various jurisdictions where we do business; our ability to attract, develop, and retain qualified personnel; our ability to manage costs related to employee retirement and health care benefits; the uncertainties of litigation, including liabilities related to the safety and security of the products, solutions and services we sell; our ability to manage and mitigate the risks associated with our solutions and services businesses; disruptions to our distribution channels or the failure of distributors to develop and maintain capabilities to sell our products; the successful integration and management of acquired businesses and technologies; the availability and price of components and materials; the successful execution of our cost productivity initiatives; and other risks and uncertainties, including but not limited to those detailed from time to time in our Securities and Exchange Commission (SEC) filings.\nThese forward-looking statements reflect our beliefs as of the date of filing this release. We undertake no obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise.\nRockwell Automation, Inc. (NYSE: ROK), the world’s largest company dedicated to industrial automation and information, makes its customers more productive and the world more sustainable. Headquartered in Milwaukee, Wis., Rockwell Automation employs approximately 22,000 people serving customers in more than 80 countries.\nROCKWELL AUTOMATION, INC. SALES AND EARNINGS INFORMATION (in millions, except per share amounts and percentages) Three Months Ended\nDecember 31, 2017 2016 Sales Architecture & Software (a) $ 746.9 $ 696.4 Control Products & Solutions (b) 839.7 793.9 Total sales (c) $ 1,586.6 $ 1,490.3 Segment operating earnings Architecture & Software (d) $ 224.6 $ 208.6 Control Products & Solutions (e) 130.9 108.0 Total segment operating earnings 1 (f) 355.5 316.6 Purchase accounting depreciation and amortization (4.4 ) (5.6 ) General corporate—net (16.2 ) (14.9 ) Non-operating pension costs (5.9 ) (19.8 ) Costs related to unsolicited Emerson proposals (11.2 ) — Interest expense (20.0 ) (18.7 ) Income before income taxes (g) 297.8 257.6 Income tax provision (534.2 ) (42.9 ) Net (loss) income $ (236.4 ) $ 214.7 Diluted EPS $ (1.84 ) $ 1.65 Adjusted EPS 2 $ 1.96 $ 1.75 Average diluted shares for diluted EPS 128.2 129.7 Average diluted shares for adjusted EPS 2 130.1 129.7 Segment operating margin Architecture & Software (d/a) 30.1 % 30.0 % Control Products & Solutions (e/b) 15.6 % 13.6 % Total segment operating margin 1 (f/c) 22.4 % 21.2 % Pre-tax margin (g/c) 18.8 % 17.3 % 1 Total segment operating earnings and total segment operating margin are non-GAAP financial measures. We exclude purchase accounting depreciation and amortization, general corporate – net, non-operating pension costs, costs related to the unsolicited Emerson proposals, interest expense and income tax provision because we do not consider these costs to be directly related to the operating performance of our segments. We believe that these measures are useful to investors as measures of operating performance. We use these measures to monitor and evaluate the profitability of our Company. Our measures of total segment operating earnings and total segment operating margin may be different from those used by other companies.\n2 Adjusted EPS is a non-GAAP earnings measure that excludes the non-operating pension costs and their related income tax effects, costs related to the unsolicited Emerson proposals in the first quarter of fiscal 2018 and their related tax effects, and the provisional tax effect of deemed repatriation of foreign earnings and the revaluation of net deferred tax assets due to the enactment of the Tax Act. See \"Other Supplemental Information - Adjusted Income, Adjusted EPS and Adjusted Effective Tax Rate\" section for more information regarding non-operating pension costs and a reconciliation to GAAP measures. Average diluted shares for adjusted EPS is a non-GAAP measure that includes 1.9 million of dilutive shares that are excluded from GAAP average diluted shares in the first quarter of fiscal 2018 because we recorded a net loss.\nROCKWELL AUTOMATION, INC. CONDENSED CONSOLIDATED STATEMENT OF OPERATIONS (in millions) Three Months Ended\nDecember 31, 2017 2016 Sales $ 1,586.6 $ 1,490.3 Cost of sales (889.5 ) (848.0 ) Gross profit 697.1 642.3 Selling, general and administrative expenses (389.3 ) (370.0 ) Other income 10.0 4.0 Interest expense (20.0 ) (18.7 ) Income before income taxes 297.8 257.6 Income tax provision (534.2 ) (42.9 ) Net (loss) income $ (236.4 ) $ 214.7 ROCKWELL AUTOMATION, INC. CONDENSED BALANCE SHEET INFORMATION (in millions) December 31,\n2017 September 30,\n2017 Assets Cash and cash equivalents $ 1,547.0 $ 1,410.9 Short-term investments 1,100.5 1,124.6 Receivables 1,149.9 1,135.5 Inventories 570.8 558.7 Property, net 565.8 583.9 Goodwill and intangibles 1,316.3 1,315.7 Other assets 908.4 1,032.4 Total $ 7,158.7 $ 7,161.7 Liabilities and Shareowners’ Equity Short-term debt $ 840.0 $ 600.4 Accounts payable 582.2 623.2 Long-term debt 1,239.3 1,243.4 Other liabilities 2,341.0 2,031.1 Shareowners’ equity 2,156.2 2,663.6 Total $ 7,158.7 $ 7,161.7 ROCKWELL AUTOMATION, INC. CONDENSED CASH FLOW INFORMATION (in millions) Three Months Ended\nDecember 31, 2017 2016 Operating activities: Income from continuing operations $ (236.4 ) $ 214.7 Depreciation and amortization 39.6 40.4 Retirement benefits expense 28.3 43.0 Pension contributions (11.6 ) (13.5 ) Receivables/inventories/payables (74.4 ) (32.3 ) Advance payments from customers and deferred revenue 27.9 16.8 Compensation and benefits (77.0 ) 22.4 Income taxes 508.0 22.3 Other 8.3 (3.0 ) Cash provided by operating activities 212.7 310.8 Investing activities: Capital expenditures (34.1 ) (39.4 ) Acquisition of businesses, net of cash acquired (9.9 ) (1.1 ) Purchases of investments (275.2 ) (191.3 ) Proceeds from maturities and sales of investments 286.0 193.9 Proceeds from sale of property 0.2 0.3 Cash used for investing activities (33.0 ) (37.6 ) Financing activities: Net issuance (repayment) of short-term debt 489.6 (40.0 ) Repayment of long-term debt (250.0 ) — Cash dividends (107.3 ) (97.5 ) Purchases of treasury stock (190.8 ) (82.0 ) Proceeds from the exercise of stock options 30.1 67.6 Other financing activities 1.8 — Cash used for financing activities (26.6 ) (151.9 ) Effect of exchange rate changes on cash (17.0 ) (53.1 ) Increase in cash and cash equivalents $ 136.1 $ 68.2 ROCKWELL AUTOMATION, INC.\nOTHER SUPPLEMENTAL INFORMATION\n(in millions)\nOrganic Sales\nOur press release contains information regarding organic sales, which we define as sales excluding the effect of changes in currency exchange rates and acquisitions. We believe this non-GAAP measure provides useful information to investors because it reflects regional and operating segment performance from our activities without the effect of changes in currency exchange rates and/or acquisitions. We use organic sales as one measure to monitor and evaluate our regional and operating segment performance. We determine the effect of changes in currency exchange rates by translating the respective period’s sales using the currency exchange rates that were in effect during the prior year. When we acquire businesses, we exclude sales in the current period for which there are no comparable sales in the prior period. When we divest a business, we exclude sales in the prior period for which there are no comparable sales in the current period. Organic sales growth is calculated by comparing organic sales to reported sales in the prior year, excluding divestitures. We attribute sales to the geographic regions based on the country of destination.\nThe following is a reconciliation of reported sales to organic sales for the three months ended December 31, 2017 compared to sales for the three months ended December 31, 2016:\nThree Months Ended December 31, 2017 2016 Sales Effect of\nChanges in\nCurrency\nSales\nExcluding\nEffect of\nChanges in\nCurrency\nEffect of\nAcquisitions\nOrganic\nSales\nSales\nEffect of\nDivestitures\nSales\nExcluding\nDivestitures\nUnited States $ 851.9 $ (0.7 ) $ 851.2 $ — $ 851.2 $ 820.1 $ (12.3 ) $ 807.8 Canada 92.0 (4.4 ) 87.6 — 87.6 82.7 (4.1 ) 78.6 EMEA 307.4 (23.4 ) 284.0 — 284.0 270.7 — 270.7 Asia Pacific 214.5 (5.8 ) 208.7 — 208.7 205.6 — 205.6 Latin America 120.8 (2.1 ) 118.7 — 118.7 111.2 (1.8 ) 109.4 Total $ 1,586.6 $ (36.4 ) $ 1,550.2 $ — $ 1,550.2 $ 1,490.3 $ (18.2 ) $ 1,472.1 The following is a reconciliation of reported sales to organic sales for our operating segments for the three months ended December 31, 2017 compared to sales for the three months ended December 31, 2016:\nThree Months Ended December 31, 2017 2016 Sales Effect of\nChanges in\nCurrency\nSales\nExcluding\nEffect of\nChanges in\nCurrency\nEffect of\nAcquisitions\nOrganic\nSales\nSales Effect of\nDivestitures\nSales\nExcluding\nDivestitures\nArchitecture & Software $ 746.9 $ (18.2 ) $ 728.7 $ — $ 728.7 $ 696.4 $ — $ 696.4 Control Products & Solutions 839.7 (18.2 ) 821.5 — 821.5 793.9 (18.2 ) 775.7 Total $ 1,586.6 $ (36.4 ) $ 1,550.2 $ — $ 1,550.2 $ 1,490.3 $ (18.2 ) $ 1,472.1 ROCKWELL AUTOMATION, INC.\nOTHER SUPPLEMENTAL INFORMATION\n(in millions, except per share amounts and percentages)\nAdjusted Income, Adjusted EPS and Adjusted Effective Tax Rate\nOur press release contains financial information and earnings guidance regarding Adjusted Income, Adjusted EPS and Adjusted Effective Tax Rate, which are non-GAAP earnings measures that exclude non-operating pension costs and their related income tax effects, costs related to the unsolicited Emerson proposals in the first quarter of fiscal 2018 and their related tax effects, and the provisional tax effect of deemed repatriation of foreign earnings and the revaluation of net deferred tax assets due to the enactment of the Tax Act. We define non-operating pension costs as defined benefit plan interest cost, expected return on plan assets, amortization of actuarial gains and losses and the impact of any plan curtailments or settlements. These components of net periodic benefit cost primarily relate to changes in pension assets and liabilities that are a result of market performance; we consider these and other excluded costs to be unrelated to the operating performance of our business. We believe that Adjusted Income, Adjusted EPS and Adjusted Effective Tax Rate provide useful information to our investors about our operating performance and allow management and investors to compare our operating performance period over period. Adjusted EPS is also used as a financial measure of performance for our annual incentive compensation. Our measures of Adjusted Income, Adjusted EPS and Adjusted Effective Tax Rate may be different from measures used by other companies. These non-GAAP measures should not be considered a substitute for income from continuing operations, diluted EPS and effective tax rate.\nThe following are the components of operating and non-operating pension costs for the three months ended December 31, 2017 and 2016:\nThree Months Ended\nDecember 31, 2017 2016 Service cost $ 22.2 $ 24.1 Amortization of prior service cost (credit) 0.2 (0.8 ) Operating pension costs 22.4 23.3 Interest cost 38.8 37.8 Expected return on plan assets (61.2 ) (56.2 ) Amortization of net actuarial loss 28.3 38.0 Settlements — 0.2 Non-operating pension costs 5.9 19.8 Net periodic pension cost $ 28.3 $ 43.1 The following are reconciliations of income from continuing operations, diluted EPS from continuing operations, and effective tax rate to Adjusted Income, Adjusted EPS and Adjusted Effective Tax Rate:\nThree Months Ended\nDecember 31, 2017 2016 Income from continuing operations $ (236.4 ) $ 214.7 Non-operating pension costs 5.9 19.8 Tax effect of non-operating pension costs (1.8 ) (7.2 ) Costs related to unsolicited Emerson proposals 11.2 — Tax effect of costs related to unsolicited Emerson proposals (3.1 ) — Effect of deemed repatriation of foreign earnings due to the Tax Act 1 385.5 — Effect of net deferred tax asset revaluation due to the Tax Act 1 94.2 — Adjusted Income $ 255.5 $ 227.3 Diluted EPS from continuing operations $ (1.84 ) $ 1.65 Non-operating pension costs per diluted share 0.06 0.15 Tax effect of non-operating pension costs per diluted share (0.01 ) (0.05 ) Costs related to unsolicited Emerson proposals 0.09 — Tax effect of costs related to unsolicited Emerson proposals (0.02 ) — Effect of deemed repatriation of foreign earnings due to the Tax Act 1 2.96 — Effect of net deferred tax asset revaluation due to the Tax Act 1 0.72 — Adjusted EPS $ 1.96 $ 1.75 Effective tax rate 179.4 % 16.7 % Tax effect of non-operating pension costs 0.3 % 1.4 % Tax effect of costs related to unsolicited Emerson proposals 0.3 % — % Effect of deemed repatriation of foreign earnings due to the Tax Act 1 (129.5 )% — % Effect of net deferred tax asset revaluation due to the Tax Act 1 (31.6 )% — % Adjusted Effective Tax Rate 18.9 % 18.1 % 1 These amounts, which are based on reasonable estimates, will require further adjustments as additional guidance from the U.S. Department of Treasury is provided, the Company’s assumptions change, or as further information and interpretations become available.\nFiscal 2018 Guidance Year Ended September 30, 2017 Diluted EPS from continuing operations $3.67 - $3.97 $ 6.35 Non-operating pension costs per diluted share 0.18 0.64 Tax effect of non-operating pension costs per diluted share (0.06) (0.23 ) Costs related to unsolicited Emerson proposals 0.09 — Tax effect of costs related to unsolicited Emerson proposals (0.02) — Effect of deemed repatriation of foreign earnings due to the Tax Act 1 3.00 — Effect of net deferred tax asset revaluation due to the Tax Act 1 0.74 — Adjusted EPS $7.60 - $7.90 $ 6.76 Effective tax rate ~ 59 % 20.4 % Tax effect of non-operating pension costs ~ — % 1.1 % Tax effect of costs related to unsolicited Emerson proposals ~ — % — % Effect of deemed repatriation of foreign earnings due to the Tax Act 1 ~ (31 )% — % Effect of net deferred tax asset revaluation due to the Tax Act 1 ~ (7 )% — % Adjusted Effective Tax Rate ~ 21 % 21.5 % 1 These amounts, which are based on reasonable estimates, will require further adjustments as additional guidance from the U.S. Department of Treasury is provided, the Company’s assumptions change, or as further information and interpretations become available.\nROCKWELL AUTOMATION, INC.\nOTHER SUPPLEMENTAL INFORMATION\n(in millions, except percentages)\nFree Cash Flow\nOur definition of free cash flow, which is a non-GAAP financial measure, takes into consideration capital investments required to maintain the operations of our businesses and execute our strategy. In our opinion, free cash flow provides useful information to investors regarding our ability to generate cash from business operations that is available for acquisitions and other investments, service of debt principal, dividends and share repurchases. We use free cash flow, as defined, as one measure to monitor and evaluate our performance, including as a financial measure for our annual incentive compensation. Our definition of free cash flow may be different from definitions used by other companies.\nThe following table summarizes free cash flow by quarter:\nQuarter Ended Dec. 31,\n2016 Mar. 31,\n2017 Jun. 30,\n2017 Sep. 30,\n2017 1 Dec. 31,\n2017 Cash provided by continuing operating activities $ 310.8 $ 301.0 $ 315.3 $ 106.9 $ 212.7 Capital expenditures (39.4 ) (28.0 ) (30.1 ) (44.2 ) (34.1 ) Free cash flow $ 271.4 $ 273.0 $ 285.2 $ 62.7 $ 178.6 1 Free cash flow for the fourth quarter of fiscal 2017 includes a discretionary pre-tax contribution of $200 million to the Company's U.S. pension trust.\nReturn On Invested Capital\nOur press release contains information regarding Return On Invested Capital (ROIC), which is a non-GAAP financial measure. We believe that ROIC is useful to investors as a measure of performance and of the effectiveness of the use of capital in our operations. We use ROIC as one measure to monitor and evaluate our performance, including as a financial measure for our annual incentive compensation. Our measure of ROIC may be different from that used by other companies. We define ROIC as the percentage resulting from the following calculation:\n(a) Income from continuing operations, before interest expense, income tax provision, and purchase accounting depreciation and amortization, for the most recent twelve months; divided by\n(b) average invested capital for the year, calculated as a five quarter rolling average using the sum of short-term debt, long-term debt, shareowners’ equity, and accumulated amortization of goodwill and other intangible assets, minus cash and cash equivalents and short-term and long-term investments; multiplied by\n(c) one minus the effective tax rate for the twelve-month period.\nROIC is calculated and reconciled to GAAP measures as follows:\nTwelve Months Ended December 31, 2017 2016 (a) Return Income from continuing operations $ 374.6 $ 758.9 Interest expense 77.5 72.6 Income tax provision 703.0 204.9 Purchase accounting depreciation and amortization 20.2 19.3 Return 1,175.3 1,055.7 (b) Average invested capital Short-term debt 664.2 380.0 Long-term debt 1,241.5 1,457.0 Shareowners’ equity 2,249.1 2,122.6 Accumulated amortization of goodwill and intangibles 842.3 815.5 Cash and cash equivalents (1,508.5 ) (1,495.2 ) Short-term and long-term investments (1,206.1 ) (879.7 ) Average invested capital 2,282.5 2,400.2 (c) Effective tax rate Income tax provision 1 223.3 204.9 Income from continuing operations before income taxes $ 1,077.6 $ 963.8 Effective tax rate 20.7 % 21.3 % (a) / (b) * (1-c) Return On Invested Capital 40.8 % 34.6 % 1 The income tax provision used to calculate the effective tax rate is adjusted to remove the provisional effect of the $385.5 million tax on deemed repatriation of foreign earnings and the $94.2 million revaluation of net deferred tax assets due to the enactment of the Tax Cuts and Jobs Act of 2017 in the first quarter of fiscal 2018.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005297/en/\nRockwell Automation\nKeith Lester\nMedia Relations\n414.382.4871\nor\nRockwell Automation\nSteve Etzel\nInvestor Relations\n414.382.8510\nSource: Rockwell Automation, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rockwellautomation.com%2Finvestors%2F&esheet=51747850&newsitemid=20180124005297&lan=en-US&anchor=http%3A%2F%2Fwww.rockwellautomation.com%2Finvestors%2F&index=1&md5=8b632b3e6149014f5cdd62e4dfed121c", "http://www.businesswire.com/news/home/20180124005297/en/", "http://www.rockwellautomation.com/investors/"], "published": "2018-01-24T15:00:00.000+02:00", "crawled": "2018-01-24T14:56:53.015+02:00", "highlightTitle": ""}