{"organizations": [], "uuid": "5bf5fd602713200c45607f1782249965fd0481ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226477401&w=1200&r=LYNXMPEE0T05B", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-thomsonreuters-f-r-blackstone-exclusi/exclusive-blackstone-in-talks-to-buy-majority-stake-in-key-thomson-reuters-unit-sources-idUKKBN1FJ0BR", "country": "US", "domain_rank": 408, "title": "Exclusive: Blackstone in talks to buy majority stake in key Thomson Reuters unit-sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T05:26:00.000+02:00", "replies_count": 0, "uuid": "5bf5fd602713200c45607f1782249965fd0481ce"}, "author": "", "url": "https://uk.reuters.com/article/uk-thomsonreuters-f-r-blackstone-exclusi/exclusive-blackstone-in-talks-to-buy-majority-stake-in-key-thomson-reuters-unit-sources-idUKKBN1FJ0BR", "ord_in_thread": 0, "title": "Exclusive: Blackstone in talks to buy majority stake in key Thomson Reuters unit-sources", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 3:26 AM / Updated 12 minutes ago Exclusive - Blackstone in talks to buy majority stake in key Thomson Reuters unit - sources Pamela Barbaglia 6 Min Read \nLONDON (Reuters) - U.S. private equity firm Blackstone Group LP is in advanced talks to buy a stake of about 55 percent in Thomson Reuters Corp’s Financial and Risk business, a deal that would value the unit at around $20 billion (£14.2 billion) including debt, according to three sources familiar with the matter. \nThomson Reuters’ board, the sources said, is expected to meet on Tuesday to discuss Blackstone’s offer for the F&R business, which supplies news, data and analytics to banks and investment houses around the world. The unit contributes more than half of Thomson Reuters’ annual revenues. \nUnder the terms of the proposed deal, Thomson Reuters would retain a 45 percent stake in the F&R business as part of a partnership with the U.S. buyout firm, according to the sources. \nThe deal would be structured to pay more than $17 billion to Thomson Reuters, for a unit with an enterprise value - a measure of total value that includes equity and debt - of about $20 billion, two of the sources said. That $17 billion would include about $4 billion in cash from Blackstone and about $13 billion financed by new debt taken on by the new F&R partnership, the sources said. \nThomson Reuters said in a statement late on Monday that “it is in advanced discussions with Blackstone regarding a potential partnership in its F&R business.” The company gave no more details. A spokeswoman for Blackstone   \nThe sources cautioned that a deal had not been finalised and could still fall apart. They declined to be identified because the negotiations are confidential. \nThomson Reuters’ New York-listed shares were up 8.5 percent at 1715 GMT, touching their highest level since October, while Blackstone shares were down 1.9 percent. \nIf the board agrees to a deal with Blackstone, it would represent the biggest shake-up of Thomson Reuters since it was formed a decade ago by Thomson Corp’s acquisition of Reuters Group. Canada’s Thomson bought London-based Reuters for 8.7 billion pounds in 2008, worth $17 billion at the exchange rate at the time. \nReuters was unable to determine who would lead the new division. REUTERS NEWS \nThomson Reuters would hold on to its Legal and Tax and Accounting divisions as well as its international news service, Reuters News, which supplies news to F&R’s flagship desktop software product Eikon, the three sources said. \nAs part of its offer, Blackstone has said the new F&R company would make annual payments of $325 million for 30 years to Reuters News to safeguard that business’s growth prospects, according to two of the sources. \nThe level of the proposed payments would amount to almost $10 billion over three decades, the sources added. FILE PHOTO: The Thomson Reuters logo is seen on the company building in Times Square, New York October 29, 2013. REUTERS/Carlo Allegri/File Photo \nThomson Reuters, which does not disclose how much F&R currently contributes to Reuters revenues, declined to comment on specific terms of the proposed deal. \nIt is unclear how the proposed deal would be viewed by trustees of the Thomson Reuters Founders Share Co, which was set up to oversee Reuters’ editorial independence when the company was first publicly listed in the 1980s. \nThe trustees approved Thomson’s deal for Reuters a decade ago. Thomson Reuters Founders Share Co Chairman Kim Williams did not respond to requests for comment. \nBlackstone’s proposed investment, if finalised, would mark the buyout firm’s biggest deal since the global financial crisis and put it in direct competition with Bloomberg LP as well as News Corp’s Dow Jones division in selling data services, analytical and trading tools to Wall Street. \nBlackstone has some experience in the information business. It bought Ipreo, which sells specialist software for tracking capital markets’ activities in 2014 for just under $1 billion. STREAMLINING \nCanada’s Thomson family controls more than 63 percent of Thomson Reuters shares through Woodbridge Co Ltd. The news and data provider has a market value of about $31 billion and its shares trade on the New York and Toronto stock exchanges. \nTwo of the sources said minority investors in Thomson Reuters, who hold the remaining 37 percent of stock, were largely in favour of the proposed deal. \nSince its creation in 2008, Thomson Reuters has carried out more than 200 acquisitions, but has struggled to integrate some of the assets it took on, especially in its F&R division, which was hit hard by the financial crisis. Related Coverage Reuters News to get $325 million annually under Blackstone offer - sources \nGrowth in the business has slowed as banks and brokerages shrank in the face of weak trading. But amid tougher regulations around risk-taking, the regulation and compliance business has been a bright spot. \nTo streamline its business, Thomson Reuters has reduced the number of products within its F&R segment while shrinking its workforce. \n“The progress we have made turning around the F&R business and its future potential are reflected by Blackstone’s interest,” Thomson Reuters Chief Executive Jim Smith said in a staff memo. “We believe F&R is well positioned within Thomson Reuters, but it could be even stronger with a partner like Blackstone.” \nThe company has also sought to sell non-core assets, including its intellectual property and science business, which it sold to private equity firms Onex Corp and Baring Private Equity Asia for $3.55 billion in 2016. \nBefore news of the Blackstone talks, Thomson Reuters’ New York-listed shares had declined 3.4 percent over the previous year, underperforming the benchmark S&P 500 Index, which had risen more than 24 percent in the same period. Additional reporting by Dan Burns in New York; Writing by Carmel Crimmins; Editing by Tiffany Wu and Pravin Char", "external_links": [], "published": "2018-01-30T05:26:00.000+02:00", "crawled": "2018-01-30T06:00:50.085+02:00", "highlightTitle": ""}