{"organizations": [], "uuid": "b656bdf4344d2b13a304d1b0968546ad9df4ab50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/olympics-2018-bach/update-1-olympics-russia-ban-decision-was-a-balance-says-ioc-chief-bach-idUSL4N1PJ4SU", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Olympics-Russia ban decision was a balance, says IOC chief Bach", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-24T23:44:00.000+02:00", "replies_count": 0, "uuid": "b656bdf4344d2b13a304d1b0968546ad9df4ab50"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/olympics-2018-bach/update-1-olympics-russia-ban-decision-was-a-balance-says-ioc-chief-bach-idUSL4N1PJ4SU", "ord_in_thread": 0, "title": "UPDATE 1-Olympics-Russia ban decision was a balance, says IOC chief Bach", "locations": [], "entities": {"persons": [{"name": "bach", "sentiment": "negative"}, {"name": "karolos grohmann jan", "sentiment": "none"}, {"name": "thomas bach", "sentiment": "none"}, {"name": "vitaly mutko", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "ioc", "sentiment": "negative"}, {"name": "international olympic committee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Olympics body wanted sanction “apparent to the world”\n* Russia banned from Games but clean athletes can compete\n* IOC did not want to humiliate Russia, says IOC’s Bach (Updates with Quote: s, details)\nBy Karolos Grohmann\nJan 24 (Reuters) - A decision to ban the Russian team from next month’s Pyeongchang Winter Olympics, but invite a number of carefully screened Russian athletes, had been “a balance”, Olympics president Thomas Bach said on Wednesday.\nBach said the International Olympic Committee (IOC), which in December banned Russia’s Deputy Prime Minister Vitaly Mutko from the Olympics for life over a widespread doping scandal, had wanted a sanction “apparent to the world”, but did not want to humiliate Russia.\nThe IOC wanted to “give clean Russian athletes the opportunity to participate, and give a young and new generation of clean Russian athletes the opportunity to be at the Olympic Games and be ambassadors for a new clean Russian sport,” Bach said in a conference call with a small group of reporters.\nThe IOC on Dec. 5 banned Russia over “systematic manipulation” of the anti-doping system at the 2014 Sochi Games, but left the door open to athletes with no history of doping to compete as “Olympic Athletes from Russia”..\nDozens of Russian athletes in recent months have been retroactively sanctioned for anti-doping rule violations in Sochi with Russia also being stripped of several medals.\nAn independent review panel drew up a list of Russian athletes, invited to compete as independents, after carefully examining their doping records and testing history, possible involvement in the scandal and other factors.\nThey will march and compete at the Feb. 9-25 Games under the Olympic flag and any medal ceremonies involving them will feature the Olympic anthem instead of the Russian one.\n“This panel took their responsibility very seriously by making it absolutely certain.... that there is not the slightest doubt or suspicion on athletes to be invited,” Bach said after several big-name Russian athletes were excluded in recent days.\nAmong them are Sochi gold and silver medallist figure skater Ksenia Stolbova and ice dancer Ivan Bukin as well as Olympic champion short-track speed skater Viktor Ahn, none of whom had been sanctioned for doping in Sochi.\n“This independent panel which put together the invitation list, the final invitation list, gives us the highest confidence that there will be only clean Russian athletes (in Pyeongchang),” Bach said.\n”If an athlete is not on the list then the independent panel has serious indications by different sources and by different means.\n“There could be a suspicion, there could even be an ongoing procedure. There could be many factors which did not lead to the satisfaction of the panel,” he said.\n“The purpose is to invite clean Russian athletes for which this panel is certain and has not the slightest doubt or suspicion.” (Reporting by Karolos Grohmann, Editing by Ossian Shine and Ken Ferris)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T23:44:00.000+02:00", "crawled": "2018-01-25T13:00:02.015+02:00", "highlightTitle": ""}