{"organizations": [], "uuid": "b333ffc4d79cf07eff928f376a87ab85ebc9f5fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222099249&w=1200&r=LYNXMPEE0E0H0", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-airbus-orders/airbus-wins-2017-order-race-after-last-minute-sales-spree-idUSKBN1F40YU", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Airbus wins 2017 order race after last-minute sales spree", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T11:15:00.000+02:00", "replies_count": 0, "uuid": "b333ffc4d79cf07eff928f376a87ab85ebc9f5fa"}, "author": "", "url": "https://www.reuters.com/article/us-airbus-orders/airbus-wins-2017-order-race-after-last-minute-sales-spree-idUSKBN1F40YU", "ord_in_thread": 0, "title": "UPDATE 1-Airbus wins 2017 order race after last-minute sales spree", "locations": [], "entities": {"persons": [{"name": "tim hepher", "sentiment": "none"}, {"name": "cyril altmeyer", "sentiment": "none"}, {"name": "fabrice bregier", "sentiment": "none"}], "locations": [], "organizations": [{"name": "airbus", "sentiment": "negative"}, {"name": "boeing", "sentiment": "none"}, {"name": "pratt & whitney", "sentiment": "none"}, {"name": "min read  paris", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - Frenetic selling in the closing weeks of 2017 saw Airbus ( AIR.PA ) overhaul Boeing’s ( BA.N ) recent lead in the global jet market to win their annual order contest for a fifth year in a row, though doubts remain over the future of its flagship A380.\nThe European planemaker said net orders after cancellations rose 52 percent to 1,109 jets in 2017, vaulting past Boeing’s 912. Without the cancellations adjustment, Airbus gross orders were 1,229 compared with Boeing’s 1,053\nAfter peaking in 2014, Airbus says jet demand is growing faster than expected, reflecting busier traffic as global economies kick into a higher gear.\n“The market is just stronger everywhere,” Airbus sales chief John Leahy told reporters.\nAirbus confirmed it had met its core 2017 target of more than 700 deliveries by releasing 718 jets to customers in 2017, up 4 percent from the previous year.\nBoeing remained the world’s largest jetmaker for the sixth year running, however, with a record total of 763 deliveries.\nDecember’s surge in commercial and industrial performance allowed Airbus to meet or exceed targets that had seemed elusive a few months ago and caps a turbulent year for the company after rows over corruption investigations and management tensions.\nAnalysts described it as a robust farewell performance by two of the company’s dominant figures: record-holding salesman Leahy, who retires this month after more than 20 years at the helm, and chief operating officer Fabrice Bregier, who steps down in February after losing a corporate succession battle.\n“We beat Boeing one last time ... we just went for it,” Leahy told Reuters.\nBoth bequeathed challenging targets to their successors as Leahy predicted that orders would exceed deliveries in 2018 for the ninth year in a row, while Bregier predicted “close to 800” deliveries this year as output accelerates after engine delays.\nThat figure includes 30 aircraft already built and waiting for engines from United Technologies’ ( UTX.N ) Pratt & Whitney, but Bregier said he was confident the U.S. business had turned the corner after delays on new engines.\nThe underlying production target is therefore closer to 770, implying 7 percent growth, which is closer to recent trends.\nOddo Securities analyst Yan Derocles said the more confident tone regarding engines for the A320neo gave more credibility to the target of 800 jets.\nThe logo of Airbus is pictured at the company's headquarters in Colomiers near Toulouse, France, October 19, 2017. REUTERS/Regis Duvignau TARGETING TOP DELIVERY SPOT Bregier also predicted a record order pipeline of more than 7,000 jets would allow Airbus to lift deliveries beyond those of Boeing in 2020. Both are neck-and-neck in planned production.\nBoeing has questioned whether all of the aircraft sold by its rival will be delivered.\nDecember’s sales breakthrough focused mainly on the bread and butter of the Airbus portfolio - the medium-haul A320 family, which competes with Boeing’s best-selling 737.\nSome in the industry have been left wondering how far Airbus was forced to cut prices to grab deals such as the 430 jets sold to four budget carriers via U.S. investor Indigo Partners.\nLeahy, however, said the Indigo deal and other year-end activity reflected fundamental demand.\n“It is a very serious deal with some very serious airlines,” he told Reuters.\nBut in the wide-body, long-haul segment, Airbus lost about half its market share last year, with no new orders and two cancellations for the A380 superjumbo, though Boeing also suffered cancellations for its competing 747.\nAirbus is locked in make-or-break talks with main A380 customer Emirates about buying 36 more superjumbos.\nLeahy confirmed a Reuters report that the future of the A380 lies with Emirates, even though other airlines are interested in smaller numbers of the 544-seat jets. If the deal falls through, Airbus would have “no choice” but to close production, he said.\nReuters reported in December that Airbus had drawn up plans to phase out A380 production if those talks collapsed, without waiting for other potential buyers.\n“There is some hope. Whether it means we soon conclude an agreement with Emirates? I hope so. There is a joint interest in achieving that, but we are not there yet,” Bregier told Reuters.\nAirbus confirmed it plans as part of any possible Emirates deal to reduce A380 output to six aircraft a year from 15 last year.\nReporting by Tim Hepher and Cyril Altmeyer; Editing by Sudip Kar-Gupta and David Goodman\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-15T11:15:00.000+02:00", "crawled": "2018-01-15T11:25:53.014+02:00", "highlightTitle": ""}