{"organizations": [], "uuid": "2db747d25920f02729614a75e46147401b1756dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224338429&w=1200&r=LYNXMPEE0M03N", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/uk-netflix-results-spacey/netflix-takes-39-million-charge-after-kevin-spacey-scandal-idUKKBN1FC08R", "country": "US", "domain_rank": 408, "title": "Netflix takes $39 million charge after Kevin Spacey scandal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T04:56:00.000+02:00", "replies_count": 0, "uuid": "2db747d25920f02729614a75e46147401b1756dc"}, "author": "", "url": "https://uk.reuters.com/article/uk-netflix-results-spacey/netflix-takes-39-million-charge-after-kevin-spacey-scandal-idUKKBN1FC08R", "ord_in_thread": 0, "title": "Netflix takes $39 million charge after Kevin Spacey scandal", "locations": [], "entities": {"persons": [{"name": "kevin spacey", "sentiment": "negative"}, {"name": "harvey weinstein", "sentiment": "none"}, {"name": "spacey", "sentiment": "none"}], "locations": [], "organizations": [{"name": "netflix", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "netflix inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 2:57 AM / Updated 16 hours ago Netflix takes $39 million charge after Kevin Spacey scandal Reuters Staff 3 Min Read \nLOS ANGELES (Reuters) - A sexual misconduct scandal involving Kevin Spacey cost streaming video service Netflix Inc ( NFLX.O ) some $39 million late last year as it stopped projects associated with the actor, a source with knowledge of the matter said on Monday. \nNetflix said the charge, disclosed in its fourth-quarter earnings report, was related to “unreleased content we’ve decided not to move forward with.” \nSpacey, who has had a successful career in film, television and theatre, is one of a number of big names in the entertainment business to be accused of sexual misconduct by people coming forward in the wake of allegations against movie producer Harvey Weinstein. The Netflix charge was one of the first public signs of financial cost to a studio or production company following allegations of sexual misconduct against an individual. \nThe source with knowledge of the matter said the charge was related to Spacey’s projects. Spacey’s representatives did not respond to a request for comment on Monday. \nMore than 30 men have accused Spacey of sexual misconduct. The Oscar-winning actor was written out of “House of Cards,” the Netflix political intrigue drama in which Spacey starred as U.S. President Frank Underwood. Netflix suspended production in November of the sixth and final season of the drama. \nReuters was unable to independently confirm any of the accusations. \nNetflix also severed ties with Spacey’s other projects, including a movie about late author Gore Vidal. \nIn a post-earnings webcast, Netflix Chief Financial Officer David Wells said that while write-downs happened regularly, “we just hadn’t had one of this magnitude and related to the societal reset around sexual harassment.” \nNetflix said in December that the final season of “House of Cards” would focus on Robin Wright’s character as the first female U.S. president. \nNetflix on Monday reported signing up 8.33 million new streaming customers in the final quarter of last year, 2 million more than analysts expected, sending its shares up in after-the-bell trade more than 7 percent to a record high. Reporting by Jill Serjeant and Lisa Richwine; Editing by Peter Henderson", "external_links": [], "published": "2018-01-23T04:56:00.000+02:00", "crawled": "2018-01-23T06:06:28.025+02:00", "highlightTitle": ""}