{"organizations": [], "uuid": "7613cbbb1b08232add7767dd43bcf10bdb270f18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-sonic-reports-first-fiscal-quarter-2018-earnings-per-share-growth.html", "country": "US", "domain_rank": 767, "title": "Sonic Reports First Fiscal Quarter 2018 Earnings Per Share Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:08:00.000+02:00", "replies_count": 0, "uuid": "7613cbbb1b08232add7767dd43bcf10bdb270f18"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-sonic-reports-first-fiscal-quarter-2018-earnings-per-share-growth.html", "ord_in_thread": 0, "title": "Sonic Reports First Fiscal Quarter 2018 Earnings Per Share Growth", "locations": [], "entities": {"persons": [{"name": "cliff hudson", "sentiment": "none"}], "locations": [{"name": "oklahoma city", "sentiment": "none"}], "organizations": [{"name": "sonic corp.", "sentiment": "negative"}, {"name": "sonic corp", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OKLAHOMA CITY--(BUSINESS WIRE)-- Sonic Corp. (NASDAQ: SONC), the nation’s largest chain of drive-in restaurants, today announced results for its first fiscal quarter ended November 30, 2017.\nKey highlights of the company’s first quarter of fiscal year 2018 included:\nNet income per diluted share increased 4% to $0.29 versus $0.28 in the prior-year period; adjusted net income per diluted share increased 25% to $0.30 versus $0.24 in the prior-year period; System same-store sales declined 1.7%, consisting of a 1.6% same-store sales decrease at franchise drive-ins and a 3.2% decrease at company drive-ins; Company drive-in margins declined 0.1%; 5 new drive-ins opened; and The company repurchased 1.7 million outstanding shares.\n“As expected, our first quarter same-store sales declined modestly versus prior year reflecting continued intense competitive pressure and unfavorable weather,” said Cliff Hudson, Sonic Corp. CEO. “Excluding the impact of weather, same-store sales were flat, indicating an improvement in underlying traffic trends.\n“During the quarter, we promoted the Carhop Classic for $2.99, featuring our full-sized cheeseburger and medium hand-made onion rings, a value offering with a highly compelling price point, broad consumer appeal and strong quality differentiation. In addition to driving improved traffic, the introduction of a sharper everyday value message also improved value and quality scores from customers, validating our evolution to more focused and consistent national value promotions. We will continue to refine this strategy as we move through the remainder of the fiscal year, seeking to balance everyday value and consistent profitability for franchisees while staying true to Sonic’s core tenets of quality, differentiation and innovation.\n“While price competition remains fierce, we are hard at work driving the business in areas we can control. We continue to refine our current media strategies, resulting in increased impressions on national cable today and new creative content in the market this spring. We have growing confidence in our product pipeline as we look out to the key summer season and our mobile order ahead pilot is underway.\n“Finally, we continue to optimize our capital structure and return cash to shareholders. During the quarter, we repurchased 1.7 million shares, or 4% of shares outstanding, for $40.8 million. We have increased our targeted leverage range to 3.5-4.5x net-debt-to-EBITDA and anticipate concluding the year at the higher end of the range.”\nFinancial Overview\nFor the first fiscal quarter of 2018, the company’s net income totaled $11.4 million or $0.29 per diluted share compared to net income of $13.1 million or $0.28 per diluted share in the same period of the prior year. Excluding the items outlined below, net income increased 5% and net income per diluted share increased 25%.\nThe following analysis of non-GAAP adjustments is intended to supplement the presentation of the company’s financial results in accordance with GAAP. The company believes that the presentation of this analysis provides useful information to investors and management regarding the underlying business trends and the performance of the company’s ongoing operations and is helpful for period-to-period and company-to-company comparisons, which management believes will assist investors in analyzing the financial results of the company and predicting future performance.\n(In thousands, except per share amounts)\nThree months ended Three months ended November 30, 2017 November 30, 2016 Net Diluted Net Diluted Net Income Diluted EPS Income EPS Income EPS $ Change % Change $ Change % Change Reported – GAAP $ 11,430 $ 0.29 $ 13,118 $ 0.28 $ (1,688 ) (13 )% $ 0.01 4 % Payment card breach expense (1) 642 0.02 — — Tax impact on payment card breach expense (2) (245 ) (0.01 ) — — Net loss on refranchising transactions (3) — — 957 0.02 Tax impact on refranchising transactions (4) — — (340 ) (0.01 ) Gain on sale of investment in refranchised drive-in operations (5) — — (3,795 ) (0.08 ) Tax impact on sale of investment in refranchised drive-in operations (4) — — 1,350 0.03 Adjusted - Non-GAAP $ 11,827 $ 0.30 $ 11,290 $ 0.24 $ 537 5 % $ 0.06 25 % (1) Costs include legal fees, investigative fees and costs related to customer response. (2) Tax impact during the period at a consolidated blended statutory tax rate of 38.2%. (3) During the first quarter of fiscal year 2017, we completed two transactions to refranchise the operations of 56 company drive-ins. (4) Tax impact during the period at an effective tax rate of 35.6%. (5) Gain on sale of investment in refranchised drive-ins is related to minority investments in franchise operations retained as part of a refranchising transaction that occurred in fiscal year 2009. Fiscal Year 2018 Outlook\nWhile the macroeconomic environment may impact results, the company continues to expect adjusted earnings per share for fiscal year 2018 to increase 5% to 10% (1) year over year, excluding the impact of the recently passed federal tax legislation. The outlook for fiscal 2018 anticipates the following elements:\nApproximately 0% to 2% same-store sales growth for the system; Royalty revenue growth from new unit development; 70 to 80 new franchise drive-in openings; Drive-in-level margins of 15.1% to 15.7%, depending upon the degree of same-store sales growth at company drive-ins; Selling, general and administrative expenses of approximately $76 million to $78 million; Depreciation and amortization expense of $40 million to $42 million; Net interest expense of approximately $32 million to $34 million; Capital expenditures of $38 million to $40 million; excluding spending on build-to-suit drive-in development, capital outlays would be $34 million to $36 million; Free cash flow (2) of approximately $60 million to $65 million (1) ; An income tax rate of approximately 35% (1) ; The repurchase of approximately $160 million in shares across the fiscal year; and An expected quarterly cash dividend of $0.16 per share.\nEarnings Conference Call\nThe company will host a conference call to review financial results at 5:00 PM ET this evening. The conference call can be accessed live over the phone by dialing (800) 281-7973 or (323) 794-2093 for international callers. A replay will be available one hour after the call and can be accessed by dialing (844) 512-2921 or (412) 317-6671 for international callers; the conference ID is 8837715. The replay will be available until Thursday, January 11, 2018. An online replay of the conference call will be available approximately two hours after the conclusion of the live broadcast. A link to this event will be available on the investor section of the company's website, sonicdrivein.com .\nAbout Sonic\nSONIC, America's Drive-In is the nation's largest drive-in restaurant chain serving approximately 3 million customers every day. Nearly 94 percent of SONIC's 3,500 drive-in locations are owned and operated by local business men and women. For 64 years, SONIC has delighted guests with signature menu items, 1.3 million drink combinations and friendl", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.sonicdrivein.com%2F&esheet=51738230&newsitemid=20180104006353&lan=en-US&anchor=sonicdrivein.com&index=1&md5=c3ed761973df7efab26454e00f355cee", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fsonicdrivein&esheet=51738230&newsitemid=20180104006353&lan=en-US&anchor=Twitter&index=4&md5=8134c33a27a09c42e2dbf1d0f5c0bf4c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2Fsonicdrivein%2F&esheet=51738230&newsitemid=20180104006353&lan=en-US&anchor=Facebook&index=3&md5=c408654099d8724d32f4a54d77cb83e5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.limeadesforlearning.com%2F&esheet=51738230&newsitemid=20180104006353&lan=en-US&anchor=LimeadesforLearning.com&index=5&md5=fd8f4cd6e1f397e1ecb99e163bd29937", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.sonicdrivein.com%2F&esheet=51738230&newsitemid=20180104006353&lan=en-US&anchor=sonicdrivein.com&index=2&md5=3310e704b0427352f77c34fa2696cdbf"], "published": "2018-01-05T00:08:00.000+02:00", "crawled": "2018-01-05T01:33:45.010+02:00", "highlightTitle": ""}