{"organizations": [], "uuid": "c60b309afc92ee13fdd67ddd60b70c42307c5c98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/britain-stocks-factors/update-1-uk-stocks-factors-to-watch-on-jan-31-idUSL4N1PQ3E7", "country": "US", "domain_rank": 408, "title": "UPDATE 1-UK Stocks-Factors to watch on Jan 31", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T09:48:00.000+02:00", "replies_count": 0, "uuid": "c60b309afc92ee13fdd67ddd60b70c42307c5c98"}, "author": "", "url": "https://www.reuters.com/article/britain-stocks-factors/update-1-uk-stocks-factors-to-watch-on-jan-31-idUSL4N1PQ3E7", "ord_in_thread": 0, "title": "UPDATE 1-UK Stocks-Factors to watch on Jan 31", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}], "locations": [{"name": "aberdeen", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "deveron", "sentiment": "none"}], "organizations": [{"name": "centamin", "sentiment": "none"}, {"name": "britvic", "sentiment": "none"}, {"name": "bp plc", "sentiment": "none"}, {"name": "sse", "sentiment": "none"}, {"name": "enquest plc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "britvic plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds company news and futures)\nJan 31 (Reuters) - Britain’s FTSE 100 index is seen opening 4 points lower at 7,584.3 on Wednesday, according to financial bookmakers, with futures down 0.03 percent ahead of the cash market open.\n* SSE: SSE, Britain’s second-biggest energy supplier, raised its full-year profit outlook as windier weather drove a 25 percent rise in production from its renewable energy plants.\n* ENQUEST: EnQuest Plc, a North Sea-focused oil producer, said it had agreed with BP Plc to manage the decommissioning of Thistle and Deveron fields, located 275 miles north-east of Aberdeen in the United Kingdom.\n* CENTAMIN: Centamin posted a 13 percent fall in core profit in 2017 on Wednesday as gold production fell and costs rose but the miner declared a final dividend.\n* BRITVIC: British soft drinks company Britvic Plc said first-quarter sales rose 3.3 percent, helped by demand for its carbonated drinks in the UK.\n* CAPITA: Outsourcing group Capita said it hoped to raise around 700 million pounds ($993 million) through a rights issue and would suspend its dividend after it warned 2018 underlying pretax profit would come in well below forecasts.\n* WIZZ AIR: Budget airline Wizz Air said on Wednesday that it posted record third-quarter profit and carried more passengers than ever before as it continues to expand and take market share.\n* DAIRY CREST: Dairy Crest, Britain’s largest dairy food company, said total revenue for the April-December period was well ahead of last year, driven by strong demand for its top brands.\n* BP: BP has made two new oil and gas discoveries in the UK North Sea, it said on Wednesday, giving new impetus to its plans to boost production in the ageing basin into the middle of the century.\n* RBS/FCA: Britain’s financial watchdog said on Tuesday it will publish in full a report it commissioned on how Royal Bank of Scotland treated small businesses.\n* RBS: Royal Bank of Scotland’s restructuring business did not turn around the “vast majority” of small businesses it worked with, Chief Executive Ross McEwan said on Tuesday in response to lawmakers’ questions.\n* SHAFTESBURY: Shaftesbury’s top investor intends to vote down three resolutions that would authorise directors to allot shares, the property company that owns large chunks of London districts Soho and Covent Garden said in a statement on Tuesday.\n* AUGMENTUM/IPO: Augmentum Management, a Lord Rothschild-backed British venture capital firm, is planning to raise as much as 125 million pounds ($176.75 million) from a London stock market listing to put towards a new fund, according to a person familiar with the matter.\n* BRITAIN CARS: British car production fell last year for the first time since 2009 and investment slumped by a third as uncertainty over Brexit cut domestic demand and companies’ new spending plans, an industry body said on Wednesday.\n* BRITAIN/CHINA TRADE: Britain is seeking a free-trade agreement with China, Prime Minister Theresa May said on Wednesday as she flew to the country for talks with Chinese leaders, adding that more should be done immediately to open up market access for British firms.\n* The UK blue chip index ended down 1.1 percent at 7,587.98 points on Tuesday, in line with a broader slide among European markets, as investors took profits on miners and banks, so-called cyclical sectors which have enjoyed a strong start to 2018.\n* For more on the factors affecting European stocks, please click on: cpurl://apps.cp./cms/?pageId=livemarkets\nTODAY‘S UK PAPERS\n> Financial Times\n> Other business headlines Multimedia versions of Reuters Top News are now available for: * 3000 Xtra : visit topnews.session.rservices.com * For Top News : topnews.reuters.com (Reporting by Rahul B in Bengaluru)\n ", "external_links": [], "published": "2018-01-31T09:48:00.000+02:00", "crawled": "2018-01-31T09:58:15.001+02:00", "highlightTitle": ""}