{"organizations": [], "uuid": "5425b06f603fa16aa3d84ab3bbbeffae4c4ae8e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221628114&w=1200&r=LYNXMPEE0C02M", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/china-cofco-strategy/insight-chinas-cofco-makes-painful-cuts-in-drive-to-lead-global-food-trade-idINKBN1F203L", "country": "US", "domain_rank": 408, "title": "Insight: China's COFCO makes painful cuts in drive to lead global food trade", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T05:53:00.000+02:00", "replies_count": 0, "uuid": "5425b06f603fa16aa3d84ab3bbbeffae4c4ae8e2"}, "author": "", "url": "https://in.reuters.com/article/china-cofco-strategy/insight-chinas-cofco-makes-painful-cuts-in-drive-to-lead-global-food-trade-idINKBN1F203L", "ord_in_thread": 0, "title": "Insight: China's COFCO makes painful cuts in drive to lead global food trade", "locations": [], "entities": {"persons": [{"name": "saul", "sentiment": "none"}, {"name": "hallie gu", "sentiment": "none"}, {"name": "gus trompiz", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "cofco", "sentiment": "negative"}, {"name": "foodstuffs corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "china national cereals", "sentiment": "none"}, {"name": "cofco international ltd", "sentiment": "none"}, {"name": "china oil and foodstuffs corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON/PARIS/BEIJING (Reuters) - China’s COFCO International is in the throes of a staffing upheaval as the group pursues its professed ambition of sitting at the top table of global agricultural traders.\nFILE PHOTO: The company logo of China Oil and Foodstuffs Corporation (COFCO) is seen at its headquarters in Beijing, China, November 3, 2016. REUTERS/Thomas Peter/File Photo But doubts persist among some in the industry over whether the trading firm will really challenge the existing four dominant players in grains, oilseeds and sugar. In the end, they suspect, it may prioritise securing strategic food supplies for China over commercial aims in an era of rising trade tensions.\nState-owned conglomerate China National Cereals, Oils and Foodstuffs Corp began building its foreign commodities operations in 2014 and formally launched the COFCO International Ltd (CIL) trading division in April last year. Its assets include port facilities in Brazil and Romania, sugar mills in Brazil and grain silos across the globe.\nLast month Yu Xubo, president of the Beijing-based parent COFCO Group, laid out a bold expansion. “We aim to become the largest international food trader by 2020, not only in assets we own and revenues we make, but also in the quality of our assets, business operation, and return on investment,” he told the official China Daily.\nCOFCO Group, which has interests that include hotels, real estate and some of China’s leading food and drink brands including Great Wall wine, reported revenue of 344.796 billion yuan ($53 billion) in the first nine months of 2017.\nReflecting progress towards its targets, by the middle of last year the group was already the second biggest grain exporter from Argentina, one of the world’s top food producers.\nPAINFUL INTEGRATION China is securing its global supply lines, moving into mining ventures in Africa, expanding its ocean shipping fleet and buying ports around the world. This effort is accelerating under President Xi Jinping’s trillion-dollar Belt and Road initiative involving huge infrastructure projects connecting China to Europe and beyond.\nBut COFCO International - in which Singapore, London-based Standard Chartered and the World Bank’s commercial arm also hold stakes - has spent most of the past year integrating past purchases rather than expanding.\nThis process has been painful at a difficult time for all traders. Four years of bumper global grains and oilseeds harvests have squeezed profits at the established players: Archer Daniels Midland Co, Bunge, Cargill Inc and Louis Dreyfus Co, known as the “ABCDs” due to their initials.\n“It has been a challenging period,” said one source with knowledge of COFCO International’s strategy. But the source told Reuters the worst was over, with the trader poised to try to take market share from rivals. “The big ambition is still there - to be the new C of the ABCDs.”\nCOFCO International has been trying to integrate two purchases, together worth more than $3 billion, that it agreed three years ago - of Rotterdam-based grain trader Nidera and the agribusiness of Singapore-listed Noble Group.\nThis has meant heavy job losses. A company official said last month that over 2,500 jobs had been shed in its Brazilian sugar operations alone, with further cuts expected there, although this was separate from the integration process.\nCOFCO Group has also sent a team of managers from Beijing to take pivotal roles in operations across the globe, including in Canada, Brazil and Europe, company memos seen by Reuters showed.\nA spokesman for Geneva-based COFCO International said around 50 of its staff are former COFCO Group employees, although he noted this was out of a total workforce that exceeds 13,000. The spokesman declined to comment further on human resources issues.\nChief executive Johnny Chi, who held top positions with COFCO Group in China, has overseen the departure of several top staff at Nidera, from which the trader inherited big losses. These included a $150 million financial hole in its Latin American operations and $200 million in unauthorised trading losses on its biofuels desk.\nCompany memos show Chi has been followed by Frank Feng, appointed chief risk officer for South America and Lucas Shi, who has taken the same role at a regional level in the “Southern Cone” countries including Argentina. Another recruit from Beijing is Dong Guo, who has become chief research officer.\nSources said Nidera teams have been shrunk or removed in Europe and North America. This followed a management reshuffle in Brazil after the accounting irregularities.\nThe firm has also hired high profile figures from the industry, with Pierre Lorinet, former chief financial officer at trade house Trafigura, and Serge Schoen, an ex-Louis Dreyfus chief executive, both joining its board.\nCULTURAL QUESTIONS Whether the firm has achieved a turnaround yet is unclear. No profit and loss accounts are available for COFCO International, in which the Beijing parent holds 48 percent and the sovereign wealth fund China Investment Corp 12 percent.\nCOFCO International announced in November an agreement to sell its crop seeds business to Swiss-based Syngenta AG - which has been bought by ChemChina - but did not disclose price terms.\n“The seeds sale has boosted the balance sheet,” a second source said. “2017 has been an effective year and COFCO International is back on track and can start thinking again about growing.”\nCOFCO has said it will pursue partnerships to expand overseas after signing a supply deal with U.S. cooperative Promark last year.\nOne former COFCO International manager who left in the past year said the firm had been struggling over how to cut costs and ensure future revenues after shedding people who had been making it money. Other problems lay in overcoming cultural differences across its global operations.\n“It’s a big machine. It doesn’t think like a business. It thinks like a government,” the former manager told Reuters, declining to be named.\nThe spokesman for COFCO International Ltd (CIL) said “differences in corporate culture are normal in the context of a merger of companies”.\n“CIL is currently deploying a new common corporate culture across all CIL locations which was developed by various CIL management in 2017,” he added.\nFEEDING CHINA Chi has played down suggestions that the firm is torn between competing objectives, unsure whether to pursue its own commercial aims or the strategic interests of its home country. In November, he told the Financial Times it did not want to be “just a procurement platform for COFCO Corporation or China”.\nBut some remain sceptical. “What COFCO International should strive for is to be the most efficient procurement office for China – the feeding of China’s population is of the utmost strategic importance,” said Jean-Francois Lambert, founding partner of Lambert Commodities consultancy. “This is in fact their prime objective.”\nWith such powerful Chinese shareholders, the firm has the financial clout to become an ABCD “if they want to”, said Jay O‘Neil, senior agricultural economist at Kansas State University.\nCOFCO International had overpaid for the investments in Nidera and ", "external_links": [], "published": "2018-01-13T05:53:00.000+02:00", "crawled": "2018-01-13T06:22:34.007+02:00", "highlightTitle": ""}