{"organizations": [], "uuid": "f6c0fdb43cbe9e923ab595dc4580012929061b42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221059168&w=1200&r=LYNXMPEE0A0FX", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/taiwan-defence-spending/taiwan-plans-to-invest-in-advanced-arms-as-china-flexes-its-muscles-idINKBN1F00PB", "country": "US", "domain_rank": 408, "title": "Taiwan plans to invest in advanced arms as China flexes its muscles", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T09:33:00.000+02:00", "replies_count": 0, "uuid": "f6c0fdb43cbe9e923ab595dc4580012929061b42"}, "author": "", "url": "https://in.reuters.com/article/taiwan-defence-spending/taiwan-plans-to-invest-in-advanced-arms-as-china-flexes-its-muscles-idINKBN1F00PB", "ord_in_thread": 0, "title": "Taiwan plans to invest in advanced arms as China flexes its muscles", "locations": [], "entities": {"persons": [{"name": "jess macy yu", "sentiment": "negative"}, {"name": "tsai", "sentiment": "none"}, {"name": "torode", "sentiment": "none"}, {"name": "tsai ing-wen", "sentiment": "none"}, {"name": "reuters/fabian hamacher", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "taipei", "sentiment": "none"}], "organizations": [{"name": "dpp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ministry of national defence", "sentiment": "none"}, {"name": "democratic progressive party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TAIPEI/HONG KONG (Reuters) - Taiwan’s ruling party plans to use a long-term increase in defence spending to pursue advanced weapons systems, government officials say, in what is widely seen as growing determination to forge a stronger deterrent against a Chinese attack.\nTaiwan's President Tsai Ing-wen speaks during the end-of-year news conference in Taipei, Taiwan December 29, 2017. REUTERS/Fabian Hamacher The left-leaning Democratic Progressive Party (DPP), led by President Tsai Ing-wen, is working on detailed spending plans through 2025, two officials with direct knowledge of the matter told Reuters.\nTsai and her team have met repeatedly with military leaders in a push for new investment in training and equipment, one of the officials said. Immediate priorities include new missiles, drones and electronic warfare systems, fighter aircraft and ballistic missile defences, according to a separate statement from the Ministry of National Defence sent to Reuters.\nAlthough some arms would be domestically produced, such as an existing plan to locally build eight submarines, they say a longer-term Taiwanese drive for improved capabilities could mean fresh U.S. deals. Those requests could deepen tensions between Beijing and Washington.\nChina considers democratic Taiwan to be a wayward province and has never renounced the use of force to bring the island under its control.\nThe United States, Taiwan’s sole foreign supplier of arms, has for years called on Taipei to address a worsening military imbalance across the Taiwan Strait, which has recently seen heightened tensions amid military assertiveness by China. In the first week of 2018, China sailed an aircraft carrier and other military ships through the strait on a training mission.\n“If there are three weapons systems that China’s high command really wants to keep out of Taiwan’s hands, it is submarines, fighter jets and ballistic missile defences. Taipei is smartly investing in all three,” said Ian Easton, a U.S.-based research fellow at the Project 2049 Institute, which studies Asia security issues.\nIn October, Tsai signalled that defence spending would increase by at least 2 percent each year, with more possible based on the need for significant purchases.\nBy 2025, Taiwan’s annual defence spending is projected to increase by at least 20 percent - or NT$62.4 billion ($2.08 billion) - to NT$381.7 billion, the officials said, if the legislature approves the future budgets.\nWith economic growth “on track” for this year, Taiwan’s defence spending will “likely” exceed the baseline that the president has announced, one of the officials said.\n“The Tsai administration is seeking to undo years of defence spending cuts,” the two officials said in a separate written statement to Reuters.\n“The additional funds will target enhancements in asymmetrical defence strategies in the short-term, and advanced weapons and equipment either domestically produced or through defence procurements in the long-term,” one of them added.\nTaiwan’s Ministry of National Defence confirmed to Reuters that electronic warfare, information security and improved drones were among the priorities for this year, along with existing programmes, including upgrades of its Raytheon Co Patriot missile defences, Lockheed Martin Corp F-16A/B jet fighters and indigenously built training planes.\nThe ministry also confirmed plans to improve mobile missile launchers, but has yet to detail whether that would mean reviving an earlier ballistic missile programme or improving the cruise missiles Taiwan already has. Both are likely to face intense Chinese scrutiny.\nThe planned increases mark a change in commitment from the previous China-friendly Kuomintang government under President Ma Ying-jeou, under whom defence spending from 2009 to 2016 slid from 3 percent to 2.1 percent of GDP, according to government data.\nRegional diplomats are watching developments closely. Although few nations have formal diplomatic or military ties with the island, any boost in Taiwan’s military could complicate China’s strategic domain.\n“The military balance is rapidly shifting in China’s favour, but the new Taiwanese government is more prepared to stand up to China’s behaviour,” said Singapore-based security analyst Tim Huxley. “I think some countries, particularly Japan, will see that as a net benefit by making life more difficult for China.”\nIn recent months, China has ramped up its long-range air force drills, particularly around Taiwan. In March, it said its defence spending would increase 7 percent for 2017, or 1.044 trillion yuan ($158.70 billion).\nAfter taking office in 2016, Tsai has promoted Taiwan’s domestic defence industry as one of several pillars under a so-called “5 plus 2” program that seeks to foster important business sectors in Taiwan.\nAnalysts have said Taiwan would need to improve both asymmetric warfare and high-end capabilities like aircraft and missile defence after years of budgetary neglect.\nAsymmetric warfare means using limited resources to inflict unacceptable damage to a more powerful opponent. Taiwan is betting it can make an attack on it too painful for China to consider, according to Collin Koh, a research fellow at Singapore’s S. Rajaratnam School of International Studies.\n“The Taiwanese may not be able to overturn the balance of power now, but they can improve their abilities to raise the costs on China,” he said.\n($1 = 29.9480 Taiwan dollars)\n($1 = 6.5786 Chinese yuan renminbi)\nEditing by Anne Marie Roantree and Gerry Doyle\n ", "external_links": [], "published": "2018-01-11T09:33:00.000+02:00", "crawled": "2018-01-11T09:57:11.096+02:00", "highlightTitle": ""}