{"organizations": [], "uuid": "4580855c1ed62e0298fe608c50d5045aed1aa87f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/westinghouse-ma-toshiba/explainer-toshiba-after-the-westinghouse-sale-idUSL4N1P02K9", "country": "US", "domain_rank": 408, "title": "EXPLAINER-Toshiba after the Westinghouse sale", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T11:06:00.000+02:00", "replies_count": 0, "uuid": "4580855c1ed62e0298fe608c50d5045aed1aa87f"}, "author": "", "url": "https://www.reuters.com/article/westinghouse-ma-toshiba/explainer-toshiba-after-the-westinghouse-sale-idUSL4N1P02K9", "ord_in_thread": 0, "title": "EXPLAINER-Toshiba after the Westinghouse sale", "locations": [], "entities": {"persons": [], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "westinghouse", "sentiment": "negative"}, {"name": "explainer-toshiba", "sentiment": "negative"}, {"name": "brookfield asset management inc", "sentiment": "none"}, {"name": "westinghouse electric co llc", "sentiment": "none"}, {"name": "toshiba", "sentiment": "none"}, {"name": "toshiba corp", "sentiment": "none"}, {"name": "u.s. bankruptcy court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 9:06 AM / Updated an hour ago EXPLAINER-Toshiba after the Westinghouse sale Reuters Staff 4 Min Read \nTOKYO, Jan 5 (Reuters) - A $4.6 billion deal announced on Thursday to sell bankrupt U.S. nuclear plant maker Westinghouse Electric Co LLC will help its owner Toshiba Corp move a step closer to rebuilding its finances and focusing on smaller but more stable businesses. \nThe deal, agreed with a subsidiary of Canada’s Brookfield Asset Management Inc , adds to a string of recent asset sales by Toshiba and will pave the way for the once-sprawling chips-to-TV conglomerate to become a lean maker of components and machinery. \nThe deal, coming on the heels of Toshiba’s long-awaited agreement to sell its memory chips business for $18 billion, is due to close in the third quarter, assuming it wins the approval of regulators and the U.S. Bankruptcy Court. \nToshiba’s shares rose 2 percent on Friday after briefly reaching a 2 1/2 month high. HOW DOES THIS AFFECT TOSHIBA? \nToshiba does not stand to benefit directly from the sale. Proceeds will be divided among Westinghouse creditors which currently include Toshiba, but the Japanese firm plans to sell its Westinghouse-related claims by the end of March. \nAnalysts, however, said the sale amount was higher than projections, with Macquarie Research’s Damian Thong saying he expected a deal of around $4 billion. \nThat has raised hopes that Toshiba can secure a good deal on its Westinghouse-related claims. The firm has said selling the claims by March-end would allow it to book a steep loss, thereby securing a major tax benefit that would offset the levy expected on capital gains from the sale of its memory business. DOES TOSHIBA STILL NEED TO SELL THE CHIPS UNIT? \nSome analysts said the Westinghouse deal could add fuel to calls from investors for the Japanese conglomerate to reconsider selling its chips business, Toshiba Memory. \nToshiba agreed in late September to sell the unit, the world’s second-biggest producer of NAND chips, to a consortium led by U.S. private equity firm Bain Capital LP for $18 billion, to cover billions of dollars in liabilities arising from Westinghouse’s bankruptcy. \nMost analysts agree with Toshiba’s view that if it retained the business, it would have difficulty investing enough to keep up with NAND leader Samsung Electronics Co Ltd while also trying to rebuild its finances. \n“To respond to rapidly growing NAND demand and to keep up with necessary research and development, the memory business requires massive investment,” a Toshiba spokesman said on Friday. \n“Our stance is still that the deal with the Bain-led consortium is the best way.” \nWHAT‘S LEFT FOR TOSHIBA? \nToshiba will keep 40.2 percent of Toshiba Memory meaning it will continue to benefit from growth in the chips segment. Other than that, it has few strong profit drivers having sold its lucrative medical business in 2016. \nIts remaining business will include maintenance of domestic nuclear facilities, as well as selling elevators, train systems, and light fixtures - all stable businesses with little growth potential. \n“We are waiting to see what kind of growth scenario Toshiba will present after the chip sale,” said a senior executive at one of Toshiba’s creditor banks. \n“I just don’t see competitive, market leading businesses among those remaining,” said the executive, who declined to be identified given the sensitivity of the matter. \nToshiba is also not entirely rid of risk. One concern has been a 20-year contract to buy liquefied natural gas (LNG) from Freeport LNG in the U.S. state of Texas, a deal struck in 2013 as part of a plan to sweeten sales of turbines for power plants. \nAs Asian gas prices plunge, Toshiba must find more buyers for the LNG or pay a fixed gas processing fee to Freeport of about $370 million per year for the life of the contract, which begins in 2019. Reporting by Tokyo Newsroom; Editing by Christopher Cushing", "external_links": [], "published": "2018-01-05T11:06:00.000+02:00", "crawled": "2018-01-05T11:24:14.000+02:00", "highlightTitle": ""}