{"organizations": [], "uuid": "72f24627974de936422652b4c129edad696440cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/19/104538601-20170619-1615-2392.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/goldman-these-other-dow-stocks-may-win-if-rates-keep-shooting-higher.html", "country": "US", "domain_rank": 767, "title": "Goldman, these other Dow stocks may win if rates keep shooting higher", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-29T18:55:00.000+02:00", "replies_count": 0, "uuid": "72f24627974de936422652b4c129edad696440cb"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/29/goldman-these-other-dow-stocks-may-win-if-rates-keep-shooting-higher.html", "ord_in_thread": 0, "title": "Goldman, these other Dow stocks may win if rates keep shooting higher", "locations": [], "entities": {"persons": [{"name": "adam jeffery", "sentiment": "none"}, {"name": "kensho", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "goldman", "sentiment": "negative"}, {"name": "venture capital goldman", "sentiment": "negative"}, {"name": "dow", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "cnbc lloyd blankfein", "sentiment": "none"}, {"name": "dow jones", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "j.p. morgan chase", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The jump in the 10-year Treasury yield to its highest in more than three years signals gains for big banks and technology stocks, history shows.\nUsing quantitative analysis tool Kensho, CNBC looked at the performance of Dow Jones industrial average components when 10-year bond prices fall and yields surge. \nJust four weeks into the new year, the 10-year price has already fallen more than 2 percent. The yield climbed to a high of 2.727 percent Monday morning, its highest since April 29, 2014, as traders bet on greater economic growth and elevated inflation. Markets expect the Federal Reserve to raise interest rates at least two times this year.\nIf that yield keeps rising to 3 percent in the next three months, history shows it should be good for bank stocks like Goldman Sachs and J.P. Morgan Chase , which can profit from higher rates and benefit from increased economic growth overall. Goldman shares rise an average of 13.19 percent and J.P. Morgan 9.76 percent over the three months in which the 10-year's price falls at least 2 percent, sending the yield higher, the Kensho study showed.\n\n(Our search looked at how members of the Dow performed during drops of at least 2 percent in the price of the 10-year over three months for the last 25 years.)\nHistory was holding true so far, as the big bank stocks were among the few advancers in Monday's market sell-off. \nThe Kensho study also showed that during periods of rising rates tech giants Apple and Microsoft tended to gain, up an average 10.38 percent and 9.74 percent, respectively. \nThe latest rise in Treasury yields also comes as the U.S. dollar has fallen to three-year lows, as traders worry the slump in the greenback will reduce demand for Treasurys. Dollar weakness increases the U.S. value of overseas earnings, helping technology stocks and multinational industrial companies such as Caterpillar , which generate a significant amount of their revenue outside the U.S. \nDuring periods of rising rates, Caterpillar had the fifth-greatest average return of 9.47 percent, the Kensho study showed.\nAs traders sell bonds and take riskier investments, they also tend to sell \"safety\" stocks in telecommunications and consumer staples. \n\nThe worst Dow performer during periods of rising rates was Verizon , up just an average of 1.87 percent, the Kensho study showed. Coca-Cola , Procter & Gamble , and pharmaceutical giants Merck and Pfizer were also among the five worst-performing Dow components, gaining on average roughly 3 percent or less. \n\"They're more dividend plays, more interest rate sensitive, and they're defensive plays,\" said Nick Raich, CEO of The Earnings Scout. He pointed out that utilities, real estate investment trusts and telecommunications are the only S&P 500 sectors in the red for the year so far. \n— CNBC's John Melloy contributed to this report. \nDisclosure: CNBC's parent NBCUniversal is a minority investor in Kensho.", "external_links": [], "published": "2018-01-29T18:55:00.000+02:00", "crawled": "2018-01-29T18:56:10.001+02:00", "highlightTitle": ""}