{"organizations": [], "uuid": "34e3abcbdb61635f021334d91d9d9455f77c39f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-extended-stay-america-announces-extension-of-paired-share-repurchase-authorization.html", "country": "US", "domain_rank": 767, "title": "Extended Stay America Announces Extension of Paired Share Repurchase Authorization", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:05:00.000+02:00", "replies_count": 0, "uuid": "34e3abcbdb61635f021334d91d9d9455f77c39f0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-extended-stay-america-announces-extension-of-paired-share-repurchase-authorization.html", "ord_in_thread": 0, "title": "Extended Stay America Announces Extension of Paired Share Repurchase Authorization", "locations": [], "entities": {"persons": [], "locations": [{"name": "america", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "esh hospitality", "sentiment": "negative"}, {"name": "inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLOTTE, N.C., Jan. 02, 2018 (GLOBE NEWSWIRE) -- Extended Stay America, Inc. and ESH Hospitality, Inc. (NYSE:STAY) (together, the “Company”) today announced that the Company’s Boards of Directors extended the maturity of the combined Paired Share repurchase program through December 31, 2018, each effective January 1, 2018. The extension of the Paired Share repurchase authorization highlights the Company’s commitment to returning meaningful capital to shareholders while continuing to invest in the Company’s hotel portfolio and growth opportunities.\nRepurchases may be made at management’s discretion from time to time in the open market, in privately negotiated transactions or by other means (including through Rule 10b5-1 trading plans). Depending on market conditions and other factors, these repurchases may be commenced or suspended without prior notice.\nForward Looking Statements\nThis release contains forward-looking statements within the meaning of the federal securities laws. Statements related to, among other things, future financial performance, future paired share repurchases, the expected timing, completion and effects of any proposed asset disposals, expected performance, free cash flow, debt reduction, distribution growth, franchised new builds, owned new builds and other growth opportunities, as such, involve known and unknown risks, uncertainties and other factors that may cause the Company’s actual results or performance to differ from those projected in the forward-looking statements, possibly materially. For a description of factors that may cause the Company’s actual results or performance to differ from projected results or performance implied by forward-looking statements, please review the information under the headings “Cautionary Note Regarding Forward-Looking Statements” and “Risk Factors” included in the Company’s combined annual report on Form 10-K filed with the Securities and Exchange Commission (“SEC”) on February 28, 2017 and other documents of the Company on file with or furnished to the SEC. Any forward-looking statements made in this release are qualified by these cautionary statements, and there can be no assurance that the actual results or developments anticipated by the Company will be realized or, even if substantially realized, will have the expected consequences to, or effects on, the Company, its business or operations. Except as required by law, the Company undertakes no obligation to update publicly or revise any forward-looking statement, whether as a result of new information, future developments or otherwise. We caution you that actual results may differ materially from what is expressed, implied or forecasted by the Company’s forward-looking statements.\nAbout Extended Stay America\nExtended Stay America, Inc., the largest owner/operator of company-branded hotels in North America, owns and operates 624 hotels and over 68,000 rooms in North America and employs over 8,000 employees at its hotel properties and headquarters. The Company’s core brand, Extended Stay America®, serves the mid-priced extended stay segment. Visit ESA.com for more information about the Company and its services.\nContacts\nInvestors:\nRob Ballew\n(980) 345-1546\ninvestorrelations@extendedstay.com\nMedia:\nTerry Atkins\n(980) 345-1648\ntatkins@extendedstay.com\nSource:Extended Stay America, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=Dik6pgNnn_nuPcpp_E3blPMCLsL2q0Q-APgC-mlLcinSqJ3zVpO5UGgX9R3uN0cQ2BeDssRWmqj-oEKXkW32zdcRS7AySafpFpUhjRExhid_Qagzl2Cr_HAymqZg39lKF0XnqnIKX7xz7IlpMTP81SivP8pzh8UgOs0hmZkQTbB-wjiONegClmzKxC1bHlFmsDdjSOm4gcuNEXqVU_4aTQ=="], "published": "2018-01-03T00:05:00.000+02:00", "crawled": "2018-01-03T02:06:37.002+02:00", "highlightTitle": ""}