{"organizations": [], "uuid": "8350e45d4eb12570fb03bdc9f6e0f6fb7477e5da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/28/reuters-america-update-2-trump-security-team-sees-building-u-s-5g-network-as-option.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2- security team sees building U.S. 5G network as option", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T02:53:00.000+02:00", "replies_count": 0, "uuid": "8350e45d4eb12570fb03bdc9f6e0f6fb7477e5da"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/28/reuters-america-update-2-trump-security-team-sees-building-u-s-5g-network-as-option.html", "ord_in_thread": 0, "title": "UPDATE 2- security team sees building U.S. 5G network as option", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "axios.com", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "huawei", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds detail China commercial relations with the U.S., 5G background, company comment)\nWASHINGTON, Jan 28 (Reuters) - President Donald Trump's national security team is looking at options to counter the threat of China spying on U.S. phone calls that include the government building a super-fast 5G wireless network, a senior administration official said on Sunday.\nThe official, confirming the gist of a report from Axios.com , said the option was being debated at a low level in the administration and was six to eight months away from being considered by the president himself.\nThe 5G network concept is aimed at addressing what officials see as China's threat to U.S. cyber security and economic security.\nThe administration of U.S. President Donald Trump has taken a harder line on policies initiated by predecessor Barack Obama on issues ranging from Beijing's role in restraining North Korea to Chinese efforts to acquire U.S. strategic industries.\nEarlier this month, AT&T was forced to scrap a plan to offer its customers handsets built by China's Huawei after some members of Congress lobbied against the idea with federal regulators, sources told Reuters.\nThe U.S. government has also blocked a string of Chinese acquisitions over national security concerns, including Ant Financial's proposed purchase of U.S. money transfer company MoneyGram International Inc.\n\"We want to build a network so the Chinese cant listen to your calls,\" the senior official told Reuters. \"We have to have a secure network that doesnt allow bad actors to get in. We also have to ensure the Chinese don't take over the market and put every non-5G network out of business.\"\nMajor wireless carriers have spent billions of dollars buying spectrum to launch 5G networks, and it is unclear if the U.S. government would have enough spectrum to build its own 5G network.\nLast year, T-Mobile US Inc spent $8 billion and Dish Network Corp $6.2 billion to win the bulk of broadcast airwaves spectrum for sale in a government auction, held by the U.S. Federal Communications Commission.\nU.S. carriers are well into the standard-setting process for 5G, and testing is already under way.\nA Verizon spokesman declined to comment. Representatives for AT&T, Sprint and T-Mobile did not immediately respond to requests for comment.\nAnother option includes having a 5G network built by a consortium or wireless carriers, the official said.\n\"We want to build a secure 5G network and we have to work with industry to figure out the best way to do it,\" the official said, speaking on condition of anonymity.\nAxios published documents that it said were from a presentation from a National Security Council official about the 5G issue. If the government built the 5G network, it would rent access to carriers like AT&T, Verizon and T-Mobile, Axios said.\nA looming concern laid out in the presentation is China's growing presence in the manufacture and operation of wireless networks. A concerted government push could help the U.S. compete on that front, according to the presentation.\nA 5G network is expected to offer significantly faster speeds, more capacity and shorter response times, which could be utilized for new technologies ranging from self-driving cars to remote surgeries. Telecom companies and their suppliers consider it to be a multibillion-dollar revenue opportunity. (Reporting by Steve Holland and Pete Schroeder; Additional reporting by Suzanne Barlyn and David Shepardson; Editing by Chris Sanders, Peter Cooney and Cynthia Osterman)", "external_links": [], "published": "2018-01-29T02:53:00.000+02:00", "crawled": "2018-01-29T07:59:35.006+02:00", "highlightTitle": ""}