{"organizations": [], "uuid": "73802c3f572bee172ff029ba4a2e286b2c610d65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-energy-transf-ohio/ohio-again-asks-u-s-regulators-to-stop-drilling-on-rover-natgas-pipe-idUSKBN1F82L4", "country": "US", "domain_rank": 408, "title": "Ohio again asks U.S. regulators to stop drilling on Rover natgas pipe", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:38:00.000+02:00", "replies_count": 0, "uuid": "73802c3f572bee172ff029ba4a2e286b2c610d65"}, "author": "", "url": "https://www.reuters.com/article/us-energy-transf-ohio/ohio-again-asks-u-s-regulators-to-stop-drilling-on-rover-natgas-pipe-idUSKBN1F82L4", "ord_in_thread": 0, "title": "Ohio again asks U.S. regulators to stop drilling on Rover natgas pipe", "locations": [], "entities": {"persons": [{"name": "rover", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "stark county", "sentiment": "none"}, {"name": "tuscarawas river", "sentiment": "none"}], "organizations": [{"name": "ferc", "sentiment": "none"}, {"name": "ohio environmental protection agency", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "epa", "sentiment": "none"}, {"name": "u.s. federal energy regulatory commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "energy transfer partners lp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 8:46 PM / in 15 minutes Ohio again asks U.S. regulators to stop drilling on Rover natgas pipe Reuters Staff 3 Min Read \n(Reuters) - Ohio environmental regulators on Friday asked federal energy regulators to order Energy Transfer Partners LP to cease drilling operations on the Rover natural gas pipeline under the Tuscarawas River over concern about the potential for a spill. \nThe Ohio Environmental Protection Agency said in a filing with the U.S. Federal Energy Regulatory Commission (FERC) that it learned last week that 146,000 gallons of drilling fluid were “lost down the hole” that ETP is drilling under the Tuscarawas River in Stark County, Ohio. \nThat is the same site as a spill last April of 2 million gallons of mostly clay and water used to lubricate drilling blades, which led FERC to temporarily ban ETP from new horizontal drilling in May. \n“FERC cannot idly stand by and allow these significant threats to Ohio continue,” the Ohio EPA said, noting it wants the federal agency to “order the cessation of drilling operations until such time a solution is developed.” \nOfficials at ETP were not immediately available for comment. \nLast week, the company said in response to a similar filing by the Ohio EPA that it continues “to work in coordination with FERC ... and are following the (horizontal drilling) plan that has been approved by FERC and the Ohio EPA.” \nOhio, which asked FERC to ban all of ETP’s horizontal directional drilling in November, said in its filing last week that it wanted more information on the Tuscarawas drilling. \nFERC in December allowed ETP to complete all horizontal drills on the Rover project, including those in Ohio. \nPipeline companies use horizontal directional drilling to cross under large obstacles like highways and rivers. \nOnce finished, the $4.2 billion Rover pipeline will carry up to 3.25 billion cubic feet of gas per day from the Marcellus and Utica shale fields in Pennsylvania, Ohio and West Virginia to the U.S. Midwest and Ontario in Canada. \nOne billion cubic feet per day of gas can supply about five million U.S. homes. \nETP said last week that it expected to finish Rover by the end of the first quarter. \nAbout 1.0 bcfd of gas was already flowing on completed portions of the pipeline, according to Reuters data. \nMajor gas producers that have signed up to use Rover include units of privately held Ascent Resources LLC, Antero Resources Corp, Range Resources Corp, Southwestern Energy Co, Eclipse Resources Corp and EQT Corp. Reporting by Scott DiSavino; Editing by Richard Chang", "external_links": [], "published": "2018-01-19T22:38:00.000+02:00", "crawled": "2018-01-19T23:04:44.014+02:00", "highlightTitle": ""}