{"organizations": [], "uuid": "063f4e4c5bfc5cf8ea1b52c04610802e90d1d7dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/05/21/101693088-480270735.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19836768/device/rss/rss.html", "section_title": "Energy", "url": "https://www.cnbc.com/2018/01/23/oil-focuses-on-strong-economy-and-opec-cuts-traders-prepare-for-downward-move.html", "country": "US", "domain_rank": 767, "title": "Oil focuses on strong economy and OPEC cuts; traders prepare for downward move", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.311, "site_type": "news", "published": "2018-01-24T04:18:00.000+02:00", "replies_count": 0, "uuid": "063f4e4c5bfc5cf8ea1b52c04610802e90d1d7dd"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/oil-focuses-on-strong-economy-and-opec-cuts-traders-prepare-for-downward-move.html", "ord_in_thread": 0, "title": "Oil focuses on strong economy and OPEC cuts; traders prepare for downward move", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "neutral"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices bounced back on Wednesday, with U.S. crude topping $65 a barrel for the first time in more than three yeas, as government data showing a drop in U.S. crude oil stockpiles contradicted an earlier industry report that indicated inventory levels rose.\nBrent futures were up 4 cents to $70 a barrel by 10:39 a.m. ET (1539 GMT), after climbing above $70 this month for first time since 2014. U.S. West Texas Intermediate (WTI) futures were up 60 cents, or 1 percent, at $65.07 a barrel, the highest level since Dec. 8, 2014.\nU.S. commercial crude inventories dropped by 1.1 million barrels a day in the week through Jan. 19, according to the U.S. Energy Information Administration, compared with analyst expectations for a decrease of 1.6 million barrels.\nThe American Petroleum Institute, and industry group, had said on Tuesday that inventories rose by 4.8 million barrels, after nine weeks of drawdowns.\nGasoline stocks rose by 3.1 million barrels, compared with analysts' expectations in a Reuters poll for a 2.5 million-barrel gain. Distillate stockpiles, which include diesel and heating oil, rose by 639,000 barrels, versus expectations for a 1.5 million-barrel drop, the EIA data showed.\nshow chapters Charts show oil prices could soon peak 21 Hours Ago | 01:13 Weekly U.S. crude oil production rose to nearly 9.9 million barrels a day, edging closer to a new all-time record above 10 million barrels a day.\nIn Asia, oversupply of gasoline has pulled down refinery profits to their lowest level since 2015.\nAmid these indicators, traders are taking measures to protect themselves from a potential fall in crude prices.\nTrading data shows open interest for Brent put options to sell at $70, $69 and $68 per barrel has surged since the middle of last week on the Intercontinental Exchange (ICE).\n\"The options market shows increased demand for downside protection. This makes sense considering how one-sided (to the upside) the speculative bets have become,\" said Ole Hansen, head of commodity strategy at Saxo Bank.\nThere is now far more demand for options to sell Brent than there is for call options, which are the right to buy Brent at a certain price.\nSukrit Vijayakar energy consultancy Trifecta said the rising options to sell were a result of huge amounts of long positions that have been built up over the past months of rising prices.\n\"We still have...nine long barrels for every short barrel, so a reversal should be interesting to watch,\" he said.\nshow chapters Commodities tomorrow: Crude touches $70, falls back 2:46 PM ET Tue, 23 Jan 2018 | 00:41 Despite this, traders said oil was unlikely to tumble far as markets remain supported by strong economic growth and by supply restrictions led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia.\nRussian Energy Minister Alexander Novak said on Wednesday that an average Brent price of around $60 was a reasonable forecast for this year, Interfax news agency reported.\nIn the latest sign of healthy economic growth, Japanese manufacturing activity expanded at the fastest pace in almost four years in January, a survey showed on Wednesday.\nEconomic growth is translating into oil demand growth and comes at a time that OPEC and Russia lead production cuts aimed at tightening the market. The deal to withhold output started in January last year and is currently set to last through 2018.\nStephen Innes, head of trading for Asia-Pacific at futures brokerage Oanda in Singapore said a \"beaming economic forecast along with stout compliance from OPEC (to withhold production) is providing convincing support.\"\n— CNBC's Tom DiChristopher contributed to this report.", "external_links": [], "published": "2018-01-24T04:18:00.000+02:00", "crawled": "2018-01-24T05:51:52.000+02:00", "highlightTitle": ""}