{"organizations": [], "uuid": "198aeb791d15a3b0adcaf0f0fdf58f4d320a9451", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/20/104415358-Steve_Jobs_looks_on.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/15/steve-jobs-changed-the-future-of-laptops-10-years-ago-today.html", "country": "US", "domain_rank": 767, "title": "Steve Jobs changed the future of laptops 10 years ago today", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T19:10:00.000+02:00", "replies_count": 0, "uuid": "198aeb791d15a3b0adcaf0f0fdf58f4d320a9451"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/15/steve-jobs-changed-the-future-of-laptops-10-years-ago-today.html", "ord_in_thread": 0, "title": "Steve Jobs changed the future of laptops 10 years ago today", "locations": [], "entities": {"persons": [{"name": "steve jobs", "sentiment": "neutral"}, {"name": "bill gates", "sentiment": "none"}], "locations": [{"name": "florida", "sentiment": "none"}], "organizations": [{"name": "sony", "sentiment": "none"}, {"name": "macbook air", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\"It's the world's thinnest notebook,\" said Steve Jobs as he introduced the MacBook Air 10 years ago today. Apple 's Macworld 2008 was a special one, taking place just days after the annual Consumer Electronics Show had ended and Bill Gates bid farewell to Microsoft . Jobs introduced the MacBook Air by removing it from a tiny paper office envelope, and the crowd was audibly shocked at just how small and thin it was. We'd never seen a laptop quite like it, and it immediately changed the future of laptops.\nRead more from The Verge:\nFacebook's startling new ambition is to shrink \nGoogle is pulling addiction treatment center ads worldwide \nMonkeys in Florida have deadly herpes, so please don't touch them \nAt the time, rivals had thin and light laptops on the market, but they were all around an inch thick, weighed 3 pounds, and had 8- or 11-inch displays. Most didn't even have full-size keyboards, but Apple managed to create a MacBook Air with a wedge shape so that the thickest part was still thinner than the thinnest part of the Sony TZ Series — one of the thinnest laptops back in 2008. It was a remarkable feat of engineering, and it signaled a new era for laptops.\nApple's original MacBook Air only had one USB port  Apple ditched the CD drive and a range of ports on the thin MacBook Air, and the company introduced a multi-touch trackpad and SSD storage. There was a single USB 2.0 port, alongside a micro-DVI port and a headphone jack. It was minimal, but the price was not. Apple's base MacBook Air cost $1,799 at the time, an expensive laptop even by today's standards.\nIt took Windows laptop makers years to catch up to the MacBook Air, all while Apple's laptop kept winning praise from reviewers. It wasn't until a few years ago that rivals even managed to surpass Apple's laptop and introduce superior designs with better displays, specifications, and equivalent trackpads. Even today, Apple still sells the MacBook Air at a starting price of $999 with a design and display that now feels too dated against the modern competition.\nApple has so far refused to redesign the MacBook Air to compete against the Surface Laptop, Dell's XPS 13, and other rivals. Apple introduced the 12-inch MacBook instead, but it hasn't had the same impression on the industry as the MacBook Air. It's still possible Apple might surprise us with a new MacBook Air, but given its position between the 12-inch MacBook and the 13-inch MacBook Pro options, it feels unlikely. The existing MacBook Air hasn't been updated for nearly three years, and it certainly looks like it's now living out its final days after being so influential for so many years.", "external_links": [], "published": "2018-01-15T19:10:00.000+02:00", "crawled": "2018-01-15T20:54:42.003+02:00", "highlightTitle": ""}