{"organizations": [], "uuid": "9707a85e281e1a0a15145f5a1d0be1e84e6e9ef3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943089-GettyImages-903917830.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/14/trump-attacks-wall-street-journal-as-fake-news-over-his-north-korea-comments.html", "country": "US", "domain_rank": 767, "title": "Trump attacks Wall Street Journal as 'fake news' over his North Korea comments", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.18, "site_type": "news", "published": "2018-01-14T17:57:00.000+02:00", "replies_count": 0, "uuid": "9707a85e281e1a0a15145f5a1d0be1e84e6e9ef3"}, "author": "Spencer Kimball", "url": "https://www.cnbc.com/2018/01/14/trump-attacks-wall-street-journal-as-fake-news-over-his-north-korea-comments.html", "ord_in_thread": 0, "title": "Trump attacks Wall Street Journal as 'fake news' over his North Korea comments", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "sarah sanders", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "north korea", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "journal", "sentiment": "negative"}, {"name": "wall street journal", "sentiment": "negative"}, {"name": "journal and white house press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images President Donald Trump in the Roosevelt Room at the White House, on January 11, 2018. President Donald Trump on Sunday accused the Wall Street Journal of misreporting statements he made to the newspaper about his relationship with North Korean leader Kim Jong Un , ripping the publication for reporting \"fake news.\"\nIn an article published on Thursday , the Journal reported that Trump signaled openness to diplomacy with North Korea, going so far as to say, \"I probably have a very good relationship with Kim Jong Un.\"\nHowever, Trump disputed the Journal's account, and accused the publication of intentionally misquoting him to generate a story. As tensions escalate between the U.S. and North Korea, the president and Kim Jong Un have traded personal insults, while Pyongyang has defied world opinion by continuing its missile tests.\nTweet\nTweet\nOn Saturday evening, White House Press Secretary Sarah Sanders posted an image with the president's full Quote: in the Journal article and a correction from the White House, attacking the newspaper as \"fake news.\"\nTweet\nHours after Sanders' post, the Journal said it stood behind its reporting, and posted an excerpt from the audio recording on Twitter.\nTweet\nMinutes later, Sanders also posted a recording of the president's comment.\nTweet\nWhen asked by Politico's Jake Sherman why the White House waited so long to correct the Wall Street Journal, Sanders said they had asked for a correction Friday, but the paper refused.\nTweet\nTrump's disputed comments on North Korea were part of a wide-ranging interview with the Journal that touched on a broad range of issues from his first year in office.\nThe president has repeatedly attacked media outlets that publish critical reporting of his administration as fake news. Last February, he labeled several news outlets \"the enemy of the American people.\nTweet\nJust last week, the Journal stirred a new conflict with the White House with a report suggesting Trump's personal lawyer secretly paid an adult film actress $130,000 before the 2016 election. The agreement reportedly sought to compel the woman's silence about an alleged encounter with Trump more than a decade ago.\nSeparately, NBC News reports that Arizona Republican Senator Jeff Flake, one of Trump's fiercest critics in the GOP, plans to denounce the president's attacks on the media as reminiscent of Soviet dictator Josef Stalin in a speech on the Senate floor this week.\n\"When a figure in power reflexively calls any press that doesn't suit him 'fake news,' it is that person who should be the figure of suspicion, not the press,\" Flake will say, according to NBC News, which obtained excerpts from the speech.\nLast October, Flake announced that he will not seek re-election , citing the \"reckless, outrageous and undignified behavior\" in the executive branch.\nTrump, a former reality television star, had said he will announce awards for \"the most dishonest and corrupt media\" on Monday, January 8 at 5:00 pm. But Trump has since postponed his \"Fake News Awards\" until Wednesday.\nTweet", "external_links": [], "published": "2018-01-14T17:57:00.000+02:00", "crawled": "2018-01-14T17:58:13.007+02:00", "highlightTitle": ""}