{"organizations": [], "uuid": "ac88536760c4bb6ca7d3ba8cd84653b2a1a72c24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/brainstorm-health-daily-01-17-18/", "country": "US", "domain_rank": 1196, "title": "Brainstorm Health: HealthTap's Big Deal, Juno Celgene Speculation, Trump's Next Health Care Move | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.147, "site_type": "news", "published": "2018-01-17T13:02:00.000+02:00", "replies_count": 0, "uuid": "ac88536760c4bb6ca7d3ba8cd84653b2a1a72c24"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/17/brainstorm-health-daily-01-17-18/", "ord_in_thread": 0, "title": "Brainstorm Health: HealthTap's Big Deal, Juno Celgene Speculation, Trump's Next Health Care Move | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "sy", "sentiment": "neutral"}, {"name": "healthtap", "sentiment": "none"}, {"name": "ron gutman", "sentiment": "none"}, {"name": "gutman", "sentiment": "none"}], "locations": [], "organizations": [{"name": "healthtap", "sentiment": "negative"}, {"name": "bupa", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "11:02 AM EST \nGood morning, readers! This is Sy. \nDigital health firm HealthTap and Bupa , a health care provider that offers both insurance and medical services to millions around the world, are teaming up in a massive strategic partnershipthat could make “digital end-to-end” medical services a widespread reality, HealthTap CEO Ron Gutman told Fortune in an early interview previewing the arrangement. \nGutman describes it as the “biggest digital health deal” he knows of. That’s a bold claim; but the company’s new partnership with Bupa can’t be easily brushed off. Bupa does both the grunt work of medical care services (through hospitals and clinics) and the more heady business of insurance; it employs about 80,000 people around the world and has a far larger consumer base that stretches across the globe. \nBy combining forces with Bupa, HealthTap’s artificial intelligence-powered services —which can allow patients to figure out whether they need to immediately go to a hospital if they’re feeling sick, access doctors through virtual visits, receive reminders about taking or refilling prescription medications, and generally keep one, unified record of their medical history—will be available to millions, according to the companies. \nThose are all goals (and technologies) that plenty of other digital health upstarts are seeking. So what makes HealthTap’s latest collaboration different? “Everything in one app,” says Gutman. He describes it as a true “end-to-end” digital service for medicine, where even the insurance part of the equation is taken care of within the app. \n“Over the past year we have worked together to implement a number of solutions for day-to-day customer needs, such as easily finding local doctors covered by Bupa insurance, scheduling physiotherapy, immunizations, and doctor visits with local clinics, and connecting residents in our care homes with doctors by video chat,” added Bupa Group CEO Evelyn Bourke in a statement. \nGutman says that one way HealthTap sets itself apart from competitors is through its near-decade-long accumulation of data, including billions of virtual medical queries answered by the more than 100,000 doctors in its network. The fact that a group of Bupa’s size is willing to take a gamble on the firm’s tech doesn’t hurt, either. \nThe big question is whether or not this collaboration will, over the long term, validate the digital health revolution’s greatest hopes—lowering costs while improving patients’ health and providing a simple interface to do so. \nRead on for the day’s news. Sy Mukherjee @the_sy_guy DIGITAL HEALTH \nWalmart’s new move against the opioid crisis: Packaging that destroys drugs. Walmart is taking an intriguing approach to combating the U.S. opioid addiction and overdose epidemic (and improper use of drugs that should be thrown out in general)—a new kind of packet that contains ingredients which can neutralize drugs when mixed with warm water in a pill bottle. That way, the pills (including opioids) can be safely disposed of. Even more interesting? The packets, called “DisposeRx,” will be available for free. ( Fortune ) INDICATIONS \nJuno shares fly to the moon on Celgene speculation. Juno Therapeutics’ stock shot up a whopping 53% in Wednesday trading as speculation swirled that the company is in talks to be acquired by biotech giant Celgene. That could help boost Celgene’s blood cancer portfolio by giving the company access to Juno’s CAR-T drugs (new treatments which engineer patients’ immune cells to fight cancer). ( CBS News ) THE BIG PICTURE \nTrump administration to expand “moral objection” protections for health workers. Politico reports that the Trump administration is planning to set new guidelines that would shield health care workers who refuse to perform services they find morally objectionable from liability. The move could allow doctors to refue to perform abortions or treat transgender patients; these “conscience protections” would ostensibly be overseen by a new division within the Department of Health and Human Services. ( Politico ) \nThis year’s flu season is twice as bad as last year’s. We know that this year’s flu season is bad, with hospitals straining their available resources to keep up with patient demand. But just how bad is it? “While most Americans were traveling and visiting family between Dec. 24 and Dec. 30, 2017, data from athenaInsight’s 2 017 – 2018 Flu Dashboard showed that 4.34 percent of more than 1 million outpatient visits across the country were coded for influenza-like illness (ILI),” writes Chelsea Rice at athenaInsight. For context, during the same time last year, that number was just 2.07%, or less than half. REQUIRED READING ", "external_links": [], "published": "2018-01-17T13:02:00.000+02:00", "crawled": "2018-01-17T21:20:27.052+02:00", "highlightTitle": ""}