{"organizations": [], "uuid": "4598737b64b1e1ec9fd5f91c73387e51b593c4cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222139608&w=1200&r=LYNXMPEE0E0R0", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-newsnow-jan15/monday-morning-briefing-idUSKBN1F41HV", "country": "US", "domain_rank": 408, "title": "Monday Morning Briefing", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-15T20:25:00.000+02:00", "replies_count": 0, "uuid": "4598737b64b1e1ec9fd5f91c73387e51b593c4cf"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-newsnow-jan15/monday-morning-briefing-idUSKBN1F41HV", "ord_in_thread": 0, "title": "Monday Morning Briefing", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "south", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "China’s absence looms over a meeting on North Korea, Trump keeps the door open for a DACA deal and Ford unveils a $11 billion electric car investment at the Detroit auto show.\nNorth Korea\nForeign ministers from around 20 nations gather to discuss how to curb North Korea’s nuclear ambitions through diplomatic and financial pressure, but China, seen as a key player in any long-term solution, will be absent.\nU.S. President Donald Trump disputed a newspaper’s account of an interview with him last week in which he was Quote: d as saying he probably had a “very good relationship” with North Korean leader Kim Jong Un.\nNorth and South Korea agreed to hold working talks on the North sending athletes and 140-strong orchestra to next month’s Winter Olympics in the South, Seoul’s unification ministry said, as months-long tensions over the North’s weapons programs ease.\nWorld\nGerman Chancellor Angela Merkel is considering joining French President Emmanuel Macron at the World Economic Forum in Davos next week in what could turn into an epic clash of competing world views with Trump.\nRussian Foreign Minister Sergei Lavrov said Moscow will not support attempts by Washington to modify the Iran nuclear deal, arguing such a move could also complicate diplomacy over North Korea’s nuclear weapons program.\nAt least 25 people were killed and 63 wounded in a twin suicide bombing in central Baghdad on Monday, the Iraqi health ministry said on its Facebook page.\nReuters TV : Violent protests return to Tunisa\nHuman error and a lack of adequate fail-safe measures during a civil defense warning drill led to the false missile alert that stirred panic across Hawaii over the weekend, a state emergency management agency spokesman acknowledged.\nThe Reuters’ graphics team visualize the development of an Iranian oil tanker after it burned for more than a week in the East China Sea following a collision on Jan. 6.\nUnited States\nTrump insisted “I‘m not a racist” in response to reports that he had described immigrants from Haiti and African countries as coming from “shithole countries.” Trump also said he was “ready, willing and able” to reach a deal to protect illegal immigrants brought to the United States as children from being deported but that he did not believe Democrats wanted an agreement.\nU.S. immigration authorities said that it will resume accepting requests under a program that shields young people brought to the United States illegally from deportation after a court order blocked a government decision to end the program.\nDeferred Action for Childhood Arrivals recipient Gloria Mendoza participates in a demonstration in support of \"clean\" legislation in New York, U.S., January 10, 2018. Business\nThe euro hit a fresh three-year high as optimism around growth buoys expectations of tighter policy from central banks, while the chance of a pro-European coalition in Germany also boosted confidence in the continent.\nOil hovered below a three-year high near $70 a barrel on signs that production cuts by OPEC and Russia are tightening supplies, but analysts warned of “red flags” due to surging U.S. production.\nSoftBank said it was considering listing its Japanese wireless business - a move that could reportedly raise $18 billion and would accelerate the conglomerate’s transformation into one of the world’s biggest tech investors.\nBreakingviews : Facebook discovers cost of factory-farming users\nFrenetic selling in the closing weeks of 2017 saw Airbus overhaul Boeing’s recent lead in the global jet market to win their annual order contest for the fifth year running, but doubts remain over the future of its flagship A380.\nAutos\nFord will significantly increase its planned investments in electric vehicles to $11 billion by 2022 and have 40 hybrid and fully electric vehicles in its model lineup, Chairman Bill Ford said at the Detroit auto show.\nThe Trump administration plans to unveil revised self-driving car guidelines this summer as the government sets out to rewrite regulations that pose legal barriers to robot vehicles, U.S. Transportation Secretary Elaine Chao said.\nCommentary\nThe euro's winning streak will have an unwelcome side-effect, writes Paul Wallace . The more the euro zone economy thrives, the less pressure there will be on European politicians to take steps to prevent future crises. \"The harsh truth is that institution-building in Europe tends to occur when the continent is in crisis,\" sayd Wallace. \"Growth is the enemy rather than the friend of reform.\"\nThe fall of American Steve Bannon and Briton Toby Young - \"two men of the right\" - raises the question of whether journalism is operating in a space increasingly divorced from sober fact and judgment, writes John Lloyd . Bannon, Donald Trump's onetime chief strategist, was forced to leave Breitbart news because of comments about the White House to writer Michael Wolff; Young, a former columnist, resigned from a position on a British education board because of \"ill-judged\" remarks he says he made when he was \"a journalistic provovateur.\" Both men, says Lloyd, \"have been wounded by the clash of contemporary opinion journalism and the public sphere.\"\n ", "external_links": ["http://fingfx.thomsonreuters.com/gfx/rngs/CHINA-SHIPPING/010060BV0RM/index.html", "http://thomsonreuters.com/en/about-us/trust-principles.html", "https://www.reuters.tv/v/f9n/2018/01/15/violent-protests-return-to-tunisia"], "published": "2018-01-15T20:25:00.000+02:00", "crawled": "2018-01-15T16:49:13.000+02:00", "highlightTitle": ""}