{"organizations": [], "uuid": "879e1e0f97e3a26caddc64f0c630d9ab4b955d83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-impinj-names-jeff-dossett-to-executive-vice-presidentaleading-the-sales-and-marketing-organization.html", "country": "US", "domain_rank": 767, "title": "Impinj Names Jeff Dossett to Executive Vice President Leading the Sales and Marketing Organization", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.047, "site_type": "news", "published": "2018-01-16T19:00:00.000+02:00", "replies_count": 0, "uuid": "879e1e0f97e3a26caddc64f0c630d9ab4b955d83"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-impinj-names-jeff-dossett-to-executive-vice-presidentaleading-the-sales-and-marketing-organization.html", "ord_in_thread": 0, "title": "Impinj Names Jeff Dossett to Executive Vice President Leading the Sales and Marketing Organization", "locations": [], "entities": {"persons": [{"name": "jeff dossett", "sentiment": "negative"}, {"name": "dossett", "sentiment": "none"}, {"name": "chris diorio", "sentiment": "none"}, {"name": "jeff", "sentiment": "none"}, {"name": "impinj", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "porch", "sentiment": "none"}], "organizations": [{"name": "sales and marketing organization", "sentiment": "negative"}, {"name": "impinj, inc.", "sentiment": "neutral"}, {"name": "leaf group", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Impinj, Inc. (NASDAQ:PI), a leading provider and pioneer of RAIN RFID solutions, today announced Jeff Dossett will lead sales, marketing and business development as executive vice president. Dossett joined Impinj in May of 2017 to lead the marketing and business-development teams; this promotion expands his role to include sales.\n“Impinj is helping retail, healthcare and supply-chain companies worldwide increase efficiencies, drive sales and enhance customer engagement,” said Chris Diorio, Impinj’s CEO. “Jeff’s leadership experience at high-growth, global companies will bring new synergies to our sales, marketing and business-development teams and aligns well with our dynamic market.”\nDossett spent 25 years at leading global companies including Microsoft, Yahoo!, Demand Media (now Leaf Group), Porch and GOOD Worldwide. At Microsoft, Dossett held a variety of executive roles over a period of 18 years. He then became chief revenue officer for Leaf Group, head of partnerships and interim chief financial officer for Porch, and chief executive officer of GOOD Worldwide.\n“I’m excited to lead our integrated go-to-market sales, marketing, business-development and services organizations and to work with the skilled and experienced leaders at Impinj,” said Dossett. “Together we will deepen our focus on our customers and our commitment to our partners.”\nDossett is a committed volunteer and passionate advocate who encourages and fosters women in leadership roles and provides student mentorship through the Buerk Center of Entrepreneurship at the University of Washington Foster School of Business. He is on the North America Advisory Board of the CMO Council and a trustee of Seattle Girls' School and several other board and advisor roles. His accomplishments include summiting the tallest peak on every continent, including two summits of Mt. Everest; he has used his climbs to raise awareness and funds for the fight against HIV / AIDS.\nAbout Impinj\nImpinj (NASDAQ:PI) wirelessly connects billions of everyday items such as apparel, medical supplies, and automobile parts to consumer and business applications such as inventory management, patient safety, and asset tracking. The Impinj platform uses RAIN RFID to deliver timely information about these items to the digital world, thereby enabling the Internet of Things. www.impinj.com\nImpinj is a registered trademark of Impinj, Inc. All other trademarks are the property of their owners.\nContact: Gaylene Meyer\nSr. Director Communications\nPhone: +1 206-812-9816\ngmeyer@impinj.com\nwww.impinj.com\nSource:Impinj, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/4f56342b-7f7a-4699-83ff-483fa06ae2d6"], "published": "2018-01-16T19:00:00.000+02:00", "crawled": "2018-01-16T18:25:41.012+02:00", "highlightTitle": ""}