{"organizations": [], "uuid": "04c83c8d9589c3170a66c381cab28d029ff0c429", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-first-trust-new-opportunities-mlp-energy-fund-declares-its-monthly-common-share-distribution-of-0-point-105-per-share-for.html", "country": "US", "domain_rank": 767, "title": "First Trust New Opportunities MLP & Energy Fund Declares its Monthly Common Share Distribution of $0.105 Per Share for February", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:49:00.000+02:00", "replies_count": 0, "uuid": "04c83c8d9589c3170a66c381cab28d029ff0c429"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-first-trust-new-opportunities-mlp-energy-fund-declares-its-monthly-common-share-distribution-of-0-point-105-per-share-for.html", "ord_in_thread": 0, "title": "First Trust New Opportunities MLP & Energy Fund Declares its Monthly Common Share Distribution of $0.105 Per Share for February", "locations": [], "entities": {"persons": [], "locations": [{"name": "wheaton", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "first trust new opportunities mlp & energy fund", "sentiment": "neutral"}, {"name": "fpl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHEATON, Ill.--(BUSINESS WIRE)-- First Trust New Opportunities MLP & Energy Fund (the \"Fund\") (NYSE: FPL) has declared the Fund’s regularly scheduled monthly common share distribution in the amount of $0.105 per share payable on February 15, 2018, to shareholders of record as of February 2, 2018. The ex-dividend date is expected to be February 1, 2018. The monthly distribution information for the Fund appears below.\nFirst Trust New Opportunities MLP & Energy Fund (FPL):\nDistribution per share: $0.105 Distribution Rate based on the January 19, 2018 NAV of $12.18: 10.34% Distribution Rate based on the January 19, 2018 closing market price of $12.64: 9.97% It is anticipated that, due to the tax treatment of cash distributions made by master limited partnerships (\"MLPs\") in which the Fund invests, a portion of the distributions the Fund makes to Common Shareholders may consist of a tax-deferred return of capital. The final determination of the source and tax status of all 2018 distributions will be made after the end of 2018 and will be provided on Form 1099-DIV.\nThe Fund is a non-diversified, closed-end management investment company that seeks a high level of total return with an emphasis on current distributions paid to common shareholders. The Fund will seek to provide its common shareholders with a vehicle to invest in a portfolio of cash-generating securities, with a focus on investing in publicly traded MLPs and MLP-related entities in the energy sector and energy utilities industries that are weighted towards non-cyclical, fee-for-service revenues. Under normal market conditions, the Fund will invest at least 85% of its Managed Assets in equity and debt securities of MLPs, MLP-related entities and other energy sector and energy utilities companies that the Fund's Sub-Advisor believes offer opportunities for growth and income. Under normal circumstances, the Fund will invest at least 65% of its managed assets in equity securities issued by energy sector MLPs and energy sector and energy utilities MLP-related entities. To generate additional income, the Fund currently expects to write (or sell) covered call options on up to 35% of its managed assets. The Fund is treated as a regular corporation, or a \"C\" corporation, for United States federal income tax purposes and, as a result, is subject to corporate income tax to the extent the Fund recognizes taxable income.\nFirst Trust Advisors L.P., the Fund's investment advisor, along with its affiliate, First Trust Portfolios L.P., are privately-held companies which provide a variety of investment services, including asset management and financial advisory services, with collective assets under management or supervision of approximately $118 billion as of December 31, 2017 through unit investment trusts, exchange-traded funds, closed-end funds, mutual funds and separate managed accounts.\nEnergy Income Partners, LLC (\"EIP\") serves as the Fund's investment sub-advisor and provides advisory services to a number of investment companies and partnerships for the purpose of investing in MLPs and other energy infrastructure securities. EIP is one of the early investment advisors specializing in this area. As of December 31, 2017, EIP managed or supervised approximately $6.4 billion in client assets.\nPast performance is no assurance of future results. Investment return and market value of an investment in the Fund will fluctuate. Shares, when sold, may be worth more or less than their original cost.\nPrincipal Risk Factors: The Fund is subject to risks, including the fact that it is a non-diversified closed-end management investment company.\nBecause the Fund is concentrated in securities issued by MLPs, MLP-related entities, and other energy and utilities companies, it will be more susceptible to adverse economic or regulatory occurrences affecting those industries, including high interest costs, high leverage costs, the effects of economic slowdown, surplus capacity, increased competition, uncertainties concerning the availability of fuel at reasonable prices, the effects of energy conservation policies and other factors.\nThe Fund's use of derivatives may result in losses greater than if they had not been used, may require the Fund to sell or purchase portfolio securities at inopportune times, may limit the amount of appreciation the Fund can realize on an investment, or may cause the Fund to hold a security that it might otherwise sell.\nThe Fund invests in securities of non-U.S. issuers which are subject to higher volatility than securities of U.S. issuers. Because the Fund invests in non-U.S. securities, you may lose money if the local currency of a non-U.S. market depreciates against the U.S. dollar.\nUse of leverage can result in additional risk and cost, and can magnify the effect of any losses.\nThe risks of investing in the Fund are spelled out in the shareholder reports and other regulatory filings.\nThe information presented is not intended to constitute an investment recommendation for, or advice to, any specific person. By providing this information, First Trust is not undertaking to give advice in any fiduciary capacity ERISA and the Internal Revenue Code. First Trust has no knowledge of and has not been provided any information regarding any investor. Financial advisors must determine whether particular investments are appropriate for their clients. First Trust believes the financial advisor is a fiduciary, is capable of evaluating investment risks independently and is responsible for exercising independent judgment with respect to its retirement plan clients.\nThe Fund’s daily closing New York Stock Exchange price and net asset value per share as well as other information can be found at www.ftportfolios.com or by calling 1-800-988-5891.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006590/en/\nFirst Trust New Opportunities MLP & Energy Fund\nPress Inquiries: Jane Doyle, 630-765-8775\nAnalyst Inquiries: Jeff Margolin, 630-915-6784\nBroker Inquiries: Jeff Margolin, 630-915-6784\nSource: First Trust New Opportunities MLP & Energy Fund", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ftportfolios.com&esheet=51747163&newsitemid=20180122006590&lan=en-US&anchor=www.ftportfolios.com&index=1&md5=1702afebae97260603ec27ca5c046b71", "http://www.businesswire.com/news/home/20180122006590/en/"], "published": "2018-01-23T00:49:00.000+02:00", "crawled": "2018-01-23T02:16:30.032+02:00", "highlightTitle": ""}