{"organizations": [], "uuid": "47adeb7388df826df093d8072b811dae085c351e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-111035041.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/general-electric-earnings-q4/", "country": "US", "domain_rank": 1196, "title": "GE Earnings: Q4 Meltdown Might Be the Best Thing to Happen to It | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.952, "site_type": "news", "published": "2018-01-24T11:37:00.000+02:00", "replies_count": 0, "uuid": "47adeb7388df826df093d8072b811dae085c351e"}, "author": "Geoff Colvin", "url": "http://fortune.com/2018/01/24/general-electric-earnings-q4/", "ord_in_thread": 0, "title": "GE Earnings: Q4 Meltdown Might Be the Best Thing to Happen to It | Fortune", "locations": [], "entities": {"persons": [{"name": "geoff colvin", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "ge", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Geoff Colvin 9:37 AM EST \nThe Great General Electric Debacle of 2017 continued into 2018 as the company on Wednesday reported fourth-quarter earnings that fell short of analysts’ expectations. The dismal details: earnings per share of $0.27 net of special charges vs. a Wall Street estimate of $0.29; revenue of $31.4 billion vs. an estimate of $34 billion. This from a company once famed for never, ever missing Wall Street earnings estimates. GE was the worst performing stock in the Dow last year, and it has continued to fall in 2018. \nYet GE’s meltdown may be the best thing that could have happened to the company. That’s because it has forced management to propose a long-unutterable possibility: that GE could be broken up. In truth it should have been broken up long ago . Now things are so bad that it’s hard to see a significant improvement of this sorry mess otherwise. \nThe trouble with GE is simple and systemic. It’s a typical crummy conglomerate. Its transformation into a conglomerate began after World War II, when it expanded into businesses unrelated to electricity or each other—missiles, computers, satellites, coal mining, and many others. Conglomerates were all the rage in the 1960s, but as they reliably underperformed the market, most of them, such as ITT, Litton, and LTV, got taken apart. Not GE. The 1970s were a dismal decade for stocks, yet GE did even worse than the market, amplifying cries to bust up this company. \nThen something happened. In 1981 Jack Welch became CEO, and during his 20-year tenure the company outperformed the market so spectacularly that talk of a breakup faded away. Yes, he ran the place during a historically great bull market. But GE performed much, much better than the market. Then, after he stepped down, GE reverted to its usual market-trailing performance. It again revealed its true character as a crummy conglomerate. \nHow crummy? If you had invested $100 in the S&P 500 in 1945, you’d have $245,738 today. But if you’d invested $100 in GE, you’d have only $144,478 including dividends, even with the rocket boost to the stock contributed by Welch. And without that boost? If GE had merely matched the S&P 500 during his tenure, which would still have beaten GE’s average performance under the post-war CEOs before and after him, then you’d have only $43,098. \nIt’s true that not all conglomerates perform terribly. The strongest counterexample is Berkshire Hathaway , which Warren Buffett happily calls “a sprawling conglomerate.” But this proves little. The lesson seems to be that a conglomerate with a genius CEO like Buffett or Welch can perform terrifically. Unfortunately, a strategy that requires a genius CEO is not a sustainable strategy. \nSome analysts argue that GE’s businesses are so entangled financially that separating them would cost more than it’s worth. That analysis fails to value the entrepreneurial energy that can get unleashed in a breakup. Separating GE into three companies—jet engines, power systems, health care—would be a gamble for sure. But with the stock in a hole and management offering no clear plan for recovery, it’s finally time to face reality. GE has no reason for existing in its present form. Its component businesses should be set free. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-24T11:37:00.000+02:00", "crawled": "2018-01-24T22:11:53.060+02:00", "highlightTitle": ""}