{"organizations": [], "uuid": "b2a132100cc49fdeb1f81ba1da8c746c480589d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226094106&w=1200&r=LYNXMPEE0R0TU", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-cdf-mci-tackles/referees-must-protect-the-players-says-citys-guardiola-idUKKBN1FH0WC", "country": "US", "domain_rank": 408, "title": "Referees must protect the players, says City's Guardiola", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T21:53:00.000+02:00", "replies_count": 0, "uuid": "b2a132100cc49fdeb1f81ba1da8c746c480589d5"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-cdf-mci-tackles/referees-must-protect-the-players-says-citys-guardiola-idUKKBN1FH0WC", "ord_in_thread": 0, "title": "Referees must protect the players, says City's Guardiola", "locations": [], "entities": {"persons": [{"name": "bennett", "sentiment": "none"}, {"name": "brahim diaz", "sentiment": "none"}, {"name": "leroy sane", "sentiment": "none"}, {"name": "lee mason", "sentiment": "none"}, {"name": "pep guardiola", "sentiment": "none"}, {"name": "guardiola", "sentiment": "none"}, {"name": "neil robinson", "sentiment": "none"}, {"name": "joe bennett", "sentiment": "none"}], "locations": [{"name": "manchester city", "sentiment": "none"}, {"name": "cardiff city", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "city", "sentiment": "negative"}, {"name": "cardiff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 7:57 PM / Updated 10 minutes ago Referees must protect the players, says City's Guardiola Neil Robinson 3 Min Read \n(Reuters) - Manchester City manager Pep Guardiola demanded that referees give players more protection after winger Leroy Sane was injured in a bruising FA Cup tie at second-tier Cardiff City on Sunday. \nThe Germany international faces a few weeks on the sidelines after limping off at halftime following a foul by Joe Bennett in City’s 2-0 fourth round win. \nCardiff midfielder Bennett was only booked, though television replays showed that the challenge might have been worthy of a red card. Bennett was then sent off in added time after another crunching foul on teenager Brahim Diaz. \nGuardiola was clearly angered by Cardiff’s physical approach and animatedly spoke to referee Lee Mason after the game. \nSpeaking about Sane in his post-match news conference, Guardiola said: “He will be out for a while, minimum two to three weeks or a month. We will see tomorrow exactly.” \nGuardiola wants referees to do more to protect the players, who he labelled as artists, from being repeatedly fouled. \n“I have said many times, all the referees have to do is protect the players - not just the Manchester City players, all players,” added the Spaniard. \n”It’s not because one player is more brave to kick. The only thing the referees can do is to protect the players. It kept happening. \n“So for the football in general and the players - because they are the artists - we need to care of them. I’ve said it many times but they need to protect them.” \nBENNETT ‘UNPROFESSIONAL’ \nCardiff manager Neil Warnock did not defend Bennett, who will now suspended for Saturday’s Championship game against City’s promotion rivals Leeds United. \n“It is unprofessional from Joe and then to commit one in the 92nd minute,” said Warnock. “Maybe he does not want to go to Leeds on Saturday. He will be training morning, noon and night, I can tell you that.” \nHowever, Warnock did defend Cardiff’s approach to the game and added that Guardiola should know what to expect, saying: “He’s in England. They (City) did a few as well.” \nThe other talking point was City midfielder Bernardo Silva’s disallowed goal, which was given but then ruled out when the referee noticed the linesman flagging for an offside by Sane. \nHad the new Video Assistant Referee (VAR) system been used, it would have shown that the German was marginally the right side of the defender and therefore onside. \nBut the technology, which received a mixed reception after being used several times in Liverpool’s 3-2 defeat by West Bromwich Albion at Anfield on Saturday, is only being deployed for some FA Cup ties and was not in operation on Sunday. \nGuardiola was baffled by the referee’s decision to disallow the goal, saying: “I have never seen that before in my life, but I can accept that”. Reporting by Neil Robinson", "external_links": [], "published": "2018-01-28T21:53:00.000+02:00", "crawled": "2018-01-28T22:10:51.047+02:00", "highlightTitle": ""}