{"organizations": [], "uuid": "32953aa99e24c7fc964a232915af82f954cd7e63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-cambridge-bancorp-announces-earnings-for-2017-declares-increased-dividend-and-reports-the-impact-of-the-tax-cuts-and-jobs.html", "country": "US", "domain_rank": 767, "title": "Cambridge Bancorp Announces Earnings for 2017, Declares Increased Dividend, and Reports the Impact of the Tax Cuts and Jobs Act of 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.597, "site_type": "news", "published": "2018-01-25T16:00:00.000+02:00", "replies_count": 0, "uuid": "32953aa99e24c7fc964a232915af82f954cd7e63"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-cambridge-bancorp-announces-earnings-for-2017-declares-increased-dividend-and-reports-the-impact-of-the-tax-cuts-and-jobs.html", "ord_in_thread": 0, "title": "Cambridge Bancorp Announces Earnings for 2017, Declares Increased Dividend, and Reports the Impact of the Tax Cuts and Jobs Act of 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "gaap", "sentiment": "negative"}, {"name": "cambridge bancorp", "sentiment": "negative"}, {"name": "catc", "sentiment": "none"}, {"name": "cambridge trust company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "One-time non-cash tax charge in Q4 2017 of $3.9 million Full year 2017 GAAP net income of $14.8 million, Q4 2017 GAAP net income of $964,000 Excluding tax charge, full year 2017 net income of $18.7 million, or 10.6% increase over 2016 Excluding tax charge, Q4 2017 net income of $4.8 million, or 9.3% increase over 2016\nCAMBRIDGE, Mass.--(BUSINESS WIRE)-- Cambridge Bancorp (NASDAQ: CATC) (the “Company”), the parent of Cambridge Trust Company, today announced unaudited net income of $14,816,000 for the year ended December 31, 2017, a decrease of $2,080,000, or 12.3%, compared to net income of $16,896,000 for the year ended December 31, 2016. Diluted earnings per share were $3.61 for 2017, representing a 13.0% decrease over diluted earnings per share of $4.15 for 2016.\nFor the three months ended December 31, 2017, unaudited net income was $964,000, representing a decrease of $3,459,000, or 78.2%, compared to net income of $4,423,000 for the three months ended December 31, 2016. Diluted earnings per share were $0.23 for the fourth quarter of 2017, representing a 78.7% decrease over diluted earnings per share of $1.08 for the fourth quarter of 2016.\nImpact of Tax Cuts and Jobs Act of 2017\nAs reported by many financial institutions, earnings in 2017 were impacted by the Tax Cuts and Jobs Act of 2017. Effective in 2018, the change in tax law reduced the Company’s federal tax rate from 35% to 21%. The change in tax law requires a one-time non-cash write-down of our net deferred tax assets of $3,869,000 as these deferred tax assets were required to be re-measured using the new lower tax rate in 2017. Removing the impact of the charge for the change in tax law, unaudited net income would have been $18,685,000, an increase of $1,789,000, or 10.6%, as compared to $16,896,000 for the year ended December 31, 2016. Removing the impact of the charge for the change in tax law, diluted earnings per share would have been $4.55 for 2017, representing a 9.6% increase over diluted earnings per share of $4.15 for 2016.\nEarnings for the three months ended December 31, 2017 were also impacted by the Tax Cuts and Jobs Act of 2017. As discussed above, the change in tax law requires a one-time non-cash write-down of our net deferred tax assets of $3,869,000 as these deferred tax assets were required to be re-measured using the new lower tax rate in 2017. Removing the impact of the charge for the change in tax law, unaudited net income would have been $4,833,000, an increase of $410,000, or 9.3%, as compared to $4,423,000 for the three months ended December 31, 2016. Removing the impact of the charge for the change in tax law, diluted earnings per share would have been $1.17 for the fourth quarter of 2017, representing an 8.3% increase over diluted earnings per share of $1.08 for 2016.\nYear to date 2017 highlights as compared to year to date 2016 :\nWealth Management Assets under Management and Administration now at $3.1 billion, an increase of 14.7% Revenue of $87.8 million, an increase of 6.7% Loan growth of $30.7 million, or 2.3% Core deposit growth of $100.7 million, or 6.6%\n“We ended 2017 with continued strong earnings during the fourth quarter, excluding the impact of the change in corporate tax rates,” noted Denis K. Sheahan, CEO. “Our strategic focus of delivering private banking services to clients continues to position us favorably in the Greater Boston market, and we have begun investing in greater business development efforts for future growth. Additionally, we are pleased to report that the Company ended the year with Wealth Management Assets under Management and Administration of $3.1 billion.”\nBalance Sheet\nTotal assets increased $100.9 million, or 5.5%, from December 31, 2016 and stood at $1.9 billion as of December 31, 2017.\nTotal loans increased $30.7 million, or 2.3%, from December 31, 2016 and stood at $1.4 billion as of December 31, 2017. The growth in total loans was primarily due to the increase in commercial real estate loans of $17.5 million, from $616.1 million at December 31, 2016 to $633.6 million at December 31, 2017 and the increase in commercial and industrial loans of $5.6 million, from $59.7 million at December 31, 2016 to $65.3 million at December 31, 2017. Loan growth in 2017 was significantly hampered by payoffs as a result of the vibrant real estate market in the Greater Boston area.\nThe Company’s total investment securities portfolio increased by $29.1 million, or 7.1%, from $408.1 million at December 31, 2016 to $437.2 million at December 31, 2017.\nCore deposits, which we define as all deposits other than certificates of deposit, increased by $100.7 million, or 6.6%, from December 31, 2016. The cost of total deposits for the year ended December 31, 2017 was 0.19%, as compared to 0.20% for the year ended December 31, 2016. Total deposits at December 31, 2017 were $1.8 billion, as compared to $1.7 billion at December 31, 2016.\nNet Interest and Dividend Income\nFor the quarter ended December 31, 2017, net interest and dividend income after provision for loan losses increased by $666,000, or 4.7%, to $14.8 million, as compared to $14.1 million for the quarter ended December 31, 2016. Interest on loans increased $698,000, or 5.5%, which was driven by the impact of loan growth and higher yields. The Company’s net interest margin, on a fully tax equivalent basis, increased two basis points to 3.26% for the three months ended December 31, 2017, as compared to 3.24% for the three months ended December 31, 2016.\nFor the year ended December 31, 2017, net interest and dividend income after provision for loan losses increased by $3.7 million, or 6.9%, to $57.2 million, as compared to $53.5 million for the year ended December 31, 2016. Interest on loans increased by $3.0 million, or 6.1%, primarily driven by the impact of loan growth. The Company’s net interest margin, on a fully tax equivalent basis, increased four basis points to 3.25% for the year ended December 31, 2017, as compared to 3.21% for the year ended December 31, 2016.\nNoninterest Income\nTotal noninterest income increased by $297,000, or 4.1%, to $7.6 million for the quarter ended December 31, 2017, as compared to $7.3 million for the quarter ended December 31, 2016, primarily as a result of higher Wealth Management revenue. Noninterest income was 33.9% of total revenue for the quarter ended December 31, 2017. Wealth Management revenue increased by $589,000, or 11.0%, for the fourth quarter of 2017, as compared to the fourth quarter of 2016 due to a combination of market appreciation and net new business. Wealth Management Assets under Management increased by $398.6 million, or 15.5%, to $3.0 billion as of December 31, 2017, as compared to $2.6 billion as of December 31, 2016.\nNoninterest income increases were partially offset by lower gains on loans held for sale of $294,000 for the quarter ended December 31, 2017, as compared to the quarter ended December 31, 2016.\nTotal noninterest income increased by $1.6 million, or 5.5%, to $30.2 million for the year ended December 31, 2017, as compared to $28.7 million for the year ended December 31, 2016, primarily as a result of higher Wealth Management revenue. Noninterest income was 34.4% of total revenue for the year ended December 31, 2017. Wealth Management revenue increased by $2.6 million, or 12.9%, for the year ended 2017, as compared to the year ended 2016 due to a combination of market appreciation and net new business.\nNoninterest income increases were partially offset by lower gains on loans held for sale of $561,000 and lower loan related derivative income of $543,000 for the year ended December 31, 2017, as compared to the year ended December 31, 2016.\nNoninterest Expense\nTotal noninterest expense increased by $417,000, or 2.9%, to $15.0 million for the quarter ended December 31, 2017, as compared to $14.6 million for the quarter ended December 31, 2016, primarily driven by higher salaries and benefits expense, marketing expense, and professional services. The increase in salaries and benefits of $398,000 was the result of the combination of increased staffing to support business initiatives and higher employee benefit costs. The Company announced a hard freeze of its defined benefit pension plan as of December 31, 2017. The increase of $204,000 in marketing expense is largely due to the timing of a strategic advertising campaign during the fourth quarter of 2017. The increase of $187,000 in professional services is primarily due to recruiting fees.\nNoninterest expense increases were partially offset by decreases in data processing costs of $154,000 and lower occupancy and equipment expense of $124,000 for the quarter ended December 31, 2017, as compared to December 31, 2016.\nTotal noninterest expense increased by $2.5 million, or 4.5%, to $59.3 million for the year ended December 31, 2017, as compared to $56.8 million for the year ended December 31, 2016, primarily driven by higher salaries and benefits expense and professional services. The increase in salaries and benefits expense of $2.2 million is primarily due to annual merit increases, increased staffing to support business initiatives, and higher employee benefit costs. The increase in professional services of $980,000 is a result of increased recruitment fees, legal costs, audits and exams, compensation consulting, marketing consulting, training and development, and costs associated with the registration of our securities with the U.S. Securities and Exchange Commission.\nNoninterest expense increases were partially offset by decreases in occupancy and equipment expense of $217,000 and lower FDIC insurance expense of $205,000 for the year ended December 31, 2017, as compared to the year ended December 31, 2016.\nAsset Quality\nLoan quality remained sound with non-performing loans totaling $1.3 million, or 0.10% of total loans outstanding as of December 31, 2017. The allowance for loan losses was $15.3 million, or 1.13% of total loans outstanding at December 31, 2017, as compared to $15.3 million, or 1.16% of total loans outstanding at year end 2016.\nIncome Taxes\nIn accordance with the Tax Cuts and Jobs Act of 2017, the Company re-measured its net deferred tax assets which resulted in a one-time non-cash write-down of its net deferred tax assets and recognized an additional income tax expense of $3.9 million for the year ended December 31, 2017. The effective tax rate was 86.9% for the quarter ended December 31, 2017, as compared to 34.9% for the quarter ended December 31, 2016. For the year ended December 31, 2017, the effective tax rate was 47.4%, as compared to 33.6% for the year ended December 31, 2016. Removing the impact of the charge for the change in tax law, the effective tax rate would have been 34.1% for the quarter ended December 31, 2017 and 33.7% for the year ended December 31, 2017. Additionally, the Company recognized $221,000 of tax benefit resulting from the adoption of new accounting guidance for share-based payments during 2017.\nDividend\nOn January 22, 2018, the Company’s Board of Directors declared a quarterly cash dividend of $0.48 per share, which is payable on February 22, 2018 to shareholders of record as of the close of business on February 8, 2018. This represents an increase of $0.02 per share, as compared to $0.46 per share declared during the first quarter of 2017.\nAbout Cambridge Bancorp\nCambridge Bancorp, the parent company of Cambridge Trust Company, is based in Cambridge, Massachusetts. Cambridge Trust Company is a 127-year-old Massachusetts chartered commercial bank with $1.9 billion in assets and 11 Massachusetts locations in Cambridge, Boston, Belmont, Concord, Lexington, and Weston. Cambridge Trust Company is one of New England’s leaders in wealth management with $3.1 billion in client assets under management and administration. The Wealth Management group maintains offices in Boston, Massachusetts and Concord, Manchester and Portsmouth, New Hampshire.\nThe accompanying unaudited condensed interim and annual consolidated financial information should be read in conjunction with the audited consolidated financial statements and notes thereto included in the Company’s Registration Statement on Form 10, which is posted in the investor relations section of our website at www.cambridgetrust.com .\nForward-looking Statements\nCertain statements herein may constitute “ ” within the meaning of the Private Securities Litigation Reform Act of 1995 (“PSLRA”). These statements are intended to take advantage of the “safe harbor” provisions of the PSLRA. These statements are based on the beliefs and assumptions of management of the Company and its subsidiaries and on the information available to management at the time that these statements were made. Since these statements reflect the views of management concerning future events, these statements involve risks, uncertainties, and assumptions. As a result, actual results may differ from those contemplated by these statements. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. Such statements may be identified by the use of words such as “believe,” “expect,” “anticipate,” “forecast,” “estimate,” “intend,” “will,” “would,” “should,” “could,” “may,” or similar words. There are a number of factors, many of which are beyond the Company’s control that could cause actual conditions, events or results to differ materially from those in the . Factors that may from those contemplated by such include, among others, changes in the interest rate environment, unfavorable or less than favorable changes in general economic conditions (nationally or regionally), our ability to continue to increase loans and deposit growth, increased competitive pressures among depository and other financial institutions, legislative and regulatory changes that adversely affect the businesses in which the Company is engaged, changes in the securities market, and other factors that are described in the Company’s filings with the Securities and Exchange Commission. Readers should not place undue reliance on these , which speak only as of the date they are made. The Company disclaims any intent or obligation to update any , whether in response to new information, future events, or otherwise, except as may be required by law.\nCAMBRIDGE BANCORP AND SUBSIDIARIES\nUNAUDITED QUARTERLY RESULTS\nDecember 31, 2017\nThree Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 (dollar amounts in thousands, except per share data) Interest and Dividend Income $ 15,744 $ 14,663 $ 61,191 $ 57,028 Interest Expense 970 763 3,587 3,355 Net Interest and Dividend Income 14,774 13,900 57,604 53,673 Provision for (Release of) Loan Losses 2 (206 ) 362 132 Noninterest Income 7,575 7,278 30,224 28,661 Noninterest Expense 15,012 14,595 59,292 56,750 Income Before Taxes 7,335 6,789 28,174 25,452 Income Taxes 6,371 2,366 13,358 8,556 Net Income $ 964 $ 4,423 $ 14,816 $ 16,896 Data Per Common Share:\nBasic Earnings Per Share $ 0.24 $ 1.10 $ 3.64 $ 4.19 Diluted Earnings Per Share $ 0.23 $ 1.08 $ 3.61 $ 4.15 Dividends Declared Per Share $ 0.47 $ 0.46 $ 1.86 $ 1.84 Avg. Common Shares Outstanding: Basic 4,038,948 3,995,495 4,030,530 3,990,343 Diluted 4,073,707 4,034,687 4,065,754 4,028,944 Selected Operating Ratios:\nNet Interest Margin, FTE 3.26 % 3.24 % 3.25 % 3.21 % Cost of Funds 0.21 % 0.17 % 0.20 % 0.20 % Cost of Interest Bearing Liabilities 0.31 % 0.25 % 0.29 % 0.29 % Cost of Deposits 0.22 % 0.18 % 0.19 % 0.20 % Return on Average Assets 0.20 % 0.97 % 0.79 % 0.95 % Return on Average Equity 2.61 % 12.94 % 10.47 % 12.77 % Efficiency Ratio 67.17 % 68.92 % 67.51 % 68.93 % December 31, December 31, 2017 2016 Total Assets $ 1,949,934 $ 1,848,999 Total Loans 1,350,899 1,320,154 Non-Performing Loans 1,298 1,676 Allowance for Loan Losses 15,320 15,261 Allowance to Total Loans 1.13 % 1.16 % Total Deposits 1,775,400 1,686,038 Total Shareholders’ Equity 147,957 134,671 Wealth Management AUM $ 2,971,322 $ 2,572,760 Wealth Management AUM & AUA $ 3,085,669 $ 2,689,103 Book Value Per Share $ 36.24 $ 33.36 CAMBRIDGE BANCORP AND SUBSIDIARIES\nUNAUDITED CONSOLIDATED BALANCE SHEETS\nDecember 31, 2017 December 31, 2016 (dollars in thousands, except par value) Assets Cash and cash equivalents $ 103,591 $ 54,050 Investment securities Available for sale, at fair value (amortized cost $208,911 and $329,726, respectively) 205,017 325,641 Held to maturity, at amortized cost (fair value $233,554 and $83,755, respectively) 232,188 82,502 Total investment securities 437,205 408,143 Loans held for sale, at lower of cost or fair value - 6,506 Loans Residential mortgage 538,920 534,404 Commercial mortgage 633,649 616,140 Home equity 74,444 75,051 Commercial & Industrial 65,295 59,706 Consumer 38,591 34,853 Total loans 1,350,899 1,320,154 Less: allowance for loan losses (15,320 ) (15,261 ) Net loans 1,335,579 1,304,893 Stock in FHLB of Boston, at cost 4,242 4,098 Bank owned life insurance 31,083 30,499 Banking premises and equipment, net 9,310 10,451 Deferred income taxes, net 8,273 13,693 Accrued interest receivable 5,128 4,627 Other assets 15,523 12,039 Total assets $ 1,949,934 $ 1,848,999 Liabilities Deposits Demand $ 493,613 $ 472,923 Interest bearing checking 462,957 430,706 Money market 69,259 72,057 Savings 589,741 539,190 Certificates of deposit 159,830 171,162 Total deposits 1,775,400 1,686,038 Short-term borrowings — — Long-term borrowings 3,579 3,746 Other liabilities 22,998 24,544 Total liabilities 1,801,977 1,714,328 Shareholders’ Equity Common stock, par value $1.00; Authorized 10,000,000 shares; Outstanding: 4,082,188 shares and 4,036,879 shares, respectively\n4,082 4,037 Additional paid-in capital 35,663 33,253 Retained earnings 114,093 107,262 Accumulated other comprehensive loss (5,881 ) (9,881 ) Total shareholders’ equity 147,957 134,671 Total liabilities and shareholders’ equity $ 1,949,934 $ 1,848,999 CAMBRIDGE BANCORP AND SUBSIDIARIES\nUNAUDITED CONSOLIDATED STATEMENTS OF INCOME\nThree Months Ended\nDecember 31,\nTwelve Months Ended\nDecember 31,\n2017 2016 2017 2016 (dollars in thousands, except share data) Interest and dividend income Interest on taxable loans $ 13,272 $ 12,557 $ 51,238 $ 48,353 Interest on tax-exempt loans 105 122 496 415 Interest on taxable investment securities 1,559 1,251 6,321 5,230 Interest on tax-exempt investment securities 634 666 2,600 2,737 Dividends on FHLB of Boston stock 53 47 245 179 Interest on overnight investments 121 20 291 114 Total interest and dividend income 15,744 14,663 61,191 57,028 Interest expense Interest on deposits 942 734 3,125 3,260 Interest on borrowed funds 28 29 462 95 Total interest expense 970 763 3,587 3,355 Net interest and dividend income 14,774 13,900 57,604 53,673 Provision for loan losses 2 (206 ) 362 132 Net interest and dividend income after provision for loan losses\n14,772 14,106 57,242 53,541 Noninterest income Wealth management revenue 5,952 5,363 23,029 20,389 Deposit account fees 755 788 3,142 2,922 ATM/Debit card income 303 288 1,182 1,140 Bank owned life insurance income 136 138 584 612 (Loss) gain on disposition of investment securities — — (3 ) 438 Gain on loans held for sale 31 325 355 916 Loan related derivative income 133 132 780 1,323 Other income 265 244 1,155 921 Total noninterest income 7,575 7,278 30,224 28,661 Noninterest expense Salaries and employee benefits 9,496 9,098 36,707 34,529 Occupancy and equipment 2,178 2,302 9,114 9,331 Data processing 1,126 1,280 4,956 5,024 Professional services 724 537 3,374 2,394 Marketing 522 318 1,620 1,706 FDIC Insurance 163 206 629 834 Other expenses 803 854 2,892 2,932 Total noninterest expense 15,012 14,595 59,292 56,750 Income before income taxes 7,335 6,789 28,174 25,452 Income tax expense 6,371 2,366 13,358 8,556 Net income $ 964 $ 4,423 $ 14,816 $ 16,896 Share data Weighted average number of shares outstanding, basic 4,038,948 3,995,495 4,030,530 3,990,343 Weighted average number of shares outstanding, diluted 4,073,707 4,034,687 4,065,754 4,028,944 Basic earnings per share $ 0.24 $ 1.10 $ 3.64 $ 4.19 Diluted earnings per share $ 0.23 $ 1.08 $ 3.61 $ 4.15 CAMBRIDGE BANCORP AND SUBSIDIARIES\nMARGIN & YIELD ANALYSIS\nThree Months Ended December 31, 2017 December 31, 2016 Average Balance\nInterest Income/\nExpenses (1)\nRate Earned/\nPaid (1)\nAverage Balance\nInterest Income/\nExpenses (1)\nRate Earned/\nPaid (1)\n(dollars in thousands) ASSETS Interest-earning assets Loans (2) Taxable $ 1,335,652 $ 13,272 3.94 % $ 1,304,703 $ 12,557 3.83 % Tax-exempt 12,502 163 5.17 19,084 188 3.92 Securities available for sale (3) Taxable 212,230 853 1.59 316,235 1,242 1.56 Securities held to maturity Taxable 140,040 706 2.00 777 9 4.61 Tax-exempt 80,057 975 4.83 82,897 1,025 4.92 Cash and due from banks 60,111 121 0.80 31,074 20 0.26 Total interest-earning assets (4) 1,840,592 16,090 3.47 % 1,754,770 15,041 3.41 % Non interest-earning assets 72,940 72,837 Allowance for loan losses (15,511 ) (15,520 ) Total assets $ 1,898,021 $ 1,812,087 LIABILITIES AND SHAREHOLDERS’ EQUITY Interest-bearing deposits Checking accounts $ 389,305 $ 47 0.05 % $ 376,588 $ 16 0.02 % Savings accounts 613,847 506 0.33 544,596 316 0.23 Money market accounts 62,503 24 0.15 81,865 31 0.15 Certificates of deposit 161,286 365 0.90 177,822 371 0.83 Total interest-bearing deposits 1,226,941 942 0.30 1,180,871 734 0.25 Other borrowed funds 6,708 28 1.66 11,421 29 1.01 Total interest-bearing liabilities 1,233,649 970 0.31 % 1,192,292 763 0.25 % Non-interest-bearing liabilities Demand deposits 490,618 460,117 Other liabilities 27,328 23,663 Total liabilities 1,751,595 1,676,072 Shareholders’ equity 146,426 136,015 Total liabilities & shareholders’ equity $ 1,898,021 $ 1,812,087 Net interest income on a fully taxable equivalent basis 15,120 14,278 Less taxable equivalent adjustment (399 ) (425 ) Net interest income $ 14,721 $ 13,853 Net interest spread (5) 3.16 % 3.16 % Net interest margin (6) 3.26 % 3.24 % (1) Annualized on a fully taxable equivalent basis calculated using a federal tax rate of 35%.\n(2) Nonaccrual loans are included in average amounts outstanding.\n(3) Average balances of securities available for sale calculated utilizing amortized cost.\n(4) Federal Home Loan Bank stock balance and dividend income is excluded from interest-earning assets.\n(5) Interest rate spread represents the difference between the weighted average yield on interest-earning assets and the weighted average cost of interest-bearing liabilities.\n(6) Net interest margin represents net interest income on a fully tax equivalent basis as a percentage of average interest-earning assets.\nCAMBRIDGE BANCORP AND SUBSIDIARIES\nMARGIN & YIELD ANALYSIS\nFor the Year Ended December 31, 2017 December 31, 2016 Average Balance\nInterest Income/\nExpenses (1)\nRate Earned/\nPaid (1)\nAverage Balance\nInterest Income/\nExpenses (1)\nRate Earned/\nPaid (1)\n(dollars in thousands) ASSETS Interest-earning assets Loans (2) Taxable $ 1,318,284 $ 51,238 3.89 % $ 1,249,205 $ 48,353 3.87 % Tax-exempt 15,057 764 5.07 15,973 638 3.99 Securities available for sale (3) Taxable 248,787 4,011 1.61 334,292 5,184 1.55 Securities held to maturity Taxable 111,452 2,310 2.07 979 46 4.70 Tax-exempt 81,528 4,000 4.91 82,797 4,211 5.09 Cash and due from banks 41,888 291 0.69 35,895 114 0.32 Total interest-earning assets (4)\n1,816,996 62,614 3.45 % 1,719,141 58,546 3.41 % Non interest-earning assets 73,532 73,559 Allowance for loan losses (15,392 ) (15,371 ) Total assets $ 1,875,136 $ 1,777,329 LIABILITIES AND SHAREHOLDERS’ EQUITY\nInterest-bearing deposits Checking accounts $ 394,132 $ 131 0.03 % $ 365,946 $ 82 0.02 % Savings accounts 571,659 1,457 0.25 538,297 1,567 0.29 Money market accounts 68,891 103 0.15 79,409 131 0.16 Certificates of deposit 166,410 1,434 0.86 176,550 1,480 0.84 Total interest-bearing deposits\n1,201,092 3,125 0.26 1,160,202 3,260 0.28 Other borrowed funds 36,074 462 1.28 7,489 95 1.27 Total interest-bearing liabilities\n1,237,166 3,587 0.29 % 1,167,691 3,355 0.29 % Non-interest-bearing liabilities Demand deposits 470,871 454,977 Other liabilities 25,611 22,394 Total liabilities 1,733,648 1,645,062 Shareholders’ equity 141,488 132,267 Total liabilities & shareholders’ equity\n$ 1,875,136 $ 1,777,329 Net interest income on a fully taxable equivalent basis\n59,027 55,191 Less taxable equivalent adjustment (1,668 ) (1,697 ) Net interest income $ 57,359 $ 53,494 Net interest spread (5) 3.16 % 3.12 % Net interest margin (6) 3.25 % 3.21 % (1) Annualized on a fully taxable equivalent basis calculated using a federal tax rate of 35%.\n(2) Nonaccrual loans are included in average amounts outstanding.\n(3) Average balances of securities available for sale calculated utilizing amortized cost.\n(4) Federal Home Loan Bank stock balance and dividend income is excluded from interest-earning assets.\n(5) Interest rate spread represents the difference between the weighted average yield on interest-earning assets and the weighted average cost of interest-bearing liabilities.\n(6) Net interest margin represents net interest income on a fully tax equivalent basis as a percentage of average interest-earning assets.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005122/en/\nCambridge Bancorp\nMichael F. Carotenuto, 617-520-5520\nChief Financial Officer\nSource: Cambridge Bancorp", "external_links": ["http://www.businesswire.com/news/home/20180125005122/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cambridgetrust.com&esheet=51748390&newsitemid=20180125005122&lan=en-US&anchor=www.cambridgetrust.com&index=1&md5=668f8d24d16bbf2d5bcf2ef356c75253"], "published": "2018-01-25T16:00:00.000+02:00", "crawled": "2018-01-25T17:35:35.002+02:00", "highlightTitle": ""}