{"organizations": [], "uuid": "77189941438832b718d3375e1849511ac034fa69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-logicbio-therapeutics-announces-expansion-of-leadership-team-through-multiple-key-hires.html", "country": "US", "domain_rank": 767, "title": "LogicBio Therapeutics Announces Expansion of Leadership Team through Multiple Key Hires", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-02T15:00:00.000+02:00", "replies_count": 0, "uuid": "77189941438832b718d3375e1849511ac034fa69"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-logicbio-therapeutics-announces-expansion-of-leadership-team-through-multiple-key-hires.html", "ord_in_thread": 0, "title": "LogicBio Therapeutics Announces Expansion of Leadership Team through Multiple Key Hires", "locations": [], "entities": {"persons": [{"name": "nelson", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "nelson chau", "sentiment": "none"}, {"name": "frederic chereau", "sentiment": "none"}, {"name": "matthias jaffe", "sentiment": "none"}, {"name": "tom wilton", "sentiment": "none"}, {"name": "matthias", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "logicbio therapeutics announces expansion of leadership team", "sentiment": "negative"}, {"name": "logicbio therapeutics, inc.", "sentiment": "neutral"}, {"name": "biology kelly blackburn", "sentiment": "none"}, {"name": "logicbio therapeutics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass.--(BUSINESS WIRE)-- LogicBio Therapeutics, Inc. , a gene-therapy company with a mission to develop transformative medicines for life-threatening diseases, today announced the expansion of its leadership team with the appointment of four seasoned industry leaders:\nMatthias Jaffe as Chief Financial Officer Tom Wilton as Chief Business Officer Nelson Chau as Vice President, Biology Kelly Blackburn as Clinical and Regulatory Strategist\nTogether, these additions expand LogicBio’s core capabilities in critical areas as the company advances multiple preclinical programs targeting early-onset genetic diseases.\n“When we founded LogicBio, we saw an opportunity to bring the benefits of our unique genome editing technology to patients with life-threatening childhood genetic diseases,” said Frederic Chereau, president and chief executive officer of LogicBio Therapeutics. “Since our Series B financing in June, we have been focused on building out the LogicBio team and are now delighted to welcome Matthias, Tom, Nelson and Kelly as we progress to the next critical phase of the company’s evolution. Together they bring extensive experience and the necessary leadership skills to help accelerate our growth and deliver on the therapeutic promise of our core platform technologies.”\nMatthias Jaffe is an accomplished leader in early life science financial and strategic management. Over the last 15 years, Jaffe has served as CFO for Constellation Pharmaceuticals, Zafgen, Pervasis Therapeutics and Alantos Pharmaceuticals. Previously he worked in venture capital and management consulting at Earlybird Venture Capital and the Boston Consulting Group respectively. He holds an M.Sc. from MIT and an MBA from INSEAD.\nTom Wilton has an extensive background in business development, corporate strategy and commercial operations across the pharma, academic and biotech sectors. Previously, Wilton served as chief business officer for the University of Pennsylvania’s Gene Therapy Program, and played an instrumental role in the establishment of GSK’s Rare Diseases Business Unit. He holds an M.A. in health systems research from the University of Leeds and an M.Sc. in strategic technology management from Brunel University.\nNelson Chau, Ph.D., is a seasoned biotech veteran with deep experience in drug discovery and translational research. Prior to joining LogicBio, he served as vice president of drug discovery at Translate Bio and director of research at Regulus Therapeutics, where he contributed to the discovery and preclinical development of multiple RNA-based therapeutics. Chau earned his Ph.D. from the Johns Hopkins School of Medicine.\nKelly Blackburn has built a career guiding transformative drugs from clinical trial to launch. She began her career at Rhone-Poulenc, Bayer and Genetics Institute, and later went on to drive clinical development programs at aTyr Pharma, Vertex and Millennium Pharmaceuticals. She holds a B.S. in biochemistry from the University of New Hampshire and an M.H.A. from Quinnipiac University.\nAbout LogicBio Therapeutics\nLaunched in 2016, LogicBio is a leading genome-editing company founded by pioneers in gene therapy from Stanford University, with a mission to develop transformative medicines for life-threatening diseases. Its GeneRide™ technology enables highly specific genome editing and integration of the therapeutic transgene, utilizing the body's own native processes to drive durable expression. LogicBio is initially targeting a wide range of diseases not addressable today, including early-onset conditions in young patients. With a world-class global team headquartered in Cambridge, Massachusetts, LogicBio is working to deliver the next wave of innovation in genetic medicine.\nFor more information, please visit www.logicbio.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005147/en/\nTen Bridge Communications\nPaul Goldsmith, 617-697-3479\nPaul@Tenbridgecommunications.com\nSource: LogicBio Therapeutics, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180102005147/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.logicbio.com&esheet=51736250&newsitemid=20180102005147&lan=en-US&anchor=www.logicbio.com&index=2&md5=4b8207c19ca2116dffaad48ae2bab599", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.logicbio.com%2F&esheet=51736250&newsitemid=20180102005147&lan=en-US&anchor=LogicBio+Therapeutics%2C+Inc.&index=1&md5=2452c6385afde0a0cfbcde0dff9bd9b4"], "published": "2018-01-02T15:00:00.000+02:00", "crawled": "2018-01-02T16:56:06.000+02:00", "highlightTitle": ""}