{"organizations": [], "uuid": "5ffc26412adb680fc0e5e267d04ce7d2a67e46fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/grains-blockchain/u-s-soy-cargo-to-china-traded-using-blockchain-idUSL8N1PG0VJ", "country": "US", "domain_rank": 408, "title": "U.S. soy cargo to China traded using blockchain", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T08:00:00.000+02:00", "replies_count": 0, "uuid": "5ffc26412adb680fc0e5e267d04ce7d2a67e46fa"}, "author": "", "url": "https://www.reuters.com/article/grains-blockchain/u-s-soy-cargo-to-china-traded-using-blockchain-idUSL8N1PG0VJ", "ord_in_thread": 0, "title": "U.S. soy cargo to China traded using blockchain", "locations": [], "entities": {"persons": [{"name": "don", "sentiment": "none"}, {"name": "robert serpollet", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ing", "sentiment": "none"}, {"name": "louis dreyfus", "sentiment": "none"}, {"name": "societe generale", "sentiment": "none"}, {"name": "louis dreyfus co", "sentiment": "none"}, {"name": "shandong bohi industry co", "sentiment": "none"}, {"name": "abn amro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 6:00 AM / Updated 28 minutes ago U.S. soy cargo to China traded using blockchain Reuters Staff 3 Min Read \nLONDON, Jan 22 (Reuters) - A cargo of U.S. soybeans shipped to China has become the first fully-fledged agricultural trade conducted using blockchain, participants said on Monday. \nLouis Dreyfus Co, Shandong Bohi Industry Co, ING, Societe Generale and ABN Amro took part in the trade where the sales contract, letter of credit and certificates were digitalised on the Easy Trading Connect (ETC) platform. \n“We noticed very significant efficiency gains ... far beyond what we expected,” Robert Serpollet, global head of trade operations at Louis Dreyfus, said, adding that the time spent on processing documents and data had been reduced five-fold. \nBlockchain, which first emerged as the system underpinning cryptocurrency bitcoin, is a distributed record of transactions that is maintained by a network of computers on the internet. \nBlockchain technology has been used successfully to conduct trade in other markets such as oil. \n“We believe in this particular example the efficiencies were a multiple of the energy side,” said Anthony van Vliet, ING’s global head of trade commodity finance, adding the documentation could be more complex in agriculture than in energy. \nThe transaction involved user participation on the blockchain-based platform by teams from Louis Dreyfus Company as the seller and Bohi as the buyer, with banks issuing and confirming the letter of credit. \nRussell Marine Group and Blue Water Shipping also participated in the process, issuing all required certificates. The U.S. Department of Agriculture (USDA) provided insights on how to include phyto-sanitary certificates in the process. \nBenefits include cost savings and greater speed. \n“This (cost saving) is key as we operate in a business that has high volumes and very low margins,” ING’s van Vliet said. \n“If not months, then in a year or at max two, I think the world in this space will look quite different,” he added, referring to the potential widespread adoption of the technology in agricultural commodity trading. \nFinancial institutions have been investing large sums globally to test whether the technology can be used to simplify transactions in many different markets. (Reporting by Nigel Hunt; Editing by Adrian Croft)", "external_links": [], "published": "2018-01-22T08:00:00.000+02:00", "crawled": "2018-01-22T08:22:03.001+02:00", "highlightTitle": ""}