{"organizations": [], "uuid": "c2d5c1f425fd76bd405ba3242384fbb6bf2f650c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-tire-consumer-welcomes-chan-patel-as-ceo.html", "country": "US", "domain_rank": 767, "title": "Tire Consumer Welcomes Chan Patel as CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T17:14:00.000+02:00", "replies_count": 0, "uuid": "c2d5c1f425fd76bd405ba3242384fbb6bf2f650c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-tire-consumer-welcomes-chan-patel-as-ceo.html", "ord_in_thread": 0, "title": "Tire Consumer Welcomes Chan Patel as CEO", "locations": [], "entities": {"persons": [{"name": "chan patel", "sentiment": "negative"}, {"name": "chan", "sentiment": "none"}, {"name": "tim shaffer", "sentiment": "none"}, {"name": "shaffer", "sentiment": "none"}, {"name": "patel", "sentiment": "none"}], "locations": [{"name": "palo alto", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PALO ALTO, Calif., Jan. 24, 2018 /PRNewswire/ -- Tire Consumer , the world's first tire search engine, today announced the appointment of Chan Patel as CEO. Patel brings over 20 years of experience in the B2B sector. He is passionate and thrives on driving growth, with his entrepreneurial spirit and innovative ideas. He replaces CEO and founder Tim Shaffer, who will continue to work as COO & Founder at Tire Consumer.\n\"Chan has been the driving force behind RepairPal & Branders.com success. Now, he will set Tire Consumers strategy to become the first Tire Search Engine in the automotive sector. I look forward to Chan's leadership at the company,\" Shaffer said.\n\"I am thrilled with the opportunity in front of Tire Consumer and understand its magnitude. Tire Consumer is set to grow rapidly to become a leader in the Tire Search market by continuing to innovate and creating multiple value propositions for both clients and consumers. I look forward to working with the Tire Consumer team to building a world class enterprise marketing company,\" Patel said.\nBefore joining Tire Consumer Chan led sales for RepairPal. With his leadership they built the largest trusted network of auto repair shops in all 50 states. He consistently doubled sales and delivered record sales throughout his tenure. As the sales leader he also secured many partnerships with industry leaders which include, BOSCH, Technet (an Advance Auto Parts company), & Precision Tune Auto Care (a Carl Icahn acquired company).\nPrior to RepairPal Chan was at Branders.com , the nation's largest online B2B seller of promotional items. Chan established a sales team to become a leading B2B sales network in the $19 billion Advertising Specialty market by managing rapid growth and forging online sales for brands such as Microsoft, AARP, Intel, and Google. He created and implemented the revolutionary web-tour sales and support model. Prior to Branders, Chan joined Franklin Templeton Investments. He played an integral role in many key departments and worked with some of the country's best portfolio managers. While on the Equity Trading desk he was responsible for trading over $3 billion of overnight repurchase agreements with JP Morgan, Bank of America and Goldman Sachs.\n\"Accelerating our growth and differentiating our offerings is critical to our success. Chan's deep experience and proven track record will be the catalyst we need to extend our value as the top provider of tire marketing & real-time analytics,\" Shaffer said.\nAbout Tire Consumer\nTireConsumer.com is the world's first \"Tire Price Search Engine\". Giving consumers one resource to compare prices at all local tire shops, and provides retailers an affordable lead generation platform to land new customers and improve their back office operations. We are updating the platform now and should be operational by the end of March. Please stop by. www.TireConsumer.com\nMedia Contact: Hannah Yarbrough (650) 479-5667\nView original content with multimedia: http://www.prnewswire.com/news-releases/tire-consumer-welcomes-chan-patel-as-ceo-300587450.html\nSOURCE Tire Consumer LLC", "external_links": ["http://www.prnewswire.com/news-releases/tire-consumer-welcomes-chan-patel-as-ceo-300587450.html", "http://www.tireconsumer.com/"], "published": "2018-01-24T17:14:00.000+02:00", "crawled": "2018-01-24T19:16:57.014+02:00", "highlightTitle": ""}