{"organizations": [], "uuid": "3cdc7850bfa3c94edc26f729f5b1b67bab251e0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226912804&w=1200&r=LYNXMPEE0U0OX", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-ecb-policy-coeure/ecb-wont-be-too-hasty-in-ending-bond-buys-coeure-idUSKBN1FK1CU", "country": "US", "domain_rank": 408, "title": "UPDATE 1-ECB won't be too hasty in ending bond buys: Coeure", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T13:27:00.000+02:00", "replies_count": 0, "uuid": "3cdc7850bfa3c94edc26f729f5b1b67bab251e0a"}, "author": "", "url": "https://www.reuters.com/article/us-ecb-policy-coeure/ecb-wont-be-too-hasty-in-ending-bond-buys-coeure-idUSKBN1FK1CU", "ord_in_thread": 0, "title": "UPDATE 1-ECB won't be too hasty in ending bond buys: Coeure", "locations": [], "entities": {"persons": [{"name": "benoit coeure", "sentiment": "none"}, {"name": "coeure", "sentiment": "none"}], "locations": [{"name": "dublin", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "min read  dublin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 05 AM / in 33 minutes ECB won't be too hasty in ending bond buys: Coeure Reuters Staff 2 Min Read \nDUBLIN (Reuters) - The European Central Bank will not be too hasty in ending its 2.55 trillion euro ($3.17 trillion) bond purchase program as inflation is still not moving decisively toward its target, executive board member Benoit Coeure said on Wednesday. \nWith the euro zone economy booming and employment at record highs, pressure has been building on the bank to curb stimulus as the 19-member currency bloc is close to exhausting its spare capacity. \n“Of course (quantitative easing) will not last forever but there is also a very wide agreement in the Governing Council ... that we have to be patient and prudent because we are not yet where we want to be in terms of inflation,” Coeure said in question and answer session after a speech in Dublin. \n“We are not going to be too hasty,” he added. \nThe ECB targets inflation at just below 2 percent and its projections suggest it will undershoot this objective at least through 2020, underpinning its caution. \nWhile the bank has signaled that a discussion could soon start about tweaking its policy guidance, Coeure said policymakers were not yet there. \n“We are having a discussion on having a discussion; its meta monetary policy,” he said. “There has been much hype around disagreements in the Governing Council (but) any nuances in the Governing Council are as to when next to communicate.” \nStill Coeure acknowledged that the euro zone expansion is robust, providing support for the ECB’s optimism that inflation will rise back to its target in the medium term. \nWhile some have argued that extended stimulus could eventually push inflation too high, Coeure said that bond market pricing suggests that investors are “deeply skeptical” that inflation can surprise much on the upside in the future. \n($1 = 0.8037 euros) Reporting by Padraic Halpin and Conor Humphries; Writing by Balazs Koranyi; Editing by Robin Pomeroy and Peter Graff", "external_links": [], "published": "2018-01-31T13:27:00.000+02:00", "crawled": "2018-01-31T14:07:44.011+02:00", "highlightTitle": ""}