{"organizations": [], "uuid": "2b808a4c6ae6cde0bd2cf9d658bb1584562a3135", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1224975512&w=1200&r=LYNXMPEE0O00Q", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/us-ecb-policy/surging-euro-forces-ecbs-draghi-to-tread-carefully-on-policy-idUKKBN1FE01Y", "country": "US", "domain_rank": 408, "title": "Surging euro forces ECB's Draghi to tread carefully on policy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T02:09:00.000+02:00", "replies_count": 0, "uuid": "2b808a4c6ae6cde0bd2cf9d658bb1584562a3135"}, "author": "", "url": "https://uk.reuters.com/article/us-ecb-policy/surging-euro-forces-ecbs-draghi-to-tread-carefully-on-policy-idUKKBN1FE01Y", "ord_in_thread": 0, "title": "Surging euro forces ECB's Draghi to tread carefully on policy", "locations": [], "entities": {"persons": [{"name": "draghi", "sentiment": "negative"}, {"name": "mario draghi", "sentiment": "none"}, {"name": "balazs koranyi", "sentiment": "none"}, {"name": "francesco canepa", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "min read  frankfurt", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 12:36 AM / Updated 44 minutes ago ECB hits out at Washington for talking down the dollar Balazs Koranyi , Francesco Canepa 5 Min Read \nFRANKFURT (Reuters) - European Central Bank chief Mario Draghi took a swipe at Washington on Thursday for talking down the dollar, a move he said threatened a decades-old pact not to target the currency and might force his bank to change its own policy. \nSingling out the euro’s surge as a source of uncertainty, Draghi said any unjustified move could force the ECB to rethink its strategy as a strong currency could put a lid on inflation, thwarting its efforts to lift prices. \nHe was speaking after U.S. Treasury Secretary Steven Mnuchin this week said he welcomed a weak dollar because it was good for U.S. trade, and Commerce Secretary Wilbur Ross said “U.S. troops are now coming to the ramparts” in global trade wars. \nThat sentiment sent the euro to three-year highs against the dollar. \nStriking a moderately dovish tone, Draghi also pushed back on rate hike expectations, arguing there was almost no chance of a move this year, even as some investors were betting on a rise as early as December. \nBut it was his comments on currency that resonnated most from a news conference following the ECB’s regular policy meeting. \n“When someone says that basically a good exchange rate is good for exporters and it’s good for the economy and it’s good, that means it’s targeting the exchange rate,” Draghi said when asked about Mnuchin’s comments. \n“That agreement (about not targeting the exchange rate), as subtle as you want, has been in place for decades now,” Draghi added. \nThe ECB is especially sensitive to the euro’s moves as any big rise in the currency could cut into inflation, threatening to reverse the impact of the very stimulus the bank has been providing over the past three years. \nThe euro had risen, Draghi argued, partly because of ”the use of language in discussing exchange rate developments that doesn’t reflect the terms of reference that have been agreed. \n“Several members of the Council expressed concern, and this concern was also in a sense was broader than simply the exchange rate, it was about the overall status of international relations right now,” he said. FILE PHOTO - European Central Bank (ECB) President Mario Draghi waits to address the European Parliament's Economic and Monetary Affairs Committee in Brussels, Belgium September 25, 2017. REUTERS/Francois Lenoir \nBut Draghi’s comments that part of the euro’s gain may be related to the bloc’s strong economy, pushed the currency to $1.2538, its highest level since December 2014. Even a suggestion that rate hike expectations were premature, only pushed it back marginally, leaving it up nearly 1 percent on the day. \n“If all this were to lead to an unwanted tightening of our monetary policy ... then we will have to just think about our monetary policy strategy,” Draghi said, with particular reference to the U.S. statements. \nThe euro now trades 7 percent higher than in December, when the ECB unveiled its latest economic projections, suggesting some downward pressure on import prices. \nHaving bought more than 2 trillion euros worth of bonds over the past three years, the ECB has almost single-handedly depressed borrowing costs in the euro zone to kick start growth and lift prices. FEW CHANCES \nThe purchases, already twice reduced, are set to run until the end of September and investors are betting on their end in the fourth quarter. \nWhile Draghi did not shoot down those expectations, he also argued that inflation has yet to show convincing signs of a sustained rise, a message also aimed at tempering expectations for policy tightening. \n“Based on today’s data and today’s projection I see very few chances at all that interest rates will be raised this year,” he said. Related Coverage", "external_links": [], "published": "2018-01-25T02:09:00.000+02:00", "crawled": "2018-01-25T07:29:07.005+02:00", "highlightTitle": ""}