{"organizations": [], "uuid": "82a6c43496b206971e1abd8ce139ba7dbd19bf5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-alaska-air-group-reports-fourth-quarter-2017-and-full-year-results-and-raises-dividend-7-percent.html", "country": "US", "domain_rank": 767, "title": "Alaska Air Group reports Fourth Quarter 2017 and full-year results and raises dividend 7%", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:00:00.000+02:00", "replies_count": 0, "uuid": "82a6c43496b206971e1abd8ce139ba7dbd19bf5b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-alaska-air-group-reports-fourth-quarter-2017-and-full-year-results-and-raises-dividend-7-percent.html", "ord_in_thread": 0, "title": "Alaska Air Group reports Fourth Quarter 2017 and full-year results and raises dividend 7%", "locations": [], "entities": {"persons": [], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "virgin america", "sentiment": "none"}], "organizations": [{"name": "alaska air group", "sentiment": "negative"}, {"name": "virgin america inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE,\nDividend Increase:\nAnnounced today a 7% increase in the quarterly dividend from $0.30 per share to $0.32 per share. The dividend will be paid on March 8, to all shareholders of record as of Feb. 20, 2018. This is the fifth time the company has raised the dividend since initiating the quarterly dividend in July 2013, with a cumulative increase of 220% since that time.\nFinancial Highlights:\nReported net income for the fourth quarter and full-year under Generally Accepted Accounting Principles (\"GAAP\") of $367 million, or $2.97 per diluted share, and $1.0 billion, or $8.30 per diluted share. These results compare to fourth quarter 2016 net income of $114 million, or $0.92 per diluted share, and full-year 2016 net income of $814 million, or $6.54 per diluted share. As the acquisition of Virgin America Inc. (Virgin America) closed on Dec. 14, 2016, 2017 information reflects the results of Virgin America. 2016 information reflects the results of Virgin America from Dec. 14-31, 2016. Reported fourth quarter 2017 adjusted diluted earnings per share of $0.83 compared to $1.56 reported in the fourth quarter of 2016. Fourth quarter adjusted net income, excluding merger-related costs, special income tax benefits related to tax law changes, and mark-to-market fuel hedging adjustments, was $103 million compared to $193 million in the fourth quarter of 2016. This quarter's adjusted results compare to the First Call analyst consensus estimate of $0.82 per share. Reported full year 2017 adjusted net income, excluding merger-related costs, the special income tax benefit, and mark-to-market fuel hedging adjustments, of $823 million, compared to $911 million in 2016. Reported 2017 adjusted diluted earnings per share of $6.64, compared to $7.32 in 2016. Paid a $0.30 per-share quarterly cash dividend in the fourth quarter, bringing total dividend payments in 2017 to $148 million. Repurchased a total of 981,277 shares of common stock for approximately $75 million in 2017. Generated approximately $1.6 billion of operating cash flow and used approximately $1.0 billion for capital expenditures, resulting in approximately $547 million of free cash flow in 2017. Grew passenger revenues by 32% compared to the fourth quarter of 2016, and by 36% compared to full-year 2016, largely enabled by our acquisition of Virgin America in December of 2016. Generated full-year adjusted pretax margin of 17% in 2017. Held $1.6 billion in unrestricted cash and marketable securities as of Dec. 31, 2017. Reduced debt-to-capitalization ratio to 51% as of Dec. 31, 2017, compared to 59% as of Dec. 31, 2016.\n2017 Accomplishments and Highlights:\nRecognition and Awards - Alaska\nRanked \"Highest in Customer Satisfaction Among Traditional Carriers\" in 2017 by J.D. Power for the tenth year in a row. Ranked first in the U.S. News & World Report's list of Best Travel Rewards Programs for the third consecutive year. Won the \"Best Rewards Program\" for Alaska Mileage Plan for carriers in the \"Americas\" region in the sixth annual FlyerTalk Award. Mileage Plan ranked Best Airline Elite Status Program in the U.S. by The Points Guy. Ranked among Forbes' 2017 \"America's Best Employers\" for the third year in a row. Received 16th Diamond Award of Excellence from the Federal Aviation Administration, recognizing both Alaska and Horizon's aircraft technicians for their commitment to training. Ranked by AirlineRatings.com as one of only two U.S. airlines in the Top 20 safest airlines in the world. Rated \"Best Airline Staff in North America\" and \"Best Regional Airline in North America\" by Skytrax World Airline Awards. Awarded TripAdvisor's 2017 Travelers' Choice Award for second-best midsize and low-cost airlines in North America and one of the top 10 best airlines in the world. Recognized by the Puget Sound Business Journal as the 2017 Board Diversity Champion, as well as by the Women Corporate Directors Global Institute for diversity among our Directors. Ranked as the top U.S. airline in the Dow Jones Sustainability Index (DJSI), receiving perfect scores for \"efficiency\" and \"reliability.\" Recognized as No. 1 in fuel efficiency for U.S. airlines by the International Council on Clean Transportation for the 7th consecutive year. Named one of the overall five-star major regional airlines at the Passenger Choice Awards during the APEX EXPO. Ranked fifth of most engaged companies in the U.S. by Forbes Insights, which measured social media engagement, net promoter scores, and year-over-year sales growth.\nRecognition and Awards - Virgin America\nRated Best U.S. Airline by Conde Nast Traveler in their \"Annual Readers' Choice Awards\" for the tenth year in a row. Rated Best Domestic Airline in Travel + Leisure \"World's Best Awards\" for the tenth year in a row. Received a five-star rating for low-cost carrier, and received a top honor with a Passenger Choice Award for \"Best Seat Comfort\" during the APEX EXPO.\nOur People\nAwarded $135 million in incentive pay to employees for 2017. Awarded employees a $1,000 bonus in January 2018 in connection with the passing of the Tax Cuts and Jobs Act, amounting to approximately $25 million to be paid on Jan. 29, 2018. Granted \"Single Carrier Determination\" by the National Mediation Board (\"NMB\") for Alaska Airlines and Virgin America, paving the way for labor integration and union representation. The NMB officially certified the Association of Flight Attendants as the union representative for Virgin America inflight teammates and the International Association of Machinists and Aerospace Workers as the union representative for Virgin America clerical, office and passenger service employees. Entered into an agreement with the International Brotherhood of Teamsters to amend the eight-year contract with Horizon's pilots, providing Horizon the ability to attract and retain the best pilots in the regional industry. Alaska received a perfect score of 100% for workplace equality on the 2018 Corporate Equality Index (\"CEI\"). Virgin America received a score of 95%.\nOur Guests and Product\nLaunched various new in-flight amenities, including Free Chat, upgraded food and beverage options and Premium Class service. Selected Gogo to provide next-generation satellite-based Wi-Fi across the entire Boeing and Airbus fleets, providing guests a faster and more-reliable internet connection. Dropped fees for bikes, golf clubs, skis, surfboards, and other sporting equipment that exceed Alaska's normal checked baggage weight and dimensions to $25. Added Condor Airlines, Finnair, and Singapore Airlines as global Mileage Plan partners. Announced plans to fly 13 daily departures from Paine Field-Snohomish County Airport in Everett, Washington to eight West Coast markets starting in fall 2018. Announced a seven-year partnership to be the official airline of the San Francisco Giants which includes, among other things, exclusive naming rights to the AT&T Park Club Level which will now be called the \"Alaska Airlines Club Level.\" Signed an exclusive multi-year partnership with Golden State Warriors star Kevin Durant naming him \"Advisor to the CEO,\" and extended our partnership with Russell Wilson and Ciara. Converted the world's first Boeing 737-700 from a passenger plane to a freighter and placed it into revenue service. Added 14 Boeing 737-900ER aircraft and 4 Airbus A321neo aircraft to the operating fleet in 2017, bringing the total Mainline fleet to 221 aircraft. Added 10 Embraer 175 (E175) regional jets to Horizon Air's fleet in 2017. Added 44 new markets in 2017 across the Alaska Air Group and Virgin America networks.\nOur Communities\nDonated over $14 million and contributed more than 32,000 volunteer hours to support nonprofits in our local communities, focusing on youth and education, medical (research/transportation) and community outreach.\nAlaska Air Group Inc. (NYSE: ALK) today reported fourth quarter 2017 GAAP net income of $367 million, or $2.97 per diluted share, compared to $114 million, or $0.92 per diluted share in 2016. Excluding the impact of merger-related costs, the special income tax benefit, and mark-to-market fuel hedge adjustments, the company reported fourth quarter adjusted net income of $103 million, or $0.83 per diluted share, compared to adjusted net income of $193 million, or $1.56 per diluted share in the fourth quarter of 2016.\nThe company reported full-year 2017 GAAP net income of $1,028 million, compared to $814 million in the prior year. Excluding the impact of merger-related costs, the special income tax benefit, and mark-to-market fuel hedge adjustments, the company reported adjusted net income of $823 million, or $6.64 per diluted share for 2017, compared to adjusted net income of $911 million, or $7.32 per diluted share in 2016.\n\"2017 was a great year - we invested in our route network, our fleet, our product, and laid the foundation for our future,\" said Brad Tilden, Alaska's CEO. \"We added 44 new routes to our network (in addition to the 38 added through Virgin America), grew membership in our loyalty program, and made great progress on our integration of Virgin America. By early spring, we'll have the bulk of the integration behind us, and working with our people to do more of what Alaska does best - running a highly reliable operation and offering our guests outstanding customer service.\"\nThe following tables reconcile the company's adjusted net income and earnings per diluted share (\"EPS\") during the full year and fourth quarters of 2017 and 2016 to amounts as reported in accordance with GAAP:\nThree Months Ended December 31,\n2017\n2016\n(in millions, except per share amounts)\nDollars\nDiluted EPS\nDollars\nDiluted EPS\nReported GAAP net income and diluted EPS\n$\n367\n$\n2.97\n$\n114\n$\n0.92\nMark-to-market fuel hedge adjustments\n(14)\n(0.11)\n(4)\n(0.03)\nSpecial items—merger-related costs\n30\n0.24\n81\n0.65\nIncome tax effect on special items and fuel hedge adjustments (a)\n(6)\n(0.05)\n(15)\n(0.12)\nSpecial tax (benefit)/expense (b)\n(274)\n(2.22)\n17\n0.14\nNon-GAAP adjusted net income and diluted EPS\n$\n103\n$\n0.83\n$\n193\n$\n1.56\nTwelve Months Ended December 31,\n2017\n2016\n(in millions, except per share amounts)\nDollars\nDiluted EPS\nDollars\nDiluted EPS\nReported GAAP net income and diluted EPS\n$\n1,028\n$\n8.30\n$\n814\n$\n6.54\nMark-to-market fuel hedge adjustments\n(7)\n(0.06)\n(13)\n(0.11)\nSpecial items—merger-related costs\n118\n0.95\n117\n0.94\nIncome tax effect on special items and fuel hedge adjustments (a)\n(42)\n(0.34)\n(24)\n(0.19)\nSpecial tax (benefit)/expense (b)\n(274)\n(2.21)\n17\n0.14\nNon-GAAP adjusted net income and diluted EPS\n$\n823\n$\n6.64\n$\n911\n$\n7.32\n(a)\nCertain merger-related costs in 2016 were non-deductible for tax purposes, resulting in a smaller income tax effect for prior year adjusting items.\n(b)\nThe special tax benefit in 2017 is due to the remeasurement of deferred tax liabilities as a result of the Tax Cuts and Jobs Act signed into law on December 22, 2017, offset by certain state tax law enactments. The resulting net tax benefit is excluded from our adjusted non-GAAP earnings.\nStatistical data, as well as a reconciliation of other reported non-GAAP financial measures, can be found in the accompanying tables. A glossary of financial terms can be found on the last page of this release.\nA conference call regarding the fourth quarter and full year results will be simulcast online at 8:30 a.m. Pacific time on Jan. 25, 2018. It can be accessed through the company's website at alaskaair.com/investors . For those unable to listen to the live broadcast, a replay will be available after the conclusion of the call.\nReferences in this news release to \"Air Group,\" \"company,\" \"we,\" \"us\" and \"our\" refer to Alaska Air Group Inc. and its subsidiaries, unless otherwise specified. Alaska Airlines, Inc., Horizon Air Industries, Inc., and Virgin America Inc. are referred to as \"Alaska,\" \"Horizon,\" and \"Virgin America\" respectively, and together as our \"airlines.\"\nThis news release may contain forward-looking statements subject to the safe harbor protection provided by Section 27A of the Securities Act of 1933, as amended, Section 21E of the Securities Exchange Act of 1934, as amended, and the Private Securities Litigation Reform Act of 1995. These statements relate to future events and involve known and unknown risks and uncertainties that may cause actual outcomes to be materially different from those indicated by any forward-looking statements. For a comprehensive discussion of potential risk factors, see Item 1A of the Company's Annual Report on Form 10-K for the year ended Dec. 31, 2016, as well as in other documents filed by the Company with the SEC after the date thereof. Some of these risks include general economic conditions, increases in operating costs including fuel, competition, labor costs and relations, our indebtedness, inability to meet cost reduction goals, seasonal fluctuations in our financial results, an aircraft accident, changes in laws and regulations and risks inherent in the achievement of anticipated synergies and the timing thereof in connection with the acquisition of Virgin America. All of the forward-looking statements are qualified in their entirety by reference to the risk factors discussed therein. We operate in a continually changing business environment, and new risk factors emerge from time to time. Management cannot predict such new risk factors, nor can it assess the impact, if any, of such new risk factors on our business or events described in any forward-looking statements. We expressly disclaim any obligation to publicly update or revise any forward-looking statements after the date of this report to conform them to actual results. Over time, our actual results, performance or achievements will likely differ from the anticipated results, performance, or achievements that are expressed or implied by our forward-looking statements, and such differences might be significant and materially adverse.\nAlaska Airlines, together with Virgin America and its regional partners, flies 44 million guests a year to 115 destinations with an average of 1,200 daily flights across the United States and to Mexico, Canada, and Costa Rica. With Alaska and Alaska Global Partners , guests can earn and redeem miles on flights to more than 900 destinations worldwide. Alaska Airlines ranked \" Highest in Customer Satisfaction Among Traditional Carriers in North America \" in the J.D. Power North America Satisfaction Study for 10 consecutive years from 2008 to 2017. Learn more about Alaska's award-winning service at newsroom.alaskaair.com and blog.alaskaair.com . Alaska Airlines, Virgin America and Horizon Air are subsidiaries of Alaska Air Group (NYSE: ALK).\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (unaudited)\nAlaska Air Group, Inc.\nAmounts below reflect the results of operations for Virgin America for the three and twelve months ended December 31, 2017 and for the period December 14, 2016 through December 31, 2016, including impacts associated with purchase accounting as of December 14, 2016.\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n(in millions, except per share amounts)\n2017\n2016\nChange\n2017\n2016\nChange\nOperating Revenues:\nPassenger\nMainline\n$\n1,468\n$\n1,062\n38\n%\n$\n5,858\n$\n4,098\n43\n%\nRegional\n235\n226\n4\n%\n960\n908\n6\n%\nTotal passenger revenue\n1,703\n1,288\n32\n%\n6,818\n5,006\n36\n%\nFreight and mail\n26\n26\n—\n%\n114\n108\n6\n%\nOther - net\n233\n210\n11\n%\n1,001\n817\n23\n%\nTotal Operating Revenues\n1,962\n1,524\n29\n%\n7,933\n5,931\n34\n%\nOperating Expenses:\nWages and benefits\n532\n374\n42\n%\n1,924\n1,382\n39\n%\nVariable incentive pay\n37\n32\n16\n%\n135\n127\n6\n%\nAircraft fuel, including hedging gains and losses\n396\n238\n66\n%\n1,447\n831\n74\n%\nAircraft maintenance\n120\n73\n64\n%\n391\n270\n45\n%\nAircraft rent\n70\n34\n106\n%\n274\n114\n140\n%\nLanding fees and other rentals\n122\n88\n39\n%\n460\n320\n44\n%\nContracted services\n80\n64\n25\n%\n314\n247\n27\n%\nSelling expenses\n88\n63\n40\n%\n357\n225\n59\n%\nDepreciation and amortization\n97\n82\n18\n%\n372\n363\n2\n%\nFood and beverage service\n50\n33\n52\n%\n195\n126\n55\n%\nThird-party regional carrier expense\n37\n21\n76\n%\n121\n95\n27\n%\nOther\n141\n100\n41\n%\n565\n365\n55\n%\nSpecial items—merger-related costs\n30\n81\n(63)\n%\n118\n117\n1\n%\nTotal Operating Expenses\n1,800\n1,283\n40\n%\n6,673\n4,582\n46\n%\nOperating Income\n162\n241\n(33)\n%\n1,260\n1,349\n(7)\n%\nNonoperating Income (Expense):\nInterest income\n9\n7\n34\n27\nInterest expense\n(26)\n(22)\n(103)\n(55)\nInterest capitalized\n4\n4\n17\n25\nOther - net\n—\n1\n(1)\n(1)\nTotal Nonoperating Income (Expense)\n(13)\n(10)\n(53)\n(4)\nIncome Before Income Tax\n149\n231\n1,207\n1,345\nIncome tax expense\n56\n100\n453\n514\nSpecial income tax benefit\n(274)\n17\n(274)\n17\nTotal Income Tax Expense/(Benefit)\n$\n(218)\n$\n117\n$\n179\n$\n531\nNet Income\n$\n367\n$\n114\n$\n1,028\n$\n814\nBasic Earnings Per Share:\n$\n2.98\n$\n0.92\n$\n8.34\n$\n6.59\nDiluted Earnings Per Share:\n$\n2.97\n$\n0.92\n$\n8.30\n$\n6.54\nShares Used for Computation:\nBasic\n123.147\n123.286\n123.211\n123.557\nDiluted\n123.670\n124.102\n123.854\n124.389\nCash dividend declared per share\n$\n0.300\n$\n0.275\n$\n1.200\n$\n1.100\nCONDENSED CONSOLIDATED BALANCE SHEETS (unaudited)\nAlaska Air Group, Inc.\n(in millions)\nDecember 31, 2017\nDecember 31, 2016\nCash and marketable securities\n$\n1,621\n$\n1,580\nTotal current assets\n2,128\n2,050\nProperty and equipment-net\n6,284\n5,666\nGoodwill\n1,943\n1,934\nIntangible assets-net\n133\n143\nOther assets\n234\n169\nTotal assets\n$\n10,722\n$\n9,962\nAir traffic liability\n937\n849\nCurrent portion of long-term debt\n307\n319\nOther current liabilities\n1,456\n1,367\nCurrent liabilities\n$\n2,700\n$\n2,535\nLong-term debt\n2,262\n2,645\nOther liabilities and credits\n2,045\n1,851\nShareholders' equity\n3,715\n2,931\nTotal liabilities and shareholders' equity\n$\n10,722\n$\n9,962\nDebt to Capitalization, adjusted for operating leases (a)\n51%\n59%\nNumber of common shares outstanding\n123.061\n123.328\n(a)\nCalculated using the present value of remaining aircraft lease payments for aircraft that are in our operating fleet as of the balance sheet date.\nOPERATING STATISTICS SUMMARY (unaudited)\nAlaska Air Group, Inc.\nConsolidated and Mainline amounts presented below reflect the results of operations for Virgin America for the three and twelve months ended December 31, 2017 and for the period December 14, 2016 through December 31, 2016, including impacts associated with purchase accounting as of December 14, 2016.\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n2017\n2016\nChange (d)\n2017\n2016\nChange (d)\nConsolidated Operating Statistics: (a)\nRevenue passengers (000)\n10,971\n8,752\n25.4%\n44,034\n34,289\n28.4%\nRPMs (000,000) \"traffic\"\n13,265\n9,640\n37.6%\n52,338\n37,209\n40.7%\nASMs (000,000) \"capacity\"\n15,901\n11,407\n39.4%\n62,072\n44,135\n40.6%\nLoad factor\n83.4%\n84.5%\n(1.1) pts\n84.3%\n84.3%\n— pts\nYield\n12.84¢\n13.36¢\n(3.9)%\n13.03¢\n13.45¢\n(3.1)%\nPRASM\n10.71¢\n11.29¢\n(5.1)%\n10.98¢\n11.34¢\n(3.2)%\nRASM\n12.34¢\n13.36¢\n(7.6)%\n12.78¢\n13.44¢\n(4.9)%\nCASMex (b)\n8.64¢\n8.45¢\n2.2%\n8.23¢\n8.23¢\n—%\nEconomic fuel cost per gallon (b)\n$2.00\n$1.68\n19.0%\n$1.82\n$1.52\n19.7%\nFuel gallons (000,000)\n205\n144\n42.4%\n797\n554\n43.9%\nASM's per gallon\n77.6\n79.2\n(2.0)%\n77.9\n79.7\n(2.3)%\nAverage full-time equivalent employees (FTEs)\n21,561\n15,566\n38.5%\n20,183\n14,760\n36.7%\nEmployee productivity (PAX/FTEs/months)\n169.6\n187.4\n(9.5)%\n181.8\n193.6\n(6.1)%\nMainline Operating Statistics:\nRevenue passengers (000)\n8,664\n6,406\n35.2%\n34,539\n24,838\n39.1%\nRPMs (000,000) \"traffic\"\n12,191\n8,722\n39.8%\n48,238\n33,489\n44.0%\nASMs (000,000) \"capacity\"\n14,547\n10,257\n41.8%\n56,945\n39,473\n44.3%\nLoad factor\n83.8%\n85.0%\n(1.2) pts\n84.7%\n84.8%\n(0.1) pts\nYield\n12.04¢\n12.17¢\n(1.1)%\n12.14¢\n12.24¢\n(0.8)%\nPRASM\n10.09¢\n10.35¢\n(2.5)%\n10.29¢\n10.38¢\n(0.9)%\nRASM\n11.74¢\n12.46¢\n(5.8)%\n12.10¢\n12.51¢\n(3.3)%\nCASMex (b)\n7.94¢\n7.57¢\n4.9%\n7.47¢\n7.30¢\n2.3%\nEconomic fuel cost per gallon (b)\n$1.99\n$1.67\n19.2%\n$1.82\n$1.52\n19.7%\nFuel gallons (000,000)\n180\n124\n45.2%\n706\n474\n48.9%\nASM's per gallon\n80.8\n82.7\n(2.3)%\n80.7\n83.3\n(3.1)%\nAverage number of FTEs\n16,295\n12,037\n35.4%\n15,653\n11,447\n36.7%\nAircraft utilization\n11.5\n10.1\n13.9%\n11.2\n10.5\n6.7%\nAverage aircraft stage length\n1,316\n1,243\n5.9%\n1,301\n1,225\n6.2%\nOperating fleet\n221\n218\n3 a/c\n221\n218\n3 a/c\nRegional Operating Statistics: (c)\nRevenue passengers (000)\n2,307\n2,346\n(1.7)%\n9,495\n9,452\n0.5%\nRPMs (000,000) \"traffic\"\n1,074\n918\n17.0%\n4,101\n3,720\n10.2%\nASMs (000,000) \"capacity\"\n1,354\n1,150\n17.7%\n5,127\n4,662\n10.0%\nLoad factor\n79.3%\n79.8%\n(0.5) pts\n80.0%\n79.8%\n0.2 pts\nYield\n21.87¢\n24.64¢\n(11.2)%\n23.41¢\n24.42¢\n(4.1)%\nPRASM\n17.35¢\n19.67¢\n(11.8)%\n18.72¢\n19.49¢\n(4.0)%\nOperating Fleet\n83\n67\n16 a/c\n83\n67\n16 a/c\n(a)\nExcept for FTEs, data includes information related to third-party regional capacity purchase flying arrangements.\n(b)\nSee a reconciliation of this non-GAAP measure and Note A for a discussion of potential importance of this measure to investors in the accompanying pages.\n(c)\nData presented includes information related to flights operated by Horizon and third-party carriers.\n(d)\nSee Combined Comparative information in the accompanying pages for year-over-year comparisons including Virgin America.\nSUPPLEMENTARY COMBINED COMPARATIVE FINANCIAL AND OPERATING INFORMATION (unaudited)\nWe believe that analysis of specific financial and operational results on a combined basis provides more meaningful year-over-year comparisons. The table below provides \"Combined Comparative\" results for the three and twelve months ended December 31, 2016, determined as the sum of the historical consolidated results of Air Group and of Virgin America. Virgin America's financial information has been conformed to reflect Air Group's historical financial statement presentation for each period presented. This information does not purport to reflect what our financial and operational results would have been had the acquisition been consummated at the beginning of the periods presented.\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n2017\n2016\n2017\n2016\n(in millions, except operating statistics)\nAs Reported\nCombined\nChange\nAs Reported\nCombined\nChange\nCombined Comparative Operating Results\nPassenger revenue\n$\n1,703\n$\n1,587\n7%\n$\n6,818\n$\n6,420\n6%\nOther revenue\n259\n267\n(3)%\n1,115\n1,075\n4%\nTotal Operating Revenues\n1,962\n1,854\n6%\n7,933\n7,495\n6%\nNon-fuel operating expense\n1,404\n1,282\n10%\n5,226\n4,800\n9%\nFuel expense\n396\n302\n31%\n1,447\n1,124\n29%\nTotal Operating Expenses\n1,800\n1,584\n14%\n6,673\n5,924\n13%\nOperating Income\n162\n270\n(40)%\n1,260\n1,571\n(20)%\nNonoperating income (expense)\n(13)\n(15)\n(13)%\n(53)\n(23)\n130%\nIncome Before Tax\n149\n255\n(42)%\n1,207\n1,548\n(22)%\nSpecial items—merger-related costs\n30\n94\n(68)%\n118\n138\n(14)%\nMark-to-market fuel hedge adjustments\n(14)\n(4)\n250%\n(7)\n(15)\n(53)%\nAdjusted Income Before Tax\n$\n165\n$\n345\n(52)%\n$\n1,318\n$\n1,671\n(21)%\nCombined Comparative Operating Statistics\nRevenue passengers (000)\n10,971\n10,382\n5.7%\n44,034\n41,947\n5.0%\nRPMs (000,000)\n13,265\n12,084\n9.8%\n52,338\n48,754\n7.4%\nASMs (000,000)\n15,901\n14,404\n10.4%\n62,072\n57,953\n7.1%\nLoad Factor\n83.4%\n83.9%\n(0.5) pts\n84.3%\n84.1%\n0.2 pts\nPRASM\n10.71¢\n11.02¢\n(2.8)%\n10.98¢\n11.08¢\n(0.9)%\nRASM\n12.34¢\n12.87¢\n(4.1)%\n12.78¢\n12.93¢\n(1.2)%\nCASMex\n8.64¢\n8.25¢\n4.7%\n8.23¢\n8.04¢\n2.4%\nOPERATING SEGMENTS (unaudited)\nAlaska Air Group, Inc.\nAmounts below reflect the results of operations for Virgin America for the three and twelve months ended December 31, 2017 and for the period December 14, 2016 through December 31, 2016, including impacts associated with purchase accounting as of December 14, 2016.\nThree Months Ended December 31, 2017\n(in millions)\nMainline\nRegional\nHorizon\nConsolidating\n& Other\nAir Group\nAdjusted (b)\nSpecial\nItems (c)\nConsolidated\nOperating revenues\nPassenger\nMainline\n$\n1,468\n$\n—\n$\n—\n$\n—\n$\n1,468\n$\n—\n$\n1,468\nRegional\n—\n235\n—\n—\n235\n—\n235\nTotal passenger revenues\n1,468\n235\n—\n—\n1,703\n—\n1,703\nRevenue from CPA with Alaska\n—\n—\n109\n(109)\n—\n—\n—\nFreight and mail\n26\n1\n—\n(1)\n26\n—\n26\nOther-net\n214\n17\n1\n1\n233\n—\n233\nTotal operating revenues\n1,708\n253\n110\n(109)\n1,962\n—\n1,962\nOperating expenses\nNon-fuel operating expenses\n1,156\n226\n104\n(112)\n1,374\n30\n1,404\nFuel expense\n358\n52\n—\n—\n410\n(14)\n396\nTotal operating expenses\n1,514\n278\n104\n(112)\n1,784\n16\n1,800\nNonoperating income (expense)\nInterest income\n12\n—\n—\n(3)\n9\n—\n9\nInterest expense\n(24)\n—\n(4)\n2\n(26)\n—\n(26)\nOther\n3\n—\n—\n1\n4\n—\n4\nTotal Nonoperating income (expense)\n(9)\n—\n(4)\n—\n(13)\n—\n(13)\nIncome (loss) before income tax\n$\n185\n$\n(25)\n$\n2\n$\n3\n$\n165\n$\n(16)\n$\n149\nThree Months Ended December 31, 2016\n(in millions)\nMainline (a)\nRegional\nHorizon\nConsolidating\n& Other\nAir Group\nAdjusted (b)\nSpecial\nItems (c)\nConsolidated\nOperating revenues\nPassenger\nMainline\n$\n1,062\n$\n—\n$\n—\n$\n—\n$\n1,062\n$\n—\n$\n1,062\nRegional\n—\n226\n—\n—\n226\n—\n226\nTotal passenger revenues\n1,062\n226\n—\n—\n1,288\n—\n1,288\nRevenue from CPA with Alaska\n—\n—\n102\n(102)\n—\n—\n—\nFreight and mail\n25\n2\n—\n(1)\n26\n—\n26\nOther-net\n192\n17\n1\n—\n210\n—\n210\nTotal operating revenues\n1,279\n245\n103\n(103)\n1,524\n—\n1,524\nOperating expenses\nNon-fuel operating expenses\n776\n189\n102\n(103)\n964\n81\n1,045\nFuel expense\n207\n35\n—\n—\n242\n(4)\n238\nTotal operating expenses\n983\n224\n102\n(103)\n1,206\n77\n1,283\nNonoperating income (expense)\nInterest income\n7\n—\n—\n—\n7\n—\n7\nInterest expense\n(19)\n—\n(2)\n(1)\n(22)\n—\n(22)\nOther\n4\n—\n1\n—\n5\n—\n5\nTotal Nonoperating income (expense)\n(8)\n—\n(1)\n(1)\n(10)\n—\n(10)\nIncome (loss) before income tax\n$\n288\n$\n21\n$\n—\n$\n(1)\n$\n308\n$\n(77)\n$\n231\nOPERATING SEGMENTS (unaudited)\nAlaska Air Group, Inc.\nTwelve Months Ended December 31, 2017\n(in millions)\nMainline\nRegional\nHorizon\nConsolidating\n& Other\nAir Group\nAdjusted (b)\nSpecial\nItems (c)\nConsolidated\nOperating revenues\nPassenger\nMainline\n$\n5,858\n$\n—\n$\n—\n$\n—\n$\n5,858\n$\n—\n$\n5,858\nRegional\n—\n960\n—\n—\n960\n—\n960\nTotal passenger revenues\n5,858\n960\n—\n—\n6,818\n—\n6,818\nRevenue from CPA with Alaska\n—\n—\n426\n(426)\n—\n—\n—\nFreight and mail\n110\n4\n—\n—\n114\n—\n114\nOther-net\n922\n74\n4\n1\n1,001\n—\n1,001\nTotal operating revenues\n6,890\n1,038\n430\n(425)\n7,933\n—\n7,933\nOperating expenses\nNon-fuel operating expenses\n4,257\n851\n427\n(427)\n5,108\n118\n5,226\nFuel expense\n1,282\n172\n—\n—\n1,454\n(7)\n1,447\nTotal operating expenses\n5,539\n1,023\n427\n(427)\n6,562\n111\n6,673\nNonoperating income (expense)\nInterest income\n39\n—\n—\n(5)\n34\n—\n34\nInterest expense\n(92)\n—\n(13)\n2\n(103)\n—\n(103)\nOther\n14\n—\n2\n—\n16\n—\n16\nTotal Nonoperating income (expense)\n(39)\n—\n(11)\n(3)\n(53)\n—\n(53)\nIncome (loss) before income tax\n$\n1,312\n$\n15\n$\n(8)\n$\n(1)\n$\n1,318\n$\n(111)\n$\n1,207\nTwelve Months Ended December 31, 2016\n(in millions)\nMainline (a)\nRegional\nHorizon\nConsolidating\n& Other\nAir Group\nAdjusted (b)\nSpecial\nItems (c)\nConsolidated\nOperating revenues\nPassenger\nMainline\n$\n4,098\n$\n—\n$\n—\n$\n—\n$\n4,098\n$\n—\n$\n4,098\nRegional\n—\n908\n—\n—\n908\n—\n908\nTotal passenger revenues\n4,098\n908\n—\n—\n5,006\n—\n5,006\nRevenue from CPA with Alaska\n—\n—\n424\n(424)\n—\n—\n—\nFreight and mail\n104\n5\n—\n(1)\n108\n—\n108\nOther-net\n738\n74\n4\n1\n817\n—\n817\nTotal operating revenues\n4,940\n987\n428\n(424)\n5,931\n—\n5,931\nOperating expenses\nNon-fuel operating expenses\n2,883\n769\n407\n(425)\n3,634\n117\n3,751\nFuel expense\n719\n125\n—\n—\n844\n(13)\n831\nTotal operating expenses\n3,602\n894\n407\n(425)\n4,478\n104\n4,582\nNonoperating income (expense)\nInterest income\n26\n—\n1\n—\n27\n—\n27\nInterest expense\n(42)\n—\n(9)\n(4)\n(55)\n—\n(55)\nOther\n19\n—\n1\n4\n24\n—\n24\nTotal Nonoperating income (expense)\n3\n—\n(7)\n—\n(4)\n—\n(4)\nIncome (loss) before income tax\n$\n1,341\n$\n93\n$\n14\n$\n1\n$\n1,449\n$\n(104)\n$\n1,345\n(a)\nIncludes Alaska activity for the full period, and Virgin America financial results for the period December 14, 2016 through December 31, 2016, and the impacts associated with purchase accounting as of December 14, 2016.\n(b)\nThe Air Group Adjusted column represents the financial information that is reviewed by management to assess performance of operations and determine capital allocation and does not include certain charges. See Note A in the accompanying pages for further information.\n(c)\nIncludes merger-related costs and mark-to-market fuel-hedge accounting charges.\nGAAP TO NON-GAAP RECONCILIATIONS (unaudited)\nAlaska Air Group, Inc.\nConsolidated and Mainline amounts presented below reflect the results of operations for Virgin America for the three and twelve months ended December 31, 2017 and for the period December 14, 2016 through December 31, 2016, including impacts associated with purchase accounting as of December 14, 2016.\nCASM Excluding Fuel and Special Items Reconciliation (unaudited)\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n(in cents)\n2017\n2016\n2017\n2016\nConsolidated:\nTotal operating expenses per ASM (CASM)\n11.32\n¢\n11.25\n¢\n10.75\n¢\n10.38\n¢\nLess the following components:\nAircraft fuel, including hedging gains and losses\n2.49\n2.09\n2.33\n1.88\nSpecial items—merger-related costs\n0.19\n0.71\n0.19\n0.27\nCASM, excluding fuel and special items\n8.64\n¢\n8.45\n¢\n8.23\n¢\n8.23\n¢\nMainline:\nTotal operating expenses per ASM (CASM)\n10.52\n¢\n10.33\n¢\n9.92\n¢\n9.39\n¢\nLess the following components:\nAircraft fuel, including hedging gains and losses\n2.37\n1.98\n2.24\n1.79\nSpecial items—merger-related costs\n0.21\n0.78\n0.21\n0.30\nCASM, excluding fuel and special items\n7.94\n¢\n7.57\n¢\n7.47\n¢\n7.30\n¢\nFuel Reconciliations (unaudited)\nThree Months Ended December 31,\n2017\n2016\n(in millions, except for per gallon amounts)\nDollars\nCost/Gal\nDollars\nCost/Gal\nRaw or \"into-plane\" fuel cost\n$\n406\n$\n1.98\n$\n238\n$\n1.65\nLosses on settled hedges\n4\n0.02\n4\n0.03\nConsolidated economic fuel expense\n$\n410\n$\n2.00\n$\n242\n$\n1.68\nMark-to-market fuel hedge adjustments\n(14)\n(0.07)\n(4)\n(0.03)\nGAAP fuel expense\n$\n396\n$\n1.93\n$\n238\n$\n1.65\nFuel gallons\n205\n144\nTwelve Months Ended December 31,\n2017\n2016\n(in millions, except for per gallon amounts)\nDollars\nCost/Gal\nDollars\nCost/Gal\nRaw or \"into-plane\" fuel cost\n$\n1,437\n$\n1.80\n$\n828\n$\n1.49\nLosses on settled hedges\n17\n0.02\n16\n0.03\nConsolidated economic fuel expense\n$\n1,454\n$\n1.82\n$\n844\n$\n1.52\nMark-to-market fuel hedge adjustments\n(7)\n—\n(13)\n(0.02)\nGAAP fuel expense\n$\n1,447\n$\n1.82\n$\n831\n$\n1.50\nFuel gallons\n797\n554\nNote A: Pursuant to Regulation G, we are providing reconciliations of reported non-GAAP financial measures to their most directly comparable financial measures reported on a GAAP basis. We believe that consideration of these non-GAAP financial measures may be important to investors for the following reasons:\nBy eliminating fuel expense and certain special items (including merger-related costs, changes resulting from the Tax Cuts and Jobs Act, and certain state tax law enactments) from our unit metrics, we believe that we have better visibility into the results of operations and our non-fuel cost-reduction initiatives. Our industry is highly competitive and is characterized by high fixed costs, so even a small reduction in non-fuel operating costs can result in a significant improvement in operating results. In addition, we believe that all domestic carriers are similarly impacted by changes in jet fuel costs over the long run, so it is important for management (and thus investors) to understand the impact of (and trends in) company-specific cost drivers such as labor rates and productivity, airport costs, maintenance costs, etc., which are more controllable by management. Cost per ASM (CASM) excluding fuel and certain special items, such as merger-related costs, is one of the most important measures used by management and by the Air Group Board of Directors in assessing quarterly and annual cost performance. Adjusted income before income tax and CASM excluding fuel (and other items as specified in our plan documents) are important metrics for the employee incentive plan, which covers the majority of Air Group employees. CASM excluding fuel and certain special items is a measure commonly used by industry analysts, and we believe it is the basis by which they compare our airlines to others in the industry. The measure is also the subject of frequent questions from investors. Disclosure of the individual impact of certain noted items provides investors the ability to measure and monitor performance both with and without these special items. We believe that disclosing the impact of certain items, such as merger-related costs and mark-to-market hedging adjustments, is important because it provides information on significant items that are not necessarily indicative of future performance. Industry analysts and investors consistently measure our performance without these items for better comparability between periods and among other airlines. Although we disclose our passenger unit revenues, we do not (nor are we able to) evaluate unit revenues excluding the impact that changes in fuel costs have had on ticket prices. Fuel expense represents a large percentage of our total operating expenses. Fluctuations in fuel prices often drive changes in unit revenues in the mid-to-long term. Although we believe it is useful to evaluate non-fuel unit costs for the reasons noted above, we would caution readers of these financial statements not to place undue reliance on unit costs excluding fuel as a measure or predictor of future profitability because of the significant impact of fuel costs on our business.\nGLOSSARY OF TERMS\nAircraft Utilization - block hours per day; this represents the average number of hours per day our aircraft are in transit\nAircraft Stage Length - represents the average miles flown per aircraft departure\nASMs - available seat miles, or \"capacity\"; represents total seats available across the fleet multiplied by the number of miles flown\nCASM - operating costs per ASM, or \"unit cost\"; represents all operating expenses including fuel and special items\nCASMex - operating costs excluding fuel and special items per ASM; this metric is used to help track progress toward reduction of non-fuel operating costs since fuel is largely out of our control\nDebt-to-capitalization ratio - represents adjusted debt (long-term debt plus the present value of future operating lease payments) divided by total equity plus adjusted debt\nDiluted Earnings per Share - represents earnings per share using fully diluted shares outstanding\nDiluted Shares - represents the total number of shares that would be outstanding if all possible sources of conversion, such as stock options, were exercised\nEconomic Fuel - best estimate of the cash cost of fuel, net of the impact of our fuel-hedging program\nFree Cash Flow - total operating cash flow generated less cash paid for capital expenditures\nLoad Factor - RPMs as a percentage of ASMs; represents the number of available seats that were filled with paying passengers\nMainline - represents flying Boeing 737 and Airbus jets and all associated revenues and costs\nPRASM - passenger revenue per ASM; commonly called \"passenger unit revenue\"\nProductivity - number of revenue passengers per full-time equivalent employee\nRASM - operating revenue per ASMs, or \"unit revenue\"; operating revenue includes all passenger revenue, freight & mail, Mileage Plan, and other ancillary revenue; represents the average total revenue for flying one seat one mile\nRegional - represents capacity purchased by Alaska from Horizon, SkyWest, and PenAir. In this segment, Regional records actual on-board passenger revenue, less costs such as fuel, distribution costs, and payments made to Horizon, SkyWest and PenAir under the respective capacity purchased arrangement (CPAs). Additionally, Regional includes an allocation of corporate overhead such as IT, finance, other administrative costs incurred by Alaska and on behalf of Horizon.\nRPMs - revenue passenger miles, or \"traffic\"; represents the number of seats that were filled with paying passengers; one passenger traveling one mile is one RPM\nYield - passenger revenue per RPM; represents the average revenue for flying one passenger one mile\nView original content: http://www.prnewswire.com/news-releases/alaska-air-group-reports-fourth-quarter-2017-and-full-year-results-and-raises-dividend-7-300588032.html\nSOURCE Alaska Air Group Inc.", "external_links": ["https://www.alaskaair.com/content/mileage-plan/how-to-earn-miles/airline-partners.aspx?lid=HomePage-RI1&int=AS_HOME_TILE1_-prodID:MPPartners", "http://www.prnewswire.com/news-releases/alaska-air-group-reports-fourth-quarter-2017-and-full-year-results-and-raises-dividend-7-300588032.html", "http://investor.alaskaair.com/phoenix.zhtml?c=109361&p=irol-IRHome", "https://blog.alaskaair.com/", "https://www.alaskaair.com/newsroom/", "https://newsroom.alaskaair.com/2017-05-10-Alaska-Airlines-awarded-highest-in-Traditional-Carrier-Satisfaction-for-10th-straight-year"], "published": "2018-01-25T16:00:00.000+02:00", "crawled": "2018-01-25T17:38:53.000+02:00", "highlightTitle": ""}