{"organizations": [], "uuid": "b3657b0b459dfd4c1f18bd1e9ea3af494270a3a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/africa-factors/african-markets-factors-to-watch-on-jan-18-idUSL8N1PD0DF", "country": "US", "domain_rank": 408, "title": "African Markets - Factors to watch on Jan. 18", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T13:10:00.000+02:00", "replies_count": 0, "uuid": "b3657b0b459dfd4c1f18bd1e9ea3af494270a3a6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/africa-factors/african-markets-factors-to-watch-on-jan-18-idUSL8N1PD0DF", "ord_in_thread": 0, "title": "African Markets - Factors to watch on Jan. 18", "locations": [], "entities": {"persons": [{"name": "nana akufo-addo", "sentiment": "none"}], "locations": [{"name": "burundi", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "ghana", "sentiment": "none"}], "organizations": [{"name": "u.n. human rights council", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following company announcements, scheduled economic indicators, debt and currency market moves and political events may affect African markets on Thursday. - - - - - EVENTS: *U.N. Human Rights Council due to review Burundi record *Ghana President Nana Akufo-Addo addresses reporters to mark first year in office GLOBAL MARKETS Asian stocks struck record highs on Thursday, with a rally by Wall Street supporting bullish investor sentiment, while the dollar pulled back from three-year lows as comments by European Central Bank officials tempered the euro's recent rally. WORLD OIL PRICES Oil prices inched up on Thursday on a reported decline in U.S. crude inventories, but prices stayed below recent three-year highs as fuel supplies remain ample and as refineries scale back operations. EMERGING MARKETS For the top emerging markets news, double click on AFRICA STOCKS For the latest news on African stocks, click on SOUTH AFRICA MARKETS South Africa's rand weakened on Wednesday, giving back gains that lifted it to its firmest level in 2-1/2 years as caution crept back into the market and some investors held off extending long positions. NIGERIA KIDNAPPING Kidnappers have abducted two Americans and two Canadians in the northern Nigerian state of Kaduna, killing two police officers, a police spokesman said on Wednesday. NIGERIA OIL Nigerian militants threatened on Wednesday to attack off-shore oil facilities within days, raising fears of a repeat of a 2016 wave of violence that helped push Africa's biggest economy into recession. NIGERIA SECURITY Suspected Boko Haram suicide bombers killed 12 people and injured 48 others in an attack on Wednesday on the northeastern Nigerian city of Maiduguri, officials from the State Emergency Management Agency (SEMA) for Borno said. NIGERIA STOCKS Nigerian stocks hit a nine-year high on Wednesday, extending gains for a third straight session. NIGERIA BONDS Nigeria plans to raise 110 billion naira by selling sovereign bonds with maturities of five and 10 years on Jan. 24, the Debt Management Office (DMO) said on Wednesday. KENYA MARKETS The Kenyan shilling rose to its highest level in just over five weeks on Wednesday, benefiting from a globally weak dollar, traders said. KENYA EU The European Union has shelved a 3.6 billion shilling ($35 million) water conservation assistance scheme to Kenya after forest guards killed a member of a community indigenous to one of the forests involved in the project. UGANDA MARKETS The Ugandan shilling inched up on Wednesday, helped by inflows from some commodity exporters and non-governmental organisations. UGANDA SECURITY Ugandan President Yoweri Museveni accused the United Nations on Wednesday of \"preserving terrorism\" in neighbouring Democratic Republic of Congo where U.N. peacekeepers have been unable to curb deadly attacks by Islamist rebels. CONGO UN Militias in eastern Democratic Republic of Congo are uniting in opposition to President Joseph Kabila, a senior U.N. official there told a news conference in Geneva on Wednesday. CONGO REPUBLIC OPEC Congo Republic plans to join the OPEC oil cartel, the government said, as the former French colony presses ahead with projects that could help it become the third-largest oil producer in sub-Saharan Africa. ETHIOPIA POLITICS Ethiopia freed a senior opposition leader on Wednesday, advancing efforts to calm political turmoil following violence and mass protests that shook the country in 2015 and 2016. ZIMBABWE CURRENCY Zimbabwe will not stop using \"bond notes\", a domestic quasi-currency, until the economy fully recovers, Finance Minister Patrick Chinamasa said on Wednesday. GHANA POLITICS Ghana's economy is rebounding and the major commodity exporter is poised to wean itself off bailouts through sustained fiscal discipline and a battle against corruption, President Nana Akufo-Addo said on Wednesday. IVORY COAST OIL Ivory Coast awarded Tullow Oil two new oil and gas blocks on Wednesday, including one along the maritime boundary with Ghana, government spokesman Bruno Kone said. IVORY COAST STOCKS West Africa's BRVM Bourse plans to list Mali's leading telecoms operator Sotelma and a regional banking group this year, its Chief Executive told Reuters on Wednesday. AFRICA GLAXOSMITHKLINE/DRUGS GlaxoSmithKline is cutting back operations in Africa as its new Chief Executive Emma Walmsley seeks to make the British drugmaker more competitive in emerging markets by ditching her predecessor's expansion plans for the continent. MALI GOLD industrial gold production in Mali rose to 49.6 tonnes in 2017, up 5 percent from the previous year, a senior Mines Ministry official said on Wednesday. MAURITIUS STORM Mauritius closed its port and airport on Wednesday as it raised its alert level for a tropical cyclone that is bearing down on the island. ITALY NIGER-LIBYA Italy's parliament approved on Wednesday an increased military presence in Libya and the deployment of up to 470 troops in Niger to combat migration and the trafficking of people towards Europe, many of whom wash up on Italian shores. For the latest precious metals report click on For the latest base metals report click on For the latest crude oil report click on\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T13:10:00.000+02:00", "crawled": "2018-01-19T12:27:34.010+02:00", "highlightTitle": ""}