{"organizations": [], "uuid": "f49911cd0662af626d4e9b12b0a1dd294e3eb203", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/business-wire-mannatech-promotes-two-senior-members-of-executive-team.html", "country": "US", "domain_rank": 767, "title": "Mannatech Promotes Two Senior Members of Executive Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-16T02:25:00.000+02:00", "replies_count": 0, "uuid": "f49911cd0662af626d4e9b12b0a1dd294e3eb203"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/business-wire-mannatech-promotes-two-senior-members-of-executive-team.html", "ord_in_thread": 0, "title": "Mannatech Promotes Two Senior Members of Executive Team", "locations": [], "entities": {"persons": [{"name": "fredrick", "sentiment": "none"}, {"name": "landen fredrick", "sentiment": "none"}, {"name": "joel bikman", "sentiment": "none"}, {"name": "al bala", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "mannatech", "sentiment": "negative"}, {"name": "global operations", "sentiment": "none"}, {"name": "associates", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COPPELL, Texas--(BUSINESS WIRE)-- Mannatech, Incorporated (NASDAQ: MTEX) a global health and wellness company committed to transforming lives to make a better world, promoted and added new responsibilities to a pair of senior members of its executive team, Landen Fredrick and Joel Bikman.\nFredrick, previously the Senior Vice President of Global Operations, was promoted to Chief Global Sales Officer and President, North America. He will coordinate worldwide sales activity and have P&L responsibility for all sales activity in the United States and Canada.\n“I have seen, on a very personal level within my immediate family, the powerful health benefits of our products, particularly Ambrotose,” said Fredrick. “Having spent my first 6 years at Mannatech in sales and recently 6 years in operations, I am excited about this new role where I can utilize my experiences to help build our sales team of over 200,000 Associates into a formidable force in the exploding wellness industry.”\nMannatech CEO Al Bala said, “As we accelerate our sales pace, we must continue to build a pro-Associate culture inside our organization. Landen’s experience and passion for Mannatech and our life-changing products uniquely qualifies him to lead our sales growth around the world.”\nBikman, previously the Senior Vice President of Sales & Marketing, was given new, additional responsibilities over Supply Chain, Logistics and Facilities, and was promoted to Chief Operating and Marketing Officer. As such, he will continue to lead the company’s Marketing and Research and Development activities.\n“It is an honor to work with the people and teams at Mannatech to develop and distribute these amazing products,” said Bikman. “I’m fortunate to work every day and do things that help make the world a healthier place. Within my family, too, I have personally seen the benefits of Ambrotose, and other Mannatech products, in improving health and wellness.”\nAdded Bala, “In today’s increasingly fast-paced business world, quick reaction time in the market is needed. Our rapid new product introductions and the supply chain transformation process have worked together to improve our ability to take our ideas and move them through the innovation pipeline and into the markets more quickly. Joel has proven his ability to lead and placing these additional responsibilities under him will help accelerate the process.”\nBoth promotions were announced on January 4, in a monthly company communications meeting, and were effective immediately.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180115005681/en/\nMannatech, Incorporated\nBen Mayo, pr@mannatech.com\nSource: Mannatech, Incorporated", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fus.mannatech.com%2F&esheet=51743419&newsitemid=20180115005681&lan=en-US&anchor=Mannatech%2C+Incorporated+%28NASDAQ%3A+MTEX%29&index=1&md5=59ad7fc5637a234cf883669394cafcb2", "http://www.businesswire.com/news/home/20180115005681/en/"], "published": "2018-01-16T02:25:00.000+02:00", "crawled": "2018-01-16T03:08:40.008+02:00", "highlightTitle": ""}