{"organizations": [], "uuid": "8dd226a7d37241d2293e6da0b3ddd5b817b4f775", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223036849&w=1200&r=LYNXMPEE0H0WM", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-opec-oil/opec-sees-more-oil-supply-from-rivals-countering-its-cuts-and-venezuelan-woes-idUSKBN1F71HL", "country": "US", "domain_rank": 408, "title": "OPEC sees more oil supply from rivals, countering its cuts and Venezuelan woes", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.097, "site_type": "news", "published": "2018-01-18T20:04:00.000+02:00", "replies_count": 0, "uuid": "8dd226a7d37241d2293e6da0b3ddd5b817b4f775"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-opec-oil/opec-sees-more-oil-supply-from-rivals-countering-its-cuts-and-venezuelan-woes-idUSKBN1F71HL", "ord_in_thread": 0, "title": "OPEC sees more oil supply from rivals, countering its cuts and Venezuelan woes", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "oman", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "negative"}, {"name": "non-opec", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:04 PM / Updated 6 hours ago OPEC sees more oil supply from rivals, countering its cuts and Venezuelan woes Alex Lawler 4 Min Read \nLONDON (Reuters) - OPEC has raised its forecast for oil supply from non-member countries in 2018 as higher prices encourage U.S. shale drillers to pump more, offsetting an OPEC-led deal to clear a supply glut and a deepening plunge in Venezuelan production. \nIn a monthly report on Thursday, the Organization of the Petroleum Exporting Countries said outside producers would boost supply by 1.15 million barrels per day (bpd) this year, up from 990,000 bpd expected previously. \n“Higher oil prices are bringing more supply to the market, particularly in North America and specifically tight oil,” OPEC said in the report, using another term for shale. \nOPEC, Russia and several other non-OPEC producers began to cut supply a year ago to get rid of a global glut of crude that had built up since 2014. They have extended the pact until the end of 2018. \nThe OPEC forecast of higher rival supply could add to a debate about the effectiveness of keeping the curbs in place. A ministerial monitoring panel meets this weekend in Oman and is expected to discuss the eventual exit strategy from the deal. \nBut the forecast was balanced by figures in the report showing OPEC’s compliance with the supply cuts remained high in December and a further sharp slide in Venezuelan oil output. \nOil prices edged higher after the report was released to trade above $69 a barrel and later steadied. Prices are close to the highest since December 2014. \nIn a further sign excess supply is easing, OPEC said inventories in developed economies declined by 16.6 million barrels in November to 2.933 billion barrels, 133 million above the five-year average. \nOPEC’s stated goal is to reduce stocks to the five-year average. VENEZUELA, UAE \nOPEC’s production in December based on figures it collects from secondary sources showed overall production rising. \nTotal output rose by 42,000 bpd to 32.42 million bpd, led by a gain in Nigeria which along with Libya was exempted from the supply cut because unrest had curbed their production. \nBut adherence by the 11 OPEC members with output targets rose to 129 percent, according to a Reuters calculation based on the OPEC figures, higher than 121 percent in November based on last month’s report. \nThe figures that OPEC members reported themselves showed deeper declines in production. \nVenezuela, whose output is dropping amid an economic crisis, told OPEC its production sank by about 216,000 bpd to 1.621 million bpd in December, believed to be the lowest in decades. \nThe UAE, which lagged many of its peers on compliance last year, said it cut output by 38,000 bpd to below its OPEC target for the first time. The compliance improvement comes as the country prepared to assume the rotating OPEC presidency in 2018. \nWith outside producers expected to pump more, OPEC in the report cut its estimate of global demand for its crude in 2018 by 60,000 bpd to 33.09 million bpd. \nShould OPEC keep pumping at December’s level and other things remain equal, the market could move into a deficit of about 670,000 bpd next year, suggesting inventories will be drawn down further. \nLast month’s report pointed to a similar deficit of about 700,000 bpd. Editing by Jason Neely and Mark Potter", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T20:04:00.000+02:00", "crawled": "2018-01-18T15:57:11.002+02:00", "highlightTitle": ""}