{"organizations": [], "uuid": "d7617f0a4ec0bb7c3f41109d413fe9247eac3b26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-prosperity-bancshares-inc-a-announces-stock-repurchase-program.html", "country": "US", "domain_rank": 767, "title": "Prosperity Bancshares, Inc.® Announces Stock Repurchase Program", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T14:30:00.000+02:00", "replies_count": 0, "uuid": "d7617f0a4ec0bb7c3f41109d413fe9247eac3b26"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-prosperity-bancshares-inc-a-announces-stock-repurchase-program.html", "ord_in_thread": 0, "title": "Prosperity Bancshares, Inc.® Announces Stock Repurchase Program", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "prosperity bancshares, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "prosperity bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 19, 2018 /PRNewswire/ -- Prosperity Bancshares, Inc. ® (the \"Company\") (NYSE: PB), the parent company of Prosperity Bank ® , today announced that its Board of Directors authorized a stock repurchase program under which the Company may repurchase up to 5%, or approximately 3.47 million shares, of its outstanding common stock over a two-year period expiring on January 16, 2020, at the discretion of management.\nRepurchases under this program may be made from time to time in open market transactions, and pursuant to any trading plan that may be adopted in accordance with Rule 10b5-1 of the Securities Exchange Act of 1934, as amended. The timing and actual number of shares repurchased will depend on a variety of factors including price, corporate and regulatory requirements, market conditions, and other corporate liquidity requirements and priorities. Any repurchased shares will be held by the Company as authorized but unissued shares.\nThe repurchase program does not obligate the Company to purchase any particular number of shares and there is no guarantee as to the exact number of shares that will be repurchased by the Company. The Company may suspend, modify or terminate the program at any time and for any reason, without prior notice.\nProsperity Bancshares, Inc. ®\nAs of September 30, 2017, Prosperity Bancshares, Inc. ® is a $22.143 billion Houston, Texas based regional financial holding company, formed in 1983. Operating under a community banking philosophy and seeking to develop broad customer relationships based on service and convenience, Prosperity offers a variety of traditional loan and deposit products to its customers, which consist primarily of small and medium sized businesses and consumers. In addition to established banking products, Prosperity offers a complete line of services including: Internet Banking Services at www.prosperitybankusa.com , Retail Brokerage Services, Credit Cards, MasterMoney Debit Cards, 24-hour voice response banking, Trust and Wealth Management, Mortgage Services, Cash Management, and Mobile Banking.\nProsperity currently operates 243 full-service banking locations: 65 in the Houston area, including The Woodlands; 29 in the South Texas area including Corpus Christi and Victoria; 34 in the Dallas/Fort Worth area; 22 in the East Texas area; 29 in the Central Texas area including Austin and San Antonio; 34 in the West Texas area including Lubbock, Midland-Odessa and Abilene; 16 in the Bryan/College Station area, 6 in the Central Oklahoma area and 8 in the Tulsa, Oklahoma area.\n\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995: This release contains, and the remarks by Prosperity's management on the conference call may contain, forward-looking statements within the meaning of the securities laws that are based on current expectations, assumptions, estimates and projections about Prosperity Bancshares and its subsidiaries. These forward-looking statements are not guarantees of future performance and are subject to risks and uncertainties, many of which are outside of Prosperity's control, which may cause actual results to differ materially from those expressed or implied by the forward-looking statements. These risks and uncertainties include but are not limited to whether Prosperity can: successfully identify acquisition targets and integrate the businesses of acquired companies and banks; continue to sustain its current internal growth rate or total growth rate; provide products and services that appeal to its customers; continue to have access to debt and equity capital markets; and achieve its sales objectives. Other risks include, but are not limited to: the possibility that credit quality could deteriorate; actions of competitors; changes in laws and regulations (including changes in governmental interpretations of regulations and changes in accounting standards); a deterioration or downgrade in the credit quality and credit agency ratings of the securities in Prosperity's securities portfolio; customer and consumer demand, including customer and consumer response to marketing; effectiveness of spending, investments or programs; fluctuations in the cost and availability of supply chain resources; economic conditions, including currency rate, interest rate and commodity price fluctuations; and weather. These and various other factors are discussed in Prosperity Bancshares' Annual Report on Form 10-K for the year ended December 31, 2016 and other reports and statements Prosperity Bancshares has filed with the SEC. Copies of the SEC filings for Prosperity Bancshares ® may be downloaded from the Internet at no charge from http:/ / www.prosperitybankusa.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/prosperity-bancshares-inc-announces-stock-repurchase-program-300585058.html\nSOURCE Prosperity Bancshares, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/prosperity-bancshares-inc-announces-stock-repurchase-program-300585058.html", "http://www.prosperitybankusa.com/"], "published": "2018-01-19T14:30:00.000+02:00", "crawled": "2018-01-19T16:02:51.009+02:00", "highlightTitle": ""}