{"organizations": [], "uuid": "96f321cf0368f1f01dca3a3afa4515472e01961f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/16/the-associated-press-the-latest-gop-lacking-votes-to-keep-government-open.html", "country": "US", "domain_rank": 767, "title": "The Latest: GOP lacking votes to keep government open", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T01:25:00.000+02:00", "replies_count": 0, "uuid": "96f321cf0368f1f01dca3a3afa4515472e01961f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/the-associated-press-the-latest-gop-lacking-votes-to-keep-government-open.html", "ord_in_thread": 0, "title": "The Latest: GOP lacking votes to keep government open", "locations": [], "entities": {"persons": [{"name": "mark meadows", "sentiment": "none"}, {"name": "meadows", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "gop", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "house freedom caucus", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "house gop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The Latest on Congress' battle over the budget (all times local):\n10:15 p.m.\nConservatives say there's enough Republican opposition to scuttle a plan by House GOP leaders to prevent a government shutdown this weekend.\nAround half of the roughly 30 members of the hard-right House Freedom Caucus met privately late Tuesday. When they emerged, leader Rep. Mark Meadows, R-N.C., said there are not enough Republican votes to push the GOP leaders' measure through the House this week with GOP-only support.\nThe plan by House leaders would temporarily finance government agencies through mid-February. Meadows says conservatives want the measure to allow additional defense spending.\nMost Democrats are vowing to oppose the bill. They want the two sides to reach agreement on legislation protecting hundreds of thousands of  \n6:25 p.m.\nHouse GOP leaders are looking to delay   taxes as sweeteners for a stopgap spending bill that's needed to avert a government shutdown this weekend.\nThat's according to GOP aides briefed on the measure before its planned introduction Tuesday night.\nRepeal of the taxes, part   law, could ease the way for the stopgap measure among some GOP conservatives.\nThe aides spoke on condition of anonymity to discuss a plan that wasn't yet public. They also predicted the measure would include a long-delayed renewal   children.\nDemocrats are pressing to attach protections from deportation for younger immigrants who were brought to the country illegally as children.\n— By Associated Press writer Andrew Taylor\n4 p.m.\nA   remains distant. House GOP leaders are discussing plans for a bill temporarily keeping federal agencies open in hopes of avoiding an election-year shutdown this weekend.\nThe continuing firestorm over Trump's incendiary remarks about countries in Africa is roiling partisan relations. The comments were reported by participants and others and denied by Trump. Either way, they're complicating efforts to craft a bipartisan agreement protecting younger immigrants brought to the country illegally as children, plus toughening border security with steps  \nFederal agencies would begin closing if Congress can't enact legislation temporarily financing government by midnight Friday.\nHouse Republicans were meeting privately late Tuesday to discuss their plans.", "external_links": [], "published": "2018-01-17T01:25:00.000+02:00", "crawled": "2018-01-17T08:30:25.013+02:00", "highlightTitle": ""}