{"organizations": [], "uuid": "7bf11e55211197b4eaa67f81090283f71dc4a62a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226991288&w=1200&r=LYNXMPEE0U17K", "site_section": "http://feeds.reuters.com/reuters/UKhealth/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-cdc-director/top-doctor-at-cdc-resigns-over-financial-conflicts-officials-idUKKBN1FK2AO", "country": "US", "domain_rank": 408, "title": "Top doctor at CDC resigns over financial conflicts: officials", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T18:10:00.000+02:00", "replies_count": 0, "uuid": "7bf11e55211197b4eaa67f81090283f71dc4a62a"}, "author": "", "url": "https://uk.reuters.com/article/us-cdc-director/top-doctor-at-cdc-resigns-over-financial-conflicts-officials-idUKKBN1FK2AO", "ord_in_thread": 0, "title": "Top doctor at CDC resigns over financial conflicts: officials", "locations": [], "entities": {"persons": [{"name": "alex azar", "sentiment": "none"}, {"name": "fitzgerald", "sentiment": "none"}, {"name": "brenda fitzgerald", "sentiment": "none"}, {"name": "julie steenhuysen", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cdc", "sentiment": "negative"}, {"name": "hhs", "sentiment": "none"}, {"name": "u.s. department of health and human services", "sentiment": "none"}, {"name": "politico", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. centers for disease control and prevention", "sentiment": "none"}, {"name": "georgia department of public health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 3:51 PM / Updated 23 minutes ago U.S. public health chief quits over financial conflicts Julie Steenhuysen   head of the leading U.S. public health agency has resigned because of financial conflicts of interest that documents showed included purchases of tobacco and healthcare stocks while in office. \nDr. Brenda Fitzgerald held “certain complex financial interests” that she could not sell in time, U.S. officials said on Wednesday, forcing her to recuse herself from many duties as head of the U.S. Centers for Disease Control and Prevention. \nFitzgerald, a physician and former commissioner of the Georgia Department of Public Health, is the second high-profile health official in the year-old Trump administration to leave over financial and ethical questions. \nShe leaves the agency at a time when the CDC is dealing with the country’s worst flu season in years. \nFitzgerald’s departure came a day after Politico website reported she had traded in tobacco stocks a month after her confirmation in July. \nFitzgerald’s financial disclosure report, released first by Politico and seen by Reuters, showed she made purchases last August in shares of Japan Tobacco Inc ( 2914.T ), Merck & Co Inc ( MRK.N ), Humana Inc ( HUM.N ) as well as ADRs of German drugmaker Bayer AG ( BAYGn.DE ). \nNewly confirmed U.S. Department of Health and Human Service (HHS) Secretary Alex Azar said he had accepted Fitzgerald’s resignation because “complex financial interests” forced her to recuse herself from a broad range of duties as CDC director. \nDemocratic U.S. Senator Patty Murray has repeatedly raised concerns about Fitzgerald’s financial holdings, which have forced the CDC director to recuse herself from oversight of major issues including cancer, the opioid epidemic and issues involving information technology. \n“It is unacceptable that the person responsible for leading our nation’s public health efforts has, for months, been unable to fully engage in the critical work she was appointed to do,” Murray said in a statement on Wednesday. Dr. Brenda Fitzgerald, director of the Centers for Disease Control and Prevention. Courtesy CDC/via REUTERS \nThe White House declined comment, referring questions to HHS. A CDC spokeswoman could not immediately say who would replace Fitzgerald. \nIn December, Murray, the ranking Democrat on the Senate Health, Education, Labor, and Pensions Committee, which oversees the CDC, sent Fitzgerald a letter urging her to resolve ongoing conflicts of interest that limited her ability to oversee key public health challenges. \nMurray said at the time that Fitzgerald’s ethics agreement, dated Sept. 7, 2017, indicated she had kept investments that required her to recuse herself from issues related to cancer and the prescription drug monitoring programs, used to track and monitor opioids. \nMurray said the conflicts had forced her to send deputies to testify at congressional hearings involving the opioid crisis. \nLast September, Trump’s first health secretary, former U.S. Representative Tom Price, resigned over his use of expensive taxpayer-funded private charter jets for government travel. \nMurray said she hoped Azar would encourage the president to choose a new director ”who is truly prepared to focus on families and communities.” \nDr. Peter G. Lurie, president of the Center for Science in the Public Interest, welcomed the resignation, saying Fitzgerald should have actively divested holdings that posed a conflict of interest before her confirmation. \n“Inexplicably, she decided to make matters even worse,” he said, referring to the reported tobacco stock purchases. \nU.S. Representative Rosa DeLauro, ranking Democrat on the House appropriations subcommittee responsible for CDC funding, said Fitzgerald’s resignation “follows the pattern of Trump’s appointees, who put their own personal and financial interests ahead of the American people‘s.” Reporting by Julie Steenhuysen in Chicago; additional reporting by Ankur Banerjee in Bengaluru and Roberta Rampton in Washington; Editing by David Gregorio and Jeffrey Benkoe", "external_links": [], "published": "2018-01-31T18:10:00.000+02:00", "crawled": "2018-01-31T18:19:23.016+02:00", "highlightTitle": ""}