{"organizations": [], "uuid": "932f461324cf4674c0c269f436a3993ae91aaeb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 25, "shares": 25, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222033391&w=1200&r=LYNXMPEE0E032", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-stephens-ostapenko/stephens-tumbles-out-in-first-round-ostapenko-impresses-idUSKBN1F407U", "country": "US", "domain_rank": 408, "title": "Stephens tumbles out in first round, Ostapenko impresses", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T04:50:00.000+02:00", "replies_count": 0, "uuid": "932f461324cf4674c0c269f436a3993ae91aaeb5"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-stephens-ostapenko/stephens-tumbles-out-in-first-round-ostapenko-impresses-idUSKBN1F407U", "ord_in_thread": 0, "title": "Stephens tumbles out in first round, Ostapenko impresses", "locations": [], "entities": {"persons": [{"name": "stephens", "sentiment": "negative"}, {"name": "martyn herma", "sentiment": "negative"}, {"name": "ostapenko", "sentiment": "negative"}, {"name": "jelena ostapenko", "sentiment": "none"}, {"name": "sloane stephens", "sentiment": "none"}, {"name": "schiavone", "sentiment": "none"}, {"name": "francesca schiavone", "sentiment": "none"}, {"name": "zhang", "sentiment": "none"}, {"name": "margaret court arena", "sentiment": "none"}, {"name": "zhang shuai", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "flushing meadows", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " The stark contrast in form between last year’s two first-time grand slam champions continued as Sloane Stephens was bundled out in the first round of the Australian Open, while Jelena Ostapenko stormed into round two on Monday.\nAmerican Stephens enjoyed a fairytale run to win the U.S. Open last year ranked 83rd in the world but has not won a match since -- a run that continued with a 2-6 7-6(2) 6-2 defeat by China’s Zhang Shuai on Margaret Court Arena.\nNot that the 24-year-old was getting too down on herself.\n“Even though I lost, I‘m not too sad. Everything is good. Relax, everybody. It will be okay. Don’t worry. We will get back to having fun soon,” she told reporters.\n“Just give me a little bit to regroup and we will be okay.”\nUnlike Stephens the 20-year-old Ostapenko, who blazed to the French Open title last June to become Latvia’s first grand slam champion, has suffered no such hangover.\nShe backed up her Paris exploits to reach the Wimbledon quarter-finals and third round in New York, and looked every inch a title contender in a 6-1 6-4 defeat of Italian veteran Francesca Schiavone to open proceedings on Rod Laver Arena.\nOstapenko, who had an edition of 55,000 stamps printed in her honour last year, all of which were sold in a day, trailed in the second set against the 37-year-old 2010 French Open champion, but clicked into gear to move through.\nPREDICTABLE DEFEAT Tennis - Australian Open - Sloane Stephens of the U.S. v Zhang Shuai of China - Margaret Court Arena, Melbourne, Australia, January 15, 2018. Zhang reacts after winning the match. REUTERS/Issei Kato The seventh seed had lost in the first round of both her tournaments so far this year, but back on one of the sport’s grandest stages, she shone.\n“I really enjoy to play on all center courts, especially when there is a lot of people watching and supporting me, I really love that feeling,” Ostapenko, who reached the third round here last year, told reporters.\n“Of course it’s tough, especially after winning at the age of 20. Everybody wants to beat you,” she said. “But on the other side, I have nothing to lose. I already won the grand slam. I just enjoy every match and show my best.”\nTennis - Australian Open - Sloane Stephens of the U.S. v Zhang Shuai of China - Margaret Court Arena, Melbourne, Australia, January 15, 2018. Zhang and Stephens shake hands after Zhang won their match. REUTERS/Issei Kato The 24-year-old Stephens lacks the firepower of Ostapenko and while her defeat by Zhang was classified as a first-day surprise, it was quite predictable against an accurate opponent who just missed out on a seeding.\nStephens was assured in winning the first set and battled back from a break down in the second and served for the match at 5-4, only to be broken and dragged into a tiebreak.\nZhang, who reached the quarter-finals in 2016 as a qualifier, dominated the decider with her pinpoint groundstrokes to send the 13th seed spinning out.\nStephens was phlegmatic afterwards, laughing off questions about her loss of form.\n”I wouldn’t call them tough times. Everyone is so depressed and so down,“ she said. ”I will have the best Instagram picture when I finally snap this losing streak.\n“Tennis is definitely a roller coaster. But I have learned to just not panic.”\nEditing by Peter Rutherford/John O'Brien\n ", "external_links": [], "published": "2018-01-15T04:50:00.000+02:00", "crawled": "2018-01-15T05:11:09.006+02:00", "highlightTitle": ""}