{"organizations": [], "uuid": "63a77bf4edad4bbc48a0796198fa11c9d368033f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 41, "shares": 41, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/04/gettyimages-465790429.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/13/credit-cards-to-buy-bitcoin/", "country": "US", "domain_rank": 1196, "title": "Bitcoin Investors Are Using Credit Cards in Disturbing Numbers | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.586, "site_type": "news", "published": "2018-01-13T13:55:00.000+02:00", "replies_count": 0, "uuid": "63a77bf4edad4bbc48a0796198fa11c9d368033f"}, "author": "David Z. Morris", "url": "http://fortune.com/2018/01/13/credit-cards-to-buy-bitcoin/", "ord_in_thread": 0, "title": "Bitcoin Investors Are Using Credit Cards in Disturbing Numbers | Fortune", "locations": [], "entities": {"persons": [{"name": "david z. morris", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "lendedu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Z. Morris 11:55 AM EST \nA recent poll shows that nearly one-fifth of all Bitcoin buyers are using credit cards to fund their investments, likely paying hefty fees for the privilege. A large portion of those buyers then carry the balance instead of paying their cards off, implying that they’re highly leveraged – but confident that their investments will grow in value. \nThe findings come from a survey conducted by LendEDU, a student loan refinancer, in December. They conducted an online poll of the payment behavior of 672 active Bitcoin investors, and found that 18.15% of them bought the virtual currency with a credit card. \nOf those, 22.13% did not pay off their credit card balances. Nearly 90% of those planned to pay off the balances by selling their Bitcoin investments, implying a firm faith that the cryptocurrency’s price would continue rising. LendEDU doesn’t indicate that the survey was scientifically randomized, but its large sample size, and use of two layers of screening to ensure respondents were actual Bitcoin buyers, gives credence to its findings. \nThe numbers are worrisome for at least two reasons. The main U.S. cryptocurrency marketplace, CoinBase, charges a 4% transaction fee for credit card purchases. For nearly any other form of investment, that fee alone would wipe out most of any reasonably-expected appreciation. In traditional investing, low expenses are a major factor in long-term success. \nIn other words, even credit-card Bitcoin buyers who pay off their balances immediately are throwing money away. And ironically, those fees go in large part to credit card companies themselves – the very intermediary institutions Bitcoin was invented to undermine . \nGet Data Sheet , Fortune’s technology newsletter. \nBut those carrying a balance after buying Bitcoin are even more troubling. Carrying a credit balance implies they don’t have the cash on hand to directly fund their Bitcoin purchases, and will only be able to pay off their debt, fees, and interest if the investment grows. With credit card APRs generally around 15%, that growth would also need to be rapid, rather than long-term. \nThat’s a recipe for personal financial disaster, and maybe more widespread problems. For example, LendEDU’s survey was conducted in early December, as the price of Bitcoin rose from around $11,000 to around $17,000. But, after an even higher peak that month, the cryptocurrency has once again declined to just under $14,500. \nThat implies many of those plastic-funded investors have already taken losses on loans they can’t afford to repay. And if prior cycles of Bitcoin mania replay themselves, the cryptocurrency’s price could be entering a long, slow decline that will only amplify those unfunded losses. \nThat, in microcosm, reflects concerns about Bitcoin as a systemic economic risk, as more and more leveraging products enter an obviously overheated market. Leading economists mostly agree that the cryptocurrency market just isn’t big enough for a crash to cause the kind of damage that real-estate leverage exposure did back in 2008. But the same bad habits, if they continue, could become a much more serious worry in the future. \nSo, to reiterate: despite its recent rally, cryptocurrency is a highly speculative investment. Don’t put in more money than you can afford to lose outright – and definitely don’t put in more money than you have. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-13T13:55:00.000+02:00", "crawled": "2018-01-13T18:57:38.004+02:00", "highlightTitle": ""}