{"organizations": [], "uuid": "b45692644035e505609157658c4965941b396c59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/gettyimages-612441534.jpg", "site_section": "http://feeds.feedburner.com/google/CGSe", "section_title": "google news - Google News", "url": "http://fortune.com/2018/01/17/google-fi-unlimited-wireless/", "country": "US", "domain_rank": 1196, "title": "Google's Fi Low-Cost Wireless Service Adds Unlimited Data. Here's How Much It Costs - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T20:16:00.000+02:00", "replies_count": 0, "uuid": "b45692644035e505609157658c4965941b396c59"}, "author": "", "url": "http://fortune.com/2018/01/17/google-fi-unlimited-wireless/", "ord_in_thread": 0, "title": "Google's Fi Low-Cost Wireless Service Adds Unlimited Data. Here's How Much It Costs - Fortune", "locations": [], "entities": {"persons": [{"name": "aaron pressman", "sentiment": "neutral"}], "locations": [], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "sprint", "sentiment": "none"}, {"name": "google fi", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman 1:15 PM EST \nGoogle added an unlimited data plan to its low-cost wireless service known as Google Fi, in a move aimed at matching the popular offers from rivals Sprint, AT&T and others. \nAt $80 per line, the Fi unlimited plan isn’t that cheap, but it is more flexible than the competition. Rival plans require customers to select an unlimited plan and pay the fee for such a plan every month. The Fi plan lets customers stick with the much cheaper feature of paying only for the data they actually use in a month, until they reach a certain level, when the unlimited pricing kicks in. \nCurrently, Google Fi customers pay $20 monthly for the first line plus $10 per gigabyte of data used. That’s cheaper than most of the plans available from the major carriers and doesn’t lock customers into guessing how much data they may need and paying unnecessarily extra when they use less. Google also offers international roaming including high speed data at the same price. \nBut since the major carriers have rolled out unlimited data plans over the past two years, the Fi service has become less appealing for heavy data users. Someone who used 10 GB in a month, for example, would pay $120 on Fi, versus the standard unlimited data plans of AT&T (t) at $90, Verizon (vz) at $85, Sprint (s) at $60, and T-Mobile (tmus) at $70, that all cost less for one line. And some of the carriers have even cheaper unlimited plans that slow download speeds or impose other limits. \nGoogle’s new unlimited feature, which Fi calls “bill protection,” caps charges for one line at $80, even if a customer uses more than 6 GB in a month. Plans with two lines get protection at $120, three lines at $135, and four lines at $150. Customers don’t have to do anything special to prevent getting charged for using more data, Google said. \nGet Data Sheet , Fortune’s technology newsletter. \n“Bill Protection begins rolling out today to individual subscribers and group plans,” Fi said in a blog post . “If you’re a current Fi subscriber, you’ll see it appear on your next billing cycle.” \nGoogle (googl) said it could slow the speed of a customers’ downloads if they used more than 15 GB per line per month, unless they paid another $10 per GB over the $80 charge. \nGoogle has not disclosed details about how many subscribers it has for the service, which it introduced almost three years ago and runs on leased airwaves from the networks of T-Mobile, Sprint and US Cellular. However, the service works only on a handful of phones that run Google’s Android software and not on any Apple iPhones. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-17T20:16:00.000+02:00", "crawled": "2018-01-17T21:53:59.003+02:00", "highlightTitle": ""}