{"organizations": [], "uuid": "7ce6475f8c8669acb9081d9d4fad9abe63a597a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955909-RTX4EEAR.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/qatar-saudi-dispute-is-bad-for-the-us-tillerson-says.html", "country": "US", "domain_rank": 767, "title": "Qatar-Saudi dispute is bad for the US, Tillerson says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.179, "site_type": "news", "published": "2018-01-31T09:09:00.000+02:00", "replies_count": 0, "uuid": "7ce6475f8c8669acb9081d9d4fad9abe63a597a5"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/31/qatar-saudi-dispute-is-bad-for-the-us-tillerson-says.html", "ord_in_thread": 0, "title": "Qatar-Saudi dispute is bad for the US, Tillerson says", "locations": [], "entities": {"persons": [{"name": "tillerson", "sentiment": "negative"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "yuri gripas", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "bahrain", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Two top U.S. government officials called on Gulf countries including Saudi Arabia and the United Arab Emirates (UAE) to resolve their dispute with their neighbor Qatar, saying that regional stability is at stake.\n\"As the Gulf dispute nears the eight-month mark, the United States remains as concerned today as we were at its outset,\" Secretary of State Rex Tillerson said in opening remarks at the inaugural U.S.-Qatar \"strategic dialogue\" meeting on Tuesday.\n\"This dispute has had direct negative consequences economically and militarily for those involved, as well as the United States. We are concerned by the rhetoric and propaganda employed in the region, playing out daily in Arab mainstream and social media.\"\nSaudi Arabia, the UAE, Egypt and Bahrain cut diplomatic ties and cut off transport links with Qatar in June 2017, accusing it of supporting Islamist groups and destabilizing the region, allegations that Qatar denies.\nSaudi Arabia and its allies say they are boycotting the country rather than blockading it, but Qatar says its neighbors' actions are unjustified. The sanctions have weakened its economy slightly, according to official government data.\nRelations deteriorated further in late summer 2017 after Qatar restored diplomatic relations with Saudi Arabia's arch-rival Iran, ties that had been cut in 2016 after attacks on Saudi Arabia's embassy in Iran.\nTone down the rhetoric Attending the strategic dialogue meeting with the U.S. Secretary of Defense James Mattis, Tillerson urged both sides in the dispute to tone down the rhetoric.\n\"It is critical that all parties minimize rhetoric, exercise restraint to avoid further escalation, and work toward a resolution,\" he said, adding that a united Gulf Cooperation Council (GCC) \"bolsters our effectiveness on many fronts, particularly on counterterror — countering terrorism, defeating ISIS, and countering the spread of Iran's malign influence.\"\nThe GCC is an economic and political alliance of six countries, comprising Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates.\nTim De Waele | Corbis | Getty Images The skyline of Doha, Qatar. He said Qatar had \"made significant progress to improve efforts to combat terrorism\" and that as a result of the memorandum of understanding signed between the U.S. and Qatar last July, the countries had increased information sharing on terrorists and terrorist financiers, had participated in counterterrorism technical training and taken steps to improve aviation security.\n\"We look forward to building on this foundation and implementing next steps,\" Tillerson said.\nThe session on Tuesday included discussions on various areas of cooperation, including trade and investment, security, counterterrorism, energy, and aviation.\nTillerson said Qatar was \"a strong partner and a longtime friend of the United States\" and said that the U.S. believed that \"enhanced trade will contribute positively to both our countries' economic development, and create jobs for the American people and Qatari citizens while furthering the region's security and stability.\"", "external_links": [], "published": "2018-01-31T09:09:00.000+02:00", "crawled": "2018-01-31T09:09:04.011+02:00", "highlightTitle": ""}