{"organizations": [], "uuid": "5830e80b50e50fb05b1ee8cc1095e55a8d7b0b16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-germany/axe-wielding-hollerbach-hoping-to-cut-hamburg-losses-idUKKBN1FE17I", "country": "US", "domain_rank": 408, "title": "Axe-wielding Hollerbach hoping to cut Hamburg losses", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T12:25:00.000+02:00", "replies_count": 0, "uuid": "5830e80b50e50fb05b1ee8cc1095e55a8d7b0b16"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-germany/axe-wielding-hollerbach-hoping-to-cut-hamburg-losses-idUKKBN1FE17I", "ord_in_thread": 0, "title": "Axe-wielding Hollerbach hoping to cut Hamburg losses", "locations": [], "entities": {"persons": [{"name": "hollerbach", "sentiment": "negative"}, {"name": "markus gisdol", "sentiment": "none"}, {"name": "bernd hollerbach", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "leipzig", "sentiment": "none"}, {"name": "hamburg", "sentiment": "none"}], "organizations": [{"name": "hamburg", "sentiment": "negative"}, {"name": "hamburg sv", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 27 AM / Updated 25 minutes ago Axe-wielding Hollerbach hoping to cut Hamburg losses Reuters Staff 3 Min Read \nBERLIN (Reuters) - Former Hamburg SV defender Bernd Hollerbach will need to live up to his nickname of “Holleraxe” if he is to whip the Bundesliga club back into shape and help them avoid relegation as they prepare to face RB Leipzig on Saturday. \nHollerbach, a trained butcher who was known for his no-nonsense approach during a seven-year playing stint at Hamburg, took over from sacked coach Markus Gisdol this week with a clear mandate of maintaining the club’s 100 percent Bundesliga record. \nHamburg are the only side to have played every season in the top division since its creation in 1963 but the former champions have been involved in two relegation playoffs in the last four seasons and narrowly escaped another one in the last campaign. \nIt has not been much different this season after they opened with two straight wins before slipping into an all-too-familiar slump. \nThey managed just two more victories in their next 17 matches before club bosses showed Gisdol the door with the former European champions languishing in 17th place on 15 points. \n“The very first thing we need to do is to present ourselves as a unit so that we have order and stability in our game,” Hollerbach told reporters. \n“We will try to do that this week. I am having a lot of talks. I feel the team is a bit insecure.” \nHollerbach is no stranger to difficult missions, having taken Wuerzburger Kickers, with the lowest budget in the fourth division, up to the second division in consecutive seasons from 2015. \nHe had earlier won the Bundesliga as Felix Magath’s assistant at VfL Wolfsburg in 2009 and then followed the same coach to Schalke. \nHard-working and rugged -- earning 95 yellow cards in his 222 Bundesliga matches according to league records -- Hollerbach desperately needs to plug a leaky defence that has conceded 28 goals in 19 games. \n“What is now important is to be compact and not make it easy for opponents to score,” Hollerbach said, with third-placed RB Leipzig boasting the league’s third best strike force with 31 goals. \n“I think (my arrival) may help some players release the energy we need right now.” \nAt the other end of the table, leaders Bayern Munich are cruising towards their record-extending sixth consecutive Bundesliga title, having already carved out a 16-point advantage as they prepare to host Hoffenheim on Saturday. Reporting by Karolos Grohmann; Editing by John O'Brien", "external_links": [], "published": "2018-01-25T12:25:00.000+02:00", "crawled": "2018-01-25T12:39:07.023+02:00", "highlightTitle": ""}