{"organizations": [], "uuid": "3af9092bfe3ed5f5a985feaf03477c39a76d8f57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/05/104321344-RTR4S7O9.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/abbvie-raises-2018-forecast-quarterly-profit-beats-on-strong-humira-sales.html", "country": "US", "domain_rank": 767, "title": "AbbVie raises 2018 forecast, quarterly profit beats on strong Humira sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-26T17:19:00.000+02:00", "replies_count": 0, "uuid": "3af9092bfe3ed5f5a985feaf03477c39a76d8f57"}, "author": "Brendan Mcdermid", "url": "https://www.cnbc.com/2018/01/26/abbvie-raises-2018-forecast-quarterly-profit-beats-on-strong-humira-sales.html", "ord_in_thread": 0, "title": "AbbVie raises 2018 forecast, quarterly profit beats on strong Humira sales", "locations": [], "entities": {"persons": [], "locations": [{"name": "humira", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "modern medicine abbvie", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "reuters brendan mcdermid", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AbbVie , the maker of the world's best selling drug, reported fourth-quarter profit on Friday that beat Wall Street estimates on strong sales for its blockbuster drug Humira. Shares of the company rose 3.4 percent to $112 before the bell and were set to open at a record high after the U.S. drugmaker raised its 2018 earnings forecast on lower tax rates and expectations of higher operating performance.\nThe Chicago-based drugmaker said it expected full-year adjusted earnings per share to be between $7.33 and $7.43, higher than its prior forecast of $6.37-$6.57.\n\"We expected an upward 2018 guidance revision, but not of this magnitude,\" Jefferies analyst Jeffrey Holford said in a client note.\nAbbVie said it expects the adjusted effective tax rate will increase to 13 percent over the next five years due to higher domestic income and investment.\nThe company's aggressive patent strategy to fend off competition for Humira, its prized moneymaker, continued to pay off.\nThe autoimmune drug that has been in the market for almost 15 years raked in $4.89 billion in the fourth quarter, beating consensus sales estimates of $4.83 billion, according to brokerage Evercore ISI. It was not clear how many analysts were polled.\nThe drugmaker said it expected revenue of about $32 billion in 2018, beating the average analyst estimate of $31.04 billion.\nHumira, which is used to treat psoriasis and rheumatoid arthritis, is expected to dominate the U.S. market and remain unrivaled until 2023. In October, the company forecast sales of Humira to touch $21 billion by 2020.\nAbbVie's efforts to boost its cancer drug pipeline by expanding the use of Imbruvica, which accounted for about 9 percent of its revenue in 2017, could be a focus in 2018, analysts said.\nImbruvica earned $708 million in sales, narrowly missing Evercore ISI consensus estimates by $1 million.\nNet income attributable to AbbVie fell to $52 million, or 3 cents per share, in the quarter ended Dec. 31, from $1.39 billion, or 85 cents per share, a year earlier. The drugmaker took a $1.14 billion income tax charges in the quarter.\nExcluding items, AbbVie earned $1.48 per share.\nNet revenue in the quarter rose nearly 14 percent to $7.74 billion. Analysts on average were expecting a profit of $1.44 per share on revenue of $7.53 billion, according to Thomson Reuters I/B/E/S.\nAbbVie also said it planned to invest about $2.5 billion over the next five years in capital projects and would consider expanding facilities in the United States.", "external_links": [], "published": "2018-01-26T17:19:00.000+02:00", "crawled": "2018-01-26T17:19:30.000+02:00", "highlightTitle": ""}