{"organizations": [], "uuid": "6f4ad04df30cff228f39e297a3d9bdbf4ed5a44a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226566192&w=1200&r=LYNXMPEE0T0L8", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/uk-markets-britain-sterling/sterling-slips-to-a-one-week-low-amid-brexit-worries-idUSKBN1FJ1B6", "country": "US", "domain_rank": 408, "title": "Sterling slips to a one-week low amid Brexit worries", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:44:00.000+02:00", "replies_count": 0, "uuid": "6f4ad04df30cff228f39e297a3d9bdbf4ed5a44a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-markets-britain-sterling/sterling-slips-to-a-one-week-low-amid-brexit-worries-idUSKBN1FJ1B6", "ord_in_thread": 0, "title": "Sterling slips to a one-week low amid Brexit worries", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Sterling fell to a one-week low against the dollar on Tuesday amid renewed worries about the impact of Brexit on the UK economy and the progress of talks to exit the European Union.\nThe pound initially fell below $1.40, a key level it has pushed past this month during a strong rally, after a leaked government analysis claimed Britain would be worse off after Brexit in every scenario.\nBritain is due to exit the EU on March 29, 2019, but there are deep divisions inside Prime Minister Theresa May’s government and party about what sort of relationship should replace 46 years of membership.\nThose divisions have worried sterling investors this week, especially with Britain signalling that there is more work to be done before it can agree a transition deal.\nSterling had recouped earlier losses by 1010 GMT and was down slightly at $1.4065 after official data showed growth in lending to consumers but the weakest mortgage approvals in nearly three months.\nAgainst the euro, sterling was down 0.2 percent at 88.12 pence per euro.\n“The bar to actively sell the pound on UK domestic news is high. We don’t see this as a correction for sterling but a reality check,” said Viraj Patel, London-based strategist at ING.\nPatel said broader dollar consolidation after a sell-off in the greenback last week had also weakened sterling on Tuesday.\nSome analysts said sterling had gotten ahead of itself in its recent rally given the difficult negotiations that remain before it can secure itself terms for departing the EU.\n“Everything is pointing towards tough negotiations and major disagreements within the British government,” Commerzbank analysts wrote in a note.\n“BoE Governor Mark Carney’s speech in front of Parliament is unlikely to change that today since he won’t sound hawkish due to the Brexit risks and therefore won’t give the market any justification for rate hike speculation. Accordingly, I remain cautious about Sterling.”\nThe British currency is now down around 2 percent from a post-Brexit referendum peak of $1.43 hit last week.\nReporting by Tommy Wilkes and Saikat Chatterjee; Editing by Abhinav Ramnarayan and Raissa Kasolowsky\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T18:44:00.000+02:00", "crawled": "2018-01-30T16:40:30.015+02:00", "highlightTitle": ""}