{"organizations": [], "uuid": "10d761e2e64ce0509926d9262ee06e2aa9ade6d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-davos-kenya-inequality/forget-davos-dandora-holds-key-to-inequality-activists-idUSKBN1FD2IM", "country": "US", "domain_rank": 408, "title": "Forget Davos; Dandora holds key to inequality - activists", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T01:35:00.000+02:00", "replies_count": 0, "uuid": "10d761e2e64ce0509926d9262ee06e2aa9ade6d5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-kenya-inequality/forget-davos-dandora-holds-key-to-inequality-activists-idUSKBN1FD2IM", "ord_in_thread": 0, "title": "Forget Davos; Dandora holds key to inequality - activists", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "dandora", "sentiment": "negative"}, {"name": "ben", "sentiment": "none"}], "locations": [{"name": "dandora", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "nairobi", "sentiment": "negative"}, {"name": "wef", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NAIROBI (Thomson Reuters Foundation) - As champagne and caviar wash down tough talk of world problems in Davos, the stench of rotten rubbish lingers over an alternative summit in Kenya aimed at tackling the chasm between rich and poor.\nWelcome to the Kenyan slum of Dandora: known for its fetid garbage mountain and - for this week only - playing host to campaigners who are fed up with top-table talk and say they see scant action at ground level where it matters most.\nThe annual World Economic Forum (WEF) in the plush Swiss ski resort of Davos brings together politicians and billionaires, corporates and celebrities for four days of summitry on the world’s most pressing issues - issues such as global inequality.\nBut despite celebrating its 48th annual meeting, the WEF has failed to curb the rising wealth gap, say activists, who are instead lobbying for change at their own rival events this week.\n“The WEF has continued to list inequality as one of the world’s major challenges, and the WEF itself says it isn’t getting any better. But also they have an interest in not fixing it,” said Ben Phillips, director of Global Inequality Alliance, a coalition of 150 charities and trade unions in 50 countries.\n“It’s very nice to go to a fancy gathering, and over caviar and champagne talk about why every child should go to school and why every mother deserves good health care. But those same bosses who lobby for corporate tax breaks are taking away money from countries that would go into health and education.”\nEighty-two percent of wealth generated last year went to the richest 1 percent of the global population, while the 3.7 billion people - who make up the poorest half of the world - saw no increase in their wealth, says the charity Oxfam.\nBillionaire wealth has risen by an annual average of 13 percent since 2010 – six times faster than the wages of ordinary workers, which has risen by a yearly average of 2.0 percent over the same period, according to an Oxfam report on Monday.\nA TALE OF TWO MOUNTAINS Phillips said communities in countries such as Kenya, South Africa, India, Pakistan, Indonesia and Mexico feel inequality will not be solved by the ‘Davos man’, but by ordinary people mobilizing for their rights.\nSo events - ranging from concerts to soccer matches, mass meals to marches - are taking place to help some of the world’s most marginalized understand their rights and demand action.\nLocated on the outskirts of eastern Nairobi, Dandora slum is a stark example of the inequalities faced by millions worldwide.\nEstablished in 1977 and partially funded by the World Bank, with the aim of offering a higher standard of housing, the area has become the Kenyan capital’s principal dumping ground.\nThe sprawling rubbish tip - which residents estimate is at least the size of three football fields - is a vast mountain, composed of everything from polythene bags and plastic bottles to soiled clothes, rotting food and animal faeces.\nIt is also one of the area’s key employers.\nFor many of Dandora’s thousands of residents eke out a living on the tip, collecting recyclable waste such as plastic bottles for a daily wage of about 200 Kenyan Shillings ($2).\nAmid the stench, 59-year-old Marita Saie squats by a dirty puddle, diligently washing a pile of polystyrene plates.\n“I manage to make 100 to 150 shillings in a day collecting things from the rubbish,” said Saie, who is the sole provider for her two grandchildren.\n“It’s not enough to cover everything like rent and food. Even when I am sick, I can’t afford to buy medicines, so I look for them in rubbish. I can’t change this life, it’s up to God.”\nTAX THE RICH Campaigners say despite Kenya’s stable economic growth averaging about 5.6 percent of GDP over the last decade, the disparity between rich and poor is on the rise.\nThe number of super-rich in Kenya is among the fastest growing in the world, and Oxfam predicts the number of millionaires in Kenya will grow by 80 percent over next decade.\nYet while a minority of Kenyans are accumulating wealth, the benefits of economic growth have not trickled down.\nThe United Nations says four in 10 Kenyans are poor, 13 percent are “destitute”.\nBut such inequality is not inevitable, say campaigners.\nHigher spending on education and health would help close the gap, they say - and having a fair tax system is key.\nKenya relies on tax as its main source of domestic revenue, but contributions by the rich are negligible, said Oxfam. Capital gains tax, for example, is 5 percent and there is no inheritance tax or net wealth tax.\nHigher taxes could let the government invest more in sectors such as health, education and job creation, activists say.\nAnd grassroots movements - where ordinary people understand the issues and can organize and lobby to change government policies - are the best way to achieve this, they say.\nRAP FOR CHANGE So campaigners in Nairobi are organizing the Usawa Festival, or Equality Festival, in Dandora on Saturday, with music and dance deployed to highlight social problems and engage people.\nJuliani, a popular Kenyan hip-hop gospel musician - who raps on poverty, gender and unemployment and was born and raised in Dandora - said the aim was to shake people out of complacency.\n“There is a lot of imbalance in our communities. The quality of life they are living is not what it should be,” the 33-year-old dreadlocked star said beside the heap of squalor.\n“People here think this is a curse from God or because they are not working hard enough. They have become comfortable with the injustice. So we want to make them see it doesn’t have to be like this, and their lives are supposed to be way better.”\nReporting by Nita Bhalla @nitabhalla, Editing by Lyndsay Griffiths. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T01:35:00.000+02:00", "crawled": "2018-01-24T21:25:54.018+02:00", "highlightTitle": ""}