{"organizations": [], "uuid": "bc8619563236e32c562d636231e86d559f735fe8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1224974640&w=1200&r=LYNXMPEE0O00M", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-worldcup-australia-van-marwijk/world-class-van-marwijk-to-coach-australia-at-world-cup-idUKKBN1FE01N", "country": "US", "domain_rank": 408, "title": "'World class' Van Marwijk to coach Australia at World Cup", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T02:26:00.000+02:00", "replies_count": 0, "uuid": "bc8619563236e32c562d636231e86d559f735fe8"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-worldcup-australia-van-marwijk/world-class-van-marwijk-to-coach-australia-at-world-cup-idUKKBN1FE01N", "ord_in_thread": 0, "title": "'World class' Van Marwijk to coach Australia at World Cup", "locations": [], "entities": {"persons": [{"name": "van marwijk", "sentiment": "negative"}, {"name": "bert van marwijk", "sentiment": "none"}, {"name": "bert van marwijk", "sentiment": "none"}, {"name": "ange postecoglou", "sentiment": "none"}, {"name": "stephen lowy", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "football federation australia", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "ffa", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "socceroos", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 12:31 AM / Updated 14 minutes ago Australia go Dutch for World Cup with van Marwijk appointment Nick Mulvenney 3 Min Read \nSYDNEY (Reuters) - Bert van Marwijk, who led his native Netherlands to the 2010 World Cup final, will coach Australia at this year’s tournament in Russia, Football Federation Australia (FFA) said on Thursday. \nThe 65-year-old most recently guided Saudi Arabia to World Cup qualification for the first time since 2006 and has coached club sides Feyenoord, Borussia Dortmund and SV Hamburg in addition to his four-year spell as Netherlands boss. \nHe fell out with the Saudis after qualification and replaces Ange Postecoglou, who took Australia to their 2015 Asian Cup triumph but stood down for personal reasons after seeing the Socceroos through two playoffs to qualify for Russia. \n“This is a great result for Australian football, Bert van Marwijk is world class,” FFA chief Stephen Lowy said in a statement. \n”He took the Netherlands to the World Cup final in 2010, he led the Saudi Arabian team to qualify directly for this year’s Finals and most importantly, he knows a lot about our team and how they play because he studied them closely as an opposition manager in the same group. \n“These experiences make him a compelling choice.” \nAustralian Postecoglou took up the post ahead of the 2014 World Cup in Brazil on a wave of nationalism in national coaching appointments but in Van Marwijk, the FFA have reverted to the Dutch leadership they enjoyed in 2006 and 2010. \nGuus Hiddink led the Socceroos to the knockout round in Germany 12 years ago, while Pim Verbeek was in charge when Australia played in South Africa four years later. \nAustralia’s Asian Cup defence takes place in the United Arab Emirates next January but van Marwijk’s appointment is for the World Cup only and a permanent replacement for Postecoglou will be announced “in the near future”, the FFA said. \nVan Marwijk inherits a team that struggled at times during the qualification campaign and is still heavily reliant on the goals of Tim Cahill, who turned 38 last month. \n“I know a lot about the players and how the team has been playing after coaching against them for the two World Cup qualifiers, in 2016 and in June last year,” Van Marwijk said in a statement. \n“I have also been impressed by the national team set-up that the FFA has developed over the past few years. We are not going to Russia just to be competitive. I want to win our matches.” \nAustralia will play France, Denmark and Peru in the pool stage at the June 14 to July 15 finals, their fourth successive appearance at the World Cup. Reporting by Nick Mulvenney; Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-25T02:26:00.000+02:00", "crawled": "2018-01-25T02:49:02.025+02:00", "highlightTitle": ""}