{"organizations": [], "uuid": "0921db26742134524123007b40e6d0befd438058", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/oman-budget/update-1-oman-2018-state-budget-lifts-spending-little-to-reassure-rating-agencies-idUSL8N1OW0CA", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Oman 2018 state budget lifts spending; little to reassure rating agencies", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T22:45:00.000+02:00", "replies_count": 0, "uuid": "0921db26742134524123007b40e6d0befd438058"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/oman-budget/update-1-oman-2018-state-budget-lifts-spending-little-to-reassure-rating-agencies-idUSL8N1OW0CA", "ord_in_thread": 0, "title": "UPDATE 1-Oman 2018 state budget lifts spending; little to reassure rating agencies", "locations": [], "entities": {"persons": [{"name": "andrew torchia", "sentiment": "negative"}, {"name": "sultan qaboos", "sentiment": "none"}], "locations": [{"name": "dubai", "sentiment": "none"}, {"name": "oman", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "finance ministry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details, analysis)\nBy Andrew Torchia\nDUBAI, Jan 1 (Reuters) - Oman’s state budget for 2018, approved by ruler Sultan Qaboos on Monday, boosts spending at the expense of running a large deficit, despite increasing concern among credit rating agencies about the health of the country’s finances.\nThe budget projects spending of 12.5 billion rials ($32.5 billion) this year, up from 11.7 billion in the original budget for 2017, local media Quote: d a Finance Ministry statement as saying.\nRevenue are projected at 9.5 billion rials, up from 8.7 billion in the 2017 budget. That leaves a planned deficit of 3 billion rials this year, the same as last year’s projected deficit.\nThe 2018 budget assumes an average oil price of $50 per barrel, up from an assumption of $45 for 2017. The Brent oil price is now above $65, so Oman’s revenue is likely to be significantly higher than expected if oil prices stay flat.\nNevertheless, the budget projects a deficit of 10 percent of gross domestic product in 2018, well above levels which economists consider sustainable in the long run and higher than 12 percent planned for 2017.\nThe finance ministry said on Monday that it needed to continue raising expenditure to boost economic growth and living standards, while building social housing and providing other assistance to lower-income citizens.\nWith smaller oil and financial reserves than its wealthy neighbours, Oman has been spending heavily on industrial and infrastructure projects in an attempt to diversify its economy beyond oil exports.\nThat strategy has not reassured rating agencies. Last month, Fitch Ratings cut Oman by one notch to BBB-minus - just above junk territory - with a negative outlook, citing the budget deficit. Standard & Poor’s already rates Omani debt as junk.\nOf the projected 3 billion rial deficit in 2018, 500 million rials is to be covered by withdrawals from financial reserves and the rest through external and domestic borrowing.\nOman’s actual state budget deficit for the first 10 months of 2017 narrowed to 3.20 billion rials from 4.81 billion rials a year earlier, the latest finance ministry data showed.\nFinance ministry sources told local media last week that Oman would delay the introduction of a 5 percent value-added tax until 2019, instead of imposing it in 2018 as originally planned, to give tax administrators and companies more time to prepare. However, Oman will impose a new tax on sugary drinks and tobacco products by mid-2018.\nThe ministry said on Monday that it would proceed with a privatisation programme and was working to sell some state companies in 2018.\nThe government announced several years ago that it would launch a major privatisation scheme but there has been little progress since. (Reporting by Andrew Torchia; editing by Alison Williams and Jason Neely)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-01T22:45:00.000+02:00", "crawled": "2018-01-01T17:11:21.002+02:00", "highlightTitle": ""}