{"organizations": [], "uuid": "4bbda7acf20bfadf6a0b07d7f864c98aa10c25b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews/", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-avaya-trading-first-day/u-s-enterprise-telecoms-firm-avaya-trades-again-after-bankruptcy-idUSKBN1F633O", "country": "US", "domain_rank": 408, "title": "U.S. enterprise telecoms firm Avaya trades again after bankruptcy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:55:00.000+02:00", "replies_count": 0, "uuid": "4bbda7acf20bfadf6a0b07d7f864c98aa10c25b8"}, "author": "", "url": "https://www.reuters.com/article/us-avaya-trading-first-day/u-s-enterprise-telecoms-firm-avaya-trades-again-after-bankruptcy-idUSKBN1F633O", "ord_in_thread": 0, "title": "U.S. enterprise telecoms firm Avaya trades again after bankruptcy", "locations": [], "entities": {"persons": [{"name": "lian", "sentiment": "negative"}, {"name": "b. baker", "sentiment": "none"}, {"name": "jim chirico", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "avaya", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "avaya holdings corp", "sentiment": "none"}, {"name": "tpg capital lp", "sentiment": "none"}, {"name": "silver lake partners lp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Avaya Holdings Corp shares started trading on Wednesday on the New York Stock Exchange, the first time the enterprise telecommunications provider has been public in more than a decade.\nShares ended down 0.9 percent at $20.80.\nAvaya spent the past year sorting its financials in a Chapter 11 bankruptcy process before listing its shares publicly this week. It was acquired in a leveraged buyout in 2007 for $8.2 billion by Silver Lake Partners LP and TPG Capital LP.\nWhen Avaya was under the strain of its former debt pile, “it was like driving a car with the parking break on,” Chief Executive Jim Chirico said.\nOne new challenge for Avaya, which now has a market capitalization of about $2.2 billion, as well as $2.9 billion in debt, will be attracting a new set of shareholders after being private for so long. It converted its debt to equity in order to list its shares.\n“With the debt converting to equity, I would imagine we would transition over the next few months to new value equity shareholders,” Chirico said in an interview.\nChirico, a longtime Avaya executive who was named CEO last October, brought in a new management team, formed a dedicated cloud software unit and increased spending on research and development. The company hired Mercer Rowe, a former IBM executive, as well as a new chief financial officer, Patrick O‘Malley, from Seagate Technology Plc in recent months.\n“We are going to have an execution focus that we haven’t had at the company before,” Chirico said.\nThe Silicon Valley-based company, which was spun off from Lucent Technologies Inc in 2000, is now in better financial health and said it had more than $300 million in annual cash flow.\n“What a lot of people don’t know is that we are a very profitable company,” Chirico said. “The competitors took their best shot while we were in Chapter 11, but we added customers and we’re stronger now that we’ve ever been.”\nChirico added that “our eyes are wide open” to do acquisitions as well.\nBefore Avaya entered its restructuring process, it explored a sale of its unit providing software to call centers for about $4 billion. When asked about whether the company would ever consider a sale of that unit again, Chirico said “it’s all about shareholder value” but added that the company is closely linked to its other main business line that provides telephone and cloud services to companies.\nReporting by Liana B. Baker; Editing by Susan Thomas\n ", "external_links": [], "published": "2018-01-18T00:55:00.000+02:00", "crawled": "2018-01-18T02:16:05.006+02:00", "highlightTitle": ""}