{"organizations": [], "uuid": "f571225d6bcf350150f158b6135e64b68f84ed91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF615_cmo_fe_SOC_20180130071510.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/cmo-today-madison-ave-prepares-for-super-bowl-nbcs-lack-wants-facebook-to-pay-media-agency-reviews-pick-up-pace-1517317594", "country": "US", "domain_rank": 387, "title": "CMO Today: Madison Ave Prepares for Super Bowl; NBC’s Lack Wants Facebook to Pay; Media Agency Reviews Pick Up Pace", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T16:13:00.000+02:00", "replies_count": 0, "uuid": "f571225d6bcf350150f158b6135e64b68f84ed91"}, "author": "Lara O’Reilly", "url": "https://www.wsj.com/articles/cmo-today-madison-ave-prepares-for-super-bowl-nbcs-lack-wants-facebook-to-pay-media-agency-reviews-pick-up-pace-1517317594", "ord_in_thread": 0, "title": "CMO Today: Madison Ave Prepares for Super Bowl; NBC’s Lack Wants Facebook to Pay; Media Agency Reviews Pick Up Pace", "locations": [], "entities": {"persons": [{"name": "arthur sadoun", "sentiment": "neutral"}, {"name": "clippy", "sentiment": "none"}, {"name": "satya nadella", "sentiment": "none"}, {"name": "dave", "sentiment": "none"}, {"name": "marcel", "sentiment": "none"}, {"name": "suzanne vranica", "sentiment": "none"}], "locations": [{"name": "cannes", "sentiment": "none"}, {"name": "grey new york", "sentiment": "none"}], "organizations": [{"name": "lack wants facebook", "sentiment": "negative"}, {"name": "media agency", "sentiment": "negative"}, {"name": "nbc", "sentiment": "negative"}, {"name": "publicis groupe", "sentiment": "neutral"}, {"name": "procter & gamble", "sentiment": "none"}, {"name": "publicis", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Good morning. When Publicis Groupe CEO Arthur Sadoun announced in Cannes that all his agencies would be skipping the big industry shows for a year so the company could instead invest in the development of AI platform “Marcel,” he promised he’d stay quiet about it for a year. But when you manage to convince Satya Nadella to appear in one of your promo videos , it’s hard not to boast: Publicis announced Monday it will partner with Microsoft to build the “professional assistant.” Here’s hoping Clippy isn’t making a comeback.\nI Know You Like To Think Your Bleep Don’t Stink With its huge live TV audiences, the Super Bowl remains one of the last mass media vehicles to launch a new product or lift a long-standing brand. But in the era of the outraged social media pile-on, Super Bowl ads are a riskier endeavor now , WSJ’s Suzanne Vranica reports. Take Procter & Gamble’s Febreze, for example, whose ad agency Grey New York set out to make the “cleanest poop joke of all time.” The ad you’ll see centers around an unassuming character called Dave who doesn’t need a bathroom air freshener because his “bleep don’t stink.” The ad you won’t see is a scene of a failed prank, where Dave and his pals leave a flaming bag of stink-free poop on a neighbor’s doorstep. Another Super Bowl ad destined for the cutting room floor was from Hyundai, which had planned an ad around women’s empowerment, but shifted gear partly over the criticism Audi received last year for its big game spot promoting gender pay equality. Hyundai will instead run an ad highlighting an initiative to fight pediatric cancer, which scored well with both men and women.\nMediapalooza Déjà Vu? If you’re a regular reader of the advertising trade press, you may have noticed that there are an awful lot of media agency reviews going on at the moment. Around $5 billion in media spend is up for grabs , Digiday reports. That might be a drop in the ocean compared to the estimated $20 billion to $30 billion put into play during the “Mediapalooza” of 2015 , but let’s not forget that we’re not even into February yet. What’s different this time around, according to Digiday, is that this round of reviews isn’t just being driven by scrupulous procurement departments wanting to drive down costs (although, I’m sure the losing agencies will disagree), rather that marketers are seeking media investments that might be more expensive, but are proven to drive better business outcomes. We’re now in the era of the more confident marketer, who has become more clued in on how the media business works, emboldening them to ask questions about exactly how their budgets are spent and where their agencies and vendors are making money.\nLack Attack CMO Today’s Ben Mullin reports on Axios’s “Media, Fake News, and New Generation of Informed Citizens” panel at New York University Monday night : NBC News Chairman Andy Lack added his voice to the chorus of media executives calling on Facebook to pay news organizations for their content, as the publishing world tries to digest a series of significant changes to Facebook’s news feed algorithm. “I think the pros outweigh any cons,” Mr. Lack said of Rupert Murdoch’s proposal that news organizations be paid a cable TV-style carriage fee. (Mr. Murdoch is executive chairman of Wall Street Journal-parent News Corp.) “Facebook, in all of their dealings with professionals who are producing content — whether it’s on the entertainment side or the news side — but particularly on the news side — they don’t value that content,” Mr. Lack said. He added that Facebook is too busy jumping from initiative to initiative to cultivate a meaningful rapport with news outlets. “I think, unfortunately, [monetization] is not where they’re heading,” he said. (NBCUniversal, you’ll recall, has a significant investment in Snap.) Facebook has maintained that it values its publisher relationships, is working to root out fake news and makes feed changes with its users’ best interests in mind.\nI Read the News Today, Oh Boy Speaking of Facebook algorithm tweaks, it’s a day of the week that ends in “y,” so it must be time for another one. Facebook announced Monday it’s going to start prioritizing local news stories in the news feed . On the face of it, more exposure on Facebook seems like good news for small news outlets who have seen their advertising revenues decimated by the decline of their print circulations and online platforms that offer easy-to-use geographic ad targeting tools. In a Facebook post, Mark Zuckerberg says “local news is directly correlated with civic engagement.” There certainly seems to be a lot of “engagement” when I look at the volume of comments any time my hometown newspaper’s Facebook page links to an article about potholes or people not cleaning up after their dogs. But it’s hard to say whether those rants are the kind of “meaningful interactions” Facebook is yearning for. For marketers, as with the other recently-announced news feed changes, it’s probably best to adopt a “wait-and-see” approach before dramatically altering their Facebook strategies\nBest of the rest Sony asked Amazon whether it could serve ads during its “Jeopardy” Alexa game. Amazon refused, which reportedly frustrated Sony as it had taken on most of the cost of developing the Alexa “skill,” but wasn’t allowed to make revenue from it. Amazon is, however, testing subscription offers for premium app content. [ The Information ]\nData from Apple’s Podcasts Analytics feature and other sources suggests podcast listeners are highly engaged and rarely skip ads. [ Wired ]\nThe Grammy Awards drew their smallest TV audience since 2009. [ WSJ ]\nMeredith has named its chief operating officer, Tom Harty, as chief executive of the combined entity that will be formed when the media company completes its acquisition of Time Inc. [ WSJ ]\nContent recommendation services appear to be moving away from offering publishers guaranteed payments. Some publishers also appear to be driving the change, seeking revenue-share models. [ Digiday ]\nTwitter is launching “#BrandBowl52,” a competition that will award the advertisers that drive the most engagement on the platform around the Super Bowl. Users can also retweet a tweet from the @TwitterMKTG account to be notified when new spots air during the big game. [ Twitter Blog ]\nAbout Us Follow us on Twitter: @wsjCMO , @larakiara , @VranicaWSJ , @alexbruell , @BenMullin , @srabil , @asharma\nSubscribe to our morning newsletter, delivered straight to your inbox, at http://on.wsj.com/CMOTodaySignup .\nWrite to Lara O’Reilly at lara.oreilly@wsj.com", "external_links": ["http://www.adweek.com/agencies/microsoft-partners-with-publicis-to-develop-global-ai-platform-marcel/", "https://blog.twitter.com/marketing/en_us/topics/events/2018/Twitter-Invites-Brands-to-Compete-in-First-Ever-BrandBowl.html", "https://www.wired.com/story/apple-podcast-analytics-first-month/", "https://www.nyu.edu/social-entrepreneurship/events/live-stream", "http://www.youtube.com/watch?v=XS_l99qzvRk", "https://twitter.com/VranicaWSJ", "http://www.adweek.com/digital/local-news-facebook-news-feed-algorithm/", "https://twitter.com/asharma", "https://twitter.com/larakiara", "https://digiday.com/marketing/ad-quality-rises-top-agenda-media-agency-reviews/", "https://twitter.com/wsjCMO", "https://twitter.com/srabil", "https://twitter.com/alexbruell", "https://twitter.com/BenMullin", "https://www.theinformation.com/articles/amazon-says-no-to-ads-on-alexa-frustrating-sony", "https://digiday.com/media/shift-publishers-can-no-longer-count-content-recommendation-guarantee-checks/"], "published": "2018-01-30T16:13:00.000+02:00", "crawled": "2018-01-30T19:17:38.009+02:00", "highlightTitle": ""}