{"organizations": [], "uuid": "4fd7bda92e745e20cc9a9d2bcb3cd381480465f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225245034&w=1200&r=LYNXMPEE0O1D2", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/usa-britain-trump/u-s-president-trump-plans-to-visit-britain-this-year-idINKBN1FE2IW", "country": "US", "domain_rank": 408, "title": "U.S. President Trump plans to visit Britain this year", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T21:23:00.000+02:00", "replies_count": 0, "uuid": "4fd7bda92e745e20cc9a9d2bcb3cd381480465f6"}, "author": "", "url": "https://in.reuters.com/article/usa-britain-trump/u-s-president-trump-plans-to-visit-britain-this-year-idINKBN1FE2IW", "ord_in_thread": 0, "title": "U.S. President Trump plans to visit Britain this year", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "boeing co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bombardier", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Donald Trump and British Prime Minister Theresa May discussed finalising the details of the first visit by the U.S. president to Britain later this year after a meeting in Davos on Thursday, May’s office said.\nMore than a year into his presidency, Trump has yet to visit London and many British voters have promised that if he comes to Britain they would protest against a man they see as opposed to their values on a range of issues.\nTrump’s cancellation of a trip to Britain this month had raised questions in Britain over the relationship between Washington and its traditionally closest ally in Europe.\nThe two leaders met at the World Economic Forum and they discussed Brexit, Iran, and worries that jobs could be lost at Canadian plane-maker Bombardier’s ( BBDb.TO ) factory in Northern Ireland due to a trade dispute with Boeing Co ( BA.N ).\n“The PM and president concluded by asking officials to work together on finalising the details of a visit by the president to the UK later this year,” according to a statement from May’s office.\nThe statement did not say whether it would be a normal visit or the state visit offered to Trump when May visited him in Washington shortly after his inauguration last year.\nBritain is keen to reinforce its “special relationship” with the United States as May’s government prepares to leave the European Union, a divorce that will shape the country’s standing in the world.\nU.S. President Donald Trump meets with Britain's Prime Minister Theresa May during the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 25, 2018 REUTERS/Carlos Barria Earlier this month, Trump cancelled a trip to London to open a new U.S. embassy in another sign of strained relations with one of the closest U.S. allies.\nTrump said he cancelled the visit because he did not want to endorse a bad deal agreed by the previous administration of Barack Obama to sell the old embassy in the upmarket Mayfair area for “peanuts”.\nMay was the first foreign leader to visit Trump after his inauguration last January and was filmed emerging from the White House holding hands, but a series of disagreement have since occurred.\nBritish officials have been dismayed by some of Trump’s pronouncements, particularly a proposed ban on Muslims entering the United States and most recently when Trump rebuked May on Twitter after she criticized him for retweeting British far-right anti-Islam videos.\nBefore the pair’s talks, May said Britain’s relationship with the United States is as strong as it ever has been.\nBut Jo Swinson, the deputy leader of Britain’s Liberal Democratic Party, predicted Trump’s arrival will prompt protests.\n“Trump is a dangerous, misogynistic racist and is deserving of the protests he will undoubtedly face,” she said.\nRelated Coverage U.S. Trump will probably visit Britain in second half of year - source Reporting By Andrew MacAskill; editing by Stephen Addison\n ", "external_links": [], "published": "2018-01-25T21:23:00.000+02:00", "crawled": "2018-01-25T21:56:46.012+02:00", "highlightTitle": ""}