{"organizations": [], "uuid": "729d66b8f2a5802389f42878df74bcab2608e9d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-cumulus-files-motion-to-reject-certain-uneconomic-contracts.html", "country": "US", "domain_rank": 767, "title": "Cumulus Files Motion to Reject Certain Uneconomic Contracts", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T02:15:00.000+02:00", "replies_count": 0, "uuid": "729d66b8f2a5802389f42878df74bcab2608e9d6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-cumulus-files-motion-to-reject-certain-uneconomic-contracts.html", "ord_in_thread": 0, "title": "Cumulus Files Motion to Reject Certain Uneconomic Contracts", "locations": [], "entities": {"persons": [{"name": "mary g. berner", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "cumulus media inc.", "sentiment": "neutral"}, {"name": "chicago bulls", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "chicago white sox", "sentiment": "none"}, {"name": "merlin media", "sentiment": "none"}, {"name": "united states bankruptcy court for the southern district of new york", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Cumulus Media Inc. (PINK:CMLSQ) (the “Company,” “we,” “us,” or “our”) today announced that it has filed motions with the United States Bankruptcy Court for the Southern District of New York requesting authority to reject a handful of extremely unprofitable contracts, including those with the Chicago White Sox and the Chicago Bulls. Cumulus is also seeking to reject its agreements with Merlin Media (“Merlin”), as the Company has determined that the legacy terms to acquire WKQX-FM and WLUP-FM in Chicago for approximately $50 million is significantly in excess of the stations’ market value. In total, the Company is seeking to reject fewer than 20 contracts out of more than 15,000 agreements. The Court is scheduled to rule on the Company’s motions at a hearing on February 1, 2018.\nMary G. Berner, President and Chief Executive Officer of Cumulus Media Inc., said, “As part of our operational turnaround, we have been focused on taking proactive steps to address unprofitable areas of our business. We are taking this action because the economic terms of these legacy contracts guarantee that we lose money and, as such, continuing them in their current form is not in Cumulus’s best interests. In many of these situations, we have been engaged in discussions with the counterparties to these agreements for months and have not been able to arrive at revised terms that work for both Cumulus and the counterparty. We will continue to take the necessary steps to strengthen our competitiveness and position Cumulus for continued profitability.”\nMs. Berner continued, “These contracts represent only a tiny fraction of the thousands of contracts that Cumulus has, and our relationships with the vast majority of our partners remain strong. We look forward to continuing to deliver premium content choices to the 245 million people we reach each week across our collection of stations and Westwood One affiliates.”\nAdditional information is available at www.cumulus.com/restructuring or by calling Cumulus’s Restructuring Hotline, toll-free in the U.S. at 1-844-429-1668. (For calls originating outside of the U.S., please dial 1-503-597-5529.) In addition, court filings and other documents related to the court-supervised proceedings are available on a separate website administered by Cumulus’s claims agent, Epiq, at http://dm.epiq11.com/cumulus .\nPaul, Weiss, Rifkind, Wharton & Garrison LLP is acting as legal counsel, PJT Partners, Inc. is acting as financial advisor to Cumulus, and Alvarez & Marsal is serving as restructuring advisor.\nAbout Cumulus Media\nA leader in the radio broadcasting industry, Cumulus Media (PINK:CMLSQ) combines high-quality local programming with iconic, nationally syndicated media, sports and entertainment brands to deliver premium content choices to the 245 million people reached each week through its 446 owned-and-operated stations broadcasting in 90 U.S. media markets (including eight of the top 10), approximately 8,000 broadcast radio stations affiliated with its Westwood One network and numerous digital channels. Together, the Cumulus/Westwood One platforms make Cumulus Media one of the few media companies that can provide advertisers with national reach and local impact. Cumulus/Westwood One is the exclusive radio broadcast partner to some of the largest brands in sports, entertainment, news, and talk, including the NFL, the NCAA, the Masters, the Olympics, the GRAMMYs, the Academy of Country Music Awards, the American Music Awards, the Billboard Music Awards, Westwood One News, and more. Additionally, it is the nation's leading provider of country music and lifestyle content through its NASH brand, which serves country fans nationwide through radio programming, exclusive digital content, and live events. For more information, visit www.cumulus.com .\nContact Information\nInvestor Relations\nCollin Jones\nCumulus Media, Inc.\n404-260-6600\nMedia Inquiries\nMichael Freitag / Aaron Palash / Andrew Squire\nJoele Frank, Wilkinson Brimmer Katcher\n212-355-4449\nSource: Cumulus Media Inc.", "external_links": ["http://dm.epiq11.com/cumulus", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2ee19a47-ecf9-4d59-a531-b9108a3b1711", "http://www.cumulus.com/restructuring"], "published": "2018-01-19T02:15:00.000+02:00", "crawled": "2018-01-19T05:30:24.012+02:00", "highlightTitle": ""}