{"organizations": [], "uuid": "4016e613b9bf70a683fd9f879bc6f2031180a571", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-jack-morton-worldwide-appoints-first-chief-people-officer.html", "country": "US", "domain_rank": 767, "title": "Jack Morton Worldwide Appoints First Chief People Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:00:00.000+02:00", "replies_count": 0, "uuid": "4016e613b9bf70a683fd9f879bc6f2031180a571"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-jack-morton-worldwide-appoints-first-chief-people-officer.html", "ord_in_thread": 0, "title": "Jack Morton Worldwide Appoints First Chief People Officer", "locations": [], "entities": {"persons": [{"name": "jack morton", "sentiment": "negative"}, {"name": "josh mccall", "sentiment": "none"}, {"name": "melissa rose", "sentiment": "none"}, {"name": "rose", "sentiment": "none"}, {"name": "hill holliday", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "anaqua", "sentiment": "none"}], "organizations": [{"name": "jack morton worldwide", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 9, 2018 /PRNewswire/ -- Jack Morton Worldwide , the global brand experience agency, announced today that Melissa Rose has joined the organization as its first Chief People Officer. In this role, Rose joins an established global HR team, where her primary objective is 'strategic people operations' – helping the agency continue to grow, retain and nurture its talent. The newly created role reflects the agency's continued commitment to its staff, which is critical to building on its success as a leading global brand experience agency. Rose will serve on the agency's executive leadership team reporting directly to the Chairman and CEO, Josh McCall, in Boston.\nRose brings over 20 years of experience in strategic human resources and business partnership at a global level and possesses extensive knowledge of the marketing industry and the agency business model. She previously held positions at Hill Holliday, ISM, Carat and iProspect. Most recently, she served as Vice President, Human Resources at Anaqua, a global intellectual property software company. At Anaqua, she built and led the HR capability, provided extensive leadership and career development and managed an evolving organization through a period of growth and transformation.\n\"Talent is critical to the success of our agency. It's the proof behind the promise of our brand. Investing in the future of our team is paramount to our business and the appointment of Melissa as our new Chief People Officer is testament to our efforts,\" said Josh McCall. \"Melissa's industry insight, combined with her infectious passion, energy and drive will be a tremendous asset to our business and clients.\"\n\"I'm thrilled to be a part of such a vibrant agency with a rich history and reputation as a great place to work. When I met Josh and the team, I knew this is where I wanted to be. My biggest priority is to work alongside leaders who truly appreciate and value their people,\" stated Melissa Rose. \"The opportunity to shape and advance employee retention, career progression, talent development, diversity and inclusion at Jack Morton is an exciting endeavor and true to the agency's commitment to its people and unique culture.\"\nRose graduated magna cum laude from the University of Vermont with a Bachelor's Degree in Psychology and holds professional affiliations with The Society for Human Resources Management, Babson's Center for Executive Education, and the Human Capital Institute. Rose lives west of Boston with her husband, Eric, and their children.\nAbout Jack Morton Worldwide\nJack Morton Worldwide is an award-winning global brand experience agency. We believe how brands act is more important than what they say; it's why we help brands 'Do something extraordinary'. For almost 80 years, we have worked with brands to provide the proof of their promises through event marketing, promotional marketing, digital, social and mobile, content marketing, sponsorship marketing and employee engagement. Jack Morton is part of the Interpublic Group of Companies, Inc. (NYSE: IPG). More information is available at www.jackmorton.com or @jackmorton.\nView original content: http://www.prnewswire.com/news-releases/jack-morton-worldwide-appoints-first-chief-people-officer-300579353.html\nSOURCE Jack Morton Worldwide", "external_links": ["http://www.jackmorton.com/", "http://www.prnewswire.com/news-releases/jack-morton-worldwide-appoints-first-chief-people-officer-300579353.html"], "published": "2018-01-09T17:00:00.000+02:00", "crawled": "2018-01-09T19:03:22.004+02:00", "highlightTitle": ""}