{"organizations": [], "uuid": "8ab3c64a1a393d718e9bcaa27ed816a20c42364f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-abaxis-reports-financial-performance-for-the-third-quarter-of-fiscal-2018-and-declares-quarterly-cash-dividend.html", "country": "US", "domain_rank": 767, "title": "Abaxis Reports Financial Performance for the Third Quarter of Fiscal 2018 and Declares Quarterly Cash Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.128, "site_type": "news", "published": "2018-01-26T00:01:00.000+02:00", "replies_count": 0, "uuid": "8ab3c64a1a393d718e9bcaa27ed816a20c42364f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-abaxis-reports-financial-performance-for-the-third-quarter-of-fiscal-2018-and-declares-quarterly-cash-dividend.html", "ord_in_thread": 0, "title": "Abaxis Reports Financial Performance for the Third Quarter of Fiscal 2018 and Declares Quarterly Cash Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "union city", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "abaxis reports financial performance", "sentiment": "negative"}, {"name": "abaxis, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UNION CITY, Calif., Jan. 25, 2018 /PRNewswire/ -- Abaxis, Inc. (Nasdaq: ABAX), a global diagnostics company manufacturing point-of-care blood analysis instruments and consumables for the medical and veterinary markets worldwide, today reported financial results for the third fiscal quarter ended December 31, 2017.\nThird quarter results include:\nRevenues of $59.7 million, up 13% over last year's comparable quarter. Diluted net income per share of $0.18, compared to $0.30 in last year's comparable quarter. Diluted net income per share for the third quarter of fiscal 2018 includes the effect of a one-time non-cash charge of $2.9 million as a result of the Tax Cuts and Jobs Act (\"TCJA\") enacted on December 22, 2017. Excluding the effect of this non-cash charge, non-GAAP diluted net income per share was $0.31 for the third quarter of fiscal 2018.\nRevenues highlights:\nMedical market revenues of $10.2 million, up 18% over last year's comparable quarter. Veterinary market revenues of $48.4 million, up 12% over last year's comparable quarter. Revenues from sales of consumables, which include reagent discs, hematology reagent kits, VSpro specialty cartridges, i-STAT cartridges, rapid tests and urinalysis tests, of $45.5 million, up 13% over last year's comparable quarter. Total medical and veterinary reagent disc revenues of $31.9 million, up 13% over last year's comparable quarter. Total medical and veterinary reagent disc sales of 2.6 million units, up 13% over last year's comparable quarter. Total medical and veterinary instrument revenues of $10.5 million, up 12% over last year's comparable quarter. Total medical and veterinary instrument sales of 2,836 units, compared to 1,385 units in last year's comparable quarter. North America revenues of $46.4 million, up 12% over last year's comparable quarter. International revenues of $13.2 million, up 18% over last year's comparable quarter.\nOther financial highlights:\nGross profit of $32.2 million, compared to $29.4 million, in last year's comparable quarter. Cash, cash equivalents and investments as of December 31, 2017 of $185.0 million. Abaxis paid dividends of $3.6 million, or $0.16 per share, during the third quarter of fiscal 2018.\nManagement Discussion\nClint Severson, chairman and chief executive officer of Abaxis, said, \"We are very pleased to achieve revenues of $59.7 million in the third quarter, an increase of 13% compared to the same period last year. Driven by a strong growth in instrument and consumable sales during the third quarter, revenues in our medical and veterinary market segments increased by 18% and 12%, respectively, compared to the same period last year. Year-over-year revenue growth of medical and veterinary reagent discs was 17% and 12%, respectively, in the third quarter, over the same period last year.\"\nMr. Severson continued, \"Our new VetScan UA, a urine chemistry analyzer, had a tremendous launch, as we sold over 1,300 instruments since its introduction in late September 2017. Additionally, during the third quarter of fiscal 2018, we placed over 100 units of the VetScan FUSE, a bi-directional connectivity system that provides integration between Abaxis point-of-care analyzers and veterinary practice management systems worldwide.\n\"We are excited about our outlook for the fourth quarter of fiscal 2018 based on our expectations for growth in the core business and several important new product launches. For example, we plan to launch our new urine sediment analyzer which targets a large veterinary market segment later this quarter. Furthermore, the USDA, Center for Veterinary Biologics, recently approved our VetScan FLEX4 Rapid Test, a combination test for heartworm, lyme, ehrlichia and anaplasma. We are excited to introduce and sell this product to veterinarians at the VMX conference in early February 2018.\"\nMr. Severson concluded, \"Looking to the future, we anticipate making additional investments in new product development. With our focus on innovation and an expanding field sales force we are optimistic about our future.\"\nDividend Declared\nAbaxis today announced that its Board of Directors declared a quarterly cash dividend of $0.16 per share of common stock, to be paid on March 15, 2018, to all shareholders of record as of the close of business on March 1, 2018.\nResults of Operations\nQuarterly Results\nFor the fiscal quarter ended December 31, 2017, Abaxis reported revenues of $59.7 million, as compared with revenues of $52.8 million for the comparable period last year. Revenues from sales of instruments, which include chemistry analyzers, hematology instruments, VSpro specialty analyzers, i‑STAT analyzers and urinalysis instruments, increased by $1.1 million, or 12%, compared to the same period last year. Revenues from sales of consumables, which include reagent discs, hematology reagent kits, VSpro specialty cartridges, i‑STAT cartridges, rapid tests and urinalysis tests, increased by $5.1 million, or 13%, over the same period last year.\nAbaxis reported income from continuing operations before income tax provision of $9.5 million and net income from continuing operations of $4.2 million for the fiscal quarter ended December 31, 2017, compared to $10.8 million and $6.9 million for the fiscal quarter ended December 31, 2016, respectively.\nAbaxis' effective tax rate in the fiscal quarter ended December 31, 2017 was 55%, compared to 36% for the same period last year. During the third quarter of fiscal 2018, Abaxis recorded a one-time non-cash charge of $2.9 million due to a reduction in deferred tax assets as a result of the reduction of the federal tax rate from 35% to 21% effective January 1, 2018.\nAbaxis reported diluted net income per share of $0.18 (calculated based on 23,044,000 shares) for the fiscal quarter ended December 31, 2017, compared to $0.30 per share (calculated based on 22,789,000 shares) for the same period last year. Excluding the effect of the non-cash charge of $2.9 million, non-GAAP diluted net income per share was $0.31 for the third quarter of fiscal 2018.\nNine-Month Results\nFor the nine-month period ended December 31, 2017, Abaxis reported revenues of $176.8 million, as compared with revenues of $169.0 million for the comparable period last year. Revenues from instruments sales decreased by $0.9 million, or 3%, compared to the same period last year. Revenues from consumables sales increased by $7.3 million, or 6%, over the same period last year.\nAbaxis reported income from continuing operations before income tax provision of $29.4 million and net income from continuing operations of $17.2 million for the nine-month period ended December 31, 2017, compared to $39.5 million and $25.2 million for the nine-month period ended December 31, 2016, respectively. Abaxis' effective tax rate in the nine-month period ended December 31, 2017 was 42%, compared to 36% for the same period last year. During the nine-month period ended December 31, 2017, Abaxis recorded a one-time non-cash charge of $2.9 million due to a reduction in deferred tax assets as a result of the reduction of the federal tax rate from 35% to 21% effective January 1, 2018.\nAbaxis reported diluted net income per share of $0.75 (calculated based on 23,021,000 shares) for the fiscal period ended December 31, 2017, compared to $1.11 per share (calculated based on 22,753,000 shares) for the same period last year. Excluding the effect of the non-cash charge of $2.9 million, non-GAAP diluted net income per share was $0.87 for the nine month period ended December 31, 2017.\nOther Reported Information\nNon-cash compensation expense recognized for share-based awards during the three months ended December 31, 2017 and 2016 was $3.6 million and $2.4 million, respectively. Abaxis paid $3.6 million in cash dividends to shareholders during the third quarter of fiscal 2018.\nFollowing the recent enactment of the TCJA on December 22, 2017, Abaxis expects its effective income tax rate to decline by 200 to 300 basis points in fiscal 2018 compared to fiscal 2017, excluding a one-time non-cash charge described above. Abaxis estimates its effective income tax rate in fiscal 2019 will be lower by 1,000 to 1,200 basis points compared to fiscal 2017. The actual impact of the TCJA on the Company's effective income tax rates may differ from the estimates due to changes in interpretations and assumptions made by the Company. The Company anticipates subsequent regulations associated with the TCJA will be forthcoming and will continue to analyze the tax legislation to determine the full effects of the new law on Abaxis' consolidated financial statements.\nConference Call\nAbaxis has scheduled a conference call to discuss its financial results at 4:15 p.m. Eastern Time on Thursday, January 25, 2018. Participants can dial (844) 855-9498 or (412) 317-5496 to access the conference call, or can listen via a live Internet webcast, which is available in the Investor Relations section of the company's website at http://www.abaxis.com . A replay of the call will be available by visiting http://www.abaxis.com for the next 30 days or by calling (877) 344-7529 or (412) 317-0088, confirmation code 10116166, through February 1, 2018. This press release is also available prior to and after the call via Abaxis' website or the Securities and Exchange Commission's website at http://www.sec.gov .\nAbout Abaxis\nAbaxis, Inc. is a worldwide developer, manufacturer and marketer of portable blood analysis systems that are used in a broad range of medical specialties in human or veterinary patient care to provide clinicians with rapid blood constituent measurements. Our mission is to improve the efficiency of care delivery to and the quality of life of patients in the medical and veterinary markets. We provide leading edge technology and tools that support best medical practices, enabling physicians and veterinarians to respond to the health needs of their clients at the point of care while operating economical and profitable practices. For more information, visit http://www.abaxis.com .\nNon-GAAP Financial Measure\nTo supplement the financial statements presented in accordance with accounting principles generally accepted in the United States of America (GAAP), Abaxis uses the non-GAAP financial measure of non-GAAP diluted net income per share. The presentation of this financial information is not intended to be considered in isolation or as a substitute for, or superior to, the financial information prepared and presented in accordance with GAAP. Abaxis defines non-GAAP diluted net income per share as net income per share on a diluted basis excluding from net income the one-time non-cash charge due to a reduction in deferred tax assets as a result of the TCJA enacted on December 22, 2017. Abaxis uses this non-GAAP financial measure for financial and operational decision making and as a means to evaluate period-to-period comparisons. Management believes that this non-GAAP financial measure provides meaningful supplemental information regarding Abaxis' performance and liquidity by excluding a one-time non-cash charge resulting from changes to tax laws, that may not be indicative of recurring core business operating results or operating performance. A reconciliation from GAAP net income and GAAP diluted net income per share to non-GAAP net income and non-GAAP diluted net income per share, respectively, has been provided in the financial statement tables included below in this press release.\nForward Looking Statements\nThis press release includes statements that constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 (the \"Reform Act\"), including but not limited to statements related to Abaxis' outlook for the fourth quarter of fiscal 2018, Abaxis' expected effective income tax rates in fiscal 2018 and fiscal 2019, the launch of Abaxis' urine sediment analyzer, estimated timing of introduction of the FLEX4 Rapid Test to the market, Abaxis' anticipated additional investments, further innovation and expansion of sales force and their impact on Abaxis' future and Abaxis' payment of quarterly dividends. Abaxis claims the protection of the safe-harbor for forward-looking statements contained in the Reform Act. These forward-looking statements are often characterized by the terms \"may,\" \"believes,\" \"projects,\" \"expects,\" \"anticipates,\" or words of similar import, and do not reflect historical facts. Forward-looking statements contained in this press release may be affected by risks and uncertainties that may cause actual results to differ materially from those projected or implied in such forward-looking statements, including, but not limited to, risks and uncertainties related to Abaxis' manufacturing operations, including the vulnerability of its manufacturing operations to potential interruptions and delays and its ability to manufacture products free of defects, Abaxis' ability to compete effectively, market acceptance of Abaxis' products, fluctuations in quarterly operating results and difficulty in predicting future results, the performance of Abaxis' independent distributors and Abaxis' ability to manage their inventory levels effectively, expansion of Abaxis' sales and marketing and distribution efforts, Abaxis' dependence on Abbott Point of Care, Inc. for its U.S. medical sales, dependence on sole or limited source suppliers, the effect of exchange rate fluctuations on international operations, dependence on key personnel, risks related to the protection of Abaxis' intellectual property or claims of infringement of intellectual property asserted by third parties. Readers should also refer to the section entitled \"Risk Factors\" in Abaxis' Annual Report on Form 10-K, and subsequently filed quarterly reports on Form 10-Q filed with the United States Securities and Exchange Commission. Forward-looking statements speak only as of the date the statements were made. Abaxis does not undertake and specifically disclaims any obligation to update any forward-looking statements.\nFinancial Tables to Follow\nABAXIS, INC.\nCondensed Consolidated Statements of Income\n(Unaudited)\n(In thousands, except per share data)\nThree Months Ended\nNine Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nRevenues\n$ 59,670\n$ 52,772\n$ 176,782\n$ 169,020\nCost of revenues\n27,494\n23,368\n80,501\n75,357\nGross profit\n32,176\n29,404\n96,281\n93,663\nOperating expenses:\nResearch and development\n5,165\n4,776\n17,672\n14,915\nSales and marketing\n13,657\n10,629\n38,642\n33,707\nGeneral and administrative\n4,777\n3,159\n13,494\n11,714\nTotal operating expenses\n23,599\n18,564\n69,808\n60,336\nIncome from operations\n8,577\n10,840\n26,473\n33,327\nInterest and other income (expense), net\n878\n(52)\n2,962\n6,197\nIncome from continuing operations before income tax provision\n9,455\n10,788\n29,435\n39,524\nIncome tax provision\n5,229\n3,929\n12,278\n14,288\nIncome from continuing operations\n4,226\n6,859\n17,157\n25,236\nDiscontinued operations\nLoss from discontinued operations, net of tax\n-\n(15)\n-\n(70)\nNet income\n$ 4,226\n$ 6,844\n$ 17,157\n$ 25,166\nNet income per share:\nBasic\nContinuing operations\n$ 0.19\n$ 0.30\n$ 0.76\n$ 1.12\nDiscontinued operations\n-\n-\n-\n-\nBasic net income per share\n$ 0.19\n$ 0.30\n$ 0.76\n$ 1.12\nDiluted\nContinuing operations\n$ 0.18\n$ 0.30\n$ 0.75\n$ 1.11\nDiscontinued operations\n-\n-\n-\n-\nDiluted net income per share\n$ 0.18\n$ 0.30\n$ 0.75\n$ 1.11\nShares used in the calculation of net income per share:\nWeighted average common shares outstanding - basic\n22,695\n22,535\n22,663\n22,508\nWeighted average common shares outstanding - diluted\n23,044\n22,789\n23,021\n22,753\nCash dividends declared per share\n$ 0.16\n$ 0.14\n$ 0.44\n$ 0.38\nABAXIS, INC.\nCondensed Consolidated Balance Sheets\n(Unaudited and in thousands)\nDecember 31,\nMarch 31,\n2017\n2017\nCurrent assets:\nCash and cash equivalents\n$ 71,902\n$ 91,332\nShort-term investments\n89,717\n51,561\nReceivables, net\n40,391\n40,568\nInventories\n42,498\n39,010\nPrepaid expenses and other current assets\n6,250\n4,997\nNet deferred tax assets, current\n-\n5,644\nCurrent assets of discontinued operations\n45\n66\nTotal current assets\n250,803\n233,178\nLong-term investments\n23,333\n22,171\nInvestment in unconsolidated affiliates\n2,732\n2,850\nProperty and equipment, net\n34,902\n34,260\nIntangible assets, net\n1,056\n1,171\nNet deferred tax assets, non-current\n7,489\n4,392\nOther assets\n9,224\n7,624\nTotal assets\n$ 329,539\n$ 305,646\nCurrent liabilities:\nAccounts payable\n$ 13,170\n$ 7,517\nAccrued payroll and related expenses\n10,285\n9,606\nAccrued taxes\n47\n2,151\nCurrent liabilities of discontinued operations\n50\n85\nOther accrued liabilities\n15,648\n11,006\nDeferred revenue\n1,054\n1,415\nWarranty reserve\n2,129\n1,663\nTotal current liabilities\n42,383\n33,443\nNon-current liabilities:\nDeferred revenue\n1,278\n1,460\nWarranty reserve\n2,864\n2,695\nNet deferred tax liabilities\n211\n234\nNotes payable, less current portion\n202\n278\nOther non-current liabilities\n1,544\n1,312\nTotal non-current liabilities\n6,099\n5,979\nTotal liabilities\n48,482\n39,422\nShareholders' equity:\nCommon stock\n143,640\n135,932\nRetained earnings\n137,481\n130,304\nAccumulated other comprehensive loss\n(64)\n(12)\nTotal shareholders' equity\n281,057\n266,224\nTotal liabilities and shareholders' equity\n$ 329,539\n$ 305,646\nRevenues by Geographic Region and Customer Group\n(Unaudited and in thousands)\nThe following table presents our revenues by source for the three and nine months ended December 31, 2017 and 2016.\nThree Months Ended\nNine Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nRevenues by Geographic Region\nNorth America\n$ 46,442\n$ 41,538\n$ 140,331\n$ 135,328\nInternational\n13,228\n11,234\n36,451\n33,692\nTotal revenues\n$ 59,670\n$ 52,772\n$ 176,782\n$ 169,020\nRevenues by Customer Group\nMedical Market\n$ 10,193\n$ 8,652\n$ 28,337\n$ 27,130\nVeterinary Market\n48,424\n43,198\n145,328\n139,219\nOther\n1,053\n922\n3,117\n2,671\nTotal revenues\n$ 59,670\n$ 52,772\n$ 176,782\n$ 169,020\nThe following table presents our calculation of non-GAAP net income and non-GAAP diluted net income per share to exclude a one-time non-cash charge of $2.9 million in the three and nine months ended December 31, 2017 due to a reduction in deferred tax assets as a result of the TCJA enacted on December 22, 2017.\nReconciliation from GAAP Net Income to Non-GAAP Net Income and GAAP Diluted Net Income Per Share to Non-GAAP Diluted Net Income Per Share\n(In thousands, except per share data)\n(Unaudited)\nThree Months Ended\nNine Months Ended\nDecember 31, 2017\nDecember 31, 2017\nGAAP\nNon-GAAP\nGAAP\nNon-GAAP\nResults\nAdjustments (1)\nResults\nResults\nAdjustments (1)\nResults\nIncome from continuing operations before income tax provision\n$ 9,455\n$ -\n$ 9,455\n$ 29,435\n$ -\n$ 29,435\nIncome tax provision\n5,229\n(2,939)\n2,290\n12,278\n(2,939)\n9,339\nIncome from continuing operations\n4,226\n2,939\n7,165\n17,157\n2,939\n20,096\nDiscontinued operations\nLoss from discontinued operations, net of tax\n-\n-\n-\n-\n-\n-\nNet income\n$ 4,226\n$ 2,939\n$ 7,165\n$ 17,157\n$ 2,939\n$ 20,096\nNet income per share:\nBasic\nContinuing operations\n$ 0.19\n$ 0.32\n$ 0.76\n$ 0.89\nDiscontinued operations\n-\n-\n-\n-\nBasic net income per share\n$ 0.19\n$ 0.32\n$ 0.76\n$ 0.89\nDiluted\nContinuing operations\n$ 0.18\n$ 0.31\n$ 0.75\n$ 0.87\nDiscontinued operations\n-\n-\n-\n-\nDiluted net income per share\n$ 0.18\n$ 0.31\n$ 0.75\n$ 0.87\nShares used in the calculation of net income per share:\nWeighted average common shares outstanding - basic\n22,695\n22,695\n22,663\n22,663\nWeighted average common shares outstanding - diluted\n23,044\n23,044\n23,021\n23,021\n(1)\nTo exclude the effect of a one-time non-cash charge of $2.9 million in the three and nine months ended December 31, 2017 due to a reduction in deferred tax assets as a result of the TCJA enacted on December 22, 2017.\nView original content: http://www.prnewswire.com/news-releases/abaxis-reports-financial-performance-for-the-third-quarter-of-fiscal-2018-and-declares-quarterly-cash-dividend-300588102.html\nSOURCE Abaxis, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/abaxis-reports-financial-performance-for-the-third-quarter-of-fiscal-2018-and-declares-quarterly-cash-dividend-300588102.html", "http://www.sec.gov/", "http://www.abaxis.com/"], "published": "2018-01-26T00:01:00.000+02:00", "crawled": "2018-01-26T02:04:47.011+02:00", "highlightTitle": ""}