{"organizations": [], "uuid": "39396734a36141d36862e9b9167b3585f6bad41c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-nuvectraa-announces-preliminary-unaudited-fourth-quarter-and-full-year-2017-revenue.html", "country": "US", "domain_rank": 767, "title": "Nuvectra™ Announces Preliminary Unaudited Fourth Quarter and Full Year 2017 Revenue", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "39396734a36141d36862e9b9167b3585f6bad41c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-nuvectraa-announces-preliminary-unaudited-fourth-quarter-and-full-year-2017-revenue.html", "ord_in_thread": 0, "title": "Nuvectra™ Announces Preliminary Unaudited Fourth Quarter and Full Year 2017 Revenue", "locations": [], "entities": {"persons": [{"name": "algovita", "sentiment": "none"}, {"name": "nuvectra", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "plano", "sentiment": "none"}], "organizations": [{"name": "nuvectra corporation", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PLANO, Texas, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Nuvectra Corporation (NASDAQ:NVTR), a neurostimulation medical device company, today announced preliminary unaudited revenue for the fourth quarter and full year ended December 31, 2017.\nPreliminary unaudited fourth quarter consolidated revenue is expected to be in the range of $11.5 to $12.0 million, compared to $4.2 million in the fourth quarter of 2016. Preliminary unaudited Algovita revenue for the fourth quarter of 2017 is expected to be in the range of $10.0 to $10.5 million, compared to $2.0 million in the fourth quarter of 2016.\nNuvectra’s preliminary unaudited full year 2017 consolidated revenue is expected to be in the range of $31.5 to $32.0 million, compared to $12.5 million for full year 2016.\nThe preliminary unaudited revenue results included in this press release are prior to the completion of review and audit procedures by the Company’s independent registered public accounting firm and are therefore subject to adjustment. The Company plans to release its fourth quarter and full year 2017 financial results in early March 2018.\nAbout Nuvectra Corporation\nNuvectra TM is a neurostimulation company committed to helping physicians improve the lives of people with chronic conditions. The Algovita ® Spinal Cord Stimulation (SCS) System is our first commercial offering and is CE marked and FDA approved for the treatment of chronic intractable pain of the trunk and/or limbs. Our innovative technology platform also has capabilities under development to support other indications such as sacral neuromodulation (SNM) for the treatment of overactive bladder, and deep brain stimulation (DBS) for the treatment of Parkinson’s Disease. In addition, our NeuroNexus subsidiary designs, manufactures and markets leading-edge neural-interface technologies for the neuroscience clinical research market. Visit the Nuvectra website at www.nuvectramed.com .\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains \"forward-looking statements,\" including statements we make regarding the outlook for Nuvectra as an independent publicly-traded company. Forward-looking statements are based only on our current beliefs, expectations and assumptions regarding the future of our business, future plans and strategies, projections, anticipated events and trends, the economy and other future conditions, and therefore they are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict and may be outside of our control. Our actual performance may differ materially from those indicated in the forward-looking statements. Therefore, you should not rely on any of these forward-looking statements. Any forward-looking statement made by us is based only on information currently available to us and speaks only as of the date on which it is made. Important factors that could cause our actual results to differ materially from those indicated in the forward-looking statements include: (i) our ability to successfully commercialize Algovita and to develop, complete and commercialize enhancements or improvements to Algovita; (ii) our ability to successfully compete with our current SCS competitors and the ability of our U.S. sales representatives to successfully establish market share and acceptance of Algovita, (iii) the uncertainty of obtaining regulatory approvals in the United States and Europe for our Virtis SNM system, (iv) our ability to successfully launch and commercialize the Virtis SNM system if it receives regulatory approval (v) our ability to demonstrate the features, perceived benefits and capabilities of Algovita to physicians and patients in competition with similar products already well established and sold in the SCS market; (vi) our ability to anticipate and satisfy customer needs and preferences and to develop, introduce and commercialize new products or advancements and improvements to Algovita in order to successfully meet our customers’ expectations; (vii) the outcome of our development plans for our neurostimulation technology platform, including our ability to identify additional indications or conditions for which we may develop neurostimulation medical devices or therapies and seek regulatory approval thereof; (viii) our ability to identify business development and growth opportunities and to successfully execute on our strategy, including our ability to seek and develop strategic partnerships with third parties to, among other things, fund clinical and development costs for new product offerings; (ix) the performance by our development partners, including Aleva Neurotherapeutics, S.A., of their obligations under their agreements with us; (x) the scope of protection for our intellectual property rights covering Algovita and other products using our neurostimulation technology platform, along with any product enhancements or improvements; (xi) our ability to successfully build, attract and maintain an effective commercial infrastructure and qualified sales force in the United States; (xii) our compliance with all regulatory and legal requirements regarding implantable medical devices and interactions with healthcare professionals; (xiii) any supplier shortages related to Algovita or its components and any manufacturing disruptions which may impact our inventory supply as we expand our business, (xiv) any product recalls, or the receipt of any warning letters, mandatory corrections or fines from any governmental or regulatory agency; (xv) our ability to satisfy the conditions and covenants, including trailing six month revenue milestones, of our Credit Facility; and (xvi) our ability to raise capital through means other than or in addition to the Credit Facility should it become necessary to do so, through a public offering of our common stock, private equity or debt financings, strategic partnerships, or other sources. Please see the section entitled “Risk Factors” in Nuvectra’s Annual Report on Form 10-K and in our other quarterly and periodic filings for a description of these and other risks and uncertainties. We undertake no obligation to publicly update any forward-looking statement, whether written or oral, that may be made from time to time, whether as a result of new information, future developments or otherwise.\nCompany Contacts:\nNuvectra Corporation\nWalter Berger, COO & CFO\n(214) 474-3102\nwberger@nuvectramed.com\nInvestor Contacts:\nThe Ruth Group\nTram Bui / Brian Johnston\n(646) 536-7035 / 7028\ninvestors@nuvectramed.com\nSource:Nuvectra Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/70937a90-9e0b-4113-a69d-f5c3bf574ece", "https://www.globenewswire.com/Tracker?data=8NSlVGN2Nn3LCzwMzOXIWXvSMyavLzBzVY-tNcTB6oJ9s3jH8WLH5Ko3qgs2tNJ0cDp8ZVh4cq4-pNzsmxGhZLwZfaHQbCASaZkm_YgHo1s="], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:11:21.014+02:00", "highlightTitle": ""}