{"organizations": [], "uuid": "e89288038d9912fa5848b0f5a18b5d15dbfc65e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-albertsons-announces-closing-of-sale-of-49-percent-interest-in-casa-ley.html", "country": "US", "domain_rank": 767, "title": "Albertsons Announces Closing of Sale of 49% Interest in Casa Ley", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:56:00.000+02:00", "replies_count": 0, "uuid": "e89288038d9912fa5848b0f5a18b5d15dbfc65e3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-albertsons-announces-closing-of-sale-of-49-percent-interest-in-casa-ley.html", "ord_in_thread": 0, "title": "Albertsons Announces Closing of Sale of 49% Interest in Casa Ley", "locations": [], "entities": {"persons": [], "locations": [{"name": "casa ley boise", "sentiment": "none"}, {"name": "idaho", "sentiment": "none"}], "organizations": [{"name": "albertsons companies", "sentiment": "negative"}, {"name": "albertsons", "sentiment": "negative"}, {"name": "casa ley", "sentiment": "none"}, {"name": "safeway inc.", "sentiment": "none"}, {"name": "contingent value rights", "sentiment": "none"}, {"name": "casa ley cvr", "sentiment": "none"}, {"name": "safeway", "sentiment": "none"}, {"name": "casa ley cvrs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOISE, Idaho, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Albertsons Companies announced today that it has completed the sale of its 49% interest in Mexico-based food and general merchandise retailer Casa Ley, S.A. de C. V. (Casa Ley) for a purchase price of MEX$6,500,000,000 (approximately US$348.5 million).\nIn connection with the acquisition of Safeway by Albertsons on January 30, 2015, Albertsons acquired Safeway's interest in Casa Ley, and former holders of common stock of Safeway Inc. received Contingent Value Rights (the Casa Ley CVRs). The Casa Ley CVRs represent the right to receive certain net proceeds from a sale of the Safeway interest in Casa Ley by Albertsons. Based on a CVR Agreement entered into at the time of the Safeway acquisition, the amount of net proceeds to be distributed will be based on the gross proceeds from the sale of the Casa Ley interest less expenses, as agreed in the CVR Agreement. The net proceeds to be distributed to holders of the Casa Ley CVRs is estimated to be approximately US$0.92 per Casa Ley CVR.\nAlbertsons anticipates that the final distribution will be made by the paying agent in approximately four weeks. At that time, Albertsons will provide a communication to Casa Ley CVR holders of the final amount of the distribution, and the final amount will be posted on the Safeway Investor Relations website. The distribution will be the final distribution that will be made with respect to the Casa Ley CVRs.\nHolders of Casa Ley CVRs should consult their tax advisors as to the tax treatment of the Casa Ley CVRs and any distribution thereon. For tax reporting purposes, Safeway reported that the fair market value of each Casa Ley CVR at the time of the acquisition of Safeway by Albertsons was US$1.0149, based on a third-party valuation. This amount was reflected on Forms 1099-B issued by the paying agent to the Casa Ley CVR holders with respect to the merger consideration.\nOver the past three years, since the date the Casa Ley CVRs were issued and the date of the third-party valuation, the Mexican peso to U.S. dollar exchange rate has deteriorated more than 20%.\nToday’s announcement has no effect on the CVRs issued in connection with the merger with respect to the sale of Safeway’s former real estate development subsidiary, Property Development Centers (the PDC CVRs). Albertsons will provide more information on the PDC CVRs when it has more clarity on the amount and timing of distributions with respect to the PDC CVRs.\nAbout Albertsons Companies\nAlbertsons Companies is one of the largest food and drug retailers in the United States, with both a strong local presence and national scale. We operate stores across 35 states and the District of Columbia under 20 well-known banners including Albertsons, Safeway, Vons, Jewel-Osco, Shaw's, Acme, Tom Thumb, Randalls, United Supermarkets, Pavilions, Star Market, Haggen and Carrs, as well as meal kit company Plated based in New York City. Albertsons Companies is committed to helping people across the country live better lives by making a meaningful difference, neighborhood by neighborhood. In 2016 alone, along with the Albertsons Companies Foundation, the company gave nearly $300 million in food and financial support. These efforts helped millions of people in the areas of hunger relief, education, cancer research and treatment, programs for people with disabilities and veterans outreach.\nImportant Notice Regarding Forward-Looking Statements\nThis press release contains certain . Statements that are not historical facts, including statements about our perspectives and expectations, are forward looking statements. The words “expect,” “believe,” “estimate,” “intend,” “plan,” “anticipate” and similar expressions, when related to the Company and its subsidiaries, indicate . These statements reflect the current view of management and are subject to various risks and uncertainties. These statements are based on various assumptions and factors, including general economic, market, industry and operational factors. Any changes to these assumptions or factors may lead to practical results different from current expectations. Excessive reliance should not be placed on those statements. Forward-looking statements relate only to the date they were made, and the Company and its subsidiaries undertake no obligation to update to reflect events or circumstances after the date they were made.\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/041d1027-c6ca-47ed-bdf9-ce15c9467200\nMelissa Plaisance Albertsons Companies 925-226-5115 melissa.plaisance@albertsons.com\nSource: Albertsons Companies", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/041d1027-c6ca-47ed-bdf9-ce15c9467200/en", "http://www.globenewswire.com/NewsRoom/AttachmentNg/041d1027-c6ca-47ed-bdf9-ce15c9467200", "https://www.globenewswire.com/Tracker?data=ahnr2-qh3Jh9o17rrZyNI9sZhBsgXXOLeazhoWgHERZqh-jnBFW6qRz6L4d_Qsg-qsRZOsELh82o6-7ho1SK96uZfQTP2dNGzeiUmK_jqRJZr9mtVy6A7BO-mGogTwh7gaiXTBtTJDUHk_83ibFWZVqY8jqR7xqQbxt0A7LFNjs_BCNeD1gE1maLKdXDWR3yrnoK_FwqSTemedIZ0HNNPU_Q-UXkAre7hrCFa1g68TVLItA1B05Z0OAlMgLCY-dtcrH7fYfZhNa9RxeMZ_ygEw=="], "published": "2018-01-31T00:56:00.000+02:00", "crawled": "2018-01-31T02:14:04.000+02:00", "highlightTitle": ""}