{"organizations": [], "uuid": "f93210c8a0e791853bf9c49cc37a7fd5ab74e95f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/25/103893530-GettyImages-507890288.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/republicans-issue-criminal-referral-for-author-of-trump-dossier.html", "country": "US", "domain_rank": 767, "title": "Republicans issue criminal referral for author of Trump dossier", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-05T21:14:00.000+02:00", "replies_count": 0, "uuid": "f93210c8a0e791853bf9c49cc37a7fd5ab74e95f"}, "author": "Tucker Higgins", "url": "https://www.cnbc.com/2018/01/05/republicans-issue-criminal-referral-for-author-of-trump-dossier.html", "ord_in_thread": 0, "title": "Republicans issue criminal referral for author of Trump dossier", "locations": [], "entities": {"persons": [{"name": "charles grassley", "sentiment": "negative"}, {"name": "chuck grassley", "sentiment": "none"}, {"name": "grassley", "sentiment": "none"}, {"name": "christopher steele", "sentiment": "none"}, {"name": "lindsey graham", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "steele", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "r-iowa", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "justice department", "sentiment": "none"}, {"name": "senate judiciary committee", "sentiment": "none"}, {"name": "department of justice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Two influential Republican senators issued a criminal referral this week against Christopher Steele, the former British spy who authored the largely unverified \"Trump dossier.\"\nSen. Chuck Grassley, R-Iowa, and Sen. Lindsey Graham, R-S.C., referred Steele to the Department of Justice for allegedly making false statements to investigators. It was not immediately clear from the referral what Steele allegedly lied to investigators about.\nThe referral was made Thursday but revealed Friday. Democrats on the committee said they were not consulted.\nGrassley is the chairman of the Senate Judiciary Committee, which has been conducting an investigation running parallel to special counsel Robert Mueller's probe into Trump's alleged ties to Russia. \n\"I don't take lightly making a referral for criminal investigation. But, as I would with any credible evidence of a crime unearthed in the course of our investigations, I feel obliged to pass that information along to the Justice Department for appropriate review,\" Grassley said in a statement. \nAaron P. Bernstein | Reuters Senate Judiciary Committee Chairman Sen. Chuck Grassley (R-IA) and Sen. Lindsey Graham (R-SC). The statement notes that the referral \"is not intended to be an allegation of a crime.\"\nSen. Dianne Feinstein, D-Calif., the top Democrat on the Judiciary Committee, said the referral was an attempt to deflect attention from the committee's collusion investigation.\n\n\"I'll continue to stand strong against any efforts to undermine Special Counsel Mueller's investigation, as well as the ongoing congressional investigations. Getting to the bottom of what happened remains a top priority for me, as I hope it does for everyone on the Judiciary Committee,\" Feinstein said in a statement to NBC News. \n\nRepublicans allege the dossier, which was commissioned by research firm Fusion GPS, served as the basis of the federal investigation into the president's alleged ties to Russia. It has faced renewed criticism as conservatives have ramped up attacks on perceived bias within the Department of Justice.\nThe founders of Fusion GPS published an op-ed in The New York Times earlier this week, saying that congressional Republicans were \"chasing rabbits\" by investigating the firm .\nOn Thursday, federal Judge Richard Leon cast aside arguments from Fusion GPS that its banking records were irrelevant to the House Intelligence Committee's Russia investigation. Leon said the subpoena could \"reasonably produce information relevant\" to the committee's inquiry.\n\nOn Wednesday, House Intelligence Chairman Devin Nunes said he reached an agreement with the Department of Justice to secure information about the dossier. Nunes' committee has been seeking information about Steele's research for months. \nJoshua Levy, an attorney for Fusion GPS, took issue with the referral.\n\"Publicizing a criminal referral based on classified information raises serious questions about whether this letter is nothing more than another attempt to discredit government sources, in the midst of an ongoing criminal investigation,\" Levy told CNBC. \"We should all be skeptical in the extreme.\"", "external_links": [], "published": "2018-01-05T21:14:00.000+02:00", "crawled": "2018-01-05T21:32:52.015+02:00", "highlightTitle": ""}