{"organizations": [], "uuid": "4eb825e98ff96eef4b2e3ef0bf1ce83f55fe6e9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-gulf-qatar-emirates/uae-says-qatari-royal-leaves-after-claim-he-was-being-detained-idUSKBN1F30X0", "country": "US", "domain_rank": 408, "title": "UAE says Qatari royal leaves after claim he was being detained", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T22:14:00.000+02:00", "replies_count": 0, "uuid": "4eb825e98ff96eef4b2e3ef0bf1ce83f55fe6e9a"}, "author": "", "url": "https://www.reuters.com/article/us-gulf-qatar-emirates/uae-says-qatari-royal-leaves-after-claim-he-was-being-detained-idUSKBN1F30X0", "ord_in_thread": 0, "title": "UAE says Qatari royal leaves after claim he was being detained", "locations": [], "entities": {"persons": [{"name": "abdullah bin ali al-thani", "sentiment": "none"}, {"name": "sheikh mohammed bin zayed al-nahayan", "sentiment": "none"}, {"name": "mohammed", "sentiment": "none"}, {"name": "abdullah", "sentiment": "none"}, {"name": "abu dhabi", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "abu dhabi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "uae", "sentiment": "negative"}, {"name": "al jazeera", "sentiment": "none"}, {"name": "min read  dubai", "sentiment": "none"}, {"name": "abu dhabi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 8:15 PM / Updated 9 minutes ago UAE says Qatari royal leaves after claim he was being detained Reuters Staff 3 Min Read \nDUBAI (Reuters) - The United Arab Emirates said on Sunday that an exiled member of Qatar’s ruling family who had appeared in a video recording saying that he was being held against his will had left the UAE. \nSheikh Abdullah bin Ali al-Thani has emerged as a potential Qatari opposition figure after a row erupted last year between Qatar and some fellow Gulf Arab states, including the UAE and Saudi Arabia, over allegations that Qatar supports terrorism. Qatar denies the accusation. \nQatari media, including Al Jazeera television, carried a video on Sunday of the silver-bearded Sheikh Abdullah saying that he was being held against his will after coming to Abu Dhabi as a guest. \n“I am now in Abu Dhabi as a guest of Sheikh Mohammed, but actually not in the position of a guest but rather as a detainee,” Sheikh Abdullah said in the recording, apparently referring to Abu Dhabi Crown Prince Sheikh Mohammed bin Zayed al-Nahayan. \n“I just want to inform you that if anything happens to me, don’t blame Qatar,” he added. \nThe authenticity of the recording could not immediately be verified. \nA UAE Foreign Ministry official said Sheikh Abdullah had come to Abu Dhabi at his own request as a guest after the Qatari government placed restrictions on him. \n“He is free to move about and has expressed his desire to leave the state, all procedures were facilitated for him without any obstruction,” the official said in a statement carried by the UAE state news agency WAM, giving no details of his destination. \nThe official said the claim that Sheikh Abdullah was being held against his will was “lies”, and blamed Qatar. \nQatar said that the lack of contacts with Abu Dhabi made it difficult to be certain what had happened with Sheikh Abdullah, but that it was monitoring the situation. \n“In principle, the state of Qatar supports maintaining the legal rights of any individual and his family has the right to pursue all legal means to protect his rights,” the Foreign Ministry said in a statement. \nAli al-Naimi, editor of an online UAE news website who also heads the education department in the emirate of Abu Dhabi, said he had been informed by a reliable source in Abu Dhabi that Sheikh Abdullah had originally moved to the UAE capital, where he has family connections, at his own request, because he feared for his safety in Qatar. \nNaimi said he believed the recording had been fabricated by Qatar. \nSheikh Abdullah emerged as a potential opposition figure after the row over Qatar erupted last June, criticizing his cousins in Doha in interviews with Gulf media, and appearing in the company of Saudi officials. Reporting by Aziz El Yaakoubi and Sami Aboudi; Editing by Kevin Liffey", "external_links": [], "published": "2018-01-14T22:14:00.000+02:00", "crawled": "2018-01-14T22:35:50.014+02:00", "highlightTitle": ""}