{"organizations": [], "uuid": "86b426917f2e791400837736685d33a150873936", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-russia-chechnya-rights-arson/arson-attack-rips-through-office-of-russian-human-rights-group-idUSKBN1F60X8", "country": "US", "domain_rank": 408, "title": "Arson attack rips through office of Russian human rights group", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T11:00:00.000+02:00", "replies_count": 0, "uuid": "86b426917f2e791400837736685d33a150873936"}, "author": "", "url": "https://www.reuters.com/article/us-russia-chechnya-rights-arson/arson-attack-rips-through-office-of-russian-human-rights-group-idUSKBN1F60X8", "ord_in_thread": 0, "title": "Arson attack rips through office of Russian human rights group", "locations": [], "entities": {"persons": [{"name": "vladimir putin", "sentiment": "none"}, {"name": "oyub titiev", "sentiment": "none"}], "locations": [{"name": "nazran", "sentiment": "none"}, {"name": "chechnya", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "ingushetia", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuter", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - One of Russia’s biggest human rights groups said on Wednesday that one of its offices in southern Russia had been badly damaged in an overnight arson attack, an incident it said was part of a campaign to drive it from the region.\nPictures of the office of the group, Memorial, in Nazran, a town in the Russian region of Ingushetia which borders Chechnya, showed the blackened interior of an office strewn with fire-damaged debris.\nMemorial is under pressure in the Muslim-majority North Caucasus region after police in Chechnya detained the head of its office there this month and accused him of possessing a large quantity of cannabis, a crime punishable by up to 10 years in jail.\nConcerns about the case of the detained activist, Oyub Titiev, who has written to President Vladimir Putin saying that he was framed and that the police planted the drugs in his car, prompted the United States and Europe to call for his release.\nMemorial has angered authorities in Chechnya by reporting disappearances, torture and punitive house burnings there. Titiev’s predecessor, Natalia Estemirova, was kidnapped and shot dead in 2009. Ramzan Kadyrov, the head of Chechnya, has said allegations that Chechen authorities use illegal violence are false and invented to secure foreign grants.\nMemorial said it had captured some of the overnight arson attack on CCTV which showed two masked men breaking into its office with petrol cans and called on the authorities in Ingushetia to investigate the attack as an act of terrorism.\n“The work of Memorial’s representative office in Ingushetia is exclusively dedicated to human rights problems on the territory of Ingushetia and in no way linked to Chechnya,” Memorial said in a statement.\n“Nonetheless, it’s obvious to us that there is a link between the arson attack with those forces who are trying to destroy the work of Memorial in Chechnya and squeeze Memorial out of the entire North Caucasus region.”\nReporting by Andrew Osborn; Editing by Hugh Lawson\n ", "external_links": [], "published": "2018-01-17T11:00:00.000+02:00", "crawled": "2018-01-17T11:17:28.026+02:00", "highlightTitle": ""}