{"organizations": [], "uuid": "1c5d785383dcf583019d38fa24fa5a3fd4173213", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222007784&w=1200&r=LYNXMPEE0E00C", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-carillion-restructuring-labour/britains-labour-demands-answers-from-government-on-carillion-idUSKBN1F400X", "country": "US", "domain_rank": 408, "title": "Britain's Labour demands answers from government on Carillion", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T02:01:00.000+02:00", "replies_count": 0, "uuid": "1c5d785383dcf583019d38fa24fa5a3fd4173213"}, "author": "", "url": "https://www.reuters.com/article/us-carillion-restructuring-labour/britains-labour-demands-answers-from-government-on-carillion-idUSKBN1F400X", "ord_in_thread": 0, "title": "Britain's Labour demands answers from government on Carillion", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "none"}, {"name": "jon trickett", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "carillion", "sentiment": "none"}, {"name": "carillion reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Britain’s main opposition party called on the government on Monday to explain why it awarded Carillion ( CLLN.L ) contracts worth nearly 2 billion pounds ($2.75 billion) after the company had posted profit warnings.\nConstruction and services company Carillion, a major government supplier, has been in talks with creditors on a rescue plan, and ministers overseeing everything from justice to transport have been discussing how they should respond to the possible demise of the business.\nThe Labour Party’s Jon Trickett said he wanted to know what due diligence the government had undertaken after the company issued its first profit warning and whether plans were in place to protect workers.\n“Alarm bells have been ringing for over six months about the state of Carillion’s finances, so the government must come forward and answer questions on exactly what due diligence measures were undertaken before awarding contracts to Carillion worth billions of taxpayers’ money,” he said in a statement.\n“Labour urges the government to stand ready to intervene and bring these crucial public sector contracts back in-house. The government cannot outsource its responsibility and duty of care to these workers and vital public sector projects.”\nGovernment officials have said they are keeping a close eye on the business and have contingency plans in place.\nBut they have offered little detail and, on Saturday, Sky News said Carillion could enter administration unless the government backs a rescue plan - a headache that will stretch ministers trying to deliver Britain’s exit from the European Union.\nOne of many private companies to run public services in Britain, Carillion is fighting to survive after contract delays and a downturn in new business prompted profit warnings and a first-half loss of more than 1 billion pounds.\nThe company, which employs about 43,000 people, said on Friday that it was having “constructive discussions” with its creditors, rejecting suggestions that they did not like the plan put forward by the company.\nReporting by Elizabeth Piper; Editing by David Goodman\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-15T02:01:00.000+02:00", "crawled": "2018-01-15T02:34:20.005+02:00", "highlightTitle": ""}