{"organizations": [], "uuid": "f2933e1f349d25d5461d48361da0da6e7e4cbb3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223150246&w=1200&r=LYNXMPEE0H21H", "site_section": "http://feeds.reuters.com/reuters/UKDomesticNews/", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-santander-grg/british-lawmaker-points-to-santander-uk-chief-in-scandal-over-rbs-restructuring-unit-idUKKBN1F734M", "country": "US", "domain_rank": 408, "title": "British lawmaker points to Santander UK chief in scandal over RBS restructuring unit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:47:00.000+02:00", "replies_count": 0, "uuid": "f2933e1f349d25d5461d48361da0da6e7e4cbb3a"}, "author": "", "url": "https://uk.reuters.com/article/uk-santander-grg/british-lawmaker-points-to-santander-uk-chief-in-scandal-over-rbs-restructuring-unit-idUKKBN1F734M", "ord_in_thread": 0, "title": "British lawmaker points to Santander UK chief in scandal over RBS restructuring unit", "locations": [], "entities": {"persons": [{"name": "vince cable", "sentiment": "none"}, {"name": "emma rumney", "sentiment": "none"}, {"name": "nathan bostock", "sentiment": "none"}], "locations": [{"name": "santander uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "rbs", "sentiment": "negative"}, {"name": "santander uk", "sentiment": "negative"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "global restructuring group", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 9:48 PM / Updated 20 minutes ago British lawmaker points to Santander UK chief in scandal over RBS restructuring unit Emma Rumney 3 Min Read \nLONDON (Reuters) - A British lawmaker on Thursday put the boss of Santander UK at the centre of a growing political storm over the Royal Bank of Scotland’s (RBS) treatment of small businesses during and after the financial crisis. \nVince Cable, leader of the Liberal Democrats, said in a parliamentary debate that Nathan Bostock, who held a number of senior roles at RBS including that of head of restructuring and risk, bore some responsibility for the conduct of the bank’s Global Restructuring Group (GRG). \nThe unit handled some 12,000 struggling firms between 2007 and 2012, and accusations that it pushed some into bankruptcy to pick up their assets on the cheap have dogged the bank’s efforts to reform its image a decade on from the financial crisis. \nThe Financial Conduct Authority has pointed to numerous failings at RBS but stopped short of upholding the most serious allegations. A report by the regulator into the matter has never been published in full. \nCable said the full report concluded that RBS management “knew, or should have known”, that GRG’s mistreatment of customers was an “intended, co-ordinated strategy”. \n“The head of GRG responsible for that policy, Mr Nathan Bostock, is now chief executive of Santander,” Cable said, dragging Bostock into a scandal that has weighed on RBS’s reputation for years. \nA group of 500 small businesses affected by GRG called on the FCA and Bostock to clarify his involvement with the problems at the unit, its spokesman said in a statement. Royal Bank of Scotland signs are seen at a branch of the bank, in London, Britain December 1, 2017. REUTERS/Peter Nicholls \nSantander UK declined to comment. \nThe debate follows the publication on Wednesday of a 2008 internal RBS memo written by a junior manager at the bank, which showed staff within GRG were given a list of ways to squeeze more money from the unit’s troubled clients. \nRBS has set aside 400 million pounds ($555 million) to cover the bill for claims against it over the actions of GRG, and it has acknowledged some bad practice at the unit. \n“We recognise how traumatic this period was for many customers and have acknowledged for some time that mistakes were made,” an RBS spokeswoman said. \n“The regulator has confirmed that the steps we have taken to address concerns were appropriate,” she said. \nThursday’s parliamentary debate topped off a difficult week for RBS, which also drew criticism for demanding tougher terms on its lending to British construction outsourcing company Carillion in the run up to the firm’s collapse. \nThe bank was one of a number of major British lenders to announce measures on Thursday to support small firms hit by the company’s demise. \n($1 = 0.7202 pounds)", "external_links": [], "published": "2018-01-18T23:47:00.000+02:00", "crawled": "2018-01-19T00:01:09.000+02:00", "highlightTitle": ""}