{"organizations": [], "uuid": "c5d1bbf584182bf85ac917c9a40a739ae07177d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-county-bancorp-inc-announces-net-income-of-2-point-1-million-for-the-fourth-quarter-2017-and-net-income-of-10-point-4.html", "country": "US", "domain_rank": 767, "title": "County Bancorp, Inc. Announces Net Income of $2.1 Million for the Fourth Quarter 2017 and Net Income of $10.4 Million for the Year 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:30:00.000+02:00", "replies_count": 0, "uuid": "c5d1bbf584182bf85ac917c9a40a739ae07177d2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-county-bancorp-inc-announces-net-income-of-2-point-1-million-for-the-fourth-quarter-2017-and-net-income-of-10-point-4.html", "ord_in_thread": 0, "title": "County Bancorp, Inc. Announces Net Income of $2.1 Million for the Fourth Quarter 2017 and Net Income of $10.4 Million for the Year 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "wis.", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}], "organizations": [{"name": "county bancorp, inc", "sentiment": "neutral"}, {"name": "county bancorp, inc.", "sentiment": "none"}, {"name": "manitowoc", "sentiment": "none"}, {"name": "investors community bank", "sentiment": "none"}, {"name": "manitowoc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Highlights\nNet income of $2.1 million for the fourth quarter of 2017 and $10.4 million for the year 2017 Diluted earnings per share of $0.30 for the fourth quarter of 2017 and $1.49 for the year 2017 Book value per share of $19.93 as of December 31, 2017, an increase of $1.21, or 6.5%, since December 31, 2016 Tangible book value per share of $19.04 as of December 31, 2017, an increase of $1.30, or 7.3%, since December 31, 2016 Loan growth of $22.4 million during the fourth quarter of 2017, an increase of 2.0%, and $118.5 million during the year of 2017, an increase of 11.5% Deposit growth of $44.0 million during the fourth quarter of 2017, an increase of 4.1%, and $132.6 million during the year 2017, an increase of 13.6%\nMANITOWOC, Wis., County Bancorp, Inc. (NASDAQ:ICBK), the holding company of Investors Community Bank, a commercial bank headquartered in Manitowoc, Wisconsin, reported net income of $2.1 million, or $0.30 diluted earnings per share, for the fourth quarter of 2017, compared to net income of $3.5 million, or $0.50 diluted earnings per share, for the fourth quarter of 2016. Net income for the year ended December 31, 2017 was $10.4 million compared to $10.7 million for the year ended December 31, 2016, a decrease of 2.8%. This represents a return on average assets of 0.80% for the year ended December 31, 2017, compared to 0.98% for the year ended December 31, 2016. Net income for the fourth quarter of 2017 was negatively impacted by a writedown of other real estate owned, as well as a revaluation of the deferred tax asset as a result of the recently enacted tax reform.\n“We continued to see strong loan growth for the quarter and for the year, both on the commercial and agricultural side,” stated Timothy J. Schneider, President of County Bancorp, Inc. and CEO of Investors Community Bank. “In the fourth quarter, we implemented additional deposit strategies and new promotions that lead to more core funding, which we are hopeful will continue into 2018. The core funding strategy is vitally important as we continue to see strong pipelines for both commercial and agricultural relationships.”\n“Non-performing assets continue to improve; however, the agricultural market continues to show stress from a lower than expected milk price environment,” continued Schneider. “The Chicago Mercantile Exchange milk price futures are also indicating a lower milk price for most of 2018. We continue to be diligent in monitoring our agricultural relationships and work closely with our borrowers to help them manage through these more challenging times.”\nLoans and Total Assets\nTotal assets at December 31, 2017 were $1.4 billion, an increase of $37.7 million, or 2.8%, and $154.4 million, or 12.4%, over total assets as of September 30, 2017 and December 31, 2016, respectively. Total loans were $1.1 billion at December 31, 2017, which represents a $22.4 million, or 2.0%, and $118.5 million, or 11.5%, increase over total loans at September 30, 2017 and December 31, 2016, respectively. Throughout 2017, we saw increased loan demand in all of our market areas. In particular, agricultural loans have increased $61.8 million and commercial loans have increased $46.6 million in 2017.\nDeposits\nTotal deposits at December 31, 2017 were $1.1 billion, an increase of $44.0 million, or 4.1%, and $132.6 million, or 13.6%, over total deposits as of September 30, 2017 and December 31, 2016, respectively. While core deposit (demand deposits, money markets, and certificates of deposit) generation remains challenging, we generated $45.8 million of core deposits in new and existing products during the fourth quarter of 2017. We have also supplemented our deposit needs with wholesale deposits. Brokered deposits and national certificates of deposit at December 31, 2017 were $425.0 million, which was a decrease of $2.5 million, or 0.6%, from September 30, 2017, and an increase of $90.4 million, or 27.0%, from December 31, 2016.\nNet Interest Income and Margin\nNet interest income remained stable at $10.2 million for both the three months ended December 31, 2017 and to the three months ended December 31, 2016, in part due to the accretion of a fair value discount in the fourth quarter of 2016 which was offset by increased income on loans in the fourth quarter. For the year ended December 31, 2017, net interest income increased to $38.9 million from $35.6 million for the year ended December 31, 2016, primarily due to overall loan growth in 2017.\nNet interest margin decreased to 3.06% for the three months ended December 31, 2017, compared to 3.45% for the three months ended December 31, 2016. The decrease was primarily the result of the accretion of a fair value discount of $1.4 million during the fourth quarter of 2016, which positively impacted net interest margin by 48 basis points. This was related to our acquisition of The Business Bank in May 2016. The fourth quarter 2017 net interest margin was also negatively impacted by a 0.31% increase in funding costs compared to fourth quarter 2016.\nFor the year ended December 31, 2017, net interest margin decreased to 3.11%, compared to 3.35% for the year ended December 31, 2016. The decrease in margin was primarily the result of the accretion of fair value discount of $1.9 million in 2016 which positively impacted net interest margin by 18 basis points, as well as increased funding costs of 0.20% during 2017 compared to 2016. The accretion adjustment for 2017 is immaterial.\nNon-Interest Income and Expense\nNon-interest income for the year ended December 31, 2017 decreased $1.0 million to $7.7 million compared to $8.7 million for the year ended December 31, 2016. The year-over-year decrease is directly related to a $1.1 million decrease in loan servicing rights during 2017 which was the result of lower volumes of secondary market sales and participations due to changes in Farm Service Agency regulations.\nNon-interest expense for the year ended December 31, 2017 increased $1.9 million to $26.0 million from $24.1 million for the year ended December 31, 2016. The increase is primarily related to a $2.3 million increase in employee compensation and benefits related to a 6.7% increase in headcount during 2017 and a 32.2% increase in benefit costs between 2016 and 2017. This increase was partially offset by a $0.8 million reduction in information processing expenses for 2017 compared to 2016 due to the additional information processing expense in 2016 in connection with the acquisition of The Business Bank.\nNon-interest expense for the three months ended December 31, 2017 increased by $1.2 million to $7.2 million compared to the three months ended December 31, 2016. Non-interest expense in the fourth quarter of 2017 was negatively impacted by $0.4 million of business development expenses which were accelerated from future periods to maximize the tax advantage of the higher corporate tax rate in 2017. The writedown of one OREO property of $0.8 million also occurred during the fourth quarter of 2017.\nIncome Taxes\nOn December 22, 2017, the Tax Cuts and Jobs Act (the “Tax Act”) was signed into law. Among other changes is a permanent reduction in the federal corporate income tax rate from 35% to 21% effective January 1, 2018. As a result of the reduction in the corporate income tax rate, the Company revalued its net deferred tax asset as of December 31, 2017. This resulted in a reduction in the value of our net deferred tax asset of $0.9 million, or $0.15 p", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/1f50176e-e109-4adc-a262-6a98da962337", "https://www.globenewswire.com/Tracker?data=FB6puaTh1NWtuqnx0Pg59ujd3dhC3uUALhgz_wquI4i_AcIuOR100SpMddLn2H0jFKMCYiSalV_WfgHF6gmKYBzzzeeZom5TzTVjjcUdZLibsoK4diLjCmuF7uARIyKEnts3PYpAiXjx7ueIcRQpaQ=="], "published": "2018-01-18T16:30:00.000+02:00", "crawled": "2018-01-18T16:23:00.002+02:00", "highlightTitle": ""}