{"organizations": [], "uuid": "7023ed6d678b8df684726c8f7ce1494bd5f436ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/09/104832996-GettyImages-869823674-iphone-x.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/25/stmicro-ends-strong-2017-on-a-high-helped-by-iphone-x.html", "country": "US", "domain_rank": 767, "title": "STMicro ends strong 2017 on a high helped by iPhone X", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:41:00.000+02:00", "replies_count": 0, "uuid": "7023ed6d678b8df684726c8f7ce1494bd5f436ee"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/stmicro-ends-strong-2017-on-a-high-helped-by-iphone-x.html", "ord_in_thread": 0, "title": "STMicro ends strong 2017 on a high helped by iPhone X", "locations": [], "entities": {"persons": [], "locations": [{"name": "st", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "stmicroelectronics", "sentiment": "positive"}, {"name": "apple", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "jpmorgan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STMicroelectronics capped the chipmaker's best year since 2010 with broad-based revenue growth and rising margins and said auto and industrial demand would offset a seasonal smartphone dip in the first quarter of this year.\nFourth-quarter net revenue rose nearly 33 percent to $2.47 billion (2 billion euros). That topped the $2.35 billion to $2.36 billion forecasts by analysts polled by Thomson Reuters.\nLeading the way was a 70 percent jump in analog and sensors, which includes imaging and proximity sensor products used in Apple's iPhone X, financial analysts said.\nThe X was introduced in September and began shipping later in 2017. ST declined to identify its customer.\nST shares were up 2.2 percent in early trading in Frankfurt a day after a 6 percent decline after broker JPMorgan downgraded Apple chip suppliers on signs of weak orders for the iPhone X, which it said could persist for two quarters.\nBrokers estimate that Apple recently accounted for around 6 percent to 8 percent of ST revenue. Apple's contribution to ST is expected to rise substantially in the second half of 2018, when it is set to deliver sensors for a wider range of Apple smartphones and tablets, financial analysts say.\nST suffered steady annual revenue declines through the first half of the decade before turning the corner in 2016.\nIt said it is now seeing growth across its diversified range of businesses from chips used in autos, industrial, internet, and phones. It reported a 19.7 percent rise in 2017 net revenue.\nGross margin for the fourth quarter rose to 40.6 percent, above the midpoint of its guidance, but it cautioned that margins would dip back to around 39.5 percent this quarter, back to levels seen in its third quarter of 2017.\nSTMicro said it expected net revenue to fall 10 percent in the first quarter versus of 2018 from the fourth quarter (+/-3.5 percent) although revenue is set to rise by around 22 percent year on year.\nThe company formally announced that Deputy Chief Executive Jean-Marc Chery in June would become the company's next president and CEO when long-serving CEO Carlo Bozotti retires, as previously signaled at STMicro's annual shareholder meeting.\nIt said Chief Financial Officer Carlo Ferro also plans to step down as CFO when Bozotti retires but will remain president of ST's Italian affiliate until the end of 2018. ST said Lorenzo Grandi, its financial controller and a 30-year company veteran, would become CFO.", "external_links": [], "published": "2018-01-25T13:41:00.000+02:00", "crawled": "2018-01-25T15:18:34.039+02:00", "highlightTitle": ""}