{"organizations": [], "uuid": "99550ffd226f0baafcab6352da6a822104ccfc9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-navios-maritime-midstream-partners-l-p-reports-financial-results-for-the-fourth-quarter-and-year-ended-december-31-2017.html", "country": "US", "domain_rank": 767, "title": "Navios Maritime Midstream Partners L.P. Reports Financial Results for the Fourth Quarter and Year Ended December 31, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:33:00.000+02:00", "replies_count": 0, "uuid": "99550ffd226f0baafcab6352da6a822104ccfc9e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-navios-maritime-midstream-partners-l-p-reports-financial-results-for-the-fourth-quarter-and-year-ended-december-31-2017.html", "ord_in_thread": 0, "title": "Navios Maritime Midstream Partners L.P. Reports Financial Results for the Fourth Quarter and Year Ended December 31, 2017", "locations": [], "entities": {"persons": [{"name": "angeliki frangou", "sentiment": "none"}], "locations": [{"name": "navios midstream", "sentiment": "none"}, {"name": "monaco", "sentiment": "none"}], "organizations": [{"name": "navios maritime midstream partners l.p. reports financial results", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}, {"name": "navios maritime midstream partners l.p.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Net Income: $4.3 million in Q4; $14.6 million for FY Net cash from operating activities: $6.6 million in Q4; $18.4 million for FY EBITDA: $16.3 million in Q4; $57.9 million for FY Operating Surplus: $10.9 million in Q4; $36.5 million for FY 100% of available days fixed for 2018; 40.8% for 2019 Quarterly Cash Distribution of $0.4225 per unit\nMONACO, Jan. 31, 2018 (GLOBE NEWSWIRE) -- Navios Maritime Midstream Partners L.P. (“Navios Midstream”) (NYSE:NAP), an owner and operator of tanker vessels, reported its financial results today for the fourth quarter and year ended December 31, 2017.\nAngeliki Frangou, Chairman and Chief Executive Officer of Navios Midstream, stated, “We are pleased to report results for the fourth quarter and full year of 2017. For the fourth quarter of 2017, we reported $16.3 million of EBITDA and $4.3 million of net income. For the full year of 2017, we reported $57.9 million of EBITDA and $14.6 million of net income. We also announced a distribution of $0.4225 per unit, representing an annualized yield of about 17%.”\nRECENT DEVELOPMENTS\nCash Distribution\nThe Board of Directors of Navios Midstream declared a cash distribution for the fourth quarter of 2017 of $0.4225 per unit. The cash distribution is payable on February 14, 2018 to unitholders of record as of February 9, 2018.\nNavios Midstream’s ability to make distributions to its unitholders depends on the performance of its subsidiaries and their ability to distribute funds to it. The ability of Navios Midstream’s subsidiaries to make distributions to it may be restricted by, among other things, the provisions of existing and future indebtedness, market conditions, applicable partnership and limited liability company laws and other laws and regulations.\nLiquidity\nIn January 2018, Navios Midstream received $11.5 million of backstop payment, reflecting the outstanding balance as of September 30, 2017, from a total estimated backstop commitment of $16.4 million incurred in 2017.\nOn a pro forma basis, adjusting for the receipt of the backstop payment of $11.5 million, cash and cash equivalents and restricted cash as of December 31, 2017, increased from $37.1 million to $48.6 million.\nLong–Term Cash Flow\nNavios Midstream has entered into long-term charter-out agreements for its vessels, with a remaining average term of 3.3 years, which are expected to provide a stable base of revenue and distributable cash flow. Navios Midstream has currently contracted out 100% of its available days for 2018 and 40.8% for 2019 expecting to generate revenues, including the backstop commitment provided by Navios Maritime Acquisition Corporation, of approximately $86.6 million and $40.8 million for 2018 and 2019, respectively. The average expected daily charter-out rate for the fleet is $39,559 and $45,613 for 2018 and 2019, respectively.\nFINANCIAL HIGHLIGHTS\nFor the following results and the selected financial data presented herein, Navios Midstream has compiled condensed consolidated statements of income for the three months and years ended December 31, 2017 and 2016. The information for the quarterly and years ended December 31, 2017 and 2016 was derived from the unaudited condensed consolidated financial statements for the respective periods. EBITDA and Operating Surplus are non GAAP financial measures and should not be used in isolation or substitution for Navios Midstream’s results.\nSee Exhibit 3 under the heading, “Disclosure of Non-GAAP Financial Measures”, for a discussion of EBITDA and Operating Surplus, and a reconciliation of such measures to the most comparable measures calculated under U.S. GAAP.\n(in $‘000 except per unit data) Three Month\nPeriod ended\nDecember 31, 2017\n(unaudited) Three Month\nPeriod ended\nDecember 31, 2016\n(unaudited ) Year ended\nDecember 31, 2017\n(unaudited) Year ended\nDecember 31, 2016\n(unaudited) Revenue $ 22,700 $ 22,781 $ 83,052 $ 91,834 Net income 4,299 6,049 14,631 24,890 Net cash provided by operating activities 6,600 13,519 18,368 49,738 EBITDA 16,309 16,365 57,936 66,170 Earnings per common unit (basic and diluted) 0.20 0.28 0.70 1.19 Operating Surplus 10,920 10,007 36,524 40,609 Maintenance and replacement capital expenditure reserve 2,461 3,580 9,844 14,321 Three month periods ended December 31, 2017 and 2016\nRevenue for the three month period ended December 31, 2017 decreased by less than $0.1 million to $22.7 million, as compared to $22.8 million for the same period in 2016. Time Charter Equivalent (“TCE”) was $40,391 for the three month period ended December 31, 2017 and $40,719 for the three month period ended December 31, 2016.\nNet income for the three month period ended December 31, 2017 was $4.3 million compared to $6.0 million for the three month period ended December 31, 2016. The decrease in net income of approximately $1.8 million was due to a: (a) $1.4 million increase in interest expenses and finance cost mainly due to a $1.3 million write-off of deferred finance cost; (b) $0.4 million increase in direct vessel expenses; and (c) $0.1 million decrease in EBITDA; partially mitigated by a $0.1 million decrease in depreciation and amortization.\nEarnings per common unit were $0.20 for the three month period ended December 31, 2017.\nEBITDA decreased by $0.1 million to $16.3 million for the three month period ended December 31, 2017, as compared to $16.4 million for the same period in 2016. The decrease in EBITDA was due to a: (a) $0.2 million increase in general and administrative expenses; (b) $0.1 million decrease in revenue; and (c) $0.1 million increase in time charter expenses; partially mitigated by a $0.3 million decrease in other expense.\nThe reserve for estimated maintenance and replacement capital expenditures for the three month periods ended December 31, 2017 and 2016 was $2.5 million and $3.6 million, respectively (please see “Disclosure of Non-GAAP Financial Measures-4.Reconciliation of Non-GAAP Financial Measures” in Exhibit 3).\nNavios Midstream generated an Operating Surplus for the three month period ended December 31, 2017 of $10.9 million. Operating Surplus is a non-GAAP financial measure used by certain investors to assist in evaluating a partnership’s ability to make quarterly cash distributions (please see “Disclosure of Non-GAAP Financial Measures-4.Reconciliation of Non-GAAP Financial Measures” in Exhibit 3).\nYear ended December 31, 2017 and 2016\nRevenue for the year ended December 31, 2017 decreased by $8.8 million to $83.1 million, as compared to $91.8 million for the same period in 2016, mainly due to the decrease of profit share by $4.3 million as a result of prevailing market conditions and certain unscheduled off-hires among which was the prolonged drydock of one of our vessels. TCE was $39,401 for the year ended December 31, 2017 and $42,625 for the year ended December 31, 2016.\nNet income for the year ended December 31, 2017 was $14.6 million compared to $24.9 million for the year ended December 31, 2016. The decrease in net income of approximately $10.3 million was due to: (a) an $8.2 million decrease in EBITDA; (b) a $1.6 million increase in interest expenses and finance cost mainly due to a $1.3 million write-off of deferred finance cost; (c) a $0.8 million increase in direct vessel expenses; and (d) a $0.1 million decrease in interest income; partially mitigated by a $0.5 million decrease in depreciation and amortization.\nEarnings per common unit were $0.70 for the year ended December 31, 2017.\nEBITDA decreased by $8.2 million to $57.9 million for the year ended December 31, 2017, as compared to $66.2 million for the same period in 2016. The decrease in EBITDA was mainly due to an $8.8 million decrease in revenue. The above decrease was partially mitigated by a: (a) $0.3 million decrease in time charter expenses; (b) $0.1 million decrease in general and administrative expenses; (c) $0.1 million decrease in management fees; and (d) $0.1 million decrease in other expense.\nThe reserve for estimated maintenance and replacement capital expenditures for the year ended December 31, 2017 and 2016 was $9.8 million and $14.3 million, respectively (please see “Disclosure of Non-GAAP Financial Measures-4.Reconciliation of Non-GAAP Financial Measures” in Exhibit 3).\nNavios Midstream generated an Operating Surplus for the year ended December 31, 2017 of $36.5 million. Operating Surplus is a non-GAAP financial measure used by certain investors to assist in evaluating a partnership’s ability to make quarterly cash distributions (please see ﻿“Disclosure of Non-GAAP Financial Measures-4.Reconciliation of Non-GAAP Financial Measures” in Exhibit 3).\nFleet Employment Profile\nThe following table reflects certain key indicators of Navios Midstream’s core fleet performance for the three months and years ended December 31, 2017 and 2016.\nThree Month\nPeriod ended\nDecember 31, 2017\n(unaudited) Three Month\nPeriod ended\nDecember 31, 2016\n(unaudited) Year ended\nDecember 31, 2017\n(unaudited) Year ended\nDecember 31, 2016\n(unaudited) FLEET DATA Available days (1) 552 552 2,077 2,120 Operating days (2) 545 551 2,049 2,113 Fleet utilization (3) 98.7 % 99.9 % 98.6 % 99.7 % Vessels operating at period end 6 6 6 6 AVERAGE DAILY RESULTS Time Charter Equivalent per day (4) $ 40,391 $ 40,719 $ 39,401 $ 42,625\n(1) Available days for the fleet represent total calendar days the vessels were in Navios Midstream’s possession for the relevant period after subtracting off-hire days associated with scheduled repairs, drydock or special surveys. The shipping industry uses available days to measure the number of days in a relevant period during which a vessel is capable of generating revenues.\n(2) Operating days is the number of available days in the relevant period less the aggregate number of days that the vessels are off-hire due to any reason, including unforeseen circumstances. The shipping industry uses operating days to measure the aggregate number of days in a relevant period during which vessels actually generate revenues.\n(3) Fleet utilization is the percentage of time that Navios Midstream’s vessels were available for revenue generating available days, and is determined by dividing the number of operating days during a relevant period by the number of available days during that period. The shipping industry uses fleet utilization to measure efficiency in finding employment for vessels and minimizing the amount of days that its vessels are off-hire for reasons other than scheduled repairs, drydock or special surveys.\n(4) TCE rates are defined as voyage and time charter revenues less voyage expenses during a period divided by the number of available days during the period. The TCE rate is a standard shipping industry performance measure used primarily to present the actual daily earnings generated by vessels on various types of charter contracts for the number of available days of the fleet. Conference Call Details:\nNavios Midstream’s management will host a conference call today, Wednesday, January 31, 2018 to discuss the results for the fourth quarter and year ended December 31, 2017.\nConference Call details:\nCall Date/Time: Wednesday, January 31, 2018 at 8:30 am ET\nCall Title: Navios Midstream Q4 2017 Financial Results Conference Call\nUS Dial In: +1.866.703.4207\nInternational Dial In: +1.636.692.6440\nConference ID: 806 8933\nThe conference call replay will be available two hours after the live call and remain available for one week at the following numbers:\nUS Replay Dial In: +1.800.585.8367\nInternational Replay Dial In: +1.404.537.3406\nConference ID: 806 8933\nSlides and Audio Webcast:\nThere will also be a live webcast of the conference call, through Navios Midstream’s website ( www.navios-midstream.com ) under “Investors”. Participants to the live webcast should register on the website approximately 10 minutes prior to the start of the webcast.\nA supplemental slide presentation will be available on Navios Midstream’s website under the “Investors” section by 8:00 am ET on the day of the call.\nAbout Navios Maritime Midstream Partners L.P.\nNavios Maritime Midstream Partners L.P. is a publicly traded master limited partnership which owns and operates crude oil tankers under long-term employment contracts. For more information, please visit our website at www.navios-midstream.com .\nForward-Looking Statements\nThis press release contains forward-looking statements (as defined in Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended) concerning future events and expectations, including with respect to Navios Midstream’s future dividends and Navios Midstream's growth strategy and measures to implement such strategy; including expected vessel acquisitions and entering into further time charters. Words such as “may,” “expects,” “intends,” “plans,” “believes,” “anticipates,” “hopes,” “estimates,” and variations of such words and similar expressions are intended to identify forward-looking statements. Such statements include comments regarding expected revenue and time charters. These forward-looking statements are based on the information available to, and the expectations and assumptions deemed reasonable by, Navios Midstream at the time these statements were made. Although Navios Midstream believes that the expectations reflected in such forward-looking statements are reasonable, no assurance can be given that such expectations will prove to have been correct. These statements involve known and unknown risks and are based upon a number of assumptions and estimates that are inherently subject to significant uncertainties and contingencies, many of which are beyond the control of Navios Midstream. Actual results may differ materially from those expressed or implied by such forward-looking statements. Factors that could cause actual results to differ materially include, but are not limited to, the creditworthiness of our charterers and the ability of our contract counterparties to fulfill their obligations to us, tanker industry trends, including charter rates and vessel values and factors affecting vessel supply and demand, the aging of our vessels and resultant increases in operation and drydocking costs, the loss of any customer or charter or vessel, our ability to repay outstanding indebtedness, to obtain additional financing and to obtain replacement charters for our vessels, in each case, at commercially acceptable rates or at all, increases in costs and expenses, including but not limited to: crew wages, insurance, provisions, port expenses, lube oil, bunkers, repairs, maintenance and general and administrative expenses, the expected cost of, and our ability to comply with, governmental regulations and maritime self-regulatory organization standards, as well as standard regulations imposed by our charterers applicable to our business, potential liability from litigation and our vessel operations, including discharge of pollutants, general domestic and international political conditions, competitive factors in the market in which Navios Midstream operates; risks associated with operations outside the United States; and other factors listed from time to time in Navios Midstream’s filings with the U.S. Securities and Exchange Commission including its Form 20-Fs and Form 6-Ks. Navios Midstream expressly disclaims any obligations or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in Navios Midstream’s expectations with respect thereto or any change in events, conditions or circumstances on which any statement is based. Navios Midstream makes no prediction or statement about the performance of its common units.\nInvestor Relations Contact\nNavios Maritime Midstream Partners L.P.\n+1 (212) 906 8647\nInvestors@navios-midstream.com\nEXHIBIT 1\nNAVIOS MARITIME MIDSTREAM PARTNERS L.P.\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(Expressed in thousands of U.S. Dollars) December 31,\n2017 December 31,\n2016 ASSETS Current assets Cash and cash equivalents $ 27,086 $ 52,791 Restricted cash 10,000 — Accounts receivable, net 2,357 2,264 Prepaid expenses and other current assets 3,022 1,168 Due from related parties, current 20,086 4,864 Total current assets 62,551 61,087 Vessels, net 356,220 378,444 Intangible assets 22,318 25,164 Deferred dry dock and special survey costs, net 12,893 11,086 Due from related parties, non-current 2,565 — Total non-current assets 393,996 414,694 Total assets $ 456,547 $ 475,781 LIABILITIES AND PARTNERS’ CAPITAL Current liabilities Accounts payable $ 1,999 $ 2,386 Accrued expenses 572 602 Deferred revenue 1,731 2,494 Current portion of long-term debt, net of deferred finance costs and discount 675 661 Total current liabilities 4,977 6,143 Long-term debt, net of deferred finance costs and discount 195,839 196,515 Total non-current liabilities 195,839 196,515 Total liabilities $ 200,816 $ 202,658 Commitments and contingencies — — Total Partners’ capital Common Unitholders (19,354,498 units and 9,675,795 units issued and outstanding at December 31, 2017 and December 31, 2016, respectively) 225,742 125,635 Subordinated Series A Unitholders (1,592,920 units issued and outstanding at December 31, 2017 and December 31, 2016, respectively) 24,992 26,593 Subordinated Unitholders (zero units and 9,342,692 units issued and outstanding at December 31, 2017 and December 31, 2016, respectively) — 115,552 General Partner (427,499 units issued and outstanding at December 31, 2017 and 420,641 issued and outstanding at December 31, 2016, respectively) 4,997 5,343 Partners’ capital 255,731 273,123 Total liabilities and Partners’ capital $ 456,547 $ 475,781\nNAVIOS MARITIME MIDSTREAM PARTNERS L.P.\nCONDENSED CONSOLIDATED STATEMENTS OF INCOME\n(Expressed in thousands of U.S. Dollars, except per unit amounts) Three Month\nPeriod ended\nDecember 31, 2017\n(unaudited) Three Month\nPeriod ended\nDecember 31, 2016\n(unaudited) Year ended\nDecember 31, 2017\n(unaudited) Year ended\nDecember 31, 2016 Revenue $ 22,700 $ 22,781 $ 83,052 $ 91,834 Time charter expenses (405 ) (305 ) (1,198 ) (1,466 ) Direct vessel expenses (1,145 ) (781 ) (3,919 ) (3,093 ) Management fees (entirely through related party transactions) (5,244 ) (5,244 ) (20,805 ) (20,862 ) General and administrative expenses (725 ) (552 ) (2,832 ) (2,968 ) Depreciation and amortization (6,259 ) (6,378 ) (25,070 ) (25,534 ) Interest expenses and finance cost (4,641 ) (3,196 ) (14,370 ) (12,843 ) Interest income 35 39 54 190 Other income, net — 2 — 4 Other expense (17 ) (317 ) (281 ) (372 ) Net income $ 4,299 $ 6,049 $ 14,631 $ 24,890 Earnings attributable to: Common unit holders $ 2,932 $ 2,783 $ 7,771 $ 11,306 Subordinated unit holders Series A $ 320 $ 458 $ 1,091 $ 1,906 Subordinated unit holders $ 960 $ 2,688 $ 5,479 $ 11,186 General Partner $ 87 $ 120 $ 290 $ 492 Earnings per unit (basic and diluted) Common unitholders: $ 0.20 $ 0.28 $ 0.70 $ 1.19 Subordinated Series A unitholders: $ 0.20 $ 0.29 $ 0.69 $ 1.20 Subordinated unitholders: $ 0.20 $ 0.28 $ 0.67 $ 1.19 General Partner: $ 0.20 $ 0.29 $ 0.68 $ 1.19\nNAVIOS MARITIME MIDSTREAM PARTNERS L.P.\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(Expressed in thousands of U.S. Dollars) Year ended\nDecember 31,\n2017\n(unaudited) Year ended\nDecember 31,\n2016 Operating Activities Net income $ 14,631 $ 24,890 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 25,070 25,534 Amortization of deferred finance cost and discount 2,677 1,407 Amortization of dry dock and special survey costs 3,919 3,093 Changes in operating assets and liabilities: (Increase)/ decrease in prepaid expenses and other current assets (3,144 ) 94 Payments for Drydocking (5,725 ) (8,113 ) (Increase)/ decrease in accounts receivable (93 ) 2,846 Increase in due from related parties, current (15,222 ) (2,498 ) Increase in due from related parties, non-current (2,565 ) — (Decrease)/ increase in accounts payable (387 ) 1,974 Decrease in accrued expenses (30 ) (52 ) (Decrease)/ increase in deferred revenue (763 ) 563 Net cash provided by operating activities $ 18,368 $ 49,738 Investing Activities Acquisition of vessels — (500 ) Net cash used in investing activities $ — $ (500 ) Financing Activities Proceeds from Long term debt, net of deferred finance costs and discount — — Loan repayment (2,050 ) (3,200 ) IPO expenses — — Dividend paid (36,111 ) (35,180 ) Proceeds from issuance of general partner units 84 89 Proceeds from issuance of common units 4,004 4,010 Increase in restricted cash (10,000 ) — Net cash (used in)/ provided by financing activities $ (44,073 ) $ (34,281 ) Net (decrease)/ increase in cash and cash equivalents (25,705 ) 14,957 Cash and cash equivalents, beginning of year 52,791 37,834 Cash and cash equivalents, end of year $ 27,086 $ 52,791 Supplemental disclosures of cash flow information Cash interest paid $ 11,614 $ 11,428 EXHIBIT 2\nOwned Vessels Type Built Capacity\n(DWT) Shinyo Kieran VLCC 2011 297,066 Shinyo Saowalak VLCC 2010 298,000 Nave Celeste VLCC 2003 298,717 Shinyo Kannika VLCC 2001 287,175 Shinyo Ocean VLCC 2001 281,395 C. Dream VLCC 2000 298,570\nOption Vessels (1) Type Built Capacity\n(DWT) Expiration Date Nave Buena Suerte VLCC 2011 297,491 November 18, 2018 Nave Neutrino VLCC 2003 298,287 November 18, 2018 Nave Electron VLCC 2002 305,178 November 18, 2018\n(1) Navios Midstream has options, to acquire up to three VLCCs at fair market value from Navios Maritime Acquisition Corporation until November 18, 2018.\nEXHIBIT 3\nDisclosure of Non-GAAP Financial Measures\n1. EBITDA\nEBITDA represents net income before interest and finance costs, before depreciation and amortization and income taxes. We use EBITDA as a liquidity measure and reconcile EBITDA to net cash provided by/(used in) operating activities, the most comparable liquidity measure in accordance with generally accepted accounting principles in the United States (“U.S. GAAP”). EBITDA in this document is calculated as follows: net cash provided by /(used in) operating activities adding back, when applicable and as the case may be, the effect of: (i) net increase /(decrease) in operating assets; (ii) net (increase)/decrease in operating liabilities; (iii) net interest cost; (iv) amortization of deferred finance charges and other related expenses; (v) provision for losses on accounts receivable; (vi) equity in affiliates, net of dividends received; (vii) payments for drydock and special survey costs; (viii) gain /(loss) on sale of assets/subsidiaries; and (ix) impairment charges. Navios Midstream believes that EBITDA is the basis upon which liquidity can be assessed and presents useful information to investors regarding Navios Midstream’s ability to service and/or incur indebtedness, pay capital expenditures, meet working capital requirements and make cash distributions. Navios Midstream also believes that EBITDA is used: (i) by potential lenders to evaluate potential transactions; (ii) to evaluate and price potential acquisition candidates; and (iii) by securities analysts, investors and other interested parties in the evaluation of companies in our industry.\nEBITDA has limitations as an analytical tool, and should not be considered in isolation or as a substitute for the analysis of Navios Midstream’s results as reported under U.S. GAAP. Some of these limitations are: (i) EBITDA does not reflect changes in, or cash requirements for, working capital needs; and (ii) although depreciation and amortization are non-cash charges, the assets being depreciated and amortized may have to be replaced in the future. EBITDA does not reflect any cash requirements for such capital expenditures. As a result of these limitations, EBITDA should not be considered as a principal indicator of Navios Midstream’s performance. Furthermore, our calculation of EBITDA may not be comparable to that reported by other companies due to differences in methods of calculation.\n2. Operating Surplus\nOperating Surplus represents net income adjusted for depreciation and amortization expense, non-cash interest expense and estimated maintenance and replacement capital expenditures. Maintenance and replacement capital expenditures are those capital expenditures required to maintain over the long term the operating capacity of, or the revenue generated by, Navios Midstream’s capital assets.\nOperating Surplus is a quantitative measure used in the publicly-traded partnership investment community to assist in evaluating a partnership’s ability to make quarterly cash distributions. Operating Surplus is not required by accounting principles generally accepted in the United States and should not be considered a substitute for net income, cash flow from operating activities and other operations or cash flow statement data prepared in accordance with U.S. GAAP or as a measure of profitability or liquidity.\n3. Available Cash\nAvailable Cash generally means for each fiscal quarter, all cash on hand at the end of the quarter:\nless the amount of cash reserves established by the Board of Directors to: provide for the proper conduct of Navios Midstream’s business (including reserve for maintenance and replacement capital expenditures); comply with applicable law, any of Navios Midstream’s debt instruments, or other agreements; or provide funds for distributions to the unitholders and to the general partner for any one or more of the next four quarters; plus all cash on hand on the date of determination of available cash for the quarter resulting from working capital borrowings made after the end of the quarter. Working capital borrowings are generally borrowings that are made under any revolving credit or similar agreement used solely for working capital purposes or to pay distributions to partners.\nAvailable Cash is a quantitative measure used in the publicly-traded partnership investment community to assist in evaluating a partnership’s ability to make quarterly cash distributions. Available cash is not required by accounting principles generally accepted in the United States and should not be considered a substitute for net income, cash flow from operating activities and other operations or cash flow statement data prepared in accordance with U.S. GAAP or as a measure of profitability or liquidity.\n4. Reconciliation of Non-GAAP Financial Measures\nThree Month\nPeriod ended\nDecember 31, 2017\n($ ‘000)\n(unaudited) Three Month\nPeriod ended\nDecember 31, 2016\n($ ‘000)\n(unaudited) Year ended\nDecember 31, 2017\n($ ‘000)\n(unaudited) Year ended\nDecember 31, 2016\n($ ‘000)\n(unaudited) Net cash provided by operating activities $ 6,600 $ 13,519 $ 18,368 $ 49,738 Net decrease in operating assets 6,810 304 26,749 5,173 Net (increase)/ decrease in operating liabilities (70 ) (264 ) 1,180 13 Net interest cost 4,606 3,157 14,316 12,653 Amortization of deferred finance cost and bond premium (1,637 ) (351 ) (2,677 ) (1,407 ) EBITDA $ 16,309 $ 16,365 $ 57,936 $ 66,170 Cash interest paid $ (2,954 ) $ (2,815 ) $ (11,614 ) $ (11,428 ) Cash interest income 26 37 46 188 Maintenance and replacement capital expenditures $ (2,461 ) $ (3,580 ) $ (9,844 ) $ (14,321 ) Operating Surplus $ 10,920 $ 10,007 $ 36,524 $ 40,609 Cash distribution paid relating to the first nine months — — (27,084 ) (26,438 ) Cash reserves $ (1,889 ) $ (1,121 ) $ (409 ) $ (5,285 ) Available cash for distribution $ 9,031 $ 8,886 $ 9,031 $ 8,886\nThree Month\nPeriod ended\nDecember 31, 2017\n($ ‘000)\n(unaudited) Three Month\nPeriod ended\nDecember 31, 2016\n($ ‘000)\n(unaudited) Year ended\nDecember 31, 2017\n($ ‘000)\n(unaudited) Year ended\nDecember 31, 2016\n($ ‘000)\n(unaudited) Net cash provided by operating activities $ 6,600 $ 13,519 $ 18,368 $ 49,738 Net cash used in investing activities $ — $ — $ — $ (500 ) Net cash used in financing activities $ (9,543 ) $ (9,956 ) $ (44,073 ) $ (34,281 )\nSource:Navios Maritime Midstream Partners LP", "external_links": ["https://www.globenewswire.com/Tracker?data=ZId9MryFeQssGo9fdM9sClWEXx9GfDD0yxvPKguwhLvJ3VaGdyDI2b4ih-mqDFs9GPumBUZPxcRCdn2qF8LrcLTXCDU8Wek-P2e26E6NwWNHnbTdlf0zsy0a6qFynjp9", "https://www.globenewswire.com/Tracker?data=KZrtKIS_Z1XZrMQLQJkMQUhs7phChg4rRlO9oenHCQCorA7uujmCDBBTSu2nIqzadv2d65TkOkejkr9GTbCwVJhKEAexqCoHIJXcqHUQm9c=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/88199297-63cc-4809-94f3-139e5b4a163a", "https://www.globenewswire.com/Tracker?data=KZrtKIS_Z1XZrMQLQJkMQUhs7phChg4rRlO9oenHCQBVSvbzcNLUWs-HYSfyn2QJrsNNz-iBcy7vOxSxWtvfBltMljtnFguv7E4Fb-_WUDw="], "published": "2018-01-31T15:33:00.000+02:00", "crawled": "2018-01-31T17:17:34.003+02:00", "highlightTitle": ""}