{"organizations": [], "uuid": "1d87857bc50c9d19ed4f3d1acae405dbbea58700", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-suffers-big-drop-after-report-china-may-halt-bond-buys-idUSL8N1P5226", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar suffers big drop after report China may halt bond buys", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:11:00.000+02:00", "replies_count": 0, "uuid": "1d87857bc50c9d19ed4f3d1acae405dbbea58700"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-suffers-big-drop-after-report-china-may-halt-bond-buys-idUSL8N1P5226", "ord_in_thread": 0, "title": "FOREX-Dollar suffers big drop after report China may halt bond buys", "locations": [], "entities": {"persons": [{"name": "tommy wilkes", "sentiment": "none"}, {"name": "saikat chatterjee", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "u.s. treasuries", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar down 0.6 pct in broad sell-off\n* Dollar down as much as 1.2 pct vs yen\n* BOJ bond move stokes speculation of tapering\n* Dollar holds below $1.20 against the euro\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Tommy Wilkes and Saikat Chatterjee\nLONDON, Jan 10 (Reuters) - The U.S. dollar slumped on Wednesday after a report that China was ready to slow or halt its U.S. treasury purchases, with the greenback posting its biggest single-day drop against the Japanese yen in nearly eight months.\nOfficials reviewing China’s foreign-exchange holdings have recommended slowing or halting purchases of U.S. Treasuries, Bloomberg News reported, citing people familiar with the matter.\nThe dollar had been on the back foot before the news report as the Bank of Japan’s move to trim its purchases of long-dated government bonds (JGB) earlier this week reverberated across currency markets.\nThe dollar’s biggest losses were against the Japanese yen , falling more than 1.2 percent to a six-week low of 111.3, its weakest since late November.\n“If the foreign holder of U.S. Treasuries were to suddenly stop, that would cause a problem,” said MUFG chief macro strategist Derek Halpenny, in London, referring to China. “The dollar needs to weaken to a level that attracts buyers back to the U.S.”\nAgainst a basket of currencies, the dollar fell 0.6 percent, its biggest drop in a month.\nWednesday’s decline against the yen followed Tuesday’s 0.5 percent fall when Japan’s central bank reduced the amount of its JGB purchases in its regular buying operations.\nThe dollar has had a torrid start to the year after weakening around 10 percent against a basket of major currencies last year as the economic outlook in other parts of the world, particularly Europe, improved, while expectations of a major boost to U.S. growth from domestic tax reforms fizzled.\nThe dollar’s weakness also underlines the greenback’s vulnerability to other central banks’ moves towards normalising monetary policy, a feature of 2017 that has continued to weigh on the dollar in the opening weeks of the year.\nTwo U.S. interest rate hikes this year are priced in but the market has only recently started to price in tightening moves by other central banks.\nTraders cited the report on China’s appetite for U.S. bonds for a renewed rise in U.S. Treasury yields during European trade, with the U.S. 10-year bond yield rising to a new 10-month high at 2.593 percent.\nBOJ FUELS TAPER TALK The Bank of Japan’s move to trim JGB purchases in the previous session stoked speculation it would ease its massive monetary stimulus.\nWhile the central bank’s move was only a slight tweak in policy and there was no further news on Wednesday, analysts put the extended sell-off down to traders betting that the bank could be poised to begin winding down its stimulus.\n“Japanese yields have been rising and this has been reinforcing the move on the yen,” Thu Lan Nguyen, a Frankfurt-based FX strategist at Commerzbank.\nNguyen, however, called the market expectations of an early end to an expansionary BOJ policy “premature” because the bank can defend its 10-year yield target without buying so many bonds, and because inflation pressures in Japan remain low.\nMoreover, market positioning on the Japanese yen has been extremely short as investors have ramped up its use as a funding currency in recent months to buy relatively higher yielding debt in the United States and elsewhere.\n“The BOJ has been reducing its bond purchase operations over the past few months and this latest move should intensify the yield curve steepening trend, pushing the yen higher,” said Shaniel Ramjee, senior investment manager at Pictet Asset Management based in London.\nHowever, Ramjee said the yen’s rise would not yet encourage investors using the carry trade - whereby traders borrow in yen to invest in higher-yielding markets - to turn to other currencies.\n“The yen has to move substantially higher from current levels before there is an unwinding in yen-funded carry trades,” Ramjee said.\nReporting by Tommy Wilkes and Saikat Chatterjee; Additional reporting to Jemima Kelly; Editing by Gareth Jones\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T20:11:00.000+02:00", "crawled": "2018-01-11T12:21:04.007+02:00", "highlightTitle": ""}