{"organizations": [], "uuid": "b878c04485d63f987da76ed170ec4de9803bf3f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-spark-energy-inc-announces-public-offering-of-series-a-preferred-stock.html", "country": "US", "domain_rank": 767, "title": "Spark Energy, Inc. Announces Public Offering of Series A Preferred Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.257, "site_type": "news", "published": "2018-01-23T17:00:00.000+02:00", "replies_count": 0, "uuid": "b878c04485d63f987da76ed170ec4de9803bf3f9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-spark-energy-inc-announces-public-offering-of-series-a-preferred-stock.html", "ord_in_thread": 0, "title": "Spark Energy, Inc. Announces Public Offering of Series A Preferred Stock", "locations": [], "entities": {"persons": [{"name": "janney montgomery scott", "sentiment": "none"}, {"name": "b. riley", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "spark energy, inc.", "sentiment": "neutral"}, {"name": "spark energy, inc", "sentiment": "neutral"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "boenning & scattergood, inc.", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "inc.", "sentiment": "none"}, {"name": "bb&t securities", "sentiment": "none"}, {"name": "fbr, inc.", "sentiment": "none"}, {"name": "bb&t capital markets", "sentiment": "none"}, {"name": "incapital llc", "sentiment": "none"}, {"name": "ladenburg thalmann & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 23, 2018 (GLOBE NEWSWIRE) -- Spark Energy, Inc. (“Spark” or the “Company”) (NASDAQ:SPKE), an independent retail energy services company, announced today that it has commenced a public offering of its 8.75% Series A Fixed-to-Floating Rate Cumulative Redeemable Perpetual Preferred Stock (“Series A Preferred Stock”) pursuant to an effective shelf registration statement on Form S-3 previously filed with the Securities and Exchange Commission (the “SEC”). Spark will grant the underwriters a 30-day option to purchase additional shares of Series A Preferred Stock.\nSpark intends to use the net proceeds of this offering for merger and acquisition opportunities, international expansion and general corporate purposes, including to repay a portion of borrowings outstanding under Spark’s senior secured borrowing base credit facility. B. Riley FBR, Inc., Janney Montgomery Scott LLC, BB&T Capital Markets, a division of BB&T Securities, LLC, and Ladenburg Thalmann & Co. Inc. will act as joint book-running managers of the offering. Boenning & Scattergood, Inc., Incapital LLC, National Securities Corporation, a wholly owned subsidiary of National Holdings, Inc. (NASDAQ:NHLD), and USCA Securities LLC will act as co-managers.\nThe offering may be made only by means of a prospectus and related prospectus supplement meeting the requirements of Section 10 of the Securities Act of 1933, as amended. A copy of the preliminary prospectus supplement and accompanying base prospectus meeting such requirements relating to this offering may be obtained from any of the underwriters, including the offices of:\nB. Riley FBR, Inc.\nAttn: Syndicate Prospectus Department\n1300 17 th Street N., Suite 1400\nArlington, VA 22209\nPhone: (800) 846-5050\nEmail: prospectuses@brileyfbr.com Janney Montgomery Scott LLC\nAttn: Taxable Fixed Income Department\n1717 Arch Street, 19 th Floor\nPhiladelphia, Pennsylvania 19103\nPhone: 215-665-6130\nEmail: TFI@janney.com\nBB&T Capital Markets\nAttn: Prospectus Department\n901 East Byrd Street, Suite 300\nRichmond, VA 23219\nEmail: prospectusrequests@bbandtcm.com\nLadenburg Thalmann & Co.\nSyndicate Department\n277 Park Avenue, 26th Floor\nNew York, NY 10172\nprospectus@ladenburg.com You may also obtain these documents for free when they are available by visiting the Securities and Exchange Commission's Web site at www.sec.gov .\nThe shelf registration statement relating to these securities has previously been filed with the SEC and declared effective. This press release shall not constitute an offer to sell or the solicitation of an offer to buy the securities described herein, nor shall there be any sale of these securities in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Spark Energy, Inc.\nSpark Energy, Inc. is an established and growing independent retail energy services company founded in 1999 that provides residential and commercial customers in competitive markets across the United States with an alternative choice for their natural gas and electricity. Headquartered in Houston, Texas, Spark currently operates in 19 states and serves 94 utility territories. Spark offers its customers a variety of product and service choices, including stable and predictable energy costs and green product alternatives.\nCautionary Note Concerning Forward Looking Statements\nThis press release includes forward-looking statements regarding future events. These forward-looking statements rely on a number of assumptions concerning future events and are subject to a number of uncertainties and factors, many of which are outside the control of Spark, and a variety of risks that could cause results to differ materially from those expected by the management of Spark. Spark undertakes no obligation to update or revise forward-looking statements to reflect changed assumptions, the occurrence of unanticipated events or changes to future operating results over time.\nContact: Spark Energy, Inc.\nInvestors:\nChristian Hettick, 832-200-3727\nMedia:\nEric Melchor, 281-833-4151\nSource:Spark Energy, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/3ba00f4f-8e45-4894-898d-237159cbc687"], "published": "2018-01-23T17:00:00.000+02:00", "crawled": "2018-01-23T17:51:29.005+02:00", "highlightTitle": ""}