{"organizations": [], "uuid": "3aeea8bbbaf0da1e3eaed701ba36f94a5edc561b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/carillion-restructuring/update-1-british-ministers-met-to-discuss-fate-of-carillion-pm-spokesman-idUSL8N1P72UE", "country": "US", "domain_rank": 408, "title": "UPDATE 1-British ministers met to discuss fate of Carillion-PM spokesman", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:52:00.000+02:00", "replies_count": 0, "uuid": "3aeea8bbbaf0da1e3eaed701ba36f94a5edc561b"}, "author": "", "url": "https://www.reuters.com/article/carillion-restructuring/update-1-british-ministers-met-to-discuss-fate-of-carillion-pm-spokesman-idUSL8N1P72UE", "ord_in_thread": 0, "title": "UPDATE 1-British ministers met to discuss fate of Carillion-PM spokesman", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 11:54 AM / Updated 11 minutes ago UPDATE 3-Carillion plunges on report administrators on standby Reuters Staff \n* Carillion has put administrators EY on standby - Sky \n* Shares plunge another 30 percent \n* Government ministers meet to discuss plans \n* Carillion has key role in public services (Adds reaction, details) \nBy Kate Holton \nLONDON, Jan 12 (Reuters) - British building and services company Carillion has put administrators on standby in case it collapses, Sky News reported, hammering shares in a business whose fate has triggered government crisis meetings. \nCarillion shares plunged another 30 percent on Friday after Sky said it had lined up EY to help manage the business if it failed to strike a deal with creditors. Sky did not say where it obtained the information. Carillion and EY declined to comment. \nTensions around the debt-laden company have been ratcheting up for weeks and on Thursday ministers overseeing everything from justice to transport, health and education met to discuss how they should respond to the possible demise of a business that plays a central role in British public life. \nA spokesman for Prime Minister Theresa May said on Friday the government was monitoring the situation and had drawn up a contingency plan after the 200-year-old group asked creditors for more time to tackle its debts. \n“Ministers did meet yesterday, there are ongoing meetings,” he said. “We are monitoring this situation closely and will continue to do so.” \nOne of many private companies to run public services in Britain, Carillion is fighting to survive after costly contract delays and a downturn in new business prompted a string of profit warnings and a first-half loss of more than 1 billion pounds ($1.4 billion). \nShares in Carillion were trading at 14 pence at 1540 GMT, compared with a price of 240 pence a year ago. Its market value of 64 million pounds compares with debt and liabilities of 1.5 billion pounds, according to analysts. \nAny collapse would be felt across Britain and also in Canada and the Middle East where it has worked on landmark projects. \nEmploying 43,000 people, it provides services to government departments including justice, health and education, and has built hospitals, roads and rail lines. \nSpun out of Tarmac nearly 20 years ago and having bought Alfred McAlpine in 2008, Carillion has worked on key construction projects including London’s Royal Opera House, the Suez Canal road tunnel and Toronto’s Union Station. \nIn July last year it won contracts to build Britain’s new High Speed 2 rail line, a key project that will better connect London with the north of England. \nThe GMB trade union called on the government to protect Carillion’s workers and pensioners, but said the company should not be bailed out. \n“Handing Carillion bosses a blank cheque bail out is completely unacceptable – company bosses should not be rewarded for failure with public money,” it said in a statement. \nThe company met with creditors including RBS and Santander UK on Wednesday to ask them to consider a debt extension or roll-over in financing talks and it is expected to talk with the Pension Regulator on Friday. \nIts pension deficit stands at around 580 million pounds. \nMany of Britain’s service providers have been hit in recent years after they took on work during the financial crisis at low prices for long-running, fixed-price contracts to keep work coming in. \nThe contracts left little room for delay or failure and have led to problems for groups including Capita, Mitie and Interserve. \nCarillion’s fight for survival is being led by interim boss and industry veteran Keith Cochrane, a former CEO of engineer Weir Group. New CEO Andrew Davies, head of family-owned builder Wates Group and formerly with defence company BAE Systems, joins on Jan. 22. $1 = 0.7333 pounds Additional reporting by David Milliken; Editing by Paul Sandle and Mark Potter", "external_links": [], "published": "2018-01-12T13:52:00.000+02:00", "crawled": "2018-01-12T14:04:14.012+02:00", "highlightTitle": ""}