{"organizations": [], "uuid": "f91371ca84401dc2bc1c97ee9a27650a02b1344c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-blank-rome-welcomes-accomplished-litigation-partner-in-philadelphia.html", "country": "US", "domain_rank": 767, "title": "Blank Rome Welcomes Accomplished Litigation Partner in Philadelphia", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-24T20:35:00.000+02:00", "replies_count": 0, "uuid": "f91371ca84401dc2bc1c97ee9a27650a02b1344c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-blank-rome-welcomes-accomplished-litigation-partner-in-philadelphia.html", "ord_in_thread": 0, "title": "Blank Rome Welcomes Accomplished Litigation Partner in Philadelphia", "locations": [], "entities": {"persons": [{"name": "charles s. marion", "sentiment": "negative"}, {"name": "alan j. hoffman", "sentiment": "none"}, {"name": "chuck", "sentiment": "none"}, {"name": "marion", "sentiment": "none"}], "locations": [{"name": "philadelphia philadelphia", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "blank rome welcomes accomplished litigation partner", "sentiment": "negative"}, {"name": "blank rome llp", "sentiment": "negative"}, {"name": "pepper hamilton llp", "sentiment": "none"}, {"name": "blank rome", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA--(BUSINESS WIRE)-- Blank Rome LLP is pleased to announce that Charles S. Marion has joined the Firm as a Partner in the Commercial Litigation group in the Philadelphia office. At Blank Rome, Mr. Marion’s litigation practice will focus primarily in the areas of intellectual property, franchise, securities, product liability, and complex business disputes. He joins Blank Rome from Pepper Hamilton LLP.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180124005951/en/\nCharles S. Marion (Photo: Business Wire)\n“We are thrilled to welcome Chuck to Blank Rome,” said Alan J. Hoffman , the Firm’s Chairman and Managing Partner. “For nearly three decades, Chuck has handled a wide range of complex business disputes and litigation, including counseling clients through alternative dispute resolution processes such as mediation and arbitration. We’re happy to add another accomplished litigator like Chuck to our team of former prosecutors, former judges, and seasoned trial attorneys.”\nAn experienced litigator, Mr. Marion has tried cases to verdict in various state and federal courts throughout the United States. He has also served as lead counsel in domestic and international arbitrations, and regularly represents clients in various types of alternative dispute resolution. In terms of his intellectual property litigation experience, Mr. Marion has tried patent and trademark infringement cases, claims for unfair competition and breach of non-compete and/or non-solicitation agreements, trade secret misappropriation disputes, and numerous injunction actions. Mr. Marion also counsels clients whose websites have been accused of violating the Americans with Disabilities Act, and serves as a thought leader on the subject.\n“Chuck and I have known each other since our days as law school classmates at the University of Pennsylvania,” said Grant S. Palmer , Chair of Blank Rome’s Litigation Department. “Throughout his career, Chuck has developed a deep sense of empathy for his clients, who often face uncertain times during litigation. Considerate of the risk involved with litigation, Chuck counsels clients on strategies they can use to resolve a lawsuit as favorably and swiftly as possible, but on the best possible terms. I’m confident that Chuck will be a great addition to our team of more than 300 litigators across the country.”\nMr. Marion represents corporations and individuals in a variety of industries and his intellectual property and product liability cases involve a wide range of technologies, devices, and products (both consumer and industrial).\n“I’m very excited to join Blank Rome and work alongside the collegial team of attorneys at the Firm,” said Mr. Marion. “Blank Rome provides me and my clients with an extended platform in terms of geographic reach, including in Florida, as well as additional service offerings and industry capabilities, including finance, gaming, and franchise law, all of which are increasingly important to our economy. I’m impressed by Blank Rome’s steady and strategic growth over the past several years, as well as the Firm’s collaborative approach to client service.”\nMr. Marion was also attracted to Blank Rome for its deep tradition of pro bono service, commitment to diversity and inclusion , and respect for the community. Similarly, Mr. Marion is an active member of several professional, charitable, educational, and community organizations. He serves as president and trustee of the Chestnut Hill Community Fund, a charitable trust that manages an endowment fund and other assets for the benefit of the Chestnut Hill Community Association in Philadelphia. He also serves as a member of the advisory council of the Salvation Army Kroc Center of Philadelphia. He is a member of the board of directors of the Wharton Alumni Club of Philadelphia and chairs the club’s monthly networking breakfast meetings. Additionally, he founded the 2T Group, a business networking group based in Philadelphia.\nMr. Marion earned his J.D. from the University of Pennsylvania Law School, his B.A. in American History, with honors, from the University of Pennsylvania, and his B.S. in Economics from The Wharton School at the University of Pennsylvania.\nAbout Blank Rome LLP\nBlank Rome is an Am Law 100 firm with 13 offices and more than 600 attorneys and principals who provide comprehensive legal and advocacy services to clients operating in the United States and around the world. Our professionals have built a reputation for their leading knowledge and experience across a spectrum of industries, and are recognized for their commitment to pro bono work in their communities. Since our inception in 1946, Blank Rome’s culture has been dedicated to providing top-level service to all of our clients, and has been rooted in the strength of our diversity and inclusion initiatives. For more information, please visit blankrome.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005951/en/\nBlank Rome LLP\nKate Tavella, 215.988.6988\ntavella@blankrome.com\nSource: Blank Rome LLP", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.blankrome.com%2Fpeople%2Fgrant-s-palmer&esheet=51748372&newsitemid=20180124005951&lan=en-US&anchor=Grant+S.+Palmer&index=4&md5=4025e8734b738f4355db2798f31d4872", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.blankrome.com%2Fpro-bono&esheet=51748372&newsitemid=20180124005951&lan=en-US&anchor=pro+bono&index=5&md5=55838154c77461e760780d01809fbe83", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.blankrome.com%2F&esheet=51748372&newsitemid=20180124005951&lan=en-US&anchor=blankrome.com&index=7&md5=04e0ef2a7f15539e95dab4b48932811f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.blankrome.com%2F&esheet=51748372&newsitemid=20180124005951&lan=en-US&anchor=Blank+Rome+LLP&index=1&md5=fef9c524a356b423acfc7e138d8c4213", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.blankrome.com%2Findex.cfm%3FcontentID%3D10%26bioID%3D410&esheet=51748372&newsitemid=20180124005951&lan=en-US&anchor=Alan+J.+Hoffman&index=3&md5=c957a6d5d39d50c5f9a3938298ea7be5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.blankrome.com%2Fservices%2Flitigation%2Fbusiness-litigation&esheet=51748372&newsitemid=20180124005951&lan=en-US&anchor=Commercial+Litigation&index=2&md5=4af065fdb4475262351a9d327458fb54", "http://www.businesswire.com/news/home/20180124005951/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.blankrome.com%2Fdiversity-inclusion&esheet=51748372&newsitemid=20180124005951&lan=en-US&anchor=diversity+and+inclusion&index=6&md5=f7152aeb36cc658948c8f1177f10f6ca"], "published": "2018-01-24T20:35:00.000+02:00", "crawled": "2018-01-24T23:33:26.003+02:00", "highlightTitle": ""}