{"organizations": [], "uuid": "b8db706beb5b9d745204c0db3a65bf41287bd865", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226984272&w=1200&r=LYNXMPEE0U15C", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/britain-eu-finance/eu-officials-reject-city-of-londons-brexit-blueprint-for-banks-sources-idINKBN1FK1BE", "country": "US", "domain_rank": 408, "title": "EU rejects Brexit plan for banks by Britain's financial industry", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:26:00.000+02:00", "replies_count": 0, "uuid": "b8db706beb5b9d745204c0db3a65bf41287bd865"}, "author": "", "url": "https://in.reuters.com/article/britain-eu-finance/eu-officials-reject-city-of-londons-brexit-blueprint-for-banks-sources-idINKBN1FK1BE", "ord_in_thread": 0, "title": "EU rejects Brexit plan for banks by Britain's financial industry", "locations": [], "entities": {"persons": [{"name": "huw jones", "sentiment": "none"}, {"name": "britai", "sentiment": "none"}, {"name": "andrew macaskill", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 10:52 AM / Updated 16 minutes ago EU rejects Brexit plan for banks by Britain's financial industry Andrew MacAskill , Huw Jones 5 Min Read \nLONDON (Reuters) - European Commission officials have rejected the City of London’s proposal to strike a post-Brexit free trade deal on financial services, a major blow to Britain’s hopes of keeping full access to EU markets for one of the world’s top two financial centres. \nThe decision increases the likelihood that the City will trade with Europe under less favourable terms and could accelerate corporate contingency plans to move more operations to the continent from London. \nSince Britain voted to leave the EU 19 months ago, some of the world’s most powerful finance companies in London have been searching for a way to preserve the existing cross-border flow of trading after it leaves the bloc in 2019. \nOfficials from the European Union’s executive told British financiers in meetings in recent weeks they won’t agree to a deal that would allow finance companies to operate in each others’ markets without barriers because Britain has said it will leave the single market, according to two people who attended the meetings. \nThe City’s plan proposed that Britain and the EU would allow cross border trade in financial services on the condition that each side preserve regulatory standards in line with the best international standards. This model would be maintained by close co-operation between regulators and financial policymakers. \nThe proposals are the most detailed on how a long-term agreement on financial services with the EU may work after Brexit, with papers setting out how a pact could be structured and policed, and it has been endorsed by Britain’s Brexit minister David Davis. \nBut EU officials are dismissive of any trade models that would see Britain retain similar levels of market access while leaving the single market regime. \n“They have made it very clear to us that this is unacceptable to them,” said one senior British finance executive present at one of the meetings. “This was our best and frankly only proposal. We don’t have a plan B.” \nSterling slipped against the dollar and euro on Wednesday on news of the rejection. \nBritain’s vast financial services looks set to be one of the most divisive areas in the Brexit negotiations, with Britain demanding a generous deal while the EU refuses to shift from its insistence that Britain’s red lines -- such as ending the free movement of workers from the EU -- make that impossible. \nBritain is currently home to the world’s largest number of banks and hosts the largest commercial insurance market. About six trillion euros ($7.47 trillion), or 37 percent, of Europe’s financial assets are managed in the UK capital, almost twice the amount of its nearest rival, Paris. \nIn addition, London dominates Europe’s 5.2 trillion euro investment banking industry. \nBut unless it can secure a trade deal, for all its geographic proximity, Europe’s largest financial capital will end up adrift with the same access to the EU as other countries like Singapore. A worker walks past office skyscrapers in the City of London financial district, London, Britain, January 25, 2018. Picture taken January 25, 2018. REUTERS/Toby Melville CONTINGENCY PLANS \nBritain’s finance minister Philip Hammond warned Europe last week that hurting London’s financial centre would push business to New York and Singapore to the detriment of Europe as a whole, and he called for a bespoke trade deal with the EU. \nThe rejection of the proposed trade deal represents a second setback for the City of London, which had initially pinned hopes on Britain maintaining “passporting” in financial services after Brexit. \nThis means finance executives may have to rely on what it known as equivalence. The legal mechanism allows countries from outside the EU to access the single market in limited circumstances but access is patchy and can be revoked at short notice. Slideshow (2 Images) \nEuropean Union negotiators see no room for discussion with Britain on passporting, diplomats in Brussels said on Wednesday. \nMark Hoban, a former City minister who chaired the body that wrote the blueprint, acknowledged it was ambitious but said it has the interest of government and was being discussed by EU states. \n“There is agreement that the existing third country regime does not provide a robust basis for maintaining high levels of trade,” Hoban told Reuters. \nThe Commission did not immediately respond to requests for comment. \nThe rejection of the proposals may reinforce the view among some finance executives that they must plan for a worst-case scenario by moving more of their pan-European operations to the continent. \nMany are already unhappy with the government for failing to clearly spell out what it views as its preferred trading relationship with the EU. \nA lawyer who helped negotiate the last implemented trade deal with the European Union also said Britain should temper its expectation of securing a wide-ranging deal on financial services. \nChristophe Bondy, the senior legal counsel during Canada’s negotiations for a trade deal with the EU, said Canada worked very hard to achieve a high standard trade deal with the EU, but still ended up with modest outcomes in financial services. \n($1 = 0.8035 euros)", "external_links": [], "published": "2018-01-31T17:26:00.000+02:00", "crawled": "2018-01-31T17:50:44.008+02:00", "highlightTitle": ""}