{"organizations": [], "uuid": "0421833548adf317f12a2eae9a6e4004ad142c72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-silver-spring-networks-stockholders-approve-merger-with-itron.html", "country": "US", "domain_rank": 767, "title": "Silver Spring Networks Stockholders Approve Merger with Itron", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:05:00.000+02:00", "replies_count": 0, "uuid": "0421833548adf317f12a2eae9a6e4004ad142c72"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-silver-spring-networks-stockholders-approve-merger-with-itron.html", "ord_in_thread": 0, "title": "Silver Spring Networks Stockholders Approve Merger with Itron", "locations": [], "entities": {"persons": [{"name": "silver spri", "sentiment": "negative"}], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "wash.", "sentiment": "none"}, {"name": "itron liberty lake", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "itron, inc.", "sentiment": "neutral"}, {"name": "networks, inc.", "sentiment": "none"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "itron itron", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "itron", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LIBERTY LAKE, Wash. & SAN JOSE, Calif.--(BUSINESS WIRE)-- Itron, Inc. (NASDAQ: ITRI) and Silver Spring Networks, Inc. (NYSE: SSNI) today announced that Silver Spring Networks stockholders have approved the previously announced merger with Itron. Silver Spring Networks and Itron expect the transaction to close on or about Jan. 4, 2018.\nAt the special meeting of stockholders, approximately 68 percent of the outstanding shares of common stock entitled to vote at the meeting voted in favor of the proposal to adopt the merger agreement and approve the merger, based on the preliminary results of voting. The final results of voting will be reported in a Current Report on Form 8-K to be filed with the Securities and Exchange Commission.\nAbout Itron\nItron is a world-leading technology and services company dedicated to the resourceful use of energy and water. We provide comprehensive solutions that measure, manage and analyze energy and water. Our broad product portfolio includes electricity, gas, water and thermal energy measurement devices and control technology; communications systems; software; as well as managed and consulting services. With thousands of employees supporting nearly 8,000 customers in more than 100 countries, Itron applies knowledge and technology to better manage energy and water resources. Together, we can create a more resourceful world. Join us: www.itron.com .\nItron ® is a registered trademark of Itron, Inc. All third party trademarks are property of their respective owners and any usage herein does not suggest or imply any relationship between Itron and the third party unless expressly stated.\nAbout Silver Spring Networks\nSilver Spring Networks enables the Internet of Important Things™ by reliably and securely connecting things that matter. Cities, utilities, and companies on five continents use the company’s cost-effective, high-performance IoT network and data platform to operate more efficiently, get greener, and enable innovative services that can improve the lives of millions of people. With more than 27.3 million devices delivered, Silver Spring Networks provides a proven standards-based platform safeguarded with military grade security. Silver Spring Networks’ customers include Baltimore Gas & Electric, CitiPower & Powercor, ComEd, Consolidated Edison, CPS Energy, Florida Power & Light, Pacific Gas & Electric, Pepco Holdings, and Singapore Power. Silver Spring Networks has also deployed networks in Smart Cities including Copenhagen, Glasgow, Paris, Providence, and Stockholm. To learn more, visit www.ssni.com .\nForward Looking Statements\nThis release contains forward-looking statements within in the meaning of the Private Securities Litigation Reform Act of 1995, including but not limited to statements regarding the expected timing of the completion of the previously announced pending acquisition of Silver Spring Networks by Itron. Statements that include words such as “anticipates,” “expects,” “intends,” “plans,” “predicts,” “believes,” “seeks,” “estimates,” “may,” “will,” “should,” “would,” “potential,” “continue,” “goals,” “targets” and variations of these words (or negatives of these words) or similar expressions of a future or forward-looking nature identify forward-looking statements. In addition, any statements that refer to projections or other characterizations of future events or circumstances, including any underlying assumptions are forward-looking statements. Although we believe the estimates and assumptions upon which these forward-looking statements are based are reasonable, any of these estimates or assumptions could prove to be inaccurate and the forward-looking statements based on these estimates and assumptions could be incorrect. Important factors and uncertainties that could cause actual results to differ materially from those described in these forward-looking statements include, without limitation: uncertainties as to the timing of the transaction; the conditions to the completion of the transaction may not be satisfied; legal proceedings that may be instituted against Itron or Silver Spring Networks and others following announcement of the proposed transaction; and other factors detailed in Silver Spring Networks’ Annual Report on Form 10-K filed with the U.S. Securities and Exchange Commission (the “SEC”) for the fiscal year ended Dec. 31, 2016 and Silver Spring Networks’ other filings with the SEC, which are available at http://www.sec.gov and on Silver Spring Networks’ website at www.ssni.com ; and other factors discussed in Itron’s Annual Report on Form 10-K filed with the SEC for the year ended Dec. 31, 2016 and Itron’s other filings with the SEC, which are available on Itron’s website at www.itron.com . Itron and Silver Spring Networks assume no obligation to update the information in this communication, except as otherwise required by law. Readers are cautioned not to place undue reliance on these forward-looking statements that speak only as of the date hereof.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103006161/en/\nItron, Inc.\nBarbara Doyle\nVice President, Investor Relations\n509-891-3443\nbarbara.doyle@itron.com\nor\nAngela Lockwood\nDirector, Public Relations\n509-891-3816\nangela.lockwood@itron.com\nor\nSilver Spring Networks\nMedia Contact:\nMarina Donovan\nVice President, Marketing\n669-770-4852\nmdonovan@ssni.com\nor\nInvestor Contact:\nMark McKechnie\nVice President, Investor Relations\n669-770-4664\nmarkm@ssni.com\nSource: Itron, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.itron.com%2F&esheet=51737519&newsitemid=20180103006161&lan=en-US&anchor=www.itron.com&index=1&md5=dcef3c4654f175905f6b24cb9afa4279", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ssni.com&esheet=51737519&newsitemid=20180103006161&lan=en-US&anchor=www.ssni.com&index=4&md5=9b2c466dc7550c85fb6e5c873099a74a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.itron.com&esheet=51737519&newsitemid=20180103006161&lan=en-US&anchor=www.itron.com&index=5&md5=764bebbdc26bc0b917676d5712b39ca4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51737519&newsitemid=20180103006161&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=3&md5=99ce53e3b5f774924978613478375d20", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ssni.com%2F&esheet=51737519&newsitemid=20180103006161&lan=en-US&anchor=www.ssni.com&index=2&md5=3ae5e47fa279441ca8d8e23361be97ac", "http://www.businesswire.com/news/home/20180103006161/en/"], "published": "2018-01-04T00:05:00.000+02:00", "crawled": "2018-01-04T00:35:31.026+02:00", "highlightTitle": ""}