{"organizations": [], "uuid": "59df585767f9eddd8a7a35c0dad731ff89c98140", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-norway-swf-ethics/norways-wealth-fund-may-blacklist-firms-over-recruitment-practices-idUSKBN1EY1TJ", "country": "US", "domain_rank": 408, "title": "Norway's wealth fund may blacklist firms over recruitment practices", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:26:00.000+02:00", "replies_count": 0, "uuid": "59df585767f9eddd8a7a35c0dad731ff89c98140"}, "author": "", "url": "https://www.reuters.com/article/us-norway-swf-ethics/norways-wealth-fund-may-blacklist-firms-over-recruitment-practices-idUSKBN1EY1TJ", "ord_in_thread": 0, "title": "Norway's wealth fund may blacklist firms over recruitment practices", "locations": [], "entities": {"persons": [{"name": "johan andresen", "sentiment": "none"}, {"name": "camilla knudsen", "sentiment": "none"}], "locations": [{"name": "norway", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "min read  oslo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 3:29 PM / in 15 minutes Norway's wealth fund may blacklist firms over recruitment practices Camilla Knudsen 3 Min Read \nOSLO (Reuters) - The ethics watchdog for Norway’s $1 trillion wealth fund will this year identify companies that violate workers’ rights when hiring people for jobs in the Middle East, and recommend excluding them from the fund’s portfolio. \nCompanies in the global shipping industry will also face scrutiny and risk being blacklisted if their recycling of obsolete vessels fails to meet certain standards, Johan Andresen, chairman of fund’s ethics panel told Reuters on Tuesday. \nNorway’s sovereign wealth fund, the world’s largest, has been built up from surpluses from the country’s oil industry and has stakes in some 9,000 companies, owning 1.4 percent of all listed shares globally. \nThe Norwegian parliament has set several ethics mandates for the fund, targeting tobacco makers, human rights violations and excessive emissions of climate change gases, among others, as grounds for exclusion from the fund’s investment portfolio. \nThe fund has already excluded dozens of companies for environmental reasons, nuclear arms production and other infringements of its policies, but it has yet to identify candidates in all categories. \n“We’re actively working on human rights violations in the Middle East, particularly recruitment practices that put vulnerable people in a position where they have no choice,” Andresen told Reuters on the sidelines of a business conference. \nWorkers hired from Bangladesh and Nepal were among the ones exposed to such practices, he added. \n“This is hardly a novel topic, but not all companies understand that the recruiters also have a responsibility. We’ve not made recommendations (for exclusion) in this area in the past, but we will this year,” Andresen said. \nRecommendations for exclusion are sent to the board of the Norwegian central bank, which manages the fund and must decide whether to sell all shares in a company, or potentially put it on an observation list. \nAndresen said shipping firms engaged in so-called “beaching”, running old vessels aground to be picked apart by manual labor, were also unacceptable. \n“This actually covers two of our criteria, both environmental damage and human rights. We’re looking at several companies and a recommendation of exclusion should come in a relatively short time,” he added. Writing by Terje Solsvik. Editing by Jane Merriman", "external_links": [], "published": "2018-01-09T17:26:00.000+02:00", "crawled": "2018-01-09T17:46:26.030+02:00", "highlightTitle": ""}