{"organizations": [], "uuid": "5a5e5b12284b63c8ffec1e7fbc5babb4f5ca3b49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/28/103589474-GettyImages-522562612.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/hey-uber-lyft-drivers-automakers-may-make-a-car-just-for-you.html", "country": "US", "domain_rank": 767, "title": "Hey, Uber, Lyft drivers: Automakers may make a car just for you", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:51:00.000+02:00", "replies_count": 0, "uuid": "5a5e5b12284b63c8ffec1e7fbc5babb4f5ca3b49"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/hey-uber-lyft-drivers-automakers-may-make-a-car-just-for-you.html", "ord_in_thread": 0, "title": "Hey, Uber, Lyft drivers: Automakers may make a car just for you", "locations": [], "entities": {"persons": [{"name": "orth hedrick", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "north american international auto show", "sentiment": "none"}, {"name": "kia motors america", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Having watched the rise of ride-hailing apps, automakers are poised start making changes to new cars to cater directly to a new group of customers -- Uber and Lyft drivers.\nWith millions of Americans pressing their own cars into service to ferry passengers, auto companies are seeing a market for a new class of vehicles better suited to the task.\nThey are weighing, for instance, whether to add more durable materials in the back seat and features especially directed at helping vehicles handle wear-and-tear from ride-hailing duty in ways no normal driver would expect.\nAt least one automaker is considering offering a special model tailored to the needs of ride-hailing drivers.\nRead more from USA Today:\nBeyond Apple repatriation: 16 US corporate giants have $1 trillion in cash\nAmazon raises monthly Prime rate, annual rate stays at $99\n'Alt-right' escalates war against Silicon Valley, pledges to expose bias against conservatives\n\"We're looking at it,\" Orth Hedrick, vice president of product planning for Kia Motors America, told USA TODAY at the North American International Auto Show in Detroit . \"We have a test vehicle that's under development now. We're going to try some new ideas and see what the response is because it is a growing trend.\"\nThe Kia model could qualify as a special trim level or a package upgrade, Hedrick suggested. It would likely involve \"a lot more features in the rear seat, plug-ins, cupholders, vents, controls, things like that,\" he said.\nRaising the bar for all cars The ride-hailing trend could raise the bar for cars sold to normal consumers, as well.\n\"If you put [a special feature] on one vehicle, everyone's like, 'Wait a minute, why is that on that one and not on mine?'\" Hedrick said. \"So probably what we'll end up having to do is look to lift the standards for all of them.\"\nAs ride-hailing apps become more popular, particularly in cities, many drivers have made their own modifications. It's not uncommon to see Uber and Lyft vehicles with makeshift coverings on their seats or special floor mats to prevent permanent damage.\nUber chairman Garrett Camp said last year that the company had 2 million drivers in the U.S. Reports indicate a high rate of turnover among drivers, which likely means several million vehicles are used in a ride-hailing app at some point in a given year.\nAbout 25% of miles traveled by Americans in a given year occur in modes that can already be classified as \"shared,\" said Mike Jackson, CEO of AutoNation , the largest dealership company in the U.S., at Automotive News World Congress in Detroit. That figure includes ridesharing, taxis, mass transit, corporate fleet vehicles and rental cars.\nThe condensed life cycle of vehicles that rack up miles at a furious pace in ride-hailing app usage requires engineers to consider changes to more than just interior materials.\n\"That's a lot of accelerated wear the automakers are going to have to think about,\" said Joe Wiesenfelder, executive editor of Cars.com. Vehicles \"may need to be fortified to make them more durable.\"\nFor example, he said, \"that's a lot of doors being opened and closed\" in a short time-span.\nBeen there, done that Some automakers are already offering vehicles for commercial use that could also be sold to ride-hailing app drivers.\nGeneral Motors offers on-demand car sharing for ride-hailing drivers in urban areas through a service called Maven. The program is stocked with vehicles featuring offerings such as rear USB outlets and easy-to-clean leather seats.\nToyota sells a version of the Prius, for example, with specifications \"that meet their commercial needs\" in the taxi business, Toyota North America CEO Jim Lentz said.\n\"If you have a commercial-grade vehicle, your spec's a little bit different,\" Lentz said. \"You may have a thicker vinyl seat, you may have a more robust suspension, more robust radiator, battery, all of that stuff.\"\nLentz said it would not be ideal to offer the same car with entirely different materials and performance specifications for ordinary retail buyers versus ride-hailing app drivers.\n\"That's something manufacturers are going to have to grapple with because it just adds so much complexity if you try to stock both vehicles,\" he said. So \"we've got to be cognizant to make sure our material (specifications) will be able to handle higher usage.\"\nThis issue will become especially pertinent when self-driving vehicles make their way into ride-sharing fleets with almost around-the-clock usage.\n\"A three-year-old car might look a lot like a 15-year-old car with that usage,\" Wiesenfelder said.\nThat's where vehicle maintenance companies will become critical.\nAutoNation recently reached a deal to provide long-term maintenance and fixes to former Google car project Waymo's forthcoming fleeting of self-driving vehicles. And rental car company Avis will service Waymo's test vehicles in the Phoenix area.\nAutoNation's Jackson described ride-sharing vehicle maintenance as a vital revenue opportunity for dealerships.", "external_links": ["https://www.usatoday.com/topic/2018-Detroit-Auto-Show/", "https://www.usatoday.com/story/money/markets/2018/01/19/beyond-apple-repatriation-16-us-corporate-giants-have-1-trillion-cash/1048287001/", "https://www.usatoday.com/story/tech/2018/01/18/alt-right-escalates-war-against-silicon-valley-pledges-expose-bias-against-conservatives/1037524001/", "https://medium.com/@gc/ubers-path-forward-b59ec9bd4ef6", "https://www.usatoday.com/story/tech/news/2018/01/19/amazon-raises-monthly-prime-rate-annual-rate-stays-99/1046646001/"], "published": "2018-01-19T22:51:00.000+02:00", "crawled": "2018-01-19T22:24:56.000+02:00", "highlightTitle": ""}