{"organizations": [], "uuid": "5794839233a34af244743dfed6b640ed192ea74f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/europe-stocks/update-1-european-shares-post-modest-rise-after-u-s-and-asia-rally-idUSL8N1PD1QU", "country": "US", "domain_rank": 408, "title": "UPDATE 1-European shares post modest rise after U.S. and Asia rally", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T11:30:00.000+02:00", "replies_count": 0, "uuid": "5794839233a34af244743dfed6b640ed192ea74f"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/update-1-european-shares-post-modest-rise-after-u-s-and-asia-rally-idUSL8N1PD1QU", "ord_in_thread": 0, "title": "UPDATE 1-European shares post modest rise after U.S. and Asia rally", "locations": [], "entities": {"persons": [{"name": "julien ponthus", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "infineon", "sentiment": "none"}, {"name": "geberit", "sentiment": "none"}, {"name": "carrefour", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 9:30 AM / in 5 minutes UPDATE 2-European shares edge higher as cyclicals back in favour Reuters Staff \n* STOXX 600 up 0.2 pct at close \n* Switzerland’s Geberit rises after update \n* Upgrades boost Infineon \n* Financials, tech and materials lead rise (Recasts, adds detail and quote, updates prices at close) \nBy Julien Ponthus and Kit Rees \nLONDON, Jan 18 (Reuters) - European shares notched up modest gains on Thursday, led higher by a fresh rise for so-called cyclical stocks while company updates and ratings changes from brokers spurred moves among individual names. \nThe pan-European STOXX 600 was up 0.2 percent at its close, while the UK’s FTSE declined 0.3 percent. \nSwitzerland’s Geberit posted the best performance among European stocks, with a 6.5 percent rise after reporting a 3.5 percent increase in 2017 sales. \nIn France, Carrefour was among the top performers on the CAC 40 with a 3 percent rise, with traders saying stronger-than-expected fourth quarter sales from the supermarket chain had offset the negative impact of a new profit forecast cut. \nIn Frankfurt, German chipmaker Infineon led the DAX higher, adding 5.6 percent after getting a rating upgrade from Goldman Sachs, while SocGen began its coverage of the stock with a “buy” rating. \nThe tech sector was the best performer throughout Europe, up 1 percent with STMicro leading Milan’s bourse with a 3.8 percent rise. Strong results by ASML had lifted investors’ spirits on the industry during the previous session. \nTech, along with financials and materials, added the most points to the STOXX, as investors continued to rotate into stocks which are more dependent on economic growth. \n“We see sustained above-trend economic expansion and a steady earnings outlook supporting cyclicals,” Richard Turnill, BlackRock’s global chief investment strategist, said in a note. \nIn the UK, Whitbread rose 3.5 percent despite reporting tough consumer market conditions after sources told Reuters that activist investor Sachem Head was asking Britain’s biggest hotel and coffee shop operator to consider splitting off the Costa Coffee chain. \n“The pressure on the UK high street may indeed make this the time for Whitbread to at least look at its options. Break up rumours could support the share price even in the face of weaker LFL (like-for-like) sales growth,” said ETX Capital senior market analyst Neil Wilson. \nPrimark owner Associated British Foods was down 3.6 percent after saying that revenues and profits at its sugar business would fall by more than previously expected due to lower European Union sugar prices. \nIn Belgium, Ablynx rose 1.7 percent after its largest shareholder said Denmark’s Novo Nordisk would need to raise its offer if it wanted to buy the Belgian biotech group. (Reporting by Julien Ponthus and Kit Rees; Editing by Kevin Liffey and Toby Davis)", "external_links": [], "published": "2018-01-18T11:30:00.000+02:00", "crawled": "2018-01-18T11:50:12.005+02:00", "highlightTitle": ""}