{"organizations": [], "uuid": "ae769afe02fd435a24c898d9258829bddef1b896", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-new-editor-expected-in-latest-shake-up-at-los-angeles-times.html", "country": "US", "domain_rank": 767, "title": "New editor expected in latest shake-up at Los Angeles Times", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T07:59:00.000+02:00", "replies_count": 0, "uuid": "ae769afe02fd435a24c898d9258829bddef1b896"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-new-editor-expected-in-latest-shake-up-at-los-angeles-times.html", "ord_in_thread": 0, "title": "New editor expected in latest shake-up at Los Angeles Times", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (AP) — In another newsroom shake-up at the Los Angeles Times, veteran journalist Jim Kirk is expected to be named editor in chief to replace Lewis D'Vorkin, whose short tenure was marked by clashes with staff, the paper reported Monday.\nKirk, 52, would become the third top editor at the Times in less than six months. He was named interim editor of the paper on Aug. 21 after a management overhaul then stepped aside after D'Vorkin joined the paper in early November.\nKirk previously worked at the Chicago Tribune, Bloomberg News and Adweek.\nHe became publisher and editor of the Chicago Sun-Times after it was purchased in 2012 by Michael Ferro, who is now chairman of Tronc.\nKirk took the job at the Los Angeles Times just two weeks after being named interim editor of the New York Daily News.\nReporters at the Times have become alarmed by recent hiring of several news executives who reported to business executives — not to editors in the newsroom.\nThose hires sparked fears that the business side would wield undue influence in editorial matters. Traditionally, the editorial and business sides of a paper work separately to maintain journalistic credibility.\nEarlier this month journalists at the Times voted to unionize for the first time in the paper's 136-year history.\nD'Vorkin, 65, will move into a new job as chief content officer for Tronc, developing content for digital and mobile consumers, according to company spokeswoman Marisa Kollias. He was chief product officer at Forbes until October.\n\"We are continuing to invest in high-quality journalism, which will always be the company's top priority,\" Justin Dearborn, Tronc's chief executive, said in a statement,\nKirk will report to Tronc President Tim Knight.\nThe Times has seen years of staff cutbacks and management changes. D'Vorkin's nearly three-month tenure as editor was marked by two combative newsroom-wide staff meetings.\nReporters and editors expressed concern that Tronc was building a shadow newsroom to blur the lines between news and advertising and boost revenue. Editors and reporters asked questions about the business-side operation, but D'Vorkin and other Tronc executives declined to discuss their plans.\n\"The Los Angeles Times Guild would like to congratulate Jim Kirk on being named the next editor in chief of the Los Angeles Times,\" the steering committee said in a statement.. \"We also look forward to working together in the future as one team — and we look forward to hearing his plans for the paper.\"\nJust 10 days ago, Times' publisher Ross Levinsohn was placed on unpaid leave following revelations that he had been a defendant in two sexual harassment lawsuits while he worked at other media companies.\nTronc has hired a law firm to investigate the allegations against Levinsohn made in a detailed report by National Public Radio. The probe is ongoing.", "external_links": [], "published": "2018-01-29T07:59:00.000+02:00", "crawled": "2018-01-30T06:17:36.160+02:00", "highlightTitle": ""}