{"organizations": [], "uuid": "7b9e38fa0cc74e38ce9277fe8413d87923b62ca5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220292822&w=1200&r=LYNXMPEE070ZG", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/uk-biotech-m-a-analysis/11-billion-biotech-binge-fuels-forecasts-of-2018-ma-surge-idUKKBN1EX1KF", "country": "US", "domain_rank": 408, "title": "$11 billion biotech binge fuels forecasts of 2018 M&A surge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:05:00.000+02:00", "replies_count": 0, "uuid": "7b9e38fa0cc74e38ce9277fe8413d87923b62ca5"}, "author": "", "url": "https://uk.reuters.com/article/uk-biotech-m-a-analysis/11-billion-biotech-binge-fuels-forecasts-of-2018-ma-surge-idUKKBN1EX1KF", "ord_in_thread": 0, "title": "$11 billion biotech binge fuels forecasts of 2018 M&A surge", "locations": [], "entities": {"persons": [{"name": "ben hirsc", "sentiment": "negative"}, {"name": "baker mckenzie", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "sutton", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "celgene", "sentiment": "none"}, {"name": "takeda pharmaceutical", "sentiment": "none"}, {"name": "novo nordisk", "sentiment": "none"}, {"name": "ablynx", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "institute of cancer research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 3:11 PM / Updated an hour ago $11 billion biotech binge fuels forecasts of 2018 M&A surge Ben Hirschler 5 Min Read \nLONDON (Reuters) - An $11 billion (8.12 billion pounds) burst of biotech bids in just four days has fuelled expectations of a 2018 surge in life science deals as large drugmakers shop for promising assets from smaller rivals. FILE PHOTO: A scientist prepares protein samples for analysis in a lab at the Institute of Cancer Research in Sutton, Britain, July 15, 2013. REUTERS/Stefan Wermuth/File Photo \nSeparate reports on Monday by consultancy EY and law firm Baker McKenzie both predict a significant rise in mergers and acquisitions (M&A) this year, helped by U.S. tax changes that may lift big companies’ appetite for deals. \nCelgene’s ( CELG.O ) up to $7 billion agreed takeover of Impact Biomedicines, Novo Nordisk’s ( NOVOb.CO ) $3.1 billion offer for Ablynx ( ABLX.BR ) and Takeda Pharmaceutical’s ( 4502.T ) plan to buy TiGenix ( G9U.BR ) for $630 million have already got 2018 off to a flying start. \nThis follows a relatively subdued 2017, when total life sciences M&A totalled around $200 billion, dominated by Johnson & Johnson’s ( JNJ.N ) $30 billion purchase of Actelion and Gilead’s ( GILD.O ) $12 billion acquisition of Kite. \nEY is confident this year’s deal value will exceed $200 billion, given companies’ increased financial firepower and balance sheet strength. There is also substantial pent-up demand, with 60 percent of life sciences executives surveyed in October 2017 planning to actively pursue M&A in the next 12 months, compared with 46 percent in April. \nBaker McKenzie, meanwhile, predicts global healthcare M&A could rise 50 percent in 2018, with North America accounting for well over half of transactions. \nDriving the demand is the increasingly pivotal role of biotech firms in discovering the drugs of tomorrow. \n“I believe you will see a higher proportion of innovation at an industry level -- and also at Novo Nordisk -- coming from external resources,” Novo’s Chief Financial Officer Jesper Brandgaard told Reuters. \n“Ablynx is an example of strong technology development occurring in a smaller biotech setting, with considerable speed and a lack of some of the bureaucracy you can get at large pharma companies.” FILE PHOTO:A scientist prepares protein samples for analysis in a lab at the Institute of Cancer Research in Sutton, July 15, 2013. REUTERS/Stefan Wermuth/File Photo. NICHE DISEASES \nU.S. drug approvals hit a 21-year high in 2017, with 46 novel medicines winning a green light and a growing share of new products coming from younger biotech companies. \nFor large drugmakers, as well as big biotech businesses like Gilead and Celgene, small and innovative upstarts are now a vital source of experimental drugs with which to top up in-house development pipelines. \nPricing pressures on established medicines for conditions like diabetes and respiratory disorders, as well as patent expiries on yesterday’s blockbusters, are driving big players into niche disease areas where biotech groups often excel, according to Edison analyst and former fund manager Andy Smith. \n“The pressures at big pharma look to be increasing and 90 percent of prescriptions in the U.S. are now for generics, so that pushes companies to look at cutting-edge therapies and it takes them straight into the biotech wheelhouse,” he said. \nWhether 2018 will turn out to be a golden year for biotech M&A remains to be seen, but investors like event-driven hedge fund Case Equity Partners have high hopes for the drugs sector, following recent implementation of U.S. tax changes. \n“U.S. companies with lots of cash trapped overseas can now put capital to work in the global M&A market more easily. We hence expect 2018 to be immensely active with multiple competitive auctions at significant premia,” the fund said in a an end-of-year letter. \nAlthough bankers say the U.S. tax overhaul and particularly a lower tax rate for the repatriation of cash held offshore has so far had limited impact on deal negotiations, they believe companies may decide to allocate more cash to M&A in 2018. \nThe M&A outlook is likely to be a hot topic at the annual JP Morgan Healthcare Conference starting on Monday in San Francisco, when many biotech deals and alliances are often announced. \n(Graphic for U.S. FDA approvals at 21-year high, click tmsnrt.rs/2hGom21 ) Additional reporting by Maiya Keidan; editing by Alexander Smith", "external_links": [], "published": "2018-01-08T17:05:00.000+02:00", "crawled": "2018-01-08T17:34:29.000+02:00", "highlightTitle": ""}