{"organizations": [], "uuid": "7cfdb21e3b7dd53903132637881473fcc3907522", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/britain-boe-highlights/highlights-bank-of-englands-carney-speaks-in-uk-house-of-lords-idUSL8N1PP5TM", "country": "US", "domain_rank": 408, "title": "HIGHLIGHTS-Bank of England's Carney speaks in UK House of Lords", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-30T23:53:00.000+02:00", "replies_count": 0, "uuid": "7cfdb21e3b7dd53903132637881473fcc3907522"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/britain-boe-highlights/highlights-bank-of-englands-carney-speaks-in-uk-house-of-lords-idUSL8N1PP5TM", "ord_in_thread": 0, "title": "HIGHLIGHTS-Bank of England's Carney speaks in UK House of Lords", "locations": [], "entities": {"persons": [{"name": "carney", "sentiment": "negative"}, {"name": "mark carney", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "house of lords", "sentiment": "none"}, {"name": "affairs committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 30 (Reuters) - Bank of England Governor Mark Carney appeared on Tuesday before the Economic Affairs Committee in the upper house of Britain’s parliament, the House of Lords.\nBelow is a selection of his comments.\nWE DON‘T WANT TO BE ISSUING RPI-LINKED GOVT BONDS IN 10 YEARS\n”We’re still issuing on RPI, and yes, there is a short-term argument that of course it’s better to continue issuing on RPI, because of the liquidity and the benchmark ... I understand all those points.\n“But we wouldn’t want to be in the same position 10 years from now ... In the end, you have to pick a date, and it tends to be, 7, 8, 10 years down the road, at which you will have transitioned off.”\nU.S. ECONOMY FUNDAMENTALS ARE QUITE ROBUST “I appreciated the president’s comments of last Friday on the dollar.”\n“The U.S. economy is very strong, but relative to a strong US economy, and arguably a strengthening US economy, are others strengthening more, or in a more surprising way? And then there’s an adjustment. But certainly the fundamentals at present in the US are quite robust.”\nLESS CONFIDENT THAN BEFORE LOW PRODUCTIVITY IS CYCLICAL Question: “The problem of persistently low productivity... four and a bit years ago, you were confident that it was a cyclical phenomenon ... and would come right. Are you still confident about that? ”\nCarney: “I am less confident than I was then.”\nEXPECT PICK-UP IN PRODUCTIVITY TO 1-1.5 PCT A YEAR “We do expect some pick-up in productivity, similar orders of magnitude as the OBR to 1 to 1 and a quarter ... And I would be encouraged in part that we are seeing a much higher degree of churn in the labour market. One of the simplest avenues of productivity is growth is just individual bringing better ideas from top of the class firms to the middling order or the longer tail of firms.”\nHOUSEHOLD DEBT IS ONE OF MAIN RISKS TO UK ECONOMY “The financial policy committee does view the level of household debt as one of the main risks to the economy.”\nIT WOULD BE HELPFUL TO HAVE SINGLE MEASURE OF CONSUMER INFLATION\n”It would be helpful to just have one public-facing measure of the cost of living for consumers. At the moment, we have RPI ... we have CPI, which is what everyone virtually recognises and is our remit and then the ONS favoured the CPIH, which is the housing cost. At some point it would be good to consolidate the focus on one thing.\n“I am not advocating changing the inflation target to CPIH. I am not at this stage because it just doesn’t have the track record in place.”\nNOW ECONOMY GETTING TOWARDS FULL CAPACITY, TIMING AND STANCE OF POLICY BECOMES A MORE CONVENTIONAL DECISION\n“We felt it was appropriate, we felt that inflation could go above 3 percent, but most importantly we were taking a longer period of time to bring it back to 2 percent than usual because we wanted to support the economy during this period. Now that we’re getting towards full capacity in the economy, it becomes a much more conventional decision in terms of timing and stance of policy.”\nLABOUR MARKET HAS TIGHTENED, GRADUAL FIRMING OF WAGES ”The labour market has continued to tighten ... We see it in a gradual firming of wages.\n“The firming of the labour market and the pick-up in wages over the course of the next few years appears to be on track, so there is a prospect of a return of real income growth later this year.”\nPOSSIBLE TECH CHANGES WEIGHING ON WAGES BUT HARD TO QUANTIFY\n“With respect to the contestable aspects of technology, and whether there’s a broader weight of the changing nature of work that’s weighing on wages: it’s possible, but it’s very hard to quantify.”\nINFLATION PASS THROUGH DUE TO EXCHANGE RATE SHOCK HAS FURTHER TO GO\nQuestion: “You said earlier that the Bank had anticipated a fall in the exchange rate and some increased inflation. How far do you think we are now through this process? Does the recent stabilisation, to some degree, of the exchange rate suggest that we are now some distance through? Or do we have further to go?”\nCarney: “We have further to go.”\nINFLATION EFFECT FROM STERLING FALL HAS COME THROUGH AS BOE EXPECTED\n“The pass through has been behaving to the CPI as we had expected. So a material amount has come, but there is more to come gradually tapering off. It means that the reason why inflation has been above target today and is expected to remain above target in the near future is entirely because of the exchange rate.”\nMONETARY POLICY FOCUS INCREASINGLY ON INFLATION “The important thing with policy now ... is that as the trade-off has been removed, in other words, as slack in the economy has been taken out, we move into a more conventional area for monetary policy, where the focus is increasingly on returning inflation sustainably to target over an appropriate horizon.”\nOPPORTUNITY FOR UK/EU FINANCIAL SERVICES DYNAMIC EQUIVALENCE\n“There is a unique opportunity to have this type of arrangement, a dynamic equivalence arrangement, an arrangement that focuses on equivalence of outcomes, as opposed to textual equivalence of every rule. There are very strong incentives to do so.”\nEU WOULD BENEFIT FROM NOT FRAGMENTING FINANCIAL SERVICES ”Their competitiveness is well-served by having access to the leading global financial centre.\n”It avoids the loss of certain services that would inevitably happen if there were fragmentation. It avoids some of the financial stability risks...\n“The European Union benefits tremendously. Now the question is how. The incentives are there. The question is how you actually structure it”\nDISORDERLY BREXIT LOOKS LESS LIKELY THAN PREVIOUSLY “A disorderly Brexit -- not a likely scenario at all, less likely than at the time we did the assessment in the fall.”\nEXPECT INVESTMENT TO PICK UP IN 2019 ”I would expect that in 2019, that we will see a pick-up in investment in this economy.\n“My impression of UK business is they’re looking for certainty ... Once they get greater certainty ... they will look to put that money to work.”\nUK BUSINESS INVESTMENT NOT UP AS MUCH AS IT SHOULD BE “Business investment is not up any way to the degree that the world economy growing at over 4 percent with the easiest financial conditions, most supportive financial conditions in over a decade, with the strongest balance sheets in probably 25 years and huge opportunities in an environment of greater certainty.”\nUK BUSINESSES WAITING TO SEE FUTURE EU TRADE TIES “It’s understandable that our businesses, on the whole ... not all businesses but on average, on the whole, are waiting to see what their future arrangements are going to be with the EU and where the bigger opportunities are going to be outside. That’s understandable ... and we conduct policy accordingly.”\nBOE DOES NOT HAVE A BIAS ON BREXIT “We don’t have a bias, in terms of the outcome. We look at the economic forces ... however the negotiations go ... how it affects the exchange rate, how it affects the supply side of the economy, and how it affects demand.”\nUK ECONOMY OUTPERFORMANCE VS BOE FORECAST AUG 2016 ”If you look at the 1 percent difference between the two, what caused the discrepancy, with hindsight, the first fact is the world economy is much, much stronger and the European is much stronger.\n“Second factor is improved financial conditions, relative to the conditions at the time, and our expectations of those financial conditions ... There’s a tiny bit one could add as well for the loosening of fiscal policy ... (or) the reduced pace of tightening of fiscal policy would be the most accurate description there.”\nBOE GOT BROAD ECONOMICS RIGHT ON IMPACT OF BREXIT “I‘m going to reiterate the point about getting the broad economics right, which I think we did. We got the broad economic channels right, and taking what I, even with the wisdom of hindsight, very firmly believe was the right course of action to support the economy and to balance the return of inflation sustainably to target but also to support the economy during a period of some uncertainty.” (Reporting by Alistair Smout and Andrew MacAskill, editing by Estelle Shirbon)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T23:53:00.000+02:00", "crawled": "2018-01-31T16:44:04.003+02:00", "highlightTitle": ""}