{"organizations": [], "uuid": "a70e8da0fe90588921d1404ec3348b9311b0095f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104926456-breakfast_sandwich_10_480.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/save-time-and-money-by-prepping-these-delicious-breakfast-sandwiches.html", "country": "US", "domain_rank": 767, "title": "Save time and money by prepping these delicious breakfast sandwiches", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.043, "site_type": "news", "published": "2018-01-04T13:59:00.000+02:00", "replies_count": 0, "uuid": "a70e8da0fe90588921d1404ec3348b9311b0095f"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/03/save-time-and-money-by-prepping-these-delicious-breakfast-sandwiches.html", "ord_in_thread": 0, "title": "Save time and money by prepping these delicious breakfast sandwiches", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you get in the habit of going homemade rather than paying for a breakfast sandwich every morning, you can save a lot of money in the long run.\nAnd the good news is, you don't need a lot of time or resources to craft a delicious, homemade alternative. Just a few ingredients and a microwave can get you pretty far.\nIf you're time strapped and want to grab a hot breakfast without shelling out $10, try these, from a recipe provided by Tasty : You can make a bunch ahead of time and freeze them for up to one month. \nIngredients for 5 breakfast sandwiches: \n2 sausage patties 2 slices ham, quartered 5 eggs 1 splash milk salt, to taste pepper, to taste 2 bacons, sliced in half width-wise 5 english muffins, halved 5 slices cheddar cheese fresh spinach Preparation: \n1. On a large plate, arrange the sausage and the ham in a circle, then place a microwaveable mug in the center.\n2. Crack the eggs into the mug, season with salt, pepper and add a splash of milk. Stir until evenly mixed.\n3. Microwave the entire plate for about two minutes until the egg is cooked through, making sure it does not bubble over.\n4. Remove the plate and microwave the bacon strips on a separate plate for about four-to-seven minutes. Check the bacon at four minutes, then every minute or so to make sure it doesn't burn.\n5. Drain the bacon of its fat, then set aside.\n6. Invert the mug with the egg, then slice the egg cylinder into five equal rounds. You may have to run a knife around the mug first to ensure that the egg comes loose in one solid piece.\n7. To assemble, layer your sandwich as you'd like with the meat, egg, cheese and spinach.\n8. Wrap each sandwich in a damp paper towel, then with parchment paper. Place the sandwiches in a large zip top bag, then freeze for up until 1 month.\n9. When ready to eat, remove a sandwich from the freezer, unwrap the parchment and microwave for about two minutes. Cool for one minute, then unwrap the paper towel.\nDisclosure: CNBC parent NBCUniversal is a minority investor in BuzzFeed, the parent company of Tasty. \nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: 7 legit meals you can make in a microwave that will save you time and money \nshow chapters Egg hacks that will save you money and time      6:55 AM ET Tue, 2 Jan 2018 | 01:49", "external_links": [], "published": "2018-01-04T13:59:00.000+02:00", "crawled": "2018-01-04T14:00:23.003+02:00", "highlightTitle": ""}