{"organizations": [], "uuid": "e6223106a2681814e714dc2ea997a86a77ff71da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/dress-for-success-bin-1_outside-final2.jpeg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/super-bowl-lii-zero-waste/", "country": "US", "domain_rank": 1196, "title": "Super Bowl LII: NFL, PepsiCo, Aramark Tackle 40 Tons of Waste | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.497, "site_type": "news", "published": "2018-01-22T10:55:00.000+02:00", "replies_count": 0, "uuid": "e6223106a2681814e714dc2ea997a86a77ff71da"}, "author": "Beth Kowitt", "url": "http://fortune.com/2018/01/22/super-bowl-lii-zero-waste/", "ord_in_thread": 0, "title": "Super Bowl LII: NFL, PepsiCo, Aramark Tackle 40 Tons of Waste | Fortune", "locations": [], "entities": {"persons": [{"name": "beth kowitt", "sentiment": "none"}, {"name": "roberta barbieri", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "u.s. bank stadium", "sentiment": "none"}], "organizations": [{"name": "aramark", "sentiment": "negative"}, {"name": "nfl", "sentiment": "negative"}, {"name": "pepsico", "sentiment": "negative"}, {"name": "philadelphia eagles", "sentiment": "none"}, {"name": "minnesota sports facilities authority", "sentiment": "none"}, {"name": "environmental solutions", "sentiment": "none"}, {"name": "new england patriots", "sentiment": "none"}, {"name": "u.s. bank stadium", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The NFL Will Tackle 40 Tons of Waste at Super Bowl LII Fans will be encouraged to donate items that they're not allowed to bring into the stadium. Courtesy of PepsiCo By Beth Kowitt 8:55 AM EST \nWhen the Philadelphia Eagles and New England Patriots slug it out on Feb. 4 at U.S. Bank Stadium in Minneapolis for the Super Bowl, there will be another kind of battle going on behind the scenes at the stadium—one that could get even messier. \nA group of a half dozen different partners, including the NFL, PepsiCo , Aramark , U.S. Bank Stadium, and the Minnesota Sports Facilities Authority, will face off against the more than 40 tons of refuse expected to be produced. The goal: to put on a zero-waste Super Bowl. \n“Nothing, we hope, will go to landfill,” says Roberta Barbieri, PepsiCo Vice President of Global Water and Environmental Solutions. \nThe expectation is that 90% of the waste generated that day will be compostable or recyclable. The remaining 10%—waste like plastic film wrap—will go to a facility in which the waste is burned and converted into energy. \nA similar attempt was initiated three years ago at the Super Bowl in Arizona that led to about 90% waste diversion, but the effort lasted for just that one day. In this case, in what the partners are the calling the Super Bowl’s “first zero-waste legacy project,” the plan is to not only continue on the work at U.S. Bank Stadium but to create a playbook of sorts for other venues, teams, and sports leagues. \n“This is a whole new level for us and the stadium,” says Jack Groh the director of the NFL’s environmental program. “What differentiates it from anything we’ve done in the past is the commitment to not just doing this for one day, but to work together to change the paradigm.” Groh says after the Super Bowl, the partners will do a postmortem and codify their learnings so they can “have a set of procedures and concepts that we’ve tested at the single biggest sports event in the country.” \nThe partners have been working since August to prepare for game day. As part of the initiative, called Rush2Recycle , food service operator Aramark switched more than 70 different products—including draft beer cups, nacho trays, straws, and portion cups for cheese sauce—over to compostable material. \nAll of the trash bins in the stadium were relabeled to reflect the three categories: compost, recyclables, or waste. The bins also include pictures of the items, such as a recyclable Aquafina bottle or a compostable Pepsi cup. “We keep looking for week points,” explains Groh. \nDuring the Super Bowl, extra staff will be positioned throughout the stadium to help fans pick the right bins, and a team will also be in place at the backend to make sure that items have not been placed in the wrong receptacles. Leftover décor and construction materials will be donated to local organizations, and meals that aren’t served will be sent to local shelters and food banks. \nTo help prepare and prevent missteps, the group hired an outside company to do a waste audit. “You always discover things in the waste stream that you never knew were there,” says Groh. In this case, they found a small amount of e-waste like batteries, chargers, and cables. They also discovered hundreds of purses that had been abandoned after fans discovered they were not allowed to bring them into the stadium. At a pilot run in December, more than a 100 deserted bags were donated to Dress for Success. \nAt the trial run, Groy says they found that the contamination level of its compost stream—essentially items that can’t be composted that are accidentally mixed in—was at 2-3%, far below the expected standard of 10-12%. Where they needed help was at the end of the night. The second crew coming in toward the end of the game was feeling crunched for time and items were being miscategorized. To help, extra supervision and stricter controls were added. \nThanks to all the preparation, the stadium is already at an approximately 83% diversion rate—up from 55% since June 2017. \nBut it’s not just about game day. A key part of the effort is to raise awareness among fans who might take some of these practices home with them. Explains PepsiCo’s Barbieri: “There are few grander stages in the U.S. than the Super Bowl.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-22T10:55:00.000+02:00", "crawled": "2018-01-22T16:56:53.016+02:00", "highlightTitle": ""}