{"organizations": [], "uuid": "395949749e6867482965d0901945822b79a7aaee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219038482&w=1200&r=LYNXMPEE020M2", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-germany-politics/last-chance-merkel-maneuvers-for-coalition-re-run-with-spd-idUSKBN1ES0XP", "country": "US", "domain_rank": 408, "title": "Last chance? Merkel maneuvers for coalition re-run with SPD", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T14:19:00.000+02:00", "replies_count": 0, "uuid": "395949749e6867482965d0901945822b79a7aaee"}, "author": "", "url": "https://www.reuters.com/article/us-germany-politics/last-chance-merkel-maneuvers-for-coalition-re-run-with-spd-idUSKBN1ES0XP", "ord_in_thread": 0, "title": "Last chance? Merkel maneuvers for coalition re-run with SPD", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "thorsten severin", "sentiment": "none"}, {"name": "horst seehofer", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "bavaria", "sentiment": "none"}], "organizations": [{"name": "csu", "sentiment": "none"}, {"name": "spd madeline chambers", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 12:20 PM / Updated 2 hours ago Parties optimistic as matchmaker Merkel plans SPD coalition re-run Madeline Chambers , Thorsten Severin 4 Min Read \nBERLIN (Reuters) - Germany’s largest parties expressed optimism about the chances of forming a government after several hours of talks between the leaders of Chancellor Angela Merkel’s conservatives and the Social Democrats (SPD) she hopes to win as coalition partners. \nWednesday’s joint statement from the parties, which talked of growing confidence, was good news for Merkel, whose reputation as Europe’s consummate consensus-builder is on the line in this second bid to form a coalition government after weeks of sniping between its would-be partners. \nSeeking a fourth term in office, Merkel saw her authority weakened in a national election in September, when support for her conservatives was eroded by the far right. \n“Confidence has grown and we are optimistic heading into the talks,” read the joint statement, issued after three hours of talks between Merkel and other leaders of her Christian Democrats (CDU), her Bavarian CSU allies and the SPD. \nShe is under pressure to reach a deal with the centre-left Social Democrats (SPD), which also lost ground in the election, but the two sides have bickered over a range of issues, notably immigration and taxation. \nSPD leader Martin Schulz praised the “concentrated, focused consultations” he had had with leaders, which he said were a good basis for formal exploratory talks. The discussions are due to start on Sunday and could lead to official coalition negotiations in a few weeks. \nHaving failed before Christmas to form a coalition with the Greens and pro-business Free Democrats (FDP), Merkel is now leading an interim government with the SPD that is keeping things ticking over in Europe’s biggest economy. \nMerkel’s CDU/CSU alliance ruled in a ‘grand coalition’ with the SPD from 2013 to 2017 and, with investors fearing a protracted power vacuum that could delay reforms in Germany and the European Union, she is pressing for a re-run of that arrangement. \nBut the SPD has shown reluctance, with some of its members favoring a looser cooperation agreement or supporting a minority government. German acting Chancellor Angela Merkel poses for photographs after the television recording of her annual New Year's speech at the Chancellery in Berlin, Germany, December 30, 2017. REUTERS/Hannibal Hanschke \n‘VERBAL SHENANIGANS’ \nThe two blocs are at odds on issues from healthcare and immigration to Europe and pensions and, if no deal is done, Merkel’s future as chancellor would be thrown into doubt with new elections a distinct prospect. \nIn recent days some conservatives, especially from Bavaria, have stoked tensions by calling for tax cuts for high earners and reductions in benefits for asylum seekers, which the SPD opposes. \n“Again verbal shenanigans from the Bavarian CSU,” tweeted one of the SPD’s deputy leaders, Ralf Stegner. \n“Always the same recipe: humour the lederhosen public. No sense of reality in terms of agreeing with the other parties.” \nBut CSU leader Horst Seehofer sounded more conciliatory on Wednesday, saying “important days” lay ahead. “We will do everything in these talks to reach sensible agreements,” said the Bavarian before internal party talks on Wednesday morning. \nOne of Merkel’s priorities will be to establish an atmosphere of trust between the parties, the absence of which led to the collapse of the talks with the Greens and FDP in November. \nMany within the SPD fear sharing power with Merkel again will lead voters to punish it further. The SPD had said it would go into opposition after the election in which its support slumped to its lowest level since 1933. \nTo keep the rank and file on board, the SPD leadership has said it will let its members vote on Jan 21 on going ahead with detailed coalition talks after a first exploratory phase has been completed. \n“I have said that (a coalition deal) must be agreed at the very latest by Easter,” said Seehofer. Reporting by Madeline Chambers, Thorsten Severin, Holger Hansen; editing by John Stonestreet, William Maclean", "external_links": [], "published": "2018-01-03T14:19:00.000+02:00", "crawled": "2018-01-03T14:37:24.001+02:00", "highlightTitle": ""}