{"organizations": [], "uuid": "12974133d3b2ae3318f90dddae85621cc7fe4e37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-cep-america-unveils-new-name-of-vituity-as-it-rapidly-grows-and-expands-to-improve-the-practice-of-healthcare.html", "country": "US", "domain_rank": 767, "title": "CEP America Unveils New Name of Vituity as It Rapidly Grows and Expands to Improve the Practice of Healthcare", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-30T17:00:00.000+02:00", "replies_count": 0, "uuid": "12974133d3b2ae3318f90dddae85621cc7fe4e37"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-cep-america-unveils-new-name-of-vituity-as-it-rapidly-grows-and-expands-to-improve-the-practice-of-healthcare.html", "ord_in_thread": 0, "title": "CEP America Unveils New Name of Vituity as It Rapidly Grows and Expands to Improve the Practice of Healthcare", "locations": [], "entities": {"persons": [{"name": "vituity", "sentiment": "none"}, {"name": "imamu tomlinson", "sentiment": "none"}], "locations": [{"name": "emeryville", "sentiment": "none"}, {"name": "vituity", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "practice of healthcare", "sentiment": "negative"}, {"name": "medamerica billing services inc.", "sentiment": "none"}, {"name": "cep america", "sentiment": "none"}, {"name": "medamerica", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New Name Reinforces Mission to Transform Acute Patient Care Nationwide\nEMERYVILLE, Calif.--(BUSINESS WIRE)-- CEP America, a leading physician-owned healthcare delivery organization, announced today that it will become Vituity as it continues to grow and transform the practice, delivery and business of healthcare. As part of the change, CEP America is uniting its subsidiaries MedAmerica and MedAmerica Billing Services Inc. under the Vituity identity to reflect their collective passion to improve patient lives.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180130005591/en/\nDr. Imamu Tomlinson, Chief Executive Officer of Vituity (Photo: Business Wire)\n“Our new name speaks to our passion and vision for healthcare, where highly engaged doctors and advanced providers proactively lead change and provide unmatched patient care that’s rooted in the art of medicine,” said Imamu Tomlinson, MD, MBA, Chief Executive Officer of Vituity. “Under the Vituity name, our integrated care teams will continue our work with healthcare systems across the country to understand their business from a grassroots level and ultimately help them improve the lives of patients.”\nSince its start more than 40 years ago, Vituity has grown beyond its California roots to include nearly 3,000 doctors and clinicians working in acute care settings across the country. The organization is an equitable physician partnership driven by a passion for patient care, a clinical foundation to drive quality performance, change leaders who bring a unique perspective to each hospital, and a comprehensive system of support that impacts care delivery in demonstrable ways.\n“Better acute care integrated across a variety of specialties is vital to the healthcare ecosystem running more smoothly and efficiently, hence the name Vituity – which combines the words vital and acuity,” said Denise Brown, MD, Chief Strategy Officer of Vituity. “This name reflects our critical role in providing care that not only improves outcomes for patients and the communities in which they live, but also supports physicians’ compassion and joy around providing care, while implementing cost-efficient solutions for hospitals and health systems.”\nEach physician in the Vituity organization is an equitable owner in the partnership and is focused on providing the highest quality of compassionate care for every patient, while having the vision to implement innovations and best practices across a variety of acute care settings, including emergency medicine, acute psychiatry, neurology, hospital medicine, critical care, urgent care, telehealth, anesthesiology and surgical care. In addition, every physician executive with Vituity maintains an active clinical practice, so the experience and heart of patient care remains central to organizational decisions.\nAs an example of this, Vituity believes at the heart of better care for psychiatric patients is an emergency room experience that treats psychiatric conditions with more timely, specialized care and greater compassion. Data shows that approximately 44 million adults experience mental illness in a given year 1 and 1 in 8 visits to the emergency department involve mental health and substance abuse disorders. 2 These patients stay on average 3x longer in the emergency department than medical patients. 3 Many hospital facilities in the United States are not equipped with the proper resources, staffing or processes to provide quality care to psychiatric patients in need. To address these challenges, Vituity has invested in developing emergency and acute psychiatric services to partner with hospitals and health systems to improve quality of care and access to psychiatrists at the front lines. Through effective, early, and appropriate interventions, emergency departments are demonstrating improved outcomes and higher patient, family, provider and staff satisfaction scores.\n“Vituity is rapidly growing as an organization and dramatically improving healthcare today as more hospitals and health systems across the country seek our services,” added Dr. Tomlinson. “As we look to the future growth of our partnership, we continue to be the career destination of choice for healthcare professionals, and are focused on pioneering how and where acute healthcare will be delivered – building on our years of deep and wide experience on the front lines.”\nTo learn more about Vituity, please visit www.vituity.com .\nAbout Vituity\nVituity is a nationwide, multispecialty partnership of top physicians, advanced providers and industry professionals that provides a wide range of integrated acute care expertise designed to proactively lead positive change in the business and practice of healthcare. With more than 3,000 doctors and clinicians, and 250 practice locations serving over 6.3 million patients annually, Vituity’s footprint continues to rapidly expand as it partners with and supports hospitals, health systems, clinics, payers and employers.\n1 Any Mental Illness (AMI) Among Adults. (n.d.). http://www.nimh.nih.gov/health/statistics/prevalence/any-mental-illness-ami-among-adults.shtml\n2 Trends in Emergency Department Visits Involving Mental and Substance Abuse Disorders, Audrey J. Weiss, Ph.D., Marguerite L. Barrett, M.S., Kevin C. Heslin, Ph.D., and Carol Stocks, Ph.D., R.N 2006-2013, HCUP, Dec. 2016\n3 The Impact of Psychiatric Patients Boarding in Emergency Departments, B Hicks, DM Manthey, Department of Emergency Medicine, Wake Forest University Health Sciences, Winston-Salem, NC 27157, USA, June 2012\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005591/en/\nW2O Group\nBrooke Bullen, 415-946-1070\nbbullen@w2ogroup.com\nSource: Vituity", "external_links": ["http://www.businesswire.com/news/home/20180130005591/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.vituity.com&esheet=51750713&newsitemid=20180130005591&lan=en-US&anchor=www.vituity.com&index=1&md5=f0ad717f57eff1194ae44389bd575a79", "http://www.nimh.nih.gov/health/statistics/prevalence/any-mental-illness-ami-among-adults.shtml", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.nimh.nih.gov%2Fhealth%2Fstatistics%2Fprevalence%2Fany-mental-illness-ami-among-adults.shtml&esheet=51750713&newsitemid=20180130005591&lan=en-US&anchor=http%3A%2F%2Fwww.nimh.nih.gov%2Fhealth%2Fstatistics%2Fprevalence%2Fany-mental-illness-ami-among-adults.shtml&index=2&md5=1187d40fb64eb458d5cd1f1a3a9fe3fb"], "published": "2018-01-30T17:00:00.000+02:00", "crawled": "2018-01-30T18:42:58.000+02:00", "highlightTitle": ""}