{"organizations": [], "uuid": "73c649ad7d3e8c86e3452a9c17e6dc707b4bfaf4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225192508&w=1200&r=LYNXMPEE0O18S", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-tennis-ausopen-edmund/edmund-baffled-by-media-spotlight-after-melbourne-exploits-idUSKBN1FE2AH", "country": "US", "domain_rank": 408, "title": "Edmund baffled by media spotlight after Melbourne exploits", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T23:45:00.000+02:00", "replies_count": 0, "uuid": "73c649ad7d3e8c86e3452a9c17e6dc707b4bfaf4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tennis-ausopen-edmund/edmund-baffled-by-media-spotlight-after-melbourne-exploits-idUSKBN1FE2AH", "ord_in_thread": 0, "title": "Edmund baffled by media spotlight after Melbourne exploits", "locations": [], "entities": {"persons": [{"name": "edmund", "sentiment": "negative"}, {"name": "kyle edmund", "sentiment": "negative"}, {"name": "andy murray", "sentiment": "none"}, {"name": "johanna konta", "sentiment": "none"}, {"name": "denis istomin", "sentiment": "none"}, {"name": "kyle", "sentiment": "none"}, {"name": "jim couri", "sentiment": "none"}, {"name": "kevin anderson", "sentiment": "none"}, {"name": "grigor dimitrov", "sentiment": "none"}, {"name": "nikoloz basilashvili", "sentiment": "none"}, {"name": "andreas seppi", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "marin cilic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - Fair to say Kyle Edmund surpassed his expectations by reaching the semi-finals of the Australian Open but what surprised him more was the media frenzy that accompanied his stunning run.\nFrom being Kyle who? outside the tennis fraternity two weeks ago, he has been dubbed King Edmund or King Kyle as he reached his first grand slam semi-final.\nWhen Andy Murray, a double Wimbledon champion and British number one for more than a decade, pulled out before the start to undergo hip surgery and Johanna Konta checked out early, the focus switched to the unassuming 23-year-old.\nNot many expected him to beat U.S. Open runner-up Kevin Anderson in round one but when he took out the big-serving South African, the draw suddenly opened up.\nWins against Denis Istomin, Nikoloz Basilashvili and Andreas Seppi followed before the 49th-ranked Edmund made the world sit up and take notice by knocking out third seed Grigor Dimitrov.\nCroatian powerhouse Marin Cilic stopped Edmund on Thursday but the ginger-haired right-hander with a passing resemblance to former world number one Jim Courier will go home 509,000 pounds ($728,000) richer and with a ranking just outside the top 20.\nFor good measure he will almost certainly usurp Murray as British number one in the next few weeks.\nSo did anything surprise him during his Melbourne adventure?\nTennis - Australian Open - Semifinals - Rod Laver Arena, Melbourne, Australia, January 25, 2018. Britain's Kyle Edmund during a press conference after losing his match against Croatia's Marin Cilic. REUTERS/Edgar Su “Not the way I played,” Edmund, beaten 6-2 7-6(4) 6-2, told reporters in reference to the tens of thousands of words written about him in the past 12 days.\n”The most surprising thing is the stuff off the court, like my dad’s got three more jobs than I knew he had, like reading... my first hobby was swimming and, my first love was swimming, which I never knew.\n“Yeah, there’s lots of stuff which I was surprised about. My dad told me... ‘I had three more jobs I didn’t know I had’,” he added.\n”Of course I slightly feel people over react and stuff. You know, like, was it King Edmund VI? I mean, yeah, it is what it is basically.\n“The attention goes with the territory of doing well. The top guys like Roger (Federer)... they have been doing it their whole life. They crack on and embrace it.”\nCar lover Edmund, who moved to Yorkshire from South Africa when he was three, said he will not be going out to splash any of his cash and won’t be buying Ferrari.\n“I have a Jaguar deal, so I can‘t!” he said.\nWhile the media spotlight might take some getting used to, Edmund says he felt like he belonged on the big stage.\n“Played a lot of tough matches. Won some tough matches. Beat good players,” he said. “This type of tournament just gives you the bug to want more. Once you get a taste, it’s like, yeah, I want more of this.”\nReporting by Martyn Herman, editing by Pritha Sarkar\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T23:45:00.000+02:00", "crawled": "2018-01-25T23:07:59.015+02:00", "highlightTitle": ""}