{"organizations": [], "uuid": "6f2f5dc81825485deeb7c25ff2e5b18b18a0cc83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221245570&w=1200&r=LYNXMPEE0A1TX", "site_section": "http://feeds.reuters.com/reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-new-york-incident/accused-n-y-subway-bomber-pleads-not-guilty-to-terrorism-charges-idUSKBN1F02W8", "country": "US", "domain_rank": 408, "title": "Accused N.Y. subway bomber pleads not guilty to terrorism charges", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T23:16:00.000+02:00", "replies_count": 0, "uuid": "6f2f5dc81825485deeb7c25ff2e5b18b18a0cc83"}, "author": "", "url": "https://www.reuters.com/article/us-new-york-incident/accused-n-y-subway-bomber-pleads-not-guilty-to-terrorism-charges-idUSKBN1F02W8", "ord_in_thread": 0, "title": "Accused N.Y. subway bomber pleads not guilty to terrorism charges", "locations": [], "entities": {"persons": [{"name": "bre", "sentiment": "negative"}, {"name": "akayed ullah", "sentiment": "none"}, {"name": "richard sullivan", "sentiment": "none"}, {"name": "pierson", "sentiment": "none"}, {"name": "ullah", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "times square", "sentiment": "none"}], "organizations": [{"name": "port authority bus terminal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 18 PM / Updated 4 minutes ago Accused N.Y. subway bomber pleads not guilty to terrorism charges Brendan Pierson 3 Min Read \nNEW YORK (Reuters) - The Bangladeshi man accused of attempting an Islamic State-inspired suicide bomb attack on a busy New York City commuter hub in December pleaded not guilty on Thursday to federal terrorism charges. \n“At this moment, not guilty,” said Akayed Ullah, 27, when U.S. District Judge Richard Sullivan asked him for his plea at a hearing in federal court in Manhattan. \nThe charges against Ullah include supporting a foreign terrorist organization, using a weapon of mass destruction and carrying out a terrorist attack against a mass transit system. Ullah faces life in prison if convicted. \nUllah was arrested on Dec. 11 after trying to detonate a pipe bomb secured to his body in a pedestrian tunnel in New York City’s subway system, according to federal prosecutors. The tunnel is in a busy subway station in Manhattan’s Times Square that is connected to the busy Port Authority Bus Terminal, which is used by commuters from New York’s suburbs as well as out-of-town travelers. \nUllah was hospitalized for injuries suffered after the bomb ignited but failed to detonate as intended, while three other people suffered minor injuries, according to prosecutors. \nUllah told police officers after the blast that he “did it for the Islamic State,” according to a criminal complaint filed on Dec. 13. \nProsecutors said that Ullah, who has lived in the United States since 2011, began his self-radicalization in 2014 when he started viewing pro-Islamic State materials online. Inside Ullah’s passport, which was recovered from his home, was a handwritten note that read, “O AMERICA, DIE IN YOUR RAGE,” according to the complaint. \nMonirul Islam, head of the Bangladesh police’s counterterrorism unit, told Reuters shortly after the attack in December that his country had found no evidence linking Ullah to militants in his home country. \nUllah’s court-appointed lawyer, Amy Gallicchio, said at Thursday’s hearing that Ullah, who is currently being held in Manhattan’s Metropolitan Correctional Center, had not been seen by a doctor in days and asked the judge to order that he receive medical attention. \nSullivan told Gallicchio to direct her request to prison authorities first. Reporting by Brendan Pierson in New York; Editing by Leslie Adler", "external_links": [], "published": "2018-01-11T23:16:00.000+02:00", "crawled": "2018-01-11T23:26:39.000+02:00", "highlightTitle": ""}