{"organizations": [], "uuid": "89cf82463c25e87fcd4dbc91c48120d786dacec1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223560054&w=1200&r=LYNXMPEE0J052", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-athletics-jamaica-mcleod/olympic-hurdles-champion-mcleod-may-forgo-commonwealth-games-idUKKBN1F9086", "country": "US", "domain_rank": 408, "title": "Olympic hurdles champion McLeod may forgo Commonwealth Games", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T09:47:00.000+02:00", "replies_count": 0, "uuid": "89cf82463c25e87fcd4dbc91c48120d786dacec1"}, "author": "", "url": "https://uk.reuters.com/article/uk-athletics-jamaica-mcleod/olympic-hurdles-champion-mcleod-may-forgo-commonwealth-games-idUKKBN1F9086", "ord_in_thread": 0, "title": "Olympic hurdles champion McLeod may forgo Commonwealth Games", "locations": [], "entities": {"persons": [{"name": "mcleod", "sentiment": "negative"}, {"name": "omar mcleod", "sentiment": "none"}, {"name": "kayon raynor", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "rio", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "jamaica", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "kingston", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 7:48 AM / Updated 24 minutes ago Olympic hurdles champion McLeod may forgo Commonwealth Games Kayon Raynor 3 Min Read \nKINGSTON (Reuters) - Olympics hurdles champion Omar McLeod may miss the Commonwealth Games in Australia in April to focus on defending his world indoor title and trying to break the world record for the 110m hurdles later this year. \nThe Commonwealth Games will be staged on Australia’s Gold Coast from April 4-15. \n“Coach said it’s probably too close to the world indoors,” McLeod told Reuters on Friday of the short time span between the March 1-4 indoor championships in Birmingham and the multi-sport Commonwealth Games in Australia. \n“So we’re fearful that we won’t have enough time to unwind and get enough quality base work to take on the outdoor season, so it’s his call.” \nMcLeod, who beat the now retired Usain Bolt to clinch Jamaica’s Sportsman of the Year award on Friday, also said that chasing world records were his primary goals for this season. \nThe 23-year-old followed up his gold in Rio with the world outdoor title last year in London and was keen to build on that with the world records both indoors and outdoors. \n“In terms of time, 7.25 seconds (for the 60m hurdles), I‘m throwing that out there and 12.75 (for the 110m),” McLeod said of the times he was aiming for to break the records. \nBritain’s Colin Jackson holds the 60m hurdles record of 7.30 seconds, which he clocked in 1994, while American Aries Merritt established the 110m hurdles mark of 12.80 seconds in 2012. \nMcLeod’s best time in the 60m event was the 7.41 seconds he clocked in winning the 2016 world indoor title in Portland. \nHis best time outdoors was the 12.90 seconds he ran in Kingston last year, equalling the fifth-fastest mark of all time. \n“I‘m expecting to go really fast (at the world indoors), I’ve opened my season with 7.53 seconds,” McLeod said. \n”I’ve never opened that fast before and I’ve never opened my season this early in the year. \n“I‘m feeling good. I‘m in the best shape of my life.” \nMcLeod will run at the Millward Games in New York on Feb. 2 where he will race in the sprints, something he is planning on also doing this season outdoors, while longer term his coach Edrick Floreal is planning on going even further out. \n“Coach and I... we’ve formulated a plan,” McLeod said. \n”He said after 2020 when I defend the Olympic title in the 110m hurdles, that’s when I will take in the 400m hurdles. \n“Hopefully I accomplish all the goals in the sprint hurdles, break all the records, do a little sprinting and then that’s when we’ll go back to the 400 hurdles.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-20T09:47:00.000+02:00", "crawled": "2018-01-20T10:25:42.036+02:00", "highlightTitle": ""}