{"organizations": [], "uuid": "8d1272709c6a51dad3093cd2aa2a108fd8e782f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 143, "shares": 143, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220849870&w=1200&r=LYNXMPEE090YC", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-lgbt-royals/gay-indian-prince-throws-open-palace-doors-to-vulnerable-lgbt-people-idUSKBN1EZ1U3", "country": "US", "domain_rank": 408, "title": "Gay prince throws open palace doors to vulnerable LGBT people", "performance_score": 1, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.991, "site_type": "news", "published": "2018-01-10T22:46:00.000+02:00", "replies_count": 0, "uuid": "8d1272709c6a51dad3093cd2aa2a108fd8e782f3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-lgbt-royals/gay-indian-prince-throws-open-palace-doors-to-vulnerable-lgbt-people-idUSKBN1EZ1U3", "ord_in_thread": 0, "title": "Gay prince throws open palace doors to vulnerable LGBT people", "locations": [], "entities": {"persons": [{"name": "manvendra singh gohil", "sentiment": "none"}, {"name": "gohil", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "gujarat", "sentiment": "none"}, {"name": "rajpipla", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Thomson Reuters Foundation) - The only openly gay prince in India - where same sex relations are illegal - is throwing open his palace doors to lesbians, gays, transgender and other Indians shunned for their sexuality.\nPrince Manvendra Singh Gohil, heir apparent to the throne of Rajpipla in western Gujarat state, said it was particularly hard to come out in small-town India, where traditional values hold sway and heterosexual relations are the norm.\n“People still face a lot of pressure from their families when they come out, being forced to marry, or thrown out of their homes. They often have nowhere to go, no means to support themselves,” he told the Thomson Reuters Foundation.\nSo the prince, 52, is building a center for lesbian, gay, bisexual and transgender people (LGBT) on the grounds of his ancestral palace.\n“I am not going to have children, so I thought, why not use this space for a good purpose?” Gohil said, adding that he will offer rooms, a medical facility and training in English and vocational skills to help people find jobs.\nGohil came out to his family more than a decade ago, prompting his mother to take out a newspaper advertisement disowning him. Erstwhile royalty in India are still in the spotlight, many holding positions in the government.\nAfter coming out, Gohil set up the Lakshya Trust, a charity for LGBT people in his conservative home state, and became a champion for gay rights. He has made numerous international appearances, including on The Oprah Winfrey Show.\nHe is a vocal critic of India’s colonial-era law that criminalize consensual sexual relations between same sex adults. Earlier this week, the country’s top court said it would reconsider its 2013 decision to uphold the law.\n“Lifting the law will encourage more people to come out and live their lives freely. But it may also mean more people in need of support,” Gohil said.\nGohil said he is renovating and extending his palace, built in 1927, on the 15-acre site, installing solar panels for power, and reserving some land for organic farming.\nAn online crowdfunding campaign and donations are financing the center, which will be managed by his charity, he said.\nGohil’s high profile has helped the LGBT community in India enormously, said Harish Iyer, a gay rights activist who hosts a radio show dedicated to LGBT issues.\n“For him to be one of us, the stakes are even higher, so providing this space is a great gesture,” he said.\n“We are lucky to have many LGBT-friendly spaces in cities like Mumbai and Delhi. But in smaller towns, there are not so many places, and that is where they are most needed.”\nReporting by Rina Chandran @rinachandran. Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T22:46:00.000+02:00", "crawled": "2018-01-11T03:49:43.000+02:00", "highlightTitle": ""}