{"organizations": [], "uuid": "9a8df587d471414409fe9895bdf5477053e58377", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224911210&w=1200&r=LYNXMPEE0N224", "site_section": "https://www.reuters.com/subjects/aerospace-and-defense", "section_title": "Aerospace and Defense | Reuters.com", "url": "https://www.reuters.com/article/us-ryanair-unions/european-pilot-group-demands-ryanair-meet-unions-collectively-idUSKBN1FD2UA", "country": "US", "domain_rank": 408, "title": "European pilot group demands Ryanair meet unions collectively", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T03:53:00.000+02:00", "replies_count": 0, "uuid": "9a8df587d471414409fe9895bdf5477053e58377"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-ryanair-unions/european-pilot-group-demands-ryanair-meet-unions-collectively-idUSKBN1FD2UA", "ord_in_thread": 0, "title": "European pilot group demands Ryanair meet unions collectively", "locations": [], "entities": {"persons": [], "locations": [{"name": "dublin", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ryanair", "sentiment": "negative"}, {"name": "eca", "sentiment": "none"}, {"name": "european cockpit association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBLIN (Reuters) - Ryanair ( RYA.I ) pilots’ unions demanded on Wednesday a joint meeting with management, saying individual talks on a new collective bargaining system were not satisfactory, according to a letter sent by the European Cockpit Association.\nThe letter dated Jan. 24, which was on European Cockpit Association notepaper and signed by 11 trade unions, also demanded that Ryanair commit by March 1 to introduce permanent direct employment contracts in accordance with the local laws of the country where staff are based.\nRyanair, in a statement, refused the idea of meeting unions collectively.\n“Ryanair won’t be meeting with any collective group of competitor pilot unions,” it said, adding that such a grouping would have no legal standing or negotiating license.\nSpokesmen for the ECA and Irish trade union IMPACT declined to comment on whether the letter, seen by Reuters, represented their position.\nRyanair ( RYA.I ) stunned the European aviation sector in December by announcing plans to recognize pilot unions for the first time in its 32-year history in a bid to stave off a series of threatened strikes. Since then it has held meetings with a number of national trade unions on formalizing the recognition and negotiating collective bargaining agreements.\nBut the letter, addressed to Ryanair’s chief operating officer and chief people officer, said the airline was in several countries “de facto sidelining” the unions by “trying to push through each Ryanair base a unilateral, non-negotiated pay rise offer” with a number of conditions attached.\nRyanair, in a letter in response to ECA on Wednesday, described those claims as “materially inaccurate”. The airline said last week that a majority of pilots based at London Stansted Airport had agreed to a 20 percent pay increase, which had initially been offered to all bases individually before Ryanair announced it would recognize unions.\nPilots have objected in the past to Ryanair’s practice of dealing with pilots from its 87 bases separately and have called for negotiations either on a national or pan-European basis.\nThe airline in its response letter said that a pan-European group would be in violation of EU rules.\nIt said it was continuing to negotiate directly with unions in Ireland, the United Kingdom, Germany, Belgium, Italy, Spain and Portugal.\n“Some of these are progressing well and some have made little progress due to slow or no responses from some national unions/company councils,” Ryanair said in its letter to ECA.\nThe letter from the ECA made eight separate demands, including that Ryanair negotiate with all national pilot associations representing its pilots, that it include pilots not directly employed and that pilots be allowed to freely choose their own representatives.\nReporting by Conor Humphries; Editing by Susan Fenton\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T03:53:00.000+02:00", "crawled": "2018-01-25T10:13:01.093+02:00", "highlightTitle": ""}