{"organizations": [], "uuid": "9a4f54e8a7022baf89a4d6c49e58734c5c8c4f04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/australia-stocks-midday/australia-shares-tumble-to-2-week-low-as-materials-drag-nz-up-idUSL3N1PB05M", "country": "US", "domain_rank": 408, "title": "Australia shares tumble to 2-week low as materials drag; NZ up", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T03:01:00.000+02:00", "replies_count": 0, "uuid": "9a4f54e8a7022baf89a4d6c49e58734c5c8c4f04"}, "author": "", "url": "https://www.reuters.com/article/australia-stocks-midday/australia-shares-tumble-to-2-week-low-as-materials-drag-nz-up-idUSL3N1PB05M", "ord_in_thread": 0, "title": "Australia shares tumble to 2-week low as materials drag; NZ up", "locations": [], "entities": {"persons": [{"name": "christina martin  jan", "sentiment": "none"}, {"name": "peter spanos", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "nz", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "cmc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p/asx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Australian shares hit 2-week low\n* Weak iron ore prices drag material stocks\n* NZ marks biggest intraday percentage gain in over 5 weeks\nBy Christina Martin\nJan 16 (Reuters) - Australian shares slipped to their lowest in two weeks on Tuesday, with materials weighing on the index on weak iron ore and coking coal prices.\nChinese iron ore futures fell 2 percent on Monday as stockpiles of the steelmaking commodity at China’s ports surged to the highest since at least 2004, with weaker steel prices also adding pressure.\nThe S&P/ASX 200 index fell 0.6 percent, or 33.4 points to 6,043.7 by 0031 GMT, its biggest intraday percentage loss since Jan. 2. The benchmark closed up 0.1 percent on Monday.\n“Iron ore was lower last night and that’s dragged down our material stocks this morning,” said Peter Spanos, volatility risk manager at CMC Markets.\nTrading was slow ahead of the upcoming earnings season, and on weak global sentiment as U.S. markets were closed on Monday.\n“The market’s just on hold at the moment... we’re getting really close to our profit reporting season, so I think a lot of investors are preferring to wait to see what happens then,” said Ric Spooner, chief market strategist at CMC Markets.\nThe materials and mining index dropped as much as 0.8 percent, with mining giants BHP Billiton Ltd and Rio Tinto Ltd each falling over 1 percent.\nRio Tinto reported a 1 percent rise in iron ore shipments for 2017 to 330.1 million tonnes, in line with its guidance, but weak iron prices kept the stock down.\n“Maybe the market might need a little more than a solid report in line with guidance to maintain momentum,” said Spooner.\nAustralia’s financial stocks hit a two-week low, falling as much as 0.5 percent, with the “Big Four” banks losing between 0.2 percent and 0.8 percent.\nThe biggest loser on the main index was Retail Food Group Ltd, shedding as much as 0.6 percent and touching its lowest in one week.\nNew Zealand’s benchmark S&P/NZX 50 index, on the other hand, rose 0.7 percent, or 56.35 points, to 8,267.53, posting its biggest intraday percentage gain since Dec. 8.\nConsumer staples, utilities and industrials led the gains on the index.\na2 Milk Company Ltd was the top gainer on the index, gaining as much as 6.4 percent, its biggest intraday percentage gain in more than three months.\nReporting by Christina Martin in Bengaluru; Additional reporting by Nikhil Nainan\n ", "external_links": [], "published": "2018-01-16T03:01:00.000+02:00", "crawled": "2018-01-16T04:48:23.011+02:00", "highlightTitle": ""}