{"organizations": [], "uuid": "cf016f4a92d10b79ca824ba26745474e76002b78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-afghanistan-blast/blast-hits-afghan-capital-kabul-casualties-feared-police-idUKKBN1ET1YE", "country": "US", "domain_rank": 408, "title": "Blast hits Afghan capital Kabul, casualties feared - police", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T18:52:00.000+02:00", "replies_count": 0, "uuid": "cf016f4a92d10b79ca824ba26745474e76002b78"}, "author": "", "url": "https://uk.reuters.com/article/uk-afghanistan-blast/blast-hits-afghan-capital-kabul-casualties-feared-police-idUKKBN1ET1YE", "ord_in_thread": 0, "title": "Blast hits Afghan capital Kabul, casualties feared - police", "locations": [], "entities": {"persons": [{"name": "mirwais harooni", "sentiment": "none"}, {"name": "andrew heavens", "sentiment": "none"}], "locations": [{"name": "kabul", "sentiment": "none"}, {"name": "kabul", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "reute", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 4:52 PM / Updated an hour ago Blast hits police in Afghan capital Kabul, dozens of casualties Mirwais Harooni 2 Min Read \nKABUL (Reuters) - A suicide bomber in the Afghan capital caused dozens of casualties on Thursday after blowing himself up close to a group of security personnel who were carrying out an operation against illegal drugs and alcohol dealing, officials said. \nIslamic State, which has claimed a series of attacks in Kabul over the past two years, issued a statement on its Amaq news agency saying it was responsible. \nIt said a suicide bomber targeting a group of police and intelligence service personnel had detonated an explosive vest, killing or wounding around 80 of them. \nWahid Majroh, a spokesman for the ministry of public health, said 11 dead and 25 wounded had been brought to city hospitals after the blast in an area of the city not far from the U.S. Embassy and other foreign missions. \nAs security forces arrived, a Reuters reporter saw four police vehicles carrying dead or wounded security personnel from the scene. \nPolice officers at the scene said the bomber had been wearing police or army uniform and had approached a group of security personnel conducting controls on illegal drugs and alcohol sellers, but there was no official confirmation. \n“Kabul police forces were there to prevent a possible protest when a suicide bomber approached them and detonated his suicide vest,” Kabul police spokesman Bashir Mujahid said. \nWhile Afghan forces backed by U.S. air strikes have claimed some success against Taliban insurgents since the United States announced a stepped up military strategy last year, high profile attacks on civilian targets in Kabul have continued. \nThe attack happened days after a suicide bomber killed at least 41 people and wounded more than 80 at a Shi‘ite cultural centre in Kabul, underlining the precarious security situation in the Afghan capital. \nThat attack was also claimed by Islamic State, which has claimed responsibility for a number of similar attacks in Afghanistan over the past two years. Additional reporting by Nadine Awadalla in CAIRO; writing by James Mackenzie; Editing by Richard Balmforth", "external_links": [], "published": "2018-01-04T18:52:00.000+02:00", "crawled": "2018-01-04T19:23:12.001+02:00", "highlightTitle": ""}