{"organizations": [], "uuid": "7425e92bc5186f2e38395daec40ee9d54d975539", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 245}, "facebook": {"likes": 114, "shares": 114, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220451194&w=1200&r=LYNXMPEE08047", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-singapore-refinery/singapore-arrests-17-seizes-millions-in-suspected-shell-oil-heist-idUSKBN1EY06D", "country": "US", "domain_rank": 408, "title": "UPDATE 4-Singapore uncovers large oil heist at Shell's biggest refinery", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:45:00.000+02:00", "replies_count": 0, "uuid": "7425e92bc5186f2e38395daec40ee9d54d975539"}, "author": "", "url": "https://www.reuters.com/article/us-singapore-refinery/singapore-arrests-17-seizes-millions-in-suspected-shell-oil-heist-idUSKBN1EY06D", "ord_in_thread": 0, "title": "UPDATE 4-Singapore uncovers large oil heist at Shell's biggest refinery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE (Reuters) - Eleven men were charged in a Singapore court on Tuesday in connection with a large-scale oil theft at Shell’s biggest refinery, while police said they were investigating six other men arrested in a weekend raid.\nPolice in the island-state said on Tuesday they had detained 17 men, whose ages ranged from 30 to 63, and seized millions of dollars in cash and a small tanker during their investigations into theft at the Pulau Bukom industrial site, which sits just south of Singapore’s main island.\nOil refining and shipping have contributed significantly to Singapore’s rising wealth during the past decades. But the case underlines the challenges the industry faces in a region that has become a hotspot for illegal oil trading.\nThe investigation began after Shell contacted the authorities in August 2017, police said in a news release. After “extensive investigations and probes,” the Criminal Investigation Department, Police Intelligence Department and Police Coast Guard launched a series of simultaneous raids across Singapore, which led to the arrests.\nNine Singaporeans were immediately charged in the theft, of which eight were employees of the Singapore subsidiary of Royal Dutch Shell Plc, court documents showed. Two Vietnamese nationals were charged with receiving stolen goods on a small tanker named Prime South (IMO: 9452804), the documents showed.\nShell confirmed on Tuesday that eight of the 11 men charged were current or former employees at Shell Eastern Petroleum (Pte) Ltd.\nShipping data from Thomson Reuters Eikon showed the Prime South had been shipping fuel between Ho Chi Minh City, Vietnam, and Singapore for the past 30 days.\nGRANDER SCHEME? Tuesday’s cases could be just the first insight into a grander scheme.\nThe charges seen so far allege three incidents of gasoil theft: on Nov. 21, 2017, of more than 2,322 tonnes valued at S$1.277 million ($958,564.78); and on Jan. 5 and 7 this year of a combined 2,062 tonnes of gasoil, valued at S$1.126 million.\nThe Vietnamese nationals were charged with receiving gasoil in the early evening hours of Jan. 7, at wharf 5 at the heart of Shell’s operations on Bukom island, the documents show.\nFILE PHOTO: Storm clouds gather over Shell's Pulau Bukom oil refinery in Singapore January 30, 2016. REUTERS/Edgar Su/File Photo Meanwhile, police say the other six men arrested remain under investigation.\nDuring raids on Sunday, police said they seized S$3.05 million in cash and the 12,000-deadweight-tonne tanker. They have also frozen suspects’ bank accounts.\nShell said on Tuesday it anticipated “a short delay” in its supply operations at Bukom, its largest wholly owned refinery in the world in terms of crude distillation capacity. It declined to say the total amount of oil stolen.\nIt is the second high-profile case of wrongdoing at companies in Singapore to hit headlines in recent weeks, after Keppel Corporation Ltd’s rig-building business agreed in December to pay more than $422 million to resolve charges it bribed Brazilian officials.\nOIL TRADING HUB Singapore is one of the world’s most important oil trading hubs, with much of the Middle East’s crude oil passing through Singapore before being delivered to the huge consumers in China, Japan and South Korea.\nSingapore is also Southeast Asia’s main refinery hub and the world’s biggest marine refueling stop.\nShell is one of the biggest and longest established foreign investors in Singapore. Its oil refinery on Bukom island can process 500,000 barrels per day.\nIllicit oil trading is widespread in Southeast Asia. In some cases, oil has been illegally siphoned from storage tanks, but there have also been thefts at sea, including whole ships being seized for the oil cargo.\nThe Regional Cooperation Agreement on Combating Piracy and Armed Robbery against Ships in Asia (ReCAAP) says that siphoning of fuel and oil at sea in Asia, including through armed robbery and piracy, saw sharp increases between 2011 and 2015.\nThere has been a modest decline since then, although the organization said in a quarterly report that oil theft was still “of concern,” especially in the South China Sea, off the east coast of Malaysia.\nThe stolen fuel is generally sold across Southeast Asia, offloaded directly into trucks or tanks at small harbors away from oil terminals.\nReporting by John Geddie and Henning Gloystein; Additional reporting by Florence Tan and Fathin Ungku; Editing by Gerry Doyle\n ", "external_links": [], "published": "2018-01-09T09:45:00.000+02:00", "crawled": "2018-01-09T10:04:50.003+02:00", "highlightTitle": ""}