{"organizations": [], "uuid": "0c5a1147f8747d2521e18c9227b632d700781703", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-aarete-announces-three-new-promotions-to-managing-director.html", "country": "US", "domain_rank": 767, "title": "AArete Announces Three New Promotions to Managing Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T18:10:00.000+02:00", "replies_count": 0, "uuid": "0c5a1147f8747d2521e18c9227b632d700781703"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-aarete-announces-three-new-promotions-to-managing-director.html", "ord_in_thread": 0, "title": "AArete Announces Three New Promotions to Managing Director", "locations": [], "entities": {"persons": [{"name": "maria turner", "sentiment": "none"}, {"name": "jackie", "sentiment": "none"}, {"name": "kevin byrnes", "sentiment": "none"}, {"name": "loren trimble", "sentiment": "none"}, {"name": "jackie ferguson", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "consulting magazine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, AArete, a consulting firm which recently earned the Chicago Tribune's 2017 Top Work Places award , as well as ranking in Consulting Magazine's 2017 list of Fastest Growing Firms , has promoted Jackie Ferguson, Kevin Byrnes and Maria Turner to the position of Managing Director. Regarding their new role, AArete CEO and Managing Director, Loren Trimble noted, \"This is not only a recognition of their deep experience across multiple industries, but that in this, the company's most senior position, they are capable of driving client results.\"\nWhile AArete has an international footprint and global scope, the three new Managing Directors are all based out of the firm's U.S. locations. They bring a breadth of client experience and strategic advisory capabilities across a range of industries, with a focus on using data to drive client improved performance.\nJackie Ferguson assists healthcare payers, financial institutions, retailers, and higher education reduce costs in an accelerated timeframe. Jackie specializes in delivering strategic cost reduction solutions to AArete's Medicaid and Medicare healthcare clients. In 2017, Jackie was a recipient of Consulting Magazine's \"Rising Stars of the Profession\" award. Jackie holds a bachelor's degree from Saint Mary's College, and is based in Chicago.\nKevin Byrnes specializes in delivering data analytics, business process improvement, and strategic cost reduction solutions for clients across all industries. He has a broad range of healthcare experience, including both Providers and Payers. Kevin has worked with large managed care organizations and hospitals to deliver cost savings results and operational and strategic insights. He holds a Bachelor of Science in Business from the Kelley School of Business at Indiana University. Kevin is based in Seattle.\nMaria Turner is a leader in AArete's Healthcare Payment Integrity practice. Maria creates innovative solutions that are tailored to meet the challenges currently facing Healthcare Payers. Maria's work is credited with the early detection, recovery and prevention of overpayments of Healthcare claims. Maria is a Certified Public Accountant and has provided audit and consulting services to privately-held companies in the transportation, professional services and non-profit sectors. Maria is a graduate of the University of Iowa and is based in Chicago.\nAbout AArete\nAArete is a management consulting firm specializing in end-to-end profit improvement solutions in a compressed timeframe without reducing headcount. We accomplish this through services such as strategic cost reduction, actionable data analytics, revenue optimization, M&A integration and process-driven performance improvement. We work with clients across multiple industries and business functions to deliver significant bottom line improvement through the use of our proprietary Knowledge Management Center™ and powered by our Center of Data Excellence. For more information visit www.aarete.com .\nhttps://topworkplaces.com/publication/chicagotribune/\nhttp://www.consultingmag.com/fastest-growing-firms/?year=2017\n releases/aarete-announces-three-new-promotions-to-managing-director-300588818.html\nSOURCE AArete", "external_links": ["http://www.consultingmag.com/fastest-growing-firms/?year=2017", "http://www.prnewswire.com/news-releases/aarete-announces-three-new-promotions-to-managing-director-300588818.html", "https://topworkplaces.com/publication/chicagotribune/", "http://www.aarete.com/"], "published": "2018-01-26T18:10:00.000+02:00", "crawled": "2018-01-26T20:16:57.002+02:00", "highlightTitle": ""}