{"organizations": [], "uuid": "4ca970b3e07999afd11911e30195908b14f5ee8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222528401&w=1200&r=LYNXMPEE0F1JX", "site_section": "https://www.reuters.com/news/subjects/ADventures", "section_title": "ADventures | Reuters.com", "url": "https://www.reuters.com/article/us-usa-stocks-volatility/stock-fear-index-snaps-out-of-extended-snooze-jumps-to-six-week-high-idUSKBN1F52OX", "country": "US", "domain_rank": 408, "title": "Stock 'fear index' snaps out of extended snooze, jumps to six-week high", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-17T05:00:00.000+02:00", "replies_count": 0, "uuid": "4ca970b3e07999afd11911e30195908b14f5ee8d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-stocks-volatility/stock-fear-index-snaps-out-of-extended-snooze-jumps-to-six-week-high-idUSKBN1F52OX", "ord_in_thread": 0, "title": "Stock 'fear index' snaps out of extended snooze, jumps to six-week high", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "trade alert", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - A widely followed gauge of expected near-term stock price gyrations perked up on Tuesday to a six-week high as traders took to the equity options market to pick up some protective contracts.\nThe Cboe Volatility Index, better known as the VIX, was up 1.35 point at 11.51.\nWhile the VIX, often referred to as Wall Street’s “fear index,” is still well below its long-term average of around 20, it was on pace for its largest single-day gain in about two months.\nHopes of strong earnings, supported by a steep cut in corporate taxes, and solid global economic growth have bolstered Wall Street’s optimism at the start of 2018.\nOn Tuesday, The Dow Jones Industrial Average raced past the 26,000 mark for the first time. The S&P 500 hit a record high of 2,807.54, before giving up gains.\nVIX options volume jumped to 1.7 million contracts or about twice the daily average, according to options analytics firm Trade Alert. VIX options allow traders to build protection against future stock swings.\nAnalysts pegged the rush for protection against volatility to investors’ unease with stocks’ lofty heights, growing risk of government shutdown this week and news that Special Counsel Robert Mueller has subpoenaed President Donald Trump’s former chief strategist Steve Bannon.\n“I think it’s probably the subpoena of Steve Bannon by the Mueller Special Counsel,” said Randy Frederick, vice president of trading and derivatives for Charles Schwab in Austin.\n“Because no one really knows what’s going to come out of that, how disruptive it might be,” he said.\nBannon has been subpoenaed to testify before a grand jury in a probe into alleged ties between Russia and Trump’s 2016 presidential campaign, the New York Times reported on Tuesday.\nMeanwhile, partisan finger-pointing over immigration policy on Tuesday left the U.S. Congress and the White House stumbling closer to a possible federal government shutdown by the end of the week.\nRegardless of why investors are anxious, it makes sense to pick up some protection, said Michael Purves, chief global strategist at Weeden & Co.\n“The real thing is that so many key indices and sectors have become really, really overextended,” said Purves.\nOn Friday, the S&P 500 Index’s 14-day relative strength index (RSI) hit 83.4, the highest since late 1996, according to Thomson Reuters data. An RSI above 70 indicates overbought conditions, analysts said.\n“Why would you not buy some protection? No one is going to think you are stupid for doing that,” Purves said.\nReporting by Saqib Iqbal Ahmed; Editing by Daniel Bases and Nick Zieminski\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T05:00:00.000+02:00", "crawled": "2018-01-16T23:14:06.009+02:00", "highlightTitle": ""}