{"organizations": [], "uuid": "72349295abd53f8fd46910f22f0669c009d80088", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-my-size-announces-proposed-public-offering-of-common-stock-and-warrants-to-purchase-common-stock.html", "country": "US", "domain_rank": 767, "title": "My Size Announces Proposed Public Offering of Common Stock and Warrants to Purchase Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:05:00.000+02:00", "replies_count": 0, "uuid": "72349295abd53f8fd46910f22f0669c009d80088"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-my-size-announces-proposed-public-offering-of-common-stock-and-warrants-to-purchase-common-stock.html", "ord_in_thread": 0, "title": "My Size Announces Proposed Public Offering of Common Stock and Warrants to Purchase Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "israel", "sentiment": "none"}], "organizations": [{"name": "public offering of common stock and warrants to purchase common stock airport city", "sentiment": "neutral"}, {"name": "my size, inc.", "sentiment": "neutral"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "tase", "sentiment": "none"}, {"name": "roth capital partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AIRPORT CITY, Israel, January 30, 2018 /PRNewswire/ --\nMy Size, Inc. (the \"Company\" or \"My Size\") (NASDAQ: MYSZ) (TASE: MYSZ), developer of proprietary, smartphone measurement applications, today announced that it intends to offer primary shares of its common stock and warrants to purchase shares of its common stock in a public offering. The offering is subject to market conditions, and there can be no assurance as to whether or when the offering may be completed, or as to the actual size or terms of the offering. My Size intends to use the net proceeds from the offering for general corporate purposes.\nRoth Capital Partners is acting as sole placement agent for the proposed offering on a best efforts basis.\nA shelf registration statement on Form S-3 relating to the securities was filed with the Securities and Exchange Commission and is effective. A preliminary prospectus supplement relating to the offering will be filed with the SEC and will be available on the SEC's web site at http://www.sec.gov . Electronic copies of the preliminary prospectus supplement relating to the offering, when available, may be obtained from Roth Capital Partners, LLC, 888 San Clemente, Newport Beach, California 92660, Attn: Equity Capital Markets, via telephone at (800) 678-9147 or via email at rothecm@roth.com .\nThis press release does not constitute an offer to sell or a solicitation of an offer to buy the securities described herein, nor shall there be any sale of these securities in any state or other jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction.\nAbout My Size, Inc.\nMy Size, Inc. (TASE: MYSZ) (NASDAQ: MYSZ) has developed a unique measurement technology based on sophisticated algorithms and cutting edge technology with broad applications including the apparel, e-commerce DIY, shipping and parcel delivery industries. This proprietary technology is driven by several patent-pending algorithms which are able to calculate and record measurements in a variety of novel ways. To learn more about My Size, please visit our website. http://www.mysizeid.com .\nFollow us on Facebook , LinkedIn and Twitter .\nCautionary Statement Regarding Forward-Looking Statements\nThis press release contains certain within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements are identified by the use of the words \"could,\" \"believe,\" \"anticipate,\" \"intend,\" \"estimate,\" \"expect,\" \"may,\" \"continue,\" \"predict,\" \"potential,\" \"project\" and similar expressions that are intended to identify All speak only as of the date of this press release. You should not place undue reliance on these Although we believe that our plans, objectives, expectations and intentions reflected in or suggested by the are reasonable, we can give no assurance that these plans, objectives, expectations or intentions will be achieved. Forward-looking statements involve significant risks and uncertainties (some of which are beyond our control) and assumptions that could cause actual results to differ materially from historical experience and present expectations or projections. Actual results to differ materially from those in the and the trading price for our common stock may fluctuate significantly. Forward-looking statements also are affected by the risk factors described in the Company's filings with the U.S. Securities and Exchange Commission. Except as required by law, we undertake no obligation to update or revise publicly any , whether as a result of new information, future events or otherwise, after the date on which the statements are made or to reflect the occurrence of unanticipated events.\nPress Contact:\nEran Yoels\nRimon, Cohen and Co.\nEran@rcspr.co.il\n+972-52-440-8020\nSOURCE My Size Inc.", "external_links": ["https://twitter.com/mysizeinc", "https://www.linkedin.com/company/mysizeid", "https://www.facebook.com/mysizeid/", "https://www.globenewswire.com/Tracker?data=Ub5Vjbt2r0ymKmPqrPQ9F8Qqhha72jC7BpOoDZGRuG_ApefeiECFW0g_JyHXyxBC5NaTmEv4d7o1Xh14OVnlrw=="], "published": "2018-01-31T00:05:00.000+02:00", "crawled": "2018-01-31T03:11:17.000+02:00", "highlightTitle": ""}