{"organizations": [], "uuid": "19bd3a4093435c5831539659a06f11981ea89f17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104942106-GettyImages-902078920.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/angela-merkel-unable-to-seal-deal-with-spd-coalition-talks-drag-on.html", "country": "US", "domain_rank": 767, "title": "Angela Merkel unable to seal deal with SPD, coalition talks drag on", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T05:25:00.000+02:00", "replies_count": 0, "uuid": "19bd3a4093435c5831539659a06f11981ea89f17"}, "author": "Sean Gallup", "url": "https://www.cnbc.com/2018/01/11/angela-merkel-unable-to-seal-deal-with-spd-coalition-talks-drag-on.html", "ord_in_thread": 0, "title": "Angela Merkel unable to seal deal with SPD, coalition talks drag on", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "negative"}, {"name": "frank-walter steinmeier", "sentiment": "none"}, {"name": "sean gallup", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "spd", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "German Chancellor Angela Merkel's conservative party grouping and Social Democrats (SPD) toiled deep into the night on Thursday to overcome differences on tax cuts and other issues that threatened to block a new \"grand coalition\" government.\nNegotiators, who have vowed to reach a decision by Friday on whether to launch formal coalition talks, predicted many more hours of hard negotiations.\nSeveral negotiators left the talks at SPD headquarters around midnight, saying they would return later. Others played cards to pass the time. One participant told the German newspaper Bild: \"The negotiations are completely stuck.\"\nGerman President Frank-Walter Steinmeier, keen to end months of uncertainty and avoid new elections, urged the would-be coalition partners to rise above politics and keep in mind the impact of the coalition talks for Europe as a whole.\nMerkel had warned earlier it would be \"a tough day\", but said she recognised that Germans expected results. The German leader is counting on the left-leaning SPD to renew the coalition that ruled for two of her three previous terms after failing to hammer out a deal with two smaller parties.\nSteinmeier, who is pressing both sides to reach a deal, told foreign diplomats in Berlin the delay in forming a government was unprecedented, but the German constitution provided clear rules for the situation, and everyone was taking it seriously.\n\"Those who bear responsibility in the institutions and parties ... know that they have this responsibility not only towards the members of their own party and their own political future. Rather, it is always also a responsibility for Europe, and for reliability, partnership and engagement in international politics,\" he said.\nMerkel, still widely respected abroad after more than 12 years in power, is scrambling to prevent a further erosion of her personal authority at home and end months of uncertainty that have started to weaken Germany's international influence.\nReiner Haseloff, premier of the eastern state of Saxony-Anhalt, told reporters late on Thursday that he remained optimistic and he did not expect the talks to fail.\nBut another participant in the talks said the two blocs were still struggling to find common ground on the most divisive issues - taxes, pensions, migration and healthcare.\nOne SPD negotiator told the Bild newspaper that Bavaria's CSU, sister party to Merkel's Christian Democrats, was blocking an agreement on raising tax rates for the wealthiest. A conservative negotiator told Bild, \"Everything is on the table.\"\nGermany's flourishing economy, whose growth hit a six-year high in 2017, and the resulting record 38.4-billion-euro ($46.2 billion) public sector surplus, offer negotiators a windfall that could fund new programmes.\n\"What is your plan for Germany?\" Bild asked Merkel on Thursday. \"Fact is: the money is there for it,\" it added, suggesting she restructure healthcare, promote public order or outline new targets for tackling climate change.\nThe DIHK Chambers of Industry and Commerce suggested she use the fiscal windfall to simplify bureaucracy, while others pushed for tax cuts.\nBut SPD leader Martin Schulz, a former president of the European Parliament, is calling for more spending to create a United States of Europe by 2025, seen as an expensive distraction by many conservatives.\n\"On the last day of exploratory talks we will make clear that above all this must be a new start for the European Union,\" he told reporters. \"If we join a government it will be on the condition that it makes Europe strong.\"\nshow chapters Migration and investment biggest issues in Germany, analyst says 3:54 AM ET Thu, 7 Dec 2017 | 02:35 Should the parties miss their self-imposed deadline, they could still extend the talks, but negotiators said that was unlikely. Merkel could also try to form a minority government, although she has said she favours new elections.\nSome progress has been made, including draft plans in which negotiators agreed to reduce the use of the weed killer glyphosate, and to drop a target of reducing carbon dioxide emissions by 40 percent by 2020 from 1990 levels.\nMerkel ruled with the SPD in two of her three terms in office, including in the last parliament from 2013-2017.\nBut both parties bled support in the Sept. 24 election, which saw the far-right Alternative for Germany (AfD) enter the Bundestag lower house of parliament for the first time.\nMany SPD members fear governing with conservatives again would further weaken their party after it suffered the worst result in September's vote since the modern Federal Republic was founded in 1949.\nKevin Kuehnert, head of the Jusos youth branch of the SPD, said he planned a 'NoGroKo' tour of Germany to persuade party delegates to vote against the grand coalition.\nHe told broadcaster ARD late on Thursday he had folders of messages of support from SPD members who wanted the SPD go back to its roots and focus more on helping the weakest in society.", "external_links": [], "published": "2018-01-12T05:25:00.000+02:00", "crawled": "2018-01-12T05:26:59.012+02:00", "highlightTitle": ""}