{"organizations": [], "uuid": "9b9c0a3b4f65e8bcef9c18b27db87dce2d873da5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104952306-GettyImages-136699589.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/davos-security-snipers-and-soldiers.html", "country": "US", "domain_rank": 767, "title": "Davos security, snipers and soldiers", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.126, "site_type": "news", "published": "2018-01-22T09:29:00.000+02:00", "replies_count": 0, "uuid": "9b9c0a3b4f65e8bcef9c18b27db87dce2d873da5"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/22/davos-security-snipers-and-soldiers.html", "ord_in_thread": 0, "title": "Davos security, snipers and soldiers", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "simon dawson/bloomberg", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "graubünden", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "congress centre", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "wef", "sentiment": "none"}, {"name": "congress center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ensuring the safety of more than 2,500 high-profile political, economic and business guests at an event is never easy; ensuring the safety of more than 70 heads of state and government is a nightmare.\nThe World Economic Forum (WEF) has said security is paramount at its four-day meeting in the ski resort of Davos, Switzerland. It has to be with the likes of President Donald Trump , French President Emmanuel Macron and Indian Prime Minister Narendra Modi as key guest speakers, along with many other heads of state.\nSecurity is conspicuous in Davos and its meant to be. Soldiers and snipers can be seen patrolling the streets and security checks take place throughout the town — on its transport routes, outside its hotels and at the Forum's venues, most prominently, within the main Congress Center itself.\nSimon Dawson/Bloomberg via Getty Images A police officer stands guard next to a sniper rifle atop the Congress Centre, venue of the World Economic Forum (WEF) Annual Meeting. The Forum is held in the Swiss state of Graubünden (or Canton of Grisons), with the regional government in charge of security rather than the country's Ministry of Defense, a ministry spokesperson told CNBC.\nWhile the Grisons authorities have the overall lead over security, they can ask for help from police teams outside the state as well as from the Swiss Armed Forces, the spokesperson said.\nThreat levels Security measures put in place for the Forum in 2018 are estimated to have cost around 9 million Swiss francs ($9.37 million), according to the Grisons government.\nOf that cost, 8 million Swiss francs is split between the Canton of Grisons (which spends 2 million francs), the commune of Davos (1 million francs), WEF (2 million francs) and the Swiss Confederation (the official name of Switzerland — 3 million francs). The remaining 1 million Swiss francs tends to be shared between the group.\nThe aforementioned cost of around 9 million Swiss francs is applicable if the security deployment for the Forum is \"normal,\" and costs increase substantially if the threat level is raised to level 2 (a \"raised threat level\") or an \"exceptional\" level 3.\nIt costs even more to deploy the armed forces to patrol and protect Davos.\nHarold Cunningham/Getty Images Swiss army soldiers install surveillance equipment in Davos, Switzerland The deployment of the armed forces for what is called \"civil support duties\" in Davos is funded by Switzerland's Federal Department of Defense, Civil Protection and Sport (DDPS), the WEF committee of the Grisons government said:\n\"Overall, the cost of deploying troops at the WEF Annual Meeting is much the same as that incurred by the same battalions when on regular training. In previous years, the deployment of the armed forces has cost an average of around 28 million Swiss francs per meeting.\"\nAndré Kraske, a spokesman for the WEF Committee of the Grisons state government, was understandably tight-lipped on security personnel details.\n\"We do not provide information on the number of police forces deployed. The Federal Council (of Grisons) has approved the deployment of a maximum of 5,000 soldiers,\" he told CNBC.\nSecurity measures in place Restricted access zones: Restricted access areas are in place in WEF's main building, the Congress Center, as well as various areas around Davos' hotels including the Hotel Belvedere, Hilton Hotel and the Intercontinental Hotel.\nIn addition there is restricted access to the Heliport, Kirchner Museum and St. Theodul Church in the center of Davos. Such restricted areas are only accessible to residents, guests, WEF personnel and accredited media.\nControl and search zones: Access routes to Davos and the area within the boundaries of the municipality of Davos are control and search zones and anyone entering or remaining within these are obliged to provide personal identification at any time. Clothing, containers and vehicles entering these zones have to be searched.\nAir space closures: The Grisons government has airspace restrictions in place during WEF 2018 and has banned all paragliders, hang gliders and drones.\nCantonal Police, Grisons Restricted airspace around Davos, Switzerland Police hotline : The Grisons police force has encouraged the public to come forward with any concerns it might have about or during the Davos meeting by using a hotline . The police has also advised residents to be aware that an increase in flight activity and noise is to be expected.\n\"Please be aware that increased flight activity, especially from helicopters, for the period January 2-31, 2018, is likely to result in increased flight noise primarily in the Landwasser and Prättigau valleys. We thank the local populace for their understanding and support,\" the police said in statement.\nSimon Dawson/Bloomberg via Getty Images A member of a police unit practices using an anti-drone gun as part of the security exercises ahead of the World Economic Forum (WEF) in Davos, Switzerland, on Monday, Jan. 16, 2017. The municipality of Davos has to approve any \"events\" such as demonstrations, artistic statements and street theater during the Forum. Anyone without such a permit could face a fine, it said.\nKraske, from the WEF Committee of the Grisons state government, said the security measures were \"oriented on protecting important heads of state and government. I refer in this regard to the visit of the Chinese president at last year's WEF .\"\nWhether increased security would be put in place for Trump, who is due to give a speech at the Forum on January 26, was to be confirmed, he said.\n\"Further consultations will indicate whether the visit by the President of the United States will necessitate any changes, and if so what changes, to existing security measures,\" he said.\nThe threat of terrorism As with any other high-profile public event — and even more so with one hosting so many public figures — the World Economic Forum is acutely aware that the event could be a terrorist target.\nIn particular, the Forum notes that due in particular to the activities and planning by the so-called Islamic State, which has claimed responsibility for a number of attacks in Europe,\" the terrorist threat in Switzerland remains high.\"\n\"In light of terrorist attacks in Europe since 2015 and the ongoing activities of jihadist groups and organizations, the terrorist threat in many European countries remains elevated or high. Switzerland is part of the western world, considered anti-Islam by the jihadists, and is therefore also a possible target of terrorist attacks,\" the Grisons' WEF committee noted.\n\"In particular the interests on Swiss soil of countries involved in the military coalition against Islamic State – Russian, Jewish/Israeli, Iranian and Arabian interests – could be targeted,\" it said.\nDursun Aydemir | Anadolu Agency | Getty Images Security measures are tightened for the World Economic Forum that helds in Davos, Switzerland, as many important economists and politician attend the forum on January 23, 2014. The WEF committee noted that the most likely threat \"comes in the form of attacks requiring minimum logistical planning, carried out by individuals or small groups\" and that the perpetrators of such an attack \"would most likely be persons radicalized in Switzerland.\"\nIt said security conditions were continually being assessed.\n\"The security authorities at federal and cantonal level continuously assess the situation and take the necessary measures where necessary. Robust security precautions with a high, visible police presence, intensive reconnaissance and police checks will again be necessary in 2018 to ensure the event passes off safely.\"\nFollow CNBC International on Twitter and Facebook .", "external_links": [], "published": "2018-01-22T09:29:00.000+02:00", "crawled": "2018-01-22T09:29:33.016+02:00", "highlightTitle": ""}