{"organizations": [], "uuid": "f476557ed4779bb1d005dd1c91148df9fb27f3f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221225885&w=1200&r=LYNXMPEE0A1P4", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-nbc-advertising/nbc-almost-sold-out-on-ads-for-super-bowl-idUSKBN1F02OP", "country": "US", "domain_rank": 408, "title": "NBC almost sold out on ads for Super Bowl", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T21:43:00.000+02:00", "replies_count": 0, "uuid": "f476557ed4779bb1d005dd1c91148df9fb27f3f4"}, "author": "", "url": "https://www.reuters.com/article/us-nbc-advertising/nbc-almost-sold-out-on-ads-for-super-bowl-idUSKBN1F02OP", "ord_in_thread": 0, "title": "NBC almost sold out on ads for Super Bowl", "locations": [], "entities": {"persons": [{"name": "dan lovinger", "sentiment": "none"}, {"name": "lisa shumaker", "sentiment": "none"}, {"name": "jessica toonkel", "sentiment": "none"}, {"name": "lovinger", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "nbc", "sentiment": "negative"}, {"name": "nbc sports group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "comcast corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 7:45 PM / Updated 17 minutes ago NBC expects ad sales record with Super Bowl, Olympics Jessica Toonkel 3 Min Read \n(Reuters) - U.S. broadcaster NBC said on Thursday it expected to hit ad sales records for the Super Bowl and Olympic Winter Games, both of which it will air next month, showing that advertisers are hungry for live events that draw viewers on a real-time basis. \nNBC, a unit of Comcast Corp, has sold all but a handful of 30-second TV spots, which it is charging more than $5 million on average for the Super Bowl, said Dan Lovinger, executive vice president of advertising sales at NBC Sports Group, on a media call. \nFor the Super Bowl, on Feb. 4, NBC expects to score a single-day revenue record for any media company, he said. \nThe company also expects over $900 million in national ad sales for the Olympic games, which would be a first for a Winter Olympics, Lovinger said. The Olympic Winter Games will be held from Feb. 9-25 in Pyeongchang, South Korea. \nNBC estimated ad sales of nearly $1.4 billion for both the Super Bowl and the Olympics. \nLive events remain a bright spot for television advertisers as more viewers tend to watch their favorite shows on demand and fast-forward through the commercials. \nThe Super Bowl traditionally ranks as the year’s most-watched event on U.S. television. The event last year, which was broadcast by 21st Century Fox, drew 111.3 million viewers, slightly down from the 111.9 million a year earlier. \nBig Super Bowl ratings are important for ad revenue as the NFL comes off the second season of declining viewership. In 2017, viewership dropped almost 10 percent to 14.9 million viewers, according to Nielsen. \nAdvertisers have not expressed any concern about ratings around the Super Bowl, Lovinger said. Additionally controversy over players kneeling during the national anthem in protest has not come up as a concern, he said. \nIn a gesture initiated in the 2016 season by then-San Francisco 49ers quarterback Colin Kaepernick, several NFL players have routinely “taken one knee” during the playing of the anthem. It is intended to call attention to what the protesting players see as a pattern of racism in the treatment of African-Americans by U.S. police. \nA vast stable of advertisers will run spots during this year’s Super Bowl, with car makers continuing to have a strong presence and increased buying by consumer packaged goods companies, Lovinger said. \n“All we have seen is enthusiasm for the Super Bowl,” he said. Reporting by Jessica Toonkel in New York; Editing by Lisa Shumaker and Richard Chang", "external_links": [], "published": "2018-01-11T21:43:00.000+02:00", "crawled": "2018-01-11T21:55:40.013+02:00", "highlightTitle": ""}