{"organizations": [], "uuid": "90c3c3b1d10990df4cc04a94f6f40ad2e3563571", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/goldenglobes_thumb.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/facebook-live-stream-golden-globe-awards/", "country": "US", "domain_rank": 1196, "title": "Facebook to Live-Stream 2018 Golden Globes Pre-Show | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.568, "site_type": "news", "published": "2018-01-02T02:00:00.000+02:00", "replies_count": 0, "uuid": "90c3c3b1d10990df4cc04a94f6f40ad2e3563571"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/02/facebook-live-stream-golden-globe-awards/", "ord_in_thread": 0, "title": "Facebook to Live-Stream 2018 Golden Globes Pre-Show | Fortune", "locations": [], "entities": {"persons": [{"name": "tom huddleston jr", "sentiment": "neutral"}, {"name": "dick clark", "sentiment": "none"}, {"name": "seth meyers", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "hollywood foreign press association", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "hfpa", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. January 2, 2018 \nThe event billed as Hollywood’s biggest party will kick off early on Facebook this year. The 2018 Golden Globe Awards pre-show will live-stream exclusively on the social network this Sunday, Jan. 7. \nOn Tuesday, the Hollywood Foreign Press Association (HFPA) and Dick Clark Productions announced the new partnership with Facebook, which will live-stream the two-hour event (dubbed “The HFPA Presents: Globes Red Carpet Live”) including awards handicapping and A-list stars in red carpet interviews, between 6 and 8 p.m. ET on Sunday. The actual broadcast of the 75th annual Golden Globes will then air immediately afterward on NBC from 8 to 11 p.m. ET, with late-night comedian Seth Meyers hosting. \nNBC will also air its own red carpet coverage ahead of the awards show, starting one hour before the main event. Meanwhile, once the main broadcast starts at 8 p.m. ET, Facebook will still offer online fans some behind-the-scenes footage on the Golden Globes Facebook page as well as on the @goldenglobes account on Facebook-owned Instagram. \nGet Data Sheet , Fortune’s technology newsletter. \nSibyl Goldman, Facebook’s head of entertainment partnerships, noted in a statement that the tech giant has enjoyed “a long collaborative relationship” with Hollywood. “We always aim to create unique experiences which bring communities together, and partaking in the kickoff of award season in conjunction with the Hollywood Foreign Press Association, is a demonstration of our commitment to bring fans together through entertainment they enjoy,” Goldman said. \nLast year , HFPA and Dick Clark Productions partnered with Twitter on the Golden Globes pre-show live-stream, with AdWeek reporting that roughly 2.7 million Twitter users tuned in at some point to watch that streaming event. The Golden Globes page on Facebook currently has about 2.3 million followers. And, by switching allegiances from Twitter to Facebook, the Globes can benefit from being promoted on two popular social platforms (Facebook and Instagram) that have a combined 2.8 billion active monthly users. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-02T02:00:00.000+02:00", "crawled": "2018-01-03T14:01:15.008+02:00", "highlightTitle": ""}