{"organizations": [], "uuid": "82d2de468ccc18695de68c58e95d0172cc9af3ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-superior-gold-inc-announces-fourth-quarter-and-full-year-2017-production-results.html", "country": "US", "domain_rank": 767, "title": "Superior Gold Inc. Announces Fourth Quarter and Full Year 2017 Production Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-15T14:00:00.000+02:00", "replies_count": 0, "uuid": "82d2de468ccc18695de68c58e95d0172cc9af3ea"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-superior-gold-inc-announces-fourth-quarter-and-full-year-2017-production-results.html", "ord_in_thread": 0, "title": "Superior Gold Inc. Announces Fourth Quarter and Full Year 2017 Production Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "western australia", "sentiment": "none"}, {"name": "perth", "sentiment": "none"}], "organizations": [{"name": "superior gold inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "plutonic gold operations", "sentiment": "none"}, {"name": "superior gold inc.", "sentiment": "none"}, {"name": "hermes", "sentiment": "none"}, {"name": "plutonic mine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FULL YEAR PRODUCTION OF 80,143 OUNCES EXCEEDED GUIDANCE\n(In US Dollars unless otherwise stated)\nTORONTO, Jan. 15, 2018 /PRNewswire/ - Superior Gold Inc. (\"Superior Gold\" or \"The Company\") (TSX.V:SGI) is pleased to announce production results for the fourth quarter and full year 2017 from the Company's 100%-owned Plutonic Gold Operations, located 800 kilometres north east of Perth, in Western Australia.\nFOURTH QUARTER HIGHLIGHTS\nGold Produced was 20,197 ounces Gold Sold was 20,029 ounces\nFULL YEAR 2017 HIGHLIGHTS\nGold Produced was 80,143 ounces exceeding guidance of 75-80,000 ounces Gold Sold was 82,019 ounces\nADDITIONAL FOURTH QUARTER HIGHLIGHTS\nSince acquiring the Plutonic Mine in October 2016, the Company has produced a total of 103,137 ounces of gold Mining of the Hermes open pit project commenced on schedule in December Released underground drill results of up to 25.2g Au/t over 10.15 metres 36.5g Au/t over 4.00 metres and 192.0g Au/t over 0.60 metres\nProduction details for the fourth quarter and full year 2017, are summarized in the table below.\nThree month period ended\nDecember 31, 2017\nTwelve month period ended\nDecember 31, 2017\nGold Produced (ounces)\n20,197\n80,143\nGold Sold (ounces)\n20,029\n82,019\nChris Bradbrook, President and CEO of Superior Gold stated: \"2017 was a year of significant achievements and we are extremely pleased to announce such strong production results, exceeding guidance, for our first full year of operation. We have now operated the Plutonic Gold Mine for five consecutive quarters and have produced over 100,000 ounces of gold.\nMining has commenced, on schedule, at our Hermes development project. Initial ore was processed before year end and commercial production is anticipated during the first quarter of 2018. The contribution of the mineralization from Hermes is expected to allow us to reach our objective of increasing annual production to more than 100,000 ounces of gold.\"\nThe Company plans to release throughput, grade and recovery information for the fourth quarter and full year 2017, along with 2018 guidance, in the near future and will release complete financial and operating results for both periods in March.\nQualified Person\nScientific and technical information in this news release has been reviewed and approved by Pascal Blampain, who is a member of the AusIMM and the Australian Institute of Geoscientists (AIG) and a \"qualified person\" within the meaning of NI 43-101. Mr. Blampain is an employee of the Company and serves as Chief Geologist.\nAbout Superior Gold\nSuperior Gold is a Canadian based gold producer that owns 100% of the Plutonic Gold Operations located in Western Australia. The Plutonic Gold Operations include the Plutonic Gold Mine, which is a producing underground operation with a central mill, the Hermes open pit development project and an interest in the Bryah Basin joint venture. Superior Gold is focused on expanding production at the Plutonic Gold Operations and building an intermediate gold producer with superior returns for shareholders.\nForward Looking Information\nThis press release contains \"forward-looking information\" within the meaning of applicable securities laws that is intended to be covered by the safe harbours created by those laws. \"Forward-looking information\" includes statements that use forward-looking terminology such as \"may\", \"will\", \"expect\", \"anticipate\", \"believe\", \"continue\", \"potential\" or the negative thereof or other variations thereof or comparable terminology. Forward looking information in this news release includes, but is not limited to, the Company's objectives, goals or future plans, and statements regarding exploration results and exploration plans.\nForward-looking information is not a guarantee of future performance and is based upon a number of estimates and assumptions of management at the date the statements are made. Furthermore, such forward-looking information involves a variety of known and unknown risks, uncertainties and other factors which may cause the actual plans, intentions, activities, results, performance or achievements of the Company to be materially different from any future plans, intentions, activities, results, performance or achievements expressed or implied by such forward-looking information. See \"Risk Factors\" in the Company's prospectus dated February 15, 2017 filed on SEDAR at www.sedar.com for a discussion of these risks.\nThe Company cautions that there can be no assurance that forward-looking information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information. Accordingly, investors should not place undue reliance on forward-looking information. Except as required by law, the Company does not assume any obligation to release publicly any revisions to forward-looking information contained in this press release to reflect events or circumstances after the date hereof.\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the Exchange) accepts responsibility for the adequacy or accuracy of this release.\nSOURCE Superior Gold", "external_links": ["http://www.sedar.com/"], "published": "2018-01-15T14:00:00.000+02:00", "crawled": "2018-01-15T16:40:08.022+02:00", "highlightTitle": ""}