{"organizations": [], "uuid": "ae6a9b221e4be32c1b73aba35484d8a59f71c441", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/12/reuters-america-us-stocks-wall-st-hits-new-highs-on-earnings-optimism-data.html", "country": "US", "domain_rank": 767, "title": "US STOCKS-Wall St hits new highs on earnings optimism, data", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T23:31:00.000+02:00", "replies_count": 0, "uuid": "ae6a9b221e4be32c1b73aba35484d8a59f71c441"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/12/reuters-america-us-stocks-wall-st-hits-new-highs-on-earnings-optimism-data.html", "ord_in_thread": 0, "title": "US STOCKS-Wall St hits new highs on earnings optimism, data", "locations": [], "entities": {"persons": [{"name": "william lynch", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "hinsdale", "sentiment": "none"}], "organizations": [{"name": "hinsdale associates", "sentiment": "none"}, {"name": "jpmorgan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Consumer discretionary is top gainer, utilities biggest loser\n* Retail sales rise 0.4 percent; core sales up 0.3 percent\n* Rising rents, healthcare costs boost underlying U.S. inflation\n* Indexes up: Dow 0.79 pct, S&P 0.61 pct, Nasdaq 0.61 pct (Updates to close, adds commentary)\nJan 12 (Reuters) - Wall Street continued its rally on Friday with record closing highs as the fourth-quarter earnings season kicked off with solid results from banks and robust retail sales drove investor optimism about economic growth.\nThe S&P 500 and Nasdaq both registered their eight record closing highs out of the first nine trading days of 2018, while the Dow boasted its sixth closing high of the year.\nJPMorgan, the biggest U.S. lender by assets, said a U.S. tax overhaul would help future profits by reducing its tax bill and stimulating more business. The bank's shares rose 1.7 percent.\n\"The fact all the big money center banks beat on the bottom line is a good omen for the rest of the earnings season,\" said William Lynch, director of investments at Hinsdale Associates, in Hinsdale, Illinois.\nInvestors were also hopeful 2018 financial forecasts from U.S. companies would beat Wall Street estimates as many analysts may not have tax savings fully reflected in their models as the tax bill was signed into law so late in December.\n\"I don't know how much of that is priced in right now,\" said Stephen Massocca, senior vice president at Wedbush Securities in San Francisco. \"It seems like the economy is going OK, inflation is kind of nonexistent right now, wage growth is not an issue for most income statements, so what's not to like here.\"\nEarnings for S&P 500 companies are expected to increase on an average by 12.1 percent in the quarter, with profit for financial services companies likely to increase 13.2 percent, according to Thomson Reuters I/B/E/S.\nBlackRock rose 3.3 percent. The world's largest asset manager reported profit that beat estimates as investors flooded into the relatively low-cost funds.\nWhile Wells Fargo earnings beat expectations, its shares slipped 0.7 percent after it set aside $3.25 billion in the fourth quarter to cover legal expenses related to probes into its mortgage and sales practices.\nThe Dow Jones Industrial Average rose 228.46 points, or 0.89 percent, to 25,803.19, the S&P 500 gained 18.68 points, or 0.67 percent, to 2,786.24 and the Nasdaq Composite added 49.29 points, or 0.68 percent, to 7,261.06.\nFor the week, the S&P rose 1.6 percent, compared with the Dow's 2-percent rise and a 1.8-percent advance in the Nasdaq.\nThe S&P consumer discretionary index jumped 1.3 percent after retail sales data showed households bought more goods, suggesting the economy exited 2017 with strong momentum.\nAmazon rose 2.2 percent to breach $1,300 for the first time. It closed at $1,305.20.\nThe sector was also helped by a late-afternoon Bloomberg report that activist D.E. Shaw built a position in Lowe's Companies, sending its shares up 5.3 percent.\nBank stocks were helped by a rise in Treasury yields after underlying U.S. consumer prices for December posted the biggest gain in 11 months, signaling a pickup in inflation.\nThe Treasury move helped push the utilities sector down 0.6 percent, making it the weakest performer of the S&P 500's 11 sectors.\nAdvancing issues outnumbered declining ones on the NYSE by a 1.17-to-1 ratio; on Nasdaq, a 1.54-to-1 ratio favored advancers.\nThe S&P 500 posted 164 new 52-week highs and 12 new lows; the Nasdaq Composite recorded 222 new highs and 14 new lows.\nVolume so far on U.S. exchanges was 6.88 billion shares, above the 6.39 billion average for the full session over the last 20 trading days. (Additional reporting by Caroline Valetkevitch and April Joyner in New York, Sruthi Shankar in Bengaluru; Editing by Arun Koyyur and Nick Zieminski)", "external_links": [], "published": "2018-01-12T23:31:00.000+02:00", "crawled": "2018-01-13T06:16:09.014+02:00", "highlightTitle": ""}