{"organizations": [], "uuid": "f49b51285a6176f646df96687fb06eee1a7bccb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/21/104911958-Webp.net-resizeimage_2.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/michelin-starred-chefs-are-cooking-up-fast-casual-meals-for-under-10.html", "country": "US", "domain_rank": 767, "title": "Michelin-starred chefs are cooking up fast casual meals for under $10", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.244, "site_type": "news", "published": "2018-01-04T17:51:00.000+02:00", "replies_count": 0, "uuid": "f49b51285a6176f646df96687fb06eee1a7bccb1"}, "author": "Jessica Mathews", "url": "https://www.cnbc.com/2018/01/04/michelin-starred-chefs-are-cooking-up-fast-casual-meals-for-under-10.html", "ord_in_thread": 0, "title": "Michelin-starred chefs are cooking up fast casual meals for under $10", "locations": [], "entities": {"persons": [{"name": "del posto", "sentiment": "negative"}, {"name": "mark ladner", "sentiment": "negative"}, {"name": "momofuku", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "ladner", "sentiment": "none"}, {"name": "danny meyer", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "greenwich village", "sentiment": "none"}], "organizations": [{"name": "shake shack", "sentiment": "none"}, {"name": "del posto", "sentiment": "none"}, {"name": "union square hospitality group", "sentiment": "none"}, {"name": "michelin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Executive chef Mark Ladner of Del Posto led the New York City Italian restaurant to its first Michelin star, but by the time it was awarded, he had moved on to a bigger ambition — bringing fine-dining pasta to the masses for under $10. \n\"I always wanted to crack the code on making pasta that typically takes a long time to cook, and figure out a way to provide it to people more quickly without sacrificing the quality or the al dente bite,\" said Ladner, who left Del Posto last February to found his fast-casual pasta restaurant, Pasta Flyer . In November the fast-casual restaurant opened its first New York City location, in Greenwich Village.\nPasta Flyer is serving a few hundred people a day, about 50 percent being takeout and delivery orders. Ladner said lines are steady throughout the day, but they haven't had lines out the door, but he added that's a good thing as it can at least partially be attributed to an efficient and quick line.\nLadner is in good company among top chefs taking menus downscale — some of the world's most renowned restaurateurs are entering the fast-casual market, which promotes authentic ingredients and quick service while offering a slightly more expensive alternative to fast food chains. \nDanny Meyer, founder and CEO of Union Square Hospitality Group , opened Shake Shack in 2004. Momofuku's chef David Chang opened the six-store New York chain Fuku , and Chef José Andrés of minibar in Washington, D.C., opened Beefsteak in 2015. Chef Daniel Humm and Will Guidara of Eleven Madison Park and The Nomad opened their first fast-casual spot, Made Nice , in April of this year. Franklin Becker, a \"Top Chef Master\" and former head of several pricey New York City restaurants under the EMM Group brand, teamed with fast-food investment firm Aurify Brands to launch Little Beet in 2015.\nEuromonitor estimated that the United States fast-food market was 10 percent fast-casual restaurants in 2015. One year later The National Restaurant Association estimated they consume 18 percent of the market, a $47 billion industry, and they're predicting that chef-driven fast-casual concepts will be a top trend in 2018 .\nMark Ladner opened up Pasta Flyer, a fast casual restaurant in New York City's Greenwich Village, after serving as executive chef at Del Posto since it opened in 2005. \"The check average at Del Posto was $300 a person, while the check average [at Pasta Flyer] is closer to $10 a person.\" -Mark Ladner, former executive chef of Del Posto and founder of Pasta Flyer Ladner's favorite dish on the Pasta Flyer menu — the rigatoni, which costs $7.50 and is ready for the customers 30 seconds after they order.\n\"The check average at Del Posto was $300 a person, while the check average here is closer to $10 a person,\" Ladner said. Yet he says the quality is nearly the same. \"I'll try to make something as good as I possibly can, and then we'll cost it out and see if it is actually realistic to produce it that way.\"\nWhile Ladner uses the same vendors he had at Del Posto, he had to work out arrangements at new price points. The pasta itself is made in Italy, then sent to the Midwest to be processed and sent frozen to Pasta Flyer. When it is ordered, it is cooked in 15 seconds in front of the customer. The other 15 seconds are for the sauce and the grated Parmigiano-Reggiano.\nThe back of the store operates like a fine-dining kitchen. \"At [Pasta Flyer], from the back door until you get to the service line, it's essentially slow food, and then the service line itself is fast. So we're not sacrificing that much to make the food fast.\"\nFood critics weigh in Food critics have been skeptical of the Michelin movedowns. \nWashington, D.C.-based Todd Kliman, who has won multiple James Beard writing awards for food criticism, said customers lose part of the experience of fine dining when they choose fast casual, even when they are eating food from the same chefs. While the chefs are making their cuisine available to more people, \"the cynical way to look at it is that it's available, but it's a knockoff of the cuisine that made [them] famous.\"\nPete Wells, food critic at The New York Times, said that some of the menu options at Made Nice didn't measure up to dishes at Eleven Madison Park and the Nomad, on which they were based. Others were just poor on their own.\n\"Of the nine major dishes on the current menu, there are three I would be happy to eat again,\" wrote Wells in a review .\nAdditionally, Kliman said the fast-casual model eliminates one of the key experiential features of a top chef's establishment — not feeling rushed.\n\"For the most part, these are not comfortable places,\" he said. \"You're not supposed to stay longer than the industry standard: about 30 to 40 minutes.\" \nKliman has yet to try Pasta Flyer but said, \"If it is made in Italy and shipped over here and they take time to preserve the integrity of the pasta and it is frozen well, cared for well and married to a good sauce — if that is all true, the quality is probably very high.\"\nBut he said its menu shouldn't be compared to the quality of Del Posto — there can be no comparison at that price point.\nLadner said the biggest reason for the price gap between Del Posto and Pasta Flyer is the amenities that come with fine dining, amenities that he says less people are currently placing as much value on. \"The experience is expensive is for many reasons outside the cost of the food. There are a lot of expenses that are embedded within the price.\"\nLadner said the biggest difference for him between Del Posto and Pasta Flyer isn't one of quality, as the food is essentially the same product without the amenities. It's moving to an open kitchen that has been a big change. He works the front line at Pasta Flyer every day, and he said he does miss \"the mystery\" of a private kitchen, but the open kitchen provides the opportunity to receive feedback directly so he can make improvements in real time.\nBeyond that, Ladner says the operations at a fine-dining and fast-casual restaurant are really not that different.\n\"The hospitality industry is still the hospitality industry,\" Ladner said.\n— By Jessica Mathews, special to CNBC.com", "external_links": [], "published": "2018-01-04T17:51:00.000+02:00", "crawled": "2018-01-04T17:51:35.006+02:00", "highlightTitle": ""}