{"organizations": [], "uuid": "e9f9117e819f21e304521eb355e6cdd0fd84efc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 26}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC650_3fKur_TOP_20180122145233.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/is-growth-worth-the-risk-at-aig-1516651260", "country": "US", "domain_rank": 387, "title": "Is Growth Worth the Risk at AIG?", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-22T23:01:00.000+02:00", "replies_count": 0, "uuid": "e9f9117e819f21e304521eb355e6cdd0fd84efc2"}, "author": "Aaron Back", "url": "https://www.wsj.com/articles/is-growth-worth-the-risk-at-aig-1516651260", "ord_in_thread": 0, "title": "Is Growth Worth the Risk at AIG?", "locations": [], "entities": {"persons": [{"name": "brian duperreault", "sentiment": "none"}], "locations": [], "organizations": [{"name": "aig", "sentiment": "neutral"}, {"name": "american international group", "sentiment": "neutral"}, {"name": "validus holdings", "sentiment": "none"}, {"name": "lloyd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS American International Group AIG 2.34% has spent the last decade getting smaller and simpler. Now it is boosting complexity to fuel growth.\nAIG struck a deal to acquire Bermuda-based insurance and reinsurance group Validus Holdings VR 0.30% for $5.56 billion. AIG CEO Brian Duperreault touted the deal’s diversification benefits. Validus will add a number of business lines that AIG currently lacks, including crop insurance, a syndicate with the Lloyd’s insurance market, and the reinsurance operations.\nMr. Duperreault’s efforts to grow AIG are admirable and in many ways the Validus deal makes sense. But there are reasons to be skeptical. AIG is still trying to fix its struggling commercial insurance business, where aggressive underwriting led to losses.\nNow also looks like a curious time to jump into reinsurance , the business of backstopping insurers against large losses. Reinsurer returns have been in steady decline for many years because investors have flooded into the market, driving down prices. Investors had hoped that reinsurance pricing would jump following a wave of natural disasters, but price increases so far have been disappointing.\nFinally, the deal isn’t coming cheap. AIG is paying a 46% premium to Validus’s closing share price on Friday, at a valuation of around 1.5 times book value.\nMr. Duperreault’s bet is the deal’s positives will prevail. After the deal, Validus’ reinsurance premiums would amount to only 3% of AIG’s total business, according to a presentation by the company, limiting the added risk. Reinsurance only accounted for around a third of Validus’s net premiums written in 2017.\nOffsetting that risk and potentially boosting growth is Validus’s AlphaCat unit, which accounted for 11% of its net premiums. The unit helps funds invest in catastrophe bonds and other alternative insurance capital. Mr. Duperreault on Monday singled out AlphaCat for its growth potential. “That is a skill set we don’t have and really need,” he said.\nThen there are the tax benefits , which add to the transaction’s appeal. Validus will be able to take advantage of AIG’s $21 billion of deferred tax assets. These assets are set to be written down some due to the lower corporate tax rate, but should still be large enough to shield AIG from paying any U.S. taxes for several years.\nWith these benefits, the deal should prove profitable for AIG. Wells Fargo analyst Elyse Greenspan estimates it will add 6% to AIG’s 2019 earnings per share.\nNone of this changes AIG’s core task under Mr. Duperreault, which is to address to poor performance of the company’s core commercial insurance lines. The success of his tenure depends upon solving it, no matter what clever deals he tacks on in the meantime.\nWrite to Aaron Back at aaron.back@wsj.com", "external_links": [], "published": "2018-01-22T23:01:00.000+02:00", "crawled": "2018-01-23T01:37:51.000+02:00", "highlightTitle": ""}