{"organizations": [], "uuid": "452b447dd26e065d1bd46ce20ccdbf8d5ea79a67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/diamonds.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/15/biggest-diamond-history-lesotho-africa/", "country": "US", "domain_rank": 1196, "title": "1 of the Biggest Diamonds in History Has Just Been Discovered | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.559, "site_type": "news", "published": "2018-01-15T08:21:00.000+02:00", "replies_count": 0, "uuid": "452b447dd26e065d1bd46ce20ccdbf8d5ea79a67"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/15/biggest-diamond-history-lesotho-africa/", "ord_in_thread": 0, "title": "1 of the Biggest Diamonds in History Has Just Been Discovered | Fortune", "locations": [], "entities": {"persons": [{"name": "clifford elphick", "sentiment": "none"}, {"name": "lucar", "sentiment": "none"}], "locations": [{"name": "africa", "sentiment": "none"}, {"name": "lesotho", "sentiment": "none"}, {"name": "letseng", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 6:21 AM EST \nOne of the biggest diamonds in history has been discovered in the mountainous kingdom of Lesotho in southern Africa. \nGem Diamonds (gmdmf) found the 910-carat stone, about the size of two golf balls, at its Letseng mine in the country. It’s a D color Type IIa diamond, which means it has very few or no nitrogen atoms and is one of the most expensive stones. The diamond is the fifth-biggest ever found. \nThe Letseng mine is famous for the size and quality of the diamonds it produces and has the highest average selling price in the world. Gem sold a 357-carat stone for $19.3 million in 2015 and in 2006 found the 603-carat Lesotho Promise. \nRead: The 51-Carat Russian Diamond That Couldn’t Sell \n“This exceptional top-quality diamond is the largest to be mined to date and highlights the unsurpassed quality of the Letseng mine,” Chief Executive Officer Clifford Elphick said in a statement. \nGem did not say how it will sell the diamond or what it could be worth. Its value will be determined by the size and quality of the polished stones that can be cut from it. Lucara Diamond Corp. sold a 1,109-carat diamond for $53 million last year, but got a record $63 million for a smaller 813-carat stone it found at the same time in 2015. \n“The pricing of diamonds is hugely variable and driven by a multitude of factors,” said Ben Davis, an analyst at Liberum Capital Markets. “But assuming that there are no large inclusions running through the diamond, we initially estimate a sale of $40 million.” \nRead: De Beer’s Diamond Sales Have Taken a Major Hit Recently \nGem’s mega discovery follows news last week that it had found 117-carat and 110-carat stones. It will be another boost for the company that dropped to a record low last year after prices for its stones fell and it was forced to close a new mine in Botswana. Gem rose as much as 18%, the biggest intraday gain since 2010, and traded at 93 pence by 9:06 a.m. in London. \nThe three large discoveries will raise investor confidence that the company has overcome a shortage of large stones and that it can recover the biggest diamonds without breaking them. Gem found at least seven stones bigger than 100 carats in 2017 and five the year before. It recovered a dozen exceeding 100 carats in 2015. \nRead: Here’s How Much It Costs to Buy a Diamond the Size of a Tennis Ball \nThe biggest diamond discovered is the 3,106-carat Cullinan, found near Pretoria, in South Africa, in 1905. It was cut to form the Great Star of Africa and the Lesser Star of Africa, which are set in the Crown Jewels of Britain. Lucara’s 1,109-carat Lesedi La Rona is the second-biggest, with the 995-carat Excelsior and 969-carat Star of Sierra Leone the third- and fourth-largest. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-15T08:21:00.000+02:00", "crawled": "2018-01-15T15:23:18.000+02:00", "highlightTitle": ""}