{"organizations": [], "uuid": "35f925cb127d7f0a318f263486460cb7c956e8b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/rtx44nw2.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/facebook-earnings-preview-wednesday/", "country": "US", "domain_rank": 1196, "title": "Facebook Q4 Earnings Preview: Revenue Growth, News Feed Changes | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.994, "site_type": "news", "published": "2018-01-31T22:27:00.000+02:00", "replies_count": 0, "uuid": "35f925cb127d7f0a318f263486460cb7c956e8b2"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/30/facebook-earnings-preview-wednesday/", "ord_in_thread": 0, "title": "Facebook Q4 Earnings Preview: Revenue Growth, News Feed Changes | Fortune", "locations": [], "entities": {"persons": [{"name": "tom huddleston jr.", "sentiment": "negative"}, {"name": "mark zuckerberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "est  facebook", "sentiment": "neutral"}, {"name": "wall street", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. 8:27 PM EST \nFacebook reports its fourth-quarter earnings on Wednesday afternoon and the social media giant is once again expected to post huge revenue growth. \nThe company’s mobile ad sales continue to ensure that Facebook’s financial performance is the picture of health even as other factors—including the spread of online misinformation , fake accounts , and concerns over the well-being of its own users—paint less of a rosy image of the company in the eyes of the world. In short, Facebook is making money hand-over-fist, but CEO Mark Zuckerberg still has plenty of concerns on his plate, including some that could be discussed on tomorrow’s earnings call. \nHere are some things to look for when Facebook reports results from its most recent quarter on Wednesday. Revenue growth, spending growth \nWall Street expects Facebook to report fourth-quarter revenue of roughly $12.55 billion, which would be up more than 42% over the same period in the previous year, while adjusted earnings per share are expected to jump by almost 38% to $1.94. While the social media giant’s primary financial lines are not expected to disappoint, one area that investors will be watching closely on Wednesday will be Facebook’s forecasted operating expenses for the rest of 2018. Last fall, the company’s announcement that it expected operating expenses to rise 45% to 60% in 2018—in part, due to increased spending on security measures, extra workers to police what’s posted on the service, and on original programming — caused shares to drop briefly after the previous earnings report. Investors will undoubtedly be hoping to see Facebook lower that forecast. \nGet Data Sheet , Fortune’s technology newsletter. Algorithm changes \nFacebook shares also took a hit earlier this month after the company announced its huge new changes to the service’s news feed , where Facebook will begin to show fewer posts from news organizations and marketers in favor of more content from users’ friends and family. The changes are sure to be a topic of discussion on Wednesday’s earnings call, as investors and analysts seek more detailed information about how the shift could affect Facebook’s bottom line, specifically with regard to its ad business. While some have reported that Facebook’s engagement rates have slipped of late, Zuckerberg said the recent moves are aimed at improving the quality of users’ experiences on the social network at a time when there are increasing concerns over social media’s effects on mental health . \nAnd, speaking of news on Facebook, Zuckerberg also said recently that he wants to boost local news sources on users’ news feeds while also finding out about individuals’ most trusted news sources. So far, those in the news industry have been skeptical , including Fortune ‘s Adam Lashinsky . Progress on messaging and video \nZuckerberg said last year that he wants to move faster in monetizing messaging apps Facebook Messenger and WhatsApp, both of which have well over a billion monthly active users. Both apps have added a number of new features in the past year, including those aimed at getting users to engage with businesses online, so investors will be looking for some more optimism from Facebook on that front. Meanwhile, the company has invested a fair amount in its Watch online video platform, including landing original programming for the service, and Facebook may share some updates on how Watch is performing with users as part of its earnings report. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-31T22:27:00.000+02:00", "crawled": "2018-01-31T16:02:51.025+02:00", "highlightTitle": ""}