{"organizations": [], "uuid": "4147b5629ece2c2fd3e0f2af94a3ec5cb9c49a8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-trafficking-protests/india-rights-panel-to-probe-failure-to-support-rescued-slave-workers-idUSKBN1EU0R2", "country": "US", "domain_rank": 408, "title": "India rights panel to probe failure to support rescued slave workers", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:53:00.000+02:00", "replies_count": 0, "uuid": "4147b5629ece2c2fd3e0f2af94a3ec5cb9c49a8a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-trafficking-protests/india-rights-panel-to-probe-failure-to-support-rescued-slave-workers-idUSKBN1EU0R2", "ord_in_thread": 0, "title": "India rights panel to probe failure to support rescued slave workers", "locations": [], "entities": {"persons": [{"name": "nirmal gorana", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "kashmir", "sentiment": "none"}, {"name": "reasi", "sentiment": "none"}, {"name": "jammu", "sentiment": "none"}, {"name": "chhattisgarh", "sentiment": "none"}], "organizations": [{"name": "mumbai", "sentiment": "negative"}, {"name": "nhrc", "sentiment": "negative"}, {"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "national human rights commission", "sentiment": "negative"}, {"name": "national campaign committee for eradication of bonded labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Thomson Reuters Foundation) - India’s National Human Rights Commission (NHRC) will investigate the failure of authorities to provide a group of enslaved workers with legal and financial support after being rescued, an official said Friday.\nLocal government officials and rights activists with the National Campaign Committee for Eradication of Bonded Labour (NCCEBD) freed about 100 people last weekend from brick-making factories in the northern state of Jammu and Kashmir.\nThe workers and their families had been trafficked from the state of Chhattisgarh, in central India, and some had been working for as long as 30 years, according to Nirmal Gorana of the NCCEBD.\n“They had not once stepped out of the brick kilns,” he said. “This was a clear case of trafficking for bonded labor.”\nUnder Indian law, survivors should be provided with release certificates, which are legal documents that entitle them to cash compensation, jobs, land and education for their children.\nThe NHRC has decided to investigate why officials in the districts of Reasi and Samba - where the workers were - did not issue the papers, said the commission’s registrar, Surajit Dey.\n“They were trafficked workers,” he told the Thomson Reuters Foundation. “We have asked the district magistrates of Reasi and Samba to issue them release certificates.”\nSheetal Nanda, the Samba district magistrate, said there was no evidence that the workers and their families were held against their will.\n“There is no question of a release certificate until the time we can establish it was bonded labor, which would mean they were made to stay by force and their payments were withheld,” she said by telephone.\nIndia banned bonded labor in 1976, but millions of people remain enslaved in fields, brick kilns, rice mills, brothels and private homes. Most are from marginalized Dalit and tribal communities.\nIn 2016, the government announced plans to rescue more than 18 million bonded laborers by 2030, and to increase compensation for rescued workers by fivefold.\n“But in many cases, officials fail to recognize them as bonded workers and simply send them back to their home state,” said Umi Daniel, a migrant rights activist with Aide et Action in the eastern state of Odisha.\nHe estimated that only about 10 to 15 percent of those rescued in the last five years were given release certificates.\nThe workers and their families who were rescued last weekend were taken to Delhi, India’s capital, where they staged protests demanding certificates.\nReporting by Roli Srivastava @Rolionaroll; Editing by Jared Ferrie. Please credit Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T16:53:00.000+02:00", "crawled": "2018-01-05T22:28:38.001+02:00", "highlightTitle": ""}