{"organizations": [], "uuid": "c64c3f9462e03783662fac98e2b39157294b0f1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223085794&w=1200&r=LYNXMPEE0H1HU", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-stk-hdd/new-stoke-boss-lambert-looks-for-instant-impact-idUKKBN1F72G3", "country": "US", "domain_rank": 408, "title": "New Stoke boss Lambert looks for instant impact", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:13:00.000+02:00", "replies_count": 0, "uuid": "c64c3f9462e03783662fac98e2b39157294b0f1c"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-stk-hdd/new-stoke-boss-lambert-looks-for-instant-impact-idUKKBN1F72G3", "ord_in_thread": 0, "title": "New Stoke boss Lambert looks for instant impact", "locations": [], "entities": {"persons": [{"name": "lambert", "sentiment": "negative"}, {"name": "mark hughes", "sentiment": "none"}, {"name": "aston villa", "sentiment": "none"}, {"name": "paul lambert", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "norwich", "sentiment": "none"}, {"name": "stoke city", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "wolverhampton wanderers", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "blackburn rovers", "sentiment": "none"}, {"name": "huddersfield town", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 5:15 PM / Updated an hour ago New Stoke boss Lambert looks for instant impact Reuters Staff 3 Min Read \n(Reuters) - Stoke City’s new manager Paul Lambert will be hoping for a quick fix as he seeks to shore up one of Europe’s worst defences against Huddersfield Town and begin the long haul up the Premier League table. \nLambert’s appointment, apparently as third choice to succeed Mark Hughes, has been questioned in some quarters but the former Champions League winner boasts an impressive record of sparking an improvement at almost all the clubs he has managed. \nNorwich, Aston Villa and Wolverhampton Wanderers all saw their points-to-games ratio increase markedly in the Scot’s first 10 games in charge, with Blackburn Rovers, where there has been turmoil for years, the only club proving resistant to Lambert’s arrival. \nThe 48-year-old will be hard-pressed not to improve Stoke, who are 18th in the league having taken just four points from their past eight games. They are also the first club in Europe’s top five divisions to concede 50 goals this season. \nThe new manager has had a busy week, watching his new side lose 3-0 at Old Trafford on Monday, overseeing training on Tuesday, helping negotiate the transfer of left-back Kostas Stafylidis and the possible return of Bojan Krkic from loan at Alaves, and then preparing for Saturday’s visit of Huddersfield, who themselves are dangerously near the drop zone. \nJust six points separate 10th-placed Watford from Stoke, with Huddersfield sitting four places and four points above them in what promises to be one of the most closely fought relegation fights in years. \n“I will have nerves as normal on Saturday but as soon as the whistle blows they will disappear,” said Lambert, who was out of work for nearly eight months since leaving Wolves at the end of last season. \n“I‘m looking forward to it because I know it will be a great atmosphere. I’ve not had time to sleep just yet because everything has been go, go, go but I’m really enjoying it.” \nLambert has received a boost with the news that Ryan Shawcross and Glen Johnson have both trained this week after injuries. \n“We can’t keep conceding the goals we are conceding. It puts too much pressure on everybody and at the same time we have to score goals to take pressure off the back lads,” said Lambert. \nWhile he faces a struggle to return his flailing side to the “Stoke-alona” days when Bojan, Xherdan Shaqiri and Marko Arnautovic dazzled, Lambert is “100 percent confident” that he can ensure the club retain their 10-year top-flight status. \nHuddersfield are seeking their first league win since routing Watford 4-1 at Vicarage Road on Dec. 16 and may give first Premier League starts to new signings Alex Pritchard and Terence Kongolo. \nBoth played bit parts in the 4-1 defeat by West Ham United, a performance that prompted some supporters to criticise Town’s players for their reluctance to shoot. But manager David Wagner has vowed to retain the approach that has allowed Huddersfield to hold their own. Reporting by Neil Robinson, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-18T19:13:00.000+02:00", "crawled": "2018-01-18T19:41:26.013+02:00", "highlightTitle": ""}