{"organizations": [], "uuid": "1f71272676a86f50977c8d53d9d4d718d9d181aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-technologies-management-inc-announces-company-name-change-to-inteserra-consulting-group.html", "country": "US", "domain_rank": 767, "title": "Technologies Management, Inc. Announces Company Name Change to Inteserra Consulting Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-24T17:30:00.000+02:00", "replies_count": 0, "uuid": "1f71272676a86f50977c8d53d9d4d718d9d181aa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-technologies-management-inc-announces-company-name-change-to-inteserra-consulting-group.html", "ord_in_thread": 0, "title": "Technologies Management, Inc. Announces Company Name Change to Inteserra Consulting Group", "locations": [], "entities": {"persons": [{"name": "connie wightman", "sentiment": "none"}, {"name": "inteserra", "sentiment": "none"}, {"name": "wightman", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "tland", "sentiment": "none"}], "organizations": [{"name": "inteserra consulting group new name evolves company", "sentiment": "negative"}, {"name": "technologies management, inc", "sentiment": "neutral"}, {"name": "technologies management, inc.", "sentiment": "none"}, {"name": "inteserra consulting group, inc", "sentiment": "none"}, {"name": "inteserra consulting group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New Name Evolves Company to Focus on Market Expansion and Reflect Broader Business Relationships\nMAITLAND, Fla.--(BUSINESS WIRE)-- Technologies Management, Inc. (“TMI”), a leading consulting firm for the communications and competitive energy industries, announced today that the company will begin operating under its new name Inteserra Consulting Group, Inc. The company’s ownership and staff have not changed.\n“Changing the name was a thoughtful process that included much input from third parties, management and staff,” said Connie Wightman, Chief Executive Officer of Inteserra Consulting Group. “Hundreds of options were considered, but Inteserra communicated best our company’s distinctive way of bringing together disparate data sources, institutional knowledge, marketplace acuity and regulatory information to turn insights into opportunities for our clients.” Wightman added: “This name change reflects both the evolution of the company and its increasingly diversified business strategy that reflects the convergence of telecommunications, broadband and wireless technologies.”\nAlong with the name change, a redesigned company logo has been revealed and a new website prominently features the company’s focus on expanding its consulting and compliance services, industry research, and information resources. \"This change represents a defining moment for the entire Inteserra family,” added Wightman. “We will continue to build on our 30-year heritage of advisory and regulatory compliance expertise.”\nInteserra Consulting Group will maintain operations from its Maitland, FL headquarters, with an expanding range of consulting, compliance reporting and information services. The name change will lead a series of future enhancements, including a new visual identity with improved web/mobile presence, ease of access to info tools and Briefing service and heightened presence across industry professional associations. For more information about the name change or to learn more about the services of Inteserra Consulting Group please visit www.Inteserra.com .\nAbout Inteserra Consulting Group, Inc.\nEstablished in 1986, Inteserra Consulting Group has built a solid reputation specializing in state and federal regulatory matters for the communications and competitive energy industries. Our in-depth experience and collective knowledge of market entry, product planning, project management and regulatory compliance have enhanced the value of hundreds of competitive service providers by establishing compliance “best practices” and maintaining good standing with state and federal regulatory agencies. Each member of Inteserra’s consulting staff has worked within the industry or the regulatory commission environment and brings real-world experience to help our clients meet their goals. Inteserra’s personal, thoughtful consultation, regulatory Briefings and information resources are backed by over 30 years of business acumen, providing the industry’s most trusted insights to help our clients lead their organizations.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005017/en/\nI nteserra Consulting Group, Inc.\nJennifer Durst-Jarrell\nDirector of Marketing\n407-740-8575\ndurstjarrell@inteserra.com\nSource: Inteserra Consulting Group, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.Inteserra.com&esheet=51746438&newsitemid=20180124005017&lan=en-US&anchor=www.Inteserra.com&index=1&md5=cae8803200f7c3577208bca3d1aac4d8", "http://www.businesswire.com/news/home/20180124005017/en/"], "published": "2018-01-24T17:30:00.000+02:00", "crawled": "2018-01-24T19:16:22.000+02:00", "highlightTitle": ""}