{"organizations": [], "uuid": "e9dacacf245aa4ef85271958472c0c01c0d57492", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/business-news-schedule-at-1600-gmt-11-am/reuters-business-news-schedule-at-1600-gmt-11-am-et-idUSL1N1P70WO", "country": "US", "domain_rank": 408, "title": "Reuters Business News Schedule at 1600 GMT/11 AM ET", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T00:03:00.000+02:00", "replies_count": 0, "uuid": "e9dacacf245aa4ef85271958472c0c01c0d57492"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/business-news-schedule-at-1600-gmt-11-am/reuters-business-news-schedule-at-1600-gmt-11-am-et-idUSL1N1P70WO", "ord_in_thread": 0, "title": "Reuters Business News Schedule at 1600 GMT/11 AM ET", "locations": [], "entities": {"persons": [{"name": "steve orlofsky", "sentiment": "negative"}, {"name": "david henry", "sentiment": "none"}, {"name": "sweta singh", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters business news schedule", "sentiment": "negative"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "wells fargo & co", "sentiment": "none"}, {"name": "jpmorgan chase & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Editor: Steve Orlofsky +1 646 223 6200\nGlobal Picture Desk: +65 6870 3775\nGlobal Graphics Desk: + 65 6870 3595\n(All times GMT / ET)\nReceive this schedule by email:\nmediaexpress.reuters.com\nTOP STORIES JPMorgan profit beats on higher interest rates; debt trading down\nJPMorgan Chase & Co beats Wall Street’s fourth-quarter earnings expectations and says tax law changes will help future profits by not only reducing the amount it pays the federal government but also by stimulating business. (JPMORGAN-RESULTS/ (UPDATE 4), moving shortly, by Sweta Singh and David Henry, 670 words)\nWells Fargo adds $3.25 bln to consumer legal bill in 4th qtr\nWells Fargo & Co set aside $3.25 billion in the fourth quarter to cover legal expenses related to probes into its mortgage and sales practices, but its 2018 cost outlook meets analyst expectations as the bank tries to rebound from the scandal in its consumer banking business. (WELLS FARGO-RESULTS/ (UPDATE 3), moved, by Sweta Singh and David Henry, 580 words)\nRents boosted U.S. core CPI; retail sales rose solidly\nWASHINGTON - Underlying U.S. consumer prices increased the most in 11 months in December amid rising costs of rental accommodations and healthcare, bolstering expectations that inflation will accelerate this year. (USA-ECONOMY/ (WRAPUP 2), moving shortly, by Lucia Mutikani, 720 words)\nEXPLAINER-Investors to scour outlooks for U.S. companies’ tax cut plans\nCorporate results for 2017’s final quarter will start pouring in next week and are expected to be laden with one-time charges as U.S. companies begin to cope with tax code changes, including a one-time tax on trillions of dollars in profits held overseas. (USA-RESULTS/OUTLOOK (EXPLAINER, GRAPHIC), moved, 710 words)\nCorporations may dodge billions in U.S. taxes through new loophole -experts\nA loophole in the new U.S. tax law could allow multinational corporations like Apple Inc to avoid paying billions of dollars in taxes on profits stashed overseas, according to experts. (USA-TAX/REPATRIATION (REPEAT), moved, by David Morgan, 650 words)\nMARKETS Euro soars to 3-year high, stocks shatter records\nLONDON - Record high world stocks head for an eighth straight week of gains, while the euro sails to a three-year high as progress on forming a German government added to signs the ECB may accelerate an end to its stimulus. (GLOBAL-MARKETS/ (WRAPUP 7, PIX), updated throughout the day, 810 words)\n+ See also:\n- USA-STOCKS/ (UPDATE 2), updated throughout the day, 420 words)\nOil retreats from $70 highs but set for fourth week of gains\nLONDON - Oil prices ease after hitting a three-year high of more than $70 a barrel the previous day, but the remained on track for a fourth straight week of gains. (GLOBAL-OIL/ (UPDATE 7), updated throughout the day, 400 words)\nANALYSIS Drugmakers see a pricing blueprint in an $850,000 gene therapy\nGlobal drugmakers are looking to a tiny biotech’s $850,000 therapy for a rare type of blindness as a model for getting paid for highly expensive – and effective – new medicines. (HEALTHCARE-CONFERENCE/PRICING (ANALYSIS), moved, by Caroline Humer, 920 words)\nECONOMY China’s trade boom hits speed bump as Dec import growth slows sharply\nBEIJING - China’s export and import growth slowed in December after surging in the previous month, adding to signs of ebbing economic momentum as the government extends a crackdown on financial risks and factory pollution. (CHINA-ECONOMY/TRADE (UPDATE 2, PIX), moved, 740 words)\nJapan’s retailers struggle to raise prices, even as economy gains momentum\nTOKYO - Japan’s economy is gathering steam, profits are at record levels and companies are poised to raise wages — yet retailers and restaurant chains are struggling to lift prices for fear of losing customers conditioned by nearly two decades of deflation. (JAPAN-PRICES/, moved, by Sam Nussey and Stanley White, 790 words)\nCOMPANIES BlackRock hits record $6 trillion, helped by Trump tax law\nNEW YORK - BlackRock Inc charges past a record $6 trillion in assets, its profit beating Wall Street forecasts, as investors flood into the relatively low-cost funds of the world’s largest asset manager. (BLACKROCK-RESULTS/ (UPDATE 4), moved, by Trevor Hunnicutt, 450 words)\nNo pedal to the metal in GM’s planned self-driving Cruise AV car\nGeneral Motors Co is seeking U.S. government approval for a fully autonomous car - one without a steering wheel, brake pedal or accelerator pedal - to enter the automaker’s first commercial ride-sharing fleet in 2019. (GM-SELFDRIVING/ (PIX), moved, by Nick Carey and Paul Lienert, 570 words)\nPuma shares slump as luxury group Kering plans spin-off\nPARIS/BERLIN - Puma shares tumble after French parent Kering says it will spin off the German sportswear group to its shareholders and focus solely on its luxury fashion and jewelry labels. (KERING-PUMA DE/SPIN-OFF (UPDATE 2, PIX), moved, by Sarah White and Emma Thomasson, 620 words)\nFacebook to emphasize friends, not news, in series of changes\nSAN FRANCISCO/LONDON - Facebook Inc begins to change the way it filters posts and videos on its centerpiece News Feed, the start of what Chief Executive Mark Zuckerberg says will be a series of changes in the design of the world’s largest social network. (FACEBOOK-ZUCKERBERG/ (UPDATE 1, PIX), moved, by David Ingram and Paul Sandle, 500 words)\nALSO IN THE NEWS Uproar over crackdown on cryptocurrencies divides South Korea\nSEOUL - With a tech-savvy population quick to adopt the latest gadgets and a young generation facing dim prospects in the conventional workplace, South Korea has been a fertile ground for virtual currencies. (SOUTHKOREA-BITCOIN/ (PIX), moved, by Cynthia Kim and Heekyong Yang, 790 words)\n+ See also:\nCANADA-BITCOIN/CHINA (PIX), moved, by Allison Lampert, Alexandra Harney and Brenda Goh, 830 words\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T00:03:00.000+02:00", "crawled": "2018-01-13T14:51:41.003+02:00", "highlightTitle": ""}