{"organizations": [], "uuid": "48224d84ef45136aaa4f37b831a8576c3c805887", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-synlogic-announces-pricing-of-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Synlogic Announces Pricing of Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:14:00.000+02:00", "replies_count": 0, "uuid": "48224d84ef45136aaa4f37b831a8576c3c805887"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-synlogic-announces-pricing-of-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Synlogic Announces Pricing of Public Offering of Common Stock", "locations": [], "entities": {"persons": [{"name": "synlogic", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "synlogic announces pricing of public offering of common stock", "sentiment": "negative"}, {"name": "leerink partners", "sentiment": "none"}, {"name": "h.c. wainwright & co.", "sentiment": "none"}, {"name": "piper jaffray & co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass.--(BUSINESS WIRE)-- Synlogic (Nasdaq: SYBX) a clinical-stage company applying synthetic biology to probiotics to develop novel living medicines, today announced the pricing of its underwritten public offering of 5,130,000 shares of its common stock at a public offering price of $9.75 per share. The gross proceeds to Synlogic from the offering, before deducting the underwriting discounts and commissions and estimated offering expenses payable by Synlogic, are expected to be $50,017,500. All shares of common stock to be sold in the offering are being sold by Synlogic. In addition, Synlogic has granted to the underwriters a 30-day option to purchase up to 769,500 additional shares of common stock at the public offering price, less underwriting discounts and commissions. The offering is expected to close on or about January 26, 2018, subject to the satisfaction of customary closing conditions.\nLeerink Partners and Piper Jaffray & Co. are acting as joint book-running managers for the offering. H.C. Wainwright & Co. is acting as lead manager for the offering.\nSynlogic intends to use the net proceeds from the offering, together with its existing cash and cash equivalents, as follows: to fund its two planned Phase 1b/2a clinical trials of SYNB1020 (one study involving HE patients and the other study involving UCD patients) through completion; to fund activities in process development, formulation and toxicology as needed for subsequent initiation of a Phase 2b clinical trial in patients with liver cirrhosis with elevated blood ammonia; to fund its planned Phase 1/2a clinical trial of SYNB1618 through completion and to support acceleration of a Phase 2b clinical trial of SYNB1618 for PKU patients and continued process development and formulation activities; to fund further preclinical development in its immuno-oncology programs and drug discovery activities in its other programs; and for working capital and general corporate purposes.\nThe securities described above are being offered by Synlogic pursuant to its shelf registration statement on Form S-3 (File No. 333-220948) filed with the Securities Exchange Commission (the “SEC”) on October 13, 2017 and declared effective by the SEC on October 25, 2017. A preliminary prospectus supplement and accompanying prospectus relating to the offering was filed with the SEC and a final prospectus supplement and the accompanying prospectus relating to this offering will be filed with the SEC. When available, copies of the final prospectus supplement and the accompanying prospectus relating to the offering may be obtained from Leerink Partners LLC, Attention: Syndicate Department, One Federal Street, 37th Floor, Boston, MA 02110, by telephone at (800) 808-7525 ext. 6132 or by email at syndicate@leerink.com ; or from Piper Jaffray & Co., 800 Nicollet Mall, J12S03, Minneapolis, MN 55402, Attention: Prospectus Department, by telephone at (800) 747-3924, or by email at prospectus@pjc.com . The preliminary prospectus supplement and accompanying prospectus is also available, and the final prospectus supplement and accompanying prospectus will be available, on the SEC’s website at http://www.sec.gov .\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities, in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or other jurisdiction. Any offer, if at all, will be made only by means of the prospectus supplement and accompanying prospectus forming a part of the effective registration statement.\nAbout Synlogic\nSynlogic is pioneering the development of a novel class of living medicines, Synthetic Biotic medicines, based on its proprietary drug development platform. Synlogic’s initial pipeline includes Synthetic Biotic medicines for the treatment of rare genetic diseases, such as urea cycle disorders (UCD) and phenylketonuria (PKU). In addition, the company is leveraging the broad potential of its platform to create Synthetic Biotic medicines for the treatment of more common diseases, including liver disease, inflammatory and immune disorders, and cancer. Synlogic is collaborating with AbbVie to develop Synthetic Biotic-based treatments for inflammatory bowel disease (IBD).\nForward-Looking Statements\nThis release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding Synlogic’s ability to complete the offering and its expected and intended use of proceeds from the offering. These forward-looking statements speak only as of the date of this press release and are subject to a number of risks, uncertainties and assumptions, including the risks and uncertainties associated with market conditions and the satisfaction of customary closing conditions related to the proposed public offering, as well as risks and uncertainties inherent in Synlogic’s business, including those described in the company’s periodic filings with the SEC. The events and circumstances reflected in the company’s forward-looking statements may not be achieved or occur and actual results could differ materially from those projected in the forward-looking statements. Additional information on risks facing Synlogic can be found under the heading “Risk Factors” in Synlogic’s periodic reports, including its quarterly report on Form 10-Q for the quarter ended September 30, 2017, and in the preliminary prospectus supplement related to the proposed offering to be filed with the SEC on or about the date hereof, each available on the SEC’s web site at www.sec.gov . Except as required by applicable law, the company does not plan to publicly update or revise any forward-looking statements contained herein, whether as a result of any new information, future events, changed circumstances or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005422/en/\nSynlogic\nMedia:\nCourtney Heath, 617-872-2462\ncourtney@scientpr.com\nor\nInvestors:\nElizabeth Wolffe, Ph.D., 617-207-5509\nliz@synlogictx.com\nSource: Synlogic", "external_links": ["http://www.businesswire.com/news/home/20180124005422/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.synlogictx.com&esheet=51747978&newsitemid=20180124005422&lan=en-US&anchor=Synlogic+%28Nasdaq%3A+SYBX%29&index=1&md5=058281fd6eacc4a79ea5380e9a812507", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51747978&newsitemid=20180124005422&lan=en-US&anchor=www.sec.gov&index=3&md5=39eef500958e69a4651a5846198db634", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51747978&newsitemid=20180124005422&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=2&md5=01f793473addc2bb406933cac0f6f973"], "published": "2018-01-24T16:14:00.000+02:00", "crawled": "2018-01-24T19:12:35.012+02:00", "highlightTitle": ""}