{"organizations": [], "uuid": "38c1cdded743c27297b6fc8d680f0db7a9a02ee1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 24, "shares": 24, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225150126&w=1200&r=LYNXMPEE0O0ZQ", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-skat-us/u-s-looks-to-banish-sochi-scars-in-pyeongchang-idUSKBN1FE1SJ", "country": "US", "domain_rank": 408, "title": "U.S. looks to banish Sochi scars in Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:14:00.000+02:00", "replies_count": 0, "uuid": "38c1cdded743c27297b6fc8d680f0db7a9a02ee1"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-skat-us/u-s-looks-to-banish-sochi-scars-in-pyeongchang-idUSKBN1FE1SJ", "ord_in_thread": 0, "title": "U.S. looks to banish Sochi scars in Pyeongchang", "locations": [], "entities": {"persons": [{"name": "simon jennings", "sentiment": "negative"}, {"name": "joey cheek", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "turin", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 1:15 PM / in 7 hours U.S. looks to banish Sochi scars in Pyeongchang Simon Jennings 3 Min Read \n(Reuters) - The U.S. speed skaters heading to next month’s Pyeongchang Winter Olympics must come to terms with the team’s failure at Sochi four years ago if they are to have any hope of success, former Olympic champion Joey Cheek said. \nThe U.S. team returned home with only one silver in the men’s short track relay at Sochi after a series of problems coalesced to create a perfect storm. \n”It was a heck of a shock,“ Cheek, who won gold in the 500m at the 2006 Games in Turin, told Reuters. ”It’s the biggest cloud that hangs over the team. \n“They had all these indicators that they would have been considerably more successful and then they had this massive underperformance.” \nThe scars from Sochi have not fully faded and despite a number of lessons being learned in the interim, the U.S. team heads to Korea aware of how suddenly things can go wrong, he said. \n“Sometimes sport just goes kind of south and you don’t know exactly what happened, but it feels to me as if that specter is woven in to the fabric of what people are thinking about,” Cheek added. \n“Everyone around U.S. Speed Skating has been pretty gun shy going into this Olympics because they know they’re capable of a lot better performance but everyone’s a little nervous about making predictions.” RUPTURED PIPELINE \nThe U.S. will send 13 long-track skaters to South Korea, a smaller contingent than at the Sochi Games and an indication the talent pool may be shrinking. FILE PHOTO: Shani Davis of the U.S. looks at his time after competing in the men's 1,000 meters speed skating race during the 2014 Sochi Winter Olympics, Russia February 12, 2014. REUTERS/Phil Noble/File Photo \nCheek said the decline is partly because the introduction of the mass start resulted in the number of Olympic berths in other events being cut, but is also due to a fall in the popularity of inline skating. \n“If you look at the origins of speed skaters, the vast majority of the team and medalists have come from the inline skating world,” said Cheek, himself a former inline skater. \n”Speed skating in America is a little bit of a trailing indicator for inline skating in America. \n”Now that the U.S. has been considerably weaker in the inline world championship level for about probably a decade there’s just not the same number of people coming from that sport. \n“Figuring out how to rebuild that pipeline is the biggest challenge U.S. Speed Skating has, and the country hasn’t figured it out yet.” \nSochi may have cast a shadow over the upcoming Games for the U.S., but Cheek is hoping the team anchored by veteran Shani Davis could come home with four medals with Heather Bergsma and Joey Mantia the best chances in the long-track events. \nThe key, however, will be shaking off their negative feelings from four years ago. \n“I think (Sochi) really guided the approach for mental training, physiology and technology,” he said. \n”Sometimes people can get power from that because they think, ‘I‘m never going to let this happen again’ and they double down, and sometimes it can be demoralizing because your confidence is shaken. \n“It still permeates the atmosphere, but I don’t know if that’s an indicator of whether it will be a positive or negative force.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-25T15:14:00.000+02:00", "crawled": "2018-01-25T15:26:58.022+02:00", "highlightTitle": ""}