{"organizations": [], "uuid": "2737d6e9f817b7b6b4e4fb718f9539a69907c8d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-first-trust-energy-income-and-growth-fund-declares-its-quarterly-distribution-of-0-point-58-per-share.html", "country": "US", "domain_rank": 767, "title": "First Trust Energy Income and Growth Fund Declares its Quarterly Distribution of $0.58 Per Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:17:00.000+02:00", "replies_count": 0, "uuid": "2737d6e9f817b7b6b4e4fb718f9539a69907c8d7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-first-trust-energy-income-and-growth-fund-declares-its-quarterly-distribution-of-0-point-58-per-share.html", "ord_in_thread": 0, "title": "First Trust Energy Income and Growth Fund Declares its Quarterly Distribution of $0.58 Per Share", "locations": [], "entities": {"persons": [{"name": "fu", "sentiment": "none"}], "locations": [{"name": "wheaton", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "first trust energy income", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHEATON, Ill.--(BUSINESS WIRE)-- First Trust Energy Income and Growth Fund (the \"Fund\") (NYSE American: FEN) has declared the Fund's regularly scheduled quarterly distribution of $0.58 per share. The distribution will be payable on January 31, 2018, to shareholders of record as of January 23, 2018. The ex-dividend date is expected to be January 22, 2018. The quarterly distribution information for the Fund appears below.\nFirst Trust Energy Income and Growth Fund (FEN):\nDistribution per share: $0.58 Distribution Rate based on the January 9, 2018 NAV of $26.27: 8.83% Distribution Rate based on the January 9, 2018 closing market price of $26.84: 8.64% It is anticipated that, due to the tax treatment of cash distributions made by the publicly-traded master limited partnerships (\"MLPs\") in which the Fund invests, a portion of distributions the Fund makes to Common Shareholders may consist of a tax-deferred return of capital. The final determination of the source and tax status of all distributions paid in 2018 will be made after the end of 2018 and will be provided on Form 1099-DIV.\nThe Fund is a non-diversified, closed-end management investment company that seeks a high level of after-tax total return with an emphasis on current distributions paid to shareholders. The Fund focuses on investing in MLPs and related public entities in the energy sector which the Fund's investment sub-advisor believes offer opportunities for income and growth. The Fund is treated as a regular corporation, or a \"C\" corporation, for United States federal income tax purposes and, as a result, is subject to corporate income tax to the extent the Fund recognizes taxable income.\nFirst Trust Advisors L.P., the Fund's investment advisor, along with its affiliate, First Trust Portfolios L.P., are privately-held companies which provide a variety of investment services, including asset management and financial advisory services, with collective assets under management or supervision of approximately $118 billion as of December 31, 2017 through unit investment trusts, exchange-traded funds, closed-end funds, mutual funds and separate managed accounts.\nEnergy Income Partners, LLC (\"EIP\") serves as the Fund's investment sub-advisor and provides advisory services to a number of investment companies and partnerships for the purpose of investing in MLPs and other energy infrastructure securities. EIP is one of the early investment advisors specializing in this area. As of December 31, 2017, EIP managed or supervised approximately $6.4 billion in client assets.\nPast performance is no assurance of future results. Investment return and market value of an investment in the Fund will fluctuate. Shares, when sold, may be worth more or less than their original cost.\nPrincipal Risk Factors: The Fund is subject to risks, including the fact that it is a non-diversified closed-end management investment company.\nBecause the Fund is concentrated in securities issued by energy companies, energy sector MLPs and MLP-related entities, it will be more susceptible to adverse economic or regulatory occurrences affecting those industries, including high interest costs, high leverage costs, the effects of economic slowdown, surplus capacity, increased competition, uncertainties concerning the availability of fuel at reasonable prices, the effects of energy conservation policies and other factors.\nThe Fund's use of derivatives may result in losses greater than if they had not been used, may require the fund to sell or purchase portfolio securities at inopportune times, may limit the amount of appreciation the Fund can realize on an investment, or may cause the fund to hold a security that it might otherwise sell.\nInvestment in non-U.S. securities is subject to the risk of currency fluctuations and to economic and political risks associated with such foreign countries.\nUse of leverage can result in additional risk and cost, and can magnify the effect of any losses.\nThe risks of investing in the fund are spelled out in the prospectus, shareholder report and other regulatory filings.\nThe information presented is not intended to constitute an investment recommendation for, or advice to, any specific person. By providing this information, First Trust is not undertaking to give advice in any fiduciary capacity within the meaning of ERISA and the Internal Revenue Code. First Trust has no knowledge of and has not been provided any information regarding any investor. Financial advisors must determine whether particular investments are appropriate for their clients. First Trust believes the financial advisor is a fiduciary, is capable of evaluating investment risks independently and is responsible for exercising independent judgment with respect to its retirement plan clients.\nThe Fund’s daily closing NYSE MKT price and net asset value per share as well as other information can be found at www.ftportfolios.com or by calling 1-800-988-5891.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110006246/en/\nFirst Trust Energy Income and Growth Fund\nPress Inquiries: Jane Doyle, 630-765-8775\nAnalyst Inquiries: Jeff Margolin, 630-915-6784\nBroker Inquiries: Jeff Margolin, 630-915-6784\nSource: First Trust Energy Income and Growth Fund", "external_links": ["http://www.businesswire.com/news/home/20180110006246/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ftportfolios.com&esheet=51741571&newsitemid=20180110006246&lan=en-US&anchor=www.ftportfolios.com&index=1&md5=b64cb0b9fb2a57e179e8283f3c2488e9"], "published": "2018-01-11T00:17:00.000+02:00", "crawled": "2018-01-11T01:31:25.009+02:00", "highlightTitle": ""}