{"organizations": [], "uuid": "69f309addb8bc53cf099003684dec80420e86da5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-lifesci-advisors-continues-expansion-of-u-s-investor-relations-team-with-appointment-of-industry-veteran-monique-kosse.html", "country": "US", "domain_rank": 767, "title": "LifeSci Advisors Continues Expansion of U.S. Investor Relations Team with Appointment of Industry Veteran Monique Kosse", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-18T16:30:00.000+02:00", "replies_count": 0, "uuid": "69f309addb8bc53cf099003684dec80420e86da5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-lifesci-advisors-continues-expansion-of-u-s-investor-relations-team-with-appointment-of-industry-veteran-monique-kosse.html", "ord_in_thread": 0, "title": "LifeSci Advisors Continues Expansion of U.S. Investor Relations Team with Appointment of Industry Veteran Monique Kosse", "locations": [], "entities": {"persons": [{"name": "monique kosse", "sentiment": "neutral"}, {"name": "kosse", "sentiment": "none"}, {"name": "monique", "sentiment": "none"}, {"name": "lifesci", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "lifesci advisors continues expansion of u.s. investor relations team", "sentiment": "neutral"}, {"name": "access capital advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, LifeSci Advisors , LLC (the \"Company\" or \"LifeSci\"), the leading international investor relations and corporate communications firm dedicated to the life sciences sector, today announced the appointment of Monique Kosse as Managing Director. Ms. Kosse will contribute to managing new and existing client relationships in the pharmaceutical, biotech, and medtech industries.\nMonique brings to LifeSci nearly 20 years of Wall Street experience. Her expertise includes roles as both a senior institutional investment analyst and as a trusted investor relations advisor. Before joining LifeSci, Monique was a founding partner at Access Capital Advisors, where she partnered with senior management teams to develop tailored IR strategies designed to best convey each client’s value proposition to Wall Street. She and her partner thoughtfully crafted messaging, developed positioning, and targeted key investors. Prior to her career in investor relations, Monique spent 15 years investing in small-cap healthcare companies as a fundamental research analyst. Her experience encompasses both large multi-national firms like Deutsche Asset Management and Fiduciary Trust, and small boutique firms like Rochdale Investment Management and Palisade Capital Management. At each firm, Monique provided in-depth fundamental research and analysis supporting her investment recommendations. She was an active member on each firm’s investment committee responsible for firm-wide sector allocation decisions. Monique has her MBA in Finance from New York University Stern School of Business, and dual degrees in Chemistry and German from St. Olaf College. She also holds her Series 7 and Series 66 licenses.\n\"We are proud to have Monique on our growing team,” said Andrew McDonald, CEO and founding partner of LifeSci Advisors. “We look forward to leveraging Monique’s expertise in investor messaging and positioning, coupled with her network of investor contacts as we continue to provide counsel and support for our client companies.”\n“I am thrilled to join the LifeSci team,” said Ms. Kosse. “LifeSci has an incredible platform and a fantastic group of dedicated, seasoned veterans focused on client service. I look forward to adding to the collective experience and leveraging our knowledge to communicate each client’s investment thesis to Wall Street.\"\nLifeSci has offices in Israel, UK and Switzerland, as well as multiple North American locations. The firm’s capabilities include Corporate Access, Equity Research, Corporate Communications, KOL Events, Corporate Governance, Capital Markets Solutions, and Public Relations.\nLifeSci Advisors, LLC ( www.lifesciadvisors.com ) is the largest investor relations consultancy in the life sciences industry, founded to provide companies with a multi-faceted approach to investor communications and outreach. With a global focus and reach, the firm provides the highest quality service for its clients through its deep sector specialization. LifeSci’s team of MDs and PhDs enables the firm to better understand clients' R&D, regulatory and commercial strategies, and its team of financial services, investor relations and public relations specialists helps clients effectively communicate to the marketplace. This combination of life sciences, financial services, and investor relations competencies allows LifeSci Advisors to provide an invaluable and unique service offering to clients.\nLifeSci Partners ( www.lifescipartners.com ) is the leading provider of consulting services in the areas of investor relations, public relations, corporate communications and capital markets advisory. Combining deep domain expertise in the life sciences with decades of experience in capital markets and public relations, LifeSci Partners delivers unparalleled services to life sciences companies globally.\nFor further information, please contact:\nAndrew McDonald\nCEO, Founding Partner\nLifeSci Advisors, LLC\n(646) 597-6987\nSource:LifeSci Advisors, LLC", "external_links": ["https://www.globenewswire.com/Tracker?data=91Wy1WmTMgsJaZN8tEE0_IOMGRquR7z93MSsWCFzW2TgfRCSqKJI0Zxb7qdcIk35q0BR-lLer5fNzVMQFXjUYdRG2WP9cjDzHDLVSlkQnuOdO9BF8_4N0L4MqPXdgyBIwc6ikM6ixEQluvf8tkPxdRbPfyR7cUj_xz57xNNmX4P6qa6UJLJ58dH9N6bUCNNZjSeo6G8ev0IZxvRZ9PMR9FNLbJHHqPZXZwieEq0QBb4YzQfryJPRWXYYfhjtD_VbJLzed3mQ4kpJhpAf0FR9LfUADlz4GBZV4dEre0oXuFsnbnUhVb5i6yqc82Utzij59qO8LDPvr8MkNFM6yvfBlJDYkS-4B0YRct6B5R0W-FI3AeHBHHyqCYcnkIgXQkb4SRRXFejC1ISKXJDN6LgIM4EJCAUJWBLDmVoVd9DxjunXIhSTG6I2aSMzAfENQrk9yCVsqqOZn_CmsFzFoMJBXmfCZc6KRGyop8nKSbJ", "https://www.globenewswire.com/Tracker?data=NziBlRRgxgmnEtMvzvq5AghmrquMRzlmP_r2-cd-f8mPXeUrcn-jZ7clqphKdVQn14xAeITqcVf5h2sJOeBiJUWWHNTk5Zq-gCCwm3ZiNFY=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f4da04a9-f14e-4e4b-9c51-898ccf8b26dc", "https://www.globenewswire.com/Tracker?data=91Wy1WmTMgsJaZN8tEE0_PuBAACVbCxf06Ryg1cJWHPbOgLyZWt4vPcT_A0JPq7uXFuWv5qU5xZQT_R5x50oEwGLNeqtOUg1KToeUQUJB0CtKP__GxsScSLnsSY-5Ft8c2N-u4geLwVgZoJsmPpgqYpeQCvtBwPVsBbY4W-_A87_tOl1xwGnCiPhYuCVlNHCl_uUMbX_N56MWW-X9aKMIxhyaqliGqJZIU41ErPBok4kZdhX29q9S_NwcvFt6chStaiiBdTwzzwQjY_3lD1CaOPwswIWa7AY14vMdwJxHDHReZ-qCceChq1b3ZYulInwR_oneCTXqXKowdXmQowoa1EYFepITWTXZ-SOHG5Rbng6ZE9PPUE08IB1jskidNrPy6m8o7mrW01yE-mnYUrjP_OAImMxdxYyKNx4RLq92SRldUo_iHkoSAO4L1UNqySIQcwI0GGG4GicW3cbuopRI7H8wlMxdiTlh9-j_Fs"], "published": "2018-01-18T16:30:00.000+02:00", "crawled": "2018-01-18T16:22:29.017+02:00", "highlightTitle": ""}