{"organizations": [], "uuid": "c8b2fba2d9aad60b79b1c2928b6131c39a91d60c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223045630&w=1200&r=LYNXMPEE0H167", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-stk-hdd-lambert/stoke-boss-lambert-eager-to-exploit-huddersfield-knowledge-idUKKBN1F71YD", "country": "US", "domain_rank": 408, "title": "Stoke boss Lambert eager to exploit Huddersfield knowledge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:23:00.000+02:00", "replies_count": 0, "uuid": "c8b2fba2d9aad60b79b1c2928b6131c39a91d60c"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-stk-hdd-lambert/stoke-boss-lambert-eager-to-exploit-huddersfield-knowledge-idUKKBN1F71YD", "ord_in_thread": 0, "title": "Stoke boss Lambert eager to exploit Huddersfield knowledge", "locations": [], "entities": {"persons": [{"name": "lambert", "sentiment": "negative"}, {"name": "mark hughes", "sentiment": "none"}, {"name": "david wagner", "sentiment": "none"}, {"name": "paul lambert", "sentiment": "none"}], "locations": [{"name": "new stoke city", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "huddersfield", "sentiment": "negative"}, {"name": "wolverhampton wanderers", "sentiment": "none"}, {"name": "blackburn rovers", "sentiment": "none"}, {"name": "huddersfield town", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 2:25 PM / Updated 3 hours ago Stoke boss Lambert eager to exploit Huddersfield knowledge Reuters Staff 3 Min Read \n(Reuters) - New Stoke City manager Paul Lambert is keen to use his previous experience against Huddersfield Town to help drive the relegation-threatened club to victory in Saturday’s home Premier League match. \nLambert, named as Mark Hughes’ replacement on Monday, faced Huddersfield in the Championship (second tier) while managing former clubs Wolverhampton Wanderers and Blackburn Rovers. \nStoke are winless in their last four league matches and Lambert is keen to end that streak in his first game in charge of the Potters. \n“I will have nerves as normal on Saturday but as soon as the whistle blows they will disappear,” Lambert told a news conference on Thursday. \n”I managed against Huddersfield Town last season and David Wagner has assembled a good team. We know it will be a tough game but will be going out to win, just like in every match. \n“We need to get back to basics in the next two days and hopefully pick up three points on Saturday. That what everyone wants - a win at the weekend.” \nStoke are 18th in the table, a point adrift of safety, with five wins in 23 league games while 14th-placed Huddersfield are coming off two consecutive defeats in their first season in the Premier League. \nGreece international defender Kostas Stafylidis has joined Stoke on loan from German side Augsburg until the end of the season. \n“Having played in Germany himself, Paul Lambert is a keen observer of the Bundesliga and I know he has been impressed by what he has seen of Kostas in action for Augsburg,” Stoke chief executive Tony Scholes told the club’s website. (www.stokecityfc.com) \nWhen asked about the move earlier on Thursday, Lambert said he was eager for the 24-year-old to join but was cautious of handing the left-back his first start against Huddersfield. \n“I think he’s a really good left back. He’s got lots of energy, which I think we need, and fresh competition in the team, which I think is really important,” Lambert told reporters. \n“I will have to see how fit he is and how he feels. I think his last game was against Bayern, but I will have to see him.” Reporting by Aditi Prakash in Bengaluru; Editing by Keith Weir", "external_links": [], "published": "2018-01-18T16:23:00.000+02:00", "crawled": "2018-01-18T17:14:17.002+02:00", "highlightTitle": ""}