{"organizations": [], "uuid": "5014fa02f130d4ad0b58559b1c30e83db402c6b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-shares-extend-bull-run-dollar-huddles-near-lows-idUSL4N1PO1OP", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Asia shares extend bull run, dollar huddles near lows", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T07:16:00.000+02:00", "replies_count": 0, "uuid": "5014fa02f130d4ad0b58559b1c30e83db402c6b2"}, "author": "", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-shares-extend-bull-run-dollar-huddles-near-lows-idUSL4N1PO1OP", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asia shares extend bull run, dollar huddles near lows", "locations": [], "entities": {"persons": [{"name": "wayne cole", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "msci", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Asia shares ex-Japan aiming for 12th session of gains\n* Nikkei restrained by firm yen, South Korea at record\n* Dollar inch off lows, Trump complains of “unfair” trade\n* US 10-yr yields break to 2.69 pct, highest since mid-2014\nBy Wayne Cole\nSYDNEY, Jan 29 (Reuters) - Asian shares extended their bull run on Monday amid upbeat corporate earnings and strong global economic growth, while the dollar struggled to bounce as the White House continued to complain of “unfair” trade practices by competitors.\nMSCI’s broadest index of Asia-Pacific shares outside Japan added 0.26 percent, aiming for a 12th straight session of gains. It is up 8 percent for the year so far.\nJapan’s Nikkei rose 0.1 percent as the yen eased a little, while South Korea notched a record.\nHong Kong’s Hang Seng has been the best performer for the year so far with a rise of almost 11 percent, while Shanghai blue chips ran into profit-taking on Monday.\nSpread betters tipped opening gains for the major European bourses, while E-Minis for the S&P 500 were steady.\nWall Street has likewise been on a tear. Just last week, the Dow rose 2.08 percent, the S&P 500 2.22 percent and the Nasdaq 2.31 percent.\nQuarterly earnings growth for the S&P 500 is estimated at 13.2 percent, according to Thomson Reuters data, up from 12 percent at the start of the year. Almost 80 percent of the 133 companies in the index that have reported beat forecasts.\nAnother 36 percent of the S&P 500 is due to report this week including heavy hitters Apple, Alphabet, Facebook, Microsoft and Amazon.\nThe rush to equities combined with the risk of faster global inflation, has been a major negative for sovereign bonds with yields rising across much of the developed world.\nYields on U.S. two-year Treasuries have risen steadily to their highest since 2008 and are fully priced for a rate hike by the Federal Reserve in March.\nTen-year yields broke above the range of the last week or so to reach 2.69 percent on Monday, levels last visited in mid-2014.\nThe Fed holds its next meeting on Wednesday, the last for Chair Janet Yellen, and analysts suspect the statement will only cement expectations for a March move.\nWORDS MATTER The inexorable increase in Treasury yields has not, however, been enough to rescue the U.S. dollar which sank to three-year lows last week as U.S. officials welcomed a weaker currency.\nPresident Donald Trump did try and walk some of that back late in the week but by then the damage had been done.\nIndeed, in an interview shown on Sunday, Trump threatened to confront the European Union over what he calls “very unfair” trade policy toward the U.S..\n“‘Words’ in the world of FX do matter,” said Deutsche Bank Strategist George Saravelos. “The U.S. is reengaging with a weak dollar policy similarly to the 1994-95 period.”\nThis was happening while the sum of trade and investment flows into the United States was shrinking. The opposite was happening in the euro zone, where the German export engine was powering an ever-expanding current account surplus.\n“We continue to target $1.30 in EUR/USD for this year,” Saravelos concluded.\nThe euro did run into a little profit-taking in Asia on Monday which nudged it to back to $1.2412 and away from a three-year peak of $1.2538 last week.\nThe dollar was a fraction firmer on the yen at 108.73 , but not far from a four-month trough of 108.28.\nAgainst a basket of major currencies, it edged up 0.1 percent to 89.145 having been at the lowest since late 2014.\nThe dollar faces a bevy of U.S. economic reports this week including indicators of inflation, manufacturing and payrolls.\nThe currency’s decline has been a boon for many commodities, with gold making a 17-month top last week and last trading at $1,348.10 an ounce.\nOil prices had reached their highest in three years and Brent crude futures were holding atop $70 at $70.46 a barrel. U.S. crude futures were up 23 cents at $66.37.\nReporting by Wayne Cole; Editing by Eric Meijer\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-29T07:16:00.000+02:00", "crawled": "2018-01-29T07:43:57.003+02:00", "highlightTitle": ""}