{"organizations": [], "uuid": "6152bdbd7cf857984f1a8cdcf9e8d23cc5ee39e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/griffithstill.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/29/tricia-griffith-progressive/", "country": "US", "domain_rank": 1196, "title": "Progressive CEO Tricia Griffith: Customer Service Is Key | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.798, "site_type": "news", "published": "2018-01-29T14:11:00.000+02:00", "replies_count": 0, "uuid": "6152bdbd7cf857984f1a8cdcf9e8d23cc5ee39e1"}, "author": "Susie Gharib", "url": "http://fortune.com/2018/01/29/tricia-griffith-progressive/", "ord_in_thread": 0, "title": "Progressive CEO Tricia Griffith: Customer Service Is Key | Fortune", "locations": [], "entities": {"persons": [{"name": "susie gharib", "sentiment": "negative"}, {"name": "tricia griffith", "sentiment": "negative"}, {"name": "griffith", "sentiment": "none"}], "locations": [], "organizations": [{"name": "customer service", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Susie Gharib 12:11 PM EST \nTricia Griffith is one of 50 women Fortune has identified as the Most Powerful Women in Business . She is the CEO of Progressive (pgr) , one of the nation’s largest auto insurers. She is also one of only 32 female CEOs running Fortune 500 companies. \nHow did she get to the top of this 33,000 employee company with $23 billion in revenues? In 1988, just after graduating from college, she responded to an ad in the newspaper for a claims representative trainee. Nearly 30 years later she was tapped to be chief executive. \n“I think that first job when I was a claims rep trainee of crawling under cars, doing estimates in body shops, really made me realize how important service is, customer service,” Griffith said. “We don’t have a tangible product. So our product is promising that when you need us, when you’re in an accident, we’re going to take care of you.” \nGriffith is also the mother of six children. She says that women always turn to her for advice on how they can have successful careers while also raising a family. “I treated family life like a business,” she said, adding, “Not from the emotional part, obviously, but in terms of having backup plans. Just like business, always be thinking about something unforeseen around the corner.” \nShe is now focused on new business goals at Progressive. She is expanding beyond auto insurance and moving into the home insurance market. She said she has a “huge sense of urgency.” \n“I definitely want to win. And I want to win in the right way,” said Griffith. \nWatch the video above to hear more of our conversation with Griffith. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-29T14:11:00.000+02:00", "crawled": "2018-01-29T20:20:18.002+02:00", "highlightTitle": ""}