{"organizations": [], "uuid": "c1a5ed3746709af81a5cf900f2948d4837c2f7c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-amarin-prices-public-offering-of-american-depositary-shares.html", "country": "US", "domain_rank": 767, "title": "Amarin Prices Public Offering of American Depositary Shares", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-30T16:58:00.000+02:00", "replies_count": 0, "uuid": "c1a5ed3746709af81a5cf900f2948d4837c2f7c8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-amarin-prices-public-offering-of-american-depositary-shares.html", "ord_in_thread": 0, "title": "Amarin Prices Public Offering of American Depositary Shares", "locations": [], "entities": {"persons": [{"name": "amarin", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "bedminster", "sentiment": "none"}], "organizations": [{"name": "nasd", "sentiment": "negative"}, {"name": "amarin corporation plc", "sentiment": "negative"}, {"name": "amarin prices public offering of american depositary shares", "sentiment": "negative"}, {"name": "cantor fitzgerald & co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEDMINSTER, N.J. and DUBLIN, Ireland, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Amarin Corporation plc (NASDAQ:AMRN) today announced the pricing of the underwritten public offering of its American Depositary Shares (\"ADSs\") for gross proceeds of approximately $70.0 million, before deducting the underwriting discounts and commissions and other estimated offering expenses payable by Amarin. The offering is expected to close on or about February 1, 2018, subject to customary closing conditions. In addition, Amarin has granted the underwriter a 30-day option to purchase approximately $10.5 million of additional ADSs.\nCantor Fitzgerald & Co. is the sole book-running manager for the offering. The underwriter may offer the ADSs from time to time for sale in one or more transactions on The NASDAQ Global Market, in the over-the-counter market, through negotiated transactions or otherwise at market prices prevailing at the time of sale, at prices related to prevailing market prices or at negotiated prices. On January 29, 2018, the last sale price of the ADSs on The NASDAQ Global Market was $4.01 per share.\nThe gross proceeds from the offering are expected to be approximately $70.0 million before deducting customary underwriting discounts and commissions and offering expenses. Amarin intends to use the net proceeds from the offering to expand medical education and market awareness initiatives, including, in advance of REDUCE-IT results being known, pilot testing of new promotional initiatives for potential broader application following REDUCE-IT results, to increase its inventory balances for incremental inventory build prior to REDUCE-IT results and for general corporate and working capital purposes.\nThe securities described above are being offered by Amarin pursuant to a shelf registration statement on Form S-3ASR (No. 333-216385) previously filed with the Securities and Exchange Commission (the \"SEC\") on March 1, 2017 and automatically became effective upon filing. The securities may be offered only by means of a written prospectus, including a prospectus supplement, forming a part of the effective registration statement. A preliminary prospectus supplement and accompanying prospectus relating to the offering have been filed with the SEC and are available on the SEC’s website at www.sec.gov . A final prospectus supplement and accompanying prospectus will be filed with the SEC. When available, copies of the final prospectus supplement and the accompanying prospectus may also be obtained by contacting Cantor Fitzgerald & Co., Attention: Capital Markets, 499 Park Ave., 6th Floor, New York, New York 10022, or by email at prospectus@cantor.com .\nThis news release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction.\nAbout Amarin\nAmarin Corporation plc is a biopharmaceutical company focused on the commercialization and development of therapeutics to improve cardiovascular health. Vascepa ® (icosapent ethyl) capsules, Amarin's first FDA approved product, are a highly-pure, omega-3 fatty acid product available by prescription.\nDisclosure Notice\nThis press release contains forward-looking statements, within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Statements that are not historical facts, including statements related to Amarin's public offering of American Depositary Shares, are forward-looking statements that involve risks and uncertainties. Words such as \"intends,\" \"plans,\" \"expects,\" \"may,\" \"will\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements are not promises or guarantees. These forward-looking statements are based upon Amarin's current expectations. Actual events and results and the timing of events and results could differ materially from those anticipated in such forward-looking statements. Among the factors that could cause actual results to differ materially from those described or projected herein are the following: risks related to the underwriter’s consummation of their obligation to purchase the securities, whether Amarin will be able to satisfy its obligations to close the offering and the risk that Amarin will not use the proceeds from the offering in the manner contemplated, as well as the risks, uncertainties and other matters detailed in Amarin's filings with the U.S. Securities and Exchange Commission, including its most recent Annual Report on Form 10-K, its most recent Quarterly Report on Form 10-Q and the preliminary prospectus supplement relating to the offering and filed on January 29, 2018. Existing and prospective investors are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date they were made. Amarin undertakes no obligation to update or revise the information contained in this press release, whether as a result of new information, future events or circumstances or otherwise, except as required by law.\nAmarin contact information:\nInvestor Relations:\nElisabeth Schwartz\nInvestor Relations and Corporate Communications\nAmarin Corporation plc\nIn U.S.: +1 (908) 719-1315\ninvestor.relations@amarincorp.com\nLee M. Stern\nTrout Group\nIn U.S.: +1 (646) 378-2992\nlstern@troutgroup.com\nMedia Inquiries:\nKristie Kuhl\nFinn Partners\nIn U.S.: +1 (212) 583-2791\nKristie.kuhl@finnpartners.com\nSource:Amarin Corporation plc", "external_links": ["https://www.globenewswire.com/Tracker?data=A3m859qFOWL_2ukR5g5cHqqnrQRzvplAmwDIwq2FFMBgKrpeb1OrCAzV3kSHFx9RXTjcSab-BA5x5UtU1da7tmTicqE17P1RKg9XcoN1Ay2h8FI82pvmd2dzINWzmNAn", "https://www.globenewswire.com/NewsRoom/AttachmentNg/4e9ba297-8a1c-40bf-a8e8-4e7147b9d5de", "https://www.globenewswire.com/Tracker?data=dq0yATdf3dpUI93kjPF5s4TWQAFlkRoR8Eozu2_zPCV7tqU__TxPEJEuPfCfBExhx-R4DS78mHcz4c2GH0zgC3fxiuYJaMPxtRTmPfzO6DU=", "https://www.globenewswire.com/Tracker?data=z-cZllf7G5FusrrLWsZfrupolBNRbcE9aCOkLvBVlHbpHJuCK9jHkRS__qsgyPEtmQee-d6gLnGp13Mugj684PNIfPA0ZuIp_yKjP9eTDjlgJeNjnaWXQ1UaDU7QRLbuf7Vwdis8KQ75d4d01IGgJA=="], "published": "2018-01-30T16:58:00.000+02:00", "crawled": "2018-01-30T18:30:33.001+02:00", "highlightTitle": ""}