{"organizations": [], "uuid": "13288af8bed4d5432994c0f7a2b4309fd2bed4fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-nors-biathlon/biathlon-aiming-to-woo-more-fans-in-pyeongchang-idUKKBN1EW0HK", "country": "US", "domain_rank": 408, "title": "Biathlon aiming to woo more fans in Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T15:48:00.000+02:00", "replies_count": 0, "uuid": "13288af8bed4d5432994c0f7a2b4309fd2bed4fd"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-nors-biathlon/biathlon-aiming-to-woo-more-fans-in-pyeongchang-idUKKBN1EW0HK", "ord_in_thread": 0, "title": "Biathlon aiming to woo more fans in Pyeongchang", "locations": [], "entities": {"persons": [{"name": "o'connor", "sentiment": "none"}, {"name": "lowell bailey", "sentiment": "none"}, {"name": "laura dahlmeier", "sentiment": "none"}], "locations": [{"name": "pyeongchang", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "hochfilzen", "sentiment": "none"}], "organizations": [{"name": "biathlon", "sentiment": "negative"}, {"name": "min read  stockholm", "sentiment": "none"}, {"name": "european broadcasting union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 1:52 PM / Updated 12 minutes ago Biathlon aiming to woo more fans in Pyeongchang Philip O'Connor 4 Min Read \nSTOCKHOLM (Reuters) - With a record number of viewers having watched some thrilling action the 2017 World Championships, the sport of biathlon is in rude health and aiming to win even more fans during the Winter Olympics in Pyeongchang. \nStatistics released by the European Broadcasting Union following the 2017 championships in Hochfilzen, Austria, showed a 50 percent increase in the number of viewers compared to the 2013 event. \nIn total, 140,000 spectators turned out to watch 315 athletes from 37 different countries compete and they were treated to some thrilling finishes, such as American Lowell Bailey’s stunning win in the men’s 20km individual race. \nLaura Dahlmeier’s superb haul of five gold medals for Germany also lifted the sport’s prominence there, and many of these new-found fans will be keeping an eye out for her and her team mates in South Korea. \nThe sport has its origins in the military forces of the Nordic region, where it was developed as a winter training method for troops. \nHistorical records in Norway indicate that soldiers there took part in combined skiing and shooting competitions as far back as the late 1700s but much has changed since the Scandinavian soldiers pioneered the sport. \nFor example, the modern-day biathlon rifle bears little resemblance to its military counterparts, having been developed specifically for the sport. \nThe modern rifles usually have four magazines containing five shots each attached to them, with the athletes inserting a new magazine each time they stop to shoot. \nAdopted as the standard for biathlon rifles in 1978, the .22 calibre rounds have a low recoil, making it easier for shooters to control the rifles. \nBut perhaps the greatest development in the rifles has been the addition of the repeater, a rifle-bolt mechanism which makes it easier and quicker to reload the rifle after each shot. \nPreviously, a shooter would have to remove their hand from the rifle grip to manually operate the bolt-action of the rifle before each shot, an action which cost valuable seconds. \nInvented in the 1980s by German gunsmith Peter Fortner, the repeater allows the shooter’s hand to remain on the grip and reload with the thumb and forefinger, giving the athletes greater speed and more stability when shooting. \nBut while improvements have been made to rifles and skis, the basic tenets of the sport remain the same. \nRacers have to go as fast as they can around the course before stopping to shoot, and it is essential for them to get their pulse under control if they are to be able to consistently hit the target. \nFour-time Olympic biathlete Jean-Marc Chabloz told Reuters that ideally, the body must always be in the same position for every shot, and kept completely still while shooting. \n“It’s a lot of work. They have to be fit and have good stamina, and at the same time be able to focus, to shift from the energetic skiing to being a calm shot,” explained Chabloz, who now coaches young biathletes in Sweden. \nEach miss is penalised by either by straight time penalty or the athlete being forced to ski in a “penalty loop” that is usually 150 meters long. \nThis means that a considerable lead built up while skiing can be quickly wiped out if the shooter fails to hit the target. \nFor Chabloz, it is the simplicity of the sport that makes it so appealing to athletes and audiences alike. \n“It’s about skiing fast and shooting straight,” he said. Reporting by Philip O'Connor; Editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-07T15:48:00.000+02:00", "crawled": "2018-01-07T16:11:17.002+02:00", "highlightTitle": ""}