{"organizations": [], "uuid": "4f89c3a7d895fb6696ea3796c115ba9ea8b1d6dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-guerbet-guerbet-announces-its-acquisition-of-accurate-medical-therapeutics-an-innovative-company-that-develops.html", "country": "US", "domain_rank": 767, "title": "GUERBET : Guerbet announces its acquisition of Accurate Medical Therapeutics, an innovative company that develops microcatheters for interventional radiology", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.55, "site_type": "news", "published": "2018-01-08T20:12:00.000+02:00", "replies_count": 0, "uuid": "4f89c3a7d895fb6696ea3796c115ba9ea8b1d6dc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-guerbet-guerbet-announces-its-acquisition-of-accurate-medical-therapeutics-an-innovative-company-that-develops.html", "ord_in_thread": 0, "title": "GUERBET : Guerbet announces its acquisition of Accurate Medical Therapeutics, an innovative company that develops microcatheters for interventional radiology", "locations": [], "entities": {"persons": [{"name": "guerbet", "sentiment": "none"}], "locations": [{"name": "villepinte", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "accurate medical therapeutics", "sentiment": "neutral"}, {"name": "guerbet", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acceleration of the interventional radiology strategy\nAcquisition of a unique technology for image-guided\nembolization procedures\nVillepinte (France), January 8, 2018 (17:45 CET) - Guerbet (FR 32526 GBT), a global specialist in contrast agents and solutions for medical imaging, announced that it has entered into an agreement under which it will acquire Israeli company Accurate Medical Therapeutics (\"Accurate\"), which specializes in the development of microcatheters used in interventional radiology.\nAccurate has developed a range of microcatheters for embolization procedures of tumors and vascular aneurysms. These products are currently being registered with the US and European health authorities.\nThis range includes two series of microcatheters:\nThe first series was designed and developed to propose an optimization of microcatheters intra-arterial navigation to interventional radiologists, even in case of tortuous vascular network and hardly accessible lesions.\nThe second series possess the same optimized navigation qualities, while also incorporating unique anti-reflux technology. This effect is achieved thanks to side holes located in the terminal part of the catheter, which create a fluid barrier preventing the reflux of embolization microspheres.\nThis new technology makes it possible to administer more embolization microspheres to the targeted treatment area while also preventing them from refluxing upstream to arteries irrigating healthy tissues (non-targeted areas that need to be preserved).\nhttp://bit.ly/2DaNLKk\nStandard microcatheter, positioned in the artery irrigating the tumor: the embolization microspheres travel not only downstream (desired effect) but also upstream (undesired effect), in an artery irrigating healthy tissues that need to be preserved.\nhttp://bit.ly/2mfvCUj\nAnti-reflux microcatheter: the anti-reflux technology sends all the embolization microspheres downstream into the area to be treated. The healthy tissue continues to be irrigated by blood free of microspheres.\nInterventional radiology covers all the image-guided procedures which allow to diagnose and treat patients in a minimally invasive way. The scope of procedures is very large and includes, among the most wellknown, dilatation of stenotic arteries, tumor ablations, replacement of cardiac valves, vertebroplasty, etc. This market is several billion euros but is difficult to globally evaluate because of its heterogeneity. The segment that is mainly targeted today by Guerbet is arterial embolization for tumors and aneurysms; it is valued at about 600 million euros. In this segment, the part of microcatheters is around 120 million euros and is growing at an annual rate of 5% to 10%.\n\"This acquisition will fuel Guerbet's growth in interventional radiology and will round out its current portfolio. This new range of microcatheters will allow us to help interventional radiology teams deliver a higher quality of care during image-guided embolization procedures\" said Yves L'Epine, Guerbet's CEO.\n\"We are very pleased with this agreement between Guerbet and Accurate. We are confident that Guerbet has significant assets and resources that will enable our range of microcatheters to become market leader, in particular the microcatheters possessing the unique anti-reflux technology. It allows to augment embolization of target area while preventing damage to healthy tissues which must be preserved\" said Doctor Michael Tal, inventor and co-founder of Accurate.\nUnder this agreement, Guerbet will acquire 100% of Accurate's capital share, with an initial payment of 19.5 million euros and additional payments spread over several years depending on the achievement of regulatory and commercial objectives. The total amount of the acquisition will not exceed 57 million euros. The transaction is expected to start generating sales by the end of this year and be accretive from the 4 th quarter of 2019.\nAccurate, founded in 2015, will retain its structure in Israel and will continue to be led by its inventor, co-founder and CEO Eran Miller.\nAbout Guerbet\nGuerbet is a pioneer in the contrast agent field, with more than 90 years' experience, and is a leader in medical imaging worldwide. It offers a comprehensive range of pharmaceutical products, medical devices and services for diagnostic and interventional imaging, to improve treatment of patients. With 7% of revenue dedicated to R&D and more than 200 R&D employees distributed amongst its three centers in France and the United States, Guerbet is a substantial investor in research and innovation. Guerbet (GBT) is listed on Euronext Paris (segment B - mid caps) and generated €776 million in revenue in 2016. For more information about Guerbet, visit www.guerbet.com\nForward-looking statements\nThis press release may contain statements of a forward-looking nature, based on assumptions and predictions made by the management of the Guerbet group. Various known and unknown risks, uncertainties and other factors could lead to marked differences between the future results, financial situation, development and performances of the company, and the estimates made here. These factors include those mentioned in the public reports of Guerbet, available on its website www.guerbet.com . The company assumes no responsibility whatsoever in relation to the updating of these forward-looking statements, or how they correspond to future events or developments.\nContacts\nGuerbet Actifin\nJean-François Le Martret\nChief Financial Officer\n+33 (0) 1 45 91 50 00\njean-francois.lemartret@guerbet-group.com\nAnne-Laure Delasalle\nGlobal Communications Director\n+33 (0) 1 45 91 50 03\nanne-laure.delasalle@guerbet-group.com\nChristophe de Lylle/Benjamin Lehari\n+33 (0) 1 56 88 11 11\ncdelylle@actifin.fr / blehari@actifin.fr\nPress\nJennifer Jullia\n+33 (0) 1 56 88 11 19\njjullia@actifin.fr\nAttachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/99bc34d3-cf81-4aa3-aef3-bedabeefa1de\nSource: Guerbet", "external_links": ["https://www.globenewswire.com/Tracker?data=BoGSzmkjRBqiAFwzfg3sEdwVaBLSbr5TWY0Q7v48tUzgPtBaE4spa_GsSVWQB9qbvUKhZ1o42r5U3JzQOFVdYA==", "https://www.globenewswire.com/Tracker?data=WAa1lmejIGKL2YR4eO5YB46KxprRRe24V0G6C26zt_-PUKu0KHGDRTGndhQN-Ldenm3f1Vutytfxy29ud2NTsA==", "https://www.globenewswire.com/Tracker?data=WAa1lmejIGKL2YR4eO5YB-EyzGZeLhL_Vqa3_9b1rqc40YlIqjg75_hKxxfcWdoCilVKpFwE4EP9wm6a33UgpxlegPjxsffn5gUmhPYdgeo=", "http://www.globenewswire.com/NewsRoom/AttachmentNg/99bc34d3-cf81-4aa3-aef3-bedabeefa1de", "https://www.globenewswire.com/Tracker?data=WAa1lmejIGKL2YR4eO5YB7H2u6vc0RbwWkGERZ3DoL9pDJ6BLOxcXB-PdWQb7pjYbGl__mEL79ix3es73mEIK_j3ylbusWPMt6JU6WinlrBzN6TnzgS9hQX7ytb41MQv8h8BQu41FaGqNcgrC-v69oN4GGbmhbCrRWLQy6yUS6awMx8opYKqsAwRP75_QktJ95GlMfDSEYNKXh8vhjK4UbXZA6jcfVkbH-t7yTDQ4yySvCwDnXUAxAeslJbULsDNUu0HinhwGRmRuvw5rG9H5Q==", "http://bit.ly/2mfvCUj", "http://bit.ly/2DaNLKk"], "published": "2018-01-08T20:12:00.000+02:00", "crawled": "2018-01-08T21:05:02.003+02:00", "highlightTitle": ""}