{"organizations": [], "uuid": "4cf2d7279d7430132790e9b747417fc9dc616976", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 19}, "facebook": {"likes": 103, "shares": 103, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104966304-GettyImages-842815988.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/25/xiaomi-beats-samsung-to-be-indias-top-fourth-quarter-smartphone-seller.html", "country": "US", "domain_rank": 767, "title": "Xiaomi beats Samsung to be India's top fourth quarter smartphone seller", "performance_score": 1, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T08:00:00.000+02:00", "replies_count": 0, "uuid": "4cf2d7279d7430132790e9b747417fc9dc616976"}, "author": "Saheli Roy Choudhury", "url": "https://www.cnbc.com/2018/01/25/xiaomi-beats-samsung-to-be-indias-top-fourth-quarter-smartphone-seller.html", "ord_in_thread": 0, "title": "Xiaomi beats Samsung to be India's top fourth quarter smartphone seller", "locations": [], "entities": {"persons": [{"name": "xiaomi", "sentiment": "negative"}, {"name": "rushabh doshi", "sentiment": "none"}, {"name": "doshi", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "xiaomi", "sentiment": "none"}], "organizations": [{"name": "samsung electronics", "sentiment": "negative"}, {"name": "samsung", "sentiment": "negative"}, {"name": "canalys", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Samsung Electronics is no longer India's top smartphone seller — a title it had held onto for six years.\nThe tech giant was pushed out of the pole position in the final quarter of 2017 by Chinese smartphone maker Xiaomi, data from two research outlets showed.\nResearcher Canalys estimated that Xiaomi shipped nearly 8.2 million smartphones in India between October and December last year, giving it about 27 percent of the market share. Meanwhile, Samsung shipped about 7.3 million smartphones in the same period and captured 25 percent of the market, Canalys said.\n\"Samsung's loss comes from its inability to transform its low-cost product portfolio,\" Rushabh Doshi, an analyst at the research firm, said in a report. He added that the South Korean tech giant was struggling to win over cost-conscious customers in the low-end segment of the Indian smartphone market.\n\"Despite its ability to offer better margins and funding to the offline channel, consumer demand for Samsung's devices has been weak,\" Doshi said. He predicted the power struggle between Samsung and Xiaomi to continue into 2018 as the South Korean giant fights to take back the \"aspirational status it once held in the mind of Indian consumers.\"\nSeparately, market researcher Counterpoint Research reported that Xiaomi conquered 25 percent of the market in the fourth quarter, while Samsung had just 23 percent. Lenovo, Vivo and Oppo took 6 percent each, the firm said.\nFor the full calendar year, however, Samsung still emerged on top with 24 percent of the market, Counterpoint Research said.\nXiaomi's aggressively priced portfolio of smartphones and its local strategy helped the firm clinch the top position in India, Tarun Pathak, associate director at Counterpoint, said in the firm's report.\nAnother reason why Xiaomi was able to topple Samsung was because it allowed its Indian unit the freedom to run the business locally, Canalys posited.\nThe success in the Indian smartphone market points to a potential turnaround for Xiaomi, which struggled for the past few years as it searched for new areas of growth.\nXiaomi was once considered the darling of the smartphone world , showing triple-digit growth and challenging the likes of Samsung and Apple . At one point in time , it was the top player in China but eventually saw its market share eaten away by the likes of Huawei, Vivo and Oppo.\nThe company's CEO previously said the company had grown \"too fast,\" which led to business challenges. The Chinese tech firm is also getting ready to go public , according to reports earlier this month, and that could value the company at up to $100 billion.\nCanalys said that Xiaomi's success in India could boost the company's overseas ambitions and help to build confidence in its partners and future investors.\n\"But growth in 2018 will be hard to come by,\" Doshi warned. \"As Xiaomi's market share reaches saturation point in India, and the market continues to shrink in China, it must contend with slower growth for its smartphone business as it begins to expand in other countries.\"\nThe fourth-quarter shakeup in the Indian market came amid a 12 percent growth in smartphone shipments, according to Counterpoint. But that was still dwarfed by a massive 55 percent jump in \"feature phones\" shipped in the same period.\nFeature phones, which offer basic functions like making calls, sending texts and browsing the internet, hold the largest share of the Indian mobile phone market because they are cheaper than smartphones.", "external_links": [], "published": "2018-01-25T08:00:00.000+02:00", "crawled": "2018-01-25T07:05:15.044+02:00", "highlightTitle": ""}