{"organizations": [], "uuid": "78ca4eb2598f8a7ae3ca33fa37d5be66578c4deb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223152777&w=1200&r=LYNXMPEE0H21Z", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-ford-motor-takata-congress/u-s-senators-question-extent-of-ford-do-not-drive-warning-on-airbags-idUSKBN1F735G", "country": "US", "domain_rank": 408, "title": "U.S. senators question extent of Ford 'Do Not Drive' warning on airbags", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:54:00.000+02:00", "replies_count": 0, "uuid": "78ca4eb2598f8a7ae3ca33fa37d5be66578c4deb"}, "author": "", "url": "https://www.reuters.com/article/us-ford-motor-takata-congress/u-s-senators-question-extent-of-ford-do-not-drive-warning-on-airbags-idUSKBN1F735G", "ord_in_thread": 0, "title": "U.S. senators question extent of Ford 'Do Not Drive' warning on airbags", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Two senators asked the U.S. Transportation Department on Thursday to explain why a “do not drive” directive issued last week by Ford Motor Co ( F.N ) is limited to about 2,900 older pickup trucks and if other vehicles are potentially at risk from defective airbag inflators.\nThe second-largest U.S. automaker said it had confirmed a second death in a 2006 Ford Ranger caused by a faulty Takata Corp ( TKTDQ.PK ) airbag inflator and urged some owners to stop driving immediately until they can get replacement parts. [nL1N1P61GI]\nThe National Highway Traffic Safety Administration should “swiftly and proactively address the deadly defect in Takata airbags and provide consumers with appropriate notice regarding the defect’s serious potential risk to life,” wrote Senators Richard Blumenthal and Edward Markey, both Democrats, to Transportation Secretary Elaine Chao.\nFord said both deaths in 2006 Ranger pickups occurred with inflators built on the same day. In a recall notice filed with NHTSA, Ford said data from the two incidents and an anomalous test all occurred with inflators from the same propellant production lot. The recall applies to Ford Rangers with inflators built on two days in September 2005, the company said.\nA NHTSA spokeswoman declined to immediately comment on the letter. Ford spokeswoman Elizabeth Weigandt said the automaker is “still investigating the issue with these inflators.”\nAt least 21 deaths worldwide are linked to the Takata inflators that can rupture and send deadly metal fragments into the driver’s body. The faulty inflators have led to the largest automotive recall in history. The other 19 deaths have occurred in Honda Motor Co ( 7267.T ) vehicles, most of which were in the United States.\nFord issued a separate recall for trucks previously recalled in 2016. Of those 391,000 2004-2006 Ranger vehicles, last week’s recall affects 2,900 vehicles in North America, most in the United States. The company is paying to tow vehicles to dealerships for repairs and providing free loaners.\nThe senators want NHTSA to require the same “Do Not Drive” warning for all previously recalled Rangers unless Ford can explain why they do not pose the same heightened risk.\nMazda Motor Corp ( 7261.T ) issued a similar recall and stop drive warning for 160 2006 Mazda B-Series trucks, which were built by Ford.\nTakata said in a statement it “strongly urges vehicle owners to check” to see if vehicles have been recalled. NHTSA also urged owners to heed Ford’s warning.\nTakata said it would recall, or expects to recall, about 125 million vehicles from 19 automakers worldwide by 2019, including more than 60 million in the United States.\nReporting by David Shepardson; editing by Grant McCool\n ", "external_links": [], "published": "2018-01-18T23:54:00.000+02:00", "crawled": "2018-01-19T00:11:58.000+02:00", "highlightTitle": ""}