{"organizations": [], "uuid": "4d0463737aa94008703ce40aff5c127201ab8bc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-scale-record-highs-as-us-govt-shutdown-ends-yen-turns-down-idUSL4N1PI2YP", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Stocks scale record highs as US govt shutdown ends, yen turns down", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.048, "site_type": "news", "published": "2018-01-23T15:36:00.000+02:00", "replies_count": 0, "uuid": "4d0463737aa94008703ce40aff5c127201ab8bc1"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-scale-record-highs-as-us-govt-shutdown-ends-yen-turns-down-idUSL4N1PI2YP", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Stocks scale record highs as US govt shutdown ends, yen turns down", "locations": [], "entities": {"persons": [{"name": "kuroda", "sentiment": "none"}, {"name": "shinichi saoshiro", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "nikkei", "sentiment": "negative"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}, {"name": "kospi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* MSCI Asia-Pacific index up 0.9 pct, Nikkei adds 1.3 pct\n* Spreadbetters expect European stocks to open higher\n* Equities probe fresh highs after U.S. govt shutdown ends\n* BOJ stands pat as expected, more upbeat on inflation view\n* BOJ’s Kuroda: not in condition to debate exit timing from QQE\n* S.Korea to ban cryptocurrency traders from using anonymous bank accounts, bitcoin slips\nBy Shinichi Saoshiro\nTOKYO, Jan 23 (Reuters) - Asian stocks advanced on Tuesday after U.S. senators struck a deal to end a government shutdown in a boost to Wall Street, while the dollar turned higher against the yen after Bank Of Japan’s chief reiterated his support for quantitative easing.\nSpreadbetters expected Britain’s FTSE to open 0.3 percent higher, Germany’s DAX 0.5 percent and France’s CAC 0.3 percent.\nU.S. lawmakers passed a short-term measure on Monday to fund the federal government through Feb. 8.\nMSCI’s broadest index of Asia-Pacific shares outside Japan rose 0.9 percent to a record peak.\nAustralian stocks climbed 0.75 percent and South Korea’s KOSPI added 1.4 percent.\nJapan’s Nikkei rose to a 26-year peak, Hong Kong’s Hang Sang scaled a record high and Singapore reached a 10-year top.\nWorld equity markets have been on a tear over the past year, buoyed by a synchronised uptick in global economic growth in a boon to corporate profits and stock valuations.\nThe brief U.S. government shutdown put only a minor dent to equities, with Wall Street rallying to all-time highs overnight following the deal to end the impasse in Washington.\nIn currencies, the dollar briefly dipped 0.33 percent to 110.550 yen after the BOJ maintained its short-term interest rate target at minus 0.1 percent and a pledge to guide 10-year government bond yields around zero percent.\nThe BOJ also said “inflation expectations have moved sideways recently,” offering a slightly more upbeat view than three months ago when it said they were on a weak note.\nThe central bank was still far from its peers who were looking for ways out of unconventional monetary policies.\n“The BOJ kept is policies unchanged and made no real changes to its overall stance. It still remains a step behind other central banks looking to normalise their policies,” said Shusuke Yamada, chief Japan FX strategist at Bank of America Merrill Lynch.\nThe BOJ caused ripples in the markets earlier in January by slightly reducing the amount of longer-dated Japanese government bonds (JGBs) it buys from the market at its regular debt-purchasing operations.\nThe yen had appreciated significantly against the dollar as some traders speculated the central bank was preparing to scale back its massive stimulus.\nIn Tuesday’s press conference following the policy decision, BOJ Governor Haruhiko Kuroda put such notions to rest: “There is still some distance to 2 percent inflation, so we’re in no condition yet to debate the timing of an exit from ultra-easy monetary policy.”\nIn response, the dollar pulled back from earlier losses and was last 0.2 percent higher at 111.100 yen.\nThe euro was down 0.2 percent at $1.2240 after gaining 0.3 percent overnight. The common currency was still within reach of a three-year peak of $1.2323 set on Wednesday.\nThe euro was supported ahead of the outcome of the European Central Bank’s meeting on Thursday, which could provide clues to future shifts in the central bank’s monetary policy.\nThe pound was a shade lower at $1.3961 after touching $1.3992, its highest level since June 2016’s vote for Brexit, on optimism that Britain will reach a favourable divorce deal with the European Union.\nThe dollar index against a basket of six major currencies stood rose 0.15 percent to 90.524.\nIn the virtual currency world, bitcoin was down 4.5 percent on the Bitstamp exchange at $10,320.13 following news that South Korea will ban the use of anonymous bank accounts in cryptocurrency trading from Jan. 30. While it was a widely telegraphed move designed to stop virtual coins from being used for money laundering and other crimes, the step also underscored authorities’ intent to close down avenues for spurious speculation.\nOil prices rose on Tuesday, lifted by healthy economic growth as well as the ongoing supply restraint by a group of exporters around OPEC and Russia.\nU.S. crude oil futures rose 0.6 percent to $63.94 per barrel and Brent gained 0.56 percent to $69.42 per barrel .\nSpot gold tacked on 0.2 percent to $1,336.70 per ounce.\nEditing by Jacqueline Wong & Shri Navaratnam\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T15:36:00.000+02:00", "crawled": "2018-01-24T15:46:13.001+02:00", "highlightTitle": ""}