{"organizations": [], "uuid": "1994d6484c77577ea4b325370d6a9f69af715604", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-virtusa-announces-date-of-third-quarter-2018-financial-results-release-conference-call-and-webcast.html", "country": "US", "domain_rank": 767, "title": "Virtusa Announces Date of Third Quarter 2018 Financial Results Release, Conference Call and Webcast", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:15:00.000+02:00", "replies_count": 0, "uuid": "1994d6484c77577ea4b325370d6a9f69af715604"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-virtusa-announces-date-of-third-quarter-2018-financial-results-release-conference-call-and-webcast.html", "ord_in_thread": 0, "title": "Virtusa Announces Date of Third Quarter 2018 Financial Results Release, Conference Call and Webcast", "locations": [], "entities": {"persons": [{"name": "virtusa", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "webcast westborough", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "virtusa corporation", "sentiment": "negative"}, {"name": "virtusa virtusa corporation", "sentiment": "none"}, {"name": "eastern time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WESTBOROUGH, Mass.--(BUSINESS WIRE)-- Virtusa Corporation (NASDAQ GS:VRTU), a global business consulting and IT outsourcing company that accelerates business outcomes for its clients, today announced that it will report its fiscal third quarter financial results for the three months ended December 31, 2017 before the U.S. financial markets open on Thursday, February 8, 2018.\nIn conjunction with this announcement, Virtusa will host a conference call on Thursday, February 8, 2017 at 8:00 a.m. Eastern Time to discuss the Company’s financial results and financial guidance. To access this call, dial 800-289-0517 (domestic) or 323-794-2423 (international). The conference ID number is 1619116. A replay of this conference call will be available through February 15, 2017 at 844-512-2921 (domestic) or 412-317-6671 (international). The replay passcode is 1619116. A live webcast of this conference call will be available on the “Investors” page of the Company’s website ( www.virtusa.com ), and a replay will be archived on the website as well.\nAbout Virtusa\nVirtusa Corporation (NASDAQ GS: VRTU) is a global provider of information technology (IT) consulting and outsourcing services that accelerate business outcomes for Global 2000 companies and leading software vendors in banking and financial services, insurance, healthcare, telecommunications, technology, and media & entertainment.\nVirtusa helps CXOs address the dual challenge of growing revenues while improving IT cost efficiencies. Virtusa's digital transformation & innovation (DTi) solutions enable clients to reimagine the customer experience, accelerate revenue growth and create lasting business value. The company’s operational excellence (OE) solutions help clients reduce risk, improve operational efficiencies, and lower IT costs.\nVirtusa delivers services across the IT lifecycle, including consulting, solution design, technology selection, implementation, testing, and maintenance, including infrastructure support. With a strong heritage in software engineering, Virtusa is highly qualified to both develop and maintain software, using a proven platforming methodology and advanced Agile and Accelerated Solution Design techniques to reliably deliver results on time and within budget.\nHolding a proven record of success across industries, Virtusa readily understands its clients' business challenges and uses its domain expertise to deliver distinctive, differentiated and innovative applications of technology to address its clients’ critical business challenges. Examples include building the world's largest P&C claims modernization program; one of the largest corporate customer portals for a premier global bank; an order to cash implementation for a multinational telecommunications provider; and digital transformation initiatives for media and banking companies.\nThrough the acquisition of a majority interest in Polaris Consulting Services Ltd. in March 2016, Virtusa has created a robust platform to provide end-to-end solutions and services in banking and financial services, strengthening its positioning as a top, global FinTech services provider.\nVirtusa Corporation is headquartered in Massachusetts and has 50 offices across North America, Europe and Asia.\nPolaris Consulting & Services is a subsidiary of Virtusa Corporation. Copyright © 2018 Virtusa Corporation. All Rights Reserved.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006425/en/\nMedia:\nGreenough\nAmy Legere, 617-275-6517\nalegere@greenough.biz\nor\nInvestor:\nICR\nWilliam Maina, 646-277-1236\nwilliam.maina@icrinc.com\nSource: Virtusa Corporation", "external_links": ["http://www.businesswire.com/news/home/20180123006425/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.virtusa.com&esheet=51747731&newsitemid=20180123006425&lan=en-US&anchor=www.virtusa.com&index=2&md5=35e8b9f821fb41f6fb10b6cbf91aaf05", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.virtusa.com&esheet=51747731&newsitemid=20180123006425&lan=en-US&anchor=Virtusa+Corporation&index=1&md5=1165a9f9e55d256c4256647950da3b1a"], "published": "2018-01-24T00:15:00.000+02:00", "crawled": "2018-01-24T00:40:34.003+02:00", "highlightTitle": ""}