{"organizations": [], "uuid": "4ec3957f104745200d6519e4d4492c0841834aff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-global-rice-food-security/can-rice-from-australias-crocodile-infested-waters-help-feed-more-people-idUSKBN1FE1Z7", "country": "US", "domain_rank": 408, "title": "Can rice from Australia's crocodile-infested waters help feed more people?", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.887, "site_type": "news", "published": "2018-01-25T22:06:00.000+02:00", "replies_count": 0, "uuid": "4ec3957f104745200d6519e4d4492c0841834aff"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-rice-food-security/can-rice-from-australias-crocodile-infested-waters-help-feed-more-people-idUSKBN1FE1Z7", "ord_in_thread": 0, "title": "Can rice from Australia's crocodile-infested waters help feed more people?", "locations": [], "entities": {"persons": [{"name": "robert henry", "sentiment": "none"}, {"name": "henry", "sentiment": "none"}, {"name": "rice", "sentiment": "none"}], "locations": [{"name": "rome", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "irri", "sentiment": "none"}, {"name": "university of queensland", "sentiment": "none"}, {"name": "nature genetics", "sentiment": "none"}, {"name": "international rice research institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME (Thomson Reuters Foundation) - Wild rice growing in northern Australia’s crocodile-infested waters could hold the key to breeding a more nutritious grain that is drought and pest resistant, according to scientists who have just mapped its genetic family tree.\nInternational researchers, including Robert Henry from the University of Queensland, examined 13 domesticated and wild rice species globally, raising hopes about breeding commercial rice from Australian variety Oryza meridionalis.\nRice is a staple food for over half of the world population and consumption levels are rising, according to the Philippines-based International Rice Research Institute (IRRI).\nHenry said this Australian rice was found to have valuable traits that could be bred into commercial rice.\n“(This could have) a really positive impact on the human health on a large scale,” Henry told the Thomson Reuters Foundation in a telephone interview.\nHenry, whose work was part of a paper published this week in Nature Genetics, said researchers found the Australian rice shared the same ancestor as an Asian rice species consumed by millions of people today but evolved three million years ago.\nHe said it had probably been overlooked until now due to its location.\n“Some of the best rice sites are where there are a lot of dangerous crocodiles,” he said.\nRod A. Wing, co-author and director of the Arizona Genomics Institute at the University of Arizona, said wild rice species globally provide “a virtually untapped reservoir of genes” that can be used to improve current rice species.\nSince 2003, Wing has been leading global research into 25 wild rice species that are genetically similar to two rice species consumed globally today with the next research to focus on a wild rice that grows in saltwater.\n“The world population could be 10 billion by 2050 and the question is how do we feed our world without destroying it,” Wing told the Thomson Reuters Foundation by phone.\nHe said genetic information could allow the world “to make crops that are higher yielding, more nutritious” but do less harm to the environment by using less water or pesticides.\nReporting By Thin Lei Win, Editing by Belinda Goldsmith; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, corruption and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T22:06:00.000+02:00", "crawled": "2018-01-26T21:09:42.012+02:00", "highlightTitle": ""}