{"organizations": [], "uuid": "51bf03e565d769c3cd8f8804a524c01454185b1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/euzPJ", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-tunisia-economy-currency/tunisian-protester-killed-in-clashes-with-police-over-price-hikes-unemployment-idUSKBN1EX2FK", "country": "US", "domain_rank": 408, "title": "Tunisian protester killed in clashes with police over price hikes, unemployment", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T05:51:00.000+02:00", "replies_count": 0, "uuid": "51bf03e565d769c3cd8f8804a524c01454185b1d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tunisia-economy-currency/tunisian-protester-killed-in-clashes-with-police-over-price-hikes-unemployment-idUSKBN1EX2FK", "ord_in_thread": 0, "title": "Tunisian protester killed in clashes with police over price hikes, unemployment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TUNIS (Reuters) - One person was killed on Monday during clashes between security forces and protesters in a Tunisian town, a security official and residents said, as demonstrations over rising prices and tax increases spread in the North African country.\nA man was killed during a demonstration against government austerity measures in Tebourba, 40 km (25 miles) west of Tunis, the security official said, without giving details.\nThe protest had turned violent when security forces tried stopping some youths from burning down a government building, witnesses said. Five people were wounded and taken to a hospital, state news agency TAP said.\nTunisia, widely seen in the West as the only democratic success among nations where “Arab Spring” revolts took place in 2011, is suffering increasing economic hardship.\nAnger has been building up since the government said that from Jan. 1, it would increase the price of gasoil, some goods and taxes on cars, phone calls, the internet, hotel accommodation and other items, part of austerity measures agreed with its foreign lenders.\nThe 2018 budget also raises customs taxes on some products imported from abroad, such as cosmetics, and some agricultural products.\nThe economy has been in crisis since a 2011 uprising unseated the government and two major militant attacks in 2015 damaged tourism, which comprises 8 percent of GDP. Tunisia is under pressure from the International Monetary Fund to speed up policy changes and help the economy recover from the attacks.\nViolent protests spread in the evening to at least 10 towns with police and crowds clashing in Fernaneh, Bouhajla, Ouslatia, Moulouche, Sabitla, Gtar and Kef.\nThere was also a protest turning violent in Ettadamen district in the capital, residents said. Security forces had already dispersed small protests in Tunis late on Sunday.\nOn Monday, about 300 people also took to the streets in the central Tunisian town of Sidi Bouzid, cradle of the country’s Arab Spring revolution, carrying banners aloft with slogans denouncing high prices.\nA lack of tourists and new foreign investors pushed the trade deficit up by 23.5 percent year-on-year in the first 11 months of 2017 to a record high $5.8 billion, official data showed at the end of December.\nConcerns about the rising deficit have hurt the dinar, sending it to 3.011 versus the euro on Monday, breaking the psychologically important 3 dinar mark for the first time, traders said.\nThe currency is likely to weaken further, said Tunisian financial risk expert Mourad Hattab.\n“The sharp decline of the dinar threatens to deepen the trade deficit and make debt service payments tighter, which will increase Tunisia’s financial difficulties,” he said.\nHattab said the dinar may fall to 3.3 versus the euro in the coming months because of high demand for foreign currency and little expectation of intervention from the authorities.\nLast year, former Finance Minister Lamia Zribi said the central bank would reduce its interventions so that the dinar steadily declined in value, but it would prevent any dramatic slide.\nThe central bank has denied any plans to liberalise the currency but Hattab said Monday’s decline showed there was an “undeclared float” of the dinar.\nA weaker currency could further drive up the cost of imported food after the annual inflation rate rose to 6.4 percent in December, its highest rate since July 2014, from 6.3 percent in November, data showed on Monday.\nReporting by Tarek Amara; Writing by Ulf Laessing; editing by Grant McCool\n ", "external_links": [], "published": "2018-01-09T05:51:00.000+02:00", "crawled": "2018-01-09T09:40:17.426+02:00", "highlightTitle": ""}