{"organizations": [], "uuid": "0d9bdbbf0a4a6e9eaa1f15eb057c4cf788851ba6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943886-GettyImages-531109726.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/12/cameron-winklevoss-shares-his-2-favorite-science-fiction-books.html", "country": "US", "domain_rank": 767, "title": "Cameron Winklevoss shares his 2 favorite science fiction books", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-01-13T17:00:00.000+02:00", "replies_count": 0, "uuid": "0d9bdbbf0a4a6e9eaa1f15eb057c4cf788851ba6"}, "author": "Ali Montag", "url": "https://www.cnbc.com/2018/01/12/cameron-winklevoss-shares-his-2-favorite-science-fiction-books.html", "ord_in_thread": 0, "title": "Cameron Winklevoss shares his 2 favorite science fiction books", "locations": [], "entities": {"persons": [{"name": "cameron winklevoss", "sentiment": "negative"}, {"name": "tyler", "sentiment": "negative"}, {"name": "winklevoss", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "isaac asimov", "sentiment": "none"}], "locations": [], "organizations": [{"name": "new york times", "sentiment": "none"}, {"name": "winklevoss capital", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Together with his brother Tyler, Cameron Winklevoss has amassed a fortune in the cryptocurrency bitcoin.\nIn April 2013, the Winklevoss twins, famous for their legal battle with Mark Zuckerberg over the creation of Facebook, held a combined total of $11 million in bitcoin at $120 a coin. When the price of a coin reached $11,700 in December 2017, their holdings surpassed $1 billion .\nOn Dec. 19, their bitcoin hoard was worth about $1.3 billion, according to The New York Times , although the digital currency has since seen fluctuations in price .\nThe Winklevoss twins are also the founders of Gemini , an exchange where cryptocurrencies can be bought and sold, and they spend time running their venture capital firm, Winklevoss Capital.\nWhile you might imagine the entrepreneurs' days are filled with dense technological reading, Cameron Winklevoss reveals in a 2013 Reddit Ask Me Anything Post that he also takes time to be inspired by works of science fiction.\nHere are two of his favorite novels, according to the post.\n\"Foundation\" by Isaac Asimov This 1951 novel is the first of a series of seven, which were published over four decades and delve into a far away universe plagued by intergalactic war. The series' author, Isaac Asimov, was born in the Soviet Union in 1920 and wrote nearly 500 books in his lifetime, according to The New York Times.\n\"Dune\" by Frank Herbert Published in 1965 , \"Dune\" takes place on a desert planet and is set more than 20,000 years in the future. There, different factions fight to control the universe's most important substance \"melange,\" which can let users see the future and have longer lives. The book sold more than 12 million copies during the lifetime of its author Frank Herbert, according to The New Yorker .\nWhen a Reddit user asked if Winklevoss has read two other science fiction novels, \"Cryptonomicon\" or \"Snow Crash\" by Neal Stephenson, Winklevoss responded he's checked those off of his list too.\nHe writes, \"Love them both!\"\nWinklevoss' appreciation of science fiction books puts him in good company. Space X and Tesla CEO Elon Musk says he \" was raised by books ,\" and credits Douglas Adams' science fiction classic \"The Hitchhiker's Guide to the Galaxy,\" to changing his life as a young person.\nAlso a fan of Isaac Asimov , Musk tells The Guardian in 2013 that the \"Foundation\" series taught him \"civilizations move in cycles.\"\nReading works of fiction can increase your emotional intelligence and boost your vocabulary and language skills, benefits not lost on billionaire technology magnates like Bill Gates and Jeff Bezos .\nGates cites \"Catcher in the Rye\" as his favorite book of all time , and Bezos draws leadership inspiration from \"The Remains of the Day\" by Kazuo Ishiguro.\nDon't miss: 6 must-read books about bitcoin\nLike this story? Like CNBC Make It on Facebook !\nshow chapters Tony Robbins shares the mindset you need to invest in bitcoin 4:14 PM ET Thu, 14 Dec 2017 | 01:10", "external_links": [], "published": "2018-01-13T17:00:00.000+02:00", "crawled": "2018-01-13T17:04:25.017+02:00", "highlightTitle": ""}