{"organizations": [], "uuid": "3b35a1014c8194b88f43a6354cffccbe373b405d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.goldreview.com/feed", "section_title": "Gold Review » Gold Review", "url": "https://uk.reuters.com/article/global-precious/precious-gold-holds-near-4-month-high-as-investors-seek-to-hedge-risks-idUKL8N1P639D", "country": "US", "domain_rank": 408, "title": "Gold near 4-month highs after hawkish ECB boosts euro", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T18:28:00.000+02:00", "replies_count": 0, "uuid": "3b35a1014c8194b88f43a6354cffccbe373b405d"}, "author": "cmullen", "url": "https://uk.reuters.com/article/global-precious/precious-gold-holds-near-4-month-high-as-investors-seek-to-hedge-risks-idUKL8N1P639D", "ord_in_thread": 0, "title": "Gold near 4-month highs after hawkish ECB boosts euro", "locations": [], "entities": {"persons": [{"name": "peter hobson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 12:18 PM / Updated 2 hours ago PRECIOUS-Gold nears 4-month highs after hawkish ECB boosts euro Reuters Staff 3 Min Read \n* ECB hints at tighter monetary policy * Dollar falls on weak U.S. inflation, more jobless claims * Gold up more than $80 since mid-December (Recasts lead paragraph, updates prices; adds comment, NEW YORK to dateline) By Renita D. Young and Peter Hobson NEW YORK/LONDON, Jan 11 (Reuters) - Gold prices on Thursday approached a four-month high set on the previous day after minutes of a European Central Bank meeting showed a more aggressive tone and boosted the euro against the U.S. dollar. The December meeting minutes said the central bank should revisit its policy message in early 2018 and gradually adjust its language to reflect improved growth prospects. \"The euro gained against the dollar after the minutes from the ECB's December meeting showed a hawkish tone,\" said John Lawrence, a senior trader at Heraeus Precious Metals in New York. Investors would probably take a policy message change as a sign that rate-setters may begin to wind down their 2.55-trillion-euro bond-buying program. A stronger euro potentially boosts demand for gold by making dollar-priced bullion cheaper for European investors. The dollar weakened more broadly after U.S. data showed a rise in jobless claims and a decrease in producer prices, making gold cheaper for other non-U.S. buyers. Daniel Ghali, commodities strategist at TD Securities in Toronto, said he had been expecting a lower dollar. \"The U.S. is set to tighten their quantitative easing, but other central banks around the world are going to play catch up,\" he said. \"That should sap some strength out of the dollar during the year.\" Spot gold was up 0.5 percent at $1,322.74 an ounce by 1:37 p.m. EST (1837 GMT) after touching $1,326.56 on Wednesday, the highest since Sept. 15. U.S. gold futures for February delivery settled up $3.20, or 0.2 percent, at $1,322.50 per ounce. The weaker dollar has helped gold rally by more than $80 from its mid-December low, but it will struggle to rise much further in the short term, said Saxo Bank analyst Ole Hansen. Several other factors were supporting gold prices, including a dip in global equities following a spectacular rally, and a rise in industrial metals that will increase the cost of goods and services. \"People are starting to pick up on gold as a hedge,\" Ghali said. \"There might be a growing community of people that are worried about an equity correction.\" Among other precious metals, spot silver was up 0.1 percent at $16.96 an ounce from a two-week low of $16.86 on Wednesday. Platinum was up 1.31 percent at $983.70 an ounce after hitting $985.10, its highest since Sept. 15. Palladium rose 0.2 percent to $1,084.60 an ounce after touching a nine-day low of $1,075.50. (Additional reporting by Nallur Sethuraman in Bengaluru; Editing by Mark Potter and Lisa Von Ahn)", "external_links": [], "published": "2018-01-11T18:28:00.000+02:00", "crawled": "2018-01-11T20:40:52.044+02:00", "highlightTitle": ""}