{"organizations": [], "uuid": "7dee55165f49756609bcf2bb1bc35f74b1c3f123", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/china-economy-trade-sugar/small-sugar-producers-find-sweet-spot-in-china-after-brazil-tariffs-idUSL4N1PI22Z", "country": "US", "domain_rank": 408, "title": "Small sugar producers find sweet spot in China after Brazil tariffs", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.712, "site_type": "news", "published": "2018-01-25T16:06:00.000+02:00", "replies_count": 0, "uuid": "7dee55165f49756609bcf2bb1bc35f74b1c3f123"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-economy-trade-sugar/small-sugar-producers-find-sweet-spot-in-china-after-brazil-tariffs-idUSL4N1PI22Z", "ord_in_thread": 0, "title": "Small sugar producers find sweet spot in China after Brazil tariffs", "locations": [], "entities": {"persons": [{"name": "braz", "sentiment": "negative"}, {"name": "bruno zaneti", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "southeast asia", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "costa rica", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "general administration of customs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Brazil exported no sugar to China in December\n* Hefty import penalties have curbed sales from Brazil\n* Arrivals from Philippines, Costa Rica soar in 2017\nBEIJING, Jan 25 (Reuters) - Smaller sugar producers in South America and Southeast Asia made inroads into China in 2017, data showed on Thursday, taking advantage of hefty duties on Brazilian and Thai imports to win sales in one of the world’s biggest buyers of the sweetener.\nBrazil, the world’s top sugar producer and exporter, sold no sugar to China in December and exported just 790,374 tonnes for the whole year, down 60.3 percent from 2016, according to data from the General Administration of Customs.\nThe South American nation accounted for just over a third of China’s reduced total imports in 2017, down from two-thirds a year earlier.\nChina’s total imports slumped last year due to the new duties, falling by a quarter to 2.29 million tonnes, the lowest since 2010, data showed earlier this week.\n“Chinese buyers are importing less raw sugar. The number one reason is because of the increase in taxes,” said Bruno Zaneti, a sugar and ethanol risk manager with INTL FC Stone in Campinas, Brazil.\nIn May last year China imposed extra tariffs on out-of-quota sugar imports for the next three years, including the current fiscal year, to protect its domestic industry.\nThe ruling dented imports from top suppliers like Brazil, but it opened China’s market to smaller producers who were exempt from the new duty. Their step-up in sales suggests Beijing’s measures to protect the local industry may be less successful than its growers had hoped.\nTraders say the tariffs have also fueled smuggling across the border with Vietnam.\nAt least seven countries from South America and Southeast Asia either sold sugar to China for the first time or returned after a long absence. These include South Africa, the Philippines, Pakistan, Nicaragua, Vietnam, El Salvador, and Costa Rica.\nAll were on a list of 190 smaller countries and regions exempted from the new tariffs.\n“Importing from them is still profitable,” said Zhan Xiao, an analyst at Shanghai Buyun Investment Management.\nThe Philippines took top spot for the monthly import total in December, shipping in 38,834 tonnes. For 2017, it sold 99,210 tonnes, 4.3 percent of total foreign arrivals.\n“If we can maintain that volume of exports at a regular pace, then that’s when we can say that we really have won a market share,” said Jesus Barrera, a spokesman for the Philippine Sugar Millers Association. “The volume that went to China is really substantial.”\nEl Salvador, located in Central America, sold 111,681 tonnes to China in 2017, accounting for 5 percent of the market.\nDespite the duties, shipments from Thailand rose 61.1 percent in 2017 to 289,234 tonnes, while imports from Cuba dropped 7.86 percent to 402,195 tonnes.\nReporting by Hallie Gu, Josephine Mason in BEIJING, Enrico dela Cruz in MANILA and Chris Prentice in NEW YORK; editing by Richard Pullin\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T16:06:00.000+02:00", "crawled": "2018-01-26T21:27:32.011+02:00", "highlightTitle": ""}