{"organizations": [], "uuid": "06406715b1a351259bfa9f26ead13988947665ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/southkorea-economy-rates/highlights-bank-of-korea-governor-lees-comments-at-news-conference-idUSL3N1PD1LG", "country": "US", "domain_rank": 408, "title": "HIGHLIGHTS-Bank of Korea Governor Lee's comments at news conference", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T04:56:00.000+02:00", "replies_count": 0, "uuid": "06406715b1a351259bfa9f26ead13988947665ce"}, "author": "", "url": "https://www.reuters.com/article/southkorea-economy-rates/highlights-bank-of-korea-governor-lees-comments-at-news-conference-idUSL3N1PD1LG", "ord_in_thread": 0, "title": "HIGHLIGHTS-Bank of Korea Governor Lee's comments at news conference", "locations": [], "entities": {"persons": [{"name": "lee", "sentiment": "negative"}, {"name": "lee ju-yeol", "sentiment": "none"}], "locations": [{"name": "korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bank of korea", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL, Jan 18 (Reuters) - South Korea’s central bank held interest rates steady on Thursday, as expected, as it monitored the effects of its November hike and remained wary of triggering disruptive capital flows.\nFollowing are key remarks from Bank of Korea Governor Lee Ju-yeol’s news conference, translated by Reuters:\nRATE DECISION: “Today’s decision to raise the base rate to 1.50 percent was unanimous.”\n“We decided to keep rates unchanged today as there are still uncertainties inside and outside the country and it is necessary to observe the effect of these factors. Also, inflationary pressures are not high, also leading to our decision.”\n“Going forward, monetary policy will be kept accommodative to support economic growth.”\n“In November, we raised interest rates and whether we will make additional moves will come after we look at growth and inflation closely, in addition to other factors.”\nECONOMIC GROWTH: “South Korea’s economic growth this year is now seen at 3.2 percent versus 3.0 seen earlier.”\n“We raised our growth forecast for 2018 because global economic growth has been expanding more than we expected back in October.”\n“This year, economic growth will be stronger in the first half of the year compared to the second half.”\nINFLATION: “Inflation this year is expected at 1.7 percent compared to our previous projection of 1.8 percent.”\nCRYPTOCURRENCY: “It’s a little too early for us to assess the impact virtual currency trade has had, or will have on the South Korean economy in detailed numbers.”\n“Currently, we believe the impact from sudden changes in cryptocurrency levels will be limited on the financial system.”\n“Cryptocurrency is not a legal currency and is not being used as such as of now. However, we have started looking at virtual currency from a long-term standpoint, as central banks could start issuing digital currencies in the future. This sort of research has begun at the Bank of International Settlements and we are part of that research.”\nFOREX: “The won has been strengthening and part of that may be because geopolitical risks linked to North Korea have eased somewhat and the dollar weakened broadly, in addition to South Korea’s growth expanding quickly. However, some of the won’s gains were also due to herd behaviour.” (Reporting by Christine Kim; Editing by Sam Holmes)\n ", "external_links": [], "published": "2018-01-18T04:56:00.000+02:00", "crawled": "2018-01-18T05:33:35.027+02:00", "highlightTitle": ""}