{"organizations": [], "uuid": "b0740fa50780bdf0b3920318185bbeb2d6cb9583", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/17/104777758-RTS1E3QW.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/24/mexicos-finance-minister-isnt-worried-about-a-plan-b-for-nafta.html", "country": "US", "domain_rank": 767, "title": "Mexico's finance minister isn't worried about a 'plan B' for NAFTA", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.028, "site_type": "news", "published": "2018-01-24T16:01:00.000+02:00", "replies_count": 0, "uuid": "b0740fa50780bdf0b3920318185bbeb2d6cb9583"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/24/mexicos-finance-minister-isnt-worried-about-a-plan-b-for-nafta.html", "ord_in_thread": 0, "title": "Mexico's finance minister isn't worried about a 'plan B' for NAFTA", "locations": [], "entities": {"persons": [{"name": "jose antonio anaya", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "anaya", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "nafta mexico", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Davos - World Economic Forum Mexico's finance minister isn't worried about a 'plan B' for NAFTA \"Our central scenario is that this will go to a good deal,\" Anaya said while at the World Economic Forum at Davos. \"We believe trade is good for all three nations, and that's what we're hoping for.\" SHARES Chris Wattie | Reuters Mexico's Economy Minister Ildefonso Guajardo (L-R), Canada's Foreign Minister Chrystia Freeland and U.S. Trade Representative Robert Lighthizer arrive for a trilateral meeting during the third round of NAFTA talks involving the United States, Mexico and Canada in Ottawa, Ontario, Canada, September 27, 2017. \nMexico's Finance Minister Jose Antonio Anaya appeared confident in the future of the North American Free Trade Agreement (NAFTA), telling CNBC Wednesday that dialogue between the trade partners was ongoing. \n\"Our central scenario is that this will go to a good deal,\" Anaya said while at the World Economic Forum at Davos. \"We believe trade is good for all three nations, and that's what we're hoping for.\" \nAsked about a potential \"plan B\" if the U.S. chooses to terminate the deal, Anaya stuck to a positive note, avoiding any doomsday scenarios. \nAnaya's Davos appearance coincides with the sixth and penultimate round of NAFTA negotiations currently underway in Montreal, Canada. \nThe 24-year-old agreement is now in jeopardy unless Canada and Mexico satisfy U.S. demands for changes to the deal. President Donald Trump maligned NAFTA during his presidential campaign, claiming it hurt American jobs, and threatened to abandon it altogether if his administration's needs are not met. \nNAFTA, which eliminated tariffs across territory encompassing 450 million people, has been a lifeline for Mexican jobs. Asked about the likelihood of a U.S. pullout, Anaya was vague. \n\"It's hard to say, but … What we can say about the NAFTA negotiations is that there's dialogue and there's a process,\" he said. Anaya took up the ministerial position in late 2017, after two years at the helm of state-owned oil company Pemex. \nHe echoed Canadian Finance Minister Bill Morneau , who spoke to CNBC earlier in the week, expressing confidence in the agreement's preservation. \n\"Let us work on plan A,\" Anaya said. \"Plan A is that NAFTA has been good for Mexico, good for the United States, and good for Canada. That's the way we see it, and we're going to continue to work on a new version that is also good for all of us.\" \n\"We want to keep it as a trilateral deal, and we've always worked on that front,\" the minister continued. \"The dialogue is going on, and that's what we should bet on.\" \nSince the deal's signing in 1994, U.S. foreign direct investment (FDI) into Mexico has increased from $15 billion to more than $100 billion, and regional trade has expanded from $290 billion to $1.1 trillion. Some 14 million American jobs depend on trade with Mexico and Canada, according to the U.S. Chamber of Commerce. \nDisagreements persist over the negative impact of the trade pact on the American economy. Washington D.C.-based think tank Public Citizen has reported the deal led to the loss of up to 1 million U.S. jobs and a $181 billion trade deficit with Mexico and Canada. \nThe bulk of U.S. jobs lost were in former manufacturing hubs like Michigan and Texas, states that went to Trump in the 2016 election. \nFollow CNBC International on Twitter and Facebook .", "external_links": ["https://www.facebook.com/cnbcinternational", "https://twitter.com/cnbci"], "published": "2018-01-24T16:01:00.000+02:00", "crawled": "2018-01-24T15:10:22.007+02:00", "highlightTitle": ""}