{"organizations": [], "uuid": "5a37feae1b381f6709e6b40c6df24fc8e7294639", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220230216&w=1200&r=LYNXMPEE070K5", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-rbs-trader-fine/britains-financial-watchdog-fines-and-bans-former-rbs-trader-idUKKBN1EX0TZ", "country": "US", "domain_rank": 408, "title": "Britain's financial watchdog fines and bans former RBS trader", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T12:26:00.000+02:00", "replies_count": 0, "uuid": "5a37feae1b381f6709e6b40c6df24fc8e7294639"}, "author": "", "url": "https://uk.reuters.com/article/uk-rbs-trader-fine/britains-financial-watchdog-fines-and-bans-former-rbs-trader-idUKKBN1EX0TZ", "ord_in_thread": 0, "title": "Britain's financial watchdog fines and bans former RBS trader", "locations": [], "entities": {"persons": [{"name": "reuters/chris helgren", "sentiment": "none"}, {"name": "neil danziger", "sentiment": "none"}, {"name": "emma rumney", "sentiment": "none"}, {"name": "danziger", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "canary wharf", "sentiment": "none"}], "organizations": [{"name": "rbs", "sentiment": "negative"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "the financial conduct authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 10:26 AM / Updated an hour ago UK financial watchdog bans, fines ex-RBS Libor trader Emma Rumney , Kirstin Ridley 4 Min Read \nLONDON (Reuters) - Britain’s financial watchdog fined ex-Royal Bank of Scotland ( RBS.L ) trader Neil Danziger 250,000 pounds ($338,000) on Monday and barred him from working in financial services. FILE PHOTO: The logo of the new Financial Conduct Authority (FCA) is seen at the agency's headquarters in the Canary Wharf business district of London April 1, 2013. REUTERS/Chris Helgren \nThe Financial Conduct Authority (FCA) said in a statement it had found that between 2007 and 2010 Danziger, who traded products referenced to the Japanese Yen variant of Libor (London Interbank Offered Rate), was knowingly involved in the bank’s manipulation of the benchmark rate. \nDanziger disputes the FCA’s findings and feels he is being “scapegoated for the systemic problems related to Libor”, his lawyer, Ben Rose, a partner at law firm Hickman and Rose, said. \nHowever, the ex-trader is too emotionally and financially drained to fight further, Rose said in a statement, adding: “He leaves it to others, better resourced, to press the FCA for answers, hopeful that, one day, the real truth will come out.” \nDanziger was dismissed over Libor-rigging at the end of 2011, after just over nine years with RBS, which was fined 390 million pounds by UK and U.S. authorities for its part in the global scandal that engulfed some of the world’s biggest banks. \n“Mr Danziger’s reckless disregard of these standards (of market conduct) has no place in the financial services industry,” Mark Steward, executive director of enforcement and market oversight at the FCA, said. \nLibor underpins hundreds of trillions of dollars of transactions and is used to set rates on credit cards, student loans and mortgages. \n‘WASH TRADES’ \nThe FCA said Danziger had routinely made requests to RBS’s primary Libor submitters to benefit his trading positions, and took those positions into account when acting as a substitute submitter. On two occasions, it said, he enlisted help from brokers to manipulate Libor. \nBetween 2008 and 2009, the watchdog said he entered into 28 “wash trades”, two identical trades that cancel each other out. \nThe trades had no legitimate purpose other than to pay two broker firms as thanks for personal hospitality Danziger had received, the FCA said in its statement. \nDanziger has denied that the trades and hospitality were connected. \nIn a notice of its decision on Danziger, the FCA detailed a phone call that one broker made to a colleague of Danziger’s at RBS on June 26, 2009. \nThe broker said he had been out with Danziger the previous evening, and asked whether Danziger was in the office. He “owes me a little switchy today”, the broker is alleged to have said. \nThe FCA said that in a separate phone call with another individual on the same day, the broker said he had run up a 2,000 pound drinks bill that evening and that Danziger had told him to “put a switch through”. \nThe FCA said ‘switch’ was a term used for wash trade, and that Danziger executed one later that day. \nThe regulator first proposed action against Danziger in 2014, but this was put on hold due to a then ongoing investigation by the Serious Fraud Office. Reporting by Emma Rumney and Kirstin Ridley; Editing by Keith Weir and Alexander Smith", "external_links": [], "published": "2018-01-08T12:26:00.000+02:00", "crawled": "2018-01-08T12:48:53.013+02:00", "highlightTitle": ""}