{"organizations": [], "uuid": "937f995238c67064687a1f573469c097981ae58d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-lockheed-martin-appoints-key-communications-leaders.html", "country": "US", "domain_rank": 767, "title": "Lockheed Martin Appoints Key Communications Leaders", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T17:05:00.000+02:00", "replies_count": 0, "uuid": "937f995238c67064687a1f573469c097981ae58d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-lockheed-martin-appoints-key-communications-leaders.html", "ord_in_thread": 0, "title": "Lockheed Martin Appoints Key Communications Leaders", "locations": [], "entities": {"persons": [{"name": "bill phelps", "sentiment": "negative"}, {"name": "jennifer whitlow", "sentiment": "none"}, {"name": "nettie johnson", "sentiment": "none"}, {"name": "sohn", "sentiment": "none"}, {"name": "phelps", "sentiment": "none"}, {"name": "adam sohn", "sentiment": "none"}, {"name": "andrea greenan", "sentiment": "none"}], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "bethesda", "sentiment": "none"}], "organizations": [{"name": "lockheed martin", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "corporate communications for altria", "sentiment": "none"}, {"name": "lockheed martin space communications", "sentiment": "none"}, {"name": "philip morris usa", "sentiment": "none"}, {"name": "internal communications", "sentiment": "none"}, {"name": "external communications", "sentiment": "none"}, {"name": "phelps", "sentiment": "none"}, {"name": "lockheed martin communications", "sentiment": "none"}, {"name": "worldwide media relations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BETHESDA, Md., Jan. 24, 2018 /PRNewswire/ -- Lockheed Martin (NYSE: LMT) appointed Bill Phelps as vice president, External Communications, and Adam Sohn as vice president, Lockheed Martin Space Communications. Both report to Jennifer Whitlow, senior vice president, Lockheed Martin Communications.\nPhelps succeeds Nettie Johnson who will retire from Lockheed Martin January 31, and Sohn succeeds Andrea Greenan, who was recently named vice president, Internal Communications.\nPhelps has more than 20 years of experience in corporate communications, public relations and journalism. In his new role, he will lead the corporation's media relations, marketing communications, social media and visual communications functions. He joined Lockheed Martin in 2016 as director, Worldwide Media Relations, serving as the primary spokesperson for the corporation and leading the team responsible for external media engagements. Prior to Lockheed Martin, he was director of Corporate Communications for Altria, which owns some of the nation's largest tobacco companies, including Philip Morris USA. There, he led the media relations, online, internal communications and corporate marketing teams, supporting issues related to the company and its products, including Marlboro. He was also an account supervisor at Siddall, an advertising and public relations firm, and served several years as a television news producer at the NBC affiliate in Richmond, Virginia. Phelps holds a bachelor's degree in Communications from the University of Richmond and a master's degree in Business Administration from the Darden School of Business at the University of Virginia.\nSohn brings more than 20 years of demonstrated success as a communications leader in technology and politics to his new role. As vice president, Space Communications, he is responsible for integrated communications in support of the Lockheed Martin Space business, including employee engagement, community relations, marketing, social media and media relations. Previously, he was director of Strategic Communications at Amazon's devices and services business, where he led a team responsible for global communications strategy, thought leadership and issues management for products including Echo and Alexa, Fire TV, Fire Tablets and Kindle. Prior to joining Amazon, Sohn held a number of communications leadership roles at Microsoft where he was responsible for corporate brand reputation management, as well as, the launch and sustainment of key products such as the Bing search service and Windows. Early in his career he worked in policy, communications and technology for President Clinton's campaigns, the 1996 Presidential Inaugural Committee, and the Democratic National Committee. Sohn holds a bachelor's degree in Political Science from Swarthmore College.\nFor additional information, visit our website: www.lockheedmartin.com .\nAbout Lockheed Martin\nHeadquartered in Bethesda, Maryland, Lockheed Martin is a global security and aerospace company that employs approximately 97,000 people worldwide and is principally engaged in the research, design, development, manufacture, integration and sustainment of advanced technology systems, products and services.\nView original content with multimedia: http://www.prnewswire.com/news-releases/lockheed-martin-appoints-key-communications-leaders-300587445.html\nSOURCE Lockheed Martin", "external_links": ["http://www.lockheedmartin.com/", "http://www.prnewswire.com/news-releases/lockheed-martin-appoints-key-communications-leaders-300587445.html"], "published": "2018-01-24T17:05:00.000+02:00", "crawled": "2018-01-24T19:15:50.016+02:00", "highlightTitle": ""}