{"organizations": [], "uuid": "fae713b600e9f15afc3b76ad7266549679ca768b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/eu-qualcomm/update-1-qualcomm-set-to-be-fined-by-eu-antitrust-regulators-ft-idUSL4N1PI5Q3", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Qualcomm fine from EU antitrust regulators expected Wednesday - source", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T05:02:00.000+02:00", "replies_count": 0, "uuid": "fae713b600e9f15afc3b76ad7266549679ca768b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eu-qualcomm/update-1-qualcomm-set-to-be-fined-by-eu-antitrust-regulators-ft-idUSL4N1PI5Q3", "ord_in_thread": 0, "title": "UPDATE 2-Qualcomm fine from EU antitrust regulators expected Wednesday - source", "locations": [], "entities": {"persons": [], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "qualcomm", "sentiment": "none"}, {"name": "broadcom ltd", "sentiment": "none"}, {"name": "qualcomm inc", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "broadcom", "sentiment": "none"}, {"name": "u.s. federal trade commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts story with new source, adds detail about legal complaints)\nJan 23 (Reuters) - EU antitrust regulators are expected to impose a multi-million euro fine on Qualcomm Inc on Wednesday for paying Apple Inc to use only its chips, according to a person familiar with the matter.\nThe European Commission in 2015 accused the company of the anti-competitive behavior. The fine could in theory go as high as 10 percent of Qualcomm’s annual revenue, which was $22.2 billion for its most recent fiscal year.\nApple and Qualcomm are engaged in a wide-ranging legal battle over Qualcomm’s business practices, which started a year ago with Apple suing Qualcomm for nearly $1 billion in patent royalty rebates that the chipmaker allegedly withheld from the phone maker.\nOther regulators including the U.S. Federal Trade Commission are investigating Qualcomm’s dealings with Apple, and the decision may make Qualcomm more vulnerable to chip maker Broadcom Ltd’s $103 billion hostile bid for it. Broadcom argues it will smooth rocky relations with customers such as Apple.\nEurope’s antitrust regulators are pursuing two proceedings against Qualcomm, with the second expected in coming months, the person familiar with the matter said.\nIn 2015, European regulators lodged a statement of objections against Qualcomm that it had made payments to “a major smartphone and tablet manufacturer” in exchange for the smartphone maker exclusively using its baseband chipsets, which connect mobile devices to wireless data networks. Apple is the customer, this person said.\nThe Financial Times earlier on Tuesday reported the expected decision, which covers Qualcomm's behavior from 2011 to 2016. ( on.ft.com/2DAGjeY )\nIn filings in a U.S. federal court case against one another, Apple and Qualcomm gave dueling descriptions of a so-called “transition agreement” signed by the two companies in 2011.\nApple alleged Qualcomm gave it a discount on royalty payments in exchange for exclusively using Qualcomm’s so-called modem chips.\nQualcomm alleged that Apple demanded the discount as an “incentive” to do business with Qualcomm.\nIn a separate lawsuit filed in January 2017 by the U.S. Federal Trade Commission against Qualcomm, regulators alleged that Qualcomm’s agreement was a “de facto” exclusivity arrangement that violated antitrust rules. The FTC said the chipmaker could cut off Apple’s incentive payments and even require a refund of past payments if Apple tapped a different supplier.\nQualcomm has denied the FTC’s allegations.\nThe European Commission declined to comment. Apple declined to comment beyond its previous position on Qualcomm’s practices. (Reporting by Aishwarya Venugopal in Bengaluru, Foo Yun Chee in Brussels and Stephen Nellis in San Francisco; Editing by Sai Sachin Ravikumar and Cynthia Osterman)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://on.ft.com/2DAGjeY"], "published": "2018-01-24T05:02:00.000+02:00", "crawled": "2018-01-24T15:49:28.001+02:00", "highlightTitle": ""}