{"organizations": [], "uuid": "0d4b2fc3571969db3a2cf08a3bc8f24422601b0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/12/104769645-GettyImages-860569322.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/regulators-reject-rick-perrys-plan-to-prop-up-coal-and-nuclear-plants.html", "country": "US", "domain_rank": 767, "title": "Regulators reject Rick Perry's plan to prop up coal and nuclear plants", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.657, "site_type": "news", "published": "2018-01-08T23:21:00.000+02:00", "replies_count": 0, "uuid": "0d4b2fc3571969db3a2cf08a3bc8f24422601b0f"}, "author": "Tom Dichristopher", "url": "https://www.cnbc.com/2018/01/08/regulators-reject-rick-perrys-plan-to-prop-up-coal-and-nuclear-plants.html", "ord_in_thread": 0, "title": "Regulators reject Rick Perry's plan to prop up coal and nuclear plants", "locations": [], "entities": {"persons": [{"name": "rick perry", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "capitol hill", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "house energy and commerce comm", "sentiment": "negative"}, {"name": "federal energy regulatory commission", "sentiment": "none"}, {"name": "ferc", "sentiment": "none"}, {"name": "department of energy", "sentiment": "none"}, {"name": "energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Getty Images Secretary of Energy Rick Perry testifies during a House Energy and Commerce Committee hearing on Capitol Hill, October 12, 2017 in Washington, DC. \nFederal regulators on Monday rejected a rule proposed by Energy Secretary Rick Perry that would have subsidized coal and nuclear power plants in some parts of the United States. \nHowever, the Federal Energy Regulatory Commission kept the issue alive by ordering the organizations that operate regional grids and power markets to submit reports to the commission on grid resilience issues in their areas. \nIn a statement, FERC said \"we appreciate the Secretary reinforcing the resilience of the bulk power system as an important issue that warrants further attention.\" \nThe decision is a setback to President Donald Trump 's efforts to prop up ailing coal-fired plants and nuclear power stations, as well as the mining industry. \nThe proposal, known as the Proposed Rule on Grid Reliability and Resilience Pricing , was immediately controversial when the Department of Energy first revealed it in September . It would require the regional markets that set electricity prices to compensate power plants that keep 90 days of fuel supplies on site. \nCoal and nuclear power plants typically fit that description. \nPerry said the rule was necessary to keep the U.S. electric grid resilient during events such as the 2014 Polar Vortex, when disruptions to natural gas supplies during extreme cold contributed to power outages. Coal and nuclear power plants in danger of closing need to be kept online and deserved to be rewarded for the reliability they bring to the grid, he argued. \nPerry also directed FERC to rule on the proposal on an expedited basis, citing concerns about the integrity of the grid. FERC is an independent government agency that regulates interstate transport of oil and natural gas and electric power transmission. \nBut opposition swelled among environmentalists, regional transmission organizations, and the oil, natural gas and renewable energy industries. They argued that power outages due to fuel disruptions are extremely rare and Perry's rule would distort prices in competitive power markets, which were designed to lower costs. \nThey also said there was no reason to rush the process since the Energy Department and North American Electric Reliability Corporation have determined there is no imminent threat to the U.S. power grid. FERC's decision \nIn its decision, FERC said the Energy Department failed to demonstrate that current electric power tariffs are \"unjust, unreasonable, unduly discriminatory or preferential\" and that its proposed rule would remedy those shortfalls. As a result, there is no justification to require regional transmission organizations to implement changes to tariffs. \n\"While some commenters allege grid resilience or reliability issues due to potential retirements of particular resources, we find that these assertions do not demonstrate the unjustness or unreasonableness of the existing RTO/ISO tariffs,\" FERC said, referring to regional transmission organizations and independent system operators. \n\"In addition, the extensive comments submitted by the RTOs/ISOs do not point to any past or planned generator retirements that may be a threat to grid resilience,\" it added. \nFERC also noted it approved measures taken by two regional transmission organizations, ISO New England and PJM Interconnection, following the Polar Vortex that addressed fuel supply issues and contributed to the resiliency of the grid. \nHowever, FERC said further investigation of grid resilience issues is warranted. It opened a new proceeding that requires regional organizations to submit information about resilience in their regions within 60 days. \nThe commission's decision to essentially kick the issue back to regional power markets was widely anticipated. Power market analysts noted from the outset that FERC typically seeks proposals for major changes from these organizations rather than devising them itself. \nPJM Interconnection, the organization that operates the grid in 13 Eastern and Midwestern states and Washington DC, has proposed power market changes that would value the reliability that baseload power generation from coal and nuclear power plants provide. ", "external_links": [], "published": "2018-01-08T23:21:00.000+02:00", "crawled": "2018-01-08T23:22:28.025+02:00", "highlightTitle": ""}