{"organizations": [], "uuid": "a5e2ceb1fac295afc228ea936b87c0160d7e1ef9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 207, "shares": 207, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219532245&w=1200&r=LYNXMPEE040DH", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-usa-turkey/turkeys-erdogan-says-bilateral-legal-accords-with-u-s-losing-validity-idUSKBN1EU0MC", "country": "US", "domain_rank": 408, "title": "Turkey's Erdogan says bilateral legal accords with U.S. losing validity", "performance_score": 2, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T09:22:00.000+02:00", "replies_count": 0, "uuid": "a5e2ceb1fac295afc228ea936b87c0160d7e1ef9"}, "author": "", "url": "https://www.reuters.com/article/us-usa-turkey/turkeys-erdogan-says-bilateral-legal-accords-with-u-s-losing-validity-idUSKBN1EU0MC", "ord_in_thread": 0, "title": "Turkey's Erdogan says bilateral legal accords with U.S. losing validity", "locations": [], "entities": {"persons": [{"name": "erdogan", "sentiment": "negative"}, {"name": "tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "istanbul", "sentiment": "none"}, {"name": "halkbank", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISTANBUL (Reuters) - Tayyip Erdogan denounced U.S. justice on Friday and suggested Turkey could rethink some bilateral agreements with Washington, after a U.S. court convicted a Turkish banker in a trial that included testimony of corruption by top Turkish officials.\nIn his first public comments on Wednesday’s verdict, the Turkish president cast the case as American plot to undermine Turkey’s government and economy - an argument likely to resonate with nationalist supporters.\n“If this is the U.S. understanding of justice, then the world is doomed,” Erdogan told a news conference before his departure to France for an official visit.\nA U.S. jury convicted an executive of Turkey’s majority state-owned Halkbank ( HALKB.IS ) of evading Iran sanctions, at the close of the trial which has strained relations between the NATO allies. Some of the court testimony implicated senior Turkish officials, including Erdogan. Ankara has said the case was based on fabricated evidence.\nWithout being specific, Erdogan said the case put agreements between the two countries into jeopardy: “....The bilateral accords between us are losing their validity. I am saddened to say this, but this is how it will be from now on.”\nTurkey’s foreign ministry on Thursday condemned the conviction as unprecedented meddling in its internal affairs. The row has unnerved investors and weighed on the lira currency, which hit a series of record lows last year.\nSlideshow (2 Images) The court case has put pressure on relations between Washington and the biggest Muslim country in NATO, already strained since a 2016 failed coup in Turkey which Erdogan blames on followers of a cleric who lives in the United States.\nOnly last week the United States and Turkey lifted all visa restrictions against each other, ending a months-long visa dispute that began when Washington suspended visa services at its Turkish missions after two local employees of the U.S. consulate were detained on suspicion of links to the coup.\nThe Halkbank executive, Mehmet Hakan Atilla, was convicted on five of six counts, including bank fraud and conspiracy to violate U.S. sanctions law. The case was based on the testimony of a wealthy Turkish-Iranian gold trader, Reza Zarrab, who cooperated with prosecutors and pleaded guilty to charges of leading a scheme to evade U.S. sanctions against Iran.\nIn his testimony Zarrab implicated top Turkish politicians, including Erdogan. Zarrab said Erdogan, then prime minister, had personally authorised two Turkish banks to join the scheme.\nTurkey says the case was based on fabricated evidence and has accused U.S. court officials of ties to the cleric Turkey blames for the coup attempt. The bank has denied any wrongdoing and said its transactions were in line with local and international regulations.\n“The United States is carrying out ... a chain of plots, and these are not just legal but also economic plots,” Erdogan said.\nReporting by Daren Butler and Tuvan Gumrukcu; Editing by David Dolan and Peter Graff\n ", "external_links": [], "published": "2018-01-05T09:22:00.000+02:00", "crawled": "2018-01-05T09:40:30.002+02:00", "highlightTitle": ""}