{"organizations": [], "uuid": "458511d1087c412b9c39abbea53f178b1beaffbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-global-lng/asia-spot-prices-climb-to-three-year-high-on-winter-demand-idUSKBN1F825V", "country": "US", "domain_rank": 408, "title": "Asia spot prices climb to three-year high on winter demand", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.934, "site_type": "news", "published": "2018-01-20T01:16:00.000+02:00", "replies_count": 0, "uuid": "458511d1087c412b9c39abbea53f178b1beaffbf"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-lng/asia-spot-prices-climb-to-three-year-high-on-winter-demand-idUSKBN1F825V", "ord_in_thread": 0, "title": "Asia spot prices climb to three-year high on winter demand", "locations": [], "entities": {"persons": [{"name": "emma richards", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "positive"}, {"name": "bmi research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE (Reuters) - Asian spot prices for liquefied natural gas (LNG) hit their highest in more than three years this week, with traders in Asia and Europe flagging temperatures in northern Asia are set to dip further as production outages curb supply.\nThe cold wave in northern Asia - by far the world’s biggest LNG-consuming region - has also opened up arbitrage opportunities for traders, attracting several LNG tankers from the United States, shipping data from Reuters showed.\nSpot prices climbed to $11.70 per million British thermal units (mmBtu), according to LNG traders in Asia and Europe. Several February cargoes were sold this week in the $11.50 to $11.80 per mmBtu range, traders said, including to Japan and China.\nMarch spot LNG prices traded in the $10 per mmBtu range. Some March bids were reported at $10 per mmBtu.\n“Given the spike up in Asian prices over winter - largely due to China - arbitrage is probably looking quite attractive and that is what has been pulling cargoes west to east,” said Emma Richards, senior oil and gas analyst at BMI Research.\nAsian spot markets are not only at their highest since November, 2014, but they have also been above oil-linked LNG prices since the beginning of last December - a sign the market is unusually tight.\nMost of Asian LNG is supplied under fixed monthly volumes priced under a link to crude oil.\nWhen spot LNG becomes more expensive than this oil-indexed gas - which currently costs around $8.50 per mmBtu - traders say it points to a market that has become so tight that buyers are willing to pay more than usual to secure supplies.\nAs well as cold weather, the current tightness is partly due to a massive gasification program in China under which millions of households are being switched from using coal to natural gas for heating.\nAlthough demand is expected to taper within weeks, with winter drawing to a close and the Chinese New Year holiday approaching, traders said a last bout of strong buying was now under way amid a cold snap that is expected to see unusually cold weather - Beijing, Seoul and Tokyo are all expected to see temperatures plummet by mid-next week.\nIn preparation, utilities across the region have ordered extra cargoes in the spot market, especially from the United States, to meet demand and stock up inventories.\nShipping data on Thomson Reuters Eikon shows at least six tankers currently crossing the Pacific from the United States. Tankers are also coming in from Peru and Trinidad and Tobago.\nFurthermore, Egypt Natural Gas Holding Company (EGAS) is preparing to launch a tender to buy liquefied natural gas (LNG) supplies for the second quarter of 2018, according to an EGAS company source and trade sources.\nProduction curbs at Malaysia’s Bintulu production complex, operated by state-run Petronas, and Angola LNG are also boosting prices, said one Singapore-based LNG trader.\nResponding to shortfalls, Petronas purchased a spot cargo loading on Feb. 4 from Australia’s AP LNG plant to replace lost output, paying an estimated price in the high $11 per mmBtu range.\n“The volumes from U.S. are mainly to fill Chinese demand. Cheniere has snapped up all available tankers in the Atlantic,” the trader said.\nGail India awarded a spot cargo purchase tender for a cargo to be delivered from Feb. 5-15, though it was not possible to confirm the identity of the supplier.\nReporting by Jessica Jaganathan; Additional reporting by Oleg Vukmanovic; Editing by Kenneth Maxwell and Adrian Croft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T01:16:00.000+02:00", "crawled": "2018-01-20T17:41:18.004+02:00", "highlightTitle": ""}