{"organizations": [], "uuid": "8cdcdd0db3f5eb0bb43823376a374b6a4541ca45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-alcoa-corporation-reports-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Alcoa Corporation Reports Fourth Quarter and Full-Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:10:00.000+02:00", "replies_count": 0, "uuid": "8cdcdd0db3f5eb0bb43823376a374b6a4541ca45"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-alcoa-corporation-reports-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Alcoa Corporation Reports Fourth Quarter and Full-Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "alcoa corporation reports fourth quarter", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Alumina and aluminum pricing drive revenue growth, cash climbs to $1.36 billion\nFourth Quarter 2017\nNet loss of $196 million, or $1.06 per share, includes the financial impacts of previously announced actions taken in line with the Company’s strategic priorities Excluding special items, adjusted net income of $195 million, or $1.04 per share, up 44 percent sequentially $775 million of adjusted earnings before interest, taxes, depreciation and amortization (EBITDA) excluding special items, up 38 percent sequentially, on higher alumina pricing $3.2 billion revenue, up 7 percent sequentially, driven mostly by improved alumina pricing $1.36 billion cash balance and $1.41 billion of debt, for net debt of $0.05 billion, as of December 31, 2017\nFull Year 2017\nFull-year 2017 net income of $217 million, or $1.16 per share and adjusted net income of $563 million, or $3.01 per share Adjusted EBITDA excluding special items of $2.35 billion, more than double full-year 2016 $11.7 billion revenue, up 25 percent from 2016, on higher alumina and aluminum pricing $1.2 billion cash from operations; $0.8 billion free cash flow Company announces freeze of U.S. and Canada salaried defined benefit pension plans, effective January 1, 2021 Continuing progress on strategic priorities to reduce complexity, drive returns and strengthen the balance sheet\nPITTSBURGH--(BUSINESS WIRE)-- Alcoa Corporation (NYSE: AA), a global leader in bauxite, alumina and aluminum products, today reported fourth quarter and full-year 2017 results.\nM, except per share amounts 4Q16 1\n3Q17 4Q17 FY16 1\nFY17 Revenue $2,537 $2,964 $3,174 $9,318 $11,652 Net (loss) income attributable to Alcoa Corporation $(125 ) $113 $(196 ) $(400 ) $217 Earnings per share attributable to Alcoa Corporation $(0.68 ) $0.60 $(1.06 ) $(2.19 ) $1.16 Adjusted net income (loss) $26 $135 $195 $(227 ) $563 Adjusted earnings per share $0.14 $0.72 $1.04 $(1.24 ) $3.01 Adjusted EBITDA excluding special items $335 $561 $775 $1,108 $2,352 The quarter and the full-year reflect ongoing strength in alumina and aluminum pricing as management continued to execute on its strategic priorities to reduce complexity, drive returns and strengthen the balance sheet.\nThe Company closed the year with $1.36 billion cash, up $239 million sequentially and $505 million year-over-year.\nBased on January 2018 market assumptions 2 , Alcoa is projecting full-year 2018 adjusted EBITDA, excluding special items, to range between $2.6 billion and $2.8 billion.\n“Solid market fundamentals allowed us to deliver our strongest adjusted EBITDA quarter since our launch as an independent, publicly-traded company,” said Roy Harvey, President and Chief Executive Officer. “With a series of operating and asset decisions, we also purposefully delivered against our strategic priorities. Our first full year has been truly remarkable. By continuously focusing on our strategic priorities, and supported by favorable markets, we’ve been able to accelerate our plan to strengthen Alcoa’s foundation for an even brighter tomorrow. As we enter 2018, we will continue to execute on our objectives and look forward to delivering more in the new year.”\nHarvey also announced new actions: “In our continuous drive to strengthen the balance sheet, today we informed salaried employees in the United States and Canada of upcoming changes to their retirement benefits. The decisions were difficult and affect current employees who have been part of our Alcoa family the longest. But to reduce our liabilities, change is necessary; it will enable us to better prepare for an uncertain and cyclical environment as we position our Company for the future.”\nFourth Quarter 2017 Results\nIn fourth quarter 2017, Alcoa reported a net loss of $196 million, or $1.06 per share, compared to net income of $113 million, or $0.60 per share, in third quarter 2017. The 2017 fourth quarter results include $391 million of special items primarily due to previously announced actions relating to the Rockdale Operations and the Portovesme smelter that are aligned with the Company’s strategic priorities to streamline and strengthen Alcoa.\n1\nAlcoa Corporation became an independent, publicly-traded company on November 1, 2016. Prior to November 1, 2016, Alcoa Corporation’s financial statements were prepared on a carve-out basis, as the underlying operations of the Company were previously consolidated as part of Alcoa Corporation’s former parent company’s financial statements. Accordingly, the financial results of Alcoa Corporation for the first ten months of 2016 (including the first month of fourth quarter 2016) were prepared on such basis. The carve-out financial statements of Alcoa Corporation are not necessarily indicative of Alcoa Corporation’s consolidated results of operations, financial position, and cash flows had it been a standalone company during the referenced period. See the Consolidated Financial Statements included in the Company’s Annual Report on Form 10-K for the year ended December 31, 2016 filed with the United States Securities and Exchange Commission on March 15, 2017 for additional information.\n2\nBased on unpriced sales at $2,200 LME and $390 API, and updated regional premiums and foreign currencies.\nOther special items included charges for income tax valuation allowance and tax rate change adjustments, as well as certain impacts from new U.S. income tax legislation (see U.S. Tax Cuts and Jobs Act of 2017 below), and costs for the partial restart of the Warrick smelter in Indiana. These items were slightly offset by the reduction in a previously established reserve due to the settlement of an Italian energy tariff dispute .\nExcluding the impact of special items, fourth quarter 2017 adjusted net income was $195 million, or $1.04 per share, up 44 percent sequentially from $135 million, or $0.72 per share. Adjusted EBITDA excluding special items rose 38 percent to $775 million in fourth quarter 2017 from $561 million in third quarter 2017. The improvement was primarily driven by increased pricing for both alumina and aluminum, somewhat offset by higher energy costs.\nAlcoa reported fourth quarter 2017 revenue of $3.2 billion, up 7 percent sequentially, largely due to improved alumina and aluminum prices and increased alumina shipments.\nCash from operations in fourth quarter 2017 was $455 million and free cash flow was $305 million. Cash used for financing activities and investing activities was $53 million and $170 million, respectively, in the fourth quarter of 2017.\nAlcoa ended fourth quarter 2017 with cash on hand of $1.36 billion with $1.41 billion of debt, for net debt of $0.05 billion. The Company reported 11 days working capital, a 3-day improvement year-over-year.\n2017 Full-Year Results\nFor full year 2017, Alcoa reported net income of $217 million, or $1.16 per share, compared to a $400 million net loss, or $2.19 per share, for full-year 2016. Excluding special items, the Company reported adjusted net income of $563 million, or $3.01 per share, compared to a $227 million adjusted net loss, or $1.24 per share, in 2016.\nAdjusted EBITDA excluding special items was $2.35 billion (Company’s projection was approximately $2.4 billion 3 ), more than double the $1.11 billion earned in 2016. Strong alumina and aluminum pricing drove the increase, which was slightly offset by higher costs for energy and raw mater", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.alcoa.com%2Fnews-releases%2F2017%2F12-21-2017-212728352&esheet=51744589&newsitemid=20180117006355&lan=en-US&anchor=Rockdale+Operations+and+the+Portovesme+smelter&index=1&md5=9efb308973c605a064878cec6c33763c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.alcoa.com%2Fnews-releases%2F2017%2F12-21-2017-212728352&esheet=51744589&newsitemid=20180117006355&lan=en-US&anchor=Italian+energy+tariff+dispute&index=2&md5=14337e66ca482fe22c312dcdfb110e9f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.alcoa.com&esheet=51744589&newsitemid=20180117006355&lan=en-US&anchor=www.alcoa.com&index=4&md5=9be10316027e7915f6e7415c5e372f46", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.alcoa.com&esheet=51744589&newsitemid=20180117006355&lan=en-US&anchor=www.alcoa.com&index=3&md5=92db9b4a607831db0c63a862b9d80044", "http://www.businesswire.com/news/home/20180117006355/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.alcoa.com&esheet=51744589&newsitemid=20180117006355&lan=en-US&anchor=www.alcoa.com&index=5&md5=3b947b1b72e1d26ad7e25f53d7aced56"], "published": "2018-01-18T00:10:00.000+02:00", "crawled": "2018-01-18T00:35:26.003+02:00", "highlightTitle": ""}