{"organizations": [], "uuid": "3629dc492b5e821f0be417378ee8ab4a8c5c535a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970669-AP_18025832280021.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/26/trump-asked-the-guggenheim-for-a-van-gogh-the-museum-offered-a-gold-toilet.html", "country": "US", "domain_rank": 767, "title": "Trump asked the Guggenheim for a Van Gogh. The museum offered a gold toilet.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T18:24:00.000+02:00", "replies_count": 0, "uuid": "3629dc492b5e821f0be417378ee8ab4a8c5c535a"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/26/trump-asked-the-guggenheim-for-a-van-gogh-the-museum-offered-a-gold-toilet.html", "ord_in_thread": 0, "title": "Trump asked the Guggenheim for a Van Gogh. The museum offered a gold toilet.", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}, {"name": "van gogh", "sentiment": "neutral"}, {"name": "vincent van gogh", "sentiment": "none"}, {"name": "paul schwartzman", "sentiment": "none"}, {"name": "maurizio cattelan", "sentiment": "none"}, {"name": "cattelan", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "guggenheim", "sentiment": "none"}, {"name": "guggenheim museum", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "united state", "sentiment": "negative"}, {"name": "washington post", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Being the president of the United State offers a lot of perks — a button that summons Diet Cokes, for example. But want to hang some post-impressionist artwork from the Guggenheim in the White House living quarters? Well, not so fast.\nThe Washington Post's Paul Schwartzman reports that the first family asked the Guggenheim Museum in New York City to loan an 1888 Vincent Van Gogh, \"Landscape with Snow,\" to install in the White House. The museum's curator declined the request but came back with a counteroffer: How about a solid gold toilet?\n@Guggenheim tweet \nItalian artist Maurizio Cattelan created the piece, titled \"America.\" The artwork — which also happens to be a fully functional, flushing toilet — opened for public use in a fifth-floor restroom at the Guggenheim in September 2016.\nCattelan began contemplating the idea for \"America\" before Trump became a serious candidate for president, according to the New York Times, but the participatory sculpture pretty much screams Trump, given his affinity for gold plate, including in bathroom fixtures. The piece — which was cleaned every 15 minutes when it sat in the Guggenheim — had a democratic appeal, Cattelan told the New Yorker last year. \"Whatever you eat, a two-hundred-dollar lunch or a two-dollar hot dog, the results are the same, toilet-wise,\" he said.\nA curator for the Guggenheim, Nancy Spector, told the White House's Office of the Curator that the Van Gogh was en route to an exhibition in Spain, according to the Post.\nSo rather than suggest another painting from its collection, the museum proposed something quite different. \"Fortuitously,\" Spector wrote in an email obtained by the Post, \"America\" was available after being \"installed in one of our public restrooms for all to use in a wonderful act of generosity.\" The September 15 email also explained:\nThe artist \"would like to offer it to the White House for a long-term loan,\" wrote Spector, who has been critical of Trump. \"It is, of course, extremely valuable and somewhat fragile, but we would provide all the instructions for its installation and care.\"\nA spokesperson for the Guggenheim confirmed the authenticity of the email to the Post.\nPresidents often install artwork in the White House, sometimes on loan from museums or private collectors. According to the Smithsonian, the tradition began in the 1940s. The Obamas, notably, featured African-American, Hispanic, Asian, and female artists during their tenure. In February 2014, the Whitney Museum in New York loaned President Obama two Edward Hoppers, which hung in the Oval Office.\nThe artwork that the sitting president and his family choose to hang in the White House, like so many things, carries its own symbolism. The Obamas' choices of installing diverse artists, the Wall Street Journal noted in 2009, \"could serve as a savvy tool to drive the ongoing message of a more inclusive administration.\"\nThere hasn't been much reporting on what art Trump has hung on the White House walls, but we do know he installed in the Oval Office a portrait of Andrew Jackson, the populist president known for forcing Native Americans down the Trail of Tears.\nRead more from Vox:\nThe growing number of lawsuits against opioid companies, explained \nA lunar eclipse is coming January 31. Here's how to watch the moon turn blood red in the sky.\nYoung women reported Larry Nassar for decades. No one took them seriously — until now.", "external_links": [], "published": "2018-01-26T18:24:00.000+02:00", "crawled": "2018-01-26T20:08:08.003+02:00", "highlightTitle": ""}