{"organizations": [], "uuid": "f81249665d5662fc8502083f322bb0c8e833d822", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/britain-stocks/uk-stocks-flat-but-gamblers-stumble-on-govt-clampdown-worries-idUSL8N1PH21Z", "country": "US", "domain_rank": 408, "title": "UK stocks flat but gamblers stumble on govt clampdown worries", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-22T17:35:00.000+02:00", "replies_count": 0, "uuid": "f81249665d5662fc8502083f322bb0c8e833d822"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/britain-stocks/uk-stocks-flat-but-gamblers-stumble-on-govt-clampdown-worries-idUSL8N1PH21Z", "ord_in_thread": 0, "title": "UK stocks flat but gamblers stumble on govt clampdown worries", "locations": [], "entities": {"persons": [{"name": "paddy po", "sentiment": "none"}, {"name": "william hill", "sentiment": "none"}, {"name": "danilo masoni", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}], "organizations": [{"name": "shell", "sentiment": "none"}, {"name": "gvc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nmc health", "sentiment": "none"}, {"name": "ladbrokes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* FTSE 100 up 0.1 pct, mid caps inch lower\n* Bookmakers fall on fears of govt clampdown\n* Energy stocks provide support as crude gains\n* NMC Health hits new record after acquisitions\nBy Danilo Masoni\nMILAN, Jan 22 (Reuters) - British shares steadied on Monday, supported by gains in the energy sector, though double-digit falls in gambling companies on fears of a government clampdown weighed on that sector.\nShares in William Hill and Ladbrokes fell more than 12 percent after reports that the government was set to lower the limit on betting shop terminals to 2 pounds from 100 pounds in a move that could hit their revenue.\nTheir losses dragged the mid caps index down 0.1 percent by 0922 GMT, more than offsetting gains among energy stocks, which tracked gains in crude oil prices.\nOil majors BP and Shell rose 0.7 percent, helping the country’s main share index FTSE 100 edge up 0.1 percent. Stronger healthcare stocks also provided support.\nWilliam Hill and Ladbrokes, which is being bought by GVC for up to 4 billion pounds, both hit their lowest level in more than seven weeks, while Paddy Power on the FTSE fell 1.4 percent. GVC fell 4 percent.\nThe Sunday Times newspaper, citing an ally of new culture secretary Matt Hancock, reported that the betting cut was being taken to help tackle the issue of problem gambling.\nIn spite of the heavy losses, Investec analysts affirmed their buy rating on William Hill, saying a consultation over FOBTs (fixed odds betting terminals) only closes on Tuesday and that speculation over the final outcome was premature.\nAmong other outstanding movers were shares in Ocado , up more than 10 percent, after the online grocer signed a deal with Sobeys Inc to develop the online grocery business at Canada’s second largest food retailer.\nOn the FTSE, NMC Health rose 2.7 percent to a new record high after it announced the acquisition of majority stakes in a cosmetic surgery company and a clinics business for a combined $207 million.\nIn the same sector Shire also rose, up 2.9 percent.\nRelx, down 2.4 percent, was the biggest blue chip faller, following a downgrade to “equal-weight” from “overweight” from Morgan Stanley. (Reporting by Danilo Masoni; Editing by Gareth Jones)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T17:35:00.000+02:00", "crawled": "2018-01-23T17:54:07.015+02:00", "highlightTitle": ""}