{"organizations": [], "uuid": "1af3f78201c2820562e1b78c07b1e0316114065a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/19/104596614-GettyImages-490329518.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/11/4-ways-you-can-overcome-self-doubt-and-achieve-success.html", "country": "US", "domain_rank": 767, "title": "4 ways you can overcome self-doubt and achieve success", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T20:09:00.000+02:00", "replies_count": 0, "uuid": "1af3f78201c2820562e1b78c07b1e0316114065a"}, "author": "Ruth Umoh", "url": "https://www.cnbc.com/2018/01/11/4-ways-you-can-overcome-self-doubt-and-achieve-success.html", "ord_in_thread": 0, "title": "4 ways you can overcome self-doubt and achieve success", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "none"}, {"name": "adam grant", "sentiment": "none"}, {"name": "melinda gates", "sentiment": "none"}], "locations": [], "organizations": [{"name": "harvard", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you ever feel uncertain about your future, you're not alone. Some of the world's most brilliant minds also undergo moments of self-doubt, including Facebook's Mark Zuckerberg, philanthropist Melinda Gates and psychologist Adam Grant.\nIn a recent LinkedIn post , Melinda Gates writes that whenever you have voices in your heads telling you that you're not smart enough, that your success is due to luck instead of skill, or when you're unable to properly accept a compliment, you are experiencing the symptoms of \"impostor syndrome.\"\nImpostor syndrome can be defined as feeling inadequate despite proven accomplishments, constant self-doubt and a pervasive sense of fear that you'll be outed as an intellectual fraud.\nHere are five key steps you can take to overcome this negative sentiment:\n1. Recognize that everyone experiences self-doubt Facebook founder Mark Zuckerberg suffered from self-doubt a couple years into his business venture. In a 2017 Harvard commencement speech , the entrepreneur says that shortly after launching Facebook, companies were giving him offers to buy the company. Though he didn't want to sell he was also being pushed by those around him to do just that.\n\"After one tense argument, an advisor told me if I didn't agree to sell, I would regret the decision for the rest of my life,\" says Zuckerberg. This conflict tore the company apart and within a year everyone on the management team had left.\n\"I believed in what we were doing, but I felt alone,\" he says. \"I wondered if I was just wrong, an impostor, a 22-year-old kid who had no idea how the world worked.\"\nYears later, Zuckerberg is now worth $77.3 billion, according to the Bloomberg Billionaires Index , and the company is valued at over $500 billion .\n2. Reflect on past successes Melinda Gates notes that psychologist and author Adam Grant also suffers from impostor syndrome.\n\"Whenever he feels like he doesn't deserve to be giving big public talks, he thinks back to other times when he \"wanted to run screaming off the stage\" but ended up doing fine,\" she writes.\nBy reflecting on other obstacles that he has overcome, the psychologist is able to realize that \"even if I fail, my future self will be glad I didn't fail to try.\"\nLacy O'Toole | CNBC Melinda Gates 3. Remember you can always improve Gates gives a personal anecdote of when she had to take her first computer science class. The class dealt with processors, which she had no experience using, and utilized coding language, which she had never learned. Plus, she was one of the few women in the class.\nGates doubted whether she should be in the class and whether she had the knowledge needed. But then, she writes, it dawned on her that the ability to learn was the whole reason she was there.\n\"I couldn't silence the voices in my head telling me 'not good enough,' but I could amend them a little, to say 'I'm not good enough—yet , '\" she writes in her blog post. \"With that one change, that message stopped being devastating and started being motivating.\"\n4. Ask yourself where these feelings are stemming from Although self-doubt strikes all kinds of people, Gates points out that it's most prevalent among people who are underrepresented in their field. For example, when you're the only woman or person of color in the room, it can sometimes feel like you're in the \"wrong room,\" writes Gates.\nMaybe growing up, teachers were surprised that as a girl you were good at math. Or perhaps, college professors focused on male students in science-based classes.\nGates explains that when you've had a lifetime of subtle hints suggesting that you do not belong in a certain field, it becomes easier to internalize those feelings.\n\"Realizing that the voices in your head are actually messages from a society that's set up in an unfair way can help you shut those voices down,\" write Gates, \"and inspire you to prove them wrong.\"\nLike this story? Like CNBC Make It on Facebook \nSee also: \nMelinda Gates says this is the No. 1 thing we must do to find the next Bill Gates \nMillennials worldwide say these 3 things will have the greatest impact on their future success \nGene Simmons says you can become highly successful if you copy this trait from Warren Buffett \nshow chapters The plan for Bill and Melinda Gates' $1.7 billion investment in America's public education system      10:21 AM ET Mon, 30 Oct 2017 | 01:16", "external_links": [], "published": "2018-01-11T20:09:00.000+02:00", "crawled": "2018-01-11T21:03:23.032+02:00", "highlightTitle": ""}