{"organizations": [], "uuid": "239c1cbc78bff38c141f4d3ae7dc5008a7dbd246", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-highwire-public-relations-acquires-inner-circle-labs.html", "country": "US", "domain_rank": 767, "title": "Highwire Public Relations Acquires Inner Circle Labs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T19:30:00.000+02:00", "replies_count": 0, "uuid": "239c1cbc78bff38c141f4d3ae7dc5008a7dbd246"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-highwire-public-relations-acquires-inner-circle-labs.html", "ord_in_thread": 0, "title": "Highwire Public Relations Acquires Inner Circle Labs", "locations": [], "entities": {"persons": [{"name": "jonathan neri", "sentiment": "none"}, {"name": "julie", "sentiment": "none"}, {"name": "topsy", "sentiment": "none"}, {"name": "julie crabill", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "inner circle labs", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "inner circle l", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 03, 2018 (GLOBE NEWSWIRE) -- Highwire PR, a modern communications agency with roots in journalism and Silicon Valley, today acquired Inner Circle Labs , a full-service PR partner with a concentration on cutting-edge technologies in robotics, artificial intelligence, and connected consumer.\nFounded in 2010 by Julie Crabill and Jonathan Neri, Inner Circle Labs quickly staked a claim as a passion-driven agency with a knack for science and fresh take on communications. Early clients like Topsy (acquired by Apple) and Zite (acquired by CNN and Flipboard) set the standard for the future-making companies that define the client roster. With a strong focus on machine learning/AI, data, robotics, and connected consumer, Inner Circle Labs specializes in translating complex technologies into mainstream narratives. Known for creative campaigns that deliver meaningful business impact, they are master storytellers who provide marketing and branding counsel and create impactful events and experiences.\n“We have always had the utmost respect for Julie and the team at Inner Circle Labs. The agency is a natural fit for our culture, our clients, and our ambitions,” said Emily Borders, principal at Highwire PR. “As we start our tenth year in business, our goals are to be the best PR agency for technology clients and to deliver excellent work at scale. Welcoming Inner Circle Labs to Highwire amplifies the expertise, energy, and ideas that will benefit both our teams and our collective clients.”\nInner Circle Labs places an equal premium on team culture, training, and fun. Many of the Inner Circle Labs team have been with the agency for five years or more. The agency supports pro-bono accounts and routinely hosts industry and media events. And, the entire San Francisco PR and journalist community looks forward to Inner Circle Lab’s old-school game battle known as “Hacks vs Flacks,” which will continue at Highwire.\n“When we started Inner Circle Labs, we wanted to be both an incredible place to work, learn, and grow and a truly exceptional partner to cool companies,” said Julie Crabill, founder, Inner Circle Labs. “We saw this same ethos at Highwire and recognized the inherent benefits of greater scale in location and services. We are very excited to see what these teams can accomplish together.”\nHighwire ended 2017 with more than 20 percent growth in revenue and key client wins across all practice groups. With the addition of the Inner Circle Labs team, Highwire will start the year with nearly 100 employees across its offices in San Francisco, New York, Boston, and Chicago. Julie Crabill will become a strategic advisor to Highwire. In February, she will start her new role as Highwire client and CMO of Descartes Labs.\nTo learn more about Highwire, please visit www.highwirepr.com\nAbout Highwire PR\nHighwire is a modern public relations agency designed for disruptive companies. Our roots in journalism and Silicon Valley give us the drive, imagination and experience to create meaningful business results for our clients through smart communications programs. Highwire serves the spectrum of technology clients from consumer apps to cloud infrastructure, healthcare IT to security, as well as consumer from offices in San Francisco, New York, Boston and Chicago along with strong partnerships around the world. For more information, please visit www.highwirepr.com or @highwirepr.\nMedia Contact:\nMegan Grasty\nHighwire PR\nmegan@highwirepr.com\nSource: Highwire Public Relations", "external_links": ["https://www.globenewswire.com/Tracker?data=sv9vSrGc9-QBeOi4CH7WYMGCXLtq0nc-pW7-aQYR7-4gXQjQ6zBi5ZBy2KLNJAhozx4APdIm94GTgcqWJkRcReLwPBegPrFoGhuWh9n0Dtl0pRjIqa8cwLH8hxc-uavYu81saZ_mLztQVOSxRlrrPlimwekl2oGq9tHi3s1kr-E99_jthmGmFHh9898MwYLv", "https://www.globenewswire.com/Tracker?data=yLgHeRu3Yv6aY8qCndeIc3dmv9iJDzi6KWycWN7DOb6xpWDraOG2T0qxn3BBaEn9bkuapPQPpjLehvh3dnrJQahJXU_hLRC0VFZYrjAkZOA=", "https://www.globenewswire.com/Tracker?data=sv9vSrGc9-QBeOi4CH7WYIyBjVSXeX7wkq-KWkJEcKt1PDqOV5o-p1mwgx8hGzAoM6cCpAJwSCw-n9d1n0H1_Ckq08fe9QA9WFy1QxShrGFj3RVmPC8oAbAjOh3ocuzLzXg3t2FBF9yTkihB5odzhY6hmRWYMJ8N4dlU7e_PraQoDA7-OsSo8hp3kSgOfdoN", "https://www.globenewswire.com/Tracker?data=bDcY-_pGNUsR5peKOgxj_5-kxBzEIZKuOnPBugejA6tZ7yu0EPEKUFtig_3uFJM5Oj1nhXKrahx3rucn45GvwHdmpmD3zfL1nADrvMnfPEA="], "published": "2018-01-03T19:30:00.000+02:00", "crawled": "2018-01-03T21:00:08.000+02:00", "highlightTitle": ""}