{"organizations": [], "uuid": "a210d67df51bd9139e98c4765c4f75f26b02fb7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/citigroup-earnings-q4-2017.html", "country": "US", "domain_rank": 767, "title": "Citigroup earnings Q4 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.778, "site_type": "news", "published": "2018-01-16T15:00:00.000+02:00", "replies_count": 0, "uuid": "a210d67df51bd9139e98c4765c4f75f26b02fb7e"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/16/citigroup-earnings-q4-2017.html", "ord_in_thread": 0, "title": "Citigroup earnings Q4 2017", "locations": [], "entities": {"persons": [{"name": "mario tama", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "citigroup center", "sentiment": "negative"}, {"name": "citi", "sentiment": "negative"}, {"name": "citigroup", "sentiment": "negative"}, {"name": "citibank", "sentiment": "negative"}, {"name": "dta", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Citigroup reported quarterly earnings on Tuesday that beat expectations on solid results from consumer banking.\nThe big bank also reported a charge of roughly $19 billion following a revamp to the U.S. tax code.\nCitigroup reported adjusted earnings per share of $1.28 for the fourth quarter of 2017. Analysts polled by Reuters expected earnings to come in at $1.19. Some analysts have published notes Tuesday morning that put the bank's EPS number closer to $1.20, excluding a tax-related gain.\nRevenue came in roughly in line with expectations at $17.3 billion and was 1 percent higher than the fourth quarter of 2016.\nShares rose 1.4 percent in early trading Tuesday.\nCitigroup also took at one-time, noncash charge of about $22 billion for the quarter. The company said that approximately $19 billion of the charge is related to recalculating the value of tax assets as a result of the new corporate tax cuts. Another $3 billion of the charge is related to bringing home profit made abroad.\nLast month, President Donald Trump signed a bill that slashed the corporate tax rate to 21 percent from 35 percent.\nWhile the new law is expected to be a long-term positive for most companies, several announced they would have to take one-time charges because the lower rate reduced the value of their deferred tax assets, which represent taxes already paid. These companies initially recorded their deferred tax assets at the older, higher rate, so the tax cut made those assets less valuable.\nWithout the charges related to tax reform, profit for 2017 was $15.8 billion, a 6 percent gain from the prior year.\nRevenue for consumer banking rose 6 percent in the fourth quarter, to $8.4 billion, and revenue in investment and corporate banking fell 1 percent, to just over $8 billion. Net credit losses rose 11 percent in the fourth quarter from the same period a year earlier, to $1.9 billion.\nLast year Citi doubled its dividend and announced a $15.6 billion share buyback plan, its biggest ever. That is still on track. \"Tax reform does not change our capital return goals as we remain committed to returning at least $60 billion of capital in the current and next two CCAR cycles, subject to regulatory approval,\" CEO Michael Corbat said in a press release on Tuesday. \n\"Tax reform not only leads to higher net income and increased returns, but also serves to strengthen our capital generation capabilities going forward,\" he said.", "external_links": [], "published": "2018-01-16T15:00:00.000+02:00", "crawled": "2018-01-16T15:16:24.037+02:00", "highlightTitle": ""}