{"organizations": [], "uuid": "de62384b148c174a31961f4d2590abae974caa40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/26/104610446-GettyImages-486062010-wynn-macau.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/wynn-shares-plunge-as-wall-street-says-the-bottom-is-farther-from-here-amid-alleged-ceo-misconduct.html", "country": "US", "domain_rank": 767, "title": "Wynn shares plunge as Wall Street says the bottom is farther from here amid alleged CEO misconduct", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T19:10:00.000+02:00", "replies_count": 0, "uuid": "de62384b148c174a31961f4d2590abae974caa40"}, "author": "Tae Kim", "url": "https://www.cnbc.com/2018/01/29/wynn-shares-plunge-as-wall-street-says-the-bottom-is-farther-from-here-amid-alleged-ceo-misconduct.html", "ord_in_thread": 0, "title": "Wynn shares plunge as Wall Street says the bottom is farther from here amid alleged CEO misconduct", "locations": [], "entities": {"persons": [{"name": "wynn", "sentiment": "negative"}, {"name": "steve wynn", "sentiment": "none"}, {"name": "jerome favre", "sentiment": "none"}, {"name": "joseph greff", "sentiment": "none"}], "locations": [{"name": "wynn macau", "sentiment": "none"}], "organizations": [{"name": "venture capital wynn", "sentiment": "negative"}, {"name": "wynn resorts", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "wynn resorts ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wall Street firms are telling their clients shares of Wynn Resorts may have more downside even after the stock's large drop since Friday.\nWynn shares fell 10 percent Friday after The Wall Street Journal reported allegations that its CEO Steve Wynn engaged in sexual misconduct over a course of many years.\nThe shares are down another 8.7 percent Monday to $164.60 per share after several negative research reports on the company and concerns over potential regulatory action.\nJ.P. Morgan analyst Joseph Greff said Sunday he does not recommend the shares due to the uncertainty over the scandal.\n\"Our instinct here is that the risk-reward is not favorable, at least yet,\" he wrote. \"We think the news reports alleging sexual harassment by Steve Wynn creates a sizable overhang in the shares and see value that compensates investors for risk related to these allegations at the $150 level.\"\nThe analyst reiterated his neutral rating on Wynn shares, noting the importance of the executive to the company and brand.\n\"A scenario where WYNN doesn't have Steve as a CEO is not good for the company,\" Greff wrote. \"We have always held the belief that WYNN possesses the single largest individual CEO dependency versus any of the other 30 gaming and lodging companies [in] our coverage universe.\"\nUBS lowered its rating on Wynn Resorts to neutral from buy on Monday, citing the rising scrutiny from regulatory bodies.\n\"We believe risk to the outlook has increased as well, with recent allegations about the CEO prompting an investigation by the co's board as well as reviews by gaming regulators in Nevada & MA,\" analyst Robin Farley wrote Monday. \"These allegations and subsequent investigations will likely cap near-term upside in the stock, in our view.\"\nMacau's Gaming Inspection and Coordination Bureau has contacted Wynn management on whether major shareholders, directors and key employees meet suitable qualifications, according to a Bloomberg News report.\nNomura Instinet warned its clients any issues from Macau will drive the company's valuation lower as 75 percent of the company's earnings before interest, taxes, depreciation and amortization (EBITDA) is generated in the Chinese territory.\nThe Gaming Inspection and Coordination Bureau did not immediately respond to a request for comment.\nWynn pointed to the statements already made by the company and Steve Wynn when asked for comment.\nDisclaimer", "external_links": [], "published": "2018-01-29T19:10:00.000+02:00", "crawled": "2018-01-29T19:11:30.051+02:00", "highlightTitle": ""}