{"organizations": [], "uuid": "6a9baa457c839af84d45a746973cfc48f58572e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104959592-profit-rocco.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/23/marcus-lemonis-3-steps-to-regain-a-sense-of-direction-in-your-career.html", "country": "US", "domain_rank": 767, "title": "Marcus Lemonis: 3 steps to regain a sense of direction in your career", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T15:16:00.000+02:00", "replies_count": 0, "uuid": "6a9baa457c839af84d45a746973cfc48f58572e9"}, "author": "Zameena Mejia", "url": "https://www.cnbc.com/2018/01/23/marcus-lemonis-3-steps-to-regain-a-sense-of-direction-in-your-career.html", "ord_in_thread": 0, "title": "Marcus Lemonis: 3 steps to regain a sense of direction in your career", "locations": [], "entities": {"persons": [{"name": "marcus lemonis", "sentiment": "negative"}, {"name": "rocco giordano", "sentiment": "negative"}, {"name": "giordano", "sentiment": "none"}, {"name": "lemonis", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "lower east side", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Being a successful designer in the New York City fashion scene is no easy feat, but Rocco Giordano managed to put down roots with his streetwear brand Faded Royalty in Manhattan's Lower East Side.\nAfter starting in 2010, Giordano's early success allowed him to open three retail stores and an online shop. Unfortunately, as time passed, the entrepreneur struggled to generate revenue to covering operating costs and had to downsize to one flagship store.\nAs an investor in the activewear and street clothing space, self-made millionaire Marcus Lemonis became interested in Giordano's business. Yet as a businessman, Giordano shows Lemonis that he still has much to learn.\nBack in that NEW YORK groove. Wait till they see what we have on deck.... \nA post shared by FADED ROYALTY (@fadedroyalty__) on May 28, 2017 at 3:54pm PDT \n\"He struggles to stay focused, leaving his clothes without an identity. He's careless about managing money, leaving his friends holding the bag,\" Lemonis says in this week's episode of CNBC's \"The Profit .\" \"If I can't find a way to fix the fabric of his company, his business will be ripped to shreds.\"\nAs Lemonis observed how Giordano ran Faded Royalty, he frequently found himself both impressed and confused by the lack of direction Giordano seemed to have with his brand.\nBased on the advice Lemonis used to help shape Giordano's vision, here are three steps you can also follow to regain a sense of direction in your career.\nEvaluate your financial situation Despite not having any formal background in the field, Giordano launched Faded Royalty with the hopes of it becoming a household name.\n\"Our whole thing is affordable pricing and good quality,\" Giordano said. \"There's only one rule in business: stay in business.\"\nAs cool as Lemonis thought the store and products were, the business was in over $56,000 of debt and at risk of closing within a month.\nWorse off, Giordano could only afford part-time employees and could not manage to pay himself a salary.\n\"The company has a lot of potential, but it's not doing well. It's not all about money, it's about contacts, that I'm entering my 40s without a paycheck even though I'm doing what I love,\" Giordano said. \"If I didn't borrow money from my friends and fight to stay alive, I would be out of business.\"\nLemonis sat with Giordano to straighten out his company financial statements, which to Lemonis' disappointment, he did not have written down. Instead, they worked together using figures listed on tax returns and from Giordano's memory.\n\"I'm willing to change it, get the business healthy and grow the business where it should be,\" Giordano said.\nAlthough this was the first time Giordano sat down to work out his company's financial statement, Lemonis managed to successfully get a clear picture of where Giordano's business stood and how it could grow.\n\"I want to prove to you that you can do it on your own, you are capable. Anybody that has the guts to start a brand and put their ass on the line has all the guts that I like to partner with,\" Lemonis said.\nLearn when to give up One of the drawbacks Lemonis saw in investing in Faded Royalty was the amount of unsold inventory Giordano had unnecessarily stocked up.\nThe problem: Giordano was too attached to his merchandise and this was costing him tens of thousands of dollars in profit.\nLemonis made it clear that in order for Faded Royalty to grow, he needed to clean up shop.\nFearful that putting his clothes on sale would harm his business, Giordano put his guard up.\n\"Just because it was in a garage doesn't mean that there needs to be a fire sale. A lot of the stuff is still new,\" he said. \"I'll give it to charity before I sell it in this fashion.\"\nLemonis did not want to tolerate Giordano hoarding the unsold inventory and gave him an ultimatum: either sell the clothes and make space for a new collection or the investor walks away.\n\"Their money is here, [the apparel] has to be sold, I'll do what it takes,\" Giordano said. \"If we have to do a sidewalk sale and generate income, I'll do that. I want the company to grow.\"\nStart from square one While difficult to get Giordano to clear his old inventory, Lemonis also challenged the designer to \"pick a lane\" and create one, cohesive look to establish a brand identity.\n\"I don't think that Rocco knows who his customer is. It's probably anybody that walks in that he can sell something to,\" Lemonis said.\n10/06/2010 - Faded Royalty first opened up its doors for business with little money and big dreams. 6 years later, we are still grinding away. The biggest lesson learned - Nothing is easy. 2,190 Days ago I decided to do this full time, no half assin', no day job , no one day I do it - one day I don't. It's been an interesting ride through the years giving it , I've learned a ton and I'm proud of what this brand has created over the years and what it will continue to create. I would like to thanks all of our customers, friends and family. I Look forward to the next 6 years. EVENT DETAILS SOON.... \nA post shared by FADED ROYALTY (@fadedroyalty__) on Oct 6, 2016 at 5:04pm PDT \nTo help refine Giordano's vision, Lemonis recommended that he create a list and determine Faded Royalty's signature piece and the audience he wants to serve.\n\"What I worry about with Rocco is when he struggles to explain himself isn't his creativity or his character or his integrity,\" said Lemonis. \"It's his ability to organize and collect his thoughts.\"\nAlthough it took Giordano several days to come up with the right words, he finally established his brand as a mixture of '\"60s mod,\" \"vintage\" with a \"New York edge.\"\n\"I think that Rocco is always going to push the edges of creativity, but through this process, he was able to get rid of his inventory and really put together a cohesive line. It's now clear to me that his brand stands for something,\" Lemonis said. \"I feel like he's come a long way.\"\nLike this story? Like CNBC Make It on Facebook . \nDon't miss: \nThe top 25 US companies to work for if you want to be happier The one simple action that helps self-made billionaire Richard Branson achieve success Video produced by Richard Washington", "external_links": [], "published": "2018-01-23T15:16:00.000+02:00", "crawled": "2018-01-23T15:33:13.009+02:00", "highlightTitle": ""}