{"organizations": [], "uuid": "00b0a9579370223436321e116c219347ab84da37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225062350&w=1200&r=LYNXMPEE0O0AX", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-noble-debt/noble-group-says-talks-with-creditors-constructive-declines-to-confirm-reported-deal-idUSKBN1FE0O5", "country": "US", "domain_rank": 408, "title": "Noble Group says talks with creditors 'constructive', declines to confirm reported deal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T09:26:00.000+02:00", "replies_count": 0, "uuid": "00b0a9579370223436321e116c219347ab84da37"}, "author": "", "url": "https://www.reuters.com/article/us-noble-debt/noble-group-says-talks-with-creditors-constructive-declines-to-confirm-reported-deal-idUSKBN1FE0O5", "ord_in_thread": 0, "title": "Noble Group says talks with creditors 'constructive', declines to confirm reported deal", "locations": [], "entities": {"persons": [{"name": "tom hogue", "sentiment": "none"}, {"name": "anshuman daga", "sentiment": "none"}, {"name": "aradhana aravindan", "sentiment": "none"}, {"name": "paul brough", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "noble group", "sentiment": "negative"}, {"name": "min read  singapore", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "noble group ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "iceberg research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE (Reuters) - Struggling commodities trader Noble Group Ltd is having constructive talks with creditors to restructure its debt and is hopeful of a deal in the near future, the company’s chairman said.\n“Various talks have been going for a couple of months. They have been constructive,” Paul Brough, a restructuring specialist who was appointed Noble’s chairman this year, told a shareholders’ meeting in Singapore on Thursday.\nNoble was once a global commodity trader with ambitions to rival the likes of Glencore and Vitol [VITOLV.UL]. Now it has shrunk to its Asian roots as a hard commodities player after a crisis-wracked three years forced it to slash jobs and sell its key assets - some at losses - to cut debt.\nFounded in 1986 by Richard Elman, who rode a commodities bull run to build Noble into one of the world’s biggest traders, the company was plunged into crisis in 2015 when Iceberg Research started questioning its accounts.\nThat triggered a share price collapse, credit downgrades and writedowns, as well as fund-raising and management changes. Noble has stood by its accounts.\nBrough declined to confirm a media report that Noble had struck a deal with creditors to restructure about $3.5 billion in debt, but said that he hoped things were moving in the right direction.\n“They are moving forward and I‘m hopeful we will reach a conclusion at some point in the near future,” he said.\nIn a statement to the Singapore Exchange later in the day, the company said it had not finalised any agreement to restructure its debt.\nBrough said that along with his CFO, he had held meetings in London this week with some of the advisers representing Noble’s bond holders and holders of credit facilities.\nNoble has been hemmed in by financing constraints - a major issue for trading houses - and has lost many traders, analysts and managers over the last few years. The company’s market value has fallen to just $268 million from the $6 billion it commanded in February 2015.\nThe shares rose 15 percent on Thursday before trading was halted.\nWINNING BACK BANK SUPPORT Noble’s financial woes resulted in its retreat from most financial commodity markets, including a lucrative Americas-focussed oil trading business and a smaller gas and power unit.\n“We have lost a lot of banking support, we need to win that support back,” said Brough.\n“The facilities we have at the moment are very expensive and there are occasions when we are trading on a loss-making basis to keep our franchise i.e. retain our customers and retain our suppliers,” he said.\n“We have been working to make sure that we do save this business and that there will be light at the end of the tunnel.”\nThe company has bank debt of about $1.2 billion and bonds aggregating about $2.3 billion.\nNoble reported a $1.2 billion net loss for July-September and flagged a weak outlook.\nFounder Elman is the company’s biggest shareholder with a stake of just over 18 percent. Other large investors include sovereign wealth fund China Investment Corp, Orbis Investment Management and Eastspring Investments.\nReporting by Aradhana Aravindan; Additional reporting by Shashwat Pradhan; Writing by Anshuman Daga; Editing by Tom Hogue\n ", "external_links": [], "published": "2018-01-25T09:26:00.000+02:00", "crawled": "2018-01-25T09:55:10.020+02:00", "highlightTitle": ""}