{"organizations": [], "uuid": "a7a936d8ab4ebc5bf7ec8ed906879556ff7375ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104948107-GettyImages-904966660.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/trump-claims-democrats-want-shutdown-over-daca-deal-as-deadline-looms.html", "country": "US", "domain_rank": 767, "title": "Trump claims Democrats want shutdown over DACA deal as deadline looms", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-16T17:48:00.000+02:00", "replies_count": 0, "uuid": "a7a936d8ab4ebc5bf7ec8ed906879556ff7375ee"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/16/trump-claims-democrats-want-shutdown-over-daca-deal-as-deadline-looms.html", "ord_in_thread": 0, "title": "Trump claims Democrats want shutdown over DACA deal as deadline looms", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "nicholas kamm", "sentiment": "negative"}, {"name": "mitch mcconnell", "sentiment": "none"}], "locations": [{"name": "r-ky.", "sentiment": "none"}], "organizations": [{"name": "daca", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "border security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump accused Democrats on Tuesday of seeking a government shutdown, as Congress scrambles to fund the government ahead of a Friday deadline.\nTop Democrats have signaled they will not support a spending bill unless they also reach a deal to shield hundreds of thousands of young immigrants from deportation. Talks on an immigration plan — which would include new border security funding to appease Republicans — hit a snag following Trump's tense meeting with bipartisan senators last week. \nCongress now has four days including Tuesday to pass a spending bill — with or without the Democrats — to yet again avoid a government shutdown at the last minute. Lawmakers most recently reached a short-term funding deal in late December to keep the government open for less than a month. \nSenate Majority Leader Mitch McConnell , R-Ky., has said he wants to keep funding and immigration bills separate.\nIn a tweet Tuesday, Trump claimed that \"Democrats want to shut down the Government over Amnesty for all and Border Security.\" He added that \"we need a merit based system of immigration\" and \"no more dangerous\" visa lottery. \nTrump tweet \nIn a bill, Democrats want legal protection for nearly 800,000 young immigrants who were protected by the Obama-era Deferred Action for Childhood Arrivals program, which Trump ended in September with a delay that expires in March. They have not publicly sought \"amnesty for all\" as characterized by Trump. \nTrump and GOP negotiators in Congress have sought funding for additional border security measures and limits on family immigration, among other measures, in a deal. Trump rejected a deal brought to him by bipartisan Senate negotiators on Thursday. \nSen. Dick Durbin, D-Ill. — one of those negotiators — told reporters on Tuesday that \"we did everything [Trump] asked\" in the bipartisan proposal presented to him on Thursday. \nComments Trump allegedly made during the meeting have further complicated talks. Last week, Durbin said that Trump said \"hate-filled\" things at the meeting, questioning the need for immigrants from \"s---hole\" African countries . \nshow chapters President Trump spends MLK weekend denying racism charges      4 Hours Ago | 01:34 On Monday, Trump claimed that \"Senator Dicky Durbin totally misrepresented what was said at the DACA meeting.\" \n\"Deals can't get made when there is no trust!\" he tweeted. \nTrump tweet \nRepublican meeting attendee Sen. Lindsey Graham of South Carolina did not deny that Trump made those comments. Trump allies Sens. Tom Cotton, R-Ark., and David Perdue, R-Ga., cast doubts on whether Trump made the comments . \nRepublicans control both chambers of Congress, but Trump has repeatedly argued that Democrats should take the blame if a shutdown happens.", "external_links": [], "published": "2018-01-16T17:48:00.000+02:00", "crawled": "2018-01-16T17:50:15.003+02:00", "highlightTitle": ""}