{"organizations": [], "uuid": "e6a71ba1c1cba459df551366e30688b4db5db96c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226288101&w=1200&r=LYNXMPEE0S0V2", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-israel-palestinians-usa-un/u-n-employees-in-gaza-hold-protest-strike-over-u-s-aid-cut-idUSKBN1FI1G7", "country": "US", "domain_rank": 408, "title": "U.N. employees in Gaza hold protest strike over U.S. aid cut", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T14:24:00.000+02:00", "replies_count": 0, "uuid": "e6a71ba1c1cba459df551366e30688b4db5db96c"}, "author": "", "url": "https://www.reuters.com/article/us-israel-palestinians-usa-un/u-n-employees-in-gaza-hold-protest-strike-over-u-s-aid-cut-idUSKBN1FI1G7", "ord_in_thread": 0, "title": "U.N. employees in Gaza hold protest strike over U.S. aid cut", "locations": [], "entities": {"persons": [], "locations": [{"name": "gaza", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "gaza strip", "sentiment": "none"}, {"name": "gaza city", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "u.n.", "sentiment": "negative"}, {"name": "min read  gaza", "sentiment": "none"}, {"name": "unrwa", "sentiment": "none"}, {"name": "nidal al-mughrabi", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "united nations’ relief and welfare agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GAZA (Reuters) - Schools, clinics and food distribution centers in the Gaza Strip were closed on Monday due to a one-day strike by the 13,000 employees of the United Nations agency that serves the Palestinians.\nThe Palestinian employees have been angered by a U.S. decision to cut its annual contribution toward the running of the United Nations’ Relief and Welfare Agency (UNRWA), which runs 278 schools in Gaza attended by some 300,000 students.\nThe UNRWA is funded mainly by voluntary contributions from U.N. member states, with the United States by far the largest donor. Washington announced on Jan. 16 it would hold back $65 million - more than half its planned contribution this year - and demanded that the agency make unspecified reforms.\nThose joining Monday’s strike said the U.S. funding cut would worsen hardship in the Gaza Strip, and they marched to the U.N. headquarters in Gaza City waving Palestinian flags and brandishing banners that read “Dignity is priceless”.\n“I have a family of nine and I have never felt afraid for my job like today. U.S. aid cuts will affect the entire community,” said 59-year-old English teacher Ahmed Abu Suleiman.\nUNRWA spokesman Abu Hasna said the agency, which has launched an international appeal for funds, had enough money for three months of operations.\nAn employee of United Nations Relief and Works Agency (UNRWA) holds a Palestinian flag during a protest against a U.S. decision to cut aid, in Gaza City January 29, 2018. REUTERS/Mohammed Salem “We appreciate the fear and concern of employees for their jobs and for possible cuts in services,” he said.\nMore than half of the two million people in the Gaza Strip are dependent on support from UNRWA and other humanitarian agencies. Unemployment in the enclave stands at 46 percent.\nA Palestinian demonstrator gestures as he holds representations of Israeli, British and U.S. flags before burning them during a protest against a U.S. decision to cut aid, in Gaza City January 29, 2018. REUTERS/Mohammed Salem The strike comes amid Palestinian anger over U.S. President Donald Trump’s Dec. 6 decision to recognize Jerusalem as Israel’s capital.\nSpeaking at the World Economic Forum in Davos last week, Trump criticized the Palestinian leadership for refusing to meet Vice President Mike Pence during his visit to the region and suggested such behavior provided grounds for cutting aid.\n“When they disrespected us a week ago by not allowing our great vice president to see them, and we give them hundreds of millions of dollars in aid and support, tremendous numbers, numbers that nobody understands -- that money is on the table and that money is not going to them unless they sit down and negotiate peace,” Trump said.\nUNRWA was established by the U.N. General Assembly in 1949 after hundreds of thousands of Palestinians fled or were expelled from their homes in the 1948 war that followed the creation of the state of Israel.\nEditing by Jeffrey Heller and Gareth Jones\n ", "external_links": [], "published": "2018-01-29T14:24:00.000+02:00", "crawled": "2018-01-29T14:38:00.013+02:00", "highlightTitle": ""}