{"organizations": [], "uuid": "f2f2e678edadc60de7ca090cfeb8b1b08d31d927", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221370240&w=1200&r=LYNXMPEE0B0CI", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-india-supremecourt/four-indian-supreme-court-judges-slam-administration-of-countrys-top-court-idUSKBN1F10LT", "country": "US", "domain_rank": 408, "title": "Four Indian Supreme Court judges slam administration of country's top court", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T09:24:00.000+02:00", "replies_count": 0, "uuid": "f2f2e678edadc60de7ca090cfeb8b1b08d31d927"}, "author": "", "url": "https://www.reuters.com/article/us-india-supremecourt/four-indian-supreme-court-judges-slam-administration-of-countrys-top-court-idUSKBN1F10LT", "ord_in_thread": 0, "title": "Four Indian Supreme Court judges slam administration of country's top court", "locations": [], "entities": {"persons": [{"name": "jasti chelameswar", "sentiment": "none"}, {"name": "suchitra mohanty", "sentiment": "none"}, {"name": "chelameswar", "sentiment": "none"}, {"name": "madan lokur", "sentiment": "none"}, {"name": "kurian joseph", "sentiment": "none"}, {"name": "euan rocha", "sentiment": "none"}, {"name": "malini menon", "sentiment": "none"}, {"name": "ranjan gogoi", "sentiment": "none"}, {"name": "dipak misra", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "four indian supreme court", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "times of india", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "supreme court of india", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 7:24 AM / in 32 minutes Four judges criticize India's top court in rare public spat Malini Menon , Suchitra Mohanty 4 Min Read \nNEW DELHI (Reuters) - Four justices of India’s top court on Friday criticized its distribution of cases to judges and raised concerns about judicial appointments, in an unprecedented public airing of problems at one of the country’s most respected institutions. \nThe move points to far-reaching implications for jurists and politicians in the chaotic South Asian democracy where the Supreme Court often sets the agenda on matters of policy and orders measures taken in the public interest. \nExposing a rift with Chief Justice Dipak Misra, the court’s four next highest-ranking judges said the issues involving its administration were serious enough to prompt them to go public. \n“The four of us are convinced that unless this institution is preserved and it maintains its equanimity, democracy will not survive in this country,” Justice Jasti Chelameswar told a news conference on the lawns of his home in the Indian capital. \nThe justices released a letter they had written to Misra. \nIn it they mentioned instances of cases with “far-reaching consequences for the nation and the institution” that were selectively assigned by the chief justice without rational “basis for such assignment”. \nAll Supreme Court judges should be involved in setting the procedures used to hire and promote judges in all the country’s courts, they added. \nThe chief justice did not immediately respond to telephone calls from Reuters seeking comment. \nLaw Minister Ravi Shankar Prasad declined to comment. \nTwo close aides of Prime Minister Narendra Modi said he was looking into the matter and had summoned top law ministry officials for consultations. \nThe judges did not give specific details of their concerns during the press conference, but said “it is an issue of assignment of a case”. When reporters asked whether it was related to the case of a lower court judge B. Loya, who died in December 2014 while hearing a high-profile trial, one of the four judges said “yes”. \nAt the time of his death, Loya was hearing a case that accused Amit Shah, the president of the ruling Bharatiya Janata Party, of ordering extrajudicial killings when he served as home minister under Modi in the state of Gujarat. Shah has since been acquitted of those charges. ( reut.rs/13GzEsm ) Justice Jasti Chelameswar gestures as he leaves after the news conference in New Delhi, India, January 12, 2018. REUTERS/Adnan Abidi \nThe Supreme Court is currently hearing a plea to investigate Loya’s death, local media said. \nThe BJP and Shah’s office declined to comment. \nSeparately, last November, the chief justice overturned an order by Chelameswar that referred a case to a bench of the five most senior judges. At the time, Misra said he was the “master of the roster”. SPEAKING UP \nSome Supreme Court lawyers praised the justices’ action. Slideshow (2 Images) \n“Looking at its own flaws is the first step to correcting an institution, to deepening true constitutional democracy,” said Karuna Nundy, a Supreme Court lawyer. \nBut there was also criticism over the public nature of the rift. The spat was distressing, a former attorney-general of India, Soli Sorabjee, told the India Today news channel. \n“The public shouldn’t see that the judiciary is a divided house,” he said. \nThe Supreme Court has 25 judges appointed by India’s president, including the chief justice, who retire at the age of 65, according to its website. \nThe four justices at Friday’s news conference - Chelameswar plus Ranjan Gogoi, Madan Lokur and Kurian Joseph - are the most senior after Misra. \nThree are scheduled to retire this year, while Gogoi is in line to be the next chief justice, based on seniority. \nEfforts to alert the chief justice that certain things were not in order and that remedial measures were needed had failed, prompting the news conference, Chelameswar said. \nAsked if the chief justice should be impeached, Chelameswar said, “That’s for the nation to decide.” \n“I think this is the first of many things to come,” said Alok Kumar Prasanna, a lawyer and legal researcher. “It seems clear to me that there’s a war going on.” Reporting by Suchitra Mohanty and Malini Menon; Additional reporting by Rahul Bhatia, Aditya Kalra and Nidhi Verma; Writing by Euan Rocha; Editing by Clarence Fernandez and John Stonestreet", "external_links": [], "published": "2018-01-12T09:24:00.000+02:00", "crawled": "2018-01-12T09:34:25.008+02:00", "highlightTitle": ""}