{"organizations": [], "uuid": "9a83c19058a46579dd9fd5ee0757645ccd4f04f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220237012&w=1200&r=LYNXMPEE070LF", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews/", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind/inspired-india-rip-through-south-africa-to-set-up-victory-chance-idUKKBN1EX0WL", "country": "US", "domain_rank": 408, "title": "Cricket-Inspired India rip through South Africa to set up victory chance", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T12:52:00.000+02:00", "replies_count": 0, "uuid": "9a83c19058a46579dd9fd5ee0757645ccd4f04f8"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind/inspired-india-rip-through-south-africa-to-set-up-victory-chance-idUKKBN1EX0WL", "ord_in_thread": 0, "title": "Cricket-Inspired India rip through South Africa to set up victory chance", "locations": [], "entities": {"persons": [{"name": "quinton de kock", "sentiment": "none"}, {"name": "nick said", "sentiment": "none"}, {"name": "dale steyn", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "newlands stadium", "sentiment": "none"}, {"name": "cape town", "sentiment": "none"}, {"name": "newlands", "sentiment": "none"}, {"name": "reuters/sumaya hisham  india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "ab de villiers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 11:04 AM / Updated 36 minutes ago Philander takes six as South Africa beat India Nick Said 3 Min Read \nCAPE TOWN (Reuters) - Seamer Vernon Philander took career-best figures as rampant South Africa claimed a 72-run victory over India on a gripping fourth day of the first test on Monday. Cricket - India v South Africa - First Test cricket match - Newlands Stadium, Cape Town, South Africa - January 8, 2018. India cricket players celebrate the dismissal of South Africa's Faf du Plessis, bowled by Mohammed Shami. REUTERS/Sumaya Hisham \nSet 208 for victory, India were skittled out for 135 in 42.4 overs in their second innings on a lively wicket with Philander the chief destroyer, recording figures of 6-42. \nIndia had looked to seize control of the test when they bowled South Africa out for 130 in the morning session, but found the home attack on the seamer-friendly wicket too much of a challenge. \n”I was nervous we did not have enough runs,“ South Africa captain Faf du Plessis told reporters. ”I knew the new ball would be key for us, if we could strike early we believed we could get through their batting line-up. \n“But I came in this morning hoping to get a 350 lead and bowl at them tonight, so obviously that did not go to plan.” \nAfter day three had been a washout, 18 wickets fell in 64 overs on Monday, all going to seamers. \nSouth Africa resumed on 65 for two, but were only able to double their score before they lost their last eight wickets. \nMohammed Shami (3-28) and debutant Jasprit Bumrah (3-39) were the pick of the Indian bowlers. \nOnly an attacking 35 from AB De Villiers stemmed the tide to a degree before he was the last man out. Cricket - India v South Africa - First Test cricket match - Newlands Stadium, Cape Town, South Africa - January 8, 2018. South Africa's Vernon Philander bowls to India's Murali Vijay. REUTERS/Sumaya Hisham \nSouth Africa, without injured seamer Dale Steyn who will miss the rest of the series with a heel problem, weathered a first-wicket stand of 30 for India in reply. \nShikhar Dhawan (16) was out first as he sparred a rising deliver from Morne Morkel (2-39) to gully. \nPhilander picked up his first wicket as fellow opener Murali Vijay (13) edged to third slip. Slideshow (11 Images) \nCheteshwar Pujara (four) became Morkel’s second victim with the score on 39, before Indian captain Virat Kohli (28) took the attack to the South Africans. \nHe was undone playing across a straight delivery from Philander. \nRohit Sharma (10) was bowled off the inside edge by Philander before the tourists’ first-innings hero Hardik Pandya edged Kagiso Rabada to De Villiers in the slips. \nRabada claimed the wicket of Wriddhiman Saha (eight) with the last ball before tea. \nPhilander then took three wickets in four balls to seal victory after a seventh-wicket stand of 49 between top-scorer Ravichandran Ashwin (37) and Bhuvneshwar Kumar (13 not out) had briefly sent jitters through the Newlands crowd. \n“We were in the game for the three days and it was a wonderful match to be part of,” Kohli said. “But we need to rectify our mistakes... the mindset really matters when you travel away from home.” \nSouth Africa are hosting India in a three-test series this month, with matches to come in Pretoria, starting on Saturday, and Johannesburg. Reporting by Nick Said, editing by Ed Osmond and Christian Radnedge", "external_links": [], "published": "2018-01-08T12:52:00.000+02:00", "crawled": "2018-01-08T13:48:19.010+02:00", "highlightTitle": ""}