{"organizations": [], "uuid": "180970883d1ad0b58740434e023f21d3c4e98185", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 51}, "facebook": {"likes": 1329, "shares": 1329, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XA822_3jMLE_TOP_20180117134800.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/apples-tax-payment-could-set-off-repatriation-trend-1516231474", "country": "US", "domain_rank": 387, "title": "Apple’s Tax Payment Could Set Off Repatriation Trend", "performance_score": 10, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.134, "site_type": "news", "published": "2018-01-18T02:56:00.000+02:00", "replies_count": 0, "uuid": "180970883d1ad0b58740434e023f21d3c4e98185"}, "author": "Tatyana Shumsky", "url": "https://www.wsj.com/articles/apples-tax-payment-could-set-off-repatriation-trend-1516231474", "ord_in_thread": 0, "title": "Apple’s Tax Payment Could Set Off Repatriation Trend", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "apple inc.", "sentiment": "negative"}, {"name": "apple", "sentiment": "negative"}, {"name": "moody’s investors service inc", "sentiment": "none"}, {"name": "zion research group", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "25 COMMENTS Apple Inc.’s AAPL 0.20% plans for a repatriation tax payment may signal a tipping point for U.S. corporate offshore cash hoards.\nApple on Wednesday announced it would make a one-time mandatory tax payment of $38 billion related to unrepatriated offshore cash holdings under the new U.S. tax law.\nThat equates to 15% of its $252.3 billion offshore cash pile, broadly in line with the 15.5% tax rate required by the new law. Previously, multinational companies like Apple would pay the difference between lower foreign tax rates and the 35% U.S. corporate tax rate to bring the money home.\nThat unfavorable U.S. tax regime had contributed to a buildup in U.S. corporate offshore cash reserves. U.S. nonfinancial companies socked away a record $1.3 trillion in cash held overseas at the end of 2016, a total that was forecast to climb to $1.4 trillion by the end of 2017, according to Moody’s Investors Service Inc. Apple’s overseas cash accounted for the largest share of that pile.\nAn analysis by Zion Research Group puts the total for the full S&P 500 at about $2.8 trillion.\nRelated Video U.S. companies are holding more than $2.6 trillion in profits across the globe and they haven't paid U.S. taxes on it. Why is so much money offshore, and how could the tax code be changed to bring it back? WSJ's tax reporter Richard Rubin dives in. Photo: Heather Seidel/The Wall Street Journal “There’s no longer an economic reason to maintain cash offshore to avoid high U.S. taxation,” said Richard Lane, senior vice president at Moody’s. “For that reason, offshore cash balances are going to come down quite notably from our estimate of $1.4 trillion at the end of 2017,” he added.\nApple on Wednesday said it would also make a number of capital-intensive investments in the U.S. It’s unclear whether the iPhone maker will use some of its multibillion-dollar cash pile to fund those projects. Some of its expansion plans were in the works prior to the signing of the tax bill.\nCompanies don’t have to bring the money home, they’re just required to pay the tax on it. The new tax law offers a one-time bulk payment option or spread payments out over eight years. Future future overseas earnings will be tax-free.\nApple did not disclose how much of its offshore cash it planned to repatriate and did not specify how it planned to use those funds. Apple spokespeople did not respond to emailed requests for comment.\nNewsletter Sign-up To be sure, Apple won’t need to “physically” move much of its foreign cash to the U.S. The bulk of its overseas holdings are invested in commercial paper and other short-term money instruments held by foreign subsidiaries. Repatriating those funds is a matter of signing over ownership to the U.S. parent company, Mr. Lane said.\n“It’s more an administrative matter, in terms of where the security is held and where it will be held after they affect the repatriation,” Mr. Lane said. “It’s really like moving money within a family, it doesn’t require the sale of a security to a third party.”\nWrite to Tatyana Shumsky at tatyana.shumsky@wsj.com", "external_links": [], "published": "2018-01-18T02:56:00.000+02:00", "crawled": "2018-01-18T04:49:13.012+02:00", "highlightTitle": ""}