{"organizations": [], "uuid": "dbb2475753defb5e0181937f635fff29e9303e93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-germany-politics-chair/merkels-conservatives-wont-bar-far-right-party-from-committee-chair-idUSKBN1F527F", "country": "US", "domain_rank": 408, "title": "Merkel's conservatives won't bar far-right party from committee chair", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-17T01:20:00.000+02:00", "replies_count": 0, "uuid": "dbb2475753defb5e0181937f635fff29e9303e93"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-politics-chair/merkels-conservatives-wont-bar-far-right-party-from-committee-chair-idUSKBN1F527F", "ord_in_thread": 0, "title": "Merkel's conservatives won't bar far-right party from committee chair", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "negative"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - German Chancellor Angela Merkel’s conservatives said on Tuesday they would not prevent the Alternative for Germany (AfD) from chairing parliament’s powerful budget committee if the far-right party becomes the largest opposition force.\nMerkel hopes to form an alliance with the Social Democrats (SPD) to extend her 12 years in power. That tie-up would make the anti-immigrant AfD the largest party represented in parliament that is not in government.\nTradition dictates that the largest opposition party gets to take the helm of the budget committee - a position that would give the AfD and its economic ideas prominence.\nThe AfD wants Germany to leave the euro zone and re-introduce the deutsche mark. It also wants value-added tax reduced and favors a balanced budget.\nThere have been concerns the AfD, which entered parliament after September’s election for the first time with almost 13 percent, will gain credibility by taking such positions. Last year lawmakers changed the rules for the ceremonial post of president - who gets to open the first session of parliament - to prevent an AfD member from getting it.\nBut sources in several parties said it was necessary to prevent the AfD - which rails against the establishment - from taking on the role of victim by changing informal rules.\nMichael Grosse-Broemer, the head of Merkel’s Christian Democrats (CDU) in parliament, said traditions, as well as legal rights, would be observed. “We won’t create any special rules for the AfD,” he said.\nStefan Mueller, parliamentary head of Merkel’s Bavarian allies - the Christian Social Union (CSU) - said: “We won’t refuse that” and spoke of “good parliamentary practice” in allowing the largest opposition party to take that role.\nAlice Weidel, head of the AfD in parliament, told German television that her party - which made security and cutting immigration the focus of its election campaign - had the right to take the chair of the budget committee and also wanted to get the chair of the interior committee.\nSPD parliamentary leader Andrea Nahles said her party needed to discuss the issue and then wanted to address it with other parties represented in parliament.\nThe SPD is due to decide at a party congress on Sunday whether it will enter formal talks on a “grand coalition” with Merkel. The CSU’s Mueller said the SPD had therefore asked not to make a decision about the chair of committees until next week.\nThe conservatives and liberal Free Democrats (FDP) said there were likely to be 23 committees and they were due to be initiated on Wednesday. The chairs of the committees are due to be elected at later inaugural meetings.\nReporting by Tom Koerkemeier, Andreas Rinke and Gernot Heller; Writing by Michelle Martin; editing by Mark Heinrich\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T01:20:00.000+02:00", "crawled": "2018-01-17T20:05:19.012+02:00", "highlightTitle": ""}