{"organizations": [], "uuid": "84f8662904f1e9eaa3d844ae79d61b9b0ad09676", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226311467&w=1200&r=LYNXMPEE0S10F", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-pope-antisemitism/pope-urges-europe-to-be-more-active-in-fighting-anti-semitism-idUKKBN1FI1PE", "country": "US", "domain_rank": 408, "title": "Pope urges Europe to be more active in fighting anti-Semitism", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:56:00.000+02:00", "replies_count": 0, "uuid": "84f8662904f1e9eaa3d844ae79d61b9b0ad09676"}, "author": "", "url": "https://uk.reuters.com/article/uk-pope-antisemitism/pope-urges-europe-to-be-more-active-in-fighting-anti-semitism-idUKKBN1FI1PE", "ord_in_thread": 0, "title": "Pope urges Europe to be more active in fighting anti-Semitism", "locations": [], "entities": {"persons": [{"name": "pope", "sentiment": "negative"}, {"name": "pope francis", "sentiment": "none"}, {"name": "francis", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "philip pullella", "sentiment": "negative"}, {"name": "vatican", "sentiment": "negative"}, {"name": "osce", "sentiment": "none"}, {"name": "nazi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "organisation for security and cooperation in europe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 1:58 PM / Updated 11 minutes ago Pope urges Europe to be more active in fighting anti-Semitism Philip Pullella 3 Min Read \nVATICAN CITY (Reuters) - Pope Francis called on European countries on Monday to do more to fight anti-Semitism, saying indifference on the issue was a virus that could allow the ideas of racial hatred to spread. \nFrancis issued his appeal in a speech to a Rome conference on the responsibility of states to fight anti-Semitism and crimes associated with it. \n“We are responsible when we are able to respond. It is not merely a question of analysing the causes of violence and refuting their (anti-Semitic crimes’) perverse logic, but of being actively prepared to respond to them,” he told the event organised by the Organisation for Security and Cooperation in Europe (OSCE). \nA number of European nations have made it illegal to deny the Holocaust, the Nazi attempt to exterminate European Jewry during World War Two. \nLast week, Germany’s lower house of parliament called for the creation of a new government post to oversee the fight against anti-Semitism, following the burning of Jewish symbols and Israeli flags. \n“Indifference is a virus that is dangerously contagious in our time, a time when we are ever more connected with others, but are increasingly less attentive to others,” the pope said. FILE PHOTO: Pope Francis walks through a gate with the words \"Arbeit macht frei\" (Work sets you free) at the former Nazi German concentration and extermination camp Auschwitz-Birkenau in Oswiecim, Poland, July 29, 2016. REUTERS/Kacper Pempel/File Photo \nFrancis, who made an emotional visit to the former Nazi death camp at Auschwitz in 2016 and visited Rome’s synagogue the same year, said the “vaccine” against “so many deplorable forms of apathy” is memory. \nQuoting his predecessor, Pope John Paul, Francis said everyone should work for a future where “the unspeakable iniquity of the Shoah will never again be possible.” Shoah is the Hebrew word for the Holocaust. \nPoland, where Auschwitz is located, has also seen acts of anti-Semitism recently. \nOne, exposed by a television station, showed people in a forest last year chanting “Sieg Heil” on what would have been Adolf Hitler’s 128th birthday. \nAbout 60,000 people, some carrying banners with slogans such as “pure blood, clear mind,” marched in a far-right demonstration in Warsaw in November and arsonists set fire to a synagogue in Sweden last month. \nRonald Lauder, president of the World Jewish Congress, said: “In country after country, we are watching a growing wave of far-right, ultra-national, and in some cases neo-Nazi parties gaining strength.” \n“New Europe is suddenly looking an awful lot like the Europe of the 1930s,” Lauder told the conference held at Rome’s foreign ministry. Reporting by Philip Pullella; Editing by Robin Pomeroy", "external_links": [], "published": "2018-01-29T15:56:00.000+02:00", "crawled": "2018-01-29T16:21:04.023+02:00", "highlightTitle": ""}