{"organizations": [], "uuid": "feca4d0cd1a519e56e7ed551c5afa826eeabfcfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-heart-middleage-fitness/even-middle-aged-couch-potatoes-can-help-heart-with-exercise-idUSKBN1FD30B", "country": "US", "domain_rank": 408, "title": "Even middle-aged couch potatoes can help heart with exercise", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T23:12:00.000+02:00", "replies_count": 0, "uuid": "feca4d0cd1a519e56e7ed551c5afa826eeabfcfe"}, "author": "", "url": "https://www.reuters.com/article/us-health-heart-middleage-fitness/even-middle-aged-couch-potatoes-can-help-heart-with-exercise-idUSKBN1FD30B", "ord_in_thread": 0, "title": "Even middle-aged couch potatoes can help heart with exercise", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 9:14 PM / Updated 5 minutes ago Even middle-aged couch potatoes can help heart with exercise Lisa Rapaport 5 Min Read \n(Reuters Health) - Sedentary middle-aged adults who start intense exercise training may be able to prevent or reduce cardiac stiffness that can lead to heart failure, a small experiment suggests. \nFor the experiment, researchers randomly assigned 61 sedentary adults who were 54 years old, on average, to join a two-year exercise program or a control group of participants doing less intense activities. Exercise training included moderate to vigorous physical activity at least four days a week, while people in the control group did things like weight training, balance activities and yoga three times weekly. \nAfter two years of intensive exercise training, participants who did moderate to vigorous physical activity had more improvements in their ability to use oxygen and less cardiac stiffness than their counterparts in the control group, researchers report in Circulation. \n“What this study showed, that had never been shown before, was that training at the right dose (4-5 times a week, including high-intensity interval training) at the right time (at least by late middle age) can reverse the atrophy of stiffening of the heart that otherwise occurs with aging,” said senior study author Dr. Benjamin Levine of the University of Texas Southwestern Medical Center in Dallas. \n“This restoration of youthful cardiovascular structure is a key adaptation to preserve vitality as we age, and prevent age-related diseases like heart failure,” Levine said by email. \nWhen they joined the study, participants were sedentary but otherwise healthy. \nIn the exercise group, participants received an individualized workout program and regular supervision. Among other things, they did interval training that alternated four cycles of vigorous activity at 95 percent of their maximum heart rate for four minutes, and recovery periods at 60 to 75 percent of their peak heart rate for three minutes. \nA person’s maximum heart rate is 220 minus their age in years. The maximum heart rate for someone who’s 55 years old is 165 beats per minutes, for example, and 95 percent of that is 157 beats per minute. (More information is available from the American Heart Association: bit.ly/2n7Ayu0. ) \nBy the end of the study, people in the exercise group increased the maximum amount of oxygen they used during workouts by 18 percent, while there were no changes for the control group. Cardiac stiffness also improved for the exercisers, but not for the control group. \nOne limitation of the study is that it included only people who were healthy enough to exercise, the authors note. \nThe study also wasn’t designed to determine whether intense exercise might help prevent heart failure or death in previously sedentary people, said Dr. David Alter, a researcher at the University of Toronto who wasn’t involved in the study. \n“This study only explored one of potentially many important mechanisms as to why the risk of death may be decreased with exercise,” Alter said by email. “Nonetheless, this was indeed a very important mechanism, suggesting that exercise can reduce the adverse effects of age on heart functioning.” \nBeing sedentary can lead muscles in the arms and legs to atrophy and also stiffen the heart as people age, noted Keith Diaz, a researcher at Columbia University Medical Center in New York who wasn’t involved in the study. \n“As the heart weakens and stiffens from not exercising, its ability to fill normally or effectively pump blood to the rest of the body diminishes,” Diaz said by email. “This leads to fatigue and shortness of breath, hallmark symptoms of heart failure.” \nEven though the study showed the benefits of starting to exercise in middle age, starting sooner is always better, noted Peter Kokkinos, a researcher at Georgetown University Medical Center and the Veterans Affairs Medical Center, in Washington, D.C. \n“Prevention is always better than treatment,” Kokkinos said by email. \nThere also may be a limit to how late in life sedentary adults can start exercising if their goal is preventing heart failure, said Dr. I-Min Lee, a researcher at the Harvard T.H. Chan School of Public Health and Brigham and Women’s Hospital in Boston who wasn’t involved in the study. \nThis doesn’t mean elderly people shouldn’t get moving, however. \n“Physical activity at older ages can help other health conditions besides cardiovascular disease – e.g. it helps prevent falls in older folks, which is important,” Lee said by email. “Thus, I believe it is never to late to initiate physical activity for overall health at any age.” \nSOURCE: bit.ly/2n7ZWzP Circulation, online January 8, 2018.", "external_links": [], "published": "2018-01-24T23:12:00.000+02:00", "crawled": "2018-01-24T23:26:52.012+02:00", "highlightTitle": ""}