{"organizations": [], "uuid": "fb8bb1b60a2496aeca84237da8b5c89202cbaf24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930556-GettyImages-897326290.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/12/why-shark-tanks-robert-herjavec-is-always-willing-to-spend-for-valet-parking.html", "country": "US", "domain_rank": 767, "title": "Why ‘Shark Tank’s’ Robert Herjavec is always willing to spend for valet parking", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.039, "site_type": "news", "published": "2018-01-14T19:00:00.000+02:00", "replies_count": 0, "uuid": "fb8bb1b60a2496aeca84237da8b5c89202cbaf24"}, "author": "Ali Montag", "url": "https://www.cnbc.com/2018/01/12/why-shark-tanks-robert-herjavec-is-always-willing-to-spend-for-valet-parking.html", "ord_in_thread": 0, "title": "Why ‘Shark Tank’s’ Robert Herjavec is always willing to spend for valet parking", "locations": [], "entities": {"persons": [{"name": "robert herjavec", "sentiment": "negative"}, {"name": "eddy chen", "sentiment": "negative"}, {"name": "herjavec", "sentiment": "none"}], "locations": [{"name": "la", "sentiment": "none"}], "organizations": [{"name": "shark tank", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Everyone has something they're willing to splurge on. For star of ABC's \"Shark Tank\" Robert Herjavec, that thing is valet parking.\n\"It's one of the things I love about LA,\" Herjavec tells CNBC Make It. \"Everywhere has valet — it saves so much time. You just pull up, get out of the car and go!\"\nHerjavec says having his car parked for him typically costs anywhere from $10 to $20, but the money is well worth it, because it's not just about convenience. It has to do with a lesson about money he learned from his father.\n\"When I was a kid, I learned that I was not very 'handy,'\" he explains, at chores like \"cutting grass, cleaning the house, [or] fixing things.\"\n\"My dad explained that all of these things needed to be done, and if I wasn't going to do them, I would have to make sure my time was worth more than the money I would pay someone to do these things for me,\" Herjavec says. \"I thought, 'Great, I better go out and make my time more valuable!'\"\nIt stuck with him.\n\"The greatest resource I have is my time,\" he continues. \"I am always trying to find ways to get more of it.\" To that end, he efficiently balances running his cybersecurity firm Herjavec Group , investing on \"Shark Tank,\" writing books and being a father, in part by planning his schedule up to a year in advance to maximize his time.\nWhile the hassle of parking may seem small, those minutes add up. On average, drivers spend 17 hours a year searching for parking sports, the USA Today reports.\nFor Herjavec, spending $15 on valet service is worth it, because he can use the time he saves to go out and make more money than he spent.\n\"In life, you rarely have these two things together — time and money,\" he explains. \"When you have an abundance of one you should try to get more of the other.\"\nAs another example, Herjavec points to air travel.\n\"Most people think traveling on a private jet is a luxury,\" he says. But the truth is, \" Most people with a private jet are not doing it for the luxury, but to save time.\"\n\"I can often save hours by flying private. There is no greater example of the cost of time than that, because every minute you are on a private plane costs money,\" he says. As the bill grows, it becomes clear: \"I better be generating more with that minute than I am spending!\"\nFellow \"Shark Tank\" investor Mark Cuban agrees. He even splurged to buy a private plane in order to save himself time.\n\"When I first really made a lot of money, I bought a plane,\" Cuban tells Money. \"That was my all-time goal because the asset I value the most is time, and that bought me time.\"\nHerjavec's advice to know when to spend — and when to save — is to understand the value of your time, and how you plan to use it.\n\"Figure out what your time is worth,\" he explains. \"If you're on a fixed income, you should not spend the money, but if you have the opportunity to create greater value with your time than what you are going to spend on something, take advantage of gaining back the time.\"\nDon't miss: Why 'Shark Tank' investor Kevin O'Leary refuses to spend $2.50 on a cup of coffee\nLike this story? Like CNBC Make It on Facebook !\nshow chapters Why Kevin O'Leary refuses to spend his money on fancy coffees 9:53 AM ET Mon, 4 Dec 2017 | 01:00 Disclaimer: CNBC owns the exclusive off-network cable rights to \"Shark Tank.\"", "external_links": [], "published": "2018-01-14T19:00:00.000+02:00", "crawled": "2018-01-14T19:02:35.029+02:00", "highlightTitle": ""}