{"organizations": [], "uuid": "faa327741e334d9e22e84afb64845a008d022951", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-aries-clean-energy-issued-21-million-equity-and-received-a-25-million-commitment-of-project-equity-from-spring-lane-capital.html", "country": "US", "domain_rank": 767, "title": "Aries Clean Energy Issued $21 Million Equity and Received a $25 Million Commitment of Project Equity from Spring Lane Capital", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.085, "site_type": "news", "published": "2018-01-10T17:30:00.000+02:00", "replies_count": 0, "uuid": "faa327741e334d9e22e84afb64845a008d022951"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-aries-clean-energy-issued-21-million-equity-and-received-a-25-million-commitment-of-project-equity-from-spring-lane-capital.html", "ord_in_thread": 0, "title": "Aries Clean Energy Issued $21 Million Equity and Received a $25 Million Commitment of Project Equity from Spring Lane Capital", "locations": [], "entities": {"persons": [], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}], "organizations": [{"name": "aries clean energy", "sentiment": "negative"}, {"name": "million equity", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NASHVILLE, Tenn., - Aries Clean Energy, LLC (Aries), designer of the world's largest downdraft gasification plant, today announced that it has issued approximately $21.4 million of new equity led by existing investors and received additional capital commitments from Spring Lane Capital of $25 million for equity in future gasification projects. Proceeds from the offering will be used to fund project development, retire debt and other general corporate purposes. Spring Lane Capital is a private equity firm focused on project finance investments for smaller-scale solutions in the energy, water, food and waste industries.\nThe financing marks a significant milestone for the emerging set of municipal and industrial-scale solutions providers in the waste management industry, which has been historically challenged to access affordable financing tailored to the needs of sub-utility scale projects in the industry.\nAries plans to use the proceeds from the investment to deploy an immediate pipeline of customer-ready projects using their proprietary waste gasification technology, as well as to accelerate business development in new markets within the U.S, increase efficiencies in current products, and advance growth outside the U.S. borders.\n\"I am pleased that Spring Lane Capital has recognized our award-winning, patented clean energy technology and wants to help share these solutions with more cities and industries,\" said Gregory L. Bafalis, CEO of Aries. \"Their model of financing distributed scale solutions is ideal for our business as we look to develop and operate a series of small-to-mid scale plants.\"\nAries' latest project is the Lebanon Gasification Initiative in Lebanon, Tennessee. At full capacity, this plant annually will keep 8,000 tons of waste from landfills and eliminate 2,500 tons of carbon emissions from the air. The syngas converted from waste can generate 1.8 million kilo-watt hours of electricity in a year.\n\"Aries Clean Energy is poised for growth, with a leading and proven technology, a wide-open market opportunity, and an experienced, high-execution management team,\" said Nikhil Garg, General Partner at Spring Lane Capital. \"This financing gives Aries the runway to accelerate the business and deploy their solution at scale while providing strong economic benefits to their municipal and industrial customers.\"\nSpring Lane Capital addresses some of the fastest growing segments of the energy, food, water and waste markets that more traditional forms of capital cannot work with at scale. The clean energy and waste/wastewater systems of Aries reduce greenhouse gas emissions and provide other economic and environmental benefits for the communities around each of its plants.\nGarg continued, \"We believe in the long-term social and economic benefits natural resource efficiency brings to everyone. My colleagues and I are pleased to support Aries Clean Energy as it pushes forward to take its technology across this country and overseas.\"\nAbout Aries Clean Energy:\nAries Clean Energy, LLC, based in Nashville, Tennessee, designs and builds innovative bio-based downdraft and fluidized bed gasification systems using its eight patents granted to date. Its projects provide for the sustainable disposal of waste, reduction of carbon emissions, and the production of clean thermal and electrical energy. The company's ongoing R&D efforts are focused on cleaning syngas produced from waste for use in internal combustion engines. For more information, please visit our website: www.ariescleanenergy.com\nAbout Spring Lane Capital:\nSpring Lane Capital is a private equity firm based in Boston, MA and focused on providing \"integrated deployment capital\" – project finance and growth capital in tandem -- for smaller-scale \"distributed\" solutions in the energy, water, food and waste industries. Our structured financial model seeks to tap into some of the fastest growing segments of these markets, that more traditional forms of project capital cannot access due to their scale and the limitations of existing investment models. Our investments are designed to accelerate businesses and deploy their solutions at scale, offering institutional investors highly risk mitigated investments with compelling project returns in these attractive long-term markets. For more information, please visit springlanecapital.com .\nMedia Contacts:\nAries Clean Energy:\nNancy Cooper\nnancy.cooper@ariesenergy.com\n615-471-9093\nSpring Lane Capital:\nCindy Stoller\ncstoller@confluencepartners.com\n917-331-0418\nView original content with multimedia: http://www.prnewswire.com/news-releases/aries-clean-energy-issued-21-million-equity-and-received-a-25-million-commitment-of-project-equity-from-spring-lane-capital-300580465.html\nSOURCE Aries Clean Energy", "external_links": ["http://www.prnewswire.com/news-releases/aries-clean-energy-issued-21-million-equity-and-received-a-25-million-commitment-of-project-equity-from-spring-lane-capital-300580465.html", "http://www.ariescleanenergy.com/", "https://www.springlanecapital.com/"], "published": "2018-01-10T17:30:00.000+02:00", "crawled": "2018-01-10T18:39:22.022+02:00", "highlightTitle": ""}