{"organizations": [], "uuid": "be6edeffe15a3d3b6c36acb78676a03d4638c6d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-synnex-corporation-announces-board-and-executive-leadership-changes.html", "country": "US", "domain_rank": 767, "title": "SYNNEX Corporation Announces Board and Executive Leadership Changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T00:15:00.000+02:00", "replies_count": 0, "uuid": "be6edeffe15a3d3b6c36acb78676a03d4638c6d8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-synnex-corporation-announces-board-and-executive-leadership-changes.html", "ord_in_thread": 0, "title": "SYNNEX Corporation Announces Board and Executive Leadership Changes", "locations": [], "entities": {"persons": [{"name": "kevin", "sentiment": "none"}, {"name": "murai", "sentiment": "none"}, {"name": "dennis polk", "sentiment": "none"}, {"name": "steffensen", "sentiment": "none"}, {"name": "dwight", "sentiment": "none"}, {"name": "kevin murai", "sentiment": "none"}, {"name": "dwight steffensen", "sentiment": "none"}], "locations": [{"name": "fremont", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "synnex corporation announces board", "sentiment": "negative"}, {"name": "synnex corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "synnex", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FREMONT, Calif., Jan. 9, 2018 /PRNewswire/ -- SYNNEX Corporation (NYSE: SNX), a leading business process services company, and its Board of Directors today announced the following board and executive leadership changes, effective March 1, 2018.\nKevin Murai will retire from his position of President and Chief Executive Officer and will become Chairman of the Board of Directors. Dennis Polk, current Chief Operating Officer, will become President and Chief Executive Officer and will remain on the Board of Directors. Dwight Steffensen will become Lead Independent Director.\n\"Over the past 10 years, Kevin has done a terrific job in growing the SYNNEX business and delivering significant shareholder return, and on behalf of the Board of Directors, I thank Kevin for his leadership and wish him the best in his retirement,\" said Mr. Steffensen.\n\"My time at SYNNEX has been an incredible journey, working with remarkable people, and achieving great things together,\" said Mr. Murai. \"I am excited to continue to serve SYNNEX as Chairman of the Board of Directors. I also want to thank Dwight for his many years of significant contributions to SYNNEX. His service has been invaluable.\"\n\"We expect the transition of Dennis to President and CEO to be seamless as Kevin and the Board have been preparing for this for some time. Dennis has been with the Company for more than 15 years, gaining greater leadership and business responsibilities, as well as successfully serving as CFO prior to his July 2006 appointment to COO. Dennis has a deep understanding of our businesses and the Board is excited to have Dennis take the reins of our Company and continue our success moving forward,\" said Mr. Steffensen.\n\"I am honored and humbled to take over the leadership role at SYNNEX. With the Company strong as ever, I look forward to working with our talented team to reach new levels of success going forward,\" said Mr. Polk.\nMr. Polk has served as a member of the Board since February 2012. Mr. Polk joined SYNNEX in February 2002 as Senior Vice President of Corporate Finance and in the same year became Chief Financial Officer. In July 2006, he was promoted to Chief Operating Officer. Mr. Polk also serves on the Board of Directors of Terreno Realty Corporation.\nAbout SYNNEX Corporation\nSYNNEX Corporation (NYSE:SNX) is a Fortune 500 corporation and a leading business process services company, providing a comprehensive range of distribution, logistics and integration services for the technology industry and providing outsourced services focused on customer engagement strategy to a broad range of enterprises. SYNNEX distributes a broad range of information technology systems and products, and also provides systems design and integration solutions. Concentrix, a wholly-owned subsidiary of SYNNEX Corporation, offers a portfolio of strategic solutions and end-to-end business services around customer engagement strategy, process optimization, technology innovation, front and back-office automation and business transformation to clients in ten identified industry verticals. Founded in 1980, SYNNEX Corporation operates in numerous countries throughout North and South America, Asia-Pacific and Europe. Additional information about SYNNEX may be found online at www.synnex.com .\nSafe Harbor Statement\nStatements in this news release regarding SYNNEX Corporation, which are not historical facts, are \" \" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These may be identified by terms such as believe, foresee, expect, may, will, provide, could and should and the negative of these terms or other similar expressions. These statements, including statements regarding the impact of the transition to a new CEO and the strength and ongoing success of the Company are subject to risks and uncertainties that could cause actual results to differ materially from those discussed in the . SYNNEX Corporation assumes no obligation to update information contained in this press release.\nCopyright 2018 SYNNEX Corporation. All rights reserved. SYNNEX, the SYNNEX Logo, CONCENTRIX, and all other SYNNEX company, product and services names and slogans are trademarks or registered trademarks of SYNNEX Corporation. SYNNEX, the SYNNEX Logo, and CONCENTRIX Reg. U.S. Pat. & Tm. Off. Other names and marks are the property of their respective owners.\nSNX-F\nView original content: http://www.prnewswire.com/news-releases/synnex-corporation-announces-board-and-executive-leadership-changes-300580305.html\nSOURCE SYNNEX Corporation", "external_links": ["http://www.prnewswire.com/news-releases/synnex-corporation-announces-board-and-executive-leadership-changes-300580305.html", "http://www.synnex.com/"], "published": "2018-01-10T00:15:00.000+02:00", "crawled": "2018-01-10T02:21:49.000+02:00", "highlightTitle": ""}