{"organizations": [], "uuid": "0bad3ac08218e749c708c545a6c2d5b50327e71b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-weather-natgas-prices/u-s-northeast-gas-prices-drop-as-extended-freeze-thaws-idUSKBN1EX1AX", "country": "US", "domain_rank": 408, "title": "U.S. Northeast gas prices drop as extended freeze thaws", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:37:00.000+02:00", "replies_count": 0, "uuid": "0bad3ac08218e749c708c545a6c2d5b50327e71b"}, "author": "", "url": "https://www.reuters.com/article/us-usa-weather-natgas-prices/u-s-northeast-gas-prices-drop-as-extended-freeze-thaws-idUSKBN1EX1AX", "ord_in_thread": 0, "title": "U.S. Northeast gas prices drop as extended freeze thaws", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s. northeast", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}], "organizations": [{"name": "u.s. northeast", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "iso", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:43 PM / a few seconds ago U.S. Northeast gas prices drop as extended freeze thaws Reuters Staff 3 Min Read \n(Reuters) - Spot natural gas prices in the U.S. Northeast for Monday dropped on forecasts for less cold weather this week after they soared to all-time highs last week during an extended freeze. \nNext-day gas in New England dropped to $20.25 per million British thermal units for Monday from a record $82.75 for Friday, according to data from brokerage firm SNL going back to 1995. The prior high was $77.60 set during the polar vortex in January 2014. \nSpot gas prices in New York City collapsed to $12.65/mmBtu from a record $140.25, according to data going back to 1992. The prior high was $120.75 in January 2014. \nIn 2017, next-day gas prices averaged $3.80/mmBtu in New England and $3.08/mmBtu in New York. \nISO New England, operator of the six-state region’s power system, said on its website there were enough resources available to meet forecast demand and reserves on Monday. \nThe ISO, however, warned in an email on Sunday that challenges remained for the region’s power system primarily because of fuel availability. \nGas prices in the Northeast usually spike on the coldest winter days as homes and businesses use most of the region’s gas supplies for heating, leaving little for generators to burn in power plants. That forces the generators to burn more oil instead of gas. \nDuring the extreme cold over the past two weeks, the ISO said some power plants either shut or had to reduce output, while other oil-fired units were quickly depleting their fuel supply. \nThe ISO said other conditions making grid operations difficult included the continued shutdown of Entergy Corp’s Pilgrim nuclear plant, emissions limits at some oil-fired generation and delays in oil fuel deliveries at oil plants due to a snowstorm on Thursday. \nBut, with temperatures expected to warm this week, the ISO projected power grid conditions would improve and offer a window for fuel replenishment. \n“Such fuel replenishment is critical to handle any future cold snap,” the ISO said. \nTemperatures in New York City and Boston have remained below freezing since the day after Christmas, but were expected to return to near seasonal levels in the low 30s Fahrenheit (over zero Celsius) on Monday and rise into the 50s later this week, according to meteorologists at AccuWeather. Normal highs for this time of year are 36 degrees in Boston and 38 in New York. Reporting by Scott DiSavino; Editing by Andrew Hay", "external_links": [], "published": "2018-01-08T15:37:00.000+02:00", "crawled": "2018-01-08T15:59:16.015+02:00", "highlightTitle": ""}