{"organizations": [], "uuid": "14b5cbe90535d490188f8210286519bd919d191e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/03/13/102503603-RTR4S6C5.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/what-is-5g.html", "country": "US", "domain_rank": 767, "title": "What is 5G?", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-01-29T21:22:00.000+02:00", "replies_count": 0, "uuid": "14b5cbe90535d490188f8210286519bd919d191e"}, "author": "Michelle Castillo", "url": "https://www.cnbc.com/2018/01/29/what-is-5g.html", "ord_in_thread": 0, "title": "What is 5G?", "locations": [], "entities": {"persons": [{"name": "aijt pai", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "barcelona", "sentiment": "none"}], "organizations": [{"name": "reuters an sk", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "fcc", "sentiment": "none"}, {"name": "national security council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Gustau Nacarino | Reuters An SK telecom exhibitor directs the robot's movements using 5G at the Mobile World Congress in Barcelona, March 5, 2015. \nA report from Axios yesterday suggesting the Trump administration was looking at nationalizing a 5G cellular network has people discussing the potential the standards could have on the evolution of connected devices. \nThe Trump administration has since denied the report, saying it has no plans to build its own 5G network , and an official at the National Security Council also told CNBC the plans were very early and not likely to happen. FCC Chaiman Aijt Pai opposed the plans in a statement, adding a government-sponsored network would be \"costly and counterproductive.\" \nSo what's all the fuss over? What exactly is 5G, and why should we care? What is 5G supposed to do? \nCell phones first started out on an analog network that allowed people to communicate using brick-like mobile phones . The standards evolved to 2G, which allowed for digital service and expanded voice communication. 3G allowed for the use of data, letting us connect to the internet with our phones. 4G's main innovation was speed, allowing people to access data about 10 times faster than 3G. \n5G would improve wireless networks in several areas: \nFaster data transfer. The proposed 5G standards would theoretically be 10 times faster than 4G, allowing people to access items on their phone that require more data quickly. It could come in useful when streaming 4K live TV or a VR application on your mobile device. \n\"It's not really made so your videos are going to stream better on Facebook,\" said Gartner principal research analyst Bill Menezes. \"But to be able to stream television in addition to internet access, in that respect you'll need 5G -- especially to stream 4K ultra-high-definition television.\" \nQuicker response time. 5G would also reduce latency, or the amount of time it takes data to be transferred from device to device. This would especially be important for connected devices that need quick reaction times, like connected cars that may need to slam on breaks or robotic surgery devices where a millimeter could mean the difference between life and death. \n\"It could enable the 'tactile internet,' where the latency is so short when you are doing something you are filling the other end because the feedback is so quick,\" Gartner research vice president Mark Hung said. \nMore devices. The technology allows cell towers to support more devices, which means hundreds of thousands of Internet of things objects could connect using cellular networks. It would also allow for 5G modems, which would allow customers to use cellular networks to connect to the internet at home instead of using phone lines or cable modems. The difference between theoretical and real world \nIt's important to note the 5G standards being proposed are theoretical and may live up to these promises. \n\"This is all in writing until it is formally ratified, based on physics,\" Menezes said. \"Physics says if you design it this way you'll have that theoretical performance.\" \nCase in point: The 4G network has a top speed of 300 megabits per second, but you'll probably only get that speed if you're right next to a cell tower and the only device on it, Menezes explained. Current average speeds in the U.S. are around 40 to 50 megabits per second, Hung said. \n5G could potentially hit 1 gigabit per second, but probably just will be around 10 times faster than our current speeds. \n\"In the real world, you've got interference and things that weaken the system,\" Menezes said. \"It can fall way below that theoretical limit.\" \nWe're also a few years away from a full-fledged 5G network. The standards are on pace to be ratified by 2020, Menezes said. AT&T , Verizon and T-Mobile are doing field testing in limited areas right now, but widespread 5G networks in the U.S. won't probably be ready until 2022 to 2023, he added. \nBut if you're curious about what 5G could mean, South Korea is testing out its 5G network during the upcoming Winter Olympics. The demos will probably just show off basic connected cars and 4K TV live streaming in a small area rather than its full capabilities, Menezes pointed out.", "external_links": [], "published": "2018-01-29T21:22:00.000+02:00", "crawled": "2018-01-29T21:23:24.005+02:00", "highlightTitle": ""}