{"organizations": [], "uuid": "aba985e128116f00942684423d53a6e109703db3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-eyegate-promotes-sarah-romano-to-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "EyeGate Promotes Sarah Romano to Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:30:00.000+02:00", "replies_count": 0, "uuid": "aba985e128116f00942684423d53a6e109703db3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-eyegate-promotes-sarah-romano-to-chief-financial-officer.html", "ord_in_thread": 0, "title": "EyeGate Promotes Sarah Romano to Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "sarah romano", "sentiment": "negative"}, {"name": "sarah", "sentiment": "none"}, {"name": "stephen from", "sentiment": "none"}, {"name": "romano", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}], "organizations": [{"name": "eyegate pharmaceuticals, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass., Jan. 04, 2018 (GLOBE NEWSWIRE) -- EyeGate Pharmaceuticals, Inc. (NASDAQ:EYEG) (“EyeGate” or the “Company”), a clinical-stage, specialty pharmaceutical company with two platform technologies for treating diseases and disorders of the eye, today announced the promotion of Sarah Romano from Interim Chief Financial Officer to Chief Financial Officer, effective January 1, 2018.\n“I am pleased to announce Sarah’s promotion to Chief Financial Officer. Since joining EyeGate nearly two years ago, Sarah has been actively involved in the development of our financial systems and processes, and she has been responsible for all corporate finance and accounting activities of the Company since becoming Interim Chief Financial Officer last year. Sound financial planning and implementation are increasingly important as our pipeline advances through the clinic and into commercialization. With her deep understanding of our business, Sarah is well suited to lead our finance team,” commented Stephen From, President and Chief Executive Officer of EyeGate.\nMs. Romano joined EyeGate in 2016 serving as Corporate Controller. She was promoted to Interim Chief Financial Officer on February 1, 2017.\nPrior to joining EyeGate, Ms. Romano served as Assistant Controller at TechTarget and Corporate Controller at Bowdoin Group, a healthcare-focused executive recruiting firm. Previously, she held financial reporting positions of increasing responsibility at SoundBite Communications until its acquisition by Genesys in 2013, and was a Senior Financial Reporting Analyst at Cognex Corporation, a publicly-traded manufacturer of machine vision systems, software and sensors. Ms. Romano began her career as an Auditor in the Boston office of PricewaterhouseCoopers. A licensed CPA in Massachusetts, she holds a Bachelor of Arts in Accounting from College of the Holy Cross and Masters of Accounting from Boston College.\n“I am truly excited and grateful to be promoted to this position, especially at such a critical time in EyeGate’s corporate development. I look forward to continue working with Stephen and our talented team as we focus on executing our growth strategy and driving value for our shareholders,” added Sarah Romano, Chief Financial Officer of EyeGate.\nAbout EyeGate\nEyeGate is a clinical-stage specialty pharmaceutical company focused on developing and commercializing products using its two proprietary platform technologies for treating diseases and disorders of the eye.\nEyeGate’s CMHA-S platform is based on cross-linking thiolated carboxymethyl hyaluronic acid, a modified form of the natural polymer hyaluronic acid (“HA”). This is a gel that possesses unique physical and chemical properties such as hydrating and healing when applied to the ocular surface. The ability of CMHA-S to adhere longer to the ocular surface, resist degradation and protect the ocular surface makes it well-suited for treating various ocular surface injuries.\nEGP-437, EyeGate’s other product in clinical trials, incorporates a reformulated topically active corticosteroid, Dexamethasone Phosphate, that is delivered into the ocular tissues through EyeGate’s proprietary innovative drug delivery system, the EyeGate II Delivery System. www.EyeGatePharma.com .\nEyeGate Social Media\nEyeGate uses its website ( www.EyeGatePharma.com ), Facebook page , corporate Twitter account , and LinkedIn page as channels of distribution of information about EyeGate and its product candidates. Such information may be deemed material information, and EyeGate may use these channels to comply with its disclosure obligations under Regulation FD. Therefore, investors should monitor EyeGate’s website and its social media accounts in addition to following its press releases, SEC filings, public conference calls, and webcasts. The social media channels that EyeGate intends to use as a means of disclosing the information described above may be updated from time to time as listed on EyeGate’s investor relations website.\nForward-looking Statements\nSome of the statements in this press release are “forward-looking” and are made pursuant to the safe harbor provision of the Private Securities Litigation Reform Act of 1995. These “forward-looking” statements include statements relating to, among other things, the commercialization efforts and other regulatory or marketing approval efforts pertaining to EyeGate’s products, including EyeGate’s EGP-437 combination product and those of Jade Therapeutics, Inc., a wholly owned subsidiary of EyeGate, as well as the success thereof, with such approvals or success may not be obtained or achieved on a timely basis or at all. These statements involve risks and uncertainties that may cause results to differ materially from the statements set forth in this press release, including, among other things, certain risk factors described under the heading “Risk Factors” contained in our Annual Report on Form 10-K filed with the SEC on February 23, 2017 or described in EyeGate’s other public filings. EyeGate’s results may also be affected by factors of which EyeGate is not currently aware. The forward-looking statements in this press release speak only as of the date of this press release. EyeGate expressly disclaims any obligation or undertaking to release publicly any updates or revisions to such statements to reflect any change in its expectations with regard thereto or any changes in the events, conditions or circumstances on which any such statement is based.\nContact:\nLee Roth / Janhavi Mohite\nThe Ruth Group for EyeGate Pharmaceuticals\n646-536-7012 / 7026\nlroth@theruthgroup.com / jmohite@theruthgroup.com\nSource:EyeGate Pharmaceuticals, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/1ab89b7b-be2b-4b62-b177-df27e4d95325", "https://www.globenewswire.com/Tracker?data=CQKX-ADm7LGwSQBzkijCg42wJKbh9onOgeJalGVrLq3F__DF4U4QuMGTrfvSZNtsIe8tz4y2qM4FUPXLQVkqZ1dZiaBy0n5zmrhBaxyhs9c=", "https://www.globenewswire.com/Tracker?data=VXlweETyQrr5kBqhq_TMUarOTKlY8Gyu7soVUN_qhz9gmTHyjFzkH1r-NooWe0XI6wxkJRjxgf55yZToBuOxGsFEDOEMXttMMsaU-GOMKhM=", "https://www.globenewswire.com/Tracker?data=LDS6Op0aDQzC3L-kccsD1BhcsupLui-R2anDvSR28AFYctSsKg5-gpW-yzOTv6bV2dKdSO_UbaTTKN7wcpaUUDdLMG62k_N07IZRil3trl0=", "https://www.globenewswire.com/Tracker?data=CQKX-ADm7LGwSQBzkijCg42wJKbh9onOgeJalGVrLq0fQfk1_rAoLd_gIcCOqrIa9qkY8B6QHVNKqr7dJAlMsOTSSTrFoW-UCB4oot2DFNh141hxMRmPxLiGq3sm4ltQTKHkU4Mbb7CG0lErUx_NHgMztkOwCvshjAnb8uW-b24k1-kN2hSl2ALPRFSWG1nYNP4e8nZqZnC2o5y5jB7PRe3fMKK0mNtsGWxnNNiUStWls2hQmTdD12ZX4yaNtZeWxwkTQq7nONOuJuvIw7GQa3Df-3ZIj0YQj0hAdzUGF3IQA7qv69FswPWkBdg5ZqBqbujwOK4dWMAUt5s2Kv4jDugxKmqXrKvcEiqSIhKfWyGU-e92jcqd-qPMKHw3JaJ9teJf8If0Z1jIi9u1ngWNWqZ-gkDBuGvyLfd4BkOpN9uc-rIX3IUOmpLOIKNnP6ntt0mRSSz35EzhGrxJFfqZWxzzSTKkci2BJEXt_fz", "https://www.globenewswire.com/Tracker?data=2-3aBoe9yRAw4lbKqzShMDRioyDBC4OWRUSEh-MnqRPtxWE5-txDfvb2ehriuUDhhsQQPWhJ6kg_hrAcrpW7CvvZJd8a3or5qN2rLmgQML8=", "https://www.globenewswire.com/Tracker?data=kQdKnjnt9BFqW-NNdRq384odGeb5idhMhje_CCb5f8xuIIDpwROdvc1L6Qq4kxyb2ZJnGOCWkBvgqZXPaw0TxhmzNJ1yp9jYuFiYiWv8f54=", "https://www.globenewswire.com/Tracker?data=7Bgn7U9p1jCHe1krF2MeXHLnGQGd6pfvcrTLI4BFEEm-BbLeE8kX_keGtFOsgz6bj2KqUWhrz5-IIx-FPf-tbT2y7S3qiRcatvtFIHk4Vvs="], "published": "2018-01-04T16:30:00.000+02:00", "crawled": "2018-01-04T16:41:29.000+02:00", "highlightTitle": ""}