{"organizations": [], "uuid": "bbb1ed94e45e76609b26f77afb42d6c3fabcbec7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/02/10/103378560-GettyImages-588095509.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/10000115/device/rss/rss.html", "section_title": "Real Estate", "url": "https://www.cnbc.com/2018/01/19/londons-almost-toxic-housing-market-might-not-give-investors-the-returns-they-are-looking-for.html", "country": "US", "domain_rank": 767, "title": "London's 'almost toxic' housing market might not give investors the returns they are looking for", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-19T16:14:00.000+02:00", "replies_count": 0, "uuid": "bbb1ed94e45e76609b26f77afb42d6c3fabcbec7"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/19/londons-almost-toxic-housing-market-might-not-give-investors-the-returns-they-are-looking-for.html", "ord_in_thread": 0, "title": "London's 'almost toxic' housing market might not give investors the returns they are looking for", "locations": [], "entities": {"persons": [{"name": "tom sharman", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "southwark", "sentiment": "none"}], "organizations": [{"name": "real estate finance", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "natwest", "sentiment": "none"}, {"name": "lsl acadata", "sentiment": "none"}, {"name": "cbre", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "London housing has become less attractive for investors as they see limited room for prices to pick up in the U.K.'s expensive capital city, according to analysts.\nBrexit and higher taxes to purchase a house have also increased concerns over investment opportunities in London, with investors considering opportunities elsewhere.\n\"There seems limited scope for price growth in London this year, although outer boroughs that offer a combination of connectivity and affordability will benefit from policies supporting first-time buyers,\" Tom Sharman, NatWest's head of strategy for Real Estate Finance, told CNBC via email.\nAccording to data from housing market consultancy LSL Acadata, house prices in the central London dropped massively in 2017. In the borough of Southwark, prices dropped 21.1 percent in the year to November, while in the City of Westminster prices dropped 19.4 percent in the same period.\nHowever, the data for each borough is mixed, depending on where it originated from. For instance, real estate services provider CBRE reported that house prices in Southwark actually increased 1 percent throughout 2017 .\n\"One has to be cautious when analyzing pricing data for relatively small areas. These can be quite volatile,\" Sharman said. \"Nonetheless, there are signs that pricing has come off in parts of London over the last year.\"\nWhat to expect in 2018? \"Prices in the most expensive parts of central London have already corrected over the last few years and this seems likely to ripple outwards this year,\" Sharman said. \"Transaction costs have been a major stumbling block for prospective buyers, particularly in higher value locations, and they will be looking for vendors to share some of the pain.\"\nDespite lower growth opportunities in London housing, investors are also cautious following the U.K.'s decision to leave the European Union.\n\"I blame Brexit,\" Thomas Schneider, chief investment officer and founder of online marketplace BrickVest, told CNBC when asked about why house prices in the capital have lowered.\nBrexit and taxes Brexit has created uncertainty, such as how many people from high-paying jobs could end up leaving the city, thus decreasing the demand for purchasing homes.\n\"From an investor point of view, people currently don't want to touch London. The U.K. overall is attractive but I would define London almost toxic due to the uncertainty,\" Schneider told CNBC.\nHe said that although there is investor interest for housing in the U.K., London is less attractive compared to other cities, such as Liverpool, where Brexit is unlikely to have a big economic impact.\nA spokesperson for CBRE told CNBC via email: \"We would attribute slower sales in the mainstream market partly to the introduction of additional stamp duty in 2018, which our latest data suggests did cause a fall in sales during the latter half of the year (2017).\"\nStamp duty is the tax on purchasing a house.\nBut the CBRE noted one specific area that might still prove attractive to money managers. \"The new build sector has mostly bucked this trend and we have seen robust growth in this market,\" the spokesperson said.", "external_links": ["https://www.cbreresidential.com/uk/sites/uk-residential/files/CBRE%20Borough%20By%20Borough%202017.pdf"], "published": "2018-01-19T16:14:00.000+02:00", "crawled": "2018-01-19T16:41:27.000+02:00", "highlightTitle": ""}