{"organizations": [], "uuid": "fecbe69c355a06672b7652b2cd58885758946cb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-southkorea-fire/blaze-in-south-korean-hospital-kills-eight-injures-dozens-idUSKBN1FF04N", "country": "US", "domain_rank": 408, "title": "Blaze in South Korean hospital kills eight, injures dozens", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T03:16:00.000+02:00", "replies_count": 0, "uuid": "fecbe69c355a06672b7652b2cd58885758946cb7"}, "author": "", "url": "https://www.reuters.com/article/us-southkorea-fire/blaze-in-south-korean-hospital-kills-eight-injures-dozens-idUSKBN1FF04N", "ord_in_thread": 0, "title": "Blaze in South Korean hospital kills eight, injures dozens", "locations": [], "entities": {"persons": [{"name": "lee nak-yeo", "sentiment": "none"}, {"name": "choi man-woo", "sentiment": "none"}, {"name": "choi", "sentiment": "none"}], "locations": [{"name": "sejong hospital", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "miryang", "sentiment": "none"}], "organizations": [{"name": "ytn", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 1:17 AM / in 6 hours South Korean hospital blaze kills at least 37, fleeing patients brave flames Christine Kim 6 Min Read \nMIRYANG, South Korea (Reuters) - Once famous for an award-winning film of the same name, the South Korean city of Miryang became a scene of horror on Friday as flames and toxic smoke swept through a hospital, killing at least 37 people and injuring more than 140. \nSouth Korea’s deadliest fire in almost a decade followed one last month that killed 29 people, reviving concern over safety standards, as the hospital director said current law did not require the building to have a sprinkler system. \n“So many lives were sacrificed and the people of our city, as well as those throughout the country, have fallen into deep grief,” the city’s mayor, Park Il-ho, told reporters, appearing visibly distressed. \nMany patients “walked though fire and smoke” to escape from the Sejong Hospital as the main exit was on the first floor, which was ablaze, a city official told Reuters. \nThose on upper floors used ladders and plastic escape slides to flee, while firefighters carried some who could not walk. \n“I saw the elderly patients scrambling out through the windows and had to help,” said Woo Young-min, 25, as he stood in his pyjamas outside the hospital. \nThe presidential Blue House initially said the number of dead was at least 41, but deferred to a toll of 37 from the fire chief of Miryang, which is about 270 km (170 miles) southeast of Seoul, the capital, and home to about 108,000 people. \nFire officials posted a list of at least 26 victims outside the hospital, their ages ranging from 34 to 96 years, with at least a score over 70. \nFamilies crowded round a handwritten list of names and hospital rooms that officials had scrawled on a wall at a nearby funeral home. \nThe fire broke out around 7.30 a.m. (2230 GMT) at the rear of the emergency room on the hospital’s first floor, fire official Choi Man-woo told a televised news briefing. \nThe street outside the hospital featured in the 2007 South Korean drama “Miryang,” or “Secret Sunshine,” which garnered awards at Cannes and other film festivals. \nBut on Friday, witnesses described scenes of chaos in the sub-freezing temperatures, as nearby residents rushed to take portable hotpacks to shivering victims. \nWoo said he was walking home after working a graveyard shift when he saw the fire and patients trying to escape the blaze. \n“The firefighters were shouting at us not to go inside the building, so I stayed and helped others bring the patients down the slides.” \nTelevision broadcast images of black smoke billowing from the windows and entrance of the hospital as flames flickered. \nAt least 177 patients - most of them elderly - were at the hospital and an adjacent nursing home when the fire broke out, hospital director Song Byeong-cheol told reporters. \nSong said three of the nine hospital staff on duty at the time died, including at least one doctor, a nurse, and a nurse’s aide, all killed on the second floor. Smoke rises from a burning hospital in Miryang, South Korea, January 26, 2018. Kim Dong-min/Yonhap via REUTERS \nMost of those who died were on the first and second floors, said Choi, but added that there were no deaths from burns. \nSeven people were critically injured, while 126 had less serious wounds, officials told a Friday evening briefing. \nThe injured were treated at 14 regional hospitals. \nBy Friday afternoon, police had cordoned off the burnt-out hospital, as forensic investigators combed the smoke-blackened building. Charred debris and shattered glass littered the ground outside. NO SPRINKLER SYSTEM \nAsia’s fourth-largest economy, with one of the world’s fastest ageing populations, South Korea has faced criticism in recent years over inadequate safety standards. Slideshow (3 Images) \nSong said the six-storey hospital did not have a sprinkler system and was not large enough to require one under the law. \nThe nursing home annexe, where no patients died, is covered by a new law, however, and Song said the hospital had planned to begin installing a sprinkler system there next week. \nHealth Minister Park Neung-hoo said the government would consider changing the law. \nInterior ministry guidelines published in December 2016 suggest sprinklers for all buildings of six or more storeys. \nOfficials said they were still investigating the cause of the fire, but were looking at a possible short circuit in the emergency room’s heating and cooling system. \n“According to an initial eyewitness, fire broke out where there are two air-conditioning and heating devices in the emergency room,” Song said. \n“Others said an electric spark occurred on the ceiling of the emergency room and then fire spread quickly.” \nThe hospital had regular safety inspections and was built to government standards, with fire exits and extinguishers, many of which were used during the fire, he added. \nPresident Moon Jae-in held an emergency meeting with top aides and urged “all necessary measures” to help survivors. \nInterior Minister Kim Boo-kyum, who visited Miryang to apologise for the fire, promised government help for victims, Yonhap news agency said. \nIn December, 29 people were killed in a blaze at an eight-storey fitness centre in Jecheon City, most of them women trapped in a sauna by toxic fumes. The event fed anger over reports of shoddy construction, among other shortcomings. \nIn 2014, a fire at a rural hospital killed 21 people, while a 2008 warehouse fire outside Seoul killed 40. Reporting by Christine Kim; Additional reporting Yuna Park, Dahee Kim and Hyonhee Shin; Writing by Josh Smith; Editing by Simon Cameron-Moore and Clarence Fernandez", "external_links": [], "published": "2018-01-26T03:16:00.000+02:00", "crawled": "2018-01-26T03:34:54.000+02:00", "highlightTitle": ""}