{"organizations": [], "uuid": "3336dbbbaf673308bf1d202e5b42b02c09c9bbc9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220696713&w=1200&r=LYNXMPEE0902T", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/us-australia-weather/corals-die-farmers-suffer-through-australias-third-hottest-year-idUKKBN1EZ05Y", "country": "US", "domain_rank": 408, "title": "Corals die, farmers suffer through Australia's third-hottest year", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T04:07:00.000+02:00", "replies_count": 0, "uuid": "3336dbbbaf673308bf1d202e5b42b02c09c9bbc9"}, "author": "", "url": "https://uk.reuters.com/article/us-australia-weather/corals-die-farmers-suffer-through-australias-third-hottest-year-idUKKBN1EZ05Y", "ord_in_thread": 0, "title": "Corals die, farmers suffer through Australia's third-hottest year", "locations": [], "entities": {"persons": [{"name": "blair trewin", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "bureau of meteorology", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "el nino", "sentiment": "none"}, {"name": "australian broadcasting corporation radio", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 2:16 AM / a few seconds ago Corals die, farmers suffer through Australia's third-hottest year Reuters Staff 3 Min Read \nSYDNEY (Reuters) - Australia had its third-hottest year on record in 2017, the country’s weather bureau said on Wednesday, as global warming changed the continent’s climate and farmers warned unpredictable seasons are hurting the $47 billion agricultural sector. A shed and line of trees can be seen in a paddock on a farm located on the outskirts of Melbourne in Australia, January 9, 2018. REUTERS/David Gray \nUnusually, the high heat last year came despite the absence of an El Nino weather system in the Pacific, which tends to warm Australia, the Bureau of Meteorology said in its annual climate statement. \n“I think what it illustrates is even without the strong driver of an El Nino, the world is still producing very warm temperatures,” Blair Trewin, a senior climatologist at the bureau told Australian Broadcasting Corporation radio. \nDuring 2017 hotter ocean temperatures near Australia’s northeast coast prompted “significant” coral bleaching along the world-heritage-listed Great Barrier Reef, the first time it had occurred in consecutive summers. \nThe national mean temperature was nearly one degree Celsius above average, with the heat “mostly associated” with human-caused global warming that also reduced rainfall in Australia’s south, the bureau’s statement said. \nThat made for the driest September ever recorded in crucial grain-growing regions of New South Wales and the Murray-Darling riverbasin, with heavy rains then hitting during harvest and making it even more difficult for farmers. Small dams and lines of trees can be seen in a paddock on a farm located on the outskirts of Melbourne in Australia, January 9, 2018. REUTERS/David Gray \nThe world’s fourth largest wheat exporter is set for its smallest crop in a decade. \n“It’s really the unpredictability of it rather than the actual event,” said Matt Dalgleish, a market analyst at agricultural advisory firm Mecardo. \n“Farmers are used to dealing with different weather as long as it can run within a reasonably predictable pattern and sit reasonably close to the seasons they expect - it’s when you get these events that are uncharacteristically out of season that cause the most amount of heartache.” \nSeven of Australia’s 10 warmest years have occurred since 2005, the bureau found, and another hotter-than-average year is expected in 2018, which has already brought heatwave conditions to the country’s southeast. \nSydney on Sunday sweltered through its hottest day in 80 years, while highway bitumen melted in Victoria state and bushfires burned out of control. In the northwest, a tropical storm is gathering and forecast to make landfall at cyclone-strength between Broome and Port Hedland on Saturday. \nGlobally it is likely 2017 will be the second- or third-warmest year on record since 1850, the Australian Bureau of Meteorology said. Reporting by Tom Westbrook; Editing by Michael Perry", "external_links": [], "published": "2018-01-10T04:07:00.000+02:00", "crawled": "2018-01-10T04:25:29.003+02:00", "highlightTitle": ""}