{"organizations": [], "uuid": "05ae0a475b5517310a0693b6126999ac5d872534", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-timefirevr-invests-in-ethereum-while-strategically-evaluating-acquisitions-in-initial-coin-offerings-mining-and-blockchain.html", "country": "US", "domain_rank": 767, "title": "TimefireVR Invests in Ethereum while Strategically Evaluating Acquisitions in Initial Coin Offerings, Mining and Blockchain Technology", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-09T16:31:00.000+02:00", "replies_count": 0, "uuid": "05ae0a475b5517310a0693b6126999ac5d872534"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-timefirevr-invests-in-ethereum-while-strategically-evaluating-acquisitions-in-initial-coin-offerings-mining-and-blockchain.html", "ord_in_thread": 0, "title": "TimefireVR Invests in Ethereum while Strategically Evaluating Acquisitions in Initial Coin Offerings, Mining and Blockchain Technology", "locations": [], "entities": {"persons": [{"name": "jonathan read", "sentiment": "none"}], "locations": [{"name": "ariz.", "sentiment": "none"}, {"name": "ethereum", "sentiment": "none"}, {"name": "blockchain technology scottsdale", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SCOTTSDALE, Ariz., Jan. 09, 2018 (GLOBE NEWSWIRE) -- TimefireVR, Inc. (OTCQB:TFVR) (the \"Company\") today announced investing in the cryptocurrency Ethereum as part of the Company’s shift in corporate focus towards strategic investments in cryptocurrency and potential acquisitions of blockchain technology businesses. Ethereum is a leading blockchain platform for Decentralized Applications (“DApps”) that run on a peer-to-peer network of computers instead of on one single computer or server.\n“We are pleased to make our first investment in blockchain technology as part of our renewed corporate strategy. We firmly believe in our investment in Ethereum, which in our opinion represents a long-term growth asset in the field,” stated Jonathan Read, Chief Executive Officer of TimefireVR.\nConcurrent with the Company’s initial investment in Ethereum, TimefireVR is engaged in differing stages of evaluating, reviewing and in one instance negotiating potential acquisitions in initial coin offerings, cryptocurrency mining, and blockchain software systems. Going forward, we intend to consider other target acquisitions in the blockchain technology industry.\nMr. Read continued, “It is our intention to have a balanced operating business portfolio complimented by investments in cryptocurrencies. By diversifying and managing our risk portfolio, we are confident in our ability to succeed in creating strong shareholder value in cryptocurrency and blockchain technology.”\nAbout TimefireVR Inc.\nTimefireVR Inc. is an Arizona based technology company now focused on strategic investments in blockchain technology solutions. Previously, the Company developed virtual reality content, tools, and services.\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains forward-looking statements, including statements regarding our continued investments in cryptocurrency and potential investments in blockchain technology businesses and the long-term shareholder value expected to be created. The words \"believe,\" \"may,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"should,\" \"plan,\" \"could,\" \"target,\" \"potential,\" \"is likely,\" \"will,\" \"expect\" and similar expressions, as they relate to us, are intended to identify forward-looking statements. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends that we believe may affect our financial condition, results of operations, business strategy and financial needs. Some or all of the results anticipated by these forward-looking statements may not be achieved, Important factors that could cause actual results to differ from those in the forward-looking statements include the Company's need for capital, the future condition of the capital markets in general and the market for microcap securities, regulatory and other developments in the markets for crypto currency including substantial price declines, intense competition for acquisition of blockchain technology companies which may affect the purchase price and difficulties in negotiating and closing any potential acquisition including the absence of audited financial statements.. Further information on our risk factors is contained in our filings with the SEC, including the Annual Report on Form 10-K for the year ended December 31, 2016. Any forward-looking statement made by us herein speaks only as of the date on which it is made. Factors or events that could cause our actual results to differ may emerge from time to time, and it is not possible for us to predict all of them. We undertake no obligation to publicly update any forward-looking statement, whether as a result of new information, future developments or otherwise, except as may be required by law.\nInvestor Contact:\nKCSA Strategic Communications\nValter Pinto, Managing Director\n212.896.1254\nValter@KCSA.com\nwww.KCSA.com\nSource:TimefireVR, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=41lOsmcksLxTExDbhfW-ACCgNy6ik-4JKDizoNz79HlEl0sxUTI8Dq9K4KFf-VCOyhHZvOXfgc8ZJ4s5eCVIZg==", "https://www.globenewswire.com/Tracker?data=J4MWH8ukagO1lMF03HHGhPeF4DRSwGBgyoFb8pcxtK7LrSMUrs2s7Rho5VpZJktneHwV83XgN7Mvslk9X_VFlg=="], "published": "2018-01-09T16:31:00.000+02:00", "crawled": "2018-01-09T18:48:53.010+02:00", "highlightTitle": ""}