{"organizations": [], "uuid": "a4c45b93e23ed81c36d66f8f1750e3ac0e66bc6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/safrica-politics-naspers/update-1-south-africas-naspers-wont-renew-contract-with-tv-station-sold-by-guptas-idUSL8N1PQ4TK", "country": "US", "domain_rank": 408, "title": "UPDATE 1-South Africa's Naspers won't renew contract with TV station sold by Guptas", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:06:00.000+02:00", "replies_count": 0, "uuid": "a4c45b93e23ed81c36d66f8f1750e3ac0e66bc6d"}, "author": "", "url": "https://www.reuters.com/article/safrica-politics-naspers/update-1-south-africas-naspers-wont-renew-contract-with-tv-station-sold-by-guptas-idUSL8N1PQ4TK", "ord_in_thread": 0, "title": "UPDATE 1-South Africa's Naspers won't renew contract with TV station sold by Guptas", "locations": [], "entities": {"persons": [{"name": "gupta", "sentiment": "none"}, {"name": "zuma", "sentiment": "none"}, {"name": "jacob zuma", "sentiment": "none"}, {"name": "mzwanele manyi", "sentiment": "none"}, {"name": "gu", "sentiment": "none"}], "locations": [{"name": "africa", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "guptas", "sentiment": "none"}], "organizations": [{"name": "naspers", "sentiment": "negative"}, {"name": "african news network 7", "sentiment": "none"}, {"name": "guptas reuters staff", "sentiment": "none"}, {"name": "multichoice", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 2:09 PM / in 39 minutes UPDATE 1-South Africa's Naspers won't renew contract with TV station sold by Guptas Reuters Staff 3 Min Read \n(Adds quotes, details, background) \nJOHANNESBURG, Jan 31 (Reuters) - A unit of African media and e-commerce giant Naspers said on Wednesday it would not renew its contract with African News Network 7, formerly owned by friends of President Jacob Zuma, citing controversy around owners of the TV channel. \nThe decision to not renew the contract, effective from August, comes after an internal investigation by MultiChoice into its own corporate governance failures after a group of investigative journalists raised questions about payments it made to African News Network 7 (ANN7). \nUntil August 2016 ANN7 belonged to the Gupta family - whose members include a trio of businessmen accused of using their ties to Zuma to amass wealth and influence government policy. \nThe Guptas and Zuma deny any wrongdoing. \nMzwanele Manyi, a staunch Zuma supporter, bought the channel from the Guptas in 2016, along with a newspaper, but used loans provided by Gupta-controlled holding company Oakbay Investments. \n“It is evident from the findings (of the MultiChoice internal investigation) that the presently polarised political environment in South Africa and controversy around the ANN7 channel ownership demanded a higher level of diligence and scrutiny than was the practice previously,” Naspers said in a statement on Wednesday. \nCivil society groups have lobbied MultiChoice to remove ANN7 from its platform, saying the channel is running a divisive campaign in support of Zuma. \nThe groups’ calls came after amaBhungane, a group of investigative journalists, released some of more than 100,000 leaked emails and documents implicating government officials and companies in a graft scandal that has piled pressure on Zuma and deepened splits in the ruling African National Congress party. \nMultiChoice’ Chief Executive Calvo Mawela told reporters that the company’s internal investigation found it had failed to do due diligence on ANN7 and did not raise initial concerns it had over the channel to its board, however there was no sign of illegality. \nMultiChoice has said that payments made to ANN7 that were investigated were for quality improvement and not to influence broadcasting policy. “While we are pleased that the investigation into the ANN7 contract did not discover any corruption or other illegal activity, the questions we have faced throughout this process have been sobering,” Mawela said. \n“Today we hold our hands up to our mistakes and set out a path to restoring public trust.” (Reporting by Joe Brock and Tiisetso Motsoeneng; Editing by James Macharia and Susan Fenton)", "external_links": [], "published": "2018-01-31T16:06:00.000+02:00", "crawled": "2018-01-31T16:50:35.000+02:00", "highlightTitle": ""}