{"organizations": [], "uuid": "bb51bcf2177c75f66330b07bee6c3030e354d4eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GC594_flu_ZG_20180129085111.jpg", "site_section": "http://feeds.marketwatch.com/marketwatch/topstories", "section_title": "MarketWatch.com - Top Stories", "url": "https://www.wsj.com/articles/flu-season-hits-new-york-early-and-hard/", "country": "US", "domain_rank": 387, "title": "The Wall Street Journal: Flu season hits New York hard early on", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:59:00.000+02:00", "replies_count": 0, "uuid": "bb51bcf2177c75f66330b07bee6c3030e354d4eb"}, "author": "", "url": "https://www.wsj.com/articles/flu-season-hits-new-york-early-and-hard/", "ord_in_thread": 0, "title": "The Wall Street Journal: Flu season hits New York hard early on", "locations": [], "entities": {"persons": [{"name": "josh barbanel", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}], "organizations": [{"name": "wall street journal", "sentiment": "negative"}, {"name": "et share  centers for disease control and prevention", "sentiment": "neutral"}, {"name": "new york state department of health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Jan 29, 2018 8:59 a.m. ET Share \nCenters for Disease Control and Prevention said flu was widespread in all states except for Hawaii Getty Images One possible sign of moderation this year is that flu cases rose by only 5% during the latest week compared with the week before, when they increased 22% across New York, according to the state. \nBy Josh Barbanel \nThe brunt of New York’s flu season has come early and is more severe than it has been in recent years. \nHospitals admitted 1,759 patients with confirmed cases of influenza in the state in the week ended Jan. 20, the highest weekly total tallied by the state since at least 2004, according to the New York State Department of Health last week. \nRead: One chart shows how this year’s flu season is the scariest in years \nWhile many people with the flu recover without ever getting tested, the state reported that 7,779 people tested positive in the state with confirmed cases during the same period, also the highest number in any week since at least 2004. Overall, more than 25,000 patients have tested positive since the beginning of the flu season in October, according to the state data, the highest during a comparable period since at least January 2013. \nDon’t miss: This year’s flu season could be the most deadly in years — and the most expensive \nThe early flu season here is part of a pattern all across the country. Last week, the Centers for Disease Control and Prevention said flu was widespread in all states except for Hawaii, where only “local activity” was reported. \nState officials said it was too soon to tell whether this flu season will be any worse than the busy flu seasons in the winters of 2012-2013 and 2013-2014, when similar variations of the virus predominated. Those flu seasons peaked early and then trailed off.", "external_links": [], "published": "2018-01-29T15:59:00.000+02:00", "crawled": "2018-01-29T16:09:53.018+02:00", "highlightTitle": ""}