{"organizations": [], "uuid": "44189b47ec969b6fbdc0b22cc6f9dfce9ce6ed9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219287896&w=1200&r=LYNXMPEE030KB", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-royals-beggars/council-leader-calls-for-beggars-to-be-removed-before-uk-royal-wedding-idUKKBN1ET12U", "country": "US", "domain_rank": 408, "title": "Council leader calls for beggars to be removed before UK royal wedding", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T12:40:00.000+02:00", "replies_count": 0, "uuid": "44189b47ec969b6fbdc0b22cc6f9dfce9ce6ed9e"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-royals-beggars/council-leader-calls-for-beggars-to-be-removed-before-uk-royal-wedding-idUKKBN1ET12U", "ord_in_thread": 0, "title": "Council leader calls for beggars to be removed before UK royal wedding", "locations": [], "entities": {"persons": [{"name": "meghan markle", "sentiment": "none"}, {"name": "elizabeth", "sentiment": "none"}, {"name": "harry", "sentiment": "none"}, {"name": "simon dudley", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "maidenhead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "windsor", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "windsor castle", "sentiment": "none"}, {"name": "sunken garden of kensington palace", "sentiment": "none"}], "organizations": [{"name": "council", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "royal borough of windsor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 10:39 AM / Updated 3 hours ago Council leader calls for beggars to be removed before UK royal wedding Reuters Staff 3   Beggars need to be cleared by police from the streets of Windsor before the wedding of Prince Harry to girlfriend Meghan Markle because their “detritus” is presenting the picturesque English town in a poor light, the local council leader has said. FILE PHOTO: Britain's Prince Harry poses with Meghan Markle in the Sunken Garden of Kensington Palace in London, Britain, November 27, 2017. REUTERS/Toby Melville/File Photo \nQueen Elizabeth’s grandson Harry and his American fiancée are to tie the knot at Windsor Castle, the monarch’s palace to the west of London, in May with thousands of visitors expected to visit the town to celebrate the occasion. \nSimon Dudley, the leader of the Royal Borough of Windsor and Maidenhead council, wrote on Twitter there had been an “epidemic of rough sleeping and vagrancy” in the town and said he wanted police “to focus on dealing with this before the #RoyalWedding”. \n“This is creating a concerning and hostile atmosphere for our residents and the seven million tourists who come to Windsor each year,” he wrote in a letter to the local Police and Crime Commissioner Anthony Stansfield. \n“It is becoming increasingly concerning to see the quantities of bags and detritus that those begging are accumulating and leaving on our pavements, at times unattended, thus presenting a security risk.” \nWindsor, the oldest inhabited castle in the world which has been a home of British monarchs for almost 1,000 years, attracts 1.3 million visitors every year, while many also visit the town to watch the regular “Changing the Guard” ceremony with soldiers in scarlet tunics and bearskin hats parading with an army band. FILE PHOTO - Guardsman stand in formation at Windsor Castle for the arrival of U.S. President Barack Obama and first lady Michelle Obama for their lunch with Britain's Queen Elizabeth II and Prince Philip, Duke of Edinburgh in Windsor, England, Britain April 22, 2016. REUTERS/Kevin Lamarque \nDudley said the council had invested heavily in support services to help those in need with shelters and emergency accommodation for rough sleepers, added there was evidence that many of those begging were not in fact homeless. \n“Obviously, the level of tourist interest is set to multiply with the Royal Wedding in May 2018, and there are increased concerns from our residents about their safety,” he wrote, calling for the police to invoke powers such as the 1824 Vagrancy Act to clear the streets. \n“The whole situation also presents a beautiful town in a sadly unfavourable light.” \nStansfield said he was surprised the letter had been publicly released, but added the police would be happy to listen to any issues. \n“I will of course provide (Councillor) Dudley with a full response addressing his concerns once I have received the letter and investigated further the issues he has raised,” he said in a statement. \nThe Windsor Homelessness Project’s manager Murphy James told the BBC it was “sickening” Dudley had cited the royal wedding as a reason for concern. \n“It’s absolutely abhorrent that anybody has got these views in this day and age, especially a lead councillor of the borough,” he said. “If somebody is sleeping out on the street, they are not there by choice, they are there because something has gone wrong.” Reporting by Michael Holden; editing by Stephen Addison", "external_links": [], "published": "2018-01-04T12:40:00.000+02:00", "crawled": "2018-01-04T13:06:51.016+02:00", "highlightTitle": ""}