{"organizations": [], "uuid": "003cd870ca90b3f955dd4b7be15b422961685b8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/canada-marijuana-hot/update-1-canadian-pot-stocks-surge-on-new-u-s-fund-california-legalization-idUSL1N1OY0ZO", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Canadian pot stocks surge on new U.S. fund, California legalization", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T23:28:00.000+02:00", "replies_count": 0, "uuid": "003cd870ca90b3f955dd4b7be15b422961685b8f"}, "author": "", "url": "https://www.reuters.com/article/canada-marijuana-hot/update-1-canadian-pot-stocks-surge-on-new-u-s-fund-california-legalization-idUSL1N1OY0ZO", "ord_in_thread": 0, "title": "UPDATE 1-Canadian pot stocks surge on new U.S. fund, California legalization", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 9:31 PM / in 41 minutes UPDATE 1-Canadian pot stocks surge on new U.S. fund, California legalization Reuters Staff \n(Updates with share prices throughout, comment from MJIC) \nBy Nichola Saminather \nTORONTO, Jan 3 (Reuters) - Canadian cannabis stocks surged to new records on Wednesday as investors enthused over early growth of the first U.S.-listed exchange-traded fund focused on the pot industry and the Jan. 1 legalization of recreational marijuana in California. \nCannabis producers Canopy Growth Corp and Aphria Inc were among the biggest gainers on the Toronto Stock Exchange’s S&P/TSX composite index, surging as much as 11.9 percent and 8.8 percent respectively, although they later pared some of those gains. Aurora Cannabis, Canada’s second-biggest listed producer, closed up 20 percent. All hit record highs. \nMJIC Inc's equal-weighted Canadian Marijuana Index, which tracks stocks of major cannabis companies, also hit a record and rose more than 14 percent. [ here ]. \nCanada’s Horizons Marijuana Life Sciences ETF gained 10 percent. The U.S.-listed ETFMG Alternative Harvest ETF , which began trading on Dec. 26, has risen to $164 million in net assets from $6 million in one week, according to Vahan Ajamian, an analyst at Beacon Securities in Toronto. Top Alternative Harvest holdings include Canadian weed producers Cronos Group Inc and Canopy. \n“If Americans want to buy Canadian stocks in an easy way, this is the first ETF that provides that ability in the U.S.,” Chris Damas, editor of the BCMI Cannabis Report, said in an interview. \nStill, he cautioned that in his view the sector was in a bubble as foreigners were rushing to invest in the Canadian cannabis sector, causing demand to far outstrip supply. \nReports of long lines and product shortages in California, which legalized pot sales on Jan. 1, also helped the rally. Some investors see the launch of sales in Canada as a harbinger of what can be expected when Canada launches recreational sales in mid-2018. \nTo be sure, the only Canadian company with significant exposure to the California market is CannaRoyalty Corp, Ajamian said by email. \nMJIC Vice-President Dan Nicholls said he expects a correction in the sector, given the steep gains. \n“We saw a dramatic rise in trading volumes in the U.S. and Canada over the last week,” he said. “This ... was likely tied directly to the California legalization as there has been little news of significance out of Canada during this time period.” \n“Many investors likely invest in Canadian stocks given its better cannabis regulatory climate compared to the U.S. and expanding international opportunities,” Nicholls added. (Reporting By Nichola Saminather, Editing by Rosalba O‘Brien)", "external_links": [], "published": "2018-01-03T23:28:00.000+02:00", "crawled": "2018-01-04T00:12:39.000+02:00", "highlightTitle": ""}