{"organizations": [], "uuid": "71f7230ba827d497a635039886084862bd291877", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222387861&w=1200&r=LYNXMPEE0F0MQ", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-cycling-froome-bardet/cycling-froome-should-not-race-until-investigation-over-bardet-idUSKBN1F513H", "country": "US", "domain_rank": 408, "title": "Cycling: Froome should not race until investigation over - Bardet", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T12:35:00.000+02:00", "replies_count": 0, "uuid": "71f7230ba827d497a635039886084862bd291877"}, "author": "", "url": "https://www.reuters.com/article/us-cycling-froome-bardet/cycling-froome-should-not-race-until-investigation-over-bardet-idUSKBN1F513H", "ord_in_thread": 0, "title": "Cycling: Froome should not race until investigation over - Bardet", "locations": [], "entities": {"persons": [{"name": "bardet re", "sentiment": "negative"}, {"name": "bardet", "sentiment": "negative"}, {"name": "romain bardet", "sentiment": "none"}, {"name": "chris froome", "sentiment": "none"}, {"name": "frenchman bardet", "sentiment": "none"}, {"name": "froome", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "vuelta", "sentiment": "none"}, {"name": "uci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 36 AM / Updated 30 minutes ago Cycling: Froome should not race until investigation over - Bardet Reuters Staff 2 Min Read \nPARIS (Reuters) - Chris Froome should rule himself out of racing until a probe into his failed drugs test for an asthma medication during last year’s Tour of Spain has been concluded, twice Tour de France podium finisher Romain Bardet said on Tuesday. \nThe four-time Tour de France winner, who denies breaking any rules, could potentially be stripped of his Vuelta a Espana title after a urine test he took during the race in September showed excessive levels of Salbutamol. \n“I can’t really see how Froome can race as if nothing was going on,” Frenchman Bardet, who finished runner-up to the Briton in 2016 and third last year, told sports daily L‘Equipe. \n“Since (Froome’s team) Team Sky are doing nothing, nothing prevents their rider from taking a step back until there is a decision from the authorities.” \nFroome has said he would provide whatever information world cycling governing body UCI required. FILE PHOTO: Team Sky rider Chris Froome of Britain celebrates on the podium after winning the Vuelta Tour of Spain after the last stage of the cycling race between Arroyomolinos and Madrid, September 10, 2017. REUTERS/Susana Vera/File Photo \nSalbutamol is permitted as a legal asthma drug by the World Anti-Doping Agency and the UCI said Froome’s failed urine test did not necessitate a mandatory provisional suspension even if analysis of his urine sample showed a concentration of 2,000 nanograms per milliliter (ng/ml), double WADA’s threshold. \nHowever, riders have been banned for excessive use of it in the past, notably Italian Alessandro Petacchi, who was given a 12-month suspension and stripped of his five stage victories in the 2007 Giro d‘Italia. \n“Will the UCI have the means to shed light on this case? Will experts manage to prove that it is possible to have such high natural levels (of Salbutamol)?” Bardet added. \n“I have a hard time imagining that a rider with such a high dose of Salbutamol can be cleared. Otherwise, why set a limit?” \nBardet also hopes that the UCI will reach a conclusion before the start of the Tour de France in less than six months. \n“Otherwise, it would be catastrophic for the image of the race and the image of cycling. It would be a farce,” the AG2R-La Mondiale rider said. Reporting by Julien Pretot; Editing by John O'Brien", "external_links": [], "published": "2018-01-16T12:35:00.000+02:00", "crawled": "2018-01-16T13:18:17.021+02:00", "highlightTitle": ""}