{"organizations": [], "uuid": "c2dda8952ab94b71311f1efc68da715e188c08a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 528, "shares": 528, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222850211&w=1200&r=LYNXMPEE0G1WZ", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-trump-midterms-exclusive/exclusive-trump-vows-to-campaign-intensively-for-republicans-may-avoid-primaries-idUSKBN1F630T", "country": "US", "domain_rank": 408, "title": "Exclusive: Trump vows to campaign intensively for Republicans, may avoid primaries", "performance_score": 5, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:21:00.000+02:00", "replies_count": 0, "uuid": "c2dda8952ab94b71311f1efc68da715e188c08a1"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-midterms-exclusive/exclusive-trump-vows-to-campaign-intensively-for-republicans-may-avoid-primaries-idUSKBN1F630T", "ord_in_thread": 0, "title": "Exclusive: Trump vows to campaign intensively for Republicans, may avoid primaries", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "james oliphant", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 10:22 PM / in 8 hours Exclusive: Trump vows to campaign intensively for Republicans, may avoid primaries James Oliphant 4 Min Read \nWASHINGTON (Reuters) - President Donald Trump said on Wednesday that he plans to devote much of his time this year to helping Republicans maintain control of the U.S. Congress, but suggested he may stay out of divisive intra-party primary fights. \n“I am going to spend probably four or five days a week helping people because we need more Republicans,” the Republican president said in an interview with Reuters. “To get the real agenda through, we need more Republicans.” \nTrump indicated he would avoid endorsing candidates in Republican primaries, as he did last year in Alabama’s Senate race, when the incumbent he endorsed was defeated by a hard-line conservative challenger, and would likely focus on the November general election in which Democrats are trying to wrest control of Congress from the Republicans. \n“It’s hard sometimes. Sometimes you really like three candidates - that’s a very tough position to be in. But we have places where I like all of the candidates,” Trump said. “But I will be very much involved with - beyond the primaries - with the election itself, very very much.” \nTrump is scheduled to travel to western Pennsylvania on Thursday in support of Rick Saccone, the Republican candidate in a special election to replace Republican U.S. Representative Tim Murphy, who resigned in October amid a sex scandal. \nThirty-four seats in the Senate and all 435 seats in the House of Representatives will be contested in November’s midterm elections. Democrats need to add a net total of two seats to assume control of the 100-seat Senate and 24 seats to take over the House. \nFractious Republican primary battles already are developing in states including Arizona, Nevada and Wisconsin, where some of the candidates are backed by Steve Bannon, Trump’s former chief political strategist who he fired last August. \nBefore Bannon had a public falling-out with the president over the former adviser’s comments in a new book about the Trump White House, the expectation had been that Bannon’s involvement might tempt Trump to interject himself into some those fights. \nNow that appears much less likely. U.S. President Donald Trump gustures during an interview with Reuters at the White House in Washington, U.S., January 17, 2018. REUTERS/Kevin Lamarque SELLING THE TAX BILL \nTrump said he will tout during the campaign the Republican-backed tax overhaul law passed by Congress last month that slashed taxes for corporations and the rich while offering a mixed bag of tax changes to other Americans, a measure he argued would grow in popularity with voters as they see their taxes reduced in pay checks. \nThe bill also opened up part of the Arctic National Wildlife Refuge in Alaska to private oil drilling and repealed a provision of the Affordable Care Act, dubbed Obamacare, that imposed a fine on people who did not obtain health insurance. \n“Those were very, very big things,” the president said. “I think they’ll be very, very popular on the campaign trail.” \nHe also plans to tout the performance of the stock market. \n“If the Democrats won the election, the stock market would have gone down 50 percent from where it was,” Trump said. \nTrump’s help could cut both ways for Republicans. In Reuters/Ipsos polls, Trump’s approval rating nationally has largely remained below 40 percent. His presence on the campaign trail could boost turnout of Democratic voters who want to register their disapproval of him. \nDemocrats won an upset victory in conservative Alabama last month after Roy Moore, the candidate who beat Trump-backed incumbent Senator Luther Strange in the primary and was later backed by the president, lost to Democrat Doug Jones. \nIn November, Trump-backed Republican candidate Ed Gillespie lost the Virginia governor’s race to Democrat Ralph Northam. \nTrump can help Republicans in other ways than campaigning. He remains the party’s most prodigious fund-raiser. Reporting by James Oliphant; Additional reporting by Steve Holland, Jeff Mason, Roberta Rampton and Ayesha Rascoe; Editing by Caren Bohan and Will Dunham", "external_links": [], "published": "2018-01-18T00:21:00.000+02:00", "crawled": "2018-01-18T00:33:05.017+02:00", "highlightTitle": ""}