{"organizations": [], "uuid": "414271edf03c8c728d9b20e4510afe71d0260707", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-evergage-acquires-mybuys--unleashing-the-benefits-of-a-next-generation-personalization-platform-for-more-retailers-worldwide.html", "country": "US", "domain_rank": 767, "title": "Evergage Acquires MyBuys - Unleashing the Benefits of a Next-Generation Personalization Platform for More Retailers Worldwide", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.234, "site_type": "news", "published": "2018-01-30T16:00:00.000+02:00", "replies_count": 0, "uuid": "414271edf03c8c728d9b20e4510afe71d0260707"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-evergage-acquires-mybuys--unleashing-the-benefits-of-a-next-generation-personalization-platform-for-more-retailers-worldwide.html", "ord_in_thread": 0, "title": "Evergage Acquires MyBuys - Unleashing the Benefits of a Next-Generation Personalization Platform for More Retailers Worldwide", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "somerville", "sentiment": "none"}, {"name": "evergage", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SOMERVILLE, Mass., Jan. 30, 2018 /PRNewswire/ -- Evergage, the real-time personalization platform company , today announced the acquisition of the MyBuys merchandising products business from digital advertising technology company Magnetic. This acquisition brings the benefits of broad-scale personalization to a wide array of retailers – enabling them to deliver individualized, cross-channel experiences that drive conversions, build customer loyalty and increase revenues. Terms of the deal, which closed earlier this month, were not disclosed.\nFounded in 2001, MyBuys played a pioneering role in personalization in the retail sector by providing first-generation technology for product recommendations – which are now a strategic imperative for nearly all online retailers. Hundreds of leading e-commerce companies use MyBuys technology to deliver product recommendations on their websites and via email to millions of shoppers, utilizing online and offline data.\nThe acquisition comes on the heels of continued growth and momentum for Evergage, and expands its leadership in retail – one of Evergage's key verticals. It also comes at a time when more and more organizations are looking to tap into the full power of personalization. Gartner predicts that \"by 2020, smart personalization engines used to recognize customer intent will enable digital businesses to increase their profits by up to 15%.\" 1\n\"Well-executed, truly personalized experiences are the bedrock of successful customer interactions and long-term customer relationships,\" said Karl Wirth, Evergage CEO and author of the book \"One-to-One Personalization in the Age of Machine Learning.\" \"We're excited to welcome MyBuys' team members and customers – who share this belief in the critical importance of personalization – and look forward to collaborating and innovating with them to advance our shared vision.\"\nEvergage will be bringing MyBuys employees – including engineering, customer success and technical support professionals – onto its team.\nEmploying a carefully coordinated, high-touch process, Evergage will migrate each MyBuys customer onto the Evergage personalization platform, which will deliver all the current capabilities of the MyBuys merchandising solution and much more. Evergage will provide total continuity for MyBuys customers and a seamless transition to its comprehensive, real-time platform, built for today's e-commerce environment and named \" Best E-Commerce Solution \" in the 2017 SIIA CODiE Awards.\nCombining deep behavioral analytics, a full customer data platform and advanced machine learning, Evergage powers 1:1 personalization across websites, web and mobile apps, onsite search and email. Marketers can automatically recognize and act on visitors' interests and intent within milliseconds – all from a single self-service platform that's easy to operate without IT intervention. In addition, Evergage's platform provides spot-on, personalized recommendations at the product, category and brand level; automatic catalog integration for retailers; CRM and in-store purchase data synchronization; A/B and multivariate testing; sophisticated rule-based targeting; and advanced analytics.\n\"Our MyBuys customers – many of whom use both Magnetic and MyBuys solutions – are extremely well-served with this move,\" said Corey Ferengul, CEO of Magnetic. \"We're thrilled to have placed them in the best possible hands. Evergage's comprehensive personalization platform eliminates the need for multiple 'point' solutions and provides more and richer on-site and email personalization capabilities. Magnetic remains focused on delivering advertisers the best possible solutions for reaching consumers through media using our industry-leading artificial intelligence and machine learning.\"\nJason Shriver, the former head of client success at MyBuys and now VP of customer success at Evergage, said: \"Evergage's advanced personalization capabilities, vision and strategy have made the company a true market leader – and even more importantly, the company aligns closely with MyBuys' ideals. We're incredibly happy to join their team and to continue to serve our world-class customer base, uninterrupted, but now on a premier, next-generation personalization platform. We're excited for what the future brings: helping retailers understand, serve and respond to their customers at the 1:1 level.\"\n1 Gartner, \"Hype Cycle for Digital Commerce, 2017,\" Mike Lowndes, July 31, 2017.\nAbout Evergage\nOnly Evergage's real-time personalization platform delivers The Power of 1, enabling digital marketers to transform the dream of 1:1 customer engagement across channels into reality. Combining in-depth behavioral analytics, a full customer data platform and advanced machine learning, Evergage provides the one solution you need to systematically understand and interact with each person that visits your site or uses your app – one at a time, \"in the moment\" and at scale – to deliver a maximally relevant, individualized experience. Evergage's powerful and flexible cloud-based platform delivers real-time personalization to billions of web visitors, improving revenue growth, demand generation and customer success for leading organizations across industries, including Lenovo, Endurance International Group, Intuit, Publishers Clearing House, Rue La La and Zumiez. Evergage is a CODiE Award winner and a three-time winner in the Stevie American Business Awards, Golden Bridge Awards and Best in Biz Awards. For more information, visit http://evergage.com or contact the company at info@evergage.com or 1-888-310-0589.\nMedia Contact:\nPaula Crerar\nEmail: press@evergage.com\nPhone: 1-888-310-0589\nView original content with multimedia: http://www.prnewswire.com/news-releases/evergage-acquires-mybuys---unleashing-the-benefits-of-a-next-generation-personalization-platform-for-more-retailers-worldwide-300589655.html\nSOURCE Evergage", "external_links": ["http://evergage.com/", "http://www.evergage.com/personalization-book", "http://www.prnewswire.com/news-releases/evergage-acquires-mybuys---unleashing-the-benefits-of-a-next-generation-personalization-platform-for-more-retailers-worldwide-300589655.html", "http://www.evergage.com/blog/press/evergage-named-best-e-commerce-solution-siia-codie-awards/", "http://www.evergage.com/"], "published": "2018-01-30T16:00:00.000+02:00", "crawled": "2018-01-30T17:48:19.039+02:00", "highlightTitle": ""}