{"organizations": [], "uuid": "186d1af894aa7cbfb13608f368733a281f3aade4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/yemen-security-clashes/several-killed-in-clashes-in-yemens-southern-city-aden-idINKBN1FH07T", "country": "US", "domain_rank": 408, "title": "Several killed in clashes in Yemen's southern city Aden", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T10:57:00.000+02:00", "replies_count": 0, "uuid": "186d1af894aa7cbfb13608f368733a281f3aade4"}, "author": "", "url": "https://in.reuters.com/article/yemen-security-clashes/several-killed-in-clashes-in-yemens-southern-city-aden-idINKBN1FH07T", "ord_in_thread": 0, "title": "Several killed in clashes in Yemen's southern city Aden", "locations": [], "entities": {"persons": [{"name": "abd-rabbu mansour hadi", "sentiment": "none"}, {"name": "hadi", "sentiment": "none"}], "locations": [{"name": "aden", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}], "organizations": [{"name": "min read  aden", "sentiment": "none"}, {"name": "aden reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ADEN/MARIB, Yemen (Reuters) - At least 10 people were killed and more than 80 others were wounded as southern Yemeni separatists fought government troops in the southern city of Aden on Sunday, local medics said, deepening a rift between forces that had been on the same side.\nThe worst clashes yet between southern separatists, who are allied to the United Arab Emirates (UAE), and forces loyal to the Saudi-based government risk crippling their once united war against the Iran-aligned Houthi movement in Yemen’s north.\nThe fighting subsided by the evening after Prime Minister Ahmed bin Daghr ordered a truce and instructed forces loyal to the government to return to barracks, witnesses said.\nYemen has been torn apart by three years of conflict between the Saudi-backed government of President Abd-Rabbu Mansour Hadi and the Houthi, and the factional fighting in the south compounds the misery.\nThe fighting broke out after the expiry of a deadline set last week by separatists from the Southern Transitional Council (STC) for Hadi to dismiss the bin Daghr government, accusing it of corruption and mismanagement. The government denies the charges.\nGunmen were deployed throughout most districts of Aden on Sunday and there was heavy automatic gunfire and explosions in the southern port city, according to Reuters witnesses.\nArmed separatists appeared to gain the upper hand by wresting a key military base in Khor Maksar district in northern Aden and several government buildings from soldiers loyal to Hadi, local newspaper Aden al-Ghad reported on its website.\nResidents said that hundreds of pro-Southern demonstrators had gathered in a main square.\nHospitals said at least nine fighters and one woman were killed in the fighting. International medical charity Medecins Sans Frontieres, which received four of the casualties, said 86 wounded people were brought in.\nSupporters of southern Yemeni separatists take part in an anti-government protest in Aden, Yemen January 28, 2018. REUTERS/Fawaz Salman Bin Daghr had earlier denounced the separatists’ actions as a coup and said the outcome of contest in Aden was in the hands of their backers, the UAE, who enjoy overall control in the city. He said that the situation was headed toward “a comprehensive military confrontation ... (which is) a direct gift to the Houthis and Iran”.\n“This is a serious matter and the coalition and Arabs as a whole must move to save the situation,” bin Daghr wrote in a message on his Facebook page. “The matter is in their hands and the hope, as we in the government see it, is on the (United Arab) Emirates.”\nRECREATING SOUTH YEMEN\nSlideshow (3 Images) Although Hadi remains in exile in Saudi Arabia, his administration and local allies nominally control about four-fifths of Yemen’s territory, but political and military leaders in Aden now want to revive the former independent state of South Yemen.\nA top military adviser to President Hadi, Mohammed Ali al-Miqdashi, said any move toward rebellion would render the southerners an enemy.\n“There is no difference between the Houthis and anyone else who rebels against the legitimate government, no matter who they are - left, right, south, east,” said Miqdashi, speaking at a remote military base near the central Yemeni city of Marib, late on Saturday.\nA senior southern political source accused the government of pushing the dispute toward an armed showdown.\n“The Hadi government was nervous about any demonstration by the people, so they tried to stop it by force thinking that if there were a battle, the coalition would intervene and save them,” the source said.\nIn a statement late on Saturday before the clashes began, the Saudi-led coalition urged all parties to seek “calm and restraint, adhering to the language of a calm dialogue.”\nAdditional reporting and writing by Noah Browning; Editing by Jane Merriman and Keith Weir\n ", "external_links": [], "published": "2018-01-28T10:57:00.000+02:00", "crawled": "2018-01-28T11:22:42.035+02:00", "highlightTitle": ""}