{"organizations": [], "uuid": "03dc705476dc2214b530b04237cd8e55c1bb30e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-amplyx-pharmaceuticals-announces-appointment-of-cfo-and-presentation-at-the-j-p-morgan-36th-annual-healthcare-conference.html", "country": "US", "domain_rank": 767, "title": "Amplyx Pharmaceuticals Announces Appointment of CFO and Presentation at the J.P. Morgan 36th Annual Healthcare Conference", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "03dc705476dc2214b530b04237cd8e55c1bb30e7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-amplyx-pharmaceuticals-announces-appointment-of-cfo-and-presentation-at-the-j-p-morgan-36th-annual-healthcare-conference.html", "ord_in_thread": 0, "title": "Amplyx Pharmaceuticals Announces Appointment of CFO and Presentation at the J.P. Morgan 36th Annual Healthcare Conference", "locations": [], "entities": {"persons": [{"name": "alan", "sentiment": "none"}, {"name": "alan fuhrman", "sentiment": "none"}, {"name": "amplyx", "sentiment": "none"}, {"name": "fuhrman", "sentiment": "none"}, {"name": "ciara kennedy", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "westin st. francis hotel", "sentiment": "none"}], "organizations": [{"name": "amplyx pharmaceuticals", "sentiment": "negative"}, {"name": "j.p. morgan", "sentiment": "negative"}, {"name": "mirna therapeutics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 8, 2018 /PRNewswire/ -- Amplyx Pharmaceuticals, a company developing first-in-class products for life-threatening infections, with a near-term focus on deadly fungal pathogens, today announced that Alan Fuhrman has been appointed as Chief Financial Officer of Amplyx. The Company also announced today that Ciara Kennedy, Ph.D., Chief Executive Officer of Amplyx, will present at the J.P. Morgan 36 th Annual Healthcare Conference on Tuesday, January 9, 2018 at 12:00 p.m. PT at the Westin St. Francis Hotel in San Francisco, CA.\n\"We are extremely pleased to welcome Alan to the Amplyx executive team,\" said Ciara Kennedy, Ph.D. \"Alan brings to our management team proven financial leadership and strategic corporate development expertise that will be invaluable as we shape the future of Amplyx.\"\nMr. Fuhrman is an experienced financial operations leader with a focus on guiding the growth of innovative pharmaceutical and biotechnology companies. Prior to joining Amplyx, he served as CFO of publicly-traded Mirna Therapeutics, a clinical-stage microRNA company that merged with Synlogic in August 2017. Prior to that, Mr. Fuhrman was CFO of Ambit Biosciences, where he helped lead the company through its initial public offering and oversaw financial, investor and administrative operations until its sale to Daiichi Sankyo in 2014. He has also served as the CFO at Naviscan, a privately held medical imaging company, and Sonus Pharmaceuticals, a publicly traded oncology-focused biotechnology company. Earlier in his career, Mr. Fuhrman practiced as a certified public accountant with Coopers & Lybrand. Mr. Fuhrman received a B.S. in both Business Administration and Agricultural Economics from Montana State University. Mr. Fuhrman currently serves on the Board of Directors and as Chair of the Audit Committee for Loxo Oncology.\n\"I am excited to be able to join an organization that is committed to bringing life changing medicines to patients,\" said Alan Fuhrman. \"It is a tremendous opportunity to become part of this talented team at such an exciting time and I look forward to helping the company build on its success to date.\"\nDetails of the J.P. Morgan Healthcare Conference presentation are as follows:\nPresenter:\nCiara Kennedy, President and CEO, Amplyx Pharmaceuticals\nDate/Time:\nTuesday, January 9, 2018/12:00 PM PT\nRoom Location:\nElizabethan D Room\nAbout APX001\nAPX001 is the prodrug of APX001A, which is a first-in-class small molecule drug candidate that inhibits the highly conserved fungal enzyme Gwt1, compromising growth of major fungal pathogens, including Candida and Aspergillus. In many nonclinical studies, APX001A has shown broad-spectrum activity against common species of Candida spp., and Aspergillus spp., including multi-drug resistant strains and rare, hard-to-treat molds including Fusarium spp., Scedosporium spp., and fungi from the Mucorales order. APX001 has completed Phase 1 clinical studies for both IV and oral formulations. The product has been shown to be well tolerated and safe in healthy volunteers at all doses tested, and target exposures of APX001 for efficacy against Candida and Aspergillus were exceeded. Amplyx is planning to initiate Phase 2 clinical trials in early 2018.\nAbout Amplyx Pharmaceuticals\nAmplyx Pharmaceuticals is developing first-in-class products for life-threatening infections, with a near-term focus on deadly fungal pathogens in vulnerable, immune compromised patients. Amplyx's drug discovery and development efforts have been supported by significant venture investment and more than $10 million in grants from the National Institutes of Health. For more information, please visit www.amplyx.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/amplyx-pharmaceuticals-announces-appointment-of-cfo-and-presentation-at-the-jp-morgan-36th-annual-healthcare-conference-300578759.html\nSOURCE Amplyx Pharmaceuticals", "external_links": ["http://www.prnewswire.com/news-releases/amplyx-pharmaceuticals-announces-appointment-of-cfo-and-presentation-at-the-jp-morgan-36th-annual-healthcare-conference-300578759.html", "http://www.amplyx.com/"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:06:51.011+02:00", "highlightTitle": ""}