{"organizations": [], "uuid": "1ed1666363f5f32953633ac7a3e591e7ed810c40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-kroger-names-steve-mckinney-senior-vice-president-of-retail-divisions-monica-garnes-president-of-frys-division.html", "country": "US", "domain_rank": 767, "title": "Kroger Names Steve McKinney Senior Vice President of Retail Divisions, Monica Garnes President of Fry's Division", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T22:30:00.000+02:00", "replies_count": 0, "uuid": "1ed1666363f5f32953633ac7a3e591e7ed810c40"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-kroger-names-steve-mckinney-senior-vice-president-of-retail-divisions-monica-garnes-president-of-frys-division.html", "ord_in_thread": 0, "title": "Kroger Names Steve McKinney Senior Vice President of Retail Divisions, Monica Garnes President of Fry's Division", "locations": [], "entities": {"persons": [{"name": "steve mckinney", "sentiment": "negative"}, {"name": "monica garnes", "sentiment": "negative"}, {"name": "mckinney", "sentiment": "none"}], "locations": [{"name": "cincinnati", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "kroger co.", "sentiment": "negative"}, {"name": "kroger", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "southwest", "sentiment": "none"}, {"name": "florida choice supermarkets", "sentiment": "none"}, {"name": "fry's food stores", "sentiment": "none"}, {"name": "ralphs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CINCINNATI, Jan. 30, 2018 /PRNewswire/ -- The Kroger Co. (NYSE: KR) today announced leadership promotions to support Restock Kroger . Steve McKinney, currently president of the Fry's Food Stores division, has been promoted to senior vice president of retail divisions for the company, effective February 5. Monica Garnes, currently corporate vice president of produce-floral merchandising, will succeed Mr. McKinney as president of the Fry's division.\nSteve McKinney Promoted to Senior Vice President of Retail Divisions\nMr. McKinney began his career with Kroger in 1981 as a clerk for Florida Choice Supermarkets, a former Kroger banner. While there, he advanced to store manager, buyer and field representative. In 1988, he joined Fry's in Phoenix, Arizona and served in various leadership positions, including deli director and executive director of operations. He was named vice president of operations for Fry's in 1998. In 2006, Mr. McKinney was named vice president of operations for Kroger's Southwest division. In 2007, he was named vice president of operations for the company's Ralphs division. Mr. McKinney was named president of Fry's in 2013.\n\"Steve's nearly 37 years of Kroger experience and deep knowledge of food retail will help our divisions continue to execute with excellence,\" said Mike Donnelly, Kroger's executive vice president and chief operating officer. \"Steve has always been passionate about creating uplifting associate and customer experiences. We look forward to him joining our senior leadership team as we continue to drive Restock Kroger.\"\nMonica Garnes Named President of Fry's Division\nMs. Garnes launched her career with Kroger in 1995 when she joined the management training program in the Columbus division. She held a variety of leadership roles in her 23-year career with the company, including human resources coordinator, produce buyer, store manager, public affairs manager, and district manager before advancing to produce-floral merchandiser in the division. Ms. Garnes was promoted to vice president of merchandising for the Fry's division in 2013, and named to her current role in 2015.\n\"Monica is a recognized leader in our business and across the industry,\" said Mr. Donnelly. \"She combines a willingness to embrace fresh ideas with a keen business savvy that yields real results. As the company's first African-American division president, we are excited to have Monica drive and influence change in our company through her expertise and perspective, and we are eager for her to bring her passion for people and results to Fry's.\"\nMs. Garnes was twice-named one of the Top Women in Grocery by Progressive Grocer magazine and has been recognized as one of the \"Most Innovative Women in Food and Drink\" by Fortune and Food & Wine magazines. Ms. Garnes has supported the community as a member of the United Way's Women of Tocqueville and Herbert R. Brown Society. She currently serves on the United Way of Greater Cincinnati Board of Directors, Mount St. Joseph University Board of Trustees, and Lucky's Market Board of Trustees.\nFry's is headquartered in Tolleson, Arizona. The company operates 123 stores and employs more than 22,000 associates.\nAt The Kroger Co., we are dedicated to our purpose: to Feed the Human Spirit™ . We are 453,000 associates who serve nearly nine million customers every day in 2,793 retail food stores under a variety of local banner names in 35 states and the District of Columbia. Our Family of Companies operates an expanding ClickList offering – a personalized order online service – in addition to 2,258 pharmacies, 783 convenience stores, 307 fine jewelry stores, 222 retail health clinics, 1,472 supermarket fuel centers and 38 food production plants in the United States. Our Company has been recognized as one of America's most generous companies for our support of more than 100 Feeding America food bank partners, breast cancer research and awareness, the military and their families, and more than 145,000 community organizations including schools. As a leader in supplier diversity, we are a proud member of the Billion Dollar Roundtable.\nView original content with multimedia: http://www.prnewswire.com/news-releases/kroger-names-steve-mckinney-senior-vice-president-of-retail-divisions-monica-garnes-president-of-frys-division-300590515.html\nSOURCE The Kroger Co.", "external_links": ["http://ir.kroger.com/Cache/1500103932.PDF?O=PDF&T=&Y=&D=&FID=1500103932&iid=4004136", "http://www.prnewswire.com/news-releases/kroger-names-steve-mckinney-senior-vice-president-of-retail-divisions-monica-garnes-president-of-frys-division-300590515.html", "https://www.thekrogerco.com/about-kroger/our-business/grocery-retail/"], "published": "2018-01-30T22:30:00.000+02:00", "crawled": "2018-01-31T00:51:23.001+02:00", "highlightTitle": ""}