{"organizations": [], "uuid": "e387daa22f9de2cc098fd722b1c96e52ce867534", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222806535&w=1200&r=LYNXMPEE0G1LU", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-fed-beigebook/u-s-economy-inflation-growing-at-modest-to-moderate-pace-fed-idUSKBN1F62KY", "country": "US", "domain_rank": 408, "title": "U.S. economy, inflation growing at modest-to-moderate pace: Fed", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T03:08:00.000+02:00", "replies_count": 0, "uuid": "e387daa22f9de2cc098fd722b1c96e52ce867534"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-fed-beigebook/u-s-economy-inflation-growing-at-modest-to-moderate-pace-fed-idUSKBN1F62KY", "ord_in_thread": 0, "title": "U.S. economy, inflation growing at modest-to-moderate pace: Fed", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fed", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "dallas fed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The U.S. economy and inflation expanded at a modest-to-moderate pace from late November through the end of 2017, while wages continued to push higher, the Federal Reserve said on Wednesday.\n“Most districts said that wages increased at a modest pace,” the U.S. central bank said in its periodic Beige Book report on the economy. “A few districts observed that firms were raising wages in a broader range of industries and positions since the previous report.”\nSeveral regional Fed districts noted increases in manufacturing, construction, and transportation input costs, according to the report. Some reported expectations of further wage increases in the coming months, though prices pressures were still mixed, the Fed said.\n“Firms in some districts noted an ability to increase selling prices. Retailers in some districts reported modest price increases and there were reports of rising home prices across the country,” the Fed said.\nIt added that agriculture and energy commodity prices were mixed.\nThe Dallas Fed, however, reported that its regional economy accelerated to a “robust” pace over the past six weeks, with manufacturing, retail, non-financial services and energy gaining momentum. Hiring picked up and wage and price pressures in the district remained elevated.\nIt is unclear whether the report will alleviate the Fed’s concerns about tepid inflation, which has remained below the central bank’s 2 percent target for more than five years.\nDespite still weak inflation overall, Fed policymakers currently expect to raise interest rates three times this year. The central bank raised rates three times in 2017 against a backdrop of steady growth and low unemployment.\nThe majority of Fed policymakers appear to be putting more emphasis on the need to raise rates given the economy is at or near full employment rather than waiting until inflation appreciably rises.\nU.S. job growth slowed more than expected in December amid a decline in retail employment, but a pick-up in monthly wage gains pointed to labor market strength that could pave the way for the Fed to increase rates in March.\nReporting by David Lawder; Editing by Paul Simao\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T03:08:00.000+02:00", "crawled": "2018-01-18T00:03:11.008+02:00", "highlightTitle": ""}