{"organizations": [], "uuid": "88d495e992ef3edfbb58c566a439e373508984e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221068082&w=1200&r=LYNXMPEE0A0HH", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-golf-eurasia/bjorn-eyes-eurasia-victory-with-ryder-cup-in-mind-idUKKBN1F00SQ", "country": "US", "domain_rank": 408, "title": "Bjorn eyes EurAsia victory with Ryder Cup in mind", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T10:14:00.000+02:00", "replies_count": 0, "uuid": "88d495e992ef3edfbb58c566a439e373508984e3"}, "author": "", "url": "https://uk.reuters.com/article/uk-golf-eurasia/bjorn-eyes-eurasia-victory-with-ryder-cup-in-mind-idUKKBN1F00SQ", "ord_in_thread": 0, "title": "Bjorn eyes EurAsia victory with Ryder Cup in mind", "locations": [], "entities": {"persons": [{"name": "bjorn", "sentiment": "negative"}, {"name": "darren clarke", "sentiment": "none"}, {"name": "thomas bjorn", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "saint-quentin-en yvelines", "sentiment": "none"}, {"name": "kuala lumpur", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "eurasia", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "platiau  le golf national", "sentiment": "none"}, {"name": "glenmarie golf and country club", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "golf national", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 8:18 AM / Updated 8 hours ago Bjorn eyes EurAsia victory with Ryder Cup in mind Reuters Staff 4 Min Read \n(Reuters) - Captain Thomas Bjorn will look to lead Europe to a victory over hosts Asia in this week’s EurAsia Cup with the event also serving as a dress rehearsal for one of the teams contesting the 2018 Ryder Cup. European Ryder Cup captain Thomas Bjorn takes part in a golf exhibition at France's Golf National where the Ryder Cup 2018 tournament will be held at Saint-Quentin-en Yvelines, France, October 16, 2017. REUTERS/Charles Platiau \nLe Golf National in Paris will host the 42nd Ryder Cup in September when the Dane will lead a side trying to wrest the title back from the United States, who last won in Europe 25 years ago. \nWith that longer-term goal in mind, Bjorn has six former Ryder Cup players at his disposal in a 12-man team that will take part in the third edition of the EurAsia Cup at the Glenmarie Golf and Country Club in Kuala Lumpur. \nThe last time the event was played, a European team led by Northern Irishman Darren Clarke romped to an 18 1/2-5 1/2 blowout win over their Asian counterparts in the second edition of the biennial matchplay contest in 2016. \nThe current side includes Englishmen Tommy Fleetwood, who won last season’s Race to Dubai, Tyrrell Hatton, Ross Fisher and Matthew Fitzpatrick, Spaniard Rafa Cabrera-Bello, Austrian Bernd Wiesberger, Ireland’s Paul Dunne, Belgian Thomas Pieters, and the Swedish duo of Alex Noren and Henrik Stenson. \nExperienced Englishman Paul Casey and France’s Alex Levy are Bjorn’s two wildcard picks against an Asian side led by three-time European Tour winner Arjun Atwal of India. \n”We’re very well aware that Asia has never fielded a stronger team than they do this time,“ the Dane told reporters this week. ”Golf is a strange game. Whatever it says on the paper very rarely comes out on top. \nAs golf in Asia continues to grow at a rapid rate, the amount of players from the region making a positive impact on tours around the world points to a bright future for the sport and adds credibility to the EurAsia Cup. \n“I think the commitment from the players early on, wanting to play in this event, shows where European golf is,” Bjorn added. \n“There’s an excitement about representing Europe. That’s something that says a lot about those 12 players in there. They want to win.” \nAtwal believes his youthful team, which boasts 11 European Tour titles between them, including multiple winners Kiradech Aphibarnrat of Thailand and India’s S.S.P Chawrasia, has the strength in depth to turn the contest in Asia’s favour. \n”Definitely everybody knows we are underdogs, except my team,“ the 44-year-old said. ”There is no such thing as an underdog in matchplay golf. You can be underdogs on paper, but once the matches start, anything can happen. \n“I pretty much picked Tiger’s (Woods) brain a little bit because we are really close. I saw Davis (Love III) at a range somewhere and I kind of told him that I was captaining. So I have an idea of what to deal with and what to expect.” \nCurrent Asian Tour Order of Merit leader Gavin Green of Malaysia, his compatriot Nicholas Fung, India’s Anirban Lahiri, South Korea’s Kang Sung-hoon and An Byeong-un, Thai pair Phachara Khongwatmai and Poom Saksansin, China’s Li Haotong and Japanese duo Yuta Ikeda and Hideto Tanihara complete the side. Writing by Sudipto Ganguly in Mumbai; Editing by John O'Brien", "external_links": [], "published": "2018-01-11T10:14:00.000+02:00", "crawled": "2018-01-11T10:29:19.008+02:00", "highlightTitle": ""}