{"organizations": [], "uuid": "f3ff53e885354ffce0bcaf202290bc4738e44957", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223494159&w=1200&r=LYNXMPEE0J024", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-alaska-oil-bp/alaska-oil-producers-focus-on-efficiencies-not-70-oil-idUSKBN1F9027", "country": "US", "domain_rank": 408, "title": "Alaska oil producers focus on efficiencies, not $70 oil", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T02:58:00.000+02:00", "replies_count": 0, "uuid": "f3ff53e885354ffce0bcaf202290bc4738e44957"}, "author": "", "url": "https://www.reuters.com/article/us-usa-alaska-oil-bp/alaska-oil-producers-focus-on-efficiencies-not-70-oil-idUSKBN1F9027", "ord_in_thread": 0, "title": "Alaska oil producers focus on efficiencies, not $70 oil", "locations": [], "entities": {"persons": [{"name": "janet weiss", "sentiment": "none"}, {"name": "yereth rosen", "sentiment": "none"}], "locations": [{"name": "alaska", "sentiment": "none"}, {"name": "anchorage", "sentiment": "none"}], "organizations": [{"name": "bp exploration (alaska) inc.", "sentiment": "none"}, {"name": "bp plc", "sentiment": "none"}, {"name": "alaska support industry alliance", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ANCHORAGE, Alaska (Reuters) - The rebound in the price of crude oil in recent months that has helped producers will be temporary, and the industry must prepare for competition from energy sources elsewhere, the head of the Alaska operations of BP Plc said at an industry conference on Friday.\n“We might be enjoying prices today that are over $70 a barrel. But when you look at the fundamentals, at BP anyway, we still think lower for even longer. And staying competitive is very important,” Janet Weiss, president of BP Exploration (Alaska) Inc., said in a speech to the Alaska Support Industry Alliance.\n“When you look at the fundamentals – and you take a look at supply and demand out in time and what is going on with renewables and what is going on with electric cars – and yes, there’s a demand for oil, but there’s a whole lot more of it out there,” she said.\n“So it’s the low-cost basins that will get to produce. Not all the barrels in Alaska are going to be produced if we don’t make them competitive.”\nWeiss was not specific in her speech but later told Reuters, “definitely not 70s. More the 50s”, referring to oil prices per barrel.\nWhile global oil demand is growing, she said, “there’s more oil supply than demand,” along with new non-oil energy.\nWeiss was celebrating BP’s ability to stabilize production at the ageing Prudhoe Bay field which it operates.\nAverage daily production has exceeded 280,000 barrels since 2015, accomplished through operating efficiencies, new technology and extra efforts to wrest new oil from the 40-year-old field, she said in her speech.\nConocoPhillips Alaska Inc. president, Joe Marushack, avoided any price predictions but said his company is prepared for decreases.\n“The reason you hear me talk about costs is we’ve got to survive in any price environment,” he told Reuters.\nIn his speech, Marushack discussed boosting Alaska investment. ConocoPhillips this winter is embarking on its biggest North Slope exploration season since 2002, with five wells planned, four of them in the National Petroleum Reserve in Alaska (NPR-A).\nThe company is expanding its CD5 field in NPR-A, which is producing more than 26,000 barrels per day, well above the predicted 16,000 per-day peak, he said.\nHigher prices might have influenced those investments, he told Reuters. However, the bigger factor “was us demonstrating that we could get our costs down,” he said.\nThe Alaska Department of Revenue, in budget documents submitted last month, predicted North Slope crude prices would average $56 a barrel for the current fiscal year, which ends June 30. The department forecasts slight increases in the price over the coming years, exceeding $60 a barrel after 2020.\nReporting by Yereth Rosen\n ", "external_links": [], "published": "2018-01-20T02:58:00.000+02:00", "crawled": "2018-01-20T04:01:34.010+02:00", "highlightTitle": ""}