{"organizations": [], "uuid": "7819c8a71ab2d05581af28a85c2a1d295ca0d406", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 340, "shares": 340, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/el-salvador-crime.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/el-salvador-tps-salvadorans-deported-trump-immigration-policies/", "country": "US", "domain_rank": 1196, "title": "Commentary: Trump's Hard Choice for Salvadorans in the U.S. | Fortune", "performance_score": 3, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.167, "site_type": "news", "published": "2018-01-11T16:14:00.000+02:00", "replies_count": 0, "uuid": "7819c8a71ab2d05581af28a85c2a1d295ca0d406"}, "author": "Edward Alden", "url": "http://fortune.com/2018/01/10/el-salvador-tps-salvadorans-deported-trump-immigration-policies/", "ord_in_thread": 0, "title": "Commentary: Trump's Hard Choice for Salvadorans in the U.S. | Fortune", "locations": [], "entities": {"persons": [{"name": "edward alden", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "nicaragua", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}, {"name": "sudan", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "department of homeland security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Edward Alden 2:14 PM EST \nAmerica’s immigration laws were written mostly in the early 1960s and tweaked in the 1980s and 90s. No major reform has passed Congress in more than two decades. \nThat hasn’t stopped the Trump administration from adopting a narrowly legalistic approach to enforcing those outdated laws. But faithful enforcement of bad laws only creates worse outcomes. Unless Congress can finally overhaul immigration laws to fit current realities, the administration’s enforcement approach will do serious harm to U.S. foreign policy and economic interests. \nThe latest example is the president’s decision to strip protected status from nearly 200,000 citizens of El Salvador, many of whom have lived in the U.S. for decades. The Department of Homeland Security announced Monday that Salvadorans would have 18 months to return to their home country or face deportation. This follows similar decisions late last year ending protection for 65,000 nationals of Haiti, Nicaragua, and Sudan. \nThe administration can rightly claim it is faithfully implementing the law. Temporary Protected Status (TPS) was created by Congress in 1990 , and allows foreign citizens to remain and work legally in the U.S. if they are unable to return home due to armed conflicts, natural disasters, or other “extraordinary and temporary circumstances.” El Salvador was granted TPS in 2001 following a huge earthquake that caused enormous property destruction. All Salvadorans then in the U.S., whether legally or illegally, were permitted to remain. \nSince then, both Republican and Democratic presidents have routinely extended TPS for El Salvador and for many other covered countries. Today, some 195,000 Salvadorans are covered by TPS ; they have 197,000 U.S. citizen children among them, and have lived here for an average of 21 years. Nearly 90% are in the labor force, many working in construction, restaurants, and landscaping, and one in three owns a home. They are not eligible for most public benefits, including Medicaid. \nThe Trump administration argues, not without merit, that these routine extensions were an abuse of the law, and that the earthquake damage that justified the original protection has largely been fixed. \nBut from anything other than a narrow legalistic perspective, the decision is appalling. El Salvador, which is wracked by drug and gang violence, has the world’s highest murder rate, at over 100 murders per 100,000 inhabitants. Its annual murder rate is nearly double that of Honduras , the world’s next most violent country. (Some 86,000 Hondurans are also under TPS and likely to lose it later this year.) \nRemittances from Salvadoran citizens abroad, most in the U.S., account for about 17% of El Salvador’s economy ; removing that will further destabilize an already shaky economy and government. Many may follow their Haitian counterparts and flee north to Canada to seek asylum status, posing huge challenges for our neighbor to the north. \nFor those who do return home, many will be faced with the agonizing decision of bringing their U.S. citizen children back to a violent country they do not know, or abandoning them to relatives or friends in the U.S. \nPrevious administrations extended TPS because they understood that faithful execution of the law would do enormous damage to the larger interests of the U.S., including securing a stable and peaceful hemisphere and protecting human rights. \nThe one encouraging sign is that Trump appears seriously engaged in working out a congressional solution to legalize permanently the status of many who have been living in the U.S. for decades without full legal status, including TPS recipients. He needs to move quickly, before his administration’s enforcement approach does still greater harm. \nEdward Alden is a senior fellow at the Council on Foreign Relations, and author of The Closing of the American Border: Terrorism, Immigration, and Security Since 9/11 . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-11T16:14:00.000+02:00", "crawled": "2018-01-11T00:58:14.009+02:00", "highlightTitle": ""}