{"organizations": [], "uuid": "fa4197a1f52fd60018e12d51d88f6c2f9aed6a8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-amwins-group-inc-names-scott-m-purviance-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "AmWINS Group, Inc. Names Scott M. Purviance Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T11:00:00.000+02:00", "replies_count": 0, "uuid": "fa4197a1f52fd60018e12d51d88f6c2f9aed6a8f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-amwins-group-inc-names-scott-m-purviance-chief-executive-officer.html", "ord_in_thread": 0, "title": "AmWINS Group, Inc. Names Scott M. Purviance Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "scott m. purviance", "sentiment": "negative"}, {"name": "m. steven decarlo", "sentiment": "none"}, {"name": "purviance", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "charlotte", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "amwins group, inc.", "sentiment": "neutral"}, {"name": "amwins group, inc", "sentiment": "neutral"}, {"name": "board of directors of amwins group, inc.", "sentiment": "none"}, {"name": "inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)-- AmWINS Group, Inc. (“AmWINS”), a global distributor of specialty insurance products and services, announced today that Scott M. Purviance will succeed M. Steven DeCarlo as the company’s Chief Executive Officer, effective May 1, 2018.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180117005381/en/\nAmWINS Group, Inc. Names Scott M. Purviance Chief Executive Officer, effective May 2018. (Photo: Business Wire)\nPurviance, currently AmWINS’ Chief Operating Officer, has been part of the firm’s leadership team since June 2001. Prior to taking on his role as COO, Purviance served as Chief Financial Officer from 2001-2016. He was elected to the Board of Directors of AmWINS Group, Inc. in November 2016.\n“For the past 17 years, Scott has played an essential role in building AmWINS into the industry leader it is today,” said M. Steven DeCarlo, Chief Executive Officer of AmWINS Group, Inc. “Scott knows our business better than anyone, and I’m pleased that he will continue to lead the strategic direction of the company.”\nDeCarlo, who has served as CEO of AmWINS since joining in December 2000, will transition into the newly created role of Executive Chairman and remain Chairman of the AmWINS Board of Directors. W.H. “Skip” Cooper will transition from his current role as President of AmWINS to Vice Chairman and will remain on the Board of Directors. DeCarlo and Cooper will continue to focus on select key growth initiatives of the company.\n“Under Steve, Skip and Scott's remarkable leadership, AmWINS has grown from a regional wholesale broker to a leading player in the global specialty insurance marketplace,” said Jeff Consolino, an independent member of the AmWINS Board of Directors who serves as Executive Vice President and Chief Financial Officer of American Financial Group, Inc. “For almost two decades, Scott has been a key member of the team that has directed and managed the evolution of the business. The Board is confident that Scott will continue to drive the company forward, and we are excited about the opportunities that lie ahead for AmWINS.”\nIn addition to Purviance’s transition to CEO, the following management changes were also announced, effective May 1, 2018:\nJames C. Drinkwater, who currently serves as President of AmWINS Brokerage, will succeed Cooper as President of AmWINS Group, Inc. Drinkwater will also retain his position as President of the Brokerage division.\nBenjamin R. Sloop, who currently serves as President of AmWINS Access, will succeed Purviance as COO of AmWINS Group, Inc. James A. “Tony” Gresham, who has served as COO of AmWINS Access since its establishment, will succeed Sloop as President of the division.\nAbout AmWINS Group, Inc.\nAmWINS Group, Inc. is the largest independent wholesale distributor of specialty insurance products in the United States, dedicated to serving retail insurance agents by providing property and casualty products, specialty group benefit products and administrative services. Based in Charlotte, N.C., the company operates through more than 100 offices globally and handles premium placements in excess of $14 billion dollars annually. To learn more, visit www.amwins.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005381/en/\nAmWINS Group, Inc\nLisa Kuszmar, 704-749-2780\nLisa.Kuszmar@amwins.com\nSource: AmWINS Group, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180117005381/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amwins.com&esheet=51744366&newsitemid=20180117005381&lan=en-US&anchor=www.amwins.com&index=1&md5=a94b5f3be49b80dff5121db137e2365c"], "published": "2018-01-17T11:00:00.000+02:00", "crawled": "2018-01-17T11:33:26.007+02:00", "highlightTitle": ""}