{"organizations": [], "uuid": "581043f55972290794be7df5c7c3f71db9e9645b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226947654&w=1200&r=LYNXMPEE0U0WZ", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-slack-enterprise/slack-adds-target-bbc-etrade-as-clients-in-enterprise-push-idUSKBN1FK1UC", "country": "US", "domain_rank": 408, "title": "Slack adds Target, BBC, E*Trade as clients in enterprise push", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:10:00.000+02:00", "replies_count": 0, "uuid": "581043f55972290794be7df5c7c3f71db9e9645b"}, "author": "", "url": "https://www.reuters.com/article/us-slack-enterprise/slack-adds-target-bbc-etrade-as-clients-in-enterprise-push-idUSKBN1FK1UC", "ord_in_thread": 0, "title": "Slack adds Target, BBC, E*Trade as clients in enterprise push", "locations": [], "entities": {"persons": [{"name": "salvador rodriguez", "sentiment": "none"}, {"name": "butterfield", "sentiment": "none"}, {"name": "stewart butterfield", "sentiment": "none"}, {"name": "slack enterpr", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bbc", "sentiment": "negative"}, {"name": "target corp", "sentiment": "none"}, {"name": "reuters) - slack technologies inc", "sentiment": "none"}, {"name": "slack enterprise grid", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "workday inc", "sentiment": "none"}, {"name": "trade financial corp", "sentiment": "none"}, {"name": "min read  san francisco", "sentiment": "none"}, {"name": "liberty mutual group inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 1:14 PM / Updated 6 hours ago Slack adds Target, BBC, E*Trade as clients in enterprise push Salvador Rodriguez 4 Min Read \nSAN FRANCISCO (Reuters) - Slack Technologies Inc now has more than 150 customers using the enterprise version of its workplace collaboration software, Chief Executive Stewart Butterfield told Reuters. \nSlack Enterprise Grid, as the enterprise service is called, has added several corporate customers since launching a year ago. Those customers include Target Corp in retail, BBC in media, Liberty Mutual Group Inc in insurance, Workday Inc in technology and E*Trade Financial Corp in financial services. \n“Now that we’ve established that (Slack) can work in these environments … we want to use the current customers as models to bring ever more on board,” said Butterfield in a phone call on Monday. \nSlack is the maker of a popular workplace communications software that allows office workers to chat instantaneously with one another. With Enterprise Grid, customers can use Slack with teams of up to 500,000 users. \nAcross the broader tech industry, Slack Enterprise Grid represents a challenge to Microsoft Corp’s dominance as the hub for workplace productivity. Last year, Microsoft released a competing product called Teams that is bundled with Office 365. Others that have released products in this category include Alphabet Inc’s Google, Cisco Systems Inc, Facebook Inc and Atlassian Corp PLC. \nMicrosoft remains the leader in global team collaborative applications software with 36.8 percent market share, but since its 2014 launch, Slack has shown fast growth and claims 5.3 percent of the market, according to research firm IDC for 2016. That market is expected to be worth more than $3 billion by 2021, according to IDC. Stewart Butterfield, CEO of Slack, presents during the business messaging company's event in San Francisco, California, U.S. January 31, 2017. REUTERS/Beck Diefenbach \nEnterprise Grid’s growth has been impressive, but to maintain that pace, Slack will have to improve its marketing and continue to prove its worth as its rivals’ products mature, said Alan Lepofsky, analyst with Constellation Research. \n“Everyone is already a Google or Microsoft shop,” Lepofsky said. “At some point a certain percentage of Slack’s potential prospects will be OK enough with the Google and Microsoft solutions. Slack needs to clearly articulate its value proposition.” \nButterfield said Slack now has “hundreds” of employees focused on Enterprise Grid. \n“Building the capacity to properly service these customers … has been a really big expansion for the company,” Butterfield said. \nTwenty-First Century Fox Inc, which has been a customer of Enterprise Grid for a year, uses Slack to connect employees across its business units, including Fox Sports, FX, National Geographic and others, into one forum where they can collaborate, said Jeff Dow, chief information officer of 20th Century Fox. \n“I don’t think there’s a better, more effective collaboration platform for enterprise project management than Slack because you’re able to bring your teams together in real time,” Dow said. \nPrivately held Slack has raised nearly $850 million in funding and carries a valuation of $5.1 billion, according to research firm CB Insights. In September, Slack announced that it has a total base of more than 6 million daily active users and more than 50,000 paying teams. Reporting by Salvador Rodriguez; Additional reporting by Paresh Dave; Editing by Cynthia Osterman", "external_links": [], "published": "2018-01-31T15:10:00.000+02:00", "crawled": "2018-01-31T15:18:08.006+02:00", "highlightTitle": ""}