{"organizations": [], "uuid": "bdbcfb8b043341f0927b76f535e78a5103bcf543", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-paul-stead-joins-adaptimmune-as-vice-president-of-business-development.html", "country": "US", "domain_rank": 767, "title": "Paul Stead Joins Adaptimmune as Vice President of Business Development", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-04T16:00:00.000+02:00", "replies_count": 0, "uuid": "bdbcfb8b043341f0927b76f535e78a5103bcf543"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-paul-stead-joins-adaptimmune-as-vice-president-of-business-development.html", "ord_in_thread": 0, "title": "Paul Stead Joins Adaptimmune as Vice President of Business Development", "locations": [], "entities": {"persons": [{"name": "paul stead joins adaptimmune", "sentiment": "negative"}, {"name": "paul stead", "sentiment": "none"}, {"name": "mr pharms", "sentiment": "none"}, {"name": "adaptimmune", "sentiment": "none"}, {"name": "helen tayton-martin", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "b. pharm", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "oxford", "sentiment": "negative"}, {"name": "adap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Pa. and OXFORD, England, Jan. 04, 2018 (GLOBE NEWSWIRE) -- Adaptimmune Therapeutics plc (Nasdaq:ADAP), a leader in T-cell therapy to treat cancer, today announced that Paul Stead, B. Pharm, PhD, MBA, MR PharmS has joined the Company as Vice President of Business Development.\n\"I am delighted to welcome Paul to Adaptimmune. Paul has a tremendous wealth of business development experience and joins Adaptimmune at a critical inflection point in the Company’s journey, as we are focused on data delivery from our wholly owned assets,\" said Helen Tayton-Martin, Adaptimmune’s Chief Business Officer. “To remain leaders in the TCR T-cell therapy field, we must evaluate a broad range of technology partnerships, and Paul’s extensive experience in business development and competitive intelligence will be a tremendous asset to us.”\n“I am thrilled to assume this challenging business development role, building upon my existing experience in pharmaceutical discovery and development,” said Paul. “This is a pivotal year for Adaptimmune, and I am eager to forge partnerships with other industry leaders as we bring TCR T‑cell therapy closer to approval.”\nPaul joins Adaptimmune, most recently, from Inovio Pharmaceuticals, Inc. developing DNA-based immunotherapies within oncology and infectious diseases. Prior to that, he was with Nimbus Therapeutics LLC where he played a key role in Gilead’s acquisition of Nimbus’s Comprised Acetyl CoA Carboxylase Inhibitors Program for treatment of NASH and related disorders.1 Paul is a scientist by background earning a BSc, then PhD in Pharmaceutical Sciences from Bath and Nottingham Universities in the UK, respectively, after which he joined GlaxoSmithKline plc as a Senior Scientist in Chemistry BioProcess Development. He progressed from R&D in GSK’s Natural Product Chemistry Department to lead Competitive and Scientific Intelligence in the US. Subsequently, Paul worked up through technology licensing, and senior business development roles in GSK Worldwide Business Development Transactions and then specifically Platform Technology and Science Business Development.\nAbout Adaptimmune\nAdaptimmune is a clinical-stage biopharmaceutical company focused on the development of novel cancer immunotherapy products. The Company’s unique SPEAR (Specific Peptide Enhanced Affinity Receptor) T-cell platform enables the engineering of T-cells to target and destroy cancer, including solid tumors. Adaptimmune is currently conducting clinical trials with SPEAR T-cells targeting MAGE-A4, -A10, and AFP across several solid tumor indications. GlaxoSmithKline plc (LSE:GSK) (NYSE:GSK) exercised its option to exclusively license the right to research, develop, and commercialize Adaptimmune’s NY-ESO SPEAR T-cell therapy program in September 2017. Transition of this program to GSK is ongoing. The Company is located in Philadelphia, USA and Oxfordshire, U.K. For more information, please visit http://www.adaptimmune.com\nForward-Looking Statements\nThis release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995 (PSLRA). These forward-looking statements involve certain risks and uncertainties. Such risks and uncertainties could cause our actual results to differ materially from those indicated by such forward-looking statements, and include, without limitation: the success, cost and timing of our product development activities and clinical trials and our ability to successfully advance our TCR therapeutic candidates through the regulatory and commercialization processes. For a further description of the risks and uncertainties that could cause our actual results to differ materially from those expressed in these forward-looking statements, as well as risks relating to our business in general, we refer you to our Quarterly Report on Form 10-Q filed with the Securities and Exchange Commission (SEC) on November 2, 2017, and our other SEC filings. The forward-looking statements contained in this press release speak only as of the date the statements were made and we do not undertake any obligation to update such forward-looking statements to reflect subsequent events or circumstances.\n1 NASH = nonalcoholic steatohepatitis\nAdaptimmune Contacts:\nMedia Relations:\nSébastien Desprez – VP, Communications and Investor Relations\nT: +44 1235 430 583\nM: +44 7718 453 176\nSebastien.Desprez@adaptimmune.com\nInvestor Relations:\nJuli P. Miller, Ph.D. – Director, Investor Relations\nT: +1 215 825 9310\nM: +1 215 460 8920\nJuli.Miller@adaptimmune.com\nSource:Adaptimmune Therapeutics plc", "external_links": ["https://www.globenewswire.com/Tracker?data=84t_C6XVjmZo3w9mMQLc1Sr90khlID6pWRc_u7fqM4EJrAS1SNv_SW1TqYwwZ86QrQvT8Yp_4A1ACMEgofibpqd_3midgTbQqKXE7WmoecLR1ZXDbVWdb2wcp521w70s", "https://www.globenewswire.com/Tracker?data=6LOGFGvXEnzpQvZbpm6M7hHyG0gCUs7l2HlUZaNP_pua6mzQy6SE8X0iSuKcpgtS1cWyQaD2l8Wx1hdUB3dPQemYaY1OsHfh5SftlML2sUd-FXEu4HRDUR1QDk2c52-F", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f61dc272-2f81-43b4-97ce-b387507030db", "https://www.globenewswire.com/Tracker?data=Sdd848IVhiqIi4DOysYKoeq_F48aVrpi8o8qwezWOn2AeeVEICwNMfeLl3-WPH23ZER60NFDkmC39cITK119aqPRHypgHdg4aJ94TJi4nmA="], "published": "2018-01-04T16:00:00.000+02:00", "crawled": "2018-01-04T16:41:43.016+02:00", "highlightTitle": ""}