{"organizations": [], "uuid": "249e6f7d43183bc33041cd1a6865629065b2e238", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 62, "shares": 62, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-britain-investment-financial-org-excl/exclusive-unregulated-british-firm-draws-asian-investors-idUSKBN1EZ1ME", "country": "US", "domain_rank": 408, "title": "Exclusive: Unregulated British firm draws Asian investors", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.641, "site_type": "news", "published": "2018-01-10T21:46:00.000+02:00", "replies_count": 0, "uuid": "249e6f7d43183bc33041cd1a6865629065b2e238"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-investment-financial-org-excl/exclusive-unregulated-british-firm-draws-asian-investors-idUSKBN1EZ1ME", "ord_in_thread": 0, "title": "Exclusive: Unregulated British firm draws Asian investors", "locations": [], "entities": {"persons": [{"name": "azmi tumpang", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "london/abu dhabi", "sentiment": "negative"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON/ABU DHABI (Reuters) - Financial.org, a UK company that describes itself as an education business and sponsors a Formula One team, is managing hundreds of thousands of dollars for Asian investors even though it is not licensed to engage in financial transactions, according to 17 people who say they have invested through the firm.\nThe 17 people, from China, Indonesia, Malaysia, Singapore, Thailand, Vietnam and the UAE, told Reuters they had each given between $3,000 and $400,000 to Financial.org to invest.\n“I have doubled my investments,” said Azmi Tumpang, a former construction worker from Malaysia outside a gala dinner organized by Financial.org on the sidelines of the Abu Dhabi Grand Prix in late November.\nMost of the people said their money had been invested in U.S. blue-chip stocks and that they had made a profit. Reuters was unable to verify whether the share transactions took place.\nFinancial.org is not on a publicly available list of companies authorized and regulated by Britain’s financial regulator, the Financial Conduct Authority (FCA), to buy and sell stocks or bonds for clients. Offering investment services without regulatory permission is a criminal offence in Britain.\nFinancial.org, which has an office in London’s Canary Wharf, declined to comment on whether it acted as an investment firm.\nThe company signed up two years ago with the UK’s official company register as a real estate business, according to filings. The UK registrar of companies, Companies House, said it was preparing to strike off the firm on Jan. 23 because it had never filed accounts. If a company is struck off, it cannot continue to trade legally and its assets pass to the state.\nUK-registered companies must by law be authorized and regulated by the FCA if they deal in securities such as shares and bonds for clients, even if the investors are outside Britain. Under FCA rules, this applies both to principals - parties investing on behalf of clients, and agents - firms including brokers that arrange for investments to take place.\nThe FCA declined to comment about whether Financial.org was operating illegally.\nThe regulator has previously warned of the dangers of investing through firms it has not authorized, as no independent checks have been made on their businesses. It said it had received reports of more than 8,000 cases of unauthorized businesses in the last financial year.\nOn the home page of its website, Financial.org says it is an education platform, providing “financial knowledge and skills”. “We do not deal with securities and receive any financial benefits from financial products and service providers,” it says. However, elsewhere on its site, it also says it “helps members to manage and oversee their investments” and “provides self-directed investors with brokerage services”.\nINVESTOR ALERT The Monetary Authority of Singapore last March placed Financial.org on an investor alert list of “unregulated persons who, based on information received by MAS, may have been wrongly perceived as being licensed or authorized by MAS”, its website says. The authority said investors should “exercise caution” when dealing with companies on the list.\nMalaysia’s Securities Commission also placed Financial.org on a list of “unauthorized websites/investment products/companies/individuals” last year, according to its website.\nThe MAS and Malaysian commission both declined to comment on Financial.org and why they had placed it on alert lists.\nFinancial.org declined to comment on the two regulators’ warnings.\nThe company has been a sponsor of British Formula One team Williams ( WGF1G.DE ) since May 2016, and its logo appears on the Williams Mercedes FW38 cars and team strips.\nWilliams declined to comment.\nMost of the 17 people who spoke to Reuters said they had come into contact with Financial.org through referrals from acquaintances, often via social media. Six said they had received commissions from Financial.org for referring others.\nFive of the people detailed how they made investments. They said they deposited money into the bank account of a third party, usually the person who referred them, who then transferred the funds to a Financial.org investment account.\nThe investors said they accessed their Financial.org account with a members-only area in Financial.org’s website. Thirteen said they had withdrawn money regularly.\nTumpang said he had invested $30,000 through Financial.org over the last two years. Mohamad Mohamed Nordin, another Malaysian investor, said he had invested $400,000.\nVietnamese investor Albert Anthony, a fashion business manager, provided a screenshot of his account page which showed he had invested $100,000. Shella Vinarevi, from Indonesia, said the minimum investment for Financial.org was $3,000, which she had made.\nAdditional reporting by Brenna Hughes Neghaiwi in Zurich, Chayut Setboonsarng in Bangkok, Engen Tham in Shanghai, Fransiska Nangoy and Cindy Silviana in Jakarta, Praveen Menon in Kuala Lumpur, Alan Baldwin, Ritvik Carvalho and Bozorgmehr Sharafedin in London, Anshuman Daga in Singapore, Thomas Wilson in Tokyo, Mi Nguyen in Hanoi, and the Shanghai newsroom; Editing by Pravin Char\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T21:46:00.000+02:00", "crawled": "2018-01-11T12:12:31.012+02:00", "highlightTitle": ""}