{"organizations": [], "uuid": "ff2e59aac4d8f63578d502415bf290afa5cc5758", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/indices", "section_title": "Market Indices | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-slips-as-u-s-dollar-claws-back-some-ground-idUSL4N1PO34C", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold slips as U.S. dollar claws back some ground", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:46:00.000+02:00", "replies_count": 0, "uuid": "ff2e59aac4d8f63578d502415bf290afa5cc5758"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-slips-as-u-s-dollar-claws-back-some-ground-idUSL4N1PO34C", "ord_in_thread": 0, "title": "PRECIOUS-Gold slips as U.S. dollar claws back some ground", "locations": [], "entities": {"persons": [{"name": "jan harvey", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 10:46 AM / in 2 hours PRECIOUS-Gold slips as U.S. dollar claws back some ground Reuters Staff 3 Min Read * Dollar edges up after slide to 3-year lows * Chinese demand soft in face of dollar revival * GRAPHIC-2018 asset returns: tmsnrt.rs/2jvdmXl (Updates prices) By Jan Harvey LONDON, Jan 29 (Reuters) - Gold fell on Monday as a revival in the dollar and a rise in bond yields to multi-year peaks prompted some buyers to cash in gains in the metal after its sixth weekly price increase in seven weeks. Gold has risen more than 3 percent so far this month, and after a strong end to December touched its highest since August 2016 last week at $1,366.07 an ounce. Its strength has been driven largely by a slide in the dollar index to three-year lows. An uptick in the currency on Monday after six straight weeks of losses has prompted a pullback. Spot gold was down 0.5 percent at $1,342.99 an ounce at 1230 GMT, while U.S. gold futures for February delivery were down $10.50 an ounce at $1,341.60. \"We have seen massive rebound in gold, and traders need more clarity in relation to the dollar trend after mixed comments from the U.S. president and U.S. Treasury secretary,\" ThinkMarkets' chief market analyst Naeem Aslam said. \"Our view that it is likely that we will another push to the upside (in gold),\" he added. The dollar edged up against a currency basket on Monday as rising bond yields helped underpin the greenback ahead of a week packed with U.S. data. It remains on track for its biggest monthly decline since March 2016, however. The currency came under pressure last week after Treasury Secretary Steven Mnuchin indicated he was broadly supportive of a weak dollar, though U.S. President Donald Trump later said he wanted to see strength in the currency. A jump in bond yields also weighed on non-interest bearing gold. Gold traders are now awaiting the outcome of a Federal Reserve policy meeting this week, as well as key U.S. jobs data, an important indicator of the strength of the broader economy. Both will be watched for their implications for U.S. interest rates. Gold is highly sensitive to rising U.S. rates, which increase the opportunity cost of holding non-yielding bullion while boosting the dollar, in which it is priced. Demand for physical metal was weak in the key Chinese market overnight in the face of the firmer dollar, MKS said in a note, although the onshore premium over spot in Shanghai remained robust at $8 an ounce. Among other precious metals, silver was down 0.5 percent at $17.30 an ounce. It rose 2.3 percent last week, the biggest rise of any of the major precious metals. Platinum , this year's best performing precious metal so far, was down 0.5 percent at $1,004, after easing 0.3 percent last week in its first weekly decline in seven. Palladium was 1 percent lower at $1,080.99 an ounce. (Additional reporting by Nithin Prasad in Bengaluru; Editing by Alison Williams and Louise Heavens)", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://tmsnrt.rs/2jvdmXl"], "published": "2018-01-29T18:46:00.000+02:00", "crawled": "2018-01-29T15:14:33.003+02:00", "highlightTitle": ""}