{"organizations": [], "uuid": "ec3bf586f53441e2273c486a7011d7d9e2ebe5ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-mc-endeavorsroom-21-media-inc-to-become-a-fully-reporting-sec-company-and-continues-acquisition-strategy.html", "country": "US", "domain_rank": 767, "title": "MC Endeavors/Room 21 Media, Inc. To Become a Fully Reporting SEC Company and Continues Acquisition Strategy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.027, "site_type": "news", "published": "2018-01-30T17:30:00.000+02:00", "replies_count": 0, "uuid": "ec3bf586f53441e2273c486a7011d7d9e2ebe5ee"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-mc-endeavorsroom-21-media-inc-to-become-a-fully-reporting-sec-company-and-continues-acquisition-strategy.html", "ord_in_thread": 0, "title": "MC Endeavors/Room 21 Media, Inc. To Become a Fully Reporting SEC Company and Continues Acquisition Strategy", "locations": [], "entities": {"persons": [{"name": "john stippick", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "sec company", "sentiment": "negative"}, {"name": "mc endeavors, inc.", "sentiment": "neutral"}, {"name": "mc endeavors/room 21 media, inc", "sentiment": "neutral"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "public company accounting oversight board", "sentiment": "none"}, {"name": "pcaob", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DANA POINT, Calif., Jan. 30, 2018 (GLOBE NEWSWIRE) -- MC Endeavors, Inc. ( MSMY ), an innovator in social commerce platforms, is committed to becoming a leading global social commerce company that utilizes a single core platform, Room 21, to produce, distribute and monetize online communities for individuals and businesses that interact with industries ranging from industrial business to healthcare to entertainment.\nManagement is pleased to announce that the company is interviewing various registered accounting firms, Public Company Accounting Oversight Board (PCAOB) accredited accounting firms, that will complete the audited financials of the company and plans to file a registration statement with the Securities and Exchange Commission (SEC) under the Securities Exchange Act of 1934 for the purpose of becoming a reporting company.\nJohn Stippick, CEO, commented, \"In reflection of our commitment to our shareholders, we trust that it is in the best interest of our shareholders to move up to the more distinguished market, where our Company will have greater visibility to a larger group of investors.\" The Company will keep shareholders updated as events unfold with the process, as well as other projects currently underway. \"The Company is on track to continue its strategy of key acquisitions and is pleased to announce that it has begun the successful integration of Treatment Media and will update the acquisition status of Rock On Recovery, LLC . The power of our technology is that it can support a wide variety of industry verticals,\" said Stippick.\nBeing a fully-reporting issuer significantly expands the company's eligibility for both analyst coverage and investor interest. Many institutional investors are unable to acquire the securities of a company that is not fully reporting with the SEC. As a fully reporting 1934 company, the company's filings will now be accessible through the SECs main website (via the EDGAR system), allowing investors, the general public, and financial analysts to extensively review the Company's operations and financial performance.\nFor further information contact:\nJohn Stippick\nPresident\nMC Endeavors, Inc/Room 21 Media\nPhone: (310) 986-6373\nE-mail: johns@room21media.com\nSafe Harbor Statement - In addition to historical information, this press release may contain statements that constitute forward-looking statements within the meaning of the Securities Act of 1933 and the Securities Exchange Act of 1934, as amended by the Private Securities Litigation Reform Act of 1995. Forward-looking statements contained in this press release include the intent, belief, or expectations of the Company and members of its management team with respect to the Company's future business operations and the assumptions upon which such statements are based. Prospective investors are cautioned that any such forward-looking statements are not guarantees of future performance, and involve risks and uncertainties, and that actual results may differ materially from those contemplated by such forward-looking statements. Factors that could cause these differences include, but are not limited to, failure to complete anticipated sales under negotiations, lack of revenue growth, client discontinuances, failure to realize improvements in performance, efficiency and profitability, and adverse developments with respect to litigation or increased litigation costs, the operation or performance of the Company's business units or the market price of its common stock. Additional factors that would cause actual results to differ materially from those contemplated within this press release can also be found on the Company's website. The Company disclaims any responsibility to update any forward-looking statements.\nSOURCE MC Endeavors, Inc\nRELATED LINKS\nhttp://www.room21media.com\nSource:MC Endeavors, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=40405jgf7aXeNt_WOT5Rl2F_iGg1BjL05CHFRy9AYjoaOEXzDV4iodKZlNpx0wfg-1NtXQjDLWrGcl9nA4Nu_dDte_xdiZyCZyuPrpgM_cI=", "https://www.globenewswire.com/Tracker?data=KViVBLjsm_A_b3sKIqURjqoW58cP_4epiIdP9u1vtVe_8R1Yh66DV-Xv5ENeA_i0R2DnBjSKXif8GUPTciqt2Ldm6ARpWaf0wjmQS1AdBImWmLzrJdbfo4ekOUmBXJ46A9ZdgP3UgDcTeUvvfTEwRvdYCs-Ln6lpdfVowkeUeYoB5TYtzCfcDIcU3j2o6bgs3G4kAkui6-Suq5BrnTEYJlO7Rre5D-TfqgNU-nkVRO3IyERQt_n8vNajvQrIzhzIndzIKzj1EDSU3wkyAV7u1A==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/177fbe94-821b-4b1a-bca2-fdd0a2763686", "https://www.globenewswire.com/Tracker?data=5cyyKjEPebclF1WEziWCn3z-ndhlhIezd_YAVR4zmqLWflaYuvp4fHGcNg-4HU1VdjrAn2t0W3J4bAXq5IXN4PBwE2V9v5vubv8rNkqVR6uWbNzxXIOpObYvCKp2GQATpMCbjtQCnuwfKE9o6HW60Q==", "https://www.globenewswire.com/Tracker?data=UgJw_JWb19WRrwRGIPrhZIRSv-mGLkhAPaWp2QeDF8dGlDUZU_CFP46_SPyiYX8yH9OWsMOXlXs8IYw_UbK68Hw-mdc4YwPTU5GEOmL6hFg=", "https://www.globenewswire.com/Tracker?data=F86_n-kFwLUO-afXGEBF3CYP31jpeb1UcIEWZ8VWzPNjnSaWpDUyIvU8Uv9V9Ro0s73BLgA6P2Ci79ajZWd3H9x5ISKQvf9k38uNuCQJApkvhuH4YamzNjbTbY3iGVELQPWwdAE7p9-rgALSxNuEsHTuGhH4XotTHt8pE30d7G_9VKvWcWQWbuPIjdEc9q9IyO81vxzHNR3Iw6a_98ki-FvNmfd9EtAMbwprp6QKe1WkfShvY7sRPFP79oPl6LucwXbS0UneBqtmGxsFLSXxgw=="], "published": "2018-01-30T17:30:00.000+02:00", "crawled": "2018-01-30T18:47:23.008+02:00", "highlightTitle": ""}