{"organizations": [], "uuid": "c40c4f1f05a9930b7af1b297496ce3318f82f339", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225329458&w=1200&r=LYNXMPEE0P02Y", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-walmart-rakuten/walmart-to-launch-online-grocery-delivery-in-japan-in-deal-with-rakuten-idUSKBN1FF05H", "country": "US", "domain_rank": 408, "title": "Walmart to launch online grocery delivery in Japan in deal with Rakuten", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T03:25:00.000+02:00", "replies_count": 0, "uuid": "c40c4f1f05a9930b7af1b297496ce3318f82f339"}, "author": "", "url": "https://www.reuters.com/article/us-walmart-rakuten/walmart-to-launch-online-grocery-delivery-in-japan-in-deal-with-rakuten-idUSKBN1FF05H", "ord_in_thread": 0, "title": "Walmart to launch online grocery delivery in Japan in deal with Rakuten", "locations": [], "entities": {"persons": [{"name": "japa", "sentiment": "negative"}, {"name": "seiyu gk", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "rakuten", "sentiment": "negative"}, {"name": "walmart", "sentiment": "negative"}, {"name": "rakuten inc", "sentiment": "none"}, {"name": "wal-mart stores inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "rakuten nandita bose", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 1:26 AM / Updated 7 hours ago Walmart to launch online grocery delivery in Japan in deal with Rakuten Nandita Bose , Sam Nussey 4 Min Read \nNEW YORK/TOKYO (Reuters) - Walmart has struck a partnership with e-commerce firm Rakuten Inc to launch an online grocery delivery service in Japan, its latest effort to forge an alliance with a popular homegrown chain to crack a competitive market. \nThe world’s largest retailer, Wal-Mart Stores Inc, said on Thursday the service will launch in the latter half of 2018. \nWalmart’s leadership is looking for new ways to grow its international business, which is no longer the growth engine it once was, as it has grappled with economic woes in Brazil and competition from discount retailers in Britain. \nIn Japan, the new service will replace Walmart’s existing online grocery delivery offering and will be called “Rakuten Seiyu Netsuper.” Seiyu GK is the name of Walmart’s wholly-owned Japanese unit. \nIt will allow customers to place an order on Rakuten’s online marketplace platform, which will then be fulfilled by the Walmart-Rakuten joint venture. Walmart-Rakuten will open a warehouse to service these orders in addition to using Seiyu stores, the companies said. \nFresh food delivery has been around in Japan for decades but has lagged the growth seen in other areas of e-commerce. Amazon is trialing its “Fresh” service in parts of Tokyo and retailers are trying to beef up their online grocery services. \nSeven and i Holdings Co Ltd, operator of Japan’s largest chain of convenience stores, last year announced it would cooperate on fresh food delivery with Askul Corp. \nRakuten CEO Hiroshi Mikitani told reporters in Tokyo he hoped the joint effort could lead to cooperation in other areas. \n“We would like to have an alliance in a broader sense, not just in Japan but for our global businesses,” he said. \nRakuten’s overseas operations include the United States and Europe. And last month it announced it was aiming to become Japan’s fourth major wireless carrier, potentially binding users to its wide range of services. The logo of Walmart store is pictured in Rio de Janeiro, Brazil January 22, 2018. REUTERS/Ricardo Moraes - RC1845D40460 \nRakuten’s shares closed up 4.5 percent, paring much of this month’s losses. \nIn 2016, Walmart applied a similar strategy in China to that announced on Friday after struggling to grow its e-commerce business by itself. \nThe U.S. retailer sold its own website to JD.com, the second largest Chinese e-commerce company, and picked up a 5 percent stake in JD.com instead. JD.com is preparing to enter the United States by the end of this year, Bloomberg News reported on Thursday. \nInvestment into online grocery services are picking up steam, with Amazon.com Inc buying Whole Foods Market Inc for $13.7 billion last year. \nAlibaba Group Holding Ltd and U.S. grocer Kroger Co have had early discussions on working together, a source familiar with the matter said. \nIn South Korea Shinsegae and affiliate E-Mart said they were set to gain $940 million in funding from private equity firms, helping to capitalise on a surge in supermarket chain E-Mart’s popularity due to its quick delivery of fresh products. \nWalmart is trying to shake up its international business. It recently appointed a top executive to lead its overseas unit and is in talks to sell a stake in its Brazilian operations. \nThe Japanese deal builds on Walmart’s online grocery delivery efforts in the United States. The retailer is testing grocery home delivery with companies such as Uber, Lyft and Deliv and offers online grocery pick-up at more than 1,100 stores. \nThe partnership will allow Walmart to sell 6 million e-books and audiobooks offered by Rakuten’s Kobo brand in the United States, giving the retailer a foothold into what has traditionally been a market dominated by Amazon.com Inc. \n“We are adding an entirely new category to our U.S. assortment,” Scott Hilton, Walmart’s chief revenue officer for the U.S. e-commerce business, said in a blog post. \nThe titles will include everything from New York Times best-sellers to children’s books and will be offered through a new Walmart-Kobo app, Michael Tamblyn, Rakuten Kobo Chief Executive Officer, told Reuters in an interview. Reporting by Nandita Bose in New York and Sam Nussey in Tokyo, Editing by Rosalba O'Brien, Malcolm Foster and Jacqueline Wong", "external_links": [], "published": "2018-01-26T03:25:00.000+02:00", "crawled": "2018-01-26T03:34:22.024+02:00", "highlightTitle": ""}