{"organizations": [], "uuid": "560bae83fde2ec9f93dae46fc08119c922068e86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 2446, "shares": 2446, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222866606&w=1200&r=LYNXMPEE0G1ZO", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-usa-trump-fitness/exclusive-exercise-i-get-more-than-people-think-trump-says-idUSKBN1F633B", "country": "US", "domain_rank": 408, "title": "Exclusive: Exercise? I get more than people think, Trump says", "performance_score": 10, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T01:02:00.000+02:00", "replies_count": 0, "uuid": "560bae83fde2ec9f93dae46fc08119c922068e86"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-fitness/exclusive-exercise-i-get-more-than-people-think-trump-says-idUSKBN1F633B", "ord_in_thread": 0, "title": "Exclusive: Exercise? I get more than people think, Trump says", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "steve holland", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ronny jackson", "sentiment": "none"}, {"name": "jeff mason", "sentiment": "none"}, {"name": "jackson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "oval office", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 11:39 PM / Updated 12 hours ago Exclusive: Exercise? I get more than people think, Trump says Jeff Mason , Steve Holland 3 Min Read \nWASHINGTON (Reuters) - Do not expect U.S. President Donald Trump to hit the gym, despite his doctor’s orders. \nHe gets plenty of exercise on the golf course and at the White House complex, the president told Reuters on Wednesday. \n“I get exercise. I mean I walk, I this, I that,” Trump, 71, said during an Oval Office interview. “I run over to a building next door. I get more exercise than people think.” \nDr. Ronny Jackson, the White House physician, said on Tuesday that Trump was in excellent health overall but needed to lose weight, eat better, and break a sweat more often. \nThe fast-food-loving Trump praised Jackson, who has served as a physician to previous presidents, but seemed wary of taking the not-so-subtle suggestion to use the White House’s exercise facilities. \n“A lot of people go to the gym and they’ll work out for two hours and all. I’ve seen people ... then they get their new knees when they’re 55 years old and they get their new hips and they do all those things. I don’t have those problems,” Trump said. \nHe did say he was open to changing his diet, perhaps with smaller portion sizes on White House meals. \nTrump’s predecessors, Democrat Barack Obama and Republican George W. Bush, were fitness enthusiasts, but Trump has no daily workout routine. He gets exercise by playing golf, he said, even though he typically rides around the course in a golf cart. \nWalking would leave him on the course longer than he prefers, he said. “I don’t want to spend the time.” \nTrump is considered overweight and borderline obese at 6 feet 3 inches (1.9 meters) tall and 239 pounds (108 kg). \n“Most of us could lose a couple of pounds,” he said, before scanning the Reuters reporters in the room and pronouncing them in “pretty good shape.” \nAs for his mental acuity, Trump was quick to note his doctor’s pronouncement that he aced a cognitive exam, which he referenced with a dig at predecessors Obama, Bush and Bill Clinton for not doing more to curb threats from North Korea. \n“I guess they all realized they’re going to have to leave it to a president that scored the highest on tests. What can I tell you?” he said. \nHe said he had impressed medical staff with his recent performance on a treadmill, regular workouts or not. \n“I was on a treadmill for the first time actually in quite a while, and it was at a very steep angle, and I was there for a very long time,” he said. “They were surprised. And they said, ‘Well you can stop now, that’s amazing.’ And I said, ‘I can go much longer than this if you want me to.'” \nTrump said he had dieted successfully before. \n“I’ve always been more of a believer in diet ‘cause I‘m strong, you know? I hit the ball far. I mean, I‘m strong, physically,” he said. \n“The people that do the food at the White House are extraordinary, but I think they can maybe make the portions a little bit smaller and maybe we’ll cut out some of the more fattening ingredients,” he said. “And I‘m OK with that.” Reporting by Jeff Mason and Steve Holland; Editing by Howard Goller and Christian Schmollinger", "external_links": [], "published": "2018-01-18T01:02:00.000+02:00", "crawled": "2018-01-18T01:54:33.037+02:00", "highlightTitle": ""}