{"organizations": [], "uuid": "46e1b70950a6170423b9eeaf7ceb433dc121a1fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/22/104484861-RTX371GL.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/15/ceo-jim-hackett-is-confident-ford-isnt-falling-behind-rival-automakers-and-tech-firms.html", "country": "US", "domain_rank": 767, "title": "CEO Jim Hackett is confident Ford isn't falling behind rival automakers and tech firms", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-15T20:28:00.000+02:00", "replies_count": 0, "uuid": "46e1b70950a6170423b9eeaf7ceb433dc121a1fd"}, "author": "Phil Lebeau", "url": "https://www.cnbc.com/2018/01/15/ceo-jim-hackett-is-confident-ford-isnt-falling-behind-rival-automakers-and-tech-firms.html", "ord_in_thread": 0, "title": "CEO Jim Hackett is confident Ford isn't falling behind rival automakers and tech firms", "locations": [], "entities": {"persons": [{"name": "jim hackett", "sentiment": "positive"}, {"name": "hackett", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "ford", "sentiment": "positive"}, {"name": "north american international auto show", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ford CEO Jim Hackett has a message for those who think the automaker is falling behind other automakers or tech firms when it comes to developing self-driving cars and mobility services: Relax.\n\"I am saying that Ford has nothing to worry about in terms of lagging there. Our technology is exceptional,\" Hackett told CNBC at the North American International Auto Show in Detroit.\nHackett's optimism comes at a time when the industry is racing to develop autonomous-drive and electric vehicles.\nTo keep up with the expected growth in demand for EV's, Ford says it will boost its investment in electric vehicles from $4.5 billion by 2020 to $11 billion by 2022. That investment will help the automaker expand its line-up of gas-electric hybrid vehicles and fully electric models.\nMeanwhile, Hackett believes his push to make Ford a leader in new mobility projects will bear fruit in the next few years as the automaker partners with a slew of companies ranging from Domino's to Postmates.\n\"We believe the markets for autonomous in the future is for both moving people and moving goods,\" Hackett said. \"It is not clear which one is going to be the biggest. So, Ford's strategy here is to have a platform that can do both really well.\"\nBoth long-time rival General Motors and a newfound competitor, Alphabet's Waymo, both announcing plans to start self-driving ride-hailing companies. But when asked when will Ford have a concrete product or service involving autonomous-drive vehicles to show investors, Hackett would not put a date on it but is optimistic it will impress.\n\"The technology is going to wow people. It is going to prove the promise that we are talking about,\" Hackett said.\nAs for the question of when Ford will make money on self-driving cars or mobility services, Hackett said investors need to be patient.\n\"The revenue is going to be deminimus early,\" he said.\nQuestions? Comments? BehindTheWheel@cnbc.com .", "external_links": [], "published": "2018-01-15T20:28:00.000+02:00", "crawled": "2018-01-15T20:28:30.049+02:00", "highlightTitle": ""}