{"organizations": [], "uuid": "7afa7091d254f7be35b5b6a3380bc317acef3674", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-conterra-to-acquire-gulf-coast-regional-fiber-optic-providers.html", "country": "US", "domain_rank": 767, "title": "Conterra To Acquire Gulf Coast Regional Fiber-Optic Providers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:00:00.000+02:00", "replies_count": 0, "uuid": "7afa7091d254f7be35b5b6a3380bc317acef3674"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-conterra-to-acquire-gulf-coast-regional-fiber-optic-providers.html", "ord_in_thread": 0, "title": "Conterra To Acquire Gulf Coast Regional Fiber-Optic Providers", "locations": [], "entities": {"persons": [{"name": "conterra", "sentiment": "none"}, {"name": "steve leeolou", "sentiment": "none"}], "locations": [{"name": "charlotte", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}, {"name": "mississippi", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "sun america", "sentiment": "none"}, {"name": "louisiana", "sentiment": "none"}, {"name": "gulf coast/east texas", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}], "organizations": [{"name": "conterra to acquire gulf coast regional", "sentiment": "negative"}, {"name": "conterra ultra broadband holdings, inc.", "sentiment": "neutral"}, {"name": "nusa", "sentiment": "none"}, {"name": "detel communications", "sentiment": "none"}, {"name": "network usa, llc", "sentiment": "none"}, {"name": "conterra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLOTTE, N.C., Jan. 29, 2018 /PRNewswire/ -- Conterra Ultra Broadband Holdings, Inc. (\"Conterra\") today announced the signing of an agreement to acquire affiliated companies, Network USA, LLC and Sun America, LLC (combined, \"NUSA\"), both Louisiana-based regional fiber-optic network services businesses.\nThis transaction will increase Conterra's fiber presence by nearly 3,000 miles in two of its largest operating states, Louisiana and Texas, expanding its regional fiber footprint throughout the Gulf Coast/East Texas region and providing entry into two new states: Arkansas and Mississippi. The NUSA fiber network is complementary to the assets of Conterra's previously announced acquisition of Detel Communications, another significant Louisiana-based fiber-optic network services provider.\n\"This is another important competitive enhancement for Conterra as we densify our infrastructure in existing commercial markets and increase our fiber network connectivity and regional service offerings,\" commented Conterra's Chairman and Chief Executive Officer, Steve Leeolou. \"This acquisition will connect and expand Conterra's existing networks in the Gulf Coast/East Texas region, while simultaneously adding management, operational and product portfolio depth in dozens of communities in this part of the country,\" added Mr. Leeolou.\nNetwork USA is a rapidly growing builder, owner and operator of facilities-based lit and dark fiber primarily in Louisiana and Texas with a successful operating history of nearly two decades. NUSA serves the same industry customer segments as Conterra: wireless and landline carriers, healthcare organizations, government and mid-sized as well as Fortune 500 enterprises.\n\"Our team is really excited to become part of Conterra. Our service area in Louisiana and East Texas is a great strategic fit and our fiber assets in Arkansas and Mississippi will provide Conterra immediate access to new markets,\" said James Davis Network USA's president. \"The combined network assets of our two organizations will significantly benefit our existing customers by enabling new technical capabilities and opening new growth opportunities including alternative transport options for wholesale carriers,\" noted Mr. Davis.\nConterra is one of the largest remaining independent broadband infrastructure companies in the United States based on its fiber assets and revenues. The company is majority owned by Court Square Capital Partners, a private investment firm with approximately $6 billion under management, with the remaining ownership largely held by Conterra's management team. The company's other institutional financial partners include Toronto Dominion Bank, CoBank, Bank of America and ING Capital. Terms of the transaction, which is subject to pending regulatory approvals, are not being disclosed.\nView original content with multimedia: http://www.prnewswire.com/news-releases/conterra-to-acquire-gulf-coast-regional-fiber-optic-providers-300588421.html\nSOURCE Conterra Ultra Broadband Holdings, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/conterra-to-acquire-gulf-coast-regional-fiber-optic-providers-300588421.html"], "published": "2018-01-29T16:00:00.000+02:00", "crawled": "2018-01-29T17:35:53.009+02:00", "highlightTitle": ""}