{"organizations": [], "uuid": "f4b995c640feb7fa2b9f116b8fc70e41bb39a5af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/privateequity-loans/lpc-private-equity-firms-target-digitisaton-in-2018-idUSL8N1P556U", "country": "US", "domain_rank": 408, "title": "REFILE-LPC-Private equity firms target digitisaton in 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.943, "site_type": "news", "published": "2018-01-11T20:20:00.000+02:00", "replies_count": 0, "uuid": "f4b995c640feb7fa2b9f116b8fc70e41bb39a5af"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/privateequity-loans/lpc-private-equity-firms-target-digitisaton-in-2018-idUSL8N1P556U", "ord_in_thread": 0, "title": "REFILE-LPC-Private equity firms target digitisaton in 2018", "locations": [], "entities": {"persons": [{"name": "max bower", "sentiment": "negative"}, {"name": "cathrin petty", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "apax partners", "sentiment": "negative"}, {"name": "cvc", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Refiles to clarify France-based Apax Partners in para 6)\nBy Max Bower\nJan 11 (Reuters) - Private equity firms are looking at digitisation as a key way of adding value to traditional businesses and are using technology to streamline their own systems to stay competitive against cash-rich trade buyers as returns continue to be squeezed.\nFaced with the ‘Amazon effect’ that has wrought carnage in the retail sector and threatens to spread everywhere from pharmaceuticals to home security, many sponsors are accepting that new acquisitions, existing portfolio companies and even their own operations need bringing up to date.\n“In a recent buyout, after the CEO and CFO the next most important person we focused on placing at the company was a Chief Information Officer,” said Cathrin Petty, European head of healthcare at CVC.\nPrivate equity firms are looking at digitisation as a new way of creating value in portfolio companies in contrast to their traditional turnaround skills, and are helping companies to become ‘tech enabled’ rather than transforming them into pure-play technology companies.\nApax digitised French camping group Sandaya’s product offering after assessing its vulnerability to rivals such as booking.com and built an app that allows direct interaction between customers and the company.\n“You still have to buy campsites at 10 plus times but you need better value creation strategies, and digital is at its core. We wanted to feed a constant one-to-one with our customers instead of with tour operators,” Eddie Misrahi, CEO of France-based Apax Partners said.\nRide hailing company Uber has profited by exploiting technological capabilities but is not a technology company in the strictest sense, Elias Korosis, a partner at Hermes GPE said.\n“Technology is an enabler, it runs through companies. Businesses that leverage technology will do well,” he says.\nEQT introduced technology to one of its portfolio companies, pest control firm Anticimex, that allowed sales representatives to know exactly when and where rats are on clients’ premises, which helps to tailor products to each customer.\n“Average sales at the firm have gone up 83%,” said Sven Tornkvist, head of digital business development at EQT.\nBUSINESS TRANSLATORS KEY Buyout firms have hired large numbers of tech specialists -- such as Tornkvist who was previously Sweden country manager at Google in Sweden -- while narrowing the range of industries each investment professional analyses. Some sponsors, such as EQT, are even using artificial intelligence (AI) to algorithmically source and evaluate prospective assets.\n“In the last 15 years, firms have found the need to get ever deeper expertise in each sector,” said Scott Sperling, co-president of Thomas H. Lee Partners. “Many of them have developed teams whose life is just their sector and focus solely on technological operations and improvements.”\nPrivate equity firms are hiring ‘business translators’ – employees whose skills bridge the disciplines of IT, data and business decision making. Demand for these employees is expected to increase to 4m in the US alone over the next decade, according to McKinsey’s global institute forecast.\nApax Partners is using digital technology to source assets, increase productivity and improve customer relations and the firm has targeted the management teams of the top 5,000 French companies through social networks to advertise services.\n“For productivity, we haven’t gone over to artifical intelligence yet but we’re thinking about it – we’re building a proprietary database, the first step to AI, and with qualitative data also, to help spot patterns,” Misrahi said.\nINTERNET OF THINGS The internet of things, which connects devices through online networks and allows them to ‘talk’ to each other, is expected to be another game-changer for the private equity industry and its bankers.\n“The internet of things is a big play here - whatever the market does will require connectivity at its core.” says Lincoln Jopp, COO at Disruptive Capital Finance.\nNumerous companies are looking to capitalize on the notable disruption already occuring in the auto industry, including UK-headquartered Tantalum, which is looking to partner with manufacturers to connect cars to its online platform Pay.Car, built by German software firm SAP.\nThe system allows drivers to pay for parking per minute or automatically fill in a first notice of loss form with an insurer in case of an accident.\n“Large manufacturers are brilliant at building cars, but not so great at software so we see a big opportunity for working with them there,” said Jopp.\nWhile digitising companies sounds simple, the reality can be complex and laborious, especially given multiple legacy operating systems in most industries. Private equity firms are now bringing software engineering back in house to make companies agile again after most outsourced their IT and product management in the ‘90s.\n“Often if you want to revolutionise a company’s customer interface you have to do open-heart surgery on its IT systems.” said Simon Patterson, managing director at Silver Lake Partners.\nTRANSFORMATIVE CHANGE Sponsors pitching digital investment or transformation to companies also need to practice what they preach. Reporting requirements particularly have risen as the industry has matured, due to investors demands and regulation.\n“We realised we couldn’t pitch investing in digital to our assets until we did it ourselves at EQT,” Tornkvist said. “We’ve completely changed our IT in the last two years.”\nInnovation within private equity firms stretches beyond AI management systems to the General Partner-Limited Partner relationship, which is ripe for transformation, in a move that could democratise the asset class, which is still seen as alternative and opaque.\nApera Capital for example has partnered with business services software firm Black Mountain to move much of its investor interaction to a cloud-based platform containing investment information, according to Rob Shaw, Apera’s CFO. Apera has also linked its administrative and fund accounting system to Black Mountain’s platform, which gives LPs further visibility on their investment.\n“Transparency has been a big obstacle to individuals accessing GPs,” says Eileen Duff, managing partner at iCapital Network. “But now GPs are increasingly using technology to reach individuals themselves.”\nEditing by Tessa Walsh\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T20:20:00.000+02:00", "crawled": "2018-01-13T14:51:10.000+02:00", "highlightTitle": ""}