{"organizations": [], "uuid": "2d50497f4ec0b4b26f27922575e86f0cb18b8cde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223371819&w=1200&r=LYNXMPEE0I0W8", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-usa-cftc-bitcoin/u-s-derivatives-regulator-files-suits-against-three-virtual-currency-operators-idUSKBN1F81K9", "country": "US", "domain_rank": 408, "title": "U.S. CFTC sues three virtual currency operators for fraud", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-19T21:45:00.000+02:00", "replies_count": 0, "uuid": "2d50497f4ec0b4b26f27922575e86f0cb18b8cde"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-cftc-bitcoin/u-s-derivatives-regulator-files-suits-against-three-virtual-currency-operators-idUSKBN1F81K9", "ord_in_thread": 0, "title": "U.S. CFTC sues three virtual currency operators for fraud", "locations": [], "entities": {"persons": [{"name": "dillon michael dean", "sentiment": "none"}, {"name": "patrick mcdonnell", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cftc", "sentiment": "negative"}, {"name": "entrepreneurs headquarters ltd", "sentiment": "none"}, {"name": "commodity futures trading commission", "sentiment": "none"}, {"name": "cabbagetech", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:45 PM / in 6 hours U.S. CFTC sues three virtual currency operators for fraud Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - The U.S. derivatives watchdog said on Friday that it has filed charges against three separate virtual currency operators alleging the defendants had defrauded customers and broken other commodity trading rules, in a further sign regulators globally are cracking down on the emerging asset class. \nThe lawsuits, filed by the Commodity Futures Trading Commission in a New York district court, come amid heightened fears globally over the risks that bitcoin and other virtual currencies may pose to investors and the global financial system. \nThe CFTC charged New York resident Patrick McDonnell and his company CabbageTech with stealing money from customers that he had solicited for providing virtual-currency trading and other services. \nIn the second case the CFTC alleged Dillon Michael Dean of Colorado and his UK-registered company Entrepreneurs Headquarters Ltd operated a Ponzi scheme in which he solicited $1.1 million in bitcoin from more than 600 investors, promising them that their cash would be pooled and invested. \nThe third case remained under seal as of Thursday night. \nMcDonnell and Dean could not be immediately reached for comment on Friday via their company websites, which appeared to have been taken down. \nThe enforcement actions are the first by the CFTC since it allowed the launch of bitcoin futures in December, sparking criticism from some on Wall Street that the agency should have sought wider industry feedback ahead of the move. \nGovernments around the world are debating how to address risks posed by virtual currencies. South Korea, Japan and China all made noises in recent weeks about a regulatory crackdown while France and Germany will make joint proposals to regulate bitcoin at the next summit of the G20 group of major economies in March. \nThe CFTC and Securities and Exchange Commission this month warned investors about risks posed by virtual currency operators and have both been increasing their jurisdiction over the cryptocurrency market, which has no overriding federal regulator. \nOn Thursday they issued a joint statement saying both agencies would ”continue to address violations and to bring actions to stop and prevent fraud in the offer and sale of digital instruments.” Reporting by Michelle PriceEditing by Chizu Nomiyama", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T21:45:00.000+02:00", "crawled": "2018-01-19T20:13:32.012+02:00", "highlightTitle": ""}